{"Lee Hsien Loong is the eldest son of Lee Kuan Yew, Singapore's first Prime Minister.": [{"url": "https://www.britannica.com/biography/Lee-Hsien-Loong", "page_content": "father Lee Kuan Yew ...(Show more)\n\nLee Hsien Loong, (born February 10, 1952, Singapore), Singaporean politician who was the third prime minister of Singapore (2004– ).\n\nLee was born and raised in Singapore, the son of Lee Kuan Yew, the city-state’s first prime minister (1959–90). Lee distinguished himself academically, studying mathematics and graduating with a first-class degree (1974) from the University of Cambridge before earning a master’s degree (1980) in public administration from Harvard University’s Kennedy School of Government. He then became an officer in the Singaporean military, eventually rising to the rank of brigadier general.\n\nLee’s political career began in 1984 when he joined his father’s party, the ruling People’s Action Party. Later that year he was elected to Parliament and was also appointed minister of state in both the Ministry of Trade and Industry and the Ministry of Defense. In 1985 he chaired the Economic Committee, which recommended a large tax reduction and the implementation of a consumption tax. A year later he was elected to his party’s Central Executive Committee, and in 1987 he became minister for trade and industry and second minister of defense. Lee assumed the position of deputy prime minister immediately upon the ascension of his father’s successor as prime minister, Goh Chok Tong, in 1990. Lee was treated for lymphoma in the early 1990s. The cancer ultimately went into remission, and he made a vigorous return to political life, serving as chairman of the Monetary Authority of Singapore (1998–2004) and as finance minister (2001–07).\n\nOn August 12, 2004, Lee assumed office as prime minister of Singapore, replacing the outgoing Goh. The transition had been planned and occurred without an election. Lee’s father was appointed to the newly created cabinet post of “minister mentor,” and Goh remained as the senior cabinet member; both men resigned from the cabinet in 2011. In addition, Lee’s wife, Ho Ching, served as executive director of the government-run investment firm Temasek Holdings, which owned stakes in some of Singapore’s largest companies. The cabinet included for the first time two female ministers of state; it was made up primarily of appointees who had been reassigned from other ministry posts.\n\nWhile observers expected Lee to retain tight control over the prosperous city-state, he appeared sensitive to the desire among many Singaporeans for a more open society. He promised to permit greater freedoms in a country where rigid social policies and limits on political expression were strictly enforced. Revised guidelines on free speech were announced shortly after Lee was sworn in, but while certain restrictions were eased—licenses for indoor political meetings were no longer required, for example—many remained intact. During his tenure as prime minister, Lee was subject to charges of nepotism and corruption and, as had his father, took a number of his detractors to court for libel. Though he was successful in such legal proceedings, he drew disapprobation over what was perceived internationally as the suppression of free speech.\n\nLee championed the legalization of gambling in 2005, attracting significant foreign investment in the development of casino facilities. His 2006 economic package disbursed a portion of the large budget surplus as a bonus to citizens and channeled money to health care, education, and housing programs. Even greater attention was paid to those programs after the 2011 parliamentary elections, when opposition candidates made an unexpectedly strong showing. Notable was the creation of a compulsory health care insurance plan, which was to go into effect by the end of 2015.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn 2007 a large salary increase received by Lee and other ministers brought widespread criticism. In response, Lee promised to donate a significant portion of his earnings to charity and to voluntarily subject himself to a salary freeze. Continued criticism of the high salaries, however, prompted the government in 2012 to cut the pay of ministers (including the prime minister) by about one-third and that of Singapore’s president by half."}, {"url": "https://www.reuters.com/article/us-singapore-politics-feud-explainer-idUSKBN23V0BT", "page_content": "SINGAPORE (Reuters) - A public rift between the heirs of Lee Kuan Yew, Singapore’s modern day founder, has shot to the fore with the prospect of his two sons squaring off at a July 10 general election.\n\nFILE PHOTO: Singapore's Prime Minister Lee Hsien Loong is seen during a live-broadcast national address, in Singapore, June 23, 2020. Ministry Of Communications And Information/Prime Minister's Office\n\nLee Hsien Yang on Wednesday formally joined a new opposition party competing against his brother Lee Hsien Loong’s People’s Action Party, which has ruled the city-state since its independence since 1965.\n\nThe move comes amid a long-standing and bitter dispute between the siblings centred around what to do with their late father’s house - demolish it, or let the government decide whether to make it a heritage landmark.\n\nOn one side of the dispute stands the eldest son, Prime Minister Lee Hsien Loong, 68, who believes the government must decide what should be done.\n\nOn the other are his siblings - Lee Hsien Yang and his sister Lee Wei Ling.\n\nThey say their father’s will stated the house should eventually be demolished after his death and they have accused Prime Minister Lee of wanting to preserve the house to build his own political capital.\n\n“His popularity is inextricably linked to Lee Kuan Yew’s legacy,” they said in a 2017 statement.\n\nPrime Minister Lee has said his father was prepared to consider alternatives for the property if the government decided to gazette the site and that he has recused himself from government discussions on the matter.\n\nLee Hsien Yang last year said the PAP had “lost its way” and threw his support behind the newly-formed Progress Singapore Party, led by a former PAP lawmaker.\n\nWhile he officially joined the party on Wednesday, he has not confirmed if he will run as a candidate in the upcoming poll. The deadline for nominations is June 30.\n\nTHE HOUSE, MORE THAN JUST A HOME?\n\nLee Kuan Yew, popularly known as LKY, moved into the five-bedroom house at 38 Oxley Road in 1945. He led the country for three decades and it was from his home that his People’s Action Party, which has governed since independence and never seen its vote share drop below 60%, was conceived.\n\nA government panel set up to consider the future of the house said in a 2018 report that a future government should make the final decision. It laid out three options: preserving the house as a national monument, preserving part of it, or demolishing it.\n\nThe historic property was valued by estate agents at about S$24 million ($17 million) in 2017.\n\nThe family insists the feud is not about the money.\n\nWHO OWNS IT?\n\nThe house is owned by the younger brother, Hsien Yang, and his unmarried sister, Wei Ling, lives there. Nothing can happen to the house until she chooses to move out.\n\nPrime Minister Lee says his father bequeathed the property to him, and he later sold it to Hsien Yang at a fair market valuation. The proceeds were donated to charity.\n\nWHAT DID LKY WANT?\n\nLKY, who died in 2015, stated publicly that he wanted the house to be demolished as he did not like the idea of tourists visiting it and that it would cost a lot to preserve.\n\nHe also said so in his will, but added that if that could not happen, then he wanted it closed to everyone, except family and descendants.\n\nLee Hsien Yang’s wife, lawyer Lee Suet Fern, was earlier this year found guilty by a disciplinary tribunal of professional misconduct over her involvement in preparing his will.\n\nLee Suet Fern said she disagreed with the tribunal’s findings and would fight the allegations in court."}, {"url": "https://www.infoplease.com/encyclopedia/people/history/se-asia/lee-hsien-loong", "page_content": "lē shyĕn lo͞ong [ key\n\n, 1952–, prime minister of Singapore (2004–). The eldest son of Lee Kuan Yew , Singapore's first prime minister, Lee was educated at Cambridge and Harvard while also serving (beginning in 1974) in Singapore's armed forces. Retiring as a brigadier general in 1984, he was elected to parliament and became a member of the leadership of the People's Action party two years later. A cabinet member from 1987 and deputy prime minister from 1990, he became finance minister in 2001. In 2004 he succeeded the retiring Goh Chok Tong as prime minister.\n\nThe Columbia Electronic Encyclopedia, 6th ed. Copyright © 2023, Columbia University Press. All rights reserved.\n\nSee more Encyclopedia articles on: Southeast Asia History: Biographies"}, {"url": "https://marriedceleb.com/lee-hsien-yang", "page_content": "If you know the late Lee Kuan Yew, first Prime Minister of Singapore, then you probably know about his political legacy. During his tenure, Yew forged a system of meritocratic, highly effective and incorrupt government/civil service. But today, we will be talking about Yew's youngest child, Lee Hsien Yang.\n\nLee Hsien Yang\n\nLee Hsien Yang is a Singaporean business executive. He served as the former Chairman of the Civil Aviation Authority of Singapore (CAAS) from 2009 to 2018. Also, he was the Chief executive Officer of Singapore Telecommunications Limited (1995-2007).\n\nYang was born in 1957 in Singapore to a high-class political family. His exact birthdate is unavailable so as of 2019, Yang must be around 61-62 years old.\n\nEducation\n\nLee finished his secondary education at Catholic High School and pre-university education at National Junior College. Further, he received an award of the President's Scholarship and the Singapore Armed Forces Overseas Scholarship given by the Public Service Commission.\n\nMoreover, Yang graduated from Trinity College, Cambridge, with a double first in engineering science. Also, he has a Master of Science in management from Stanford University.\n\nParents-Lee Kuan Yew And Kwa Geok Choo\n\nLee Hsien Yang was born to parents Lee Kuan Yew and Kwa Geok Choo. His late father Yew, the first Prime Minister of Singapore, governed the country for three decades. Meanwhile, his mother Choo was a lawyer and the co-founder/partner of a law firm, Lee & Lee.\n\nImage: Lee Hsien Yang's parents, Lee Kuan Yew, and Kwa Geok Choo, Source: Kwa Kim Li\n\nSadly, Yew died of pneumonia on March 23, 2015, aged 91. Similarly, Choo died on October 2, 2010, following a long illness aged 89.\n\nYang's Brother Is The Current PM Of Singapore\n\nSeveral members of Lee Kuan Yew's family hold prominent positions in Singaporean society. Take Yang's older brother Lee Hsien Loong for example.\n\nImage: Lee Hsien Loong, third and current Prime Minister of Singapore, Source: TOC\n\nHe has been the Prime Minister of Singapore since 2004. He became the youngest Brigadier-General in Singaporean history after his promotion in July 1983.\n\nSister-Lee Wei Ling\n\nYang's older and middle sister, Lee Wei Ling is the head of the National Neuroscience Institute. The 64 years old doctor is also an author of a book called 'A Hakka Woman's Singapore Stories: My Life as a Daughter, Doctor, and Diehard Singaporean.'\n\nWife-Lim Suet Fern Is More Than Just A Lawyer\n\nYang and his longtime wife, Lee Suet Fern have been married for thirty-eight years as of 2019. The couple met when both were students at the University of Cambridge. The Lee couple married each other in 1981.\n\nImage: Lee Hsien Yang with his wife, Lee Suet Fern, Source: straitstimes.com\n\nFor your information, Yang's spouse, Fern is a lawyer and the daughter of economist Lim Chong Yah. Also, she is the founder and managing partner of Stamford Law Corporation. Further, Fern served as the former president of the Inter-Pacific Bar Association (IPBA).\n\nImage: Yang's wife, Lee Suet fern's Quilt has been featured in several festivals, Source: straitstimes.com\n\nRecently, Yang shared a post about his wife congratulating her for winning an award at the 2019 Yokohama Quilt Festival. Her quilts had been entered into International Quilt Festival Houston and the Tokyo International Great Quilt Festival.\n\nAnother powerful female is Lyudmila Putina, who is the former first lady and wife of the Russian President, Vladimir Putin.\n\nChildren\n\nThe Lee couple has three sons: Li Shengwu (1985), Li Huanwu (1986), and Li Shaowu (1995). Li Shengwu is currently working as Assistant Professor in Economics at Harvard University.\n\nTheir middle son, Li Huanwu came out as gay in July 2018. He married his partner, Heng Yirui, in South Africa on May 24, 2019.\n\nLee Hsien Yang Supports His Gay Son\n\nOn June 29, 2019, Yang attended \"Pink Dot,\" an annual event that started in 2009 in support of the LGBTQ community in Singapore.\n\nImage: From left to right, Yang's wife, their son and his partner, and Mr. Yang himself, Source: facebook\n\nLee was accompanied by his wife, Huanwu, and his husband, Yirui. When asked about the LGBTQ community, Lee said that he was happy for Li and Heng.\n\nNet Worth\n\nAbout Yang's net worth, there is rarely any information available. He hasn't revealed his actual salary, but by assumption, we can say that his net worth is over S$2 million. The primary source of his income mostly come through his profession as a business executive.\n\nImage: Lee Hsien Yang in his Office, Source: Yahoo News Singapore\n\nThroughout his career, Yang has served in the many vital positions and has made a stupendous fortune. He is the Non-Executive Independent Director of Rolls-Royce Holding PLC. Also, he worked as the chief executive of Singapore Telecommunications Limited for 12 years.\n\nAs the Non-Executive Independent Director of Rolls-Royce Plc, the total compensation of Hsien Lee at Rolls-Royce Plc is $74,000. Hence, we can say that he earned a desirable amount of income.\n\nKnow What Yang Said About His Brother's Ruling Party\n\nThe Singapore prime minister’s estranged brother has thrown his support behind a newly-formed opposition party in an intriguing twist ahead of elections expected to be held as soon as this year.\n\nthe ruling People’s Action Party (PAP) “is no longer the PAP of my father” and “has lost its way.” Due to his support to the opposition party, many politicians have assumed that Yang might stand as a candidate in the upcoming general elections.\n\nFeud Over 38 Oxley Road House\n\nLee and his sister, Lee Wei Ling, were deeply involved in a dispute in 2017 with their older brother Lee Hsien Loong. The two younger siblings said their brother had abused executive powers to block the demolition of a family home against the wishes of their late father.\n\nImage: Late Prime Minister, Lee Kuan Yew wished his house to be demolished after his death, Source: asia.nikkei.com\n\nThe historic property is estimated to be worth around S$24 million, according to estate agents. The century-old house at 38 Oxley Road with an estimated 12,060-square foot plot was the place of late Mr. Lee Kuan Yew since 1945.\n\nWhat will happen to the multi-million dollar House?\n\nAs per Yew's will, sources revealed that he had expressed his wish for the house to be torn down after his death. Also, the house was to be demolished when his daughter Ling no longer lives in it.\n\nImage: The future of nearly half a century home is uncertain, Source: WSJ\n\nLee Hsien Yang and sister Lee Wei Ling took to Facebook and shocked the country with accusations against their eldest brother Lee Hsien Loong, the prime minister.\n\nRecently on September 10, 2019, Dr. Lee Wei Ling through her Facebook, reminded that her father always wanted his house at 38 Oxley Road to be demolished. She also explained that she brought up the topic again because of the uncertainty concerning the demolishing of 38 Oxley Road.\n\nLee Siblings Turned Against Their Brother\n\nYang and his sister \"felt threatened by Lee Hsien Loong's misuse of his position and influence over the Singapore government and its agencies to drive his personal agenda.\" They alleged that their brother thwarted the will of their father to use the house as a monument to milk his father's legacy.\n\nImage: Younger siblings Yang and Ling accused their older brother, Loong of misusing his power, Source: mothership.sg\n\nA special parliamentary session was held to clear the Prime Minister of any wrongdoings, and the siblings agreed to keep the dispute private after the session.\n\nSingapore General Elections\n\nSingapore’s next General Election is set to take place on December 14, 2019. However, ruling party People's Action Party members and ministers are arguing over the limited time. Also, some sources report that Singapore’s next general election must be held by January 2021.\n\nDo follow Marriedceleb for exciting articles!!!"}, {"url": "https://www.ft.com/content/6313462e-cdc1-463b-8d1d-bd23be16b93a", "page_content": "What is included in my trial?\n\nDuring your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages.\n\nStandard Digital includes access to a wealth of global news, analysis and expert opinion. Premium Digital includes access to our premier business column, Lex, as well as 15 curated newsletters covering key business themes with original, in-depth reporting. For a full comparison of Standard and Premium Digital, click here.\n\nChange the plan you will roll onto at any time during your trial by visiting the “Settings & Account” section.\n\nWhat happens at the end of my trial?\n\nIf you do nothing, you will be auto-enrolled in our premium digital monthly subscription plan and retain complete access for S$95 per month.\n\nFor cost savings, you can change your plan at any time online in the “Settings & Account” section. If you’d like to retain your premium access and save 20%, you can opt to pay annually at the end of the trial.\n\nYou may also opt to downgrade to Standard Digital, a robust journalistic offering that fulfils many user’s needs. Compare Standard and Premium Digital here.\n\nAny changes made can be done at any time and will become effective at the end of the trial period, allowing you to retain full access for 4 weeks, even if you downgrade or cancel."}, {"url": "https://www.encyclopedia.com/people/history/southeast-asia-history-biographies/lee-hsien-loong", "page_content": "Lee Hsien Loong\n\nAfter a brilliant 13-year career in the Singapore Armed Forces Lee Hsien Loong (born 1952) was elected a member of Parliament for Teck Ghee in 1984, winning more than 80 percent of the vote. In October 1990 he became deputy prime minister to Goh Chok Tong.\n\nLee Hsien Loong, the eldest son of Singapore's former prime minister Lee Kuan Yew, was born in Singapore on February 10, 1952. Lee had an outstanding record as a student. He received his primary and secondary school education at the Catholic High School in Singapore, which required students to be proficient in both English and Mandarin. In addition to these two languages, he was proficient in Malay and had also studied Russian. He attended the National Junior College for his pre-university education and was awarded the president's scholarship in 1970 and the Singapore Armed Forces (SAF) scholarship in 1971 for his academic prowess.\n\nHe proceeded to Cambridge University to study mathematics. In 1974 he graduated with first-class honors in mathematics and was also awarded a diploma in computer science with distinction from the same university. In 1978 he attended the U.S. Army Command and General Staff Course at Fort Leavenworth in Kansas. One year later he was a Mason fellow at the Kennedy School of Government at Harvard University, where he received a Master of Public Administration degree in 1980.\n\nLee's connection with the army began in 1971, when he was awarded the SAF scholarship to study mathematics at Cambridge University. However, his military career did not begin until 1974 when he was assigned to an artillery division on his return to Singapore. His first major appointment in the SAF occurred in 1980, when he was made commanding officer of the Artillery Gun Battalion. After that he was promoted with astonishing speed to assistant chief of the General Staff (Operations) in 1981; to chief of staff of the General Staff in 1982; and to director, Joint Operations Planning Directorate with the rank of brigadier general in 1983. He was publicly commended for his role in coordinating the Sentosa cable car rescue operations in 1982. He was also credited for two achievements during his SAF career—the unification of the SAF's three services and the modernization of its weaponry. He resigned from the SAF on September 21, 1984. Following his election to Parliament as a member of the People's Action Party (PAP), he was appointed political secretary to the minister for defense by the prime minister.\n\nLee's rise within the PAP and government hierarchies was even more rapid. In January 1985 he was appointed as minister of state (MOS) in two key ministries: the Ministry of Defense (MINDEF) and the Ministry of Trade and Industry (MTI). As MOS in the MIT, Lee chaired the Economic Committee set up one month after his appointment to tackle the economic recession facing the country. The creation of the Economic Committee can be viewed as the beginning of the PAP government's consultative style of leadership, as Lee managed to obtain feedback and views on the causes of the recession as well as suggestions for ensuring economic recovery from about a thousand participants from both the public and private sectors in Singapore. The Economic Committee completed its report one year later, and its 12 recommendations enabled the government to deal successfully with the economic recession.\n\nIn February 1986, Lee was appointed acting minister for trade and industry and he also retained his MOS position in MINDEF. During the same year, he was made chairman of the newly created PAP Youth Wing. In January 1987, he was confirmed as minister for trade and industry and promoted to second minister for defense (services). Two years later, he was appointed as the second assistant secretary-general of the PAP's Central Executive Committee. Then, in October 1990, six years after he became an MP, he was appointed as one of the two deputy prime ministers with Ong Teng Cheong.\n\nGiven his outstanding performance in the army and his meteoric rise up the party and government hierarchies, it was not surprising that Lee was expected by most Singaporeans to succeed Goh Chok Tong as Singapore's third prime minister when Goh retired from the political scene. However, in November 1992 the government announced that Lee was diagnosed as suffering from an intermediate grade malignant lymphoma. After undergoing 18 weeks of chemotherapy, Lee's health improved as his doctors reported in April 1993 that there was \"no evidence of any residual disease.\" Lee's health remained stable and he kept his position as deputy prime minister. In the 1997 elections, the PAP won all but two of Singapore's 83 seats in Parliament; Lee and Goh remained in their governmental positions.\n\nFurther Reading\n\nLee Hsien Loong's speeches as minister for trade and industry and as deputy prime minister can be found in Speeches, which was published by the Ministry of Communications and Information until November 1990, and then by the Ministry of Information and the Arts from December 1990 onwards. His three most significant speeches are: \"Salary Revision for the Administrative, Professional, and Other Services\" (March 17, 1989); \"Core Principles of Government\" (1992); and \"Costs of Living and Medical Costs\" (Petir, October 1992). For more information on Singapore see Stella R. Quah and John S. T. Quah (compilers), Singapore (Oxford, 1988), which contains 764 annotated references; and Kernial S. Sandhu and Paul Wheatley (editors), Management of Success: The Moulding of Modern Singapore (Singapore: Institute of Southeast Asian Studies, 1989), which has over 40 chapters on various aspects of life in Singapore. □"}, {"url": "https://simple.wikipedia.org/wiki/Lee_Hsien_Loong", "page_content": "Lee Hsien Loong (b. 10 February 1952) is the current Prime Minister of Singapore. His father is Lee Kuan Yew, first Prime Minister of Singapore.\n\nLee Hsien Loong was born in Kandang Kerbau Hospital (presently known as KK Women's and Children's Hospital).[1][2] He is the first child of Lee Kuan Yew and Kwa Geok Choo.\n\nIn August 2004, Goh Chok Tong stepped down as Prime Minister, while Lee Hsien Loong took over the position. He then became the General Secretary of People's Action Party (PAP).\n\nBackground and education [ change | change source ]\n\nHis grandmother (father's side), Chua Jim Neo is a Hokkien Nyonya. His mother's ancestors are from Tong'an District, Xiamen, Fujian, China.\n\nStudied at Nanyang Primary School, Catholic High School and National Junior College.\n\nMilitary life [ change | change source ]\n\nIn 1971, Lee joined the Singapore Armed Forces (SAF). Lee was promoted to very high rank quickly in the Singapore Army. In July 1983, he became the youngest Brigadier General in Singapore. He left SAF in 1984.[3]\n\nEarly political life [ change | change source ]\n\nIn the 1980s, Lee Kuan Yew said he will step down as Prime Minister in 1984. Lee Hsien Loong was considered in the list of new leaders in PAP.\n\nIn 1984, at 32, He was elected an MP. His father immediately assigned him as a Minister of State for some ministries.\n\nIn 1987, he joined in the Cabinet as the Minister for Trade and Industry and Second Minister for Defence.\n\nFrom 2008 to 2012, Lee's salary is S$3.87 million every year.[4] He had a salary increase of 25%, it was originally S$3,091,200.[5]\n\nIn January 2012, his salary was reduced to S$2.2 million due to the public then complaining about his unfair salary. [6][7][8] But, he is still the prime minister with the highest salary in the world.[9]\n\nPersonal life [ change | change source ]"}, {"url": "https://asiatimes.com/2020/12/lee-family-still-just-cant-get-along-in-singapore/", "page_content": "SINGAPORE – When the fifth anniversary of the death of Singapore’s founding prime minister Lee Kuan Yew was observed earlier this year, his estranged children mourned apart. An acrimonious dispute among the siblings that began over the fate of their late father’s estate has not yet been put to rest and has since taken on political dimensions.\n\nRelated legal proceedings are set to be heard in 2021, including a defamation case brought by the late Lee’s eldest son, incumbent Prime Minister Lee Hsien Loong, 68, against a local news editor who repeated an allegation made by his younger brother Lee Hsien Yang and sister Lee Wei Ling, neither of whom the premier has sued directly.\n\nWith the prime minister now expected to retain power and push back a leadership transition that was set to happen by 2022 in order to see the nation through the Covid-19 crisis, it remains to be seen how a bitter family feud could play out in the final years of Lee’s litigious rule.\n\nUnprecedented public sparring between members of Singapore’s first family began in earnest in 2017 when the premier’s siblings accused him of abusing his executive powers to impede their efforts to demolish the family bungalow, a five-bedroom residence at 38 Oxley Road, as their elder statesmen father had wanted and stipulated in his will.\n\nThe Lee siblings alleged that their elder brother, who has served as prime minister since 2004, sought to preserve the house to further his own political capital. Moreover, they accused him of using “the organs of state” against them and grooming his son Li Hongyi to take up a future political role, allegations that the premier has adamantly denied.\n\nPolitical leaders in the wealthy city-state typically seek to protect their reputation through legal channels when serious accusations are leveled against them. Addressing the matter in Parliament, Lee said in 2017 that he refrained from suing his siblings to prevent his family name from being further besmirched, though he has vowed to take legal action if necessary.\n\nLee Hsien Yang on the campaign trail earlier this year. Photo: Nile Bowie/Asia Times\n\nThe prime minister’s siblings have continued to criticize their brother and raise governance-related accusations over social media. In June, Lee Hsien Yang, 63, officially joined the Progress Singapore Party (PSP), an electorally untested opposition party launched in 2019 to challenge the ruling People’s Action Party’s (PAP) six-decade grip on power.\n\nCasting himself as “a catalyst for change,” the younger Lee, a Cambridge and Stanford University graduate and former SingTel chief executive officer, denounced “dynastic politics” and opted not to stand as a candidate in the city-state’s July general election because, in his words, “Singapore does not need another Lee.”\n\nThe PAP ultimately prevailed at the polls, though its overall vote share dropped to 61.24%, its second-lowest showing on record. Lee Hsien Yang denies that that personal issues with his elder brother influenced his decision to join politics, though the optics of Lee Kuan Yew’s sons on opposing political sides plainly signaled a house divided.\n\nThe daughter-in-law and grandson of Singapore’s founding father have landed in legal trouble since the elder statesman’s passing. Lee Hsien Yang’s wife, Lee Suet Fern, 62, an international corporate lawyer, was found guilty of misconduct in preparing and executing Lee Kuan Yew’s final will in November by a Supreme Court disciplinary body.\n\nThe Court of Three Judges ruled that the prime minister’s sister-in-law be suspended from legal practice for 15 months for having misled the late Lee, a Cambridge-trained lawyer, into signing a new will at the urgent behest of her husband, one of its beneficiaries, without the advice of his usual lawyer who had prepared all six of his previous wills.\n\nAccording to the written judgment, which cannot be appealed, Lee Suet Fern’s “divided loyalties” presented a “potential conflict of interest” despite her having no solicitor-client relationship with her late father-in-law, a fact for which she was acquitted of charges of grossly improper conduct in the discharge of her professional duties.\n\nThe court found her guilty of lesser alternative charges of misconduct unbefitting a solicitor and advocate and ruled that, as a result of her involvement, Lee Kuan Yew had “ended up signing a document which was in fact not that which he had indicated he wished to sign”, although noting that the potential harm caused “could have been far more severe.”\n\nHis seventh and final will signed in December 2013 reintroduced a clause central to a long-running public feud between the siblings requesting that his 38 Oxley Road residence be demolished. The judges also accepted that the late Lee had previously changed his will several times and was ultimately content with the final version he signed.\n\nA view of former Prime Minister Lee Kuan Yew’s 38 Oxley Road residence in Singapore June 14, 2017. Photo: AFP\n\nIn a statement, Lee Suet Fern said she disagreed with the court’s findings and asserted that there was “no basis” for the case to have been initiated. “This was a private will,” she said. “Lee Kuan Yew knew what he wanted. He got what he wanted. The Court of Three did not find that he was of unsound mind or that he was not in control.”\n\nShe added that no complaint against her had ever been lodged by Lee Kuan Yew, his lawyer, or any of his beneficiaries. “This case arose from a complaint years later by the Attorney-General’s Chambers,” while the prime minister had made “extensive submissions, but did not present himself as a witness and was not subject to cross-examination.”\n\nLee Suet Fern added that probate, the legal process for a will to be accepted as a valid public document, for Lee Kuan Yew’s will had been granted by the courts in 2015. “Probate had been sought on the urging of Lee Hsien Loong and Lucien Wong,” then the premier’s personal lawyer, “before he became attorney-general” in 2017 amid the estate dispute.\n\nIn an immediate response to the verdict, Li Shengwu, who is Lee Suet Fern’s and Lee Hsien Yang’s son, wrote on Facebook that Singapore’s prime minister “has no shame about using state resources to settle grudges against relatives” and called on him to “resign now, rather than continuing to undermine the rule of law in Singapore.”\n\nLi Shengwu, a 35-year-old Harvard University economics professor, was found guilty of scandalizing Singapore’s judiciary in July and sentenced in absentia to a S$15,000 (US$11,200) fine after he wrote in a “friends-only” Facebook post in 2017 that the wealthy city-state’s government was “very litigious and has a pliant court system.”\n\nPrime Minister Lee addressed his family’s property dispute on the witness stand in court in late November when a defamation suit he brought against Terry Xu, chief editor of local news website The Online Citizen (TOC), went to trial over an allegedly libelous article based on claims made by his siblings in joint public statements and on Facebook.\n\nThe TOC article references a Facebook post by Lee Wei Ling in which she claimed that the premier misled their father into thinking that the family bungalow had been gazetted by the government as a heritage property, which in turn led the late Lee to remove the demolition clause from his fifth and sixth will. The house has never been gazetted.\n\nLee’s lawyer, Davinder Singh, argued that the article went beyond what the siblings had alleged, while Xu’s lawyer, Lim Tean, engaged in a lengthy back-and-forth with the premier while under cross-examination, during which he denied misleading his father and rebutted claims that he sought to preserve the house for political gain.\n\nTerry Xu faces defamation charges. Image: Facebook\n\n“Singaporeans know me. I have been in politics now since 1984, 36 years. I have been prime minister for 16 years and if I still depend on living in a particular house in order to exude a magic aura and overawe and impress the population, I think I am in a very sad state and Singapore would be in a very sad state,” said Lee during his witness testimony.\n\nA government panel set up to consider the fate of the historic property, where key meetings of first-generation PAP leaders were held in the 1950s, said in a 2018 report that a future government should make the final decision as to whether the house should be demolished or preserved, either partially or wholly, as a national monument.\n\nLee has recused himself from the government’s handling of the matter and sold his share of the property to his brother. During the hearing, the premier said his decision not to sue his siblings did not mean “carte blanche” for others to repeat their claims, which his lawyers characterized as having gravely injured his character and reputation.\n\nIn October 2019, Xu applied to bring the premier’s siblings into the suit as third parties, with the intention for them to bear damages if he was found liable for defamation. Xu’s lawyer confirmed in November that third-party involvement would be discontinued without citing a reason, thus ruling out the possibility of the Lee siblings testifying on the matter in court.\n\nLee is seeking damages from Xu including aggravated damages, an injunction to restrain him from publishing or disseminating the allegations, and costs. The trial is scheduled to resume in February. In a separate libel suit brought by Lee in his capacity as a private citizen, the premier is seeking S$150,000 ($110,000) in damages from activist blogger Leong Sze Hian.\n\nIn November 2018, Leong shared a news article by Malaysian website The Coverage on Facebook, posted with no accompanying caption, that falsely alleged Lee had helped former Malaysian prime minister Najib Razak launder money from the graft-plagued Malaysian state fund 1Malaysia Development Berhad (1MDB).\n\nLee chose to sue Leong even after he removed the post, which his legal counsel said he “in no way endorsed”, on the basis that “removal does not expunge the defamation.” When Leong launched a crowdfunding campaign in December of that year to raise funds for his legal defense, the first person to contribute was Lee Hsien Yang.\n\nSingapore Prime Minister Lee Hsien Loong has so far refrained from suing his siblings. Image: Agencies/File Photo\n\nAfter being questioned by Lim, who is also Leong’s lawyer, during cross-examination in October over why he chose to sue his client, who merely shared the article on Facebook as others had and was not its original author, the premier said he did so on the advice of his legal counsel. A verdict on the case is expected to be delivered by the High Court in early 2021.\n\nLim described the proceedings as “an abuse of the process”, while Singh, Lee’s lawyer, accused the defense of attacking the plaintiff and politicizing the case. “We are in Singapore, where there is an embedded culture, a set of values of political leadership which or where under Singaporeans come to expect that their leaders will sue if allegations are false. And if they don’t sue, they have to explain,” Singh told the court.\n\n“If there is any ‘embedded culture’ in operation regarding Terry Xu and Leong Sze Hian, it is to ‘kill the chicken to scare the monkey’,” said Michael Barr, an associate professor of international relations at Flinders University. “Bullying people into fearful silence is the main set of values on display in the current generation of political leaders.”\n\nCritics of the government and premier Lee will “see the lawsuits as another attempt to suppress dissent by members of the political establishment,” said Eugene Tan, an associate professor of law at Singapore Management University (SMU). “Singaporeans, by and large, do not find the lawsuits startling or inappropriate, but muse on whether a less muscular response can be used to protect the reputation of public figures.”\n\nIt is accepted in Singapore that political leaders will “sue in their private capacity for damages in respect of defamation in order to protect their reputation and integrity should they be defamed,” because the public might suspect that there may be some truth to the allegations if no legal action is taken, he added.\n\n“Public figures as well as that of private individuals…are equal before the law of defamation. In other words, a government leader does not forfeit his right to reputation merely because he has entered the political arena and can be expected to be closely scrutinized,” said Tan. “As such, defamatory remarks are met with robust legal action.”\n\nOn that basis, Barr argues that logically “Lee should and must sue his siblings” for libel. In November, Lee reiterated in court that he had dealt with their accusations in two ministerial statements and opened himself to questioning in Parliament on the matter. Though he has thus far refrained from suing his siblings, that “does not mean I will never do it,” said Lee.\n\nGrandchildren of Singapore’s former prime minister Lee Kuan Yew carry his portrait during a funeral procession at the University Cultural Center in Singapore on March 29, 2015. Photo: AFP/Adek Berry\n\n“I doubt that it will happen. I have trouble seeing what he would gain by taking such action,” said Barr. “But I can’t see what has been gained by taking action against Lee Suet Fern, so who knows? When family comes into the picture, reason tends to go out the window. This happens even in functional families, let alone in the Lee family.”\n\nGarry Rodan, an honorary professor at the University of Queensland’s School of Political Science and International Studies, said it is hard to predict whether Lee will bring his siblings to court. “If the prime minister did embark on legal actions against his siblings, it would demonstrate he is non-discriminatory in recourse to the courts to settle disputes.\n\n“However, this may not be the best note on which to approach the conclusion of his tenure as prime minister,” he added. “While there may be an ’embedded culture’ within the PAP that views litigation as essential to protect reputations, it is very questionable as to whether that view is shared by Singaporeans in general,” said Rodan.\n\n“I am not aware of any evidence whatsoever to support this claim. It sounds more like a rationalization of the obsession with litigation, the preferred modus operandi among PAP leaders, and an underestimation of the ability of Singaporeans to weigh up for themselves the merits of competing claims.”"}]}