{"Lee Hsien Loong is the Chairman of the Monetary Authority of Singapore.": [{"url": "https://www.pmo.gov.sg/The-Cabinet/Mr-LEE-Hsien-Loong", "page_content": "Mr Lee Hsien Loong has been Singapore’s Prime Minister since 2004.\n\nMr Lee is the Secretary-General of the People’s Action Party (PAP). He led PAP to four consecutive Singapore General Elections victories in 2006, 2011, 2015 and 2020. He was first elected Member of Parliament (MP) in 1984, and has been re-elected eight times, most recently as an MP for the Ang Mo Kio Group Representation Constituency.\n\nMr Lee also chairs GIC, Singapore’s sovereign wealth fund, and the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nAs Prime Minister, he launched SkillsFuture to support Singaporeans in embracing lifelong learning and skills, and the Smart Nation initiative to use technology to create a future of better living, more opportunities and stronger communities.\n\nBefore becoming Prime Minister, Mr Lee had held various Ministerial appointments, including being Deputy Prime Minister, Minister for Finance, Minister for Trade and Industry and Second Minister for Defence. He was concurrently the Chairman of the Monetary Authority of Singapore from 1998 until 2004.\n\nBefore joining politics, Mr Lee had served in the Singapore Armed Forces, retiring as a Brigadier-General.\n\nMr Lee graduated with a B.A. in Mathematics and a Diploma in Computer Science from the University of Cambridge. He was later a Mason Fellow at the Harvard Kennedy School, receiving a Master in Public Administration.\n\nMr Lee was born on 10 February 1952. He married Dr Wong Ming Yang in 1978, and was widowed in 1982. He remarried Ho Ching in 1985. He has one daughter and three sons.\n\nMr Lee enjoys reading, photography, walking, listening to classical music, and computer programming.\n\nBiodata"}, {"url": "https://www.britannica.com/biography/Lee-Hsien-Loong", "page_content": "father Lee Kuan Yew ...(Show more)\n\nLee Hsien Loong, (born February 10, 1952, Singapore), Singaporean politician who was the third prime minister of Singapore (2004– ).\n\nLee was born and raised in Singapore, the son of Lee Kuan Yew, the city-state’s first prime minister (1959–90). Lee distinguished himself academically, studying mathematics and graduating with a first-class degree (1974) from the University of Cambridge before earning a master’s degree (1980) in public administration from Harvard University’s Kennedy School of Government. He then became an officer in the Singaporean military, eventually rising to the rank of brigadier general.\n\nLee’s political career began in 1984 when he joined his father’s party, the ruling People’s Action Party. Later that year he was elected to Parliament and was also appointed minister of state in both the Ministry of Trade and Industry and the Ministry of Defense. In 1985 he chaired the Economic Committee, which recommended a large tax reduction and the implementation of a consumption tax. A year later he was elected to his party’s Central Executive Committee, and in 1987 he became minister for trade and industry and second minister of defense. Lee assumed the position of deputy prime minister immediately upon the ascension of his father’s successor as prime minister, Goh Chok Tong, in 1990. Lee was treated for lymphoma in the early 1990s. The cancer ultimately went into remission, and he made a vigorous return to political life, serving as chairman of the Monetary Authority of Singapore (1998–2004) and as finance minister (2001–07).\n\nOn August 12, 2004, Lee assumed office as prime minister of Singapore, replacing the outgoing Goh. The transition had been planned and occurred without an election. Lee’s father was appointed to the newly created cabinet post of “minister mentor,” and Goh remained as the senior cabinet member; both men resigned from the cabinet in 2011. In addition, Lee’s wife, Ho Ching, served as executive director of the government-run investment firm Temasek Holdings, which owned stakes in some of Singapore’s largest companies. The cabinet included for the first time two female ministers of state; it was made up primarily of appointees who had been reassigned from other ministry posts.\n\nWhile observers expected Lee to retain tight control over the prosperous city-state, he appeared sensitive to the desire among many Singaporeans for a more open society. He promised to permit greater freedoms in a country where rigid social policies and limits on political expression were strictly enforced. Revised guidelines on free speech were announced shortly after Lee was sworn in, but while certain restrictions were eased—licenses for indoor political meetings were no longer required, for example—many remained intact. During his tenure as prime minister, Lee was subject to charges of nepotism and corruption and, as had his father, took a number of his detractors to court for libel. Though he was successful in such legal proceedings, he drew disapprobation over what was perceived internationally as the suppression of free speech.\n\nLee championed the legalization of gambling in 2005, attracting significant foreign investment in the development of casino facilities. His 2006 economic package disbursed a portion of the large budget surplus as a bonus to citizens and channeled money to health care, education, and housing programs. Even greater attention was paid to those programs after the 2011 parliamentary elections, when opposition candidates made an unexpectedly strong showing. Notable was the creation of a compulsory health care insurance plan, which was to go into effect by the end of 2015.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn 2007 a large salary increase received by Lee and other ministers brought widespread criticism. In response, Lee promised to donate a significant portion of his earnings to charity and to voluntarily subject himself to a salary freeze. Continued criticism of the high salaries, however, prompted the government in 2012 to cut the pay of ministers (including the prime minister) by about one-third and that of Singapore’s president by half."}, {"url": "https://www.gic.com.sg/who-we-are/board-of-directors/lee-hsien-loong/", "page_content": "Chairman, GIC Board\n\nLee Hsien Loong has been Singapore’s Prime Minister since 2004. Mr Lee is the Secretary-General of the People’s Action Party (PAP). He was first elected Member of Parliament (MP) in 1984, and has been re-elected eight times, most recently as an MP for the Ang Mo Kio Group Representation Constituency. Mr Lee is Chairman of GIC, and also chairs the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nBefore becoming Prime Minister, Mr Lee had held various Ministerial appointments, including being Deputy Prime Minister, Minister for Finance, Minister in the Prime Minister’s Office, Minister for Trade and Industry and Second Minister for Defence. He was concurrently the Chairman of the Monetary Authority of Singapore from 1998 to 2004. Before joining politics, Mr Lee had served in the Singapore Armed Forces, retiring as a Brigadier-General.\n\nMr Lee holds a B.A. in Mathematics and a Diploma in Computer Science from the University of Cambridge. He holds a Master in Public Administration and is a Mason Fellow at the Harvard Kennedy School."}, {"url": "https://eresources.nlb.gov.sg/history/events/e65f9022-dcfc-4ee7-8049-ae2784b58d45", "page_content": "Lee Hsien Loong was formally sworn in as the third prime minister of Singapore on 12 August 2004, taking over the post from Goh Chok Tong.[1] Lee entered politics when he was elected as member of parliament (MP) for the Teck Ghee constituency following his win in the 1984 parliamentary general election. Since 1991, he has been one of the MPs for the Ang Mo Kio Group Representation Constituency (GRC), which was formed after Teck Ghee merged with the Ang Mo Kio and Yio Chu Kang constituencies.[2]\n\n\n\nIn January 1985, Lee was appointed Minister of State for Defence and Trade and Industry.[3] In February 1986, Lee was appointed Acting Trade and Industry Minister before becoming Minister for Trade and Industry and Second Minister for Defence (Services) in January the following year.[4] In 1990, Lee was appointed deputy prime minister and retained his trade and industry portfolio, while serving concurrently as chairman of the Monetary Authority of Singapore (MAS). He was chairman of MAS from January 1998 until August 2004 when he became prime minister.[5] In November 2001, Lee was appointed Minister for Finance while he was still deputy prime minister. He relinquished the finance minister post on 30 November 2007.[6]\n\n\n\nAside from political appointments in the cabinet, Lee also headed two high-level committees that looked into the restructuring of Singapore’s economy. In March 1985, Lee was appointed chairman of the Economic Committee that recommended changes to existing government economic policies to revive the economy during the 1985–86 recession, as well as to foster longer-term growth.[7] Similarly in December 2001, Lee was appointed chairman of the Economic Review Committee to develop a new economic blueprint for Singapore.[8]\n\n\n\nLee’s swearing-in ceremony was held outdoors on the Istana grounds in order to accommodate the 1,400 invited guests.[9] After he was sworn in by then Chief Justice Yong Pung How, Lee gave a speech thanking Goh and inviting Singaporeans to join him in writing the next chapter of Singapore.[10] He also pledged in the speech to be a prime minister for Singaporeans of different ethnic, religious and social backgrounds, and pay extra attention to the needs of the younger generation Singaporeans as well as the less fortunate.[11]\n\n\n\nSince becoming prime minister, Lee has launched a series of measures aimed at building an inclusive society and improving the competitiveness of Singapore’s economy. Some of these measures include changes to the education system to ensure that every Singaporean child attains at least a secondary school education, and the establishment of two institutes – The Institute of Water Policy (part of the Lee Kuan Yew School of Public Policy) and The Centre for Liveable Cities – to look into transforming the city and living environment.[12] In January 1995, Lee announced a billion-dollar package to provide poor, old and unemployed Singaporeans with jobs and financial assistance. One of the measures introduced under this package was the Community Care (ComCare) fund, which was an endowment fund to strengthen the country’s social safety nets. In 2007, Lee introduced changes to the Central Provident Fund (CPF) and employment laws to address the challenges of an ageing population.[13] As prime minister, Lee also led the People’s Action Party (PAP) to victory in the 2006 and 2011 parliamentary general elections.[14]\n\n\n\nReferences\n\n1. Zuraidah Ibrahim. (2004, August 13). Let us shape our future together. The Straits Times, p. 1; Zuraidah Ibrahim. (2004, July 18). August 12: Date for DPM Lee to take over as PM. The Straits Times, p. 1. Retrieved from NewspaperSG.\n\n2. Brig-Gen Lee makes an early thank-you call. (1984, December 24). The Straits Times, p. 11; Stronger identity for Ang Mo Kio. (1991, August 10). The Straits Times, p. 22. Retrieved from NewspaperSG.\n\n3. Three new MPs to become ministers of state. (1985, January 1). The Straits times, p. 1. Retrieved from NewspaperSG.\n\n4. New faces in the CEC. (1986, November 24). The Straits Times, p. 17; Eugene Yap takes over as deputy whip. (1987, January 29). The Straits Times, p. 11. Retrieved from NewspaperSG.\n\n5. Chok Tong announces remaining changes to cabinet. (1990, November 3). The Business Times, p. 16; Ong, C. (1997, December 20). BG Lee is MAS chairman from Jan 1. The Business Times, p. 1; SM Goh takes over as MAS chairman. (2004, August 21). Channel NewsAsia, p. 12. Retrieved from NewspaperSG.\n\n6. PM gives 7 newcomers top jobs. (2001, November 18). The Straits Times, p. 1; Quah, M. (2007, November 30). Tharman to take over as finance minister. The Business Times, p.1. Retrieved from NewspaperSG.\n\n7. Committee set up to review economy. (1985, March 14). Singapore Monitor, p. 11. Retrieved from NewspaperSG.\n\n8. We’ll leave no stone unturned: BG Lee. (2001, December 4). The Straits Times, p. 2. Retrieved from NewspaperSG\n\n9. Lim, L. (2004, August 12). 1,400 to witness Istana swearing-in ceremony. The Straits Times, p. 1; For everyone present, a piece of history. (2004, August 13). The Straits Times, p. 3. Retrieved from NewspaperSG.\n\n10. Join me to write this next chapter. (2004, August 13). The Straits Times, p. 8. Retrieved from NewspaperSG.\n\n11. The Straits Times, 13 Aug 2004, p. 8; ‘The future is full of exciting opportunities which we must together seize.’ (2004, August 13). The Straits Times, p. 8.\n\n12. Lee, U.-W. (2005, August 22). No child will get left behind. The Straits Times, p. 3; Fernandez, W. (2008, June 25). Singapore, ‘living lab’ for cities. The Straits Times, p. 3. Retrieved from NewspaperSG.\n\n13. Lim, L. (2005, January 20). PM Lee offers lifelines to old, needy and jobless. The Straits Times, p. 1; Lim, L. (2007, August 20). CPF changes: Better returns, longer wait for minimum sum. The Straits Times, p. 1. Retrieved from NewspaperSG.\n\n14. Zuraidah Ibrahim. (2006, May 7). PM gets his strong mandate. The Straits Times, p. 1; Zuraidah Ibrahim. (2011, May 8). 81-6: Workers' Party wins Aljunied GRC; PAP vote share dips to 60.1%. The Straits Times. Retrieved from Factiva.\n\nThe information in this article is valid as at 2014 and correct as far as we are able to ascertain from our sources. It is not intended to be an exhaustive or complete history of the subject. Please contact the Library for further reading materials on the topic."}, {"url": "https://www.cnbc.com/2023/06/08/singapore-economic-czar-tharman-shanmugaratnam-to-run-for-president.html", "page_content": "Singapore's veteran economic policymaker Tharman Shanmugaratnam has signaled his intention to contest upcoming presidential elections in Singapore that must be held by September this year.\n\nSingapore's veteran economic policymaker Tharman Shanmugaratnam is planning to run in the upcoming presidential elections in Singapore that must be held by mid-September.\n\nShanmugaratnam, once thought of as a potential candidate for International Monetary Fund chief, will resign from the ruling People's Action Party to stand for election, he said in a letter to Singapore Prime Minister Lee Hsien Loong Thursday.\n\nThat means stepping down from his current roles as senior minister and coordinating minister for social policies on July 7.\n\nThe Singapore presidency is largely a symbolic and ceremonial head of state position with limited executive power over the Singapore government, including control of the national reserves.\n\nThe prime minister is the head of government in Singapore. Since 1993, the Singapore president has been directly elected by a popular vote.\n\nThis marks the end of Shanmugaratnam's service in various roles in the Singapore cabinet and several global organizations after more than two decades. A professional economist, he was a career public servant before he was first elected as a Member of Parliament in November 2001.\n\nThe veteran policymaker is 66 years old this year and the current chairman of the Monetary Authority of Singapore, the country's de facto central bank and financial regulatory authority. He is also on the board of the Group of Thirty, a global council of economic and financial leaders from the public and private sectors and academia.\n\nShanmugaratnam co-chairs the Global Commission on the Economics of Water and is a member of the United Nations' High-Level Advisory Board on Effective Multilateralism.\n\nAmong his past global appointments, Shanmugaratnam was the first Asian chair of the International Monetary and Financial Committee, the IMF's key policy forum. He was also Singapore's deputy prime minister from 2011 to 2019, and previously served as finance minister and education minister."}, {"url": "https://www.channelnewsasia.com/singapore/tharman-shanmugaratnam-president-lee-hsien-loong-letters-election-3547731", "page_content": "SINGAPORE: Senior Minister Tharman Shanmugaratnam on Thursday (Jun 8) informed Prime Minister Lee Hsien Loong of his decision to retire from politics and all positions in government, in order to contest Singapore's presidential election.\n\nThis is Mr Tharman's letter to Mr Lee, in full:\n\nDear Prime Minister Lee,\n\nI wish to inform you that I have decided to put myself forward as a candidate in the forthcoming Presidential Election. I hence wish to retire from politics and all my positions in Government.\n\nI intend to resign from the People's Action Party, and step down as Senior Minister and Coordinating Minister for Social Policies. I plan to do so a month from now (on 7 July 2023), so that I can first fulfil my immediate official commitments in Singapore and internationally, and ensure that arrangements are fully in place for constituents of Jurong GRC to be well­ served for the rest of the electoral term.\n\nLikewise, I will step down as Chairman of the Monetary Authority of Singapore (MAS), Deputy Chairman of the Government of Singapore Investment Corporation (GIC), Chairman of the Economic Development Board's International Advisory Council and other responsibilities that I have been undertaking in my Ministerial capacity.\n\nI have been humbled by the requests I have received in recent months, from Singaporeans from different walks of life, to stand in the Presidential Election if President Halimah chose not to stand again.\n\nIt has been a difficult decision. I have consulted my family, and given careful thought to how I can best serve the country in the years ahead.\n\nI have spent my whole working life committed to the public service and advancing Singapore's interests. I started off as a professional economist at the MAS. I went on to join the civil service, and asked specifically to serve at the Ministry of Education. I later returned to the MAS when you were Chairman to work with you to stabilise the financial system during the Asian Financial Crisis and reorient how we regulated and developed the system, serving first as Deputy Managing Director and then as Managing Director.\n\nHowever, my greatest privilege has been to serve in politics over the last 22 years. As Member of Parliament (MP), helping residents overcome difficulties and fulfil their aspirations. In my ministerial responsibilities in Government as we made major shifts to build a more inclusive society and restructure the economy. In advancing Singapore's standing through my leadership of various international councils. And in the non-government sector, where I have chaired the board of the Ong Teng Cheong Labour Leadership Institute for two decades and that of SINDA over the last 12 years, and supported other civic organisations.\n\nWe are in a time of transition, both in Singapore and internationally. The '4G' team under DPM Lawrence Wong has been shaping up very well, consulting actively with the public, and rethinking our strategies for the future. The challenges they have to take on will keep evolving, however, well beyond the handover of leadership. They will have to tackle new global crises that will surely emerge, work closely with Singaporeans to retain trust in a changing domestic environment, and ensure Singapore's appeal and relevance in a more divided world.\n\nI believe that I can now best serve Singapore not in politics, but in a different role that has to be above politics. If I am fortunate enough to be elected as President, I will represent the unity of Singaporeans, of all races and religions, social backgrounds, and political leanings, at a time when views in the population are becoming more diverse.\n\nI will be thorough and impartial in fulfilling the constitutional duties of the President with regard to the prudent use of the nation's reserves and the key appointments which preserve the integrity of the Singapore system. I will also work to the best of my abilities to project Singapore's interests and voice of reason in an increasingly turbulent world.\n\nMy greatest sadness is in retiring as an MP on the ground, having built deep-rooted relationships with residents and volunteers in Taman Jurong and the rest of Jurong GRC. I hope to maintain these friendships, many of which go back decades. I am assured that my dedicated fellow MPs in Jurong will work doubly hard to serve all our residents fully during the current electoral term.\n\nI am deeply grateful for the opportunities I have been given to serve Singapore. I am particularly thankful for your leadership, advice and openness to collegial debate through the years, for the teamwork and contributions of all my colleagues in Government, and for the guidance provided by then-PM Mr Goh Chok Tong and his team when I came into Cabinet.\n\nMy role vis-a-vis the Government will change fundamentally if I am elected President. What will never change is my conviction in the continuing Singapore story: a society where everyone has the support to uplift themselves regardless of their starting point in life, and a multiracial nation whose citizens take pride in its unique identity and feel a deepening sense of togetherness.\n\n"}, {"url": "https://www.caixinglobal.com/2023-06-08/singapore-minister-tharman-to-run-for-city-states-president-102063556.html", "page_content": "By Goh Yan Han\n\n(Straits Times) — Senior Minister Tharman Shanmugaratnam will be running for president in the upcoming election, stepping aside from politics after 22 years.\n\n“I wish to inform you that I have decided to put myself forward as a candidate in the forthcoming presidential election. I hence wish to retire from politics and all my positions in Government,” he said in a letter to Prime Minister Lee Hsien Loong on Thursday. PM Lee is also secretary-general of the People’s Action Party."}, {"url": "https://www.mas.gov.sg/news/speeches/2004/financial-sector-liberalisation-and-growth", "page_content": "\"Financial Sector - Liberalisation and Growth\"\n\n1 In 1997, MAS launched a comprehensive review of Singapore's financial sector. The Asian crisis unfolded soon after, but we decided to press on. Over the next few years, we fundamentally changed our regulatory approach, from one-size-fits-all prescriptive regulation towards a more risk-focussed supervisory approach. We liberalised the industry, allowing freer competition, more play of market forces, and greater risk taking by institutions. We actively promoted activities in which we had competitive advantages.\n\n2 Our efforts are bearing fruit. In the last seven years, the financial industry has changed dramatically. Tonight, let me review the state of the industry, and discuss some key challenges and opportunities going forward.\n\nOVERVIEW OF CHANGES IN THE FINANCIAL SECTOR\n\n3 Singapore's financial sector held up well against the full impact of the Asian Financial Crisis, and more recently the SARS outbreak. Despite the turbulent environment, it has steadily grown and matured. Our financial system is robust, and our legal, supervisory and institutional framework is sound, as the IMF's recent Financial System Stability Assessment of Singapore affirmed. Today, 700 local and foreign financial institutions are in Singapore. They offer a comprehensive range of world-class financial services and with 5% of our workforce, contribute 12% of Singapore's GDP.\n\n4 In banking, seven local banking groups have consolidated into three stronger groups. Foreign shareholding limits on locally-incorporated banks have been removed, allowing them to tap the equity market more flexibly, and if they desire, to form strategic partnerships with foreign banks. Six banks with regional and international standing and the potential to contribute to our financial sector have been awarded Qualifying Full Bank (QFB) licences. This has intensified competition in retail banking and widened consumer choices. Foreign banks also continue to be active players in the wholesale banking market and in wealth management. International banks are using Singapore as their base to service corporations and high net worth individuals (HNWIs) in the region.\n\n5 In insurance, a formerly closed industry has been substantially deregulated. We have enhanced disclosure requirements of products, tightened up sales practices and raised the overall professionalism of insurance advisers.\n\n6 The financial advisory industry has also seen substantial growth. A diversity of firms and business models now cater to different market segments. Service and conduct standards of financial advisers have gone up.\n\n7 The wealth management industry has grown dramatically. Annual growth rates in private banking assets under management (AUM) average almost 20%. In 2003, institutional AUM grew by 35% year-on-year to S$465 billion. A majority of these assets are internationally sourced. Close to 1,000 investment professionals, comprising portfolio managers, analysts, asset allocators and economists now work in this high value-added sector. Fund managers have been extending their value chain of activities here. Apart from portfolio management and marketing activities, companies now carry out middle-office functions such as regional trading and research. Others have centralised regional back office operations in Singapore, making full use of our efficient infrastructure, conducive business environment and stable political climate.\n\n8 MAS also made a major effort to develop Singapore's capital markets. A cornerstone of this effort was the easing of restrictions on the lending of the Singapore dollar (S$) to non-residents. Originally, banks required MAS' permission for any form of lending to non-residents above S$5 million. This blanket restriction effectively discouraged S$ speculation, but it also stifled the growth of capital markets. Starting in 1998, we progressively refined the restrictions to focus more sharply on lending for the purpose of S$ speculation. We lifted restrictions on the trading of S$ derivatives like futures, options and cross-currency swaps. We allowed non-residents to raise S$ funds through debt and equity issuance. Eventually the policy changed so substantially that it was no longer apt to describe it as the non-internationalisation of the S$. So in May this year we renamed it the policy on the lending of S$ to non-resident financial institutions.\n\n9 Consequently, our capital markets have broadened and deepened. The debt market has matured significantly, and now provides a cost-effective alternative funding source to a diverse range of local and foreign borrowers. The SGS yield curve has been extended from 7 to 15 years. Some statutory boards have even issued bonds up to 20 years in tenor. The corporate debt market has quadrupled since end-1996 with S$103 billion of corporate debt securities outstanding as at end-2003. Debt issuance has increased substantially from only S$5.4 billion at end-1996 to S$67 billion in 2003, a compounded annual growth of 43%.\n\n10 The profile of debt issuers has also changed. Statutory boards used to dominate, but now form only 3% of total issuance. Instead, the debt market has a stable base of large corporates and financial institutions issuing bonds well over S$1 billion in issue size. This has increased liquidity in the secondary market. Large international issuers such as IFC, Freddie Mac, Fannie Mae and ADB, which can tap any market in the world, have chosen to raise funds in Singapore.\n\n11 Treasury markets have also stayed buoyant, as Singapore remains one of the established leading global FX trading centres. The creation and hedging of structured products have boosted turnover in derivative markets. Singapore now ranks 6th globally, in OTC FX and interest rate derivatives.\n\n12 Reforms were also introduced to deregulate the stockbroking industry. The industry has consolidated, operating more leanly on much lower commissions. The bigger local players have expanded their product range and also expanded overseas. More foreign players have entered the market. Overall, investors have benefited from lower trading costs.\n\n13 SGX became the first demutualised, integrated stock and derivatives exchange in the Asia-Pacific in December 1999. It is now well placed to grow its business, and respond to developments in regional capital markets. More foreign companies are choosing to list in Singapore. To date, there have been 47 listings by Chinese companies, and a few Indian listings are in the pipeline. SGX has also actively pursued alliances with other exchanges. Its first securities co-trading linkage with the Australia Stock Exchange allowed investors in the two countries to trade in each other's market directly. SGX is also exploring linkages with ASEAN securities markets. If this succeeds it will benefit the region as a whole.\n\n14 We have also grown as a processing centre. Large financial institutions have centralised their regional and global processing operations in Singapore. These house high value-added, mission-critical systems as well as back-office processing activities.\n\n15 In brief, our financial sector has become more dynamic and vibrant. Many persons and institutions have participated in this process. Their support, hard work and spirit of enterprise made this possible. I thank them all.\n\nDEVELOPMENTS IN THE BANKING SECTOR\n\n16 Let me now focus on the banking sector.\n\n17 The Asian Financial Crisis underscored the importance of sound, resilient financial systems underpinned by strong domestic banks. The lessons of the Crisis played a major part in re-shaping the banking industry. Meanwhile, global trends such as consolidation among the major international banks, technology advances and globalisation of financial markets continued apace. A new financial landscape was emerging.\n\nMAS-Initiated Reforms\n\n18 Banking was the most critical and complex part of the MAS reforms. We started from a strong position, with sound and well supervised local banks, although they operated in a tightly regulated and protected environment. Our challenge was to free up this industry so that it could continue to develop and grow, without compromising stability and soundness in a changing landscape. Strong and well-managed local banks, with a significant share of the home market, were and are critical to the resilience and stability of our financial system. However, we could no longer maintain this by restricting access to the domestic market. We needed to permit more competition, but in phases, to allow the local banks to adjust and compete effectively.\n\n19 MAS therefore introduced a five-year programme to liberalise access to Singapore's domestic banking market. We made the first moves in 1999. As we lightened our regulatory touch, we also worked with banks to set guidelines for best practices and give banks greater room for enterprise and innovation.\n\nStronger Banking Industry\n\n20 Today, Singapore's banking sector is more open and dynamic. This has come about without sacrificing strength and stability. Individual banks and the industry as a whole have risen to the challenge. Existing players have upgraded and strengthened themselves. Banks have maintained high prudential standards, become more efficient and improved their service quality and product ranges.\n\n21 The foreign banks have contributed to the vibrancy of the Singapore banking scene. Competition has led to the development of a rich array of innovative products and more discriminating pricing models. Customer service as a whole has improved. Foreign banks have continued to expand their operations here, and many have made Singapore a regional or even global platform for important banking services.\n\n22 The local banks have strengthened their capabilities and expanded their range of business activities. They have built up their management teams, and made significant infrastructural investments to enhance their operational effectiveness. Fees and commissions have risen as a proportion of operating income. Banks are offering new business services, while continuing to provide affordable banking facilities to the average Singaporean. They have held their own despite the increased competition. For instance, their market share of resident non-bank deposits (both ACU and DBU) has declined only marginally from 62% to 59% over the last five years.\n\n23 The local banks have also improved their business and risk management capabilities. The recent change in MAS' capital adequacy requirements is in recognition of local banks' efforts to upgrade their risk management capabilities, and should allow them to manage their capital more flexibly.\n\n24 With greater financial strength from the mergers and increased competition at home, local banks have begun to venture abroad and develop a regional footprint through overseas acquisitions.\n\nBANKING LIBERALISATION\n\n25 When MAS embarked on the liberalisation measures, we sought to anticipate changes and trends that we were convinced were already underway. Events since then showed that we moved none too soon. Technological advances have continued unabated. The Internet for instance has proven to be an efficient and widely used alternative distribution and marketing channel, and has helped create new business models. Worldwide, major banks continue to consolidate, though the process is not yet complete, especially in Europe.\n\n26 We also anticipated needing to open up our banking sector because we intended to negotiate FTAs with major trading partners. Since our goods sector was already almost completely open, our partners would surely make requests in services, and especially financial services. Therefore our local banks had to be ready. The banks would have preferred that we slow down the pace, but we had an overriding need to conclude a wide network of FTAs, including one with the US. The banking reforms enabled us to do this. Now that we have done so, we are reassured that our banks are holding their own, and can take the increased competition in their stride.\n\nAdjustments to Liberalisation Measures\n\n27 It is now three years since the last package of banking liberalisation measures in 2001. Having assessed the state of the industry, MAS has decided to take a few further steps to liberalise the banking industry. These are incremental adjustments to the earlier major liberalisation packages:\n\na. Firstly, from 1 January 2005, QFBs will be permitted to establish up to 25 service locations from the existing 15. The 25 locations can either be brick-and-mortar branches or offsite ATM locations. With 6 QFBs permitted to share ATMs amongst themselves, this could result in a QFB shared ATM network of about 150 locations across Singapore. This provides QFBs with significant scope for expanding their presence in the domestic market. b. Secondly, MAS is prepared to grant a limited number of new Wholesale Bank (WB) licences to applicants that meet our admission requirements. c. Finally, QFBs will with immediate effect be allowed to negotiate with the local banks on a commercial basis to let their credit card holders obtain cash advances through the local banks' ATM networks.\n\n28 Singapore now has one of the most liberal banking environments in Asia. However, over time, as the industry changes, we must be ready to liberalise further. MAS will reassess the environment before deciding on any further measures.\n\n29 While it is still too early to make a final judgment, banking liberalisation has so far achieved its aim of bringing about greater competition. It has fostered the consolidation of the local banks, which might otherwise have taken much longer. The overall market shares of local and foreign banks have not changed drastically, but there has been an all-round qualitative improvement which has enhanced the vibrancy of Singapore's financial sector.\n\n30 The liberalisation measures and reforms of the last few years have set the financial sector on a firm foundation. However, we cannot afford to rest on our laurels. Challenges as well as opportunities exist for both the banking industry and the financial sector as a whole. We must identify and respond to them, in order to keep the financial sector dynamic and competitive.\n\nCHALLENGES FOR BANKS\n\n31 For banks, I will focus on two main challenges. Firstly, banks need to continue to maintain high prudential standards so as to remain sound institutions. Next, they have to develop new strategies to continue growing strong, viable businesses.\n\nSound Institutions\n\n32 MAS does not seek to prevent institutions from taking risks. It is the business of financial institutions to take on and intermediate risks. But if risks are not well managed or events turn out unfavourably, institutions can incur substantial losses. No amount of regulation or supervision can completely prevent losses. On the other hand, over-regulation would curb innovation and enterprise. This was a key message in MAS' Monograph on the Objectives and Principles of Financial Supervision in Singapore.\n\n33 Financial institutions therefore need to build their capacity to identify, monitor, and control the risks that they take. Banks should benchmark their risk management against international best practices. Risk management should be an integral part of their operations, and should keep pace with their business profile and with industry developments. The banking sector as a whole has done well in this respect, and we expect to see this continue.\n\n34 One major change in the way banks manage risks will be triggered by the new Basel Accord. Implementing Basel II will be a complex exercise but will spur banks to enhance their risk management practices. Banks need to develop robust systems and processes to make the new capital adequacy rules work. While cost will inevitably be an important consideration, this should be weighed against the significant benefits and operational savings from the more accurate allocation of capital to risk. MAS will work closely with the local banks to implement the new Accord.\n\nBusiness and Strategic Considerations\n\n35 Next, banks have to decide how to grow and position their businesses over the longer term, especially the local banks. Maintaining margins and cutting costs is necessary in the short term, but beyond that, banks need longer term strategies for staying viable and competitive.\n\n36 After a period of domestic consolidation, the local banks have made several regional acquisitions, but they still remain small by international standards. Competition will intensify, within the domestic market because of liberalisation, and internationally because globalisation is continuing. The local banks may well find that in order to hold their own and be viable, they need to grow bigger.\n\n37 Possibilities for domestic growth are limited other than through further consolidation. But the region offers considerable opportunities. Asia is poised for sustained growth, having emerged from the Crisis as one of the most promising regions in the world. Countries have gone through a period of structural reforms and transformed their financial sectors. Now they are progressively opening up their economies to greater foreign participation. This is attracting interest from major regional and global players.\n\n38 Our local banks cannot ignore this game. They need to consider their options carefully. Is the way forward to remain a niche player, sizeable in the domestic market, but small by international standards? Or must they achieve greater scale by expanding into the region? If so, what strategy will minimise the risks and maximise the benefits of operating in different countries? How can they build strong management teams, to execute a sound strategy well? Each bank must answer these questions for itself. Their long term profitability and viability depends on their finding the right answers.\n\nCHALLENGES FOR THE FINANCIAL SECTOR\n\n39 Let me move on to some of the opportunities and challenges for the financial sector. I will discuss three issues - developing the wealth management industry, growing our capital markets, and increasing our human capital.\n\nWealth Management\n\n40 The Asia-Pacific is the fastest growing market for private banking in the world. Rapid development is producing large numbers of wealthy individuals, and huge amounts of private wealth to be managed. Asian savers and investors are increasingly sophisticated and are seeking best of breed products and managers. Non-Asian clients are increasingly demanding geographical diversification for their assets. Institutional assets in Asia will also grow progressively as countries reform pensions, and deregulation frees up assets from insurance companies and other corporates for professional management.\n\n41 These factors favour Singapore as an Asian centre, because of our sound economic and political environment, conducive legal and tax policies, reputation for integrity, and strict enforcement against crime and money laundering. Singapore is already an established centre for managing Asian investments of global clients, and global investments of Asian clients. The strong growth potential of wealth management makes it an industry where Singapore is well placed to become a global player.\n\n42 The large increase in the number of HNWIs globally has also boosted demand for estate and trust planning. We are reviewing and modernizing the Singapore Trustees Act. MAS is also reviewing the Trust Companies Act, and will take over the regulation of trust companies. These steps will enhance Singapore's position as an international trust domicile and widen the suite of wealth management services available here. We also need to build a larger pool of wealth management skills, and continue to increase the range of product offerings for wealth management clients.\n\nCapital Markets\n\n43 Since the Crisis, countries in Asia have recognized the importance of developing their bond markets. While individual countries have made significant progress, their markets remain fragmented and small by international standards. We need closer co-operation among the capital markets in Asia, in order to integrate the markets and collectively increase their depth and liquidity. This will allow us to effectively recycle some of Asia's huge reserves and attract more international investors to the region.\n\n44 Regional governments have therefore taken several initiatives to foster a regional capital market, covering both fixed income and equity. These address both supply and demand side issues, such as easing constraints to cross border activity, forging alliances and linkages among the exchanges, as well as establishing a regional infrastructure. Challenges still remain. For example, we have to work out and implement efficient solutions across countries that have different start points, practices and regulatory frameworks. But it is encouraging that governments are more seized with this problem, and more ready to collaborate with one another, than ever before.\n\n45 Singapore has taken the lead in several of the regional initiatives. Financial institutions here should also take part actively. This is the time to engage regulators and government officials in the region, to enter their growing markets and position yourselves for the business opportunities that the initiatives create.\n\n46 As a leading foreign exchange centre with a critical mass of global fixed income and equities expertise, Singapore can service international investors operating in Asia. Our market is well placed to facilitate the hedging activities that are essential for risk management and improving market efficiency. These will complement the domestic markets in the countries of the region. Our strong legal system and the availability of international legal expertise and product structuring teams equip us to structure complex cross-border transactions. The growing wealth management industry will also generate a steady source of funds for regional investment products.\n\nHuman Capital\n\n47 A major issue that concerns all parts of the financial sector is human capital. A distinguishing characteristic of a successful financial centre is that it attracts talented and dynamic professionals from a broad range of disciplines and experiences. They make the financial centre what it is. Deepening and broadening our talent pool will be a continuing challenge for the financial sector and for MAS.\n\n48 MAS and industry players have taken steps together to address this. The Institute of Banking and Finance had been re-organised to better meet the needs of the industry as a financial training intermediary. It will also serve as a platform for the industry to provide regular feedback on manpower needs and issues.\n\n49 The industry has established the Financial Industry Competency Standards Committee, which will develop internationally aligned competency benchmarks for the whole financial industry. MAS is also working with specific industries to address their human resource needs through a manpower conversion scheme. This scheme will help mobilize, train and channel resources to support growth areas quickly.\n\n50 MAS will work with financial institutions to build and upgrade talent in the financial sector workforce. Singapore has always welcomed talented individuals to live and work here. They have contributed much to the vibrancy of our financial sector. Singapore must remain open to talent and continue to be a conducive environment to work and live in, so that we can continue to attract talent here, and also retain able Singaporeans.\n\nCONCLUSION\n\n51 MAS is committed to the vision of Singapore as a leading global financial sector, one which is competitive, fosters enterprise and innovation, and maintains high regulatory standards. We have made steady progress toward this goal and must continue to do so. We must never become complacent and satisfied with the status quo, or else we will soon be overtaken and left behind.\n\n52 MAS will strive to create an environment where market forces, enterprise and innovation can thrive. We will stay abreast of market developments, and be sensitive to the needs of the industry, without compromising on supervisory standards. Our experience has shown that the two are not incompatible; indeed listening to industry players, without being overwhelmed by them, helps us to become better regulators and supervisors.\n\n53 I am grateful for the full support and cooperation which the industry has extended to MAS, and to me personally, over the years. I am also grateful to the staff of MAS, whose professionalism, dedication and hard work have enabled us to reorientate our approach and transform the financial sector smoothly and safely. MAS and the industry will need to continue to work together to realise the vision of a more dynamic, competitive and vibrant financial sector in Singapore. That is the ultimate test of the success of our efforts to grow the sector, and make Singapore a key financial hub in Asia."}, {"url": "https://www.pmo.gov.sg/Newsroom/Letter-Exchange-between-PM-Lee-Hsien-Loong-and-SM-Tharman-Shanmugaratnam", "page_content": "An exchange of letters between PM Lee Hsien Loong and SM Tharman Shanmugaratnam on 8 June 2023, whereby SM Tharman informed PM Lee of his intention to step down as the Senior Minister and Coordinating Minister for Social Policies and to resign from the People’s Action Party, in order to contest the upcoming Presidential Election.\n\n20230608 - Letter from SM Tharman to PM Lee pdf (pdf, 153.51KB)\n\n20230608 - Letter from PM Lee to SM Tharman pdf (pdf, 148.03KB)"}, {"url": "https://live.worldbank.org/experts/lee-hsien-loong", "page_content": "Mr. Lee also chairs GIC, Singapore’s sovereign wealth fund, and the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nMr. Lee is the Secretary-General of the People’s Action Party (PAP). He led PAP to three consecutive Singapore General Elections victories in 2006, 2011 and 2015.\n\nLee Hsien Loong has been Singapore’s Prime Minister since 2004.\n\nMr. Lee is the Secretary-General of the People’s Action Party (PAP). He led PAP to three consecutive Singapore General Elections victories in 2006, 2011 and 2015.\n\nMr. Lee also chairs GIC, Singapore’s sovereign wealth fund, and the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nAs Prime Minister, he launched SkillsFuture to support Singaporeans in embracing lifelong learning and skills, and the Smart Nation initiative to use technology to create a future of better living, more opportunities and stronger communities.\n\nBefore becoming Prime Minister, Mr. Lee had held various Ministerial appointments, including being Deputy Prime Minister, Minister for Finance, Minister in the Prime Minister’s Office, Minister for Trade and Industry and Second Minister for Defense. He was concurrently the Chairman of the Monetary Authority of Singapore from 1998 until 2004.\n\nBefore joining politics, Mr. Lee had served in the Singapore Armed Forces, retiring as a Brigadier-General.\n\nMr. Lee graduated with a B.A. in Mathematics and a Diploma in Computer Science from the University of Cambridge. He was later a Mason Fellow at the Harvard Kennedy School, receiving a Master’s in Public Administration.\n\nMr. Lee was born on 10 February 1952. He married Dr. Wong Ming Yang in 1978 and was widowed in 1982. He remarried Ho Ching in 1985. He has one daughter and three sons.\n\nMr. Lee enjoys reading, photography, walking, listening to classical music, and computer programming."}], "Lee Hsien Loong is the Chairman of the Research, Innovation and Enterprise Council.": [{"url": "https://www.pmo.gov.sg/The-Cabinet/Mr-LEE-Hsien-Loong", "page_content": "Mr Lee Hsien Loong has been Singapore’s Prime Minister since 2004.\n\nMr Lee is the Secretary-General of the People’s Action Party (PAP). He led PAP to four consecutive Singapore General Elections victories in 2006, 2011, 2015 and 2020. He was first elected Member of Parliament (MP) in 1984, and has been re-elected eight times, most recently as an MP for the Ang Mo Kio Group Representation Constituency.\n\nMr Lee also chairs GIC, Singapore’s sovereign wealth fund, and the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nAs Prime Minister, he launched SkillsFuture to support Singaporeans in embracing lifelong learning and skills, and the Smart Nation initiative to use technology to create a future of better living, more opportunities and stronger communities.\n\nBefore becoming Prime Minister, Mr Lee had held various Ministerial appointments, including being Deputy Prime Minister, Minister for Finance, Minister for Trade and Industry and Second Minister for Defence. He was concurrently the Chairman of the Monetary Authority of Singapore from 1998 until 2004.\n\nBefore joining politics, Mr Lee had served in the Singapore Armed Forces, retiring as a Brigadier-General.\n\nMr Lee graduated with a B.A. in Mathematics and a Diploma in Computer Science from the University of Cambridge. He was later a Mason Fellow at the Harvard Kennedy School, receiving a Master in Public Administration.\n\nMr Lee was born on 10 February 1952. He married Dr Wong Ming Yang in 1978, and was widowed in 1982. He remarried Ho Ching in 1985. He has one daughter and three sons.\n\nMr Lee enjoys reading, photography, walking, listening to classical music, and computer programming.\n\nBiodata"}, {"url": "https://www.nrf.gov.sg/about/governance/riec/", "page_content": "The NRF supports the Research Innovation and Enterprise Council (RIEC).\n\nThe RIEC is chaired by the Prime Minister of Singapore, who appoints members to three-year terms. The RIEC comprises Cabinet Ministers and distinguished local and foreign members from the business, science and technology communities.\n\nSet up in 2006, the RIEC provides strategic direction for national R&D. It has two main goals:\n\nTo advise the Cabinet on national research and innovation strategies to drive the transformation of Singapore into a knowledge-based society, with strong capabilities in research, innovation and enterprise to meet our economic and societal needs; and\n\nTo lead Singapore’s commitment towards research, innovation and enterprise by strengthening enterprise innovation capabilities and accelerating technology translation, with a view to catalyse value capture in key strategic areas for Singapore.\n\nThis high-level council underscores the political commitment to and importance placed on the national R&D agenda.\n\nRIEC Members"}, {"url": "https://events.gic.com.sg/gicinsights-2021/speakers/lee-hsien-loong/", "page_content": "Prime Minister, Government of Singapore and Chairman\n\nGIC\n\nLee Hsien Loong has been Singapore’s Prime Minister since 2004. Mr Lee is the Secretary-General of the People’s Action Party (PAP). He was first elected Member of Parliament (MP) in 1984, and has been re-elected eight times, most recently as an MP for the Ang Mo Kio Group Representation Constituency. Mr Lee is Chairman of GIC, and also chairs the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nBefore becoming Prime Minister, Mr Lee had held various Ministerial appointments, including being Deputy Prime Minister, Minister for Finance, Minister in the Prime Minister’s Office, Minister for Trade and Industry and Second Minister for Defence. He was concurrently the Chairman of the Monetary Authority of Singapore from 1998 to 2004. Before joining politics, Mr Lee had served in the Singapore Armed Forces, retiring as a Brigadier-General.\n\nMr Lee holds a B.A. in Mathematics and a Diploma in Computer Science from the University of Cambridge. He holds a Master in Public Administration and is a Mason Fellow at the Harvard Kennedy School."}, {"url": "https://www.gic.com.sg/who-we-are/board-of-directors/lee-hsien-loong/", "page_content": "Chairman, GIC Board\n\nLee Hsien Loong has been Singapore’s Prime Minister since 2004. Mr Lee is the Secretary-General of the People’s Action Party (PAP). He was first elected Member of Parliament (MP) in 1984, and has been re-elected eight times, most recently as an MP for the Ang Mo Kio Group Representation Constituency. Mr Lee is Chairman of GIC, and also chairs the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nBefore becoming Prime Minister, Mr Lee had held various Ministerial appointments, including being Deputy Prime Minister, Minister for Finance, Minister in the Prime Minister’s Office, Minister for Trade and Industry and Second Minister for Defence. He was concurrently the Chairman of the Monetary Authority of Singapore from 1998 to 2004. Before joining politics, Mr Lee had served in the Singapore Armed Forces, retiring as a Brigadier-General.\n\nMr Lee holds a B.A. in Mathematics and a Diploma in Computer Science from the University of Cambridge. He holds a Master in Public Administration and is a Mason Fellow at the Harvard Kennedy School."}, {"url": "https://www.pmo.gov.sg/Newsroom/pm-lee-hsien-loong-research-innovation-and-enterprise-council-riec-press-conference", "page_content": "Thank you for coming to this RIEC press conference. We have had a fruitful and a very lively meeting. We reviewed the Research, Innovation and Enterprise (RIE) 2015 Plan, which is a five-year plan which we completed last year. We firmed up our plans for the next five years, which is the RIE 2020 Plan.\n\nWe have made good progress. Our post-secondary institutions – the ITEs, the polys and the universities – have done well. Their research standing has gone up and they have also produced students who are well regarded and in demand from the industry. A*STAR now has 20 research institutes in many different fields and in different parts of the research and development chain, from fundamental to applied research. Our population of research scientists and engineers and PhD students has steadily increased. Linkages between public and private research have also been strengthened. We have launched initiatives, like the Keppel-NUS Corporate Lab and a joint laboratory between the Institute of Microelectronics and Advanced Semiconductor.\n\nAll these R&D and innovation and enterprise initiatives have benefitted our workers and our businesses. We have been able to attract leading multinational corporation (MNCs) and eminent foreign universities to establish R&D centres here and to do other high value-added activities here too, which has created new jobs and opportunities for Singaporeans. At the same time, because of the research and innovation which we have been doing, we have been able to give our local small and medium enterprises (SMEs) and our companies a leg-up, helping them to create new products and services and to expand their business opportunities. It has also helped us as a country to overcome our constraints, for example, with water technologies.\n\nRIE will continue to be important to secure our future. It contributes significantly to the economy and creates opportunities and jobs. It supports national initiatives like the Smart Nation, SkillsFuture or the studies we are doing under the Committee for the Future Economy. It helps our workers to thrive amidst technological changes and globalization. It can also improve the health of our population, especially enabling our seniors to live better and healthier lives, and it can transform our urban landscape to make it more liveable and sustainable. Therefore, for the RIE 2020 Plan, we are committing $19 billion. There are more details in the Budget, but the essence of it is that we are going to be spending or allocating 18 per cent more than the previous plan and the spending will be about one per cent of GDP. That is more than the UK and comparable to the US and also to public spending on R&D in other small research-intensive economies.\n\nIn the RIE 2020 Plan, we are making four major shifts to capture more value from our investments and research, basically to make the research more effective and to get more results from them.\n\nFirst, we are encouraging multidisciplinary collaboration across agencies in four identified domains based on our needs – Advanced Manufacturing and Engineering, Health and Biomedical Sciences, Services and the Digital Economy and also Urban Solutions and Sustainability.\n\nSecond, we are making more public R&D funding open to competition, requiring competition to bid for the money to make sure that we fund the best ideas and the most deserving needs. In fact, in the previous plan, only 20 per cent of the money was open for competition, but in this plan 40 per cent of the money will be open and have to be competed for.\n\nThird, we are doing more to align research in public institutions with what the industry needs and dedicating more funds to public-private collaborations and also increasing start-ups grants to Singapore enterprises to innovate and adopt new technologies.\n\nFinally, we are optimising our manpower. This means developing manpower where our national and industry needs are highest and getting more of our Masters and PhD students to be trained in the industry, for example, in engineering PhD programmes.\n\nTo drive the RIE 2020, we will need good people, both Singaporeans as well as foreign talent. We will need to train our young people to encourage them and interest them in science and technology and give them the sense that, indeed, it is possible to do exciting things in Singapore and change the world. We also need to attract talented Singaporeans who are abroad to come back home and to work in our scientific field. Today’s Straits Times, there is a very good story about three of them – Professor Andrew Lim, who is a computer scientist, Prof Chua Nam Hai, who is in biotechnology, and Dr Aaron Thean, who is an engineer and an inventor who has 50 patents to his name. At the same time, we have to be able to attract international talent and be open to talent in order to be able to deepen our talent pool, to create new knowledge and to enhance our technological expertise. If we can do that, then we can get the right mix of local and foreign talent. We have to make this a creative, a fertile, an innovative and enterprising environment.\n\nUltimately, R&D is about the spirit of can-do and the attitude that there are infinite possibilities waiting to be discovered or invented. Anything is possible provided we persevere and put our minds to it. We need that spirit, not just in science, technology to drive our researchers and scientists, but in Singapore, amongst all Singaporeans, so that we can build a better future for ourselves and our children."}, {"url": "https://www.pmo.gov.sg/Newsroom/Transcript-remarks-Lee-Hsien-Loong-Press-Conference-8-April", "page_content": "PM: Good afternoon everybody and thank you for coming to this press conference. I called this conference today to brief you on our leadership succession plans. You have seen the exchange of letters between me and DPM Heng, as well as a statement of the younger ministers.\n\nLet me explain briefly the background before I ask DPM to speak. After the recent Budget and Committee of Supply debates, DPM Heng spoke to me about the succession issue. I told him that I understood and respected his views. However, as he was chosen as the leader of the 4G team by the younger ministers, it was best for him to speak to the ministers himself.\n\nI therefore called a meeting of all the Ministers, SMSes, MOSes, Speaker and Secretary-General of NTUC yesterday. DPM explained his decision to them.\n\nI then proposed that the younger ministers caucus to decide how they would respond to DPM’s decision, and what they wanted to do about the succession. I asked Gan Kim Yong to chair this session as party chairman. Then, DPM, the two SMs and I left them to carry on.\n\nEarlier this afternoon, we met the PAP MPs to inform them of the outcome of these discussions. This press conference is to make the news public.\n\nI will now invite DPM Heng to speak and then Kim Yong and Lawrence will brief you on the outcome of the 4G team’s caucus and their response to DPM’s announcement.\n\n[DPM’s remarks]\n\nThanks Swee Keat. Swee Keat has been an important member of my team for the last 10 years. I would like to thank him for his many contributions in MOE and MOF, especially in this past year.\n\nIn MOE, he led many groundbreaking initiatives. For example, promoting excellence in every school, and also in character and citizenship education. In MOF, with the Committee for the Future Economy, with a Future Economy Council following up on that, and then the COVID-19 Budgets last year.\n\nIn view of Swee Keat’s decision to stand aside as leader of the 4G team, I discussed with him his future role in Cabinet. I asked him to continue as DPM and Coordinating Minister for Economic Policies. I am glad that he has agreed to stay on. He will have the full agenda, building on what he has started. There is urgent work to do to take our economy beyond COVID-19.\n\nThis will also dovetail with his role as Chairman of the National Research Foundation, where we are making steady progress in promoting research, innovation and enterprise. I also look forward to Swee Keat continuing to make broader contributions to government policy and party work.\n\nHowever, DPM will relinquish the finance portfolio at the next Cabinet reshuffle. I discussed this move with DPM last year, when we worked out Cabinet appointments following the General Election. We agreed that Budget 2021 would be an important Budget, not an emergency Budget like the five in 2020, but a Budget to take Singapore beyond COVID-19.\n\nI told him it would be good for him to see through Budget 2021. Then he could give up the MOF portfolio to concentrate on the broader coordinating responsibilities.\n\nThere will be consequential moves in other ministries, and I intend to announce the reshuffle in about two weeks’ time.\n\nIn the Party, Swee Keat remains as First Assistant Secretary-General, there will be no change.\n\nSwee Keat has made a selfless decision to stand aside. His actions are made with the best interests of Singapore in mind. They are fully in keeping with the spirit of public service and sense of duty that motivated him to step forward and stand for election when I asked him to do so in 2011.\n\nNevertheless, as the 4G statement acknowledges, this is a significant setback to our succession plans. The 4G team want to give themselves more time to work out new succession arrangements. I have therefore agreed to stay on until such time as the new 4G leader is chosen and is ready to take over.\n\nOur immediate focus is on the health and economic crisis. But both they and I are very conscious that succession remains an urgent task and cannot be put off indefinitely. I think they will take longer than a few months, but I hope that they will reach a consensus and identify a new leader before the next General Election. I have no intention of staying on longer than necessary.\n\nMeanwhile, we must not lose focus on the country's pressing health and economic challenges. My Cabinet will continue to work as one united team to overcome these challenges and lead the country forward. That is what Singaporeans expect of us and rightly so.\n\nIt is also the only way to maintain confidence in Singapore and keep our country succeeding year after year.\n\nNow let me say a few words in Mandarin.\n\n副总理王瑞杰先生正式提出他将把领导年轻部长的责任交给新的人选。年轻部长接受了他的要求。我告诉副总理：我了解并支持他的决定，但我希望他会继续在内阁服务。我很欣慰，他同意了。\n\n他将继续当任副总理兼经济政策统筹部长，以及继续领导NRF国立研究基金会，还有主持 JCBC 新中双边合作联合委员会等等。\n\n过去十年，副总理在我的内阁担任了重要任务。首先在教育部任职将近五年，接着在财政部也有五年半的时间。在这两个部门，他都推出了重点措施。特别是在过去一年，为了确保新加坡和国人能够应对我们这一代的危机，在短短的一年内，推出了五项预算案，让我国的工友和企业能够安然脱险。\n\n我非常感谢副总理这份为国为民服务的热忱和爱心。相信年轻部长们能够继续从他学习到更多，让他们更有信心领导我国应付挑战，迈向未来。"}, {"url": "https://hrh.smu.edu.sg/speaker/mr-lee-hsien-loong", "page_content": "About The Speaker\n\nMr Lee Hsien Loong has been Singapore’s Prime Minister since 2004. Mr Lee was first elected as a Member of Parliament in 1984, and has since been re-elected six times, most recently in 2011. He was elected to the Central Executive Committee of the People’s Action Party in 1986, and became its Secretary-General in 2004. Earlier, Mr Lee served in the Ministries of Trade and Industry and of Defence, and was Minister for Finance, Chairman of the Monetary Authority of Singapore, and Deputy Prime Minister.\n\nAs Prime Minister, Mr Lee is focusing on building a competitive economy and an inclusive society. Mr Lee’s Government is also strengthening Singapore’s social safety nets through measures such as MediShield-Life, Workfare and ComCare. Mr Lee also chairs GIC, Singapore’s sovereign wealth fund, and the Research, Innovation and Enterprise Council, an international panel to oversee Singapore’s major efforts in promoting R&D.\n\nMr Lee was born on 10 February 1952. He studied at the University of Cambridge, graduating with a B.A. in Mathematics and a Diploma in Computer Science. He also obtained a Master in Public Administration from the Harvard Kennedy School."}, {"url": "https://live.worldbank.org/experts/lee-hsien-loong", "page_content": "Mr. Lee also chairs GIC, Singapore’s sovereign wealth fund, and the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nMr. Lee is the Secretary-General of the People’s Action Party (PAP). He led PAP to three consecutive Singapore General Elections victories in 2006, 2011 and 2015.\n\nLee Hsien Loong has been Singapore’s Prime Minister since 2004.\n\nMr. Lee is the Secretary-General of the People’s Action Party (PAP). He led PAP to three consecutive Singapore General Elections victories in 2006, 2011 and 2015.\n\nMr. Lee also chairs GIC, Singapore’s sovereign wealth fund, and the Research, Innovation and Enterprise Council, an international panel that provides strategic direction for Singapore’s Research and Development efforts.\n\nAs Prime Minister, he launched SkillsFuture to support Singaporeans in embracing lifelong learning and skills, and the Smart Nation initiative to use technology to create a future of better living, more opportunities and stronger communities.\n\nBefore becoming Prime Minister, Mr. Lee had held various Ministerial appointments, including being Deputy Prime Minister, Minister for Finance, Minister in the Prime Minister’s Office, Minister for Trade and Industry and Second Minister for Defense. He was concurrently the Chairman of the Monetary Authority of Singapore from 1998 until 2004.\n\nBefore joining politics, Mr. Lee had served in the Singapore Armed Forces, retiring as a Brigadier-General.\n\nMr. Lee graduated with a B.A. in Mathematics and a Diploma in Computer Science from the University of Cambridge. He was later a Mason Fellow at the Harvard Kennedy School, receiving a Master’s in Public Administration.\n\nMr. Lee was born on 10 February 1952. He married Dr. Wong Ming Yang in 1978 and was widowed in 1982. He remarried Ho Ching in 1985. He has one daughter and three sons.\n\nMr. Lee enjoys reading, photography, walking, listening to classical music, and computer programming."}, {"url": "https://www.channelnewsasia.com/singapore/tharman-shanmugaratnam-president-lee-hsien-loong-letters-election-3547731", "page_content": "SINGAPORE: Senior Minister Tharman Shanmugaratnam on Thursday (Jun 8) informed Prime Minister Lee Hsien Loong of his decision to retire from politics and all positions in government, in order to contest Singapore's presidential election.\n\nThis is Mr Tharman's letter to Mr Lee, in full:\n\nDear Prime Minister Lee,\n\nI wish to inform you that I have decided to put myself forward as a candidate in the forthcoming Presidential Election. I hence wish to retire from politics and all my positions in Government.\n\nI intend to resign from the People's Action Party, and step down as Senior Minister and Coordinating Minister for Social Policies. I plan to do so a month from now (on 7 July 2023), so that I can first fulfil my immediate official commitments in Singapore and internationally, and ensure that arrangements are fully in place for constituents of Jurong GRC to be well­ served for the rest of the electoral term.\n\nLikewise, I will step down as Chairman of the Monetary Authority of Singapore (MAS), Deputy Chairman of the Government of Singapore Investment Corporation (GIC), Chairman of the Economic Development Board's International Advisory Council and other responsibilities that I have been undertaking in my Ministerial capacity.\n\nI have been humbled by the requests I have received in recent months, from Singaporeans from different walks of life, to stand in the Presidential Election if President Halimah chose not to stand again.\n\nIt has been a difficult decision. I have consulted my family, and given careful thought to how I can best serve the country in the years ahead.\n\nI have spent my whole working life committed to the public service and advancing Singapore's interests. I started off as a professional economist at the MAS. I went on to join the civil service, and asked specifically to serve at the Ministry of Education. I later returned to the MAS when you were Chairman to work with you to stabilise the financial system during the Asian Financial Crisis and reorient how we regulated and developed the system, serving first as Deputy Managing Director and then as Managing Director.\n\nHowever, my greatest privilege has been to serve in politics over the last 22 years. As Member of Parliament (MP), helping residents overcome difficulties and fulfil their aspirations. In my ministerial responsibilities in Government as we made major shifts to build a more inclusive society and restructure the economy. In advancing Singapore's standing through my leadership of various international councils. And in the non-government sector, where I have chaired the board of the Ong Teng Cheong Labour Leadership Institute for two decades and that of SINDA over the last 12 years, and supported other civic organisations.\n\nWe are in a time of transition, both in Singapore and internationally. The '4G' team under DPM Lawrence Wong has been shaping up very well, consulting actively with the public, and rethinking our strategies for the future. The challenges they have to take on will keep evolving, however, well beyond the handover of leadership. They will have to tackle new global crises that will surely emerge, work closely with Singaporeans to retain trust in a changing domestic environment, and ensure Singapore's appeal and relevance in a more divided world.\n\nI believe that I can now best serve Singapore not in politics, but in a different role that has to be above politics. If I am fortunate enough to be elected as President, I will represent the unity of Singaporeans, of all races and religions, social backgrounds, and political leanings, at a time when views in the population are becoming more diverse.\n\nI will be thorough and impartial in fulfilling the constitutional duties of the President with regard to the prudent use of the nation's reserves and the key appointments which preserve the integrity of the Singapore system. I will also work to the best of my abilities to project Singapore's interests and voice of reason in an increasingly turbulent world.\n\nMy greatest sadness is in retiring as an MP on the ground, having built deep-rooted relationships with residents and volunteers in Taman Jurong and the rest of Jurong GRC. I hope to maintain these friendships, many of which go back decades. I am assured that my dedicated fellow MPs in Jurong will work doubly hard to serve all our residents fully during the current electoral term.\n\nI am deeply grateful for the opportunities I have been given to serve Singapore. I am particularly thankful for your leadership, advice and openness to collegial debate through the years, for the teamwork and contributions of all my colleagues in Government, and for the guidance provided by then-PM Mr Goh Chok Tong and his team when I came into Cabinet.\n\nMy role vis-a-vis the Government will change fundamentally if I am elected President. What will never change is my conviction in the continuing Singapore story: a society where everyone has the support to uplift themselves regardless of their starting point in life, and a multiracial nation whose citizens take pride in its unique identity and feel a deepening sense of togetherness.\n\n"}, {"url": "http://wb.beijing.gov.cn/en/center_for_international_exchanges/headlines/202306/t20230606_3125141.html", "page_content": "Yin Li, Secretary of the Communist Party of China (CPC) Beijing Municipal Committee, together with Yin Yong, Deputy Secretary of the CPC Beijing Municipal Committee and Mayor of Beijing, met with Singapore Prime Minister Lee Hsien Loong and his delegation on the morning of March 31.\n\nYin Li, on behalf of the CPC Beijing municipal committee and the municipal government, welcomed Lee and his delegation, thanked Lee for his long-term support for Beijing-Singapore cooperation, and briefed him on the city’s socio-economic development. He said that President Xi Jinping and H.E. the Prime Minister have maintained regular communication in recent years, which provided important strategic guidelines for future China-Singapore relations. The deepened practical cooperation between the two sides shows that the bilateral relationship is forward-looking, strategic, and exemplary in nature. We would like to work with Singapore to implement the consensus and continue to elevate China-Singapore quality cooperation to new heights. The many years of fruitful Beijing-Singapore cooperation in some areas has not only enhanced mutual understanding and friendship but also brought tangible benefits. Tremendous opportunities lie ahead as Beijing strives for its development in the new era and breakthroughs in promoting Chinese modernization through the thorough implementation of the guiding principles of the 20th CPC National Congress. Last year, Beijing-Singapore trade volume surpassed the $10 billion mark. We hope that the two sides can expand cooperation in fields like investment, trade in services, and digital economy, ramp up trade in terms of scale and quality, and create a first-class business environment for enterprises to invest and grow. By leveraging the strengths in education, science and technology, and human resources, the two sides can strive for more cooperation in sci-tech innovation to integrate into the global innovation network. Singapore is welcome to share its experience in improving the innovation and entrepreneurship ecosystem and intellectual property protection, which will lead to more fruitful cooperation in innovation. As Beijing and Singapore have maintained close people-to-people exchanges, we expect H.E. the Prime Minister’s visit to become the driving force for personnel exchanges, cooperation in culture, education, science and technology, tourism and youth development, and mutual learning in urban governance, smart city development, digital and green transformation, and social security, thus enhancing the well-being of the people of both sides.\n\nAccording to Lee, there has been a good partnership between Singapore and Beijing. The visit enabled him to witness the hustle and bustle of this megacity and feel its vitality and prosperity. It is of great significance for both sides to seize opportunities and expand cooperation under new circumstances. He expects more interaction with Beijing at all levels to deepen cooperation in a wider range of areas, including economy and trade, scientific and technological innovation, digital industry, and financial services, and to learn more from each other in culture and tourism, talent training, and urban development and management, so as to continue to benefit the people of both sides through high-quality cooperation.\n\nAfter the meeting, Beijing and Singapore signed a memorandum of understanding to strengthen exchanges and cooperation.\n\nChinese Ambassador to Singapore Sun Haiyan and leaders from Beijing Xia Linmao and Zhao Lei attended the meeting.\n\n(Written by: Qi Mengzhu, Fan Junsheng Photos by: Dai Bing, Sun Yue)"}]}