{"Lucien Turcotte Pacaud was a member of the Royal Commission on Dominion-Provincial Relations from 1937 to 1940.": [{"url": "https://www.wikiwand.com/en/Lucien_Turcotte_Pacaud", "page_content": "Lucien Turcotte Pacaud (September 21, 1879 – March 5, 1960) was a Canadian lawyer and political figure. He represented Mégantic in the House of Commons of Canada from 1911 to 1922 as a Liberal member.\n\nCanadian politician\n\nQuick facts: Lucien Turcotte Pacaud, Member of the Canadia... ▼\n\nHe was born in Trois-Rivières, Quebec, in 1879, the son of Ernest Pacaud and the grandson of Joseph-Édouard Turcotte. He was educated at Bishop's College and Laval University. Pacaud was admitted to the bar in 1904 and practised at Quebec City and then at Thetford Mines. In 1908, he married Helen Elizabeth Buckmall. Pacaud served as police commissioner for the Transcontinental Railway from 1907 to 1911. He was Parliamentary Under Secretary of State for External Affairs, a non-cabinet post, from 1921 to 1922. He served as Secretary to the Canadian High Commissioner at London from 1922 to 1931. In 1930, Pacaud served as acting Canadian High Commissioner to the United Kingdom after the death of Peter Charles Larkin."}, {"url": "https://www.lipad.ca/members/record/68071fca-03f2-4f7c-b33c-2ed63bb08327/5/", "page_content": "1. Were there any persons in the county of Dorchester appointed to the Civil Service, permanently or otherwise, in the inside or outside service, since the 21st September, 1911?\n\n2. If so, what were those positions, and to whom were they given?\n\n3. What is the salary attached to each of these positions?"}, {"url": "https://www.biographies.net/people/en/lucien_turcotte_pacaud", "page_content": "Who was Lucien Turcotte Pacaud?\n\nLucien Turcotte Pacaud was a Quebec lawyer and political figure. He represented Mégantic in the Canadian House of Commons from 1911 to 1922 as a Liberal member.\n\nHe was born in Trois-Rivières, Quebec in 1879, the son of Ernest Pacaud and the grandson of Joseph-Édouard Turcotte. He was educated at Bishop's College and the University of Laval. Pacaud was admitted to the bar in 1904 and practiced at Quebec City and then at Thetford Mines. In 1908, he married Helen Elizabeth Buckmall. Pacaud served as police commissioner for the Transcontinental Railway from 1907 to 1911. He was Parliamentary Under Secretary of State for External Affairs, a non-cabinet post, from 1921 to 1922. He served as Secretary to the Canadian High Commissioner at London from 1922 to 1931. In 1930, Pacaud served as acting Canadian High Commissioner to the United Kingdom after the death of Peter Charles Larkin."}, {"url": "https://www.lipad.ca/members/record/68071fca-03f2-4f7c-b33c-2ed63bb08327/4/", "page_content": "Mr. PACAUD:\n\nThe 27th of June. The department replied on the 29th June, 1916. I may say immediately that I consider this letter the most important of all those written, or received, by the department in connection with this case. It was not on the file with the documents brought down. Here is the letter:\n\nDeputy Minister of Labour, Canada.\n\nOttawa, 29th June, 1916.\n\nSir,-I have the honour to acknowledge receipt of your letter.of the 27th of June, and in answer I am enclosing you four copies of the forms prepared by this office for a request for a council of conciliation and enquiry. We had not noticed that your letter of the 28th of June contained such a request. I hope that the officers of the Federation will continue to do their best to settle amicably these differences, and if this cannot be done through direct negotiations, that the employees will request a council of conciliation and enquiry. There are no special by-laws on this point, but you will find in the forms which we are addressing you, the printed information touching certain details, and in following closely these institutions, the petitioners would evade all errors.\n\nTours very truly,\n\n(Sgd.) F. A. Acland, Deputy Minister of Labour.\n\nMr. L. J. L. Rousseau,\n\nThetford Mines, Que.\n\nI will call the special attention of the minister to this part of the letter. This was a true declaration of policy on the part of the department. The minister was giving in this letter his intention, or the intention of his department, to follow the strict letter of the law as it is laid down in the Industrial Disputes Act 1907:\n\nI hope that the officers of the Federation will continue to do their best to settle amicably\n\ntheir differences, and if this cannot be done through direct negotiations, that the employees will request a council of conciliation and enquiry.\n\nI will refer to this a little later on."}, {"url": "https://www.lipad.ca/members/record/68071fca-03f2-4f7c-b33c-2ed63bb08327/2/", "page_content": "Mr. LUCIEN TUEOOTTE PACATJD (Megantic):\n\nMr. Speaker, in availing myself of this opportunity of discussing the Treaty of Peace, it seems hardly needful for me to say that I fully recognize and appreciate not only the vastness of the problems involved, but also the far-reaching consequences which they will ultimately have on the future of Canada. Laying aside for the time being the reservations and the criticisms which a perusal of this document may suggest to one, I feel prompted at the very outset of my remarks to recall the magnitude of the task of those whose mission was to draft this Treaty, to pacify a world which had, during four years of war, suffered the greatest carnage known in history. I could not better illustrate the thought which I wish to convey, Mr. Speaker, than by citing\n\nthe word of a great French writer and statesman: That during the seven months which preceded, the signing of this Treaty it was as if humanity had been placed on the dissecting table so as to better discover the mystery of its new organism and of its new life, to detect and to stamp out from its very soul the venom which had poisoned it in the past and nearly brought it to its downfall. This was the lofty purpose which the representatives of the great powers had in view, and to what extent their efforts were crowned with success a study of the document which is now the subject of this debate can alone enlighten us.\n\nA Treaty, Sir, which has for its object the re-modelling of a whole world, when presented for ratification to this Parliament -though I strongly hold, as others have done before me, that this ratification is alike dangerous and unnecessary-should not at least have prompted the Government to pursue the course which they had intended to pursue-to snatch from any individual member of this House the time and opportunity to study this Treaty with the care and attention which the interests of this country demand. Such hasty action, Sir, as it was intended to impose upon us was not justified, in my opinion, on any ground of reasoning, and furthermore, may I add, it was in direct contradiction of the attitude which had been taken by the governments of France, of Great Britain and of the United States where the statesmen seem to respect more clearly the privileges and the rights of Parliament than the genr tlemen who for the time being are occupying the treasury benches of this House.\n\nWishing, Mr. Speaker, to curtail my remarks as much as possible, I will endeavour as briefly and as clearly as I can to lay before the House the general conclusions which I have reached and which will explain the vote I intend to cast on this most important matter. It is a fact that this Treaty has been severely criticised and in some quarters unmercifully assailed by men of outstanding character and reputation in all the allied countries. Let us not be surprised at this divergence of view on the part of men who are not responsible for the framing of this instrument, when we recall that the Treaty itself is but the result of a compromise between those who had the responsibility of drafting it.\n\nBearing this thought in mind, what do we find in this Treaty? We find features which will assuredly have the hearty support of the interested people. We find clauses which do not live up to our expectations;\n\nwe find others, again, which seem to shatter the very hopes of those who have sacrificed so much, by endangering the safety and future freedom of action of the countries which they indirectly affect.\n\niSir, what appeals to me most strongly in this Treaty is that in it are to be found, though modified and amended, the principles which prompted and inspired the famous fourteen articles of President Wilson, which at the time of their pronouncement on the 8th of January, 1918, stirred the Allied world, and commanded its hearty and enthusiastic support. What are these principles? Could they not, when considered in their last analysis, be reduced to the following three political axioms:\n\n1. That each part of the final settlement should be based on justice, under reserve of dispositions the most proper to guarantee permanent peace.\n\n2. That no territorial settlement should be made that does not comply with the interests and advantages of the populations involved in the said settlement.\n\n3. That each well-defined nationality should see its aspirations realized in the fullest measure.\n\nMr. Speaker, looking over this Treaty from cover to cover, though we may perceive that these axioms were not always rigorously adhered to, can we not proclaim that it is through the instrumentality of these principles that new nations have come to life, endowed with the blessings of freedom, at last delivered from the yoke of oppression? Unfortunately, Sir, we cannot close our eyes to the fact that great as has been the advance in the right direction, there are still many flaws in this Treaty, regrettable omissions which we may hope soon to see remedied and adjusted. I am frank to admit that for myself I should have liked at this moment, when we are witnessing the births of nations, the resurrection of Poland, the transfer of Alsace-Lorraine to its rightful owners, to see also the final settlement of the Irish question. I only hope and pray that the bitterness engendered through centuries of struggle in that country may soon disappear through the influence of freedom, generously accorded to her people.\n\nThese, Mr. Speaker, are the three considerations which the study of this Treaty from its larger aspect have suggested to me.\n\nI now come to the last and most important point which I wish to raise, as many others have done who preceded me. Is it necessary for this Parliament to ratify this Treaty? What would be the consequence of our ratification or of our .abstaining from ratify-\n\nmg the Treaty? In what direction lies the surest safeguard of Canadian interests, which we are here to protect? These questions have been raised and fully discussed in the course of, this debate. I unhesitatingly range myself with those who have argued, to my mind so well and so conclusively, that ratification by this Parliament is unnecessary and that whatever may be our action in this House, the Treaty will remain unaffected. No amount of sophistry, from whatever quarter it is launched, can, in my opinion, effectively veil this truth: that in the authority within the British Empire to which belongs exclusively the right to declare war in the name of the Empire-the King and his constitutional advisers-is alone vested the power to make peace for that Empire. What, therefore, are the motives that have prompted this Government to such hasty action-to the calling of a special session to ratify a Treaty that needs no ratification by us? It is in the Covenant of the League of Nations, and especially in Article X, that we may find a reason for their action.\n\nI do not wish, Mr. Speaker, to he understood as being opposed to the principle of the League of Nations. I strongly believe that permanent peace cannot be hoped for without the closest co-operation between the democratic nations of the world. These nations are called upon to protect and to defend two principles: the principle of justice inherent in the aspirations of their people, and the principle, too often forgotten, of mutual respect among all nationalities. In the defence of these principles, and to better assure that peace and justice may in the future triumph in the world, we are now erecting a new organism representing alike nationalities and democracies-an organism which is embodied in the Covenant of the League of Nations. But, Sir, could we not have attained this same high purpose through other means than by those which bind this country in the future to abide by the decision of a Council in which we shall not be represented-a decision which may be so far-reaching in its consequences as to have the effect of dragging us into a war, of conscripting our young manhood and our wealth for the purpose of protecting the territorial integrity of other nations, and this without giving to our Parliament the right to deliberate and to decide on the merits of the case?\n\nThe Government, by forcing us to ratify a Treaty though no good can be derived from such action and though no necessity is apparent for it, are only taking advan-\n\ntage of the reluctance that a member may have to reject it on general grounds, in order that they may better pursue their old policy of imperialism in disguise-always ready to raise an altar to Canadian autonomy, but never failing to undermine in action what they so highly praise and proclaim in words.\n\nThis, Mr. Speaker, is the situation as it presents itself to me. It is grave and critical, endangering, as it does our future freedom of action. By the adoption of Article X we are stripping this Parliament of its most valued prerogative; we are placing the Canadian people at the beck and call of a Council not responsible to the nation for its actions. By one stroke of the pen we are mortgaging our freedom, receiving practically nothing in return.\n\nOur prospects under this arrangement are not bright. Let us at least comfort ourselves with the hope that the prophecy of President Poincare of France may yet be realized, when he said that \"real and permanent peace will not emerge from any single instrument of peace, but will be the outcome of a never-ceasing and collective effort on the part of the allied and associated powers.\"\n\nMr. FRANK B. STACEY (Fraser Valley): Mr. Speaker, as I recall the words of the hon. gentleman who leads the Opposition (Mr. McKenzie) in his opening remarks this afternoon, with regard to what should he the characteristics and qualifications of those who take part in this debate, I assure you that it is with the greatest hesitation that I rise to offer any observations whatever upon the subject which is occupying the attention of this House.\n\nWhen Parliament assembled a week ago I had no intention of making any remarks upon this subject. I mistakenly assumed that the language of the document which we are now considering would be couched in legal and technical phraseology and that an ordinary man would have difficulty in understanding it and should, perhaps be silent when the time for discussion came.\n\nBut I found that what is, to my mind, the very heart of the document was capable of interpretation by an ordinary layman or workingman like myself. While I do not presume to discuss the question from the standpoint of its constitutionality, I purpose offering some observations as to the Treaty, especially that part of it called the Covenant of the League of Nations, as it appeals to the ordinary man, to the .man in the street, to the man who is not versed in the technicalities of legal inspection and\n\ndiscussion, But as it is, I believe, regarded by the great majority of ordinary men and women who are interested in knowing something about the real, practical meaning of this Covenant of the League of Nations. I shall not pretend nor attempt to speak respecting the Treaty of Peace itself.\n\nIt strikes me-and I believe it appeals in this way to hundreds of thousands of our citizens-that after five years of agony, heartaches, carnage and immeasurable destruction, the allied nations conceived an idea, that grew into a plan, which was finally formulated into a document, which gives greater promise and 'hope of a lasting peace in this world than has ever before been seen or known by men in the long and chequered history of humanity. The preamble itself is a remarkable and striking statement, a tribute alike to the high spirit of the signatories, and, under the circumstances, to their magnanimity as victors.\n\nI shall presume to offer a few remarks on the article that has been referred to so frequently, not only this evening, but on previous occasions, namely, Article 10. As I have intimated, I have not had a legal training. I do not pretend to read into this Treaty possible difficulties; I do not pretend to be able to discuss the constitutional difficulties which may arise, which are possibly real and genuine and which this nation may have to face in the future. But I remember this, that objection has1 been taken to Article 10 by hon. gentlemen opposite because its .provisions may involve us in conflicts in some far-away section of Europe, or in some distant portion of South America. We must not forget to-day that the world is very small, so small that Jules Verne's book has long since been thrown into the bonfire, and it is quite possible that there are within this Chamber hon. gentlemen who themselves may voyage around the world in less than eight days. All those manifestations and conditions which obtained a generation ago are changed. If distance is to be measured by time, the Atlantic ocean is not any larger than some of our great Canadian lakes used to be. Why should not Canada have a place in the League of Nations? During half a century or more we have grown out of a national infancy and childhood and youth into a young manhood; we have been under the protection of the great Mother Country, and there is, I am sure, no disposition on the part of any one to-day to 9 p.m. break with England. She has, in *a sense, led us by the hand until now, reaching the stage of manhood, we\n\nare, I trust, prepared to take our place beside her, shoulder to shoulder, in every great plan which looks towards the peace, prosperity and happiness of the world. Hon. members opposite have to-day been searching the pages o.f history to ascertain some precedent for the action that is now proposed to be taken. As I see it, we are not reviewing history, we are making history; we are not following precedents, we are establishing precedents. And, why should we not, as a self-governing nation, be prepared, at this stage in our history, to assume our place and take our full measure of responsibility at this critical time in the history of the world?\n\nIn my province, which province by the way sent more than 10 per cent of her total population to the front, there were, during the course of the war-I regret to say this, but I want to be honest-a few men who apparently did not realize the duties of citizenship. True they claimed and desired all the privileges of citizenship in my province; they claimed the right to the franchise; they sought the protection of the British navy and also, the protection of the allied forces, including the protection of the Canadian Expeditionary Force. But for one reason or another they did not enlist. Sometimes they had a fluttering around the heart; sometimes they thought they had a flatfoot, and occasionally we found them obsessed with the idea that they needed a change of climate. For the benefit of their health or for the advantage of their pocket, they concluded that a trip across the line to the 'south would be of advantage to them, and so they went. At any late, they failed to join up, and we had in our province a few men who, while they desired all the privileges of citizenship, refused to assume the responsibilities of citizenship.\n\nI fear lest there may be some spirit akin to the foregoing in the action of those gentlemen here or elsewhere who would like to have the full protection afforded this country by the ratification of the Treaty of Peace, including the League of Nations and including Article X-who would like to have all the advantages and all the privileges, without assuming the responsibilities and obligations which are embodied in that article. It was very aptly pointed out by the hon. member for Megan-tic (Mr. Pacaud), if I mistake not, that this proposition is the application of the idea and principle of co-operation-national co-operation. This is true. I cannot conceive of the Canadian Parliament or the\n\nCanadian people refusing to approve of the Treaty of Peace, especially with regard to this Covenant of the League of Nations. The preamble, I may say, is a marvellous introduction to a state paper that will take its place by the side of any state paper in the annals of human history. I shall read two or three sentences:\n\nIn order to promote international co-operation and to achieve international peace and security -by the acceptance of obligations not to resort to war.\n\nI call attention to the three succeeding clauses:\n\nBy the prescription of open, just and honourable relations between nations; by the firm establishment of the understandings of international law as the actual rule of conduct among governments; and by the maintenance of justice and the scrupulous respect of all Treaty obligations in the dealings of organized peoples with one another.\n\nAs I understand it, Mr. Speaker, these three last clauses that I have read contain the very reasons which led 32,000 of our young men five years ago to rush to Val-cartier. These three clauses give the reason why, a little later in the dark and awful days of the four years that followed, over half a million more of their brothers and sisters went to their aid. The reason is found in this preamble. There is no additional reason to be ascertained; it lies here and here alone. But the words of this preamble are words and only words. They are great words; they will be historic words, and will ever be read as an expression of high statesmanship and of splendid ideas.; but they are words only. The essence, the acid test of this preamble, is found in Article X. You cannot make use of the preamble legitimately, reasonably, logically, without also accepting Article X. 1 believe in my heart, Sir, that it would be an example of the very personification of audacity for any man or any Parliament to say: \"We refuse to approve of Article X,\" and then have the nerve to proceed to approve of the remaining two hundred pages. In the days of. the future should the storm break over our heads or over the head of some other small nation, we are united in our aim to speedily bring the struggle to an end and protect the weaker nation. I claim that there is a greater probability, amounting almost to a certainty, of actual peace than could possibly be secured without the provisions of Article X. And should the storm break and troubles come, then we are prepared to do our share. I take it, Mr. Speaker, that Article X of this Covenant means in\n\nsubstance, in commonplace phraseology stripped of all legal technicalities, that we believe in peace and want peace. It means that we want peace ourselves and want peace for all nations of the world; and because we want it and because we bate war, we are willing to co-operate with other nations in keeping the world's peace so far as may be humanly possible. Is it not reasonable and sane, iand comparatively sure, that with these provisions and with these ideas there is greater probability of peace than if we and all others refused to say \"We shall bind ourselves together in the joint interests of humanity.\" Moreover, is it not a laudable aim for any young nation just entering upon its maturity to ally itself with the very highest civilization of the globe in its determination to be, in a very broad sense, the safeguard and advocate of the peace and prosperity and liberty of the world?\n\nThere is one view of this question that has not been presented to this House. It may not, strictly speaking, be involved in the letter of the Treaty, indeed, I am willing to admit, that it is not; but it appears to me to be a question of very great and serious import. And not only in my humbly judgment but, I believe, in the judgment of the great bulk of the citizens of Canada the question is agitating their minds: They are thinking and speaking about the matter which I am going to venture to introduce to this- House now.\n\nI shall assume that this Parliament will ratify the Treaty of Peace; I shall assume that otir country is entering upon a new era, upon a new and larger life. She has won by the valour of her sons upon the battle field and by the statesmanship of her legislators in the councils of the nations a very high place in the world's record of great deeds. The world over the magic word Canada\" upon the shoulder straps of every Canadian soldier from the humblest private to General Sir Arthur Currie, has been both the pride of the wearer and the admiration, if not indeed the envy, of every observer. With these facts and results behind us, and with a future that one can hardly overestimate ahead of us, and entering now upon a larger national life my problem is: How shall we the Canadian people so relate ourselves to the new conditions and to the new national life to ensure that our country will become not merely great in population or in wealth, but in all those higher attributes of mind and spirit which alone are the assured factors in national prosperity? This, Sir, is the question that has been in my mind and\n\nwhich is in the minds, I have reason to believe, of our best citizens and I believe also, although not expressed as yet, in the minds of the members of this House.\n\nWhere is the Canadian citizen who has not been thrilled, who has not even been moved to tears at the recital of deeds of unparalleled heroism by our soldiers overseas? And of equal courage and matchless devotion of our daughters as they have taken their places in ministering to the needs of those who have been wounded? How can we, I repeat, in view of all these things, so relate ourselves to the future that we shall be equal to the increased responsibilities and obligations which are resting upon us as a nation? If there is any phrase or single sentence that better embodies or suggests the answer to my query than another, it is this: The character and the development of our Canadian citizenship. I am well aware of the fact that this is neither the time nor the place to discuss that question at length, but I shall venture to give a few moments to it because of the reasons I have assigned.\n\nIf I might express in the most general terms my appreciation of the character and the qualities suggested in the term \" Canadian citizenship \" I would do it by referring to four main factors which contribute to such a true and desirable Canadian citizenship. First, in our homes we shall be compelled through youthful inquiries in the future to lay greater emphasis upon patriotic principles and the relation of the family to national life than we found it necessary to do prior to 1914.\n\nThen there is the Canadian press. I suppose that in referring to it I am treading upon sacred ground-or otherwise.. I cannot help but feel that, notwithstanding the very efficient service rendered by the Canadian press to Canadian ideals and to the true spirit of Canadian citizenship, there is one thing that I would fain see changed and changed for the better. I do not think that the cynical spirit sometimes continued almost to exaggeration by the press is conducive to the development of the highest type of Canadian citizenship and ideals. I come to another factor that enters vitally into the character and development of our Canadian citizenship and that. Sir, is found in our school system. We are coming to a day of change. The best citizens behind our public schools realize . that mistakes have been made in the past and that some change is necessary. Throughout this land there is an idea that the day is not far distant when the passing of an examination\n\nwill not be regarded as the be-all and end-all of our public school life. Greater attention must be given to the expression of the individual as a factor in our national life. But speaking of our educational work as a great factor in our national life, I place special emphasis upon the opportunities and obligations of our Canadian colleges.\n\nI do riot now refer to the technical institution which furnishes our country with experts either industrial, economic, professional or scientific. I have in mind the college of liberal arts whether for ladies exclusively or the university course for both sexes leading to the Bachelor's degree. These institutions are in the main turning out not professors or scientific or economic experts but citizens who will take their place in the ordinary ranks of domestic or commercial life, but who, by reason of their extraordinary educational advantages, should be more than ordinary citizens. That is to say, the main objective of the college of liberal arts should not be scholarship but citizenship. The latter must become the goal, the former, a means of reaching it. Our country's future will be largely determined by the ideals of citizenship inspiring our people. The great opportunity and business of the college and university is to project upon society broadminded, or rather spacious-minded, men and women, well-balanced and sane, who will become big citizens. Our country's supreme need to-day, to-morrow and for all time, is not so much bright scholars as big citizens. We need more bigger, broader, better citizens, and the college system or curriculum which fails to produce the goods must either be changed or ultimately go to the scrap heap. The citizen does not exist for the college, but the college for the citizen. Education is of real value only as it qualifies for, and results in, good citizenship. Many a good citizen has never had a college life, but a good citizen is always a truly educated man, nevertheless. Perhaps I can best explain my meaning by the following illustration: A\n\nfew weeks ago I ran across a man in my province who, from the standpoint of the schools, would be called an uneducated man. In fact, Sir, he himself claimed to be an uneducated man and deplored the fact most sincerely and heartily. But I found that he could give me the name and the characteristics of every plant that grew in that district. He could tell me the names and describe the uses of all the trees in that section of the country. If a bird flew by or alighted upon a tree he could\n\ntell me its name and give me all its characteristics. If he saw the footprint of an animal on the ground he could tell me its name and describe its habits-in fact, he was a reliable authority on the entire flora and fauna of that district, and yet he claimed to be an uneducated man. As I said, from the standpoint of the schools, he was uneducated. He knew little of mathematics, less of literature, I doubt if he could spell the word \"philosophy,\" and he thought he knew nothing of science. Moreover, Sir, he was a good citizen, inasmuch as he took his part in the great war faithfully and well. And last June, when the whole of the West between the Bed river and the Pacific was threatened with an incipient Soviet revolution resulting in some of its leaders being imprisoned and not, as the hon. the leader of the Opposition described the other day as being driven to prison because they were labour leaders-far from it, and let me say that the records of the courts have vindicated the position I took here last June and take here to-night-during that unsettled month this man acted as a steadying force in the community. He counselled against rocking the boat. He was a sort of moral and social anchor during the troublous times of last June. He counselled quietness, and steadiness, while some so-called scholars counselled otherwise. That man, Sir, was a good citizen, and from the standpoint of Canadian citizenship well-educated, although from the viewpoint of the schools, he would not perhaps, in the past at least, be so designated. My argument comes to this point: that our university life must so shape itself to meet the demands of the coming generation that the great aim of every college of liberal art in this Dominion, from ocean to ocean, would be nothing less than to turn out the very highest type of Canadian citizenship that can be produced within its walls. This man to whom I refer, I think, illustrated better than any one I have ever met the thought that was given expression to by John Milton two hundred and fifty years ago, and I doubt if his definition has ever been excelled, when he said:\n\nI call therefore a complete and generous education that which enables a man to perform justly, skilfully, and magnanimously, all the offices, public and private, both in peace and war.\n\nNow, I come to discuss, for a few moments only, another factor, another great force, in the creation of a right ideal of Canadian citizenship. I have briefly\n\ntouched upon the home, more briefly upon the press, and perhaps at greater length upon the college. But, Sir, there is still another factor which plays a most important part in the development of that type of citizenship which will enable us as a people and as a nation to take our place and maintain it in the days to come through the new relations that are put upon us. I refer, Sir, to the influence, and the power, and the work of the church. The college man says a good citizen must be an educated citizen. I agree with him, I accept his statement. The church-man will say a good citizen must be a Christian citizen. I do not deny the statement, I am inclined to agree with him. iBut, Sir, I believe this country has come to realize that notwithstanding all they have done in the past the churches of this land must lay more stress, more time, and more energy, upon those means which tend towards the development of a high ideal of Christian citizenship. That church, individual or denominational, will take its place in the Canadian life which, in the largest degree promotes a true and strong citizenship, and not very much longer will there attach to the cloth as such any special recognition or any inherent authority in the social world.\n\nThe churches of our realm have done a grand work for the Empire during the past four or five years; but they have a greater work to do from ocean to ocean in seeking upon all occasions to inject into the minds of their people the paramount importance of Canadian citizenship. I said a few moments ago that the college existed for the citizen, and not the citizen for the college. I go further and say that the church exists for the citizen, and not the citizen for the church. That church will take its place and do its work that sets before its people the highest type of true Canadian citizenship. It is not the cut or the colour of the leader's garb that to-day has or to-morrow will have any influence along the line of real leadership. It is not what is below a man's collar that makes for citizenship, but what is above it. What is above it is of prime importance; what is below vit is of very minor importance.\n\nThe ratification of this Treaty of Peace, including the Covenant of the League, of Nations, Mr. Speaker, will take place, I believe. That means that we are entering upon a new era with a new and a larger life. Our responsibilities are great, our obligations are heavy, but our resources are\n\nalmost boundless. With faith in our future and with confidence in one another and with a sincere purpose to give the very-best that is in us to our country and to posterity, I believe that we can and will not only take our place but maintain that position in the world's great League of Nations.\n\nOn the motion of Hon. Mr. Doherty the House adjourned at 9.40 p.m.\n\nTuesday, September 9, 1919."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/royal-commission-on-dominion-provincial-relations", "page_content": "Dominion-Provincial Relations, Royal Commission on\n\nDominion-Provincial Relations, Royal Commission on (Rowell-Sirois Report) A landmark in the development of Canadian FEDERALISM, the commission was established (1937) unilaterally by the federal government to re-examine \"the economic and financial basis of Confederation and the distribution of legislative powers in the light of the economic and social developments of the last 70 years.\"\n\nCommonly named after its successive chairmen, N.W. Rowell and Joseph Sirois, the 3-volume report (1940) recommended a transfer of functions and a shifting of TAXATION power to the federal government and the creation of grants to the provinces to equalize provincial tax revenues, a principle enshrined in the 1982 Constitution. The federal government was to assume responsibility for unemployment insurance and contributory pensions, and full control of personal and corporate income taxes and succession duties, while taking responsibility for provincial debts. A program of National Adjustment Grants was to make payments to poorer provinces. On the grounds of administrative complexity, provincial autonomy and the need for legislative accountability, the commission rejected greater use of the shared-cost programs, which were to become a central device of postwar \"co-operative federalism.\" WWII and opposition by some provinces prevented the adoption of many recommendations; others were introduced piecemeal. See also CONSTITUTIONAL PROBLEMS."}, {"url": "https://prabook.com/web/lucien.pacaud/2169997", "page_content": "Lucien Pacaud\n\nDiplomat politician\n\nSeptember 21, 1879 (age 80) Trois‐Rivières, Mauricie, Canada\n\nHe represented Mégantic in the Canadian House of Commons from 1911 to 1922 as a Liberal member. He was educated at Bishop\"s College and Laval University. Pacaud was admitted to the bar in 1904 and practiced at Quebec City and then at Thetford Mines. Pacaud served as police commissioner for the Transcontinental Railway from 1907 to 1911. He was Parliamentary Under Secretary of State for External Affairs, a non-cabinet post, from 1921 to 1922. He served as Secretary to the Canadian High Commissioner at London from 1922 to 1931. In 1930, Pacaud served as acting Canadian High Commissioner to the United Kingdom after the death of Peter Charles Larkin."}, {"url": "https://www.lipad.ca/members/record/68071fca-03f2-4f7c-b33c-2ed63bb08327/1/", "page_content": "Mr. L. T. PACAUD (Megantic) :\n\nMr. Speaker, the right hon. the Prime Minister (Mr. Meighen) who preceded me this afternoon will not, I am sure, find me discourteous if I do not follow him closely in the remarks which he uttered. He has given to this House as leader of the Gov-\n\nfirst place, the Opposition fought for information which the minister refused to give. In the, second place, the Opposition requested that, faithful to tradition, faithful to the best procedure in this House, the leaders of both parties should get together, so that in the expenditures of such large appropriations of money, the best interests of Canada should be maintained and safeguarded. What was the result? The better to shut out debate, to eliminate all danger of having to give the information which was sought of them, the Government immediately imposed the closure, making of this Parliament a mere tool of the Government, handing to the few men who happen to be ministers of the Crown to-day, $80,000,000 of the people's money without proper or full discussion by the representatives of the people. To pass their Estimates with the least resistance, the Government uses a double weapon; they sharply curtail discussion through closure, and they rely on all-night sittings of the House, the better to achieve the end which they have in view. This high-handed method of procedure, to my mind, at least, is no mere parliamentary incident which can be easily discarded and forgotten. It is the sapping, at its very basis, of the first function of a parliament, the control of the purse, the control of the expenditure of the people's money.\n\nMay I show this House, by an example, the great benefits that may be derived when this control of Parliament of these expenditures of the public money is maintained, respected and safeguarded by the Government? Let us turn to France. Nobody in this House would like to minimize the record of France, whether it be in time of peace or in time of war. Her strength lies in her patriotism-patriotism that places country ever before party. Let us take her Budget of 1921. It will be to us a lesson which it would be well for us never to forget. The Finance Minister of France was confronted with the figures presented to him by the various departments of the French Government. He, unhesitatingly, began his work of elimination. Estimates comprising many millions of francs were cut out, and he confidently presented to the French Parliament his revised esti mates for their perusal and consideration. What happened? The two Budget commissions of both branches of the French Parliament, with the freedom of action that was denied to us in this House under the circumstances which I related, began in turn to scrutinize the whole range of\n\nnational expenditure, and as a result of their labours-labours unhampered as were ours in this House-there was a reduction in their estimates of three billion francs, accepted by the French Parliament, by the French Government and by the French people. Does this example not show us the dangerous course that we have been following? Does it not show what we have never ceased to claim that it is high time to return to constitutional practice, to put aside these autocratic methods of government which are flourishing to-day as they have never flourished before in the history of this country? Is it not fair to ask that if the Government had given this Parliament the same freedom in the voting of large appropriations of money\n\na freedom that ought to be guaranteed by our constitution, a freedom for which our soldiers fought and for which 60,000 are now lying in France to protest against the autocracy of Germany-should we not, like France, have been able to reduce our Estimates by many millions of dollars, and would not that have been a benefit to the taxpayers of Canada?\n\nThere is another question intimately connected with retrenchment and economy. Every member of this House will agree with me, I am sure, as to the necessity of stimulating production in every branch of industry as a means, if for no other reason, of improving our present financial position. But, Sir, to achieve'this end, to reach the results which we have in view, is it not evident that every producer in Canada, if you wish him to respond to this call, should at least feel and know that no partiality will be displayed to any one section of the community to the detriment of any other section, but that all the producers of Canada will be placed on the same footing with equal opportunities.\n\nSir, let us watch this Government. Let us see to what extent they measure up to this standard without which their policy becomes a mere sham and an outrageous mockery. They start off on a nation-wide campaign, with a great flourish of trumpets, to instil into the hearts and minds of Canadians the necessity for work, and more work, and they couple with that advice a warning to economize-something which the Government never practice themselves-as the one and only means of improving conditions in Canada. The patriotism of the Canadian people, so severely put to the test during the years of high deeds and noble sacrifices, again asserted itself in unmistakable tones. They took the\n\nGovernment at their word and responded loyally to their appeals. The Government, recognizing that production without markets in which to dispose of your products would be like a body without a soul, launched out into their new policy of granting loans and credits to foreign countries. But here, Sir, the scene changes. We find that this Government, appearing to us as preaching giants, are ip reality but pigmies at work.\n\nMay I illustrate by an example that I have in mind? Let us take the credit of $25,000,000 to Belgium. I do not wish to discuss the question of the advisability or otherwise of this Government granting credits to foreign countries. That is a question to my mind intimately connected with the tariff, and would draw me away from the only point I wish to make. I might say, however, that in my view it might be a dangerous form of helping the producer, because you might hurt very considerably the whole body of consumers unless you lowered the duties on the articles affected by such credits; but whether this view be right or wrong, once the Government had decided on such a policy, what I do affirm is that there was no country in the world in which Canada could have found greater security than Belgium, a nation to which the whole allied world owes to-day such a deep debt of gratitude. We have in Belgium, Mr. Speaker, a manufacturing country, which did not need our manufacturers' goods, but wished to avail herself of this loan to secure our Canadian hard wheat. What did this Government do? They made an agreement dated March 21, 1919, by which only one-fourth of this loan to Belgium could be available for the purchase of food stuffs, thus forcing the Belgium Government against their will to purchase manufactured goods and raw materials of manufacture to the extent of four-fifths of the entire loan. What was the result? Just what was to be expected. With the exception of $1,500,000-$277,000 in food stuffs, $185,000 of which was for bacon, an article of food which made a name for itself during the war, and the balance for manufactured goods and raw materials-the credit was cancelled and the Belgium Government had to go . to American bankers to secure our Canadian wheat, which they wanted to get from Canada, but which they could not get in Canada due to the partiality exercised by this Government in enforcing on a manufacturing country this agreement whereby four-fifths of the loan had to be used for the purchase of manufactured products or\n\nraw materials. To throw more light on this subject, and to establish more clearly the case that I have in view, may I be permitted to read a letter which I have received from a correspondent in the West: Regina, March 1, 1921.\n\nDear Mr. Pacaud,\n\nI beg to inform you that I have just returned from an extensive trip in Europe. As you know I have been interested for the last ten years in grain growing in Saskatchewan, and took great pains whilst in Belgium to find out about the 'market conditions and possibilities for the placing of our Canadian wheat in Belgium.\n\nUnfortunately, I have found out that millions of bushels of Canadian hard wheat have been bought in the United States because no credit could be obtained from our Government in Canada, the $25,000,000 credit which had been granted to Belgium only being available for the purchase of manufactured goods, which were not needed in an industrial country. To-day on account of lack of credit in Canada the Belgian Government is unable to fill its requirements in Canada, and would at present place its orders here, which amounts to, between 20,000 and 30,000 tons monthly, if credit could be obtained.\n\nI believe it would be to the advantage of the whole of Canada, to do anything possible in this line, in order to secure that market and it is with that object in view that X have exposed this situation,\n\nI hold this information from high authorities in Belgium and would apreciate it if you kept me posted by wire upon any development in this line, to enable me to inform my friends in Belgium.\n\nI hereby authorize you to make - use of this letter whenever required.\n\nTours sincerely,\n\n( Sgd.) G. POOTMANS.\n\nIn this letter we have not only the evidence of partiality, not only an indication of the enormous commissions made by foreign bankers which should have gone into the pockets of our Canadian farmers, but we note above all what we have never ceased to proclaim, that this Government is nothing more or less than the willing instrument of a few citizens of Canada who have contributed to their political success and who are to-day reaping their reward and inspiring and directing the policies of the Government. This Government is today on trial before the people of Canada. Its whole record since 1911 is before the people of this country, and the Government is tottering to its fall. We trust that the day of reckoning is not very far distant, and we await with confidence, when that day does come, the verdict of our fellow countrymen.\n\nBefore concluding, I desire to say a word on the amendment presented to the House by the member for Shelburne and Queen's (Mr. Fielding). That amendment meets with my approval because it asserts the principle of Liberalism on fiscal matters. It instantaneously brings before my eyes\n\na double picture: On one side, the present fiscal policy of the Government, which is drawing the country to the verge of bankruptcy, and, on the other side, the picture of the Liberal policy inaugurated in 1896 and kept in force for fifteen years, the policy that brought to the citizens of this country happiness and prosperity, and created harmony between province and province, and between race and race,-that harmony which, in my opinion, is needed to instil into the hearts and minds of all Canadians the one thought that we should all have, namely, the common good of our common country."}, {"url": "https://en.unionpedia.org/i/Lucien_Turcotte_Pacaud", "page_content": "Lucien Turcotte Pacaud Lucien Turcotte Pacaud (September 21, 1879 – March 5, 1960) was a Canadian lawyer and political figure. [1]\n\n15 relations: Édouard-Louis Pacaud, Bishop's College School, By-elections to the 14th Canadian Parliament, Ernest Pacaud, Eusèbe Roberge, François-Théodore Savoie, High Commission of Canada in the United Kingdom, Howard Ferguson, List of Canadian diplomats, List of Members of the Canadian House of Commons (P), Mégantic (federal electoral district), Peter Charles Larkin, 12th Canadian Parliament, 13th Canadian Parliament, 14th Canadian Parliament.\n\nÉdouard-Louis Pacaud, (January 20, 1815 – November 18, 1889) was a Quebec lawyer and political figure.\n\nNew!!: Lucien Turcotte Pacaud and Édouard-Louis Pacaud · See more »\n\nThis article is about the school in Canada.\n\nNew!!: Lucien Turcotte Pacaud and Bishop's College School · See more »\n\nBy-elections to the 14th Canadian Parliament were held to elect members of the House of Commons of Canada between the 1921 federal election and the 1925 federal election.\n\nNew!!: Lucien Turcotte Pacaud and By-elections to the 14th Canadian Parliament · See more »\n\nErnest Pacaud (August 25, 1850 – April 19, 1904) was a Quebec lawyer and journalist.\n\nNew!!: Lucien Turcotte Pacaud and Ernest Pacaud · See more »\n\nEusèbe Roberge (3 June 1874 – 10 April 1957) was a Liberal party member of the House of Commons of Canada.\n\nNew!!: Lucien Turcotte Pacaud and Eusèbe Roberge · See more »\n\nFrançois-Théodore Savoie (February 14, 1846 – September 9, 1921) was a Canadian politician.\n\nNew!!: Lucien Turcotte Pacaud and François-Théodore Savoie · See more »\n\nThe High Commission of Canada in the United Kingdom (Haut-commissariat du Canada au Royaume-Uni) in London is the diplomatic mission of Canada to the United Kingdom.\n\nNew!!: Lucien Turcotte Pacaud and High Commission of Canada in the United Kingdom · See more »\n\nGeorge Howard Ferguson, PC (June 18, 1870 – February 21, 1946) was the ninth Premier of Ontario, Canada from 1923 to 1930.\n\nNew!!: Lucien Turcotte Pacaud and Howard Ferguson · See more »\n\nNo description.\n\nNew!!: Lucien Turcotte Pacaud and List of Canadian diplomats · See more »\n\nNo description.\n\nNew!!: Lucien Turcotte Pacaud and List of Members of the Canadian House of Commons (P) · See more »\n\nMégantic was a federal electoral district in the province of Quebec, Canada, that was represented in the House of Commons of Canada from 1867 to 1935, and from 1949 to 1968.\n\nNew!!: Lucien Turcotte Pacaud and Mégantic (federal electoral district) · See more »\n\nPeter Charles Larkin, (May 14, 1855 – February 3, 1930), was a Canadian businessman, diplomat, and political patron.\n\nNew!!: Lucien Turcotte Pacaud and Peter Charles Larkin · See more »\n\nThe 12th Canadian Parliament was in session from 15 November 1911 until 6 October 1917.\n\nNew!!: Lucien Turcotte Pacaud and 12th Canadian Parliament · See more »\n\nThe 13th Canadian Parliament was in session from March 18, 1918, until October 4, 1921.\n\nNew!!: Lucien Turcotte Pacaud and 13th Canadian Parliament · See more »\n\nThe 14th Canadian Parliament was in session from 8 March 1922 until 5 September 1925.\n\nNew!!: Lucien Turcotte Pacaud and 14th Canadian Parliament · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Lucien_Turcotte_Pacaud"}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/royal-commissions", "page_content": "Royal Commissions\n\nRoyal commissions, once described by a member of Parliament as costly travelling minstrel shows, are a form of official inquiry into matters of public concern. They descend from the British monarch's prerogative power to order investigations, said by some to have been exercised first by King William I when he commanded the preparation of the Domesday Book, though the Commission on Enclosures initiated by Henry VIII in 1517 is a more likely prototype of contemporary royal commissions.\n\nClosely related to the royal commissions and often hard to distinguish from them are several other kinds of public inquiry; eg, commissions of inquiry, TASK FORCES and investigations established by departments and other agencies under statutory powers of the Inquiries Act, first passed by Parliament in 1868.\n\nThe Royal Commission Process\n\nAt the federal level royal commissions, task forces and commissions of inquiry are appointed by ORDER-IN-COUNCIL under Part I of the Inquiries Act, while departmental investigations are launched under Part II, but the distinction makes little difference in the functioning of these bodies since they all enjoy the power conferred by the Act to conduct investigations by subpoenaing witnesses, taking evidence under oath, requisitioning documents and hiring expert staff. Royal commissions have the added lustre of being created under the imprint of the Great Seal of Canada, while departmental investigations may stem from any one of at least 87 federal statutes that confer powers of inquiry with or without reference to the Inquiries Act. Aside from these minor distinctions, royal commissions are no more regal than other kinds of inquiries.\n\nDespite their unexceptionality, however, an air of superiority still clings to royal commissions. The public takes them more seriously than other sorts of investigations, and governments tend to reinforce the myth by preferring to appoint royal commissions to examine the gravest matters of concern - eg, FEDERAL-PROVINCIAL RELATIONS, health services, BILINGUALISM AND BICULTURALISM, CORPORATE CONCENTRATION, financial management and accountability, government organization, TAXATION, new reproductive technologies, electoral reform and party financing, and ABORIGINAL PEOPLES.\n\nTask Forces\n\nTask forces, on the other hand, have generally been regarded as more prosaic work crews composed of knowledgeable practitioners rather than eminent luminaries. Often appointed by government departments, they have been assigned to examine such practical matters as PRIVACY and computers, IMMIGRATION procedures, retirement income policy, labour market development, FISHERIES POLICY and sports. However, while it would be tempting to conclude that task forces, departmental investigations and nonroyal commissions are used to probe particular, well-focused problems while royal commissions are devoted to more sweeping national issues, this simple dividing line cannot always be drawn. Some task forces have dealt with broad and important Canadian issues such as housing and urban development, government information, and the structure and foreign ownership of Canadian industry.\n\nAt the same time royal commissions have sometimes been used to tackle specific issues like disasters (both public and personal), ranging from the burning down of the Parliament Buildings and riots in Halifax to judicial and ministerial indiscretions. In fact there is little rhyme or reason to the appellations of investigations because they have frequently been appointed haphazardly and their titles applied rather indiscriminately. The Pepin-Robarts inquiry into national unity called itself a task force when it might well have been a royal commission.\n\nThe McDonald INQUIRY INTO CERTAIN ACTIVITIES OF THE ROYAL CANADIAN MOUNTED POLICE had the dimensions of a royal commission. The probe into the loss of the drill rig Ocean Ranger was changed from a commission into a royal commission. In view of this confusion it is not surprising that the Law Reform Commission has recommended that the term \"royal commission\" be abandoned altogether.\n\nWhy Commissions Are Established\n\nSince Confederation there have been close to 450 federal commissions of inquiry with and without the royal title, more than 1500 departmental investigations, and an undetermined number of task forces. As stated earlier, royal commissions tend to be used either to secure advice upon some important and troublesome general problem or to investigate a specific contentious incident, but critics allege that royal commissions are often established to give a besieged government an excuse to do nothing while a protracted investigation cools the public's temper. Hence the frequency of royal commissions varies from decade to decade; a greater number are usually created during times of crisis, growth and adjustment.\n\nThe cost of having several such acts of national introspection operating simultaneously is not inconsiderable. Though the number of actual commissioners employed in any given inquiry may not be great, ranging from one to the 13 on the (Donald) Macdonald investigation into development prospects, the inclination in recent years to hire a proliferation of high-paid legal counsel and massive research staffs over long periods of time has been costly and increasingly more expensive. The commissions on electoral reform and reproductive technology spent nearly $21 million and $30 million respectively while the commission on aboriginal peoples, reporting in 1996 after five years work, reached a new high of almost $60 million.\n\nFlushing Out Misfeasance and Malfeasance\n\nOn balance, royal commissions and other forms of inquiry probably do more good than harm. At least they are necessary from time to time to flush out misfeasance and malfeasance and to examine matters of major public concern. Some royal commissions have produced significant reports. For example, the Rowell-Sirois report on federal-provincial financial relations, Massey on the arts and Laurendeau-Dunton on bilingualism and biculturalism furnished the documentation for continuing public debate and for some policymaking.\n\nAt the same time it is true that governments for their own reasons frequently ignore reports, whatever their merit. This has been the fate of the reports on reproduction, electoral reform and native affairs. In the case of the investigation into the deployment of Canadian forces in Somalia, the government simply terminated the inquiry before it had completed its examination.\n\nAnother new impediment has emerged recently in the fact-finding work of such bodies. In the Somalia inquiry and the inquiry into the blood system in Canada, some individuals and institutions have taken legal action to forestall the reports from naming them as culpable parties.\n\nEach province has its own Inquiries Act under which it conducts investigations similar to Ottawa's. Although it is difficult to draw comparisons, because even less academic study has been devoted to provincial bodies than to federal, it appears that the provinces have not tended to use royal commissions as often as Ottawa. Ontario appointed 199 royal commissions and commissions of inquiry between 1867 and 1991. The most popular subject for investigation in the 10 provinces has been education. From 1787 to 1978 there were 367 inquiries into education, of which 127 were royal commissions.\n\nAlternatives to Commissions?\n\nVarious alternatives to royal commissions and other forms of inquiry have been discussed recurrently, including the increased use of legislative committees and white papers, which are simply studies and proposals put out tentatively by government departments for public discussion prior to possible action. But legislatures and the House of Commons do not have sufficient time and objectivity to examine many issues; and while the Senate may have the time, the public would probably not accept its views upon a controversial matter as readily as it would receive the opinions of a royal commission headed by a judge or another prominent figure.\n\nSee also ABORIGINAL PEOPLES, ROYAL COMMISSION ON; BANKING AND FINANCE, ROYAL COMMISSION ON; BILINGUALISM AND BICULTURALISM, ROYAL COMMISSION ON; BROADCASTING, ROYAL COMMISSION; CANADA'S ECONOMIC PROSPECTS, ROYAL COMMISSION ON; CONSTITUTIONAL PROBLEMS, ROYAL COMMISSION OF INQUIRY ON; DOMINION-PROVINCIAL RELATIONS, ROYAL COMMISSION ON; ENERGY, ROYAL COMMISSION ON; GOVERNMENT ORGANIZATION, ROYAL COMMISSION ON; NATIONAL DEVELOPMENT IN THE ARTS, LETTERS AND SCIENCES, ROYAL COMMISSION ON; NON-MEDICAL USE OF DRUGS, ROYAL COMMISSION ON THE; PATENTS, COPYRIGHT AND INDUSTRIAL DESIGNS, ROYAL COMMISSION ON; PUBLICATIONS, ROYAL COMMISSION ON; STATUS OF WOMEN IN CANADA, ROYAL COMMISSION ON THE; TAXATION, ROYAL COMMISSION ON; TRANSPORTATION, ROYAL COMMISSION ON; WAR CRIMES; NEW REPRODUCTIVE TECHNOLOGIES, ROYAL COMMISSION ON."}]}