{"Makiko Esumi was born on April 8, 1965.": [{"url": "https://www.famousbirthdays.com/people/makiko-esumi.html", "page_content": "About\n\nJapanese actress who became known for her role as Chinatsu Tsuboi in the television show Shomuni.\n\nBefore Fame\n\nShe worked as a mizo at Izumo-taisha and after she graduated high school, she joined the Tobacco Women's Volleyball team but stopped after receiving an injury in 1989.\n\nTrivia\n\nShe was nominated for a 2002 Japan Academy Prize in the Best Actress category for her role in the Japanese film Inochi.\n\nFamily Life\n\nShe married television director Shin Hirano in 2003, and she has two daughters born in 2005 and 2009.\n\nAssociated With\n\nShe is a contemporary Japanese television actress of Juri Manase."}, {"url": "https://movie.douban.com/celebrity/1037833/", "page_content": "影人简介 · · · · · ·\n\n江角真纪子在高中毕业后原本想做个体育老师，但由于父亲的去世她不得不先考虑经济上的问题，于是她加入了职业排球队，但后来还是因为肩伤而退队。 在住院期间，她受到朋友们的鼓励，转行做了模特并取得了很好的成绩。\n\n1995年她初次主演电影《幻之光》就一举夺得多个电影大奖的新人奖,从此开始引起电视电影界的注目。其奔放、自然、不加修饰的气质令她极受女性观众的拥护。在同类型的山口智子淡出娱乐圈之际,她的表现就更加耀眼。\n\n1998年的《庶务2课》,在完全没人看好的情况下成为1998年最热门的剧集,可以说和她的出色表演关系密切。 江角真纪子1996年与桐岛罗兰多的闪电结婚曾轰动一时,但可惜这段婚姻半年后就以离婚收场。\n\n之后江角曾一度与年龄、身高都要小自己一大块的著名男星武田真治拍拖,两人不顾外界的压力,都大方地对外公布了自己的感情,但最后还是因为种种原因而和平分手。"}, {"url": "https://www.celebsages.com/makiko-esumi/", "page_content": "Birth Name: Makiko Esumi Occupation: TV Actress Born In: Japan Birthdate: December 18, 1966 Age: 56 years old (as of 2023) Ethnicity: Asian Nationality: Japanese Sexuality: N/A\n\nMakiko Esumi was born on the 18th of December, 1966. She is best known for being a TV Actress. She is a contemporary Japanese television actress of Juri Manase. Makiko Esumi’s age is 56. Japanese actress who became known for her role as Chinatsu Tsuboi in the television show Shomuni. The 56-year-old tv actress was born in Japan. She worked as a mizo at Izumo-taisha and after she graduated high school, she joined the Tobacco Women’s Volleyball team but stopped after receiving an injury in 1989. She was nominated for a 2002 Japan Academy Prize in the Best Actress category for her role in the Japanese film Inochi.\n\nCountdown to Makiko’s next birthday.\n\nMakiko Esumi is a Sagittarius and her 57th birthday is in .\n\nJUMP TO: Makiko Esumi’s biography , facts , family , personal life , zodiac , videos , net worth , and popularity .\n\nChildhood\n\nMakiko Esumi was born in 1960s. The 1960s were an era of protests. The decade was dominated by the Vietnam War, Civil Rights Protests, Cuban Missile Crisis, antiwar protests and saw the assassinations of US President John F. Kennedy and Martin Luther King Jr. It also marked the first man landed on the moon. Discover what happened on this day.\n\nMakiko Esumi is part of the Baby boomers generation. Baby Boomer is the result of the end of World War II, when birth rates across the world spiked. They are associated with a rejection of traditional values. These hippie kids protested against the Vietnam War and participated in the civil rights movement.\n\nYou can also find out who is Makiko Esumi dating now and celebrity dating histories at CelebsCouples.\n\nWhile we don't know Makiko Esumi birth time, but we do know her mother gave birth to her on a Sunday. People born on a Sunday can often rely on sympathy from others and generally have luck on their side.\n\n[fetch instagram=”” display=”posts” ]\n\nThe 56-year-old Japanese was born in the Generation X and the Year of the Horse\n\nEducation\n\nThe education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nMakiko Esumi’s mother’s name is unknown at this time and her father’s name is under review. We will continue to update information on Makiko Esumi’s parents.\n\nPersonal Life\n\nLike many famous people and celebrities, Makiko Esumi keeps her personal life private. Once more details are available on who she is dating, we will update this section.\n\nFast Facts\n\nREAL NAME: Makiko Esumi NICKNAME: Makiko Hirano\n\nMARTIAL STATUS: Pending RELIGION: Unknown TATTOOS: N/A AGE GENERATION: Generation X BIRTH SIGN: Sagittarius BIRTH DAY: Sunday DAYS SINCE BIRTH:\n\nNet Worth\n\nThe 56-year-old Japanese tv actress has done well thus far. Majority of Makiko’s money comes from being a tv actress. CelebsMoney has recently updated Makiko Esumi’s net worth .\n\nVideos\n\nHoroscope\n\nZodiac Sign: Makiko Esumi is a Sagittarius. People of this zodiac sign like freedom, travel, philosophy, being outdoors and dislike clingy people, constrained, off-the-wall theories. The strengths of this sign are being generous, idealistic, sense of humor, while weaknesses can be to promise more than can deliver, impatient and say anything no matter how undiplomatic. The greatest overall compatibility with Sagittarius is Gemini and Aries.\n\nChinese Zodiac: Makiko Esumi was born in the Year of the Rabbit. People born under this sign are seen as warm-hearted and easygoing. Independence is one of their greatest strengths, but sometimes they're overly frank with others.\n\n\n\n\n\nRuling Planet: Makiko Esumi has a ruling planet of Jupiter and has a ruling planet of Jupiter and by astrological associations Thursday is ruled by Jupiter. This planet represents abundance, prosperity and the principle of expansion. People who are born with Jupirer as the ruling planet are optimistic and have a big appetite for life.\n\n[fetch instagram=”” display=”posts” show=”2″ ]\n\nMakiko Esumi’s birth sign is Sagittarius and she has a ruling planet of Jupiter.\n\nDon’t miss\n\n– Who’s the richest TV Actress in the world?\n\n– Makiko Esumi Net Worth Stats\n\n– When is Makiko Esumi’s birthday?\n\nAssociated with\n\nFans also viewed"}, {"url": "https://www.liquisearch.com/makiko_esumi/history", "page_content": "History\n\nWhile a high school student, Esumi worked as a miko at Izumo-taisha. After graduating from high school, she signed with the Japan Tobacco Women's Volleyball team (now the JT Marvelous in the V.League). She was injured in 1989 while playing and decided to pursue a career in show business after watching actress and singer Miki Imai on television while recovering in the hospital. She then focused on a career as a fashion model.\n\nIn 1995, Esumi made her acting debut as Yumiko in Maborosi, a film directed by Hirokazu Koreeda. Edward Guthmann of the San Francisco Chronicle gave her acting high praise, describing it as \"extraordinary\" and stating she played the role with \"delicacy and physical grace\". Esumi won the Rookie of the Year Award at both the 19th Annual Japan Academy Prize ceremonies and at the 38th Blue Ribbon Awards for her role in Maborosi. Esumi married photographer Rowland Kirishima in February 1996, though they divorced only nine months later.\n\nShe is probably best known for her leading role as the rebellious office lady Tsuboi Chinatsu in the Shomuni series of TV dramas, the first of which aired on Fuji TV from April to July 1998. A second series aired from April to June 2000, with a third airing from July to September 2002. Several specials were also produced. Esumi made her singing debut on 26 April 2000 with the release of her One Way Drive single. The title song was used as the ending theme to the second Shomuni series, with the lyrics by Esumi and the music by guitarist Tomoyasu Hotei.\n\nEsumi was described as \"stunning\" in her lead role of Stray Cat in the 2001 Pistol Opera, one of Seijun Suzuki last films.\n\nShe was nominated in 2002 for the Best Actress Award at the 26th Annual Japan Academy Prize ceremonies for her role in Inochi.\n\nEsumi and Fuji TV director Shin Hirano were married in 2003. That same year, she began appearing in Japanese government television and print advertisements encouraging the public to make their pension contributions, but started a small scandal in 2004 when it was reported that she was not making those same pension contributions herself. She stated that she thought she had been making the payments, and then corrected the issue by becoming current on her contributions. Esumi's image was removed from the ads at the direction of the Social Insurance Agency after the scandal broke.\n\nHer eldest daughter was born in February 2005, and a second daughter was announced in July 2009 as due to be born in December. Esumi wrote a personal note about this announcement which her talent agency subsequently published on their site.\n\nIn a 20 May 2007 article in the Asahi Shimbun, Esumi revealed that her younger brother had died at the age of 36 the previous May of complications due to cancer."}, {"url": "https://happyhappybirthday.net/en/age/makiko-esumi-person_qsxsle", "page_content": "Makiko Esumi\n\nJapanese actor and writer – Makiko Esumi was born in Izumo (city in Shimane Prefecture, Japan) on December 18th, 1966 and is 56 years old today.\n\nAge How old is Makiko Esumi? 56 Makiko Esumi is 56 years old.\n\nBiographical data\n\nMakiko Esumi\n\nBirthday When was Makiko Esumi born? Makiko Esumi was born on December 18th, 1966.\n\nPlace of Birth Where was Makiko Esumi born? Izumo (city in Shimane Prefecture, Japan).\n\n♐ ♐ Zodiac What is the zodiac sign of Makiko Esumi? Makiko Esumi was born in the zodiac sign Sagittarius (The Centaur/Archer)."}, {"url": "https://www.idolbirthdays.net/makiko-esumi", "page_content": "Does Makiko Esumi Dead or Alive?\n\nAs per our current Database, Makiko Esumi is still alive (as per Wikipedia, Last update: May 10, 2020).\n\n🎂 Makiko Esumi - Age, Bio, Faces and Birthday\n\nCurrently, Makiko Esumi is 56 years, 5 months and 22 days old. Makiko Esumi will celebrate 57rd birthday on a Monday 18th of December 2023. Below we countdown to Makiko Esumi upcoming birthday.\n\nDays Hours Minutes Seconds\n\nPopular As Makiko Esumi Occupation TV Actress Age 56 years old Zodiac Sign Sagittarius Born December 18, 1966 (Japan) Birthday December 18 Town/City Japan Nationality Japan\n\n🌙 Zodiac\n\nMakiko Esumi’s zodiac sign is Sagittarius. According to astrologers, Sagittarius is curious and energetic, it is one of the biggest travelers among all zodiac signs. Their open mind and philosophical view motivates them to wander around the world in search of the meaning of life. Sagittarius is extrovert, optimistic and enthusiastic, and likes changes. Sagittarius-born are able to transform their thoughts into concrete actions and they will do anything to achieve their goals.\n\n🌙 Chinese Zodiac Signs\n\nMakiko Esumi was born in the Year of the Horse. Those born under the Chinese Zodiac sign of the Horse love to roam free. They’re energetic, self-reliant, money-wise, and they enjoy traveling, love and intimacy. They’re great at seducing, sharp-witted, impatient and sometimes seen as a drifter. Compatible with Dog or Tiger.\n\nAbout\n\nJapanese actress who became known for her role as Chinatsu Tsuboi in the television show Shomuni.\n\nBefore Fame\n\nShe worked as a mizo at Izumo-taisha and after she graduated high school, she joined the Tobacco Women's Volleyball team but stopped after receiving an injury in 1989.\n\nTrivia\n\nShe was nominated for a 2002 Japan Academy Prize in the Best Actress category for her role in the Japanese film Inochi.\n\nFamily Life\n\nShe married television director Shin Hirano in 2003, and she has two daughters born in 2005 and 2009.\n\nAssociated With\n\nShe is a contemporary Japanese television actress of Juri Manase.\n\nMakiko Esumi trend"}, {"url": "https://www.wikiwand.com/en/Makiko_Esumi", "page_content": "Makiko Esumi (江角 マキコ, Esumi Makiko) (born 18 December 1966 in Izumo, Shimane Prefecture, Japan)[1][2] is a former Japanese model, actress, writer, essayist, and lyricist. Esumi is most well known for her role as Chinatsu Tsuboi in the Japanese television drama series Shomuni.\n\nQuick facts: Makiko Esumi, Born, Other names, Occupat... ▼\n\nEsumi won the 1995 Rookie of the Year Award at both the 19th Annual Japan Academy Prize ceremonies and at the 38th Blue Ribbon Awards for her role in the 1995 film Maborosi.[1][3][4] She was nominated in 2002 for the Best Actress Award at the 26th Annual Japan Academy Prize ceremonies for her role in Inochi.[1][5]\n\nIn 2000, she released her single, One Way Drive, featuring guitar work and production by Tomoyasu Hotei, who also co-wrote the song with Esumi. She wrote a children's book in 2005.\n\nEsumi is married to Fuji TV director Shin Hirano[1] and is distantly related to Koji Ezumi, a goalkeeper for Omiya Ardija. She was previously married to photographer Rowland Kirishima.[1] She gave birth in 2005 to her first daughter, with her second due to be born in December 2009.\n\nShe is represented by the talent management firm Ken-On."}, {"url": "https://www.celebsagewiki.com/makiko-esumi", "page_content": "Age, Biography and Wiki\n\nMakiko Esumi (Makiko Esumi (江角 真紀子)) was born on 18 December, 1966 in Izumo, Shimane, Japan, is a Model, actress, writer, essayist, lyricist. Discover Makiko Esumi's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 56 years old?\n\nPopular As Makiko Esumi (江角 真紀子) Occupation Model, actress, writer, essayist, lyricist Age 56 years old Zodiac Sign Sagittarius Born 18 December 1966 Birthday 18 December Birthplace Izumo, Shimane, Japan Nationality Japan\n\nWe recommend you to check the complete list of Famous People born on 18 December. She is a member of famous Model with the age 56 years old group.\n\nMakiko Esumi Height, Weight & Measurements\n\nAt 56 years old, Makiko Esumi height is 1.7 m .\n\nPhysical Status Height 1.7 m Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Makiko Esumi's Husband?\n\nHer husband is Shin Hirano (m. 2003), Rowland Kirishima (m. 1996–1996)\n\nFamily Parents Not Available Husband Shin Hirano (m. 2003), Rowland Kirishima (m. 1996–1996) Sibling Not Available Children 2\n\nMakiko Esumi Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Makiko Esumi worth at the age of 56 years old? Makiko Esumi’s income source is mostly from being a successful Model. She is from Japan. We have estimated Makiko Esumi's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Model\n\nMakiko Esumi Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Makiko Esumi Wikipedia Imdb\n\nTimeline"}, {"url": "https://kpopwall.com/esumi-makiko/", "page_content": "Find out the Japanese Actress Esumi Makiko’s Age, Birthday, Height, Weight, Net worth, Biography, and Wiki information in Kpopwall.com\n\nEsumi Makiko Profile and Bio:\n\nEsumi Makiko is an actress from Japan. She was born on December 18, 1966 in Oita, Japan. Her real name is Hirano Makiko and her Romaji name is Esumi Makiko.\n\nFull Name: Esumi Makiko Profession: Actress Age: 56 Date of Birth: 18-Dec-66 Birth Place: Oita, Japan Country: Japan Star Sign: Sagittarius Height: 5 ft 7 in Weight: Not known\n\nBirthday:\n\nEsumi Makiko was born in 1966, on Sunday the 18th of December.\n\nAge:\n\nShe is currently 56 years old.\n\nBirthplace and Residence:\n\nEsumi’s place of birth is Oita, Japan and she currently lives in Japan.\n\nHeight, Weight, and Blood type:\n\nEsumi Makiko’s actual height is 5 feet 7 inches and her blood group is AB.\n\nHeight in Meter: 1.7 Height in Feet and inches: 5′ 7″ Weight in Kg: N/A Weight in Pound (lbs): N/A Blood Type: AB\n\nZodiac Sign:\n\nZodiac Sign: Sagittarius Zodiac Element: Assertive Zodiac Energy: Fire Opposite Zodiac Sign: Gemini Zodiac Sign Gemstone: Topaz Birth Flower: Waratah Chinese Zodiac: Horse\n\nEsumi Makiko’s Ideal Type:\n\nEsumi Makiko’s ideal type of personality is animated, active, energetic.\n\nEducation:\n\nEducation: N/A University: N/A High school / School: N/A\n\nFamily and Relationship:\n\nHusband is director Hirano Shin, daughter (born 2005-Feb) and Son (born 2009-Nov).\n\nFather’s Name: N/A Mother’s Name: N/A Spouse Name: Hirano Shin Relationship Status: Married\n\nNet Worth and Salary:\n\nFrom various websites and interviews, we can get an idea about the income and net worth of Esumi Makiko. As of 2023, Esumi Makiko’s estimated net worth is 1 Million to 2 Million dollars. She has been able to acquire this net income and property due to being in the actress profession.\n\nNet worth in 2023 $1 Million – $2 Million (approx.) Salary in 2023 Not Available Source of Wealth: actress Estimated Wealth Verification Status: Unverified\n\nTrivia and Facts:\n\n\n\nEsumi Makiko’s star sign is Sagittarius and her birth flower is Waratah.\n\nHer talent agency name is Ken-on.\n\nAs per her birth year 1966, she belongs to the Gen X generation.\n\nMovies:\n\n\n\nMushishi / Bugmaster (2007)\n\nTsuribaka Nisshi 15: Hama-chan ni Asu wa Nai? (2004)\n\nInochi (2002)\n\nPistol Opera (2001)\n\nKoi wa Maiorita (1997)\n\nMaboroshi no Hikari (1995)\n\nTV Series:\n\n\n\nNo TV series acting information was found.\n\nTV Shows:\n\n\n\nOlympic no Minoshirokin (TV Asahi, 2013)\n\nShomuni 2013 (Fuji TV, 2013)\n\nBull Doctor (NTV, 2011)\n\nJigoku no Sata mo Yome Shidai (TBS, 2007)\n\nTriple Kitchen (TBS, 2006)\n\nMachiben (NHK, 2006)\n\nOtouto (TV Asahi, 2004)\n\nSore wa, Totsuzen, Arashi no you ni… (TBS, 2004)\n\nMarusa!! (Fuji TV, 2003)\n\nRyuuten no Ouhi – Saigo no Koutei (TV Asahi, 2003)\n\nShomuni 3 (Fuji TV, 2002)\n\nLove Revolution (Fuji TV, 2001)\n\nShomuni 2 (Fuji TV, 2000)\n\nKonya wa Eigyouchu (Fuji TV, 1999)\n\nDokushin Seikatsu (TBS, 1999)\n\nOver Time (Fuji TV, 1999)\n\nGreat Teacher Onizuka (Fuji TV, 1998, cameo)\n\nShomuni (Fuji TV, 1998)\n\nKoi no Katamichi Kippu (NTV, 1997)\n\nTsuki no Kagayaku Yoru Dakara (Fuji TV, 1997)\n\nKonna Watashi ni Dare ga Shita (Fuji TV, 1996)\n\nGlass no Kakeratachi (TBS, 1996)\n\nKagayake! Rintaro (TBS, 1995)\n\nAwards:\n\n\n\nAward information not found.\n\nIs Esumi Makiko Still Alive?\n\nShe is still alive.\n\nSocial Profile:\n\n\n\nWikipedia Profile\n\nSource: Wiki and Interviews (CC BY 3.0)"}, {"url": "https://itsbiography.com/makiko-esumi/", "page_content": "Makiko Esumi was a 55-years-old Japanese Athlete from the Japan. her estimated net worth is $1 Million to $5 Million Approx. Jump into read her life Facts, Wikipedia and biographies Details\n\nMakiko Esumi Biography – Wiki\n\nAccording to the wiki and biography of Makiko Esumi was born on 18 December 1966 in Japan. let’s check out the Makiko’s personal and public life facts, Wikipedia, bio, spouse, net worth, and career details.\n\nFast Facts You Need To Know"}], "Makiko Esumi is an actress.": [{"url": "https://www.wikiwand.com/en/Makiko_Esumi", "page_content": "Makiko Esumi (江角 マキコ, Esumi Makiko) (born 18 December 1966 in Izumo, Shimane Prefecture, Japan)[1][2] is a former Japanese model, actress, writer, essayist, and lyricist. Esumi is most well known for her role as Chinatsu Tsuboi in the Japanese television drama series Shomuni.\n\nQuick facts: Makiko Esumi, Born, Other names, Occupat... ▼\n\nEsumi won the 1995 Rookie of the Year Award at both the 19th Annual Japan Academy Prize ceremonies and at the 38th Blue Ribbon Awards for her role in the 1995 film Maborosi.[1][3][4] She was nominated in 2002 for the Best Actress Award at the 26th Annual Japan Academy Prize ceremonies for her role in Inochi.[1][5]\n\nIn 2000, she released her single, One Way Drive, featuring guitar work and production by Tomoyasu Hotei, who also co-wrote the song with Esumi. She wrote a children's book in 2005.\n\nEsumi is married to Fuji TV director Shin Hirano[1] and is distantly related to Koji Ezumi, a goalkeeper for Omiya Ardija. She was previously married to photographer Rowland Kirishima.[1] She gave birth in 2005 to her first daughter, with her second due to be born in December 2009.\n\nShe is represented by the talent management firm Ken-On."}, {"url": "https://www.celebsages.com/makiko-esumi/", "page_content": "Birth Name: Makiko Esumi Occupation: TV Actress Born In: Japan Birthdate: December 18, 1966 Age: 56 years old (as of 2023) Ethnicity: Asian Nationality: Japanese Sexuality: N/A\n\nMakiko Esumi was born on the 18th of December, 1966. She is best known for being a TV Actress. She is a contemporary Japanese television actress of Juri Manase. Makiko Esumi’s age is 56. Japanese actress who became known for her role as Chinatsu Tsuboi in the television show Shomuni. The 56-year-old tv actress was born in Japan. She worked as a mizo at Izumo-taisha and after she graduated high school, she joined the Tobacco Women’s Volleyball team but stopped after receiving an injury in 1989. She was nominated for a 2002 Japan Academy Prize in the Best Actress category for her role in the Japanese film Inochi.\n\nCountdown to Makiko’s next birthday.\n\nMakiko Esumi is a Sagittarius and her 57th birthday is in .\n\nJUMP TO: Makiko Esumi’s biography , facts , family , personal life , zodiac , videos , net worth , and popularity .\n\nChildhood\n\nMakiko Esumi was born in 1960s. The 1960s were an era of protests. The decade was dominated by the Vietnam War, Civil Rights Protests, Cuban Missile Crisis, antiwar protests and saw the assassinations of US President John F. Kennedy and Martin Luther King Jr. It also marked the first man landed on the moon. Discover what happened on this day.\n\nMakiko Esumi is part of the Baby boomers generation. Baby Boomer is the result of the end of World War II, when birth rates across the world spiked. They are associated with a rejection of traditional values. These hippie kids protested against the Vietnam War and participated in the civil rights movement.\n\nYou can also find out who is Makiko Esumi dating now and celebrity dating histories at CelebsCouples.\n\nWhile we don't know Makiko Esumi birth time, but we do know her mother gave birth to her on a Sunday. People born on a Sunday can often rely on sympathy from others and generally have luck on their side.\n\n[fetch instagram=”” display=”posts” ]\n\nThe 56-year-old Japanese was born in the Generation X and the Year of the Horse\n\nEducation\n\nThe education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nMakiko Esumi’s mother’s name is unknown at this time and her father’s name is under review. We will continue to update information on Makiko Esumi’s parents.\n\nPersonal Life\n\nLike many famous people and celebrities, Makiko Esumi keeps her personal life private. Once more details are available on who she is dating, we will update this section.\n\nFast Facts\n\nREAL NAME: Makiko Esumi NICKNAME: Makiko Hirano\n\nMARTIAL STATUS: Pending RELIGION: Unknown TATTOOS: N/A AGE GENERATION: Generation X BIRTH SIGN: Sagittarius BIRTH DAY: Sunday DAYS SINCE BIRTH:\n\nNet Worth\n\nThe 56-year-old Japanese tv actress has done well thus far. Majority of Makiko’s money comes from being a tv actress. CelebsMoney has recently updated Makiko Esumi’s net worth .\n\nVideos\n\nHoroscope\n\nZodiac Sign: Makiko Esumi is a Sagittarius. People of this zodiac sign like freedom, travel, philosophy, being outdoors and dislike clingy people, constrained, off-the-wall theories. The strengths of this sign are being generous, idealistic, sense of humor, while weaknesses can be to promise more than can deliver, impatient and say anything no matter how undiplomatic. The greatest overall compatibility with Sagittarius is Gemini and Aries.\n\nChinese Zodiac: Makiko Esumi was born in the Year of the Rabbit. People born under this sign are seen as warm-hearted and easygoing. Independence is one of their greatest strengths, but sometimes they're overly frank with others.\n\n\n\n\n\nRuling Planet: Makiko Esumi has a ruling planet of Jupiter and has a ruling planet of Jupiter and by astrological associations Thursday is ruled by Jupiter. This planet represents abundance, prosperity and the principle of expansion. People who are born with Jupirer as the ruling planet are optimistic and have a big appetite for life.\n\n[fetch instagram=”” display=”posts” show=”2″ ]\n\nMakiko Esumi’s birth sign is Sagittarius and she has a ruling planet of Jupiter.\n\nDon’t miss\n\n– Who’s the richest TV Actress in the world?\n\n– Makiko Esumi Net Worth Stats\n\n– When is Makiko Esumi’s birthday?\n\nAssociated with\n\nFans also viewed"}, {"url": "https://japantoday.com/category/entertainment/actress-makiko-esumi-announces-retirement-from-showbiz-denies-affair-rumors", "page_content": "Japanese actress and TV personality Makiko Esumi, 50, announced on Monday that she will be retiring from the show business world, citing personal reasons and denying a magazine report that she is involved in an extramarital affair.\n\nIn a fax message sent to the media by a representative, Esumi said that she has decided to retire from showbiz to “reflect on herself,” and focus on her family, Fuji TV reported.\n\n“I have been working during most of the milestones in my life -- the birth of my children and their growing up. Now it is time for me to take a pause and devote my life to things that only I can do. I have therefore come to this conclusion (to retire from acting and TV),” the statement said.\n\nThe statement further denied the accuracy of an article appearing in the Tuesday issue of a weekly magazine which speculates that Esumi, who has been married for 14 years -- her second marriage -- is involved in an extramarital affair with a man she meets frequently.\n\n“I am not involved in an affair. The man described as my partner in the upcoming article is a business associate,” the statement said. “We are preparing to take legal measures (against the magazine), which is reporting something that is absolutely not true.”\n\nThe message also confirmed that Esumi and her husband, director Shin Hirano, live apart, but that this is only “due to work and lifestyle preferences.\" She denied any plans for a divorce. The couple have two children, a boy and a girl.\n\nEsumi is mostly popular for her role as a mini-skirted “office lady” in the Fuji TV series “Shomuni,” which became a huge hit in the late 1990s. She has starred in seven movies and has appeared in a number of TV dramas and popular variety programs. Esumi is also a winner of 14 showbiz and acting awards, including a “Best Mother Award” in 2010.\n\nIn 2014, the actress became indirectly involved in a major scandal caused by her then-manager, who was caught spraying “idiot” and “stupid son” graffiti on the newly built house of former baseball star and actor Kazushige Nagashima. A number of tabloids reported that Esumi had ordered the manager to commit the vandalism, but it was later revealed that she herself learned of the incident through the media and was not involved. The manager later apologized to Esumi for his actions.\n\nFans were quick to react to Esumi’s retirement, with most of them saying that they regret to see her leaving.”She has been one of the few TV personalities who say things as they are without faking it just to be liked. It’s a pity,” a fan said.\n\n© Japan Today"}, {"url": "https://www.famousbirthdays.com/people/makiko-esumi.html", "page_content": "About\n\nJapanese actress who became known for her role as Chinatsu Tsuboi in the television show Shomuni.\n\nBefore Fame\n\nShe worked as a mizo at Izumo-taisha and after she graduated high school, she joined the Tobacco Women's Volleyball team but stopped after receiving an injury in 1989.\n\nTrivia\n\nShe was nominated for a 2002 Japan Academy Prize in the Best Actress category for her role in the Japanese film Inochi.\n\nFamily Life\n\nShe married television director Shin Hirano in 2003, and she has two daughters born in 2005 and 2009.\n\nAssociated With\n\nShe is a contemporary Japanese television actress of Juri Manase."}, {"url": "https://www.tokyoreporter.com/japan-news/breaking/actress-makiko-esumi-announces-retirement-amid-adultery-speculation/", "page_content": "Actress Makiko Esumi announces retirement amid adultery speculation\n\nTOKYO (TR) – Actress Makiko Esumi, 50, has announced that she is retiring from show business amid speculation that she is engaged in an extra-marital affair, reports Nikkan Sports (Jan. 23).\n\nA statement sent by fax on Monday via a person representing Esumi, who has been married for more than a decade, indicated that she wishes to focus on raising her children. The message also denied the accuracy of a report scheduled to appear in a weekly magazine on Tuesday that claims she is seeing another man.\n\n“This is not adultery,” the statement said, adding that a partner mentioned in the article is actually a business associate. “We are preparing take legal measures against this baseless coverage.”\n\nThe statement did indicate that Esumi and her husband are living apart, “but it is due to work and lifestyle reasons. There are no plans to divorce.”\n\nThe actress is likely best known for her role as an office lady in the “Shomuni” series that ran on Fuji TV in the late 1990s. She had a prominent role in “Pistol Opera,” a film by Seijun Suzuki released in 2001.\n\nAfter Esumi married photographer Rowland Kirishima in 1996, they divorced following the emergence of reports that she engaged in an affair with an actor.\n\nEsumi married director Shin Hirano in 2003. They have a boy and a girl.\n\nWhile working, Esumi gave birth and began raising her children, the statement said in closing. For their well-being, she is setting her career aside after 30 years in the entertainment industry.\n\n“She thinks that it is time to concentrate on choosing what she can only do for her children,” the message said."}, {"url": "https://www.celebsagewiki.com/makiko-esumi", "page_content": "Age, Biography and Wiki\n\nMakiko Esumi (Makiko Esumi (江角 真紀子)) was born on 18 December, 1966 in Izumo, Shimane, Japan, is a Model, actress, writer, essayist, lyricist. Discover Makiko Esumi's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 56 years old?\n\nPopular As Makiko Esumi (江角 真紀子) Occupation Model, actress, writer, essayist, lyricist Age 56 years old Zodiac Sign Sagittarius Born 18 December 1966 Birthday 18 December Birthplace Izumo, Shimane, Japan Nationality Japan\n\nWe recommend you to check the complete list of Famous People born on 18 December. She is a member of famous Model with the age 56 years old group.\n\nMakiko Esumi Height, Weight & Measurements\n\nAt 56 years old, Makiko Esumi height is 1.7 m .\n\nPhysical Status Height 1.7 m Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Makiko Esumi's Husband?\n\nHer husband is Shin Hirano (m. 2003), Rowland Kirishima (m. 1996–1996)\n\nFamily Parents Not Available Husband Shin Hirano (m. 2003), Rowland Kirishima (m. 1996–1996) Sibling Not Available Children 2\n\nMakiko Esumi Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Makiko Esumi worth at the age of 56 years old? Makiko Esumi’s income source is mostly from being a successful Model. She is from Japan. We have estimated Makiko Esumi's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Model\n\nMakiko Esumi Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Makiko Esumi Wikipedia Imdb\n\nTimeline"}, {"url": "https://itsbiography.com/makiko-esumi/", "page_content": "Makiko Esumi was a 55-years-old Japanese Athlete from the Japan. her estimated net worth is $1 Million to $5 Million Approx. Jump into read her life Facts, Wikipedia and biographies Details\n\nMakiko Esumi Biography – Wiki\n\nAccording to the wiki and biography of Makiko Esumi was born on 18 December 1966 in Japan. let’s check out the Makiko’s personal and public life facts, Wikipedia, bio, spouse, net worth, and career details.\n\nFast Facts You Need To Know"}, {"url": "https://asiantv4u.com/articles/japanese/top-10-actresses-who-have-disappeared-from-japanese/", "page_content": "This article describes the actresses who disappeared from Japan and their date of birth, their profession and the films they have featured in, and also their last film in the Japanese film industry. All these disappeared actresses mentioned in this article have won millions of hearts with their acting.\n\n1. Rika Adachi\n\nRika Adachi is a Japanese Tarento and Actress, born on 16 October 1992. She featured in films like Say “I Love You” and Ghost theatre. She appeared in Kizudarake for the last time in Japanese films in 2017. Since then, she has not appeared in any films but appeared in television dramas.\n\n2. Yukina Kinoshita\n\nYukina Kinoshita is a Japanese Actress, model, and television personality born on 4 August 1987. She featured in films like Mistaken and 20th Century Boys- The Movie. She announced a temporary announcement from the entertainment industry in February 2020 and resumed her work for a short time, and after a few days, her agency announced that she had fully retired from the entertainment industry.\n\n3. Saki Aibu\n\nSaki Aibu is an Actress in the Japanese film industry, who was born on 20 June 1985. She is well known for her roles in Attention Please, Zettai Kareshi, Kaseifu no Mita. She appeared for the last time in the Japanese film A loving husband with the role of Sumire Kadokura in 2017. But she has been featuring in TV dramas.\n\n4. Rina Aizawa\n\nRina Aizawa is a Japanese Actress and Gravure idol, born on 28 July 1991. She featured in films like Battle of Demons, Koukou Debut- High school debut, 50 first kisses. She made her last Japanese film, Engine Sentai Go-onger: 10 years grand Prix’ in 2018. She disappeared from Japanese films and is recently being featured in Japanese dramas.\n\n5. Yoko Akino\n\nYoko Akino is a Japanese Actress born on 18 January 1957. She is known for her roles in films like Hush!, The snow white murder case, Shashin Koshien. She made her last appearance in her last Japanese film Shashin Koshien as Eiko, in 2017.\n\n6. Kumiko Akiyoshi\n\nKumiko Akiyoshi is a Japanese Actress, born on 29 July 1954. She featured in films like Deep river, Tsuki no Sabaku, The blue light. She won the best actress award at the 1st Hochi film award. Furthermore, she made her last appearance in the Japanese film Toukou no ki in 2004.\n\n7. Ryoko Yonekura\n\nRyoko Yonekura is a Japanese Actress and a former fashion model, born on 1 August 1975. She featured in films like Danboru Hausu Garu, Gun Crazy: A woman from nowhere, Nezu no Ban, and Sakura no Sono. She made her last appearance in the Japanese film Sakura no Sono in 2008.\n\n8. Makiko Esumi\n\nMakiko Esumi is a former Japanese Model, Actress, writer, essayist, and lyricist born on 18 December 1966. She featured in films like Maborosi, Dinosaur, Inochi, Mushishi. She made her last appearance in the Japanese film, Bolt in 2009. She then disappeared from the Japanese films and has never featured in any Japanese films.\n\n9. Yuko Fueki\n\nYuko Fueki is a Japanese-Korean Actress born on 21 June 1979. She featured in films like Blue swallow, APT, Daichi no Uta. She made her last film appearance in the Japanese film, Lady in white in 2018. From then onwards, she has never appeared in any Japanese film.\n\n10. Takako Fuji\n\nTakako Fuji is a Japanese Actress and Voice Actress, born on 27 July 1972. She featured in films like The Grudge, The Grudge 2, Reincarnation, The iDol. She appeared for the last time in the Japanese film, The cat’s whiskers in 2007. She disappeared from the Japanese films from the year 2007."}, {"url": "https://infofamouspeople.com/famous/makiko-esumi.htm", "page_content": "Makiko Esumi's About ✎]\n\nMakiko Esumi was born on December 18, 1966 (age 56) in Japan. According to numerology, Makiko Esumi's Life Path Number is 7. She is a celebrity tv actress. Japanese actress who became known for her role as Chinatsu Tsuboi in the television show Shomuni. She joined movies and tvshows named Power Office Girls (Since 1998), Maborosi (1995), Guru guru Nainti Nain (Since 1994), Pistol Opera (2001) and Inochi (2002). In Her career, Makiko Esumi has achieved an Japan Academy Award for Newcomer of the Year. Her education: Shimane Prefectural Taisha High School. Her spouse is Shin Hirano , Rowland Kirishima (divorced). Her height is 170 cm (5 ft 7 in). You can find Her website below: https://web.archive.org/web/20090815065200/http://www.ken-on.co.jp/artist/html/esumi.html. More information on Makiko Esumi can be found here. This article will clarify Makiko Esumi's Bio, Wikipedia, Age, Birthday, Height, and other information.\n\nLet's explore Your Tarot online (love,wellness,fortune)\n\nIf you are a fan of Makiko Esumi, tell us more about Her\n\nAdvertisement\n\nFamily, Spouse, Dating, and Relationships of Makiko Esumi ✎]\n\nShe married television director Shin Hirano in 2003, and she has two daughters born in 2005 and 2009.\n\nMakiko Esumi Before Fame ✎]\n\nOn 12-18-1966, Makiko Esumi was born. It indicates that She is on life path 7. Her personal year number in 2023 is 1. She worked as a mizo at Izumo-taisha and after she graduated high school, she joined the Tobacco Women's Volleyball team but stopped after receiving an injury in 1989.\n\nThe Numerology of Makiko Esumi ✎]\n\nLife Path Number 7 is all about introspection and self-awareness. People with a Life Path Number 7 like Makiko Esumi often have an intense inner journey, and they are constantly exploring their own minds and souls. They are seekers of knowledge, and they are always looking to improve themselves.\n\nAdvertisement\n\nMakiko Esumi's personal year in numerology ✎]\n\nIn 2023, Makiko Esumi’s personal year number is 1. The personal year number 1 is considered as a number representing a very strong personal growth. This year is certainly a year of positive changes for Makiko Esumi in Her career.\n\nSuccess of Makiko Esumi ✎]\n\nShe was nominated for a 2002 Japan Academy Prize in the Best Actress category for her role in the Japanese film Inochi.\n\nAssociated with ✎]\n\nShe is a contemporary Japanese television actress of Juri Manase. Courteney Cox, Pamela Anderson, Lori Loughlin, and Lauren Graham were also Her acquaintances.\n\nMakiko Esumi Net Worth ✎]\n\nInformation about Her net worth in 2023 is being updated as soon as possible by infofamouspeople.com, You can also click edit to tell us what the Net Worth of the Makiko Esumi is\n\nMakiko Esumi Height Weight ✎]\n\nAt the age of 56, Makiko Esumi height is 170 cm (5 ft 7 in).\n\n\n\nHouses & Cars & Luxury Brands ✎]\n\nMakiko Esumi's house, cars and luxury brand in 2023 will be updated as soon as possible, you can also click edit to let us know about this information."}, {"url": "https://kpopwall.com/esumi-makiko/", "page_content": "Find out the Japanese Actress Esumi Makiko’s Age, Birthday, Height, Weight, Net worth, Biography, and Wiki information in Kpopwall.com\n\nEsumi Makiko Profile and Bio:\n\nEsumi Makiko is an actress from Japan. She was born on December 18, 1966 in Oita, Japan. Her real name is Hirano Makiko and her Romaji name is Esumi Makiko.\n\nFull Name: Esumi Makiko Profession: Actress Age: 56 Date of Birth: 18-Dec-66 Birth Place: Oita, Japan Country: Japan Star Sign: Sagittarius Height: 5 ft 7 in Weight: Not known\n\nBirthday:\n\nEsumi Makiko was born in 1966, on Sunday the 18th of December.\n\nAge:\n\nShe is currently 56 years old.\n\nBirthplace and Residence:\n\nEsumi’s place of birth is Oita, Japan and she currently lives in Japan.\n\nHeight, Weight, and Blood type:\n\nEsumi Makiko’s actual height is 5 feet 7 inches and her blood group is AB.\n\nHeight in Meter: 1.7 Height in Feet and inches: 5′ 7″ Weight in Kg: N/A Weight in Pound (lbs): N/A Blood Type: AB\n\nZodiac Sign:\n\nZodiac Sign: Sagittarius Zodiac Element: Assertive Zodiac Energy: Fire Opposite Zodiac Sign: Gemini Zodiac Sign Gemstone: Topaz Birth Flower: Waratah Chinese Zodiac: Horse\n\nEsumi Makiko’s Ideal Type:\n\nEsumi Makiko’s ideal type of personality is animated, active, energetic.\n\nEducation:\n\nEducation: N/A University: N/A High school / School: N/A\n\nFamily and Relationship:\n\nHusband is director Hirano Shin, daughter (born 2005-Feb) and Son (born 2009-Nov).\n\nFather’s Name: N/A Mother’s Name: N/A Spouse Name: Hirano Shin Relationship Status: Married\n\nNet Worth and Salary:\n\nFrom various websites and interviews, we can get an idea about the income and net worth of Esumi Makiko. As of 2023, Esumi Makiko’s estimated net worth is 1 Million to 2 Million dollars. She has been able to acquire this net income and property due to being in the actress profession.\n\nNet worth in 2023 $1 Million – $2 Million (approx.) Salary in 2023 Not Available Source of Wealth: actress Estimated Wealth Verification Status: Unverified\n\nTrivia and Facts:\n\n\n\nEsumi Makiko’s star sign is Sagittarius and her birth flower is Waratah.\n\nHer talent agency name is Ken-on.\n\nAs per her birth year 1966, she belongs to the Gen X generation.\n\nMovies:\n\n\n\nMushishi / Bugmaster (2007)\n\nTsuribaka Nisshi 15: Hama-chan ni Asu wa Nai? (2004)\n\nInochi (2002)\n\nPistol Opera (2001)\n\nKoi wa Maiorita (1997)\n\nMaboroshi no Hikari (1995)\n\nTV Series:\n\n\n\nNo TV series acting information was found.\n\nTV Shows:\n\n\n\nOlympic no Minoshirokin (TV Asahi, 2013)\n\nShomuni 2013 (Fuji TV, 2013)\n\nBull Doctor (NTV, 2011)\n\nJigoku no Sata mo Yome Shidai (TBS, 2007)\n\nTriple Kitchen (TBS, 2006)\n\nMachiben (NHK, 2006)\n\nOtouto (TV Asahi, 2004)\n\nSore wa, Totsuzen, Arashi no you ni… (TBS, 2004)\n\nMarusa!! (Fuji TV, 2003)\n\nRyuuten no Ouhi – Saigo no Koutei (TV Asahi, 2003)\n\nShomuni 3 (Fuji TV, 2002)\n\nLove Revolution (Fuji TV, 2001)\n\nShomuni 2 (Fuji TV, 2000)\n\nKonya wa Eigyouchu (Fuji TV, 1999)\n\nDokushin Seikatsu (TBS, 1999)\n\nOver Time (Fuji TV, 1999)\n\nGreat Teacher Onizuka (Fuji TV, 1998, cameo)\n\nShomuni (Fuji TV, 1998)\n\nKoi no Katamichi Kippu (NTV, 1997)\n\nTsuki no Kagayaku Yoru Dakara (Fuji TV, 1997)\n\nKonna Watashi ni Dare ga Shita (Fuji TV, 1996)\n\nGlass no Kakeratachi (TBS, 1996)\n\nKagayake! Rintaro (TBS, 1995)\n\nAwards:\n\n\n\nAward information not found.\n\nIs Esumi Makiko Still Alive?\n\nShe is still alive.\n\nSocial Profile:\n\n\n\nWikipedia Profile\n\nSource: Wiki and Interviews (CC BY 3.0)"}], "Makiko Esumi used to be a fashion model.": [{"url": "https://www.wikiwand.com/en/Makiko_Esumi", "page_content": "Makiko Esumi (江角 マキコ, Esumi Makiko) (born 18 December 1966 in Izumo, Shimane Prefecture, Japan)[1][2] is a former Japanese model, actress, writer, essayist, and lyricist. Esumi is most well known for her role as Chinatsu Tsuboi in the Japanese television drama series Shomuni.\n\nQuick facts: Makiko Esumi, Born, Other names, Occupat... ▼\n\nEsumi won the 1995 Rookie of the Year Award at both the 19th Annual Japan Academy Prize ceremonies and at the 38th Blue Ribbon Awards for her role in the 1995 film Maborosi.[1][3][4] She was nominated in 2002 for the Best Actress Award at the 26th Annual Japan Academy Prize ceremonies for her role in Inochi.[1][5]\n\nIn 2000, she released her single, One Way Drive, featuring guitar work and production by Tomoyasu Hotei, who also co-wrote the song with Esumi. She wrote a children's book in 2005.\n\nEsumi is married to Fuji TV director Shin Hirano[1] and is distantly related to Koji Ezumi, a goalkeeper for Omiya Ardija. She was previously married to photographer Rowland Kirishima.[1] She gave birth in 2005 to her first daughter, with her second due to be born in December 2009.\n\nShe is represented by the talent management firm Ken-On."}, {"url": "https://www.liquisearch.com/makiko_esumi/history", "page_content": "History\n\nWhile a high school student, Esumi worked as a miko at Izumo-taisha. After graduating from high school, she signed with the Japan Tobacco Women's Volleyball team (now the JT Marvelous in the V.League). She was injured in 1989 while playing and decided to pursue a career in show business after watching actress and singer Miki Imai on television while recovering in the hospital. She then focused on a career as a fashion model.\n\nIn 1995, Esumi made her acting debut as Yumiko in Maborosi, a film directed by Hirokazu Koreeda. Edward Guthmann of the San Francisco Chronicle gave her acting high praise, describing it as \"extraordinary\" and stating she played the role with \"delicacy and physical grace\". Esumi won the Rookie of the Year Award at both the 19th Annual Japan Academy Prize ceremonies and at the 38th Blue Ribbon Awards for her role in Maborosi. Esumi married photographer Rowland Kirishima in February 1996, though they divorced only nine months later.\n\nShe is probably best known for her leading role as the rebellious office lady Tsuboi Chinatsu in the Shomuni series of TV dramas, the first of which aired on Fuji TV from April to July 1998. A second series aired from April to June 2000, with a third airing from July to September 2002. Several specials were also produced. Esumi made her singing debut on 26 April 2000 with the release of her One Way Drive single. The title song was used as the ending theme to the second Shomuni series, with the lyrics by Esumi and the music by guitarist Tomoyasu Hotei.\n\nEsumi was described as \"stunning\" in her lead role of Stray Cat in the 2001 Pistol Opera, one of Seijun Suzuki last films.\n\nShe was nominated in 2002 for the Best Actress Award at the 26th Annual Japan Academy Prize ceremonies for her role in Inochi.\n\nEsumi and Fuji TV director Shin Hirano were married in 2003. That same year, she began appearing in Japanese government television and print advertisements encouraging the public to make their pension contributions, but started a small scandal in 2004 when it was reported that she was not making those same pension contributions herself. She stated that she thought she had been making the payments, and then corrected the issue by becoming current on her contributions. Esumi's image was removed from the ads at the direction of the Social Insurance Agency after the scandal broke.\n\nHer eldest daughter was born in February 2005, and a second daughter was announced in July 2009 as due to be born in December. Esumi wrote a personal note about this announcement which her talent agency subsequently published on their site.\n\nIn a 20 May 2007 article in the Asahi Shimbun, Esumi revealed that her younger brother had died at the age of 36 the previous May of complications due to cancer."}, {"url": "https://www.cc.kyoto-su.ac.jp/~trobb/famous2/esumim.html", "page_content": "\n\nEsumi Makiko Date of Birth 18 December 1966 Place of Birth Shimane\n\nEsumi Makiko is a famous actress and popular among the young women in Japan. She has been a fashion magazine model since 1991.\n\nShe used to be a professional volleyball player but she hurt her shoulder in volleyball practice. And she was in hospital in a few month. But thanks to nurse's advice, she become a model in 1991. She was scouted and became an actress.\n\nIn 1995, she appeared on drama \"Kagayake Rintaro\". The same year, she appeared in the film \"Maboroshi no Hikari\". Now (1998) she appears on drama \"Shomuni\" and many commercials such as \"Five-Mini\", Shiseido \"Optune\" and Nissan \"Wing Road\".\n\nIn 1996, She got married with Kirishima Roland who was a cameraman, but they soon divorced. Now she is dating Takeda Shinji.\n\nShe has kept her nice body and smooth skin since the time when she was a model. She has a strong personality and does not hesitate to say her opinions. References: Nichigai-Associates\n\nReported by: Morishita Eri\n\nData verified by: Takahashi Nayumi\n\nDate of Report: June 1998\n\nBack to the main page"}, {"url": "https://alchetron.com/Makiko-Esumi", "page_content": "Makiko Esumi (江角 マキコ, Esumi Makiko) (born 18 December 1966 in Izumo, Shimane Prefecture, Japan) is a former Japanese model, actress, writer, essayist, and lyricist. Esumi is most well known for her role as Chinatsu Tsuboi in the Japanese television drama series Shomuni.\n\nContents\n\nEsumi won the 1995 Rookie of the Year Award at both the 19th Annual Japan Academy Prize ceremonies and at the 38th Blue Ribbon Awards for her role in the 1995 film Maborosi. She was nominated in 2002 for the Best Actress Award at the 26th Annual Japan Academy Prize ceremonies for her role in Inochi.\n\nIn 2000, she released her single, One Way Drive, featuring guitar work and production by Tomoyasu Hotei, who also co-wrote the song with Esumi. She wrote a children's book in 2005.\n\nEsumi is married to Fuji TV director Shin Hirano and is distantly related to Koji Ezumi, a goalkeeper for Omiya Ardija. She was previously married to photographer Rowland Kirishima. She gave birth in 2005 to her first daughter, with her second due to be born in December 2009.\n\nShe is represented by the talent management firm Ken-On.\n\n江角マキコが「消えた」本当の理由/The true reason why Makiko Esumi \"disappeared\"\n\n"}, {"url": "https://movie.douban.com/celebrity/1037833/", "page_content": "影人简介 · · · · · ·\n\n江角真纪子在高中毕业后原本想做个体育老师，但由于父亲的去世她不得不先考虑经济上的问题，于是她加入了职业排球队，但后来还是因为肩伤而退队。 在住院期间，她受到朋友们的鼓励，转行做了模特并取得了很好的成绩。\n\n1995年她初次主演电影《幻之光》就一举夺得多个电影大奖的新人奖,从此开始引起电视电影界的注目。其奔放、自然、不加修饰的气质令她极受女性观众的拥护。在同类型的山口智子淡出娱乐圈之际,她的表现就更加耀眼。\n\n1998年的《庶务2课》,在完全没人看好的情况下成为1998年最热门的剧集,可以说和她的出色表演关系密切。 江角真纪子1996年与桐岛罗兰多的闪电结婚曾轰动一时,但可惜这段婚姻半年后就以离婚收场。\n\n之后江角曾一度与年龄、身高都要小自己一大块的著名男星武田真治拍拖,两人不顾外界的压力,都大方地对外公布了自己的感情,但最后还是因为种种原因而和平分手。"}, {"url": "http://www.geocities.ws/luvly_ducky/Makiko.html", "page_content": "Makiko Esumi\n\n\n\nDate of Birth : 18 December 1966\n\nAstrology Sign : Sagittarius\n\nBlood type : AB\n\nHeight : 175 cm\n\nCarreer Before Acting : Model, Volleyball Player\n\nAward : Best Female Jeanist 1996\n\nAgency : Ken-On\n\n\n\nMakiko is a famous actress and popular among the young women inJapan. SHe has been a fashion magazine model since 1991. She used to be a professional volleyball player but she hurt her shoulder in volleyball practice, then she became a model and actress.\n\nIn 1995, she appeared in drama \"Kagayake Rintaro\" and the film \" Maboroshi no Hikari\".\n\nAfter that she starring in many dramas like \"Shomuni\", \"Over Time\" etc. and she's a presenter for many commercials such as Shiseido, Nissan, Five-Mini etc.\n\nMakiko is allergic to meat, so she gets her nutrition from eating lots of beans!!!\n\n"}, {"url": "https://www.celebsagewiki.com/makiko-esumi", "page_content": "Age, Biography and Wiki\n\nMakiko Esumi (Makiko Esumi (江角 真紀子)) was born on 18 December, 1966 in Izumo, Shimane, Japan, is a Model, actress, writer, essayist, lyricist. Discover Makiko Esumi's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 56 years old?\n\nPopular As Makiko Esumi (江角 真紀子) Occupation Model, actress, writer, essayist, lyricist Age 56 years old Zodiac Sign Sagittarius Born 18 December 1966 Birthday 18 December Birthplace Izumo, Shimane, Japan Nationality Japan\n\nWe recommend you to check the complete list of Famous People born on 18 December. She is a member of famous Model with the age 56 years old group.\n\nMakiko Esumi Height, Weight & Measurements\n\nAt 56 years old, Makiko Esumi height is 1.7 m .\n\nPhysical Status Height 1.7 m Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Makiko Esumi's Husband?\n\nHer husband is Shin Hirano (m. 2003), Rowland Kirishima (m. 1996–1996)\n\nFamily Parents Not Available Husband Shin Hirano (m. 2003), Rowland Kirishima (m. 1996–1996) Sibling Not Available Children 2\n\nMakiko Esumi Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Makiko Esumi worth at the age of 56 years old? Makiko Esumi’s income source is mostly from being a successful Model. She is from Japan. We have estimated Makiko Esumi's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Model\n\nMakiko Esumi Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Makiko Esumi Wikipedia Imdb\n\nTimeline"}, {"url": "https://itsbiography.com/makiko-esumi/", "page_content": "Makiko Esumi was a 55-years-old Japanese Athlete from the Japan. her estimated net worth is $1 Million to $5 Million Approx. Jump into read her life Facts, Wikipedia and biographies Details\n\nMakiko Esumi Biography – Wiki\n\nAccording to the wiki and biography of Makiko Esumi was born on 18 December 1966 in Japan. let’s check out the Makiko’s personal and public life facts, Wikipedia, bio, spouse, net worth, and career details.\n\nFast Facts You Need To Know"}, {"url": "https://japantoday.com/category/entertainment/actress-makiko-esumi-announces-retirement-from-showbiz-denies-affair-rumors", "page_content": "Japanese actress and TV personality Makiko Esumi, 50, announced on Monday that she will be retiring from the show business world, citing personal reasons and denying a magazine report that she is involved in an extramarital affair.\n\nIn a fax message sent to the media by a representative, Esumi said that she has decided to retire from showbiz to “reflect on herself,” and focus on her family, Fuji TV reported.\n\n“I have been working during most of the milestones in my life -- the birth of my children and their growing up. Now it is time for me to take a pause and devote my life to things that only I can do. I have therefore come to this conclusion (to retire from acting and TV),” the statement said.\n\nThe statement further denied the accuracy of an article appearing in the Tuesday issue of a weekly magazine which speculates that Esumi, who has been married for 14 years -- her second marriage -- is involved in an extramarital affair with a man she meets frequently.\n\n“I am not involved in an affair. The man described as my partner in the upcoming article is a business associate,” the statement said. “We are preparing to take legal measures (against the magazine), which is reporting something that is absolutely not true.”\n\nThe message also confirmed that Esumi and her husband, director Shin Hirano, live apart, but that this is only “due to work and lifestyle preferences.\" She denied any plans for a divorce. The couple have two children, a boy and a girl.\n\nEsumi is mostly popular for her role as a mini-skirted “office lady” in the Fuji TV series “Shomuni,” which became a huge hit in the late 1990s. She has starred in seven movies and has appeared in a number of TV dramas and popular variety programs. Esumi is also a winner of 14 showbiz and acting awards, including a “Best Mother Award” in 2010.\n\nIn 2014, the actress became indirectly involved in a major scandal caused by her then-manager, who was caught spraying “idiot” and “stupid son” graffiti on the newly built house of former baseball star and actor Kazushige Nagashima. A number of tabloids reported that Esumi had ordered the manager to commit the vandalism, but it was later revealed that she herself learned of the incident through the media and was not involved. The manager later apologized to Esumi for his actions.\n\nFans were quick to react to Esumi’s retirement, with most of them saying that they regret to see her leaving.”She has been one of the few TV personalities who say things as they are without faking it just to be liked. It’s a pity,” a fan said.\n\n© Japan Today"}, {"url": "https://www.msn.com/en-us/tv/news/makiko-esumi-mai-hosho-naho-toda-yumiko-takahashi-a-collection-of-passionate-images-of-shomni-alumni-members-that-still-continues/ar-AA18ZIin", "page_content": "© FRIDAY DIGITAL The cast of “Shomuni” (Fuji Television Network) at a press conference for the production of “Shomuni” (’98).\n\nAlthough it is now interrupted by Corona, we continue to have a reunion once a year with the “Shomuni” (Fuji TV series) crew, getting together in a private room at an izakaya and talking about what’s going on until late at night. Some bring their children, and it feels like a gathering of relatives. For me, too.It’s a very memorable film for me.”\n\nNaho Toda, 49, who played the secretary in “Shomuni” (Fuji Television Network), said in an interview in “Josei Jishin” (March 14, 2011 issue).\n\nShomuni” is an abbreviation for “General Affairs Section 2,” a department where useless employees are exiled to islands within the company. The male employees working there are listless, but the six female employees are just powerful. The story of these women solving all kinds of problems within the company was well received, and the first series, which began in April 1998, received an average viewer rating of 21.8%.\n\nIn particular, the lead character, Chinatsu Tsuboi, played by Makiko Esumi (56), wears a gorgeous uniform with an ultra-mini skirt and always walks briskly with a stepladder in her arms. Her signature line, ‘What do you think determines a woman’s worth? The number of men! or “Who do you think the earth is for? It’s for me! and other such lines that stuck in the viewers’ minds and greatly influenced Esumi’s character as an actress.\n\nToda played Misono Sugita, Chinatsu’s new colleague, rival and leader of the secretarial section.\n\nMs. Esumi, who runs Shomuni (General Affairs Section 2), where all the lowly office workers gather, and I, who works in the secretarial section, have a controversial argument every time we are in the office, and there are scenes where we get so close that our faces are glaring at each other. I was embarrassed to the point of blushing, but I was entranced by how beautiful she was,” Toda said.\n\nToda said, “I was embarrassed to the point of blushing. Not only Esumi, but all the main members, including Toda, were “beautiful” and popular actresses at the time. Not only in dramas, but also in their private lives, they attracted a lot of public attention. We would like to introduce some of their “treasured love affairs”.\n\nMakiko Esumi kissing Shinji Takeda on the street (February 7, 1997 issue)\n\n© FRIDAY DIGITAL Esumi drives Takeda home in her car. Shortly after this, the two shared an intimate kiss…\n\nEsumi, who had been active as a model since the early 1990s, was very popular. She was rumored to be romantically involved with Kondo Masahiko and Osawa Takao, and married photographer Kirishima Roland in 1996. They divorced after only nine months, and just two months later, this magazine witnessed the scene of her love affair with Shinji Takeda (then 24), six years younger than her. Takeda spent every day at Esumi’s house, and Esumi drove Takeda home, during which time the two shared many intimate kisses.\n\nThe two hit it off when they co-starred in the 1996 drama “Konna ni Watashi ni Who did this to me” (Fuji Television). They started dating right after her divorce from Kirishima. Later, it was reported that Takeda visited Esumi’s parents’ house and they were said to be close to getting married, but Takeda later said that Esumi’s popularity and attention at the time made Takeda tired and it became hard for them to continue their relationship” (sports newspaper reporter).\n\nThereafter, Esumi also had “Late Night Love in a Car” with Koji Miyamoto (56) of “Elephant Kashimashi” (April 14, ’00 issue), but retired from show business in ’17. Mai Hosho (46), who reported “Tropical Love in Bali” (June 28, 1996 issue) with Goro Inagaki (49), also retired from show business in 2010. However, their glorious beauty has not faded away."}]}