{"In 2014, Kate Deines signed with the Washington Spirit of the NWSL.": [{"url": "https://soccer.nbcsports.com/tag/kate-deines/", "page_content": "A weekend that saw Ali Krieger suffer a scary head injury was another reminder of what’s at-risk for players in low-paying leagues around the world.\n\nSure, Krieger’s salary is paid by U.S. Soccer and not the Washington Spirit, but the 30-year-old USWNT player’s story shows is still a cautionary reminder of what the women of the National Women’s Soccer League are putting on the line in order to grow a league by getting by on salaries largely between $6,000-38,000 over six months.\n\n[ SPORTSWORLD: NWSL players chasing the dream ]\n\nConsider the tale of recently-retired 25-year-old Kate Deines, from Jeff Kassouf’s NBC SportsWorld piece on life in the NWSL:\n\nDeines played in 18 matches in 2014 for the Reign, starting half of them. The longtime Pacific Northwest inhabitant was traded to FC Kansas City in the offseason and she is exactly the type of player who is likely to have a great opportunity to take on a more prominent role this season and next as clubs deal with player absences due to the World Cup and Olympics. But Deines, who has a bachelor’s degree in communications and media studies as well as a master’s in continued education from the University of Washington, couldn’t continue to turn down business opportunities in favor of the low-paying league. In the increasingly expensive Seattle housing market, Deines’ income level meant she lived in a five-bedroom house with three teammates and a pair of players from Major League Soccer’s Seattle Sounders. “It definitely feels like an extension of college life, and it is way less glamorous than college,” Deines said.\n\nAs for the on-the-field, some lopsided scores popped up on opening weekend.\n\nSeattle Reign 5-1 Western New York Flash\n\nEven when Megan Rapinoe wasn’t scoring, her Welsh hair-twin Jess Fishlock was making sure a shock of blonde hair was putting a ball in the goal. Rapinoe recorded a hat trick as Seattle busted open the match with four second-half goals. Fishlock and Beverly Yanez also scored, while Jordan Angeli netted for the Flash.\n\nWashington Spirit 0-2 Houston Dash\n\nNew faces shone in Friday’s league opener, as Carli Lloyd and Kealia Ohai scored on each side of halftime and Stephanie Roche subbed on to make her NWSL debut for Randy Waldrum’s Dash. Ashlyn Harris made five saves in the loss.\n\nBoston Breakers 1-4 Portland Thorns\n\nAllie Long goals in the 71st and 72nd minutes salted away this one for the visitors, while Meleana Shim added a goal and two assists. Sinead Farrelly also scored, with Stephanie McCaffrey providing Boston’s only goal.\n\nSky Blue FC 1-0 FC Kansas City\n\nNadia Nadim’s first-half goal helps Sky Blue steal one from FCKC, which out shot the hosts 15-5. Lauren Holiday led all players with four shots, all on goal.\n\nIdle: Chicago Red Stars\n\nFollow @NicholasMendola"}, {"url": "https://www.howold.co/person/kate-deines/biography", "page_content": "Kate Deines Biography\n\nAmerican soccer midfielder-defender\n\nKathleen Ann Deines (born September 17, 1989) is an American soccer midfielder–defender. She most recently played for Turbine Potsdam in the German Bundesliga and Seattle Reign FC of the National Women's Soccer League. Deines was a fourth round pick (23rd overall) of the Atlanta Beat of Women's Professional Soccer in the 2012 WPS Draft of college seniors on January 13, 2012. The WPS Board of Governors voted to suspend the 2012 season on January 30 citing pending legal issues. Subsequently, she was free to sign with other teams and rejoined the Seattle Sounders Women, the organization she had previously played for from 2007 to 2009. After the formation of the National Women's Soccer League in late 2012, Deines played for the Seattle Reign during the league's first two seasons. She was traded to FC Kansas City in late 2014 but announced her retirement from professional soccer on March 31, 2015, before the 2015 season began.\n\nEarly life\n\nDeines was born in Portland, Oregon, on September 17, 1989, to Matt and Betsy Deines. As a freshman at Issaquah High School, Deines helped lead the soccer team to its first state championship final since 1988 and first *le ever. Deines led the team to four consecutive conference championships from 2004 to 2007 and four state *le games, winning three of them. Issaquah's lone runner-up finish was in 2005 when Deines was forced to miss the championship game to join the United States Youth Soccer *ociation Olympic Development Program in Boca Raton, Florida following the semifinal. Issaquah went on undefeated the next two years with Deines in the lineup.\n\nDeines capped off her high school career by scoring the game-winning goal in the 71st minute of the 2007 state final, a 1–0 victory over Seattle Prep.\n\nDeines finished with a total of 76 goals and was named to the all-state team four times and chosen as the state's Gatorade Player of the Year twice. During her senior year she was named to the Parade and NSCAA/adidas Girls High School All-America teams.\n\nDeines has played soccer with the Seattle Sounders Women since joining the team in 2007 while still in high school.\n\nUniversity of Washington\n\nDeines was a four-year starter for the Washington Huskies, starting a school-record 86 games and scoring 21 goals. She was named to the Pac-10 All-Freshman First Team and was a four-time All-Pac-10 selection and a two-time NSCAA Scholar All-American.\n\nAs a freshman at the University of Washington, Deines helped the Huskies return to the NCAA Tournament after a three-year absence. She played a leading role as team captain during her junior year. She converted two key penalty kicks, including the game winner, during an epic penalty shoot-out in a shocking upset of the No. 2 overall seed University of Portland in the second round of the NCAA Tournament. The Huskies would eventually go on to the Elite Eight where they were eliminated in an overtime loss at Boston College.\n\nPlaying career\n\nClub\n\nDrafted to the Atlanta Beat, 2012\n\nDeines was selected as a fourth round pick (23rd overall) by the Atlanta Beat in the 2012 WPS Draft of college seniors on January 13, 2012; however, the league suspended operations before play began.\n\nFrom Seattle to Iceland, 2012\n\nAfter the WPS folded in 2012, Deines signed with the Seattle Sounders Women. She made 12 appearances for the club, scoring one goal. Following the conclusion of the W-League season, Deines and her Sounders teammate and fellow University of Washington alum, Verónica Pérez, played for Stjarnan Women in Iceland's top division. The team won the Icelandic Women's Cup after a 1–0 win over Valur. Of her time in Iceland, Deines said, \"Even though it was a spur of the moment decision to play overseas in Iceland, I believe my three month stint helped in my development as a player. Icelandic soccer was not nearly as technical or tactical as soccer in the United States but the extreme physicality of our practices and games challenged me to play with a whole new level of aggression. Playing professionally in Iceland also allowed me an opportunity to keep practicing and playing games on a daily basis which would not have been the case if I would have stayed in the United States.\"\n\nSeattle Reign FC, 2013–14\n\nIn February 2013, Deines signed with the Seattle Reign FC as a free agent for the inaugural season of the NWSL. Deines made 17 appearances for the club with 11 starts, tallying a total of 979 minutes.\n\nPotsdam, 2014–15\n\nIn September 2014, Deines signed a one-year contract with Germany's Turbine Potsdam in the Bundesliga.\n\nInternational\n\nDeines was a member of the United States U-23 women's national soccer team and traveled to Sweden in June 2011.\n\nPersonal life\n\nDeines' younger brother Jay is an offensive lineman on the football team at Eastern Washington University.\n\nSee also\n\nWomen's *ociation football portal\n\nSports portal\n\n*ociation football portal\n\nBiography portal\n\nList of University of Washington people\n\nList of people from Portland, Oregon\n\nReferences\n\nExternal links\n\nWashington player profile\n\nSeattle Sounders Women player profile\n\nKate Deines at Soccerway\n\nKate Deines on Twitter\n\nWikimedia Commons has media related to Kate Deines."}, {"url": "https://equalizersoccer.com/2014/11/12/seattle-reign-trade-kate-deines-fc-kansas-city-merritt-mathias/", "page_content": "Seattle Reign FC need not change much from 2014. The team started the season on an NWSL record 16-game unbeaten streak, winning the NWSL Shield and coming just short of a championship in the final.\n\nThis came a year after a very different Reign team finished second from bottom in 2013, losing two-thirds of matches played. So the 2013 season brought a complete overhaul. But after such a successful season in 2014, there is far less need for change.\n\nStill, head coach and general manager Laura Harvey made one on Wednesday, trading defender Kate Deines and two 2015 draft picks to FC Kansas City in exchange for the rights to midfielder Merritt Mathias, who has agreed to terms on a contract with Seattle. FC Kansas City will get the a second-round (No. 16 overall) and third-round (No. 26 overall) draft pick in the 2015 NWSL College Draft. Kansas City originally traded that third-round pick to Seattle for Liz Bogus.\n\n“We identified Merritt at the end of the season as someone who would benefit us,” Harvey told The Equalizer. “Our main aim is to keep as many girls as possible, but we think she can really help.”\n\nMathias, 24, played in 44 games over two seasons for FC Kansas City. She typically plays outside back or outside midfielder.\n\nI want to thank everyone that was apart of my two years in KC. You all believed in me from the beginning and for that I am forever grateful. — Merritt Mathias (@merrbear11) November 12, 2014\n\nFC Kansas City defeated Seattle, 2-1 in the NWSL final on August 31, which forced Seattle to do “a lot of soul-searching,” Harvey said.\n\nThe move also gives Deines, who is currently on loan at Turbine Potsdam in the German Bundesliga, the chance to play more. Becky Sauerbrunn will miss time for FC Kansas City to be with the U.S. women’s national team during the World Cup and preparations for it, meaning the Blues will need a solid replacement when their NWSL Defender of the Year is away.\n\n[Lauletta: Deines relishes chances she gets]\n\nDeines had said she was looking for an opportunity to play more, and Harvey agreed to help make it happen if there were a mutually beneficial scenario available. Deines played in 18 games in 2014, starting nine of them.\n\n“I am beyond excited to be a part of FC Kansas City,” Deines said. “This is a great opportunity for my career and I am looking forward to being a member of such a great team and a first class organization.”\n\nSeattle has immediately filled in the void of defensive depth due to Deines’ departure, signing former University of Portland standout Michelle Cruz. The defender most recently played at Cypriot club Apollon Limassol, where Reign backup goalkeeper Haley Kopmeyer is playing on loan.\n\nThe Reign have also re-signed defensive midfielder Mariah Nogueira.\n\nAcquiring Deines comes at the cost of losing two draft picks in a purportedly stocked class of talent, but Harvey is more interested in a player like Cruz, one year removed from college and now with professional experience under her belt.\n\n“We know this draft is strong, but we’ve been saying if we can get a player with a bit more experience, we will,” Harvey said. The Reign still hold a second-round and fourth-round pick.\n\nNWSL teams now how have four international roster spots each, up from three in 2014 (which was up from two in 2013). Seattle could be most well-off with internationals, since their stellar midfield duo of Jess Fishlock (Wales) and 2014 NWSL MVP Kim Little (Scotland) won’t be headed to the World Cup. They are signed through the end of 2015 and 2016, respectively.\n\nAll-league forward Nahomi Kawasumi seems unlikely to return due to the World Cup. Japan also plays in the East Asia Games in August, meaning “Naho” would hardly be available for the Reign.\n\nBut the World Cup is a challenge all coaches across the league will have to deal with. U.S. players are expected to miss about eight games.\n\nFor Harvey, though, the message after such a dominant 2014 season for Seattle is one of avoiding complacency: “We can’t stand still.”"}, {"url": "https://equalizersoccer.com/2013/02/04/seattle-reign-fc-nwsl-free-agent-signings/", "page_content": "SEATTLE — As part of the National Women’s Soccer League free-agent signing period, Seattle Reign FC announced four of its five signings on Monday. Wales captain Jess Fishlock, former Seattle Sounders Women defender Kate Deines, and forwards Tiffany Cameron and Lindsay Taylor will play for Seattle in 2013.\n\nReign FC general manager Amy Carnell said the club would not be using its fifth allotted free-agent slot. By the time it received word that a fifth slot had been made available, Carnell said the club would rather keep the spot open.\n\n“There were a couple prospects (at the last minute), but nobody that really, really stood out to us,” she said in a phone interview following the club announcement.\n\nReign FC was allotted the extra slot after forward Amy Rodriguez announced she is pregnant and will miss the entire 2013 NWSL season. Megan Rapinoe and Teresa Noyola will also miss the start of the season because of short-term contracts in Europe, for Lyon of France and the Netherlands’ ADO Den Haag, respectively.\n\nOf the signed players, midfielder Fishlock carries the most professional accolades into her new team. She was the Wales Player of the Year in 2011 and 2012, as well as an English Women’s Premier League all-star selection last season.\n\nFishlock’s signing is the first recognizable moment of head coach Laura Harvey’s influence, as she comes to Reign FC from her post as Arsenal Ladies manager.\n\n“Jess is a great player who I know a lot about from her time in the English league,” Harvey said in a club release. “She is used to playing overseas, having played in Holland (with AZ Alkmaar) and Australia (with Melbourne Victory). Her experience and ability, I feel, will be crucial to the development of this team.”\n\nFormer Husky Deines grew up in Issaquah, Wash., across the I-90 Bridge from downtown Seattle. She is in the U.S. women’s under-23 player pool.\n\nDeines most recently played for the Stjarnan Women in Iceland after completing a stint with the W-League Seattle Sounders Women. She was the Atlanta Beat’s fourth-round pick in the 2012 WPS Draft before the league cancelled the season and later folded.\n\n“I can’t begin to describe how excited I am to play professionally in Seattle, (in front of) my family and friends,” Deines said. “The support in this city is awesome, and now to have a professional team in Seattle, I can’t even imagine the atmosphere for our home matches.”\n\nShe and fellow Washington graduate Veronica Perez — who was allocated to the Western New York Flash — left for Iceland after playing for the Sounders Women in 2012. They won the Icelandic Women’s Cup while playing for the club based in Garðabær, just outside the capital city of Reykjavik.\n\nDeines’ signing comes as no surprise, as she alluded to her desire to sign with Reign FC repeatedly on Twitter.\n\nCanadian international Cameron received her first caps during Canada’s recent participation in the Yongchuan Cup in China. She entered around the hour mark in all three of Canada’s matches in the tournament.\n\nCameron played collegiately at Ohio State, earning Second Team All-American and First Team All-Big Ten honors in her 2012 senior season. She led her team (and the tied for the conference lead) with 21 goals in 22 games.\n\n“We want forwards who have pace and something special, and I feel Tiffany has these qualities,” head coach Harvey said.\n\nFellow forward Taylor also fits that bill. As a two-time First Team All-American in 2008 and 2011, as well as Soccer America’s National Player of the Year and the Pac-12 Player of the Year in 2011, she scored 53 goals in her four years for 2011 national champion Stanford.\n\n“She has pace and power,” Harvey said. “We will be looking to play a way which suits Lindsay’s strengths.”\n\nTaylor played for Arna-Bjørnar of Norway’s Toppserien in 2012, and she was chosen sixth overall in the 2012 WPS Draft.\n\nReign FC’s next move will be to select six players in Thursday’s NWSL Supplemental Draft, which will be conducted via conference call.\n\nFollow @liviubird\n\n"}, {"url": "https://equalizersoccer.com/2014/08/29/seattle-reign-deines-kopmeyer-relish-chances/", "page_content": "TUKWILA, Wash. — Haley Kopmeyer knows that if things go according to plan she will not play in Sunday’s NWSL Championship. She also knows that she’d better be ready – just in case.\n\n“You’ve got to know that’s your spot” the Seattle Reign FC goalkeeper said after the she trained Friday at Starfire Sports Complex. “It’s definitely a unique position but you train as if you are the first-team keeper. Anything could happen at any moment. There is a very big balance between me going out there and making sure I get everything I need and then as we approach game time, making sure Hope (Solo) gets what she needs.”\n\nKopmeyer was drafted 31st out of 32 in 2013 and served mostly as a second-string goalkeeper for the Reign. She was eventually waived when Solo returned and the club needed a roster spot to add a field player. After clearing waivers she was asked to remain in the area and train with the team, and eventually signed as the backup to Solo last fall.\n\n“I kind of went into the offseason with the (thinking) I don’t know where the best place is going to be,” she said. “I’m going to see how the goalie situation shakes out and then I am going to try and try out somewhere. Laura (Harvey) gave me a call before that could happen and asked me to re-sign. I was thrilled.”\n\n[MORE: Complete coverage of the 2014 NWSL Championship from Seattle]\n\nKate Deines began last season as a starter for the Reign before injury knocked her season off stride. She grew up 20 minutes from Starfire, played college soccer at the University of Washington, and was the local tie to the Reign in 2013. When the season ended the club went on the open market and began adding players.\n\n“There’s always that question mark,” she said about the team having enough room to keep her. “That’s just part of professional sports. There is always that unknown. Someone is always after your spot.”\n\nLike Kopmeyer, Deines is a backup player in the 2014 Reign side, but as a field player there are more opportunities to get into matches. She got into 18 of the 24 regular season games, starting half the time. But Deines totaled less than 900 minutes. And then came the semifinal and the injury to right back Elli Reed. That allowed Deines to start in central defense with Lauren Barnes pushed out to the right.\n\n“It was probably one of the biggest games of my life,” Deines said. “With Elli out that was a huge loss for us. She’s been rock solid for us all season. I had big shoes to fill. I just wanted to come in and do my role for the team. I could not be happier that we got the result and we’re in the championship because that’s what we’ve been working for all season long.”\n\nReed is looking like she’ll start on Sunday, meaning Deines is likely back on the bench. If she had her druthers her position would be center back, but the bench role is usually to sit on top of the back four to help kill the game.\n\n“It really depends on the scenario,” Deines, 24, said. “For the most part I have a fairly good idea of what minute I’ll go in, who I’m going in for, and other responsibilities I’ll have when I go in. All of that is communicated fairly thoroughly and very up front to me. But anything can change at the drop of a dime so it’s just being ready to do whatever the team needs.”\n\nIt is different for Kopmeyer. Only an injury or red card to Solo will get Kopmeyer off the bench. But she must remain ready at a moment’s notice. Or as was the case earlier this season, when a legal issue threatened to take Solo away from the club.\n\nKopmeyer made her season debut June 19 when the Reign won in Boston in June. Solo was expected back three days later in Western New York, but was arrested in Seattle before rejoining the team. That gave Kopmeyer the start against the Flash and she played ahead of Solo the next weekend against Sky Blue.\n\n“We showed in that Boston game that despite not having a lot of national team girls that we had people that could step up and play,” Kopmeyer said. “The second that happened, we said that we’re not sure what’s going to happen but we do know that next game Haley we’ll be in goal. We’ll be fine. If we play the way we’re supposed to play nothing should change. We took it head on and focused in, got some really good results despite everything that was going on around us. We just kept her in our thoughts and have supported her throughout all of this.”\n\nSolo’s legal issues are not resolved yet but it has not affected her time with the Reign since those first few weeks. Kopmeyer played once more, a win over the Dash just after the Reign wrapped up the Shield.\n\nSo for Sunday, it’s business as usual for Kopmeyer, watching…and waiting.\n\n“I just try to stay involved in the game, do as much as I can to try and read the game. Anything that from my side view might give me an advantage,” the 24-year old Kopmeyer said. “I get up at the 20-minute mark and just shake out, make sure I stay loose and make sure I’m feeling alright. It’s one of those things where the chances are…it’s never going to happen, but in case it does I’ll for sure be ready.”"}, {"url": "https://theathletic.com/2934051/2021/11/03/washington-spirit-in-exclusive-sale-negotiations-with-the-st-james-sources-say/", "page_content": "Multiple sources confirmed on Wednesday that the Washington Spirit are in exclusive sale negotiations with The St. James, a sports and performance center in suburban D.C.\n\nThe facility is partially backed by real estate investment firm Cain International, which is primarily based in London and New York. Cain International, in turn, is backed by holding company Eldridge Industries, which was founded by LA Sparks, LA Lakers, and LA Dodgers co-owner Todd Boehly, who sits on Cain’s board.\n\nAdvertisement\n\nThe group has submitted a letter of intent to purchase the Spirit, those sources say, at a valuation of $16 million. News of Boehly’s involvement in particular was first reported by the Washington Post. The group would seek to keep the Spirit in the D.C. metropolitan area.\n\nPer one source, as of this writing, Boehly and the league have not yet been in direct communication about his involvement in any potential purchase. Both sides — and the NWSL itself — sources said on Wednesday, have a ways to go before any sale would be finalized, given a letter of intent is usually non-binding, among other factors.\n\nCurrent Spirit co-owner Michele Kang has long been in talks to purchase the Spirit and has also made her own approach to buy out fellow investors Steve Baldwin and Bill Lynch. One source on Wednesday described Kang’s bid as being “significantly” higher than the potential amount tabled by Boehly’s group. Another source put Kang’s offer to purchase the club at a valuation of “$21 million.”\n\nKang’s rights as an owner of the Spirit may have changed, according to multiple sources. When she purchased her share of the club in early 2021, Kang, Baldwin and Lynch were all entitled to a “right of first refusal,” which gave each of them the ability to match any potential offer for the club. That right of first refusal has since been rescinded by Baldwin and Lynch, said one source, who have long voted in a block, freezing Kang out of board decisions at the Spirit.\n\nAdditionally, should Baldwin and Lynch find a satisfactory buyer for the Spirit, Kang could be forced to sell her shares — something commonly referred to as a “drag-along clause,” wherein majority shareholders can force a minority shareholder to join a sale. Kang declined to comment when reached on Wednesday.\n\nAdvertisement\n\nKang has not been involved in the potential sale to The St. James group due to the potential conflict of interest created by her competing offer, multiple sources said. It’s unclear, still, where the league office itself stands on all of this. In mid-October, NWSL interim CEO Marla Messing said that the league wants to see an owner at the Spirit “that the players like and respect, and that the players feel has their best interest at heart. Whether that’s Michele — or somebody else — I can’t really say.”\n\nThe Washington Spirit’s players and many of the club’s most ardent supporters have made their voices heard about a potential sale of the club, insisting that Baldwin and Lynch simply sell their shares to Kang.\n\nThe St. James labels itself a sports, wellness and entertainment complex with facilities for multiple indoor sports. The St. James acquired youth club FC Virginia in 2019 and earlier this year hired former Spirit assistant coach Tom Torres, announcing that he had joined the St. James FC Virginia coaching staff in late April 2021. The hiring followed Torres’ at-the-time quiet departure from the Spirit in summer of 2020 following the Challenge Cup, where he made inappropriate comments to players, multiple sources told The Athletic.\n\nThe St. James is also a training partner of D.C. United; the two parties signed a five-year agreement in 2019. D.C. United still began construction on their own training facility and performance center in Leesburg at the start of 2021. The St. James has an indoor turf field, but no grass fields, something that could potentially be a hindrance to the Spirit. The Spirit would also still require some kind of tenant relationship with DCU in order to continue playing at Audi and Segra Fields.\n\nOne of Boehly’s other teams, the LA Dodgers, is dealing with its own controversy, as pitcher Trevor Bauer was accused of sexual assault. Some fans and media members were leery of the Bauer signing before the assault allegation came out, questioning the team’s culture if they were willing to hire someone who already had a history of harassing women and mocking transgender people. The Dodgers have also had multiple other incidents of alleged sexual and physical assault by players.\n\nAdvertisement\n\nThose issues call to mind those the Spirit, and the NWSL as a whole, have faced recently. The club’s previous head coach, Richie Burke, was accused by multiple players of verbal abuse and racist behavior, spawning a league investigation that uncovered an array of issues within the club. More recently, Spirit president of sporting operations Larry Best resigned after that investigation found he’d used degrading nicknames for female players and staff.\n\nBoehly’s involvement in the Spirit wouldn’t be the first time he’s shown interest in acquiring a soccer property. He was involved in a failed $3 billion bid to purchase Chelsea FC in 2019 and was initially involved in Inter Miami’s bid to join Major League Soccer, an effort he abandoned in 2017. And of course he already co-owns a women’s sports property, although the acquisition of the LA Sparks was publicly spearheaded by Magic Johnson, who led the Dodgers investment group that included Boehly.\n\nThe Spirit declined to comment when reached on Wednesday. The St. James did not respond to a request for comment.\n\n(Photo: Howard Smith/ISI Photos)"}, {"url": "https://equalizersoccer.com/2015/04/13/nwsl-salaries-minimum-maximum-retirements/", "page_content": "The National Women’s Soccer League kicked off its third season on Friday, a campaign that will see a wide range of players participate due to the World Cup.\n\nMany of amateur players will be called upon by every team over the coming months. They will not be paid for their services. Many of important players who are ‘full-time’ with their teams will play for salaries which will be barely livable.\n\nThe minimum salary in the NWSL this year is $6,842, while the maximum salary is up to $37,800. This season, of course, is a month longer than last despite fewer games. Each team operates on a $265,000 salary cap, which does not include allocated player salaries.\n\nSo how do players make it work? Some live with host families. Some get support from their parents.\n\nAnd others give up, hence all the retirements this offseason.\n\nI wrote a longform story on the subject over at NBC SportsWorld, looking at why players chase the dream and why some give up on it. Here is an excerpt:\n\n“It’s actually pathetic when I think about what we make,” says Deines, who played for Seattle Reign FC for the first two seasons of the NWSL. Deines played in 18 matches in 2014 for the Reign, starting half of them. The longtime Pacific Northwest inhabitant was traded to FC Kansas City in the offseason and she is exactly the type of player who is likely to have a great opportunity to take on a more prominent role this season and next as clubs deal with player absences due to the World Cup and Olympics. But Deines, who has a bachelor’s degree in communications and media studies as well as a master’s in continued education from the University of Washington, couldn’t continue to turn down business opportunities in favor of the low-paying league. In the increasingly expensive Seattle housing market, Deines’ income level meant she lived in a five-bedroom house with three teammates and a pair of players from Major League Soccer’s Seattle Sounders. “It definitely feels like an extension of college life, and it is way less glamorous than college,” Deines said.\n\nCLICK HERE TO READ THE ENTIRE STORY ON NBC SPORTSWORLD"}, {"url": "https://equalizersoccer.com/2014-nwsl-rosters/", "page_content": "Some National Women’s Soccer League clubs revealed their preseason rosters as the nine teams all practiced officially for the first time on Monday. Not all teams have provided comprehensive preseason rosters. This page will be updated as information becomes available. As a disclaimer, the lists compiled below are solely the information provided by the clubs. They are accurate as of March 12, 2014.\n\nBoston Breakers\n\nGoalkeepers (2): Victoria Christ, Kimika Forbes, Jami Kranich, Alyssa Naeher\n\nDefenders (6): Jazmyne Avant, Michelle Cruz, Bianca D’Agostino, Julie King, Kia McNeill, Chelsea Stewart, Cat Whitehill, Ashley Grove\n\nMidfielders (8): Hanna Gilmore, Jess Hurtado, Maddy Evans, Kaylyn Kyle, Joanna Lohman, Kristie Mewis, Katie Oakes, Heather O’Reilly, Suzanne Pires, Jamie Pollock, Dominique Richardson, Lianne Sanderson\n\nForwards (9): Katerin Castro Munoz, Kim DeCesare, Lisa De Vanna, Nkem Ezurike, Courtney Jones, Meghan McMahon, Melissa Ortiz, Mollie Pathman, Jazmine Reeves, Katie Schoepfer, Laura Weinberg, Rachel Wood\n\nChicago Red Stars\n\nForwards: Jennifer Hoy (Chicago Red Stars), Hayley Brock (University of Maryland), Micaela Castain (Washington State), Florence Dadson (Robert Morris University) , Annie Worden (Fordham University)\n\nMidfielders: Zakiya Bywaters (Chicago Red Stars), Lori Chalupny (Chicago Red Stars), Julie Johnston (Santa Clara), Alyssa Mautz (Chicago Red Stars), Julianne Sitch (Chicago Red Stars), Vanessa DiBernardo (University of Illinois), Kelly McCloskey (University of San Diego), Niki Read (University of Illinois), Adriana Leon (Chicago Red Stars)\n\nDefenders: Taryn Hemmings (Chicago Red Stars), Jackie Santacaterina (Chicago Red Stars), Michelle Wenino (Chicago Red Stars), Jessy Battelli (University of Denver), Heather Cooke (Loyola University – MD), Samantha Johnson (University of Southern California), Kecia Morway (Colorado College), Amy LePeilbet (Chicago Red Stars), Rachel Quon (Chicago Red Stars\n\nGoalkeepers: Taylor Vancil (Chicago Red Stars), Clara Kridler (Purdue University), Karina LeBlanc (Portland Thorns FC)\n\n— Christen Press will not report until later in the season.\n\nFC Kansas City\n\nGoalkeepers (3): Nicole Barnhart, Emma Stevens, Sara Keane\n\nDefenders (6): Leigh Ann Robinson, Kassey Kallman, Nia Williams, Nikki Phillips, Shelina Zadorsky, Becky Sauerbrunn\n\nMidfielders (13): Jen Buczkowski, Merritt Mathias, Erika Tymrak, Mandy Laddish, Jenna Richmond, Maegan Kelly, Molly Dreska, Stephanie Thompson, Missy Geha, Liz Bogus, Katrina Gorry, Amy Rodriguez, Frances Silva\n\nForwards (5): Melissa Henderson, Morgan Marlborough, Maegan Kelly, Stephanie Rose\n\nHouston Dash\n\nALPHABETICAL ROSTER\n\nPlayer | Last Club\n\nBrittany Bock | Sky Blue FC\n\nTaryne Boudreau* | LSU\n\nSara Campbell* | Seattle Sounders\n\nHaley Carter*\n\nKarenee Demery* | Cal State\n\nMarissa Diggs | UCF\n\nBecky Edwards | Portland Thorns FC\n\nLindsay Elston* | University of Washington\n\nAnisa Guajardo* | Pepperdine\n\nHolly Hein* | Michigan\n\nBianca Henninger | FC Kansas City\n\nJordan Jackson | Nebraska\n\nKatie Kelly* | FC Kansas City\n\nMegan Kinneman* | LSU\n\nMegan Link* | Afturelding FC (Iceland)\n\nElla Masar | Chicago Red Stars\n\nTiffany McCarty | Washington Spirit\n\nTori McCombs* | Michigan\n\nKelly McFarlene* | North Carolina\n\nTeresa Noyola | FC Kansas City\n\nValorie O’Brien* | South Florida\n\nStephanie Ochs | Washington Spirit\n\nKealia Ohai | North Carolina\n\nEmilee O’Neill* | Portland Thorns FC\n\nDominique Richardson* | Missouri\n\nArianna Romero | Seattle Reign FC\n\nAya Sameshima | Vegalta Sendai\n\nRafaelle Souza | Ole Miss\n\nKylie Strom* | Boston University\n\nKika Toulouse | Washington Spirit\n\nCatiana Vitanza* | FCF Como (Italy)\n\nNikki Washington | Portland Thorns FC\n\n*Trialist\n\nRoster, not in preseason: Whitney Engen, Meghan Klingenberg, Erin McLeod, Lauren Sesselmann\n\nPortland Thorns FC\n\nNAME | POS | HT | DOB | NATIONALITY | COLLEGE/SCHOOL\n\nJackie Acevedo F 5-2 01/18/87 Mexico Southern Nazarene Univ.\n\nNadine Angerer GK 5-9 11/10/78 Germany n/a\n\nMichelle Betos GK 5-9 02/25/88 United States Georgia\n\nAmber Brooks M 5-6 01/23/91 United States Univ. of North Carolina\n\nStephanie Catley D 5-8 01/26/94 Australia n/a\n\nSinead Farrelly M 5-5 11/16/89 United States Virginia\n\nTobin Heath M 5-6 05/29/88 United States Univ. of North Carolina\n\nAngie Kerr M 5-5 03/29/85 United States Univ. of Portland\n\nAllie Long M 5-8 08/13/87 United States Univ. of North Carolina\n\nNikki Marshall D 5-7 06/02/88 United States Colorado\n\nEmily Menges D 5-2 07/28/92 United States Georgetown\n\nJessica McDonald F 6-0 02/28/88 United States Univ. of North Carolina\n\nAlex Morgan F 5-7 07/02/89 United States Univ. of California, Berkeley\n\nRebecca Moros D 5-5 05/06/85 United States Duke\n\nMeleana Shim M 5-4 09/25/91 United States Santa Clara University\n\nChristine Sinclair F 5-9 06/12/83 Canada Univ. of Portland\n\nElisabeth Sullivan F 5-5 12/28/91 United States Mississippi State\n\nRachel (Buehler) Van Hollebeke D 5-5 08/26/85 United States Stanford\n\nCourtney Wetzel D/M 5-7 02/25/89 United States Oregon State\n\nKathryn Williamson D 5-6 08/01/89 United States Florida\n\n*Names of trialists were not provided.\n\nSeattle Reign FC\n\nGoalkeepers: Haley Kopmeyer, Hope Solo and Jamie Arthurs*\n\nDefenders: Lauren Barnes, Kate Deines, Kiersten Dallstream, Elli Reed, Amanda Frisbie, Kendall Fletcher, Megan Brigman*, Bree Rowe*, Jen LaPonte*\n\nMidfielders: Keelin Winters, Danielle Foxhoven, Mariah Nogueira, Julia Roberts*, Tori Adame*, Nikki Stanton* , Macy Jo Harrison* and Nicolette DiGiacomo*\n\nForwards: Bev Goebel, Sydney Leroux, Megan Rapinoe, Ellen Parker*, Lyndsey Patterson*, and Tesa McKibben*\n\n* Denotes trialist\n\nSky Blue FC\n\nLast Name First Name Position\n\nCameron, Brittany GK\n\nFonseca, Yirlania Arroyo GK*\n\nLevin, Cami D\n\nGoodson, CoCo D\n\nCutshall, Lindsi D\n\nJohnson, Kendall D\n\nHaagsma, Hayley D\n\nThompson, Maddie D\n\nJohnson Morgan D\n\nNick Ashley M\n\nClarke Ashley M\n\nFreels Katy M\n\nLytle Taylor M\n\nHayes Maya F\n\nBreton Rachel M*\n\nDiPaolo Trish M*\n\nSchaeffer Mallory M*\n\nDutra Amanda M\n\nMcGregor Jodi-Ann M\n\nReilly Lauren F\n\nWashington Renee F\n\nBrown Caroline F\n\nHenry Donnakay F\n\n*Trialist\n\n— Japanese midfielder Nanse Kiryu will arrive at a later date.\n\nWashington Spirit\n\nGoalkeepers:\n\nAdelaide Gay: Portland Thorns FC – Univ. of North Carolina\n\nDijana Haracic: Washington Spirit Reserves – Layola Univ.\n\nAshlyn Harris: Tyresö Fotbollsförening/Washington Spirit – USWNT – Univ. of North Carolina\n\nLyndse Hokanson: George Mason Univ.\n\nChantel Jones: Perth Glory FC/Washington Spirit – Univ. of Virginia\n\nDefenders:\n\nCandace Chapman: Washington Spirit – CANWNT – Univ. of Notre Dame\n\nRobin Gayle: Washington Spirit\n\nTori Huster: Western Sydney Wanderers FC/Washington Spirit – Florida State Univ.\n\nAli Krieger: Washington Spirit – USWNT – Penn State Univ.\n\nToni Pressley: Washington Spirit – Florida State Univ.\n\nShasta Fisher: Univ. of Virginia\n\nAlexa St Martin: Georgetown Univ.\n\nBianca Sierra: MEXWNT – Auburn Univ.\n\nMidfielders:\n\nJordan Angeli: Boston Breakers – Santa Clara Univ.\n\nYael Averbuch: Kopparbergs/Göteborg FC – USWNT – Univ. of North Carolina\n\nMadeline Barker: Atlanta Fire United – Univ. of Georgia\n\nJordan Clark: Karlsruher SC – Univ. of Akron\n\nCrystal Dunn: USWNT – Univ. of North Carolina\n\nLori Lindsey: Canberra United/Washington Spirit – Univ. of Virginia\n\nDiana Matheson: Washington Spirit – CANWNT – Princeton Univ.\n\nMeagan Morris: Univ. of North Carolina\n\nChristine Nairn: Seattle Reign FC – Penn State Univ.\n\nKelsey Pardue: Washington Spirit Reserves – Longwood Univ.\n\nJennifer Skogerboe: Washington Spirit Reserves – Univ. of Connecticut\n\nCecilie Sandvej: Perth Glory FC – DENWNT\n\nColleen Williams: Washington Spirit – Univ. of Dayton\n\nZaneta Wyne: GBK Kokkola – Univ. of New Mexico\n\nForwards:\n\nDanesha Adams: Ataşehir Belediyespor/Sky Blue FC – UCLA\n\nRenae Cuellar: FC Kansas City – Oklahoma Univ.\n\nGloria Douglas: Triangle Futbol 91 Navy – Univ. of Virginia\n\nCaroline Miller: Washington Spirit – Univ. of Virginia\n\nJodie Taylor: Sydney FC – Oregon State Univ.\n\nTiffany Weimer: Portland Thorns FC – Penn State Univ.\n\nReporting at a later time:\n\nNiki Cross: Bayern Munich\n\nVeronica Perez: Western NY Flash – MEXWNT – Univ. of Washington\n\nWestern New York Flash\n\nName – Pos – Last Club\n\nTorri Allen – D – University of Georgia*\n\nAmy Barczuk – D – WNY Flash\n\nArianna Criscione – GK – Torres CF*\n\nNicholette DiGiacomo – M – University of Denver*\n\nKristen Edmonds – D – FC Rossiyanka\n\nAdrianna Franch – GK – WNY Flash\n\nKristen Hamilton – F – University of Denver^\n\nSarah Huffman – M – WNY Flash\n\nSelenia Iacchelli – M – Edmonton Victoria SC\n\nEstelle Johnson – D – WNY Flash\n\nSamantha Kerr – F – WNY Flash\n\nEmma Kete – F – Sydney FC\n\nAlly Lee – D – University of Jacksonville*\n\nCarli Lloyd – M – WNY Flash\n\nVicky Losada – M – FC Barcelona\n\nAdriana Martin – F – WNY Flash\n\nKristen Meier – M – Seattle Reign*\n\nHaley Palmer – D – San Diego State University*\n\nCasey Ramirez – D – Portland Thorns FC*\n\nKatherine Reynolds – D – WNY Flash\n\nYoreli Rincon – M – Malmo FF*\n\nJordon Roseboro – M – Bay Area Breeze*\n\nAngela Salem – M – WNY Flash\n\nBrianna Smith – F – Canisius College*\n\nJasmyne Spencer – F – Washington Spirit*\n\nAnnie Steinlage – D – University of Virginia^\n\nBrittany Taylor – D – WNY Flash\n\nCourtney Verloo – F – Stanford University^\n\nAbby Wambach – F – WNY Flash\n\nKelsey Wys – GK – Florida State University^\n\nMcCall Zerboni – M – WNY Flash\n\n*Preseason Training Camp Invitee\n\n^2014 NWSL Draft Pick"}, {"url": "https://www.sandiegouniontribune.com/sports/national/story/2022-02-02/rodman-signs-richest-nwsl-contract-ever-with-spirit", "page_content": "FILE - Washington Spirit forward Trinity Rodman (2) plays during the second half of the NWSL Championship soccer match against Chicago Red Stars Saturday, Nov. 20, 2021, in Louisville, Kentucky. A number of U.S. women’s national team veterans were left off of coach Vlatko Andonovski’s January training camp roster as the squad prepares its younger players for World Cup qualifying this summer. Rodman is on the roster. (AP Photo/Jeff Dean, File)\n\nThe Washington Spirit have signed Trinity Rodman to the richest contract in the history of the National Women’s Soccer League.\n\nThe extension with the 19-year-old daughter of NBA great Dennis Rodman is worth at least $1.1 million over four years, according to the Washington Post.\n\nOctagon Soccer, which represents Rodman, announced that the deal makes Rodman the league’s highest-paid player.\n\nAdvertisement\n\nRodman was the No. 2 overall pick in the 2021 NWSL draft by the Spirit, which went on to win the league championship. She scored seven goals and had seven assists, and was named the league’s Rookie of the Year.\n\n“We’re incredibly excited to have Trin as a part of the Spirit family for at least the next three seasons. She has a truly special career ahead of her and makes us a better club on all fronts,” Spirit coach Kris Ward said.\n\nRodman was also named the 2021 U.S. Soccer Young Player of the Year following her rookie season with the Spirit. She earned her first call-up with the national team for its January camp.\n\nRodman’s deal runs through the 2024 season with a team option for 2025 that will be activated the first time she plays in a match for the Spirit this season. The package makes Rodman the highest-paid player over the course of those four years.\n\nWhen she joined the league, Rodman signed a three-year deal with the Spirit, with a reported base salary of $42,000 a year.\n\nPlayers reported to NWSL training camps this week for the league’s 10th season. The players association and the league agreed to terms on its first collective bargaining agreement on Monday.\n\nTeams are able to use allocation money for salaries above the league maximum, which rose to $75,000 under the new CBA. National team players like Alex Morgan and Megan Rapinoe previously commanded the highest wages in the NWSL because U.S. Soccer paid their salaries. That arrangement ended in December.\n\n___\n\nMore AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"}, {"url": "https://www.celebsagewiki.com/kate-deines", "page_content": "Age, Biography and Wiki\n\nKate Deines was born on 17 September, 1989 in Portland, OR, is an American soccer midfielder-defender. Discover Kate Deines's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 33 years old?\n\nPopular As N/A Occupation N/A Age 33 years old Zodiac Sign Virgo Born 17 September 1989 Birthday 17 September Birthplace Portland, OR Nationality OR\n\nWe recommend you to check the complete list of Famous People born on 17 September. She is a member of famous with the age 33 years old group.\n\nKate Deines Height, Weight & Measurements\n\nAt 33 years old, Kate Deines height is 5′ 11″ .\n\nPhysical Status Height 5′ 11″ Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nKate Deines Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Kate Deines worth at the age of 33 years old? Kate Deines’s income source is mostly from being a successful . She is from OR. We have estimated Kate Deines's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nKate Deines Social Network\n\nInstagram Linkedin Twitter Kate Deines Twitter Facebook Wikipedia Kate Deines Wikipedia Imdb\n\nTimeline"}]}