{"Kate Deines previously played for the Seattle Sounders Women of the W-League, the Washington Spirit of the NWSL, and the Seattle Reign FC of the NWSL.": [{"url": "https://www.wikiwand.com/en/Kate_Deines", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Kate Deines?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.plu.edu/resolute/fall-2016/kate-deines/", "page_content": "Deines said she has always loved soccer. She grew up playing in the Seattle area, joining the Seattle Sounders Women when she was still in high school. She played for the University of Washington while completing her undergraduate degree in communication and media.\n\nIn 2012, she was named UW’s Female Athlete of the Year and awarded the Tom Hansen Pac-12 Conference Medal – for the student athlete who displays performance and achievement in leadership, academics and athleticism.\n\nBut she didn’t stop there. “I always wanted to play professionally,” she said.\n\nAfter graduating from UW, Deines found herself with nowhere to play because the United States Women’s Professional Soccer League disbanded. “It was a sad time for women’s soccer,” she said.\n\nSo, like many others in that situation, Deines played abroad. She joined Stjarnan FC in Iceland, helping her team win the Icelandic Cup, among other accomplishments.\n\nDeines later joined the Seattle Reign FC in 2013, after the formation of the National Women’s Soccer League (NWSL), and played two seasons before retiring in 2015.\n\nDuring that time she continued to play abroad in the offseasons, playing for FFC Turbine Potsdam located just outside Berlin, Germany. They became the top team in the Frauen-Bundesliga, the country’s women’s soccer league.\n\n“Finance was never even on my radar,” Deines said. She said she felt she had already achieved everything she wanted to achieve in soccer, and she was drawn to finance because it focuses on long-term goals. She said soccer, on the other hand, focused on what needed to happen each day.\n\n“I’m a competitive person, and I was ready for something else,” she said. “As I near graduation and get ready to work for a firm, the idea that I am hopefully working my way up to the top motivates me. I enjoy thinking about what climbing that next rung looks like and how there’s no ceiling to what you can accomplish.\n\n“The fact that finance has no limits – that in and of itself is definitely a big motive.”\n\nAn old family friend and PLU alumna, Darcy Johnson, referred her to the MSF program.\n\n“When I visited PLU I had a really good feeling and I could envision myself here,” Deines said. “I always wanted to achieve financial security and I had a really good gut feeling that PLU would be a good fit.”\n\nDeines said she likes the opportunity to help others reach their financial goals. As far as the Women of Influence Award, she said she was pleasantly surprised with the honor. In some ways, she said, the award is a sort of validation, or a sign of heading in the right direction.\n\nMSF program director Cynthia Smith said she was not at all surprised that Deines got the award."}, {"url": "https://www.howold.co/person/kate-deines/biography", "page_content": "Kate Deines Biography\n\nAmerican soccer midfielder-defender\n\nKathleen Ann Deines (born September 17, 1989) is an American soccer midfielder–defender. She most recently played for Turbine Potsdam in the German Bundesliga and Seattle Reign FC of the National Women's Soccer League. Deines was a fourth round pick (23rd overall) of the Atlanta Beat of Women's Professional Soccer in the 2012 WPS Draft of college seniors on January 13, 2012. The WPS Board of Governors voted to suspend the 2012 season on January 30 citing pending legal issues. Subsequently, she was free to sign with other teams and rejoined the Seattle Sounders Women, the organization she had previously played for from 2007 to 2009. After the formation of the National Women's Soccer League in late 2012, Deines played for the Seattle Reign during the league's first two seasons. She was traded to FC Kansas City in late 2014 but announced her retirement from professional soccer on March 31, 2015, before the 2015 season began.\n\nEarly life\n\nDeines was born in Portland, Oregon, on September 17, 1989, to Matt and Betsy Deines. As a freshman at Issaquah High School, Deines helped lead the soccer team to its first state championship final since 1988 and first *le ever. Deines led the team to four consecutive conference championships from 2004 to 2007 and four state *le games, winning three of them. Issaquah's lone runner-up finish was in 2005 when Deines was forced to miss the championship game to join the United States Youth Soccer *ociation Olympic Development Program in Boca Raton, Florida following the semifinal. Issaquah went on undefeated the next two years with Deines in the lineup.\n\nDeines capped off her high school career by scoring the game-winning goal in the 71st minute of the 2007 state final, a 1–0 victory over Seattle Prep.\n\nDeines finished with a total of 76 goals and was named to the all-state team four times and chosen as the state's Gatorade Player of the Year twice. During her senior year she was named to the Parade and NSCAA/adidas Girls High School All-America teams.\n\nDeines has played soccer with the Seattle Sounders Women since joining the team in 2007 while still in high school.\n\nUniversity of Washington\n\nDeines was a four-year starter for the Washington Huskies, starting a school-record 86 games and scoring 21 goals. She was named to the Pac-10 All-Freshman First Team and was a four-time All-Pac-10 selection and a two-time NSCAA Scholar All-American.\n\nAs a freshman at the University of Washington, Deines helped the Huskies return to the NCAA Tournament after a three-year absence. She played a leading role as team captain during her junior year. She converted two key penalty kicks, including the game winner, during an epic penalty shoot-out in a shocking upset of the No. 2 overall seed University of Portland in the second round of the NCAA Tournament. The Huskies would eventually go on to the Elite Eight where they were eliminated in an overtime loss at Boston College.\n\nPlaying career\n\nClub\n\nDrafted to the Atlanta Beat, 2012\n\nDeines was selected as a fourth round pick (23rd overall) by the Atlanta Beat in the 2012 WPS Draft of college seniors on January 13, 2012; however, the league suspended operations before play began.\n\nFrom Seattle to Iceland, 2012\n\nAfter the WPS folded in 2012, Deines signed with the Seattle Sounders Women. She made 12 appearances for the club, scoring one goal. Following the conclusion of the W-League season, Deines and her Sounders teammate and fellow University of Washington alum, Verónica Pérez, played for Stjarnan Women in Iceland's top division. The team won the Icelandic Women's Cup after a 1–0 win over Valur. Of her time in Iceland, Deines said, \"Even though it was a spur of the moment decision to play overseas in Iceland, I believe my three month stint helped in my development as a player. Icelandic soccer was not nearly as technical or tactical as soccer in the United States but the extreme physicality of our practices and games challenged me to play with a whole new level of aggression. Playing professionally in Iceland also allowed me an opportunity to keep practicing and playing games on a daily basis which would not have been the case if I would have stayed in the United States.\"\n\nSeattle Reign FC, 2013–14\n\nIn February 2013, Deines signed with the Seattle Reign FC as a free agent for the inaugural season of the NWSL. Deines made 17 appearances for the club with 11 starts, tallying a total of 979 minutes.\n\nPotsdam, 2014–15\n\nIn September 2014, Deines signed a one-year contract with Germany's Turbine Potsdam in the Bundesliga.\n\nInternational\n\nDeines was a member of the United States U-23 women's national soccer team and traveled to Sweden in June 2011.\n\nPersonal life\n\nDeines' younger brother Jay is an offensive lineman on the football team at Eastern Washington University.\n\nSee also\n\nWomen's *ociation football portal\n\nSports portal\n\n*ociation football portal\n\nBiography portal\n\nList of University of Washington people\n\nList of people from Portland, Oregon\n\nReferences\n\nExternal links\n\nWashington player profile\n\nSeattle Sounders Women player profile\n\nKate Deines at Soccerway\n\nKate Deines on Twitter\n\nWikimedia Commons has media related to Kate Deines."}, {"url": "https://theathletic.com/2107998/2020/10/01/how-a-group-of-uswnt-stars-found-a-temporary-home-on-a-seattle-amateur-team/", "page_content": "There is no good time for the league in which you’re employed to cease operations, but Women’s Professional Soccer went bust at a particularly inconvenient moment.\n\nIt was January 30, 2012, in the aftermath of a World Cup year — a time when many players expected the league to use that enthusiasm to grow, not to disappear entirely. The London Olympics were coming up that summer, where the U.S. women’s national team was a frontrunner for gold, although maybe not if all of its players were suddenly without clubs.\n\nAdvertisement\n\nKeelin Winters felt a mixture of dread and surprise when she heard of the WPS’s demise. She’d been a finalist for the league’s rookie of the year award the season prior with the Boston Breakers. That hardly mattered now. She was a standout for the U.S. U-23 team, with a realistic shot of making the Olympic roster.\n\nOn top of everything else, the European transfer window shut at the end of that dreadful January, leaving players with basically no time to scramble abroad to one of the couple of pro leagues still going at that time.\n\n“I’m thinking to myself, ‘Well shit,’” Winters said. “‘How am I going to get the training? How am I going to get games in?’”\n\nWhile the players reeled, freshly installed Seattle Sounders Women general manager Amy Carnell sensed an opportunity.\n\nHer club played in the W-League, which then was fully amateur, an unpaid mix of prep prospects, college players and older vets not quite ready to give up the dream. Winters had played in the W-League as a high schooler in Colorado.\n\n“It was a great experience for me in high school, but like as a competitive high schooler,” Winters said. “There’s certainly a difference between a pro player who was 23, 24, 25 years old. versus a 17- or 18-year-old high school player, and I don’t mean that in any kind of disrespectful way.”\n\nBut look, the USWNT players need somewhere to play, to stay even reasonably sharp. And Carnell had a friend of a friend who was close to Hope Solo, so the GM picked up her phone and took a shot.\n\nThat’s how some of the biggest stars in women’s soccer ended up playing in a minor league, in front of capacity crowds who were just as stunned to see them there as they were to be there. It was a historical quirk that happened less than a decade ago, but already feels like the realm of fiction.\n\nDespite sharing a name with a club that was then the darling upstart of Major League Soccer, the Sounders Women were a loose relation, and something of a bare-bones operation.\n\nAdvertisement\n\n“The only affiliation between the W-League Sounders Women and Sounders FC was a very simple licensing agreement that the Sounders arranged with the owners of the Sounders Women,” Carnell said. “That was really it: ‘Hey, you can use the name, follow these guidelines.’ That’s it.”\n\nCarnell’s first task as the team’s general manager, then, was to build some buzz and create their own identity.\n\n“I think it was shocking to everyone when we heard about the (WPS) folding,” Carnell said. “But once that happened, immediately I started thinking, where are these players going to play? We figured we could take a shot in the dark and just see.”\n\nSolo was the most obvious fit: a native of Richland, WA, she was also a four-year starter at the University of Washington on Seattle’s north side.\n\n“The worst thing that could happen is that Hope just says no,” Carnell said. “I reached out to Hope and then it escalated from there.”\n\nSolo didn’t require much of a pitch. She was in. Carnell grew more ambitious: “So then I asked her, ‘How many other players can we sign?’”\n\nSydney Leroux shared an agent with Solo, and having grown up just over the border in Surrey, British Columbia, knew the region well. Alex Morgan’s then-boyfriend and now-husband, Servando Carrasco, was a midfielder for the Sounders, so she was also an easy sell. Morgan’s agent also represented Megan Rapinoe, who went to school down the road at the University of Portland and was also intrigued.\n\nUSWNT outside back Steph Cox grew up with Rapinoe and was a teammate of her’s at UP, and her husband worked in the Seattle area. Cox reached out to Carnell asking for a roster spot. A team that, as an amateur club, couldn’t even pay its players suddenly didn’t even have to actively recruit U.S. internationals. The squad grew steadily more formidable.\n\nAdvertisement\n\nBoth the players and team were clear-eyed about the fact that this was a short-term arrangement. The U.S. stars were only going to be there for the first half of the season before departing for pre-Olympic camp, then the Games themselves.\n\n“You kind of just take one year at a time, and take advantage of your opportunities,” Cox said. “It’s hard to ever feel too set on the future. Try to enjoy the moment, and enjoy the team environment as much as you can. So yeah, the Sounders definitely didn’t seem like a forever thing. I don’t think we thought the W-League was going to become pro or something. But it was nice, for the first time, to be back at home, living with my husband while I was playing.”\n\nAnd Rapinoe, too. The situation was so tentative that Rapinoe didn’t even bother shopping for an apartment in Seattle. She just moved in with the Coxes, crashing in a spare room, the pair of former Portland Pilots carpooling to every game.\n\n“Obviously she has a big personality and is a lot of fun,” Cox said. “But at home she’s pretty chill and relaxed. I remember one time her mom and her aunt came up and made us fried chicken, and one night Megan made a big pot of Rapinoe red sauce. I still have that recipe and make it every once in a while. Some really good memories.”\n\nStar-studded roster complete, capacity crowds began to follow — a portent of things to come, a sign that the women’s game might have been in a rough patch but that there was still a bright future ahead.\n\nStarfire Stadium in Tukwila, a southern suburb of Seattle, has hosted some wild matches over the years. The pre-MLS Sounders won the 2007 USL Championship there. And it became the defacto home for U.S. Open Cup matches for much of the team’s MLS era — it was there that Marcus Hahnemann chugged a beer, shirtless, in front of the supporters’ section after triumphing in a penalty shootout, and where Clint Dempsey was ejected for tearing up a referee’s notebook.\n\nYou can make a case that the venue is even more intimidating than a sold-out CenturyLink Field, with 4,500 fans in close proximity to the field and the liquid encouragement of a beer garden right there.\n\nAdvertisement\n\nThose who were there swear Starfire has rarely been louder than that afternoon in the early spring of 2012 when the USWNT-infused Sounders Women made their debut. Their first game was a friendly against the University of Washington, and it sold out more than three weeks in advance.\n\n“In the W-League, we went from barely having anybody there for the first preseason game to all of a sudden needing walkways for the players to walk through, walkways that would be lined with hundreds of little kids and their families,” head coach Michelle French said. “The posters, selling out Starfire, with a packed beer garden in one of the corners every single game. It was one of the most exciting, memorable crowds for a lot of people, I think. And not just because of the national team players — it was the beginning of a movement that really started to signal what kind of success women’s soccer could have in the city of Seattle.”\n\nThe women’s national team had played in the city before, but those were fleeting glimpses. This time, the country’s stars were wearing home colors, and here on a weekly basis. They belonged to Seattle, even if only for a few months.\n\n“The thing that stood out to me the most was the energy of the crowd, and how it really brought the women’s soccer community together,” Carnell said. “… I remember seeing 10-, 11-, 12-year-old girls out there holding signs and screaming for their heroes. At that point, I realized we had created something special.”\n\nThose who had played in the Pacific Northwest before knew how important that level of excitement was for the club and for the women’s game, in general. But they weren’t necessarily surprised by it.\n\nThe University of Portland set the national attendance record while Cox and Rapinoe were there, and during their run to the 2005 national championship, they sold out their home quarterfinal against Notre Dame in less than five minutes, according to Cox. A few years later, Winters also played collegiately at UP. The match she attended on her recruiting visit was standing-room only, students wrapped around the outside of Merlo Field waiting to get in. That’s what sold her on the school.\n\n“I got the vibe on campus that the women’s soccer team was like a men’s football team in terms of being the big deal on campus,” Winters said. “It was unlike any other experience, still, that I ever had in my life. There’s something special about the northwest, in terms of the soccer culture and the fandom.”\n\nAdvertisement\n\nIn early 2012, in the aftermath of the demise of the WPS and unsure of where her career would go from there, the validation of Northwest soccer fans was precisely what she needed.\n\n“I remember the players’ faces being all over — in the city, on the banners at Starfire, everywhere,” Winters said. “It was kind of cool to walk in on game day and feel like that complex was for you. It made us feel a little more important, and more professional, and that was pretty cool.”\n\nThere are highlights from that season that all of the coaches and players look back on fondly, snapshots that illustrate how odd of a setup all of this was.\n\n“There were moments when Pinoe would make something look so exceptionally easy that was so difficult for every other soccer player, and there was always the flair and the personality that she played with,” French said. “This was even before she hit the big scene. You look up and see Alex and Syd playing together up front, you could always expect something to happen. They all made everything look exceptionally easy.”\n\nThe 2012 Sounders Women team was far from the USWNTers plus a bunch of scrubs, though.\n\nWinters would fall short of making that Olympic team, but she would go on to become the long-time captain of the Seattle Reign in the NWSL. Verónica Pérez made 84 appearances for the Mexico national team and Kate Deines was four-time All-Pac 12 at the University of Washington.\n\n“There was this collection of players on this semi-pro team who, as a coach, all you had to do was put them on the field and let them do their thing — and that’s from the national team players to all of the others who were exceptional in their own right,” French said.\n\nAs much excitement as the superstars generated — and taken as a given that no team in the world would willingly turn away prime Hope Solo, Alex Morgan and/or Megan Rapinoe if they showed up wanting to play — the arrangement did make for some roster complications.\n\nThe U.S. players did not travel to away games, nor did they regularly practice with the rest of the team, preferring to keep up with their national team regiments in individual sessions. They were only there for game action, and even then just about five home matches before they headed out for good.\n\n“It was an interesting dynamic, for sure, having all these all-stars coming in and essentially bumping players from their spots,” Cox said. “I wouldn’t say it was awkward, but it was a given: yeah these players are coming in and taking spots, and when they’re not there, the other players get their spots back.”\n\nSo not only did the Sounders Women front office have to make sure they had capable replacements to fill in when the big names were gone, it was up to the coaching staff to manage what could have been a delicate locker room chemistry.\n\n“The attitude and mentality of the other players was that they all wanted to be successful on their own right — either individually or as a team,” French said. “They just looked at it as a great opportunity to be a part of a really cool one-off. It really wasn’t that complicated. It was a conversation up front with the national team players, and a conversation up front with those who were going to be there for the whole season. This is something that you can 100 percent buy in to and enjoy. The transparency and honesty up front was the biggest thing.”\n\nFor French, who went on to coach the U.S. U-20s and is now the head coach at UP, that spring and summer was an invaluable learning experience. This was her first real coaching job after an accomplished playing career that included 14 U.S. caps. She got to work with the elite of the elite while simultaneously getting the best out of role players and developing up-and-coming prospects.\n\nIt seems wild, in retrospect, that a W-League team that not only included that A-list of U.S. stars, but also the likes of Winters, Pérez and Deines would fail to win the league. But that’s only if you overlook the limited availability of those top players — and only if you’ve never heard of the four-time W League champion Pali Blues.\n\n“For us, the Pali Blues were always the team,” said French of the L.A.-based powerhouse who were annually stocked with the very best college players throughout California. Alumni include: Tobin Heath, Lauren Holiday, Kelley O’Hara and Christen Press, among others.\n\nFor the Sounders Women, this was something of a one-off, with the exception of 2015, when Wisconsin undergrad Rose Lavelle repped the rave green for a summer. The Pali Blues and Seattle finished one/two in the Western Division, with the Blues also prevailing in the 2012 conference final thanks to a goal from future NWSL MVP and golden boot winner Lynn Williams.\n\n“Yes, if you put each roster side-by-side, we had the national team players, but not for the playoffs,” French said. “And even if we had, who knows? They still could have beaten us. They were always, for us, that one team we knew we needed to get by. It was always a battle. I don’t know if we ever got the best of them, to be honest.”\n\nAnd with that, it was over. It was a Sounders Women season that hardly felt real, even while it was happening.\n\nIn August of 2012, the U.S. won the gold medal in London, having overcome Canada 4-3 in an all-time classic of a semifinal where Rapinoe netted a brace and Morgan scored the winner in the 123rd minute.\n\nIn November, it was announced that a new, yet-to-be named professional league was to launch in 2013 as a successor to the WPS.\n\nIt is likely not a coincidence that Seattle was awarded a founding franchise of the National Women’s Soccer League — Portland, too — despite the fact that there hadn’t been a Pacific Northwest team in either the WPS or the original WUSA back in the day.\n\nThe Sounders Women worked closely with U.S. Soccer on keeping the national teamers fit throughout 2012, and that helped, given the federation’s influence in launching the NWSL. But it was also that the level of fan interest was difficult to ignore.\n\n“I think what the success of the Sounders Women did was that it put the spotlight on Seattle, the fan base and the support that was possible,” Carnell said. “Absolutely I think it was a part of them saying that this would be a fantastic place for the next women’s pro franchise.”\n\nFrench agrees, and she would know, having grown up in the Seattle area and who is now a pillar of the Portland soccer community.\n\n“You look at the Reign and maybe they don’t have as much support as one would hope from Seattle, but you can go all the way back to Michelle Akers and Amy Griffin, all of these national team players from this area,” French said. “That’s where it all started, but when you look at the Sounders Women in particular, that summer did kind of put Seattle women’s soccer back on the map.”\n\nThere is, however, a sense that the potential glimpsed that summer has not been fully realized — at least not on the women’s side, and not the way it has down the road in Portland. Whereas the Thorns averaged more than 20,000 fans per match last season at Providence Park, the Reign have bounced between three stadiums around the Seattle/Tacoma area and barely cracked 5,000.\n\n“Maybe it was the Sounders name, or the Sounders marketing team, that generated all of those ticket sales, because we still have some of those big name players playing for the Reign, but I don’t know that there’s much of a difference from then to now, sadly,” Winters said. “If we could be more like Portland … people are going to hate that (laughs). I mean the Sounders sell out. For whatever reason the support hasn’t really transferred over like it has in Portland.”\n\nLast August, Rapinoe told The Athletic: “Why does everyone love the Sounders so much? Do they just love soccer? Because if they love soccer, then they would have come to watch us (the Reign) play. We were basically undefeated for two years and had five of the top 20 players in the world. Everyone’s like, ‘Oh, what are we gonna do?’ And I’m like, ‘I don’t know!’ We’re doing everything we can. I’m not sure what else needs to be the selling point in the league. The quality is already there.”\n\nDespite those qualms, for many players, the lasting legacy of that season is a sense that the Sounders Women provided a safe harbor — and a kind of bridge to the future — when they needed one the most.\n\n“Just having that consistency is crucial,” Winters said. “When I was playing, one of the things that just wore on me was the instability of the leagues. … Just having the next six months of your life planned out, and not having to go searching for places to train and play and improve every day, having a home is huge — especially just for your peace of mind.\n\n“People don’t talk enough about the mental side of playing professionally, and part of that is just being financially stable, feeling like you’re in a good environment where you’re being challenged and taken care of. The Sounders offered that for a lot of us who had kind of had the rug taken out from underneath us.”\n\nThe moment might have been fleeting, and the team didn’t win any hardware, but it’s not hyperbolic to say that the team’s impact is still being felt today: in the superstardom of Megan Rapinoe after last year’s World Cup triumph, in Morgan’s recent move to Tottenham Hotspur — the kind of opportunity denied by the bad WPS timing eight years ago — and in the continued growth of the sport in Cascadia and beyond.\n\n“It was just a really frickin’ fun summer,” French said. “It was such a fun thing to be a part of. What I most took away from it was that there really is a want, a desire and a thirst for women’s soccer to be a part of these communities. We’ve seen that as the NWSL has continued to flourish and grow. It was a jumping-off point and a signal for what was to come.”\n\n(All photos: Jane Gershovich; courtesy of Amy Carnell)"}, {"url": "https://wiki2.org/en/Kate_Deines", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican soccer midfielder-defender\n\nKathleen Ann Deines (born September 17, 1989) is an American soccer midfielder–defender. She most recently played for Turbine Potsdam in the German Bundesliga and Seattle Reign FC of the National Women's Soccer League. Deines was a fourth round pick (23rd overall) of the Atlanta Beat of Women's Professional Soccer in the 2012 WPS Draft of college seniors on January 13, 2012. The WPS Board of Governors voted to suspend the 2012 season on January 30 citing pending legal issues.[2] Subsequently, she was free to sign with other teams and rejoined the Seattle Sounders Women, the organization she had previously played for from 2007 to 2009. After the formation of the National Women's Soccer League in late 2012, Deines played for the Seattle Reign during the league's first two seasons. She was traded to FC Kansas City in late 2014[3] but announced her retirement from professional soccer on March 31, 2015, before the 2015 season began.[4]\n\nYouTube Encyclopedic\n\n1 / 5 Views: 1 933 393 1 665 2 180 3 175\n\nWomen's Soccer Fall Media Day\n\nKate Deines m4v\n\nKickin' it with Kate (Episode 3) - Victorious on the Road\n\nInterview: Laura Harvey 5/28\n\nHope Solo Signs Regan's Soccer Ball Transcription\n\nEarly life\n\nDeines was born in Portland, Oregon, on September 17, 1989, to Matt and Betsy Deines. As a freshman at Issaquah High School, Deines helped lead the soccer team to its first state championship final since 1988 and first title ever.[5] Deines led the team to four consecutive conference championships from 2004 to 2007 and four state title games, winning three of them.[6] Issaquah's lone runner-up finish was in 2005 when Deines was forced to miss the championship game to join the United States Youth Soccer Association Olympic Development Program in Boca Raton, Florida following the semifinal.[7] Issaquah went on undefeated the next two years with Deines in the lineup.\n\nDeines capped off her high school career by scoring the game-winning goal in the 71st minute of the 2007 state final, a 1–0 victory over Seattle Prep.[8]\n\nDeines finished with a total of 76 goals and was named to the all-state team four times and chosen as the state's Gatorade Player of the Year twice. During her senior year she was named to the Parade and NSCAA/adidas Girls High School All-America teams.[9]\n\nDeines has played soccer with the Seattle Sounders Women since joining the team in 2007 while still in high school.\n\nUniversity of Washington\n\nDeines was a four-year starter for the Washington Huskies, starting a school-record 86 games and scoring 21 goals.[10] She was named to the Pac-10 All-Freshman First Team and was a four-time All-Pac-10 selection and a two-time NSCAA Scholar All-American.[11]\n\nAs a freshman at the University of Washington, Deines helped the Huskies return to the NCAA Tournament after a three-year absence.[12] She played a leading role as team captain during her junior year. She converted two key penalty kicks, including the game winner, during an epic penalty shoot-out in a shocking upset of the No. 2 overall seed University of Portland in the second round of the NCAA Tournament.[13] The Huskies would eventually go on to the Elite Eight where they were eliminated in an overtime loss at Boston College.\n\nPlaying career\n\nClub\n\nDrafted to the Atlanta Beat, 2012\n\nDeines was selected as a fourth round pick (23rd overall) by the Atlanta Beat in the 2012 WPS Draft of college seniors on January 13, 2012; however, the league suspended operations before play began.[14][15]\n\nFrom Seattle to Iceland, 2012\n\nAfter the WPS folded in 2012, Deines signed with the Seattle Sounders Women. She made 12 appearances for the club, scoring one goal.[16] Following the conclusion of the W-League season, Deines and her Sounders teammate and fellow University of Washington alum, Verónica Pérez, played for Stjarnan Women in Iceland's top division. The team won the Icelandic Women's Cup after a 1–0 win over Valur.[17] Of her time in Iceland, Deines said, \"Even though it was a spur of the moment decision to play overseas in Iceland, I believe my three month stint helped in my development as a player. Icelandic soccer was not nearly as technical or tactical as soccer in the United States but the extreme physicality of our practices and games challenged me to play with a whole new level of aggression. Playing professionally in Iceland also allowed me an opportunity to keep practicing and playing games on a daily basis which would not have been the case if I would have stayed in the United States.\"[18]\n\nSeattle Reign FC, 2013–14\n\nIn February 2013, Deines signed with the Seattle Reign FC as a free agent for the inaugural season of the NWSL.[19][20][21][22][23] Deines made 17 appearances for the club with 11 starts, tallying a total of 979 minutes.[24]\n\nPotsdam, 2014–15\n\nIn September 2014, Deines signed a one-year contract with Germany's Turbine Potsdam in the Bundesliga.[25]\n\nInternational\n\nDeines was a member of the United States U-23 women's national soccer team and traveled to Sweden in June 2011.[26]\n\nPersonal life\n\nDeines' younger brother Jay is an offensive lineman on the football team at Eastern Washington University.[27][28]\n\nSee also\n\nReferences"}, {"url": "https://www.calendarz.com/on-this-day/september/17/kate-deines", "page_content": "Birth\n\nSep, 17\n\nKate Deines\n\nKate Deines, American soccer player\n\nKathleen Ann Deines (born September 17, 1989) is an American soccer midfielder-defender. She most recently played for Turbine Potsdam in the German Bundesliga and Seattle Reign FC of the National Women's Soccer League. Deines was a fourth round pick (23rd overall) of the Atlanta Beat of Women's Professional Soccer in the 2012 WPS Draft of college seniors on January 13, 2012. The WPS Board of Governors voted to suspend the 2012 season on January 30 citing pending legal issues. Subsequently, she was free to sign with other teams and rejoined the Seattle Sounders Women, the organization she had previously played for from 2007 to 2009. After the formation of the National Women's Soccer League in late 2012, Deines played for the Seattle Reign during the league's first two seasons. She was traded to FC Kansas City in late 2014 but announced her retirement from professional soccer on March 31, 2015 before the 2015 season began."}, {"url": "https://www.celebsagewiki.com/kate-deines", "page_content": "Age, Biography and Wiki\n\nKate Deines was born on 17 September, 1989 in Portland, OR, is an American soccer midfielder-defender. Discover Kate Deines's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 33 years old?\n\nPopular As N/A Occupation N/A Age 33 years old Zodiac Sign Virgo Born 17 September 1989 Birthday 17 September Birthplace Portland, OR Nationality OR\n\nWe recommend you to check the complete list of Famous People born on 17 September. She is a member of famous with the age 33 years old group.\n\nKate Deines Height, Weight & Measurements\n\nAt 33 years old, Kate Deines height is 5′ 11″ .\n\nPhysical Status Height 5′ 11″ Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nKate Deines Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Kate Deines worth at the age of 33 years old? Kate Deines’s income source is mostly from being a successful . She is from OR. We have estimated Kate Deines's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nKate Deines Social Network\n\nInstagram Linkedin Twitter Kate Deines Twitter Facebook Wikipedia Kate Deines Wikipedia Imdb\n\nTimeline"}, {"url": "https://peoplepill.com/people/kate-deines/", "page_content": "Kathleen \"Kate\" Ann Deines (born September 17, 1989) is an American soccer midfielder-defender. She most recently played for Turbine Potsdam in the German Bundesliga and Seattle Reign FC of the National Women's Soccer League. Deines was a fourth round pick (23rd overall) of the Atlanta Beat of Women's Professional Soccer in the 2012 WPS Draft of college seniors on January 13, 2012. The WPS Board of Governors voted to suspend the 2012 season on January 30 citing pending legal issues. Subsequently, she was free to sign with other teams and rejoined the Seattle Sounders Women, the organization she had previously played for from 2007 to 2009. After the formation of the National Women's Soccer League in late 2012, Deines played for the Seattle Reign during the league's first two seasons. She was traded to FC Kansas City in late 2014 but announced her retirement from professional soccer on March 31, 2015 before the 2015 season began.\n\nEarly life\n\nDeines was born in Portland, Oregon, on September 17, 1989 to Matt and Betsy Deines. As a freshman at Issaquah High School, Deines helped lead the soccer team to its first state championship final since 1988 and first title ever. Deines led the team to four consecutive conference championships from 2004–2007 and four state title games, winning three of them. Issaquah's lone runner-up finish was in 2005 when Deines was forced to miss the championship game to join the United States Youth Soccer Association Olympic Development Program in Boca Raton, Fla. following the semifinal. Issaquah went on undefeated the next two years with Deines in the lineup.\n\nDeines capped off her high school career by scoring the game-winning goal in the 71st minute of the 2007 state final, a 1–0 victory over Seattle Prep.\n\nDeines finished with a total of 76 goals and was named to the all-state team four times and chosen as the state's Gatorade Player of the Year twice. During her senior year she was named to the Parade and NSCAA/adidas Girls High School All-America teams.\n\nDeines has played soccer with the Seattle Sounders Women since joining the team in 2007 while still in high school.\n\nUniversity of Washington\n\nDeines was a four-year starter for the Washington Huskies, starting a school-record 86 games and scoring 21 goals. She was named to the Pac-10 All-Freshman First Team and was a four-time All-Pac-10 selection and a two-time NSCAA Scholar All-American.\n\nAs a freshman at the University of Washington, Deines helped the Huskies return to the NCAA Tournament after a three-year absence. She played a leading role as team captain during her junior year. She converted two key penalty kicks, including the game winner, during an epic penalty shoot-out in a shocking upset of the No. 2 overall seed University of Portland in the second round of the NCAA Tournament. The Huskies would eventually go on to the Elite Eight where they were eliminated in an overtime loss at Boston College.\n\nPlaying career\n\nClub\n\nDrafted to the Atlanta Beat, 2012\n\nDeines was selected as a fourth round pick (23rd overall) by the Atlanta Beat in the 2012 WPS Draft of college seniors on January 13, 2012; however, the league suspended operations before play began.\n\nFrom Seattle to Iceland, 2012\n\nAfter the WPS folded in 2012, Deines signed with the Seattle Sounders Women. She made 12 appearances for the club, scoring one goal. Following the conclusion of the W-League season, Deines and her Sounders teammate and fellow University of Washington alum, Veronica Perez, played for Stjarnan Women in Iceland's top division. The team won the Icelandic Women's Cup after a 1–0 win over Valur. Of her time in Iceland, Deines said, \"Even though it was a spur of the moment decision to play overseas in Iceland, I believe my three month stint helped in my development as a player. Icelandic soccer was not nearly as technical or tactical as soccer in the United States but the extreme physicality of our practices and games challenged me to play with a whole new level of aggression. Playing professionally in Iceland also allowed me an opportunity to keep practicing and playing games on a daily basis which would not have been the case if I would have stayed in the United States.\"\n\nSeattle Reign FC, 2013–14\n\nIn February 2013, Deines signed with the Seattle Reign FC as a free agent for the inaugural season of the NWSL. Deines made 17 appearances for the club with 11 starts, tallying a total of 979 minutes.\n\nPotsdam, 2014–15\n\nIn September 2014, Deines signed a one-year contract with Germany's Turbine Potsdam in the Bundesliga.\n\nInternational\n\nDeines was a member of the United States U-23 women's national soccer team and traveled to Sweden in June 2011.\n\nPersonal life\n\nDeines' younger brother Jay is an offensive lineman on the football team at Eastern Washington University."}, {"url": "https://equalizersoccer.com/2013/02/04/seattle-reign-fc-nwsl-free-agent-signings/", "page_content": "SEATTLE — As part of the National Women’s Soccer League free-agent signing period, Seattle Reign FC announced four of its five signings on Monday. Wales captain Jess Fishlock, former Seattle Sounders Women defender Kate Deines, and forwards Tiffany Cameron and Lindsay Taylor will play for Seattle in 2013.\n\nReign FC general manager Amy Carnell said the club would not be using its fifth allotted free-agent slot. By the time it received word that a fifth slot had been made available, Carnell said the club would rather keep the spot open.\n\n“There were a couple prospects (at the last minute), but nobody that really, really stood out to us,” she said in a phone interview following the club announcement.\n\nReign FC was allotted the extra slot after forward Amy Rodriguez announced she is pregnant and will miss the entire 2013 NWSL season. Megan Rapinoe and Teresa Noyola will also miss the start of the season because of short-term contracts in Europe, for Lyon of France and the Netherlands’ ADO Den Haag, respectively.\n\nOf the signed players, midfielder Fishlock carries the most professional accolades into her new team. She was the Wales Player of the Year in 2011 and 2012, as well as an English Women’s Premier League all-star selection last season.\n\nFishlock’s signing is the first recognizable moment of head coach Laura Harvey’s influence, as she comes to Reign FC from her post as Arsenal Ladies manager.\n\n“Jess is a great player who I know a lot about from her time in the English league,” Harvey said in a club release. “She is used to playing overseas, having played in Holland (with AZ Alkmaar) and Australia (with Melbourne Victory). Her experience and ability, I feel, will be crucial to the development of this team.”\n\nFormer Husky Deines grew up in Issaquah, Wash., across the I-90 Bridge from downtown Seattle. She is in the U.S. women’s under-23 player pool.\n\nDeines most recently played for the Stjarnan Women in Iceland after completing a stint with the W-League Seattle Sounders Women. She was the Atlanta Beat’s fourth-round pick in the 2012 WPS Draft before the league cancelled the season and later folded.\n\n“I can’t begin to describe how excited I am to play professionally in Seattle, (in front of) my family and friends,” Deines said. “The support in this city is awesome, and now to have a professional team in Seattle, I can’t even imagine the atmosphere for our home matches.”\n\nShe and fellow Washington graduate Veronica Perez — who was allocated to the Western New York Flash — left for Iceland after playing for the Sounders Women in 2012. They won the Icelandic Women’s Cup while playing for the club based in Garðabær, just outside the capital city of Reykjavik.\n\nDeines’ signing comes as no surprise, as she alluded to her desire to sign with Reign FC repeatedly on Twitter.\n\nCanadian international Cameron received her first caps during Canada’s recent participation in the Yongchuan Cup in China. She entered around the hour mark in all three of Canada’s matches in the tournament.\n\nCameron played collegiately at Ohio State, earning Second Team All-American and First Team All-Big Ten honors in her 2012 senior season. She led her team (and the tied for the conference lead) with 21 goals in 22 games.\n\n“We want forwards who have pace and something special, and I feel Tiffany has these qualities,” head coach Harvey said.\n\nFellow forward Taylor also fits that bill. As a two-time First Team All-American in 2008 and 2011, as well as Soccer America’s National Player of the Year and the Pac-12 Player of the Year in 2011, she scored 53 goals in her four years for 2011 national champion Stanford.\n\n“She has pace and power,” Harvey said. “We will be looking to play a way which suits Lindsay’s strengths.”\n\nTaylor played for Arna-Bjørnar of Norway’s Toppserien in 2012, and she was chosen sixth overall in the 2012 WPS Draft.\n\nReign FC’s next move will be to select six players in Thursday’s NWSL Supplemental Draft, which will be conducted via conference call.\n\nFollow @liviubird\n\n"}, {"url": "https://wiki.alquds.edu/?query=Kate_Deines", "page_content": "American soccer midfielder-defender\n\nKathleen Ann Deines (born September 17, 1989) is an American soccer midfielder–defender. She most recently played for Turbine Potsdam in the German Bundesliga and Seattle Reign FC of the National Women's Soccer League. Deines was a fourth round pick (23rd overall) of the Atlanta Beat of Women's Professional Soccer in the 2012 WPS Draft of college seniors on January 13, 2012. The WPS Board of Governors voted to suspend the 2012 season on January 30 citing pending legal issues.[2] Subsequently, she was free to sign with other teams and rejoined the Seattle Sounders Women, the organization she had previously played for from 2007 to 2009. After the formation of the National Women's Soccer League in late 2012, Deines played for the Seattle Reign during the league's first two seasons. She was traded to FC Kansas City in late 2014[3] but announced her retirement from professional soccer on March 31, 2015, before the 2015 season began.[4]\n\nEarly life [ edit ]\n\nDeines was born in Portland, Oregon, on September 17, 1989, to Matt and Betsy Deines. As a freshman at Issaquah High School, Deines helped lead the soccer team to its first state championship final since 1988 and first title ever.[5] Deines led the team to four consecutive conference championships from 2004 to 2007 and four state title games, winning three of them.[6] Issaquah's lone runner-up finish was in 2005 when Deines was forced to miss the championship game to join the United States Youth Soccer Association Olympic Development Program in Boca Raton, Florida following the semifinal.[7] Issaquah went on undefeated the next two years with Deines in the lineup.\n\nDeines capped off her high school career by scoring the game-winning goal in the 71st minute of the 2007 state final, a 1–0 victory over Seattle Prep.[8]\n\nDeines finished with a total of 76 goals and was named to the all-state team four times and chosen as the state's Gatorade Player of the Year twice. During her senior year she was named to the Parade and NSCAA/adidas Girls High School All-America teams.[9]\n\nDeines has played soccer with the Seattle Sounders Women since joining the team in 2007 while still in high school.\n\nUniversity of Washington [ edit ]\n\nDeines was a four-year starter for the Washington Huskies, starting a school-record 86 games and scoring 21 goals.[10] She was named to the Pac-10 All-Freshman First Team and was a four-time All-Pac-10 selection and a two-time NSCAA Scholar All-American.[11]\n\nAs a freshman at the University of Washington, Deines helped the Huskies return to the NCAA Tournament after a three-year absence.[12] She played a leading role as team captain during her junior year. She converted two key penalty kicks, including the game winner, during an epic penalty shoot-out in a shocking upset of the No. 2 overall seed University of Portland in the second round of the NCAA Tournament.[13] The Huskies would eventually go on to the Elite Eight where they were eliminated in an overtime loss at Boston College.\n\nPlaying career [ edit ]\n\nClub [ edit ]\n\nDrafted to the Atlanta Beat, 2012 [ edit ]\n\nDeines was selected as a fourth round pick (23rd overall) by the Atlanta Beat in the 2012 WPS Draft of college seniors on January 13, 2012; however, the league suspended operations before play began.[14][15]\n\nFrom Seattle to Iceland, 2012 [ edit ]\n\nAfter the WPS folded in 2012, Deines signed with the Seattle Sounders Women. She made 12 appearances for the club, scoring one goal.[16] Following the conclusion of the W-League season, Deines and her Sounders teammate and fellow University of Washington alum, Verónica Pérez, played for Stjarnan Women in Iceland's top division. The team won the Icelandic Women's Cup after a 1–0 win over Valur.[17] Of her time in Iceland, Deines said, \"Even though it was a spur of the moment decision to play overseas in Iceland, I believe my three month stint helped in my development as a player. Icelandic soccer was not nearly as technical or tactical as soccer in the United States but the extreme physicality of our practices and games challenged me to play with a whole new level of aggression. Playing professionally in Iceland also allowed me an opportunity to keep practicing and playing games on a daily basis which would not have been the case if I would have stayed in the United States.\"[18]\n\nSeattle Reign FC, 2013–14 [ edit ]\n\nIn February 2013, Deines signed with the Seattle Reign FC as a free agent for the inaugural season of the NWSL.[19][20][21][22][23] Deines made 17 appearances for the club with 11 starts, tallying a total of 979 minutes.[24]\n\nIn September 2014, Deines signed a one-year contract with Germany's Turbine Potsdam in the Bundesliga.[25]\n\nInternational [ edit ]\n\nDeines was a member of the United States U-23 women's national soccer team and traveled to Sweden in June 2011.[26]\n\nPersonal life [ edit ]\n\nDeines' younger brother Jay is an offensive lineman on the football team at Eastern Washington University.[27][28]\n\nSee also [ edit ]"}], "Kate Deines made her debut for the Washington Spirit.": [{"url": "https://www.seattlepi.com/news/article/Kate-Deines-a-head-above-the-rest-1251113.php", "page_content": "Issaquah senior standout Kate Deines became one of the top soccer players in the state after becoming proficient with heading the ball. The University of Washington recruit and national team player led Issaquah to state titles her freshman and junior seasons. Dan DeLong/Seattle Post-Intelligencer Issaquah's Kate Deines, a University of Washington soccer recruit, perfects her headers by practicing with tennis balls. Scott Eklund/Seattle Post-Intelligencer\n\nISSAQUAH -- Three hours before every game, Kate Deines' mother tosses about 100 tennis balls into the air. Her daughter, an all-state midfielder for the Issaquah High School, locks onto each ball and thwacks it across the driveway with her head.\n\n\"If you can hit a tennis ball, when it comes time to heading a soccer ball it seems so much easier just because of the size,\" said Deines, a University of Washington recruit and the senior leader of Issaquah's undefeated soccer team, ranked seventh in the nation by the National Soccer Coaches Association of America.\n\nDeines (pronounced DINE-us) wasn't always a skilled airborne attacker, but the two-time state champion spent countless hours perfecting one of the sport's most difficult skills.\n\nAdvertisement Article continues below this ad\n\nNow the Eagles' co-captain is so fearless in the air that when she goes up for a ball \"all you can do is impede her and pray,\" Bellevue coach Jon Anderson said.\n\n\"There's no one in the air better. She gets a foot taller than everybody else.\"\n\nSmacking soccer balls isn't the only way Deines uses her head. In addition to leading KingCo 3A in scoring each of the past two seasons, she has a 3.9 grade-point average and considered top academic schools such as Stanford and Harvard before deciding on Washington.\n\n\"She's a brilliant kid, and I think that translates onto the soccer field,\" Issaquah coach Tom Bunnell said. \"When we're talking strategy or whatever, she knows. She understands.\"\n\nAdvertisement Article continues below this ad\n\nDeines has been a star at Issaquah since she set foot on campus four years ago. The Eagles won the state championship her freshman year in 2004, and finished first again last season when Deines was named Gatorade State Player of the Year.\n\nSandwiched between the two crowns was a runner-up finish in 2005. Deines missed the state championship game that year because of a conflict with her under-16 U.S. national team, which began practicing in Boca Raton, Fla., the same day as the state final. Without Deines, the Eagles lost 2-0 to Camas.\n\n\"We don't like to talk about that,\" Deines said.\n\nThis season, Deines has the Eagles soaring with their sights set on a third state title in four years. Issaquah is 6-0-1 and riding a 28-game unbeaten steak after Thursday's 4-1 victory over Mount Si in which Deines scored three times for her second hat trick of the season.\n\nAdvertisement Article continues below this ad\n\nDeines is again leading the conference in scoring, netting 10 goals with one assist. The defense has given up one goal all season.\n\nBecause of a change in scheduling, Deines' national team responsibilities have ended for the year. That means for the first time in her high school career, she won't have to worry about missing any portion of Issaquah's state tournament run.\n\n\"It's really fortunate I get to go and represent my country, but at the same time this team is close to my heart,\" Deines said of the Eagles. \"It's hard leaving when you work and you work and you work to get to that point, yet you have to miss it.\"\n\nThat kind of commitment is precisely what makes Deines so likable, teammates said.\n\nAdvertisement Article continues below this ad\n\n\"She's probably the most humble person I've ever met,\" said Issaquah senior Elissa King, who also plays club ball with Deines for Eastside Futbol Club.\n\nAway from the pitch, Deines is like many other 18-year-olds. She's the school's student government assembly director and enjoys watching \"America's Next Top Model.\"\n\nOn the field and under the lights, Deines has an incredibly well-rounded game. She's fast, she's strong, and she can find the net with either foot. She also stands 5 feet 9, which allows her to see the field and read each play as it develops, giving her a huge advantage when it comes time to fly high.\n\n\"If you can be the most dominant team in the air you're going to have a lot of success because if you can win those balls, you're already off to the races,\" Deines said.\n\nAdvertisement Article continues below this ad\n\n\"It's also intimidating for another team when your opponent's going up strong and winning all of the air battles. It's kind of shocking, especially in the women's game, because heading is definitely a weakness.\""}, {"url": "https://theathletic.com/2816877/2021/09/10/washington-spirit-explainer-nwsl/", "page_content": "If you’re feeling a little overwhelmed by the steady stream of Washington Spirit breaking news these days, you’re probably not alone. In the last month alone, the team has re-assigned its head coach then suspended him pending an investigation, suffered a COVID-19 outbreak that postponed one of their games, hired a club president with limited experience in women’s soccer, dealt with a public power struggle between owners, and suffered backlash on all of this from the club’s most dedicated fans.\n\nTo fully understand all of the current events, though, it helps to put them both in a historical context and in one master list — this all didn’t just start late this summer. While the Spirit struggled at the very start of their existence, the team isn’t new to balancing on-field success with off-field controversy.\n\nWhat follows is a timeline of the team, mostly focused on the Steve Baldwin era and what’s happened this season, with additional context around each development.\n\nTroublesome foundations\n\nThe Washington Spirit were one of the founding teams of the National Women’s Soccer League, joining the league under the ownership of local businessman Bill Lynch. Their first season in 2013 was a rough one as they came in last place out of eight teams with a 3-5-14 record. The following seasons would see a turnaround – the club drafted Crystal Dunn first overall in the 2014 College Draft, then promptly qualified for playoffs two years in a row.\n\nAdvertisement\n\nSep. 7, 2016: Ahead of a Spirit home game against the Reign, Lynch decides to play the U.S. national anthem while both teams are in their locker rooms in order to pre-empt Megan Rapinoe kneeling during the anthem, later calling her protest a “hijacking” to the press. After the game, Rapinoe says “I do think Bill Lynch is homophobic.” In 2019, Ali Krieger and Ashlyn Harris both tell Power Plays Lynch’s refusal to hold an LGBTQ Pride Night was “shameful” and “disappointing,” while Krieger says “I just didn’t feel like I was playing for a club that really respected me and supported me and my lifestyle.”\n\nThe Spirit ultimately made it to the NWSL Championship final in 2016, though they lost in penalties to the Western New York Flash. Dunn, Krieger, and stalwart Canadian midfielder Diana Matheson departed or were traded after the season; 2017 saw a precipitous drop to last place once again under new head coach Jim Gabarra.\n\nSpirit goalkeeper Stephanie Labbé eventually told Olympic.ca that Gabarra subjected her to “constant mental abuse” during this season, which eventually culminated in the Spirit putting Labbé on “medical leave.” When the team once again did not qualify for playoffs in 2018 after eight losses in a row, Gabarra was fired and replaced by assistant coach Tom Torres as the interim head coach for the rest of the season.\n\nAt some point in late 2018, Lynch sold the majority ownership share to Steve Baldwin, though the sale was not publicly announced at the time. Reports of Baldwin’s interest surfaced in October, and by late December, The Washington Post reported that Baldwin’s new role was in effect.\n\nThe start of a turnaround?\n\nUnder Baldwin’s guidance, the Spirit made two key hires.\n\nJan. 4, 2019: The Washington Spirit hire Larry Best as the club’s first CEO. The release states, “In this role, Best is responsible for all club strategy and operations, including the hiring and management of technical staff.”\n\nAccording to a passage in former Spirit midfielder Joanna Lohman’s book “Raising Tomorrow’s Champions,” when Baldwin became majority owner of the Washington Spirit, he “insisted that his daughter’s club soccer coach (Larry Best) become chief executive officer of his new professional team.”\n\nJan. 8, 2019: Washington Spirit officially hire Richie Burke as their head coach and technical director, and announce the rest of the team’s technical staff. Burke coached Baldwin’s daughter Carlyn at National Cathedral School in 2010, as well.\n\nAdvertisement\n\nFeb. 25, 2019: The parent of a former youth player comments on a Spirit Instagram post accusing Burke of using abusive and homophobic language and “disturbing coaching behavior.” The team deletes the comments in question.\n\nIn response to the criticism, the team defends their hiring, stating they communicated with Burke’s former club FC Virginia, Burke himself, and other parents. “What we have learned from FC Virginia and from Coach Burke is that at the time of the issue, FC Virginia investigated the matter and determined no action was necessary,” the Spirit said in a Washington Post report.\n\nMar. 6, 2019: A second player comes forward, alleging that Burke was verbally abusive to players while coaching D.C. United’s U-23 PDL squad. The player remains anonymous, but describes aggressive outbursts and use of homophobic language.\n\n“He would stay on people until either they broke or he got rid of them, basically,” he told Black & Red United. He also noted that Torres — who coached DCU’s U-23 squad with Burke in addition to his duties with the Spirit — witnessed the behavior but said nothing.\n\nApr. 9, 2019: After several months in the position, Baldwin shares his first public statement as majority owner, a lengthy open letter addressing improvements concerning player and fan experiences at the club.\n\n“I come to the Washington Spirit as a father of two daughters, one that plays the game,” the letter opens. “So, yes, I am a soccer dad. Being a soccer dad, I have witnessed first-hand, the incredible dedication, passion, and commitment it takes to become a professional soccer player.”\n\nImprovements announced in the letter include five full time members of the technical staff, a new locker room and players’ lounge, housing per player request, and more. As for the fan experience, Baldwin lists the work being done on the game-day experience at the stadium, but also says the team will hold a Pride Night. The letter does not address any of the allegations against Burke.\n\nAdvertisement\n\n“You asked for a Pride Night. You explained to us why this was important to you. Our players explained why this was important to them. We are having our First Pride Night and our celebration will be commensurate to the importance that you, our players and our organization places on having this occasion.”\n\nMay 27, 2019: Reporter John Halloran asks Burke to address the accusations from former youth players.\n\nLast night I asked Washington Spirit head coach Richie Burke if he had yet to address accusations from some of his former youth players that he had used homophobic slurs. pic.twitter.com/jpbu0GcAwX — John D. Halloran (@JohnDHalloran) May 27, 2019\n\nJun. 22: 2019: After the organization’s first-ever Pride Night game, Burke was asked in a post-game media scrum if he had ever used gay slurs towards players he’d coached. Burke’s answer was one word: “Never.”\n\nIn 2019, the Spirit finished in 5th place, missing a playoff appearance by four points. Attendance also nearly doubled, with the season average increasing to 6,138 fans per match, up from the 2018 season average of 3,892 — setting a new record for the Spirit.\n\nJune 27, 2020: The NWSL Challenge Cup kicks off, and he Spirit looked as if they had successfully managed to overhaul the team’s culture from the Lynch era, in addition to bringing new sponsorships to help right the business side of the club.\n\n“We won a lot of fans over, a lot of people over. Steve Baldwin has been superb in changing the brand and perspective, and that’s been significant. I think people have a general good feel about us, the players are happy, and that manifests itself in every interaction,” Burke told The Athletic that June.\n\nJul. 30, 2020: The team announces that Torres, then an assistant coach and associate GM, has left the team “to pursue other interests.”\n\nNew investors\n\nThe success of the 2020 Challenge Cup causes interest in NWSL to soar, attracting new national sponsorships and big television ratings. The Spirit takes advantage of that interest in a number of ways — most notably by bringing in new investors.\n\nAdvertisement\n\nDec. 12, 2020: A delegation from the Spirit visits Qatar for one week in what the team calls “a cultural exchange.” The team is invited by Qatar ambassador Sheikh Meshal bin Hamad Al Thani, and includes “an exclusive look at 2022 World Cup preparations.” Reception to the visit is not positive, with one of the team’s supporters groups, The Spirit Squadron, releasing a statement on Dec. 16 voicing their concerns about the Spirit associating with Qatar, considering the country’s record of human rights abuses and intolerance of LGBTQ+ communities.\n\nStatement on the Spirit sending a delegation to Qatar pic.twitter.com/id27NMDuoH — Spirit Squadron (@SpiritSquadron) December 16, 2020\n\nDec. 29, 2020: Cognosante CEO Y. Michele Kang joins as an investor, eventually revealed to be for a 35% stake, per a later report from the Washington Post.\n\nJan. 28, 2021: Steve Baldwin participates in an hour-long interview with The Athletic, addressing the team’s approach to the 2021 season, the trip to Qatar, and more.\n\n“We met with the leadership team of the Qatar Supreme Committee for Delivery and Legacy which is their organization that is responsible for the 2022 FIFA World Cup. I don’t think it is appropriate to get into the details of the discussions beyond the fact that they included discussions on human and workers’ rights,” Baldwin told The Athletic.\n\nFeb. 17, 2021: The team announces a huge influx of Spirit investors, including Chelsea Clinton, Jenn Bush Hager, Brianna Scurry, Dominique Dawes, and local investor Devin Talbott, managing partner of Enlightenment Capital, a private investment firm focused on aerospace, defense, government, and technology.\n\nMay 20, 2021: The team announces another batch of new names to the investor group, including the Washington Capitals’ Alexander Ovechkin and his wife Nastya Ovechkina, along with 11 other names from the local DC community. Between the two announcements, in addition to major members of the ownership group, 55 names populate the Spirit’s ownership group, though it is unknown what the actual value is of the stake these investors hold in the club.\n\nBurke’s complicated exit\n\nThe Spirit made a sudden announcement in the middle of the 2021 season: Burke would be stepping away from the head coach role due to health reasons, but would not be leaving the team, and would instead be “re-assigned” to the front office.\n\nAugust 10, 2021: In a now-deleted post, the Spirit announce Burke will be moving into a front office role due to his health.\n\nScreenshot from Washington Spirit website on Aug. 10\n\nAugust 11, 2021: The Washington Post releases a report detailing allegations of verbal abuse from Burke, including racially insensitive comments. Post reporter Molly Hensley-Clancy spoke to several former Spirit players who said they left the team due to Burke’s abuse. These players characterized Burke as “unbelievably volatile” and said he would follow a pattern of negatively singling out players.\n\nAdvertisement\n\nThe Athletic reported that Burke had been given a “final HR warning” before the Post released its investigation, and that Torres, Burke’s assistant coach, had already quietly left the team the summer before after making “inappropriate comments” to players after a 2020 Challenge Cup party.\n\nAugust 11, 2021: Baldwin releases the following statement: “On the heels of our announcement yesterday that Coach Burke was resigning, a Washington Post reporter contacted the Spirit with allegations of mistreatment – verbal and emotional abuse leveled at players – by Coach Burke. We take these allegations very seriously and are undertaking an immediate investigation. Burke has been suspended pending the investigation and is prohibited from contacting players and staff and our facilities. We, as a team, will not tolerate any situation for our players and staff that is less than professional. Our athletes, and all of those who support them, deserve the absolute best.”\n\nAug. 13, 2021: Kang and NWSL Commissioner Lisa Baird are seen watching a Spirit game in Houston together.\n\nThat's definitely Washington Spirit owner Y. Michele Kang with Lisa Baird. Feels very notable after this week. #NWSL pic.twitter.com/OTj1qwlR9M — Meg Linehan (@itsmeglinehan) August 14, 2021\n\nThe fallout continues\n\nThe Spirit continued on- and off-field business, but each step the club has taken since the original Burke reporting seems to have further and further alienated many of their fans, including supporter groups Spirit Squadron and Rose Room Collective.\n\nAug. 19, 2021: The Spirit announce IntelliBridge as the front of jersey sponsor for the remainder of the 2021 season, describing them as “a premier partner to homeland security, federal law enforcement, defense, and civilian agency customers who helps solve complex technology, intelligence, and mission support challenges.” IntelliBridge is also one of the investments listed at Enlightenment Capital, Spirit investor Devin Talbott’s firm, which also helps point to Talbott’s growing influence with the ownership/investor group. While it didn’t earn a huge amount of attention, the reaction was largely negative amongst NWSL fans.\n\nAug. 20, 2021: Spirit announce University of North Carolina women’s soccer head coach Anson Dorrance as a new advisor for the club. Baldwin and investor Devin Talbott are both quoted in the official release, with Talbott saying: “I was fortunate to recently get to know Anson. And when he agreed to provide our team with counsel, I could not say ‘yes’ fast enough.”\n\nThe announcement is met with criticism on two fronts. First, Dorrance’s remarks while commentating a NWSL match in 2017 in which he said, “”If I had a gun as the coach on the sideline, I would have shot her right there,” about a player. Second, the 2008 settlement of a lawsuit about Dorrance’s coaching time at UNC, in which a former player sued due to “claims of sexual harassment, invasion of privacy and interference with religious rights.”\n\nAug. 21, 2021: President of business operations Lindsay Barenz parts ways with the Spirit. Sources tell The Athletic that she participated in the investigation into Richie Burke, and had internally raised concerns about the IntelliBridge sponsorship. Supporter group Spirit squadron calls the loss of Barenz “a complete failure of leadership within the ownership group of the Spirit.”\n\nAug. 29, 2021: The Spirit host Service Member Appreciation Night and invite retired Air Force general Michael Hayden as their “distinguished guest.” Hayden was director of the National Security Agency from 1999 to 2005 and director of the Central Intelligence Agency from 2006 to 2009, and has been accused of lying to Congress about the CIA’s use of torture.\n\nA power struggle between Baldwin and Kang\n\nThanks in large part to those recent missteps, public pressure mounts for Baldwin to sell his stake in the Spirit, but there’s also reporting about the internal battle between Baldwin and Kang for control of the team.\n\nAug. 29, 2021: Spirit supporters group Rose Room Collective display a “Sell the team, Steve” banner at a Spirit home game against the North Carolina Courage. The Spirit request that Rose Room remove the banner. Douglas Reyes-Ceron of Rose Room Collective joined Full Time with Meg Linehan to discuss what happened at Audi Field and give a supporter’s perspective on the state of the team.\n\nAug. 30, 2021: A follow-up report from the Washington Post describes a power struggle between Baldwin and Kang. Baldwin initially offered to sell his stake of the team to Kang in April before changing his mind. According to the report, Baldwin emailed the league front office and team owners about Kang and her desire for Baldwin to step aside. (Kang was also copied on the email.)\n\nHensley-Clancy also makes a guest appearance on Black & Red United podcast Plex Weather to discuss her reporting on the ownership dynamic. In the episode, she describes the timeline of the communication around Baldwin selling to Kang, and further details that players she spoke to felt they could not report their abuse initially for fear of retaliation, and that they felt ownership already knew it was happening.\n\n🌩️🚨 NEW EPISODE 🚨🌩️@mollyhc joins the show to talk about the off-field issues at the Spirit, including the abuse allegations, the ownership struggle, & the banner debacle from Sunday. We also did talk about the game! #RiseUpDC #NWSLhttps://t.co/l0GqM2uEH7 — Plex Weather (@PlexWeather) September 2, 2021\n\nSep. 2, 2021: The Spirit hire former D.C. United head coach Ben Olsen as their president of team operations. His responsibilities are listed as “oversee all day-to-day operations, driving the development of the team’s business and sporting operations, and the overall effort to enhance the club’s culture and identity.” Talbott is also quoted on the hire in the team’s press release, pointing to his work with Olsen for charitable group D.C. Scores. A 2015 DC Inno article names Olsen as an early investor into Talbott’s firm, Enlightenment Capital.\n\nCOVID-19 strikes the Spirit\n\nWith the Spirit hanging on to a playoff position, the team travels to Portland to play the Thorns.\n\nSep. 4, 2021: Washington Spirit vs. Portland Thorns is postponed as four positive cases of COVID-19 are reported among the Spirit. Sources tell Pablo Maurer there are as many as eight unvaccinated players on the Spirit.\n\nSep. 4, 2021: Local D.C. sports radio host Chris Russell tweets that Kang is being investigated by the NWSL under the anti-harassment policy. Sources confirm to The Athletic later in the day that Larry Best filed a complaint against Kang under that policy.\n\nMultiple sources have confirmed that Larry Best filed a complaint to the #NWSL under the anti-harassment policy concerning owner Michele Kang. — Meg Linehan (@itsmeglinehan) September 4, 2021\n\nRussell also tweets he was told by sources that Kang hosted a “dumpling making party” that is “believed” to have led to the COVID-19 outbreak. However, players had documented other in-person gatherings on their social media accounts and as of the writing of this article, the team has not stated publicly whether contact tracing has definitively identified that event as the source of the outbreak.\n\nWhat comes next?\n\nWe’re still awaiting the results of the league’s investigation into Burke. It also remains to be seen if the league officially acknowledges Best’s complaint against Kang, and if it prompts its own investigation. Historically, however, the league has said very little about the results of investigations. It may come down to the Spirit either ending Burke’s suspension and allowing him to continue working for the club in the front office role they had planned for him, or ending his contract.\n\nThe status of the team’s Sep. 12 game at Audi Field against OL Reign is still in limbo. The Reign traveled to D.C. on the 5th, following their away match in Louisville to prevent having to fly out and back from the West Coast, and head coach Laura Harvey told media she was waiting on an update from the league front office.\n\nThe league has also yet to provide a new date for the postponed match between the Spirit and Thorns. Potentially, the Spirit could fit in an extra game on a scheduled trip to the Pacific Northwest, since they’re scheduled to face the Reign in Tacoma on Oct. 16 — but they’ll have to work around the Thorns’ schedule and the availability of Providence Park.\n\nThe Spirit have eight games left to play this season, and with six playoff spots up for grabs for 10 teams this season, making it to the postseason is absolutely a goal for this team. There’s no timeline yet for hiring a new head coach on a permanent basis, with new team president Ben Olsen telling The Athletic that interim manager Kris Ward will continue in his current role.\n\nAs for the internal tension between Steve Baldwin and Michele Kang — it’s anyone’s guess as to how it will end. According to multiple sources, the NWSL front office and the rest of the owners have — at least for now — removed the Spirit entirely from communications about league governance while investigations are underway. With little details expected about the Burke investigation, it’s also unknown how much Steve Baldwin’s role in hiring him might be called into question.\n\nWhile Olsen has only been on the job for a matter of days, and has a long road ahead of him, he struck a reassuring note in his interview. “If you’re just reading articles about the club it looks like the club is really turbulent,” he said. “But the two major parts of this, the front office and the team itself, are in really good shape.”\n\n(Photo: Robin Alam / Icon Sportswire via Getty Images)"}, {"url": "https://gohuskies.com/news/2017/4/27/womens-soccer-where-are-they-now-kate-deines.aspx", "page_content": "Kate Deines was a member of the Huskies from the 2008 to 2011 seasons, and ended her career as one of the top midfielders in program history. Joining the team from Issaquah, Wash., she concluded her time at UW tied for 6th in both goals scored and game-winning goals in a career, and is currently the all-time leader in both games played and games started at 86.\n\nDeines made appearances for the US on both the U16 and U23 National Teams, and played professionally with the Seattle Reign and abroad in both Germany and Iceland. Described by head coach Lesle Gallimore as a \"do whatever it takes to win\" player, one of her most memorable moments during her career came in 2010, when she hit both the first and 11th penalty kicks to upset No. 2 Portland in the NCAA Second Round.\n\nShe collected plenty of awards and honors during her time with the Huskies, earning All-Pac-10 First Team honors during 2010, and was picked to the conference's second team in 2009 and 2011. A two-time NSCAA All-Region selection and two-time conference All-Academic second team honoree, Deines was named a Lowe's Senior CLASS Award candidate and a Herman Trophy Award watch list member during her senior campaign.\n\n\n\nWhat is your current job?\n\nAn Investment Advisor at Arnerich Massena.\n\nWhat was your most memorable moment as a Husky?\n\nOne of my best memories is the Dawg pile on Metro Field after upsetting Portland in a penalty kick shootout, marking the beginning of our Elite Eight run in the 2010 NCAA Tournament.\n\nWhat do you miss the most about Washington?\n\nI miss getting to spend every day with my UW women's soccer family, while getting to compete in the nation's best conference!\n\nWhat was your least favorite part about the college life?\n\nLeast favorite part? Nah, college was the absolute best.\n\nWhat is one thing you learned during your time at UW that you use on a regular basis today?\n\nI learned how to successfully collaborate with a diverse group of people and how to thrive in a group environment."}, {"url": "https://soccer.nbcsports.com/tag/kate-deines/", "page_content": "A weekend that saw Ali Krieger suffer a scary head injury was another reminder of what’s at-risk for players in low-paying leagues around the world.\n\nSure, Krieger’s salary is paid by U.S. Soccer and not the Washington Spirit, but the 30-year-old USWNT player’s story shows is still a cautionary reminder of what the women of the National Women’s Soccer League are putting on the line in order to grow a league by getting by on salaries largely between $6,000-38,000 over six months.\n\n[ SPORTSWORLD: NWSL players chasing the dream ]\n\nConsider the tale of recently-retired 25-year-old Kate Deines, from Jeff Kassouf’s NBC SportsWorld piece on life in the NWSL:\n\nDeines played in 18 matches in 2014 for the Reign, starting half of them. The longtime Pacific Northwest inhabitant was traded to FC Kansas City in the offseason and she is exactly the type of player who is likely to have a great opportunity to take on a more prominent role this season and next as clubs deal with player absences due to the World Cup and Olympics. But Deines, who has a bachelor’s degree in communications and media studies as well as a master’s in continued education from the University of Washington, couldn’t continue to turn down business opportunities in favor of the low-paying league. In the increasingly expensive Seattle housing market, Deines’ income level meant she lived in a five-bedroom house with three teammates and a pair of players from Major League Soccer’s Seattle Sounders. “It definitely feels like an extension of college life, and it is way less glamorous than college,” Deines said.\n\nAs for the on-the-field, some lopsided scores popped up on opening weekend.\n\nSeattle Reign 5-1 Western New York Flash\n\nEven when Megan Rapinoe wasn’t scoring, her Welsh hair-twin Jess Fishlock was making sure a shock of blonde hair was putting a ball in the goal. Rapinoe recorded a hat trick as Seattle busted open the match with four second-half goals. Fishlock and Beverly Yanez also scored, while Jordan Angeli netted for the Flash.\n\nWashington Spirit 0-2 Houston Dash\n\nNew faces shone in Friday’s league opener, as Carli Lloyd and Kealia Ohai scored on each side of halftime and Stephanie Roche subbed on to make her NWSL debut for Randy Waldrum’s Dash. Ashlyn Harris made five saves in the loss.\n\nBoston Breakers 1-4 Portland Thorns\n\nAllie Long goals in the 71st and 72nd minutes salted away this one for the visitors, while Meleana Shim added a goal and two assists. Sinead Farrelly also scored, with Stephanie McCaffrey providing Boston’s only goal.\n\nSky Blue FC 1-0 FC Kansas City\n\nNadia Nadim’s first-half goal helps Sky Blue steal one from FCKC, which out shot the hosts 15-5. Lauren Holiday led all players with four shots, all on goal.\n\nIdle: Chicago Red Stars\n\nFollow @NicholasMendola"}, {"url": "https://www.washingtonpost.com/sports/2022/03/30/michele-kang-spirit-sale/", "page_content": "Listen 2 min Comment on this story Comment Gift Article Share\n\nY. Michele Kang is now the majority owner of the Washington Spirit, the team announced Wednesday, having closed a $35 million deal that makes her the first woman of color to own a controlling stake in a National Women’s Soccer League team. Wp Get the full experience. Choose your plan ArrowRight Kang, the founder of a health-care technology company, will head up an ownership group that ultimately will be made up mostly of women, the team said. The sale agreement was first announced in February.\n\nKang’s purchase of the team from former majority owner Steve Baldwin marks the close of an extraordinary period of upheaval for the Spirit, which won the NWSL title last year. After former coach Richie Burke was fired in the wake of allegations of verbal and emotional abuse, Spirit players and fan groups rallied around Kang, then a minority owner, and called on Baldwin to sell the team to her.\n\nAdvertisement\n\nBaldwin presided over a revitalization of sorts for the Spirit, securing a new playing field and bringing in an influx of young talent. But current and former employees of the Spirit told The Washington Post that the team operated as an “old boys’ club,” and a flood of top female employees left the team midseason.\n\nBaldwin agreed to sell the Spirit last year but fought Kang’s offer for months. He instead attempted to sell the team to Todd Boehly, a Los Angeles billionaire who is a part-owner of MLB’s Dodgers and the WNBA’s Sparks, for $10 million less than Kang offered. But the sale fell through after Kang convinced many of the Spirit’s investors to become shareholders and sell their stakes to her.\n\nSome NWSL owners and executives backed Boehly’s bid over Kang’s, people with knowledge of the sale said. On Wednesday, Marla Messing, the NWSL’s interim CEO, said in a news release that the league was “thrilled that the sale of the Washington Spirit to Michele Kang has closed.”\n\nAdvertisement\n\nIn the release, Kang promised to invest in a permanent training facility for the team, which was, for a time, forced to train at a high school field in the midst of its championship push. The Spirit also lacks a corporate sponsor for its jersey.\n\nThe Spirit will host the North Carolina Courage at 7:30 p.m. on Wednesday at Audi Field as part of the Challenge Cup, the NWSL’s preseason tournament. Kang is expected to attend.\n\nGiftOutline Gift Article"}, {"url": "https://www.celebsagewiki.com/kate-deines", "page_content": "Age, Biography and Wiki\n\nKate Deines was born on 17 September, 1989 in Portland, OR, is an American soccer midfielder-defender. Discover Kate Deines's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 33 years old?\n\nPopular As N/A Occupation N/A Age 33 years old Zodiac Sign Virgo Born 17 September 1989 Birthday 17 September Birthplace Portland, OR Nationality OR\n\nWe recommend you to check the complete list of Famous People born on 17 September. She is a member of famous with the age 33 years old group.\n\nKate Deines Height, Weight & Measurements\n\nAt 33 years old, Kate Deines height is 5′ 11″ .\n\nPhysical Status Height 5′ 11″ Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nKate Deines Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Kate Deines worth at the age of 33 years old? Kate Deines’s income source is mostly from being a successful . She is from OR. We have estimated Kate Deines's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nKate Deines Social Network\n\nInstagram Linkedin Twitter Kate Deines Twitter Facebook Wikipedia Kate Deines Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.howold.co/person/kate-deines/biography", "page_content": "Kate Deines Biography\n\nAmerican soccer midfielder-defender\n\nKathleen Ann Deines (born September 17, 1989) is an American soccer midfielder–defender. She most recently played for Turbine Potsdam in the German Bundesliga and Seattle Reign FC of the National Women's Soccer League. Deines was a fourth round pick (23rd overall) of the Atlanta Beat of Women's Professional Soccer in the 2012 WPS Draft of college seniors on January 13, 2012. The WPS Board of Governors voted to suspend the 2012 season on January 30 citing pending legal issues. Subsequently, she was free to sign with other teams and rejoined the Seattle Sounders Women, the organization she had previously played for from 2007 to 2009. After the formation of the National Women's Soccer League in late 2012, Deines played for the Seattle Reign during the league's first two seasons. She was traded to FC Kansas City in late 2014 but announced her retirement from professional soccer on March 31, 2015, before the 2015 season began.\n\nEarly life\n\nDeines was born in Portland, Oregon, on September 17, 1989, to Matt and Betsy Deines. As a freshman at Issaquah High School, Deines helped lead the soccer team to its first state championship final since 1988 and first *le ever. Deines led the team to four consecutive conference championships from 2004 to 2007 and four state *le games, winning three of them. Issaquah's lone runner-up finish was in 2005 when Deines was forced to miss the championship game to join the United States Youth Soccer *ociation Olympic Development Program in Boca Raton, Florida following the semifinal. Issaquah went on undefeated the next two years with Deines in the lineup.\n\nDeines capped off her high school career by scoring the game-winning goal in the 71st minute of the 2007 state final, a 1–0 victory over Seattle Prep.\n\nDeines finished with a total of 76 goals and was named to the all-state team four times and chosen as the state's Gatorade Player of the Year twice. During her senior year she was named to the Parade and NSCAA/adidas Girls High School All-America teams.\n\nDeines has played soccer with the Seattle Sounders Women since joining the team in 2007 while still in high school.\n\nUniversity of Washington\n\nDeines was a four-year starter for the Washington Huskies, starting a school-record 86 games and scoring 21 goals. She was named to the Pac-10 All-Freshman First Team and was a four-time All-Pac-10 selection and a two-time NSCAA Scholar All-American.\n\nAs a freshman at the University of Washington, Deines helped the Huskies return to the NCAA Tournament after a three-year absence. She played a leading role as team captain during her junior year. She converted two key penalty kicks, including the game winner, during an epic penalty shoot-out in a shocking upset of the No. 2 overall seed University of Portland in the second round of the NCAA Tournament. The Huskies would eventually go on to the Elite Eight where they were eliminated in an overtime loss at Boston College.\n\nPlaying career\n\nClub\n\nDrafted to the Atlanta Beat, 2012\n\nDeines was selected as a fourth round pick (23rd overall) by the Atlanta Beat in the 2012 WPS Draft of college seniors on January 13, 2012; however, the league suspended operations before play began.\n\nFrom Seattle to Iceland, 2012\n\nAfter the WPS folded in 2012, Deines signed with the Seattle Sounders Women. She made 12 appearances for the club, scoring one goal. Following the conclusion of the W-League season, Deines and her Sounders teammate and fellow University of Washington alum, Verónica Pérez, played for Stjarnan Women in Iceland's top division. The team won the Icelandic Women's Cup after a 1–0 win over Valur. Of her time in Iceland, Deines said, \"Even though it was a spur of the moment decision to play overseas in Iceland, I believe my three month stint helped in my development as a player. Icelandic soccer was not nearly as technical or tactical as soccer in the United States but the extreme physicality of our practices and games challenged me to play with a whole new level of aggression. Playing professionally in Iceland also allowed me an opportunity to keep practicing and playing games on a daily basis which would not have been the case if I would have stayed in the United States.\"\n\nSeattle Reign FC, 2013–14\n\nIn February 2013, Deines signed with the Seattle Reign FC as a free agent for the inaugural season of the NWSL. Deines made 17 appearances for the club with 11 starts, tallying a total of 979 minutes.\n\nPotsdam, 2014–15\n\nIn September 2014, Deines signed a one-year contract with Germany's Turbine Potsdam in the Bundesliga.\n\nInternational\n\nDeines was a member of the United States U-23 women's national soccer team and traveled to Sweden in June 2011.\n\nPersonal life\n\nDeines' younger brother Jay is an offensive lineman on the football team at Eastern Washington University.\n\nSee also\n\nWomen's *ociation football portal\n\nSports portal\n\n*ociation football portal\n\nBiography portal\n\nList of University of Washington people\n\nList of people from Portland, Oregon\n\nReferences\n\nExternal links\n\nWashington player profile\n\nSeattle Sounders Women player profile\n\nKate Deines at Soccerway\n\nKate Deines on Twitter\n\nWikimedia Commons has media related to Kate Deines."}, {"url": "https://www.theguardian.com/football/2022/feb/18/uswnt-czech-republic-shebelieves-cup-trinity-rodman", "page_content": "Trinity Rodman made her debut for the US women’s national team in a scoreless draw with the Czech Republic on Thursday night in the SheBelieves Cup.\n\nWith some of the national team’s more recognizable stars – Alex Morgan, Megan Rapinoe, Christen Press and Tobin Heath – left off the roster for the tournament, coach Vlatko Andonovski made good on his pledge to evaluate young prospects.\n\nThe average age of the starting lineup was 25.5, the youngest since April 2018. Five starters had fewer than 15 appearances with the team. Goalkeeper Casey Murphy was playing in just her third game.\n\n“I’m happy with where they’re at right now,” Andonovski said. “But we all know that how we look and where we’re at is nowhere near enough to win big games.”\n\nRodman, the 19-year-old daughter of former NBA star Dennis Rodman, came in as a substitute in the second half. She recently signed a four-year contract with the Washington Spirit worth a reported $1.1m, making her the highest-paid player in the National Women’s Soccer League.\n\n“Obviously we all know Trinity is a good player and I thought she was dangerous when she came in, got a couple of good opportunities and was threatening the backline of Czech Republic. And that was exciting to see her there,” Andonovski said.\n\nThe United States won the bronze medal at the Tokyo Olympics last year, and is preparing for World Cup qualifying this summer in Monterrey, Mexico. The Americans are the defending World Cup champions.\n\nThe SheBelieves Cup, a four-team round-robin tournament, continues Sunday at Dignity Health Sports Park. The United States will face New Zealand while the Czech Republic face Iceland.\n\nMost of the players for the Czech Republic play in their home country, but there were handful of exceptions in the team’s lineup, including goalkeeper Barbora Votikova, who plays for Paris Saint-Germain, Andrea Staskova, a rising star with Juventus, and West Ham’s Katerina Svitkova.\n\nVotikova stopped a shot from Rodman, who was ruled offside, in the 68th minute. The Czech goalkeeper finished with eight saves.\n\nThe Czech Republic are currently ranked No 24 in the world. They’ll face Iceland on 12 April in World Cup qualifying.\n\nDefender Becky Sauerbrunn became the 12th woman with 200 appearances for the US women’s national team when she came in as a sub in the second half.\n\n“It’s just about the journey, and the journey has been wild and it’s been tough, but it has been so rewarding,” Sauerbrunn said afterward. “And I feel very, truly fortunate that I’ve gotten to represent this team and this program 200 times.”\n\nIn the earlier game Thursday, Dagny Brynjarsdottir scored in the first 48 seconds and Iceland downed New Zealand 1-0. It was the fastest goal ever in the tournament, which is in its seventh year.\n\nOne highlight of the early match was Rebekah Scott’s return for New Zealand after a battle with Hodgkin’s lymphoma. She came in as a substitute in the 74th minute."}, {"url": "https://washingtonspirit.com/2021/02/17/washington-spirit-announces-new-investor-group/", "page_content": "Washington, DC (February 17, 2021) – The Washington Spirit today announced a new group of investors who are joining the Spirit Family to support the club’s goals of winning championships, promoting the women’s game in the US, and becoming the premier women’s sports property in the world. This new investor group brings to the club a remarkable range of resources, networks, and skillsets to help drive the club’s growth. The Spirit has brought together influential figures, including Chelsea Clinton, Jenna Bush Hager, Bonnie McElveen-Hunter, Estee Portnoy, Briana Scurry, Dominique Dawes, Assia Grazioli-Venier, Razmig Hovaghimian, Matt Hong, Tom Daschle, Claire Shipman, Mary Mochary, Suzanne Niedland, and Devin Talbott, lead investor in the new group.\n\n“It is fitting that the Washington Spirit have an investor group commensurate with the dynamism and diversity of DC and its place as the most powerful city in the world,” said Steve Baldwin, Spirit Managing Partner. “As the 2021 season rapidly approaches, our fans will learn more about how this group came together, hear directly from new investors on their excitement to join us, and our plans for the future.”\n\n“Our investor group reflects DC’s political roots, sports legacy, international reach, and thriving business and technology community. We share a common vision and committed purpose to elevate women’s soccer, both for Washington Spirit players and the young girls pursuing their passions on the pitch and beyond,” added Devin Talbott.\n\n“In the past year Michele Kang joined Bill Lynch and me in ownership and her leadership and engagement have been instrumental in the transformation of the Spirit. Her impact in our work, and bringing this new group together, has been magnificent and I thank her for all she does,” said Baldwin.\n\n“It’s hard to even articulate the impact Steve and Michele are having on this club,” said Spirit Founder Bill Lynch. “In a short period of time they have pulled together an investor group that is second to none and generated significant interest from many more,” Lynch added.\n\n“Our club has big ambitions globally. With an eye to expanding the Spirit fan base, building on the team’s current footballing success, and capitalizing on the entrepreneurial intersection of technology and sports entertainment, Michele, Bill, and I are thrilled that global sports, media, and business executives have also joined our group. These include women in the fields of politics, sports and entertainment, and finance such as Bonnie McElveen- Hunter, former Ambassador to Finland and the first Chairwoman of the American Red Cross, Estee Portnoy, a Senior Executive in Michael Jordan’s Family Office and Executive Producer of the Emmy Award winning “The Last Dance”, and Assia Grazioli Venier, co-founder of Muse Capital, and Board of Directors of Juventus FC / Juventus Women.\n\nWe are also fortunate to welcome highly successful media and sports executives Matt Hong, former COO of Turner Sports and Vice Chairman of OXIGEN Beverages, and Razmig Hovaghimian, a former Senior Executive Officer at Rakuten (Main Global Partner of FC Barcelona), and founder of Embrace and global streaming video platform Viki. With their support, we’re excited to be bringing the best of US football to fans worldwide.” added Baldwin."}, {"url": "https://washingtonspirit.com/2014/04/25/spirit-fall-to-seattle-reign-fc-3-1/", "page_content": "The Washington Spirit fall 3-1 to Seattle Reign in front of a crowd of 1,754 at Memorial Stadium Wednesday night.\n\nThere was only one lineup change from the Spirit’s 3-1 victory over FC Kansas City with Danesha Adams replacing Lori Lindsey . This is a new role for Adams as she is well-known for her ability to find the back of the net and has featured for the Spirit up top on the left side. The Spirit came out again in a 4-2-3-1.\n\nThe Reign’s big change from its home-opening line up was the insertion of Nahomi Kawasumi in place of USWNT midfielder Megan Rapinoe, who rested a minor foot injury.\n\nThe scoring got off to a very early start in the 2nd minute when Kendall Fletcher got on the end of a Jessica Fishlock cross after a short corner kick. Fletcher got in front of Adams and with a little flick of the outside of her foot, lobbed it over Spirit goalkeeper Ashlyn Harris.\n\nWith a 1-0 lead, the Reign had the majority of possession and dangerous attacks on a slick, bouncy surface, creating good interchanges up front and possession in the final third. Defensively, the Spirit held a lower pressure line, allowing the Reign to control more of the ball. The score held 1-0 going into the half.\n\nIn the 49th minute, Kim Little earned the Reign a corner kick after battling two Spirit defenders in the left corner. Kawasumi’s kick found the head of a very forceful, onrushing Keelin Winters and then the back of the net.\n\nThe 2-0 score held and it didn’t look as though the Spirit would find any rhythm or gain any momentum until the 64th minute when Spirit Head Coach Mark Parsons made two tactical changes, introducing Lori Lindsey and Veronica Perez for Adams and Crystal Dunn.\n\nThe Spirit started to possess the ball better in the attacking third and created several scoring opportunities, including a ball slipped in behind from Lindsey to Diana Matheson, who attempted to put the ball past Reign goalkeeper, Hope Solo from inside the six-yard box. Solo quickly closed down Matheson and made the save.\n\nThe Spirit earned a penalty kick in the 72nd minute when Reign goal scorer Fletcher handled the ball in the box. Matheson converted after Solo guessed the wrong way, adding her team-leading third goal of the season.\n\nIn the 73rd minute, with the score 2-1, Spirit forward Renae Cuellar came in for Jodie Taylor. Cuellar proved to be a bit of a spark up top, joining the surge to press for an equalizer.\n\nAgainst the run of play in the 81st minute, Fishlock increased the Reign’s lead with a low driven shot to the far post from outside the 18-yard box after a well-taken first touch to get herself on the turn.\n\nWith the win, the Reign sit on top of the NWSL table with two wins for 6 points, while the Spirit fall to 1-2-0 (3 points). The Reign will host the Houston Dash on Sunday afternoon and the Spirit will complete their third game in a week at Chicago on Saturday night.\n\nWashington Spirit\n\n(GK) Ashlyn Harris, (C) Ali Krieger, Tori Huster, Toni Pressley, Robyn Gayle, Yael Averbuch, Christine Nairn, Diana Matheson, Jodie Taylor (Renae Cuellar 73), Crystal Dunn (Veronica Perez 64), Danesha Adams (Lori Lindsey 64)\n\nSubs not used: Jordan Angeli, Bianca Sierra, Chantel Jones, Cecilie Sandvej\n\nSeattle Reign\n\n(GK) Hope Solo, Elli Reed, Lauren Barnes, Kendall Fletcher, Stephanie Cox, (C) Keelin Winters, Jessica Fishlock, Kim Little, Beverly Goebel, Nahomi Kawasumi (Kiersten Dallstream 90+), Sydney Leroux (Kate Deines 82)\n\nSubs not used: Megan Rapinoe, Danielle Foxhoven, Mariah Noguiera, Megan Brigman, Haley Kopmeyer"}]}