{"Kate Deines played for the Freedom until the team folded in 2011.": [{"url": "https://gohuskies.com/sports/womens-soccer/roster/kate-deines/1053", "page_content": "Kate Deines Photo Gallery\n\nWashington\n\n2011 (Senior): Named a Lowe's Senior CLASS Award Candidate ... a Hermann Trophy Award Watch List member ... First-Team All-Pacific Region ... Second-Team All-Pac-12 ... Second-Team Academic All-Pac-12 ... named NSCAA Second-Team Scholar All-American ... Second-Team ESPN Academic All-District ... named to the 20-Year All-UW Women's Soccer Team ... Husky/Nike Invitational Offensive MVP ... earned the 101 Club Scholar-Athlete and the Faith Awards at the team banquet ... in the Summer of 2011 played on the U-23 National Team ... Started 18 games ... ends UW career starting every single game that she played for the Huskies ... had two goals with 18 shots, two assists, and finished with six points ... scored on a penalty against USF (Sept. 25) and also had a season-high five shots against USF ... scored her final UW goal against Utah in the 55th minute in a 4-0 win ... missed two games due to injury ... ranked first in UW career record books in games played and started (86), 10th in points (47), tied for sixth in goals (21), tied for sixth in game-winning goals (7) ... also had a career 132 shots.\n\n2010 (Junior): Earned the Provost Academic Excellence Award at the WESPYs ... Husky team captain ... First-Team All-Pacific Region ... First-Team All-Pac-10 ... the Gohuskies.com Student-Athlete of the Week on Sept. 6 ... the MVP of the Husky/Nike Invitational ... Second-Team Pac-10 All-Academic ... NSCAA Scholar All-West Region ... Second-Team NSCAA Scholar All-American ... ranked 98th on the TopDrawerSoccer.com Top 100 Upperclassmen list and 16th in the Pac-10 ... had her best year yet as a Husky as she was one of four players to play and start in all 24 games ... played midfield most of the season but started in the back line at the end of the year due to team injuries ... led the team in goals (9), points (19), game-winning goals (3), shot percentage (.265) and penalty kicks (3-3) ... also had one assist, 34 shots and 18 shots on goal (.529 SOG %) ... completed her first career hat trick and just the 17th in school history vs. Syracuse on Sept. 3, scoring three out of the teams four goals, including two penalty kicks ... had her first goal of the season in that game in the 18th minute, which would be the game-winner ... then scored in the 19th minute on PK and in the 49th minute also on a PK ... scored the game-winning goal vs. Penn State on Sept. 10 in the 30th minute ... scored goals in back-to-back games twice on the season, first vs. Cleveland State on Sept. 17 in the 37th minute and at St. Mary's on Sept. 24 in the 60th minute ... then scored in back-to-back games in Pac-10 play vs. Arizona State on Oct. 10 on a game-winning penalty kick in the 15th minute and at Cal on Oct. 15 in the 69th minute ... scored her final goal on the year at Washington State on Nov. 5 in the 62nd minute ... assisted Kellye Joswick on a goal in the 53rd minute of the Pac-10 opener vs. Arizona on Oct. 8 ... in the NCAA Second Round game at No. 2 Portland on Nov. 14, took the first and 11th penalty kicks for UW, making both attempts ... ranks ninth at UW on the single-season list in goals for the 2010 season ... in the school career record books ranks seventh in game-winning goals (7), eighth in goals (19) and 10th in points (42) ... in the final Pac-10 standings for all games, tied for eighth in goals and ninth in points ... in conference only games, ranked ninth in goals and goals per game.\n\n2009 (Sophomore): Named NSCAA Second Team All-Pacific Region and Second-Team All-Pac-10 along with Honorable Mention All-Academic ... started all 22 games after starting all 22 as a freshman in 2008 ... one of four players to start every game... A consistent, hard-working midfielder ... chipped in nine points on three goals and three assists ... tied for fourth on the team with nine points ... ranked third on the team with 43 shots ... two of her three goals were game-winners, including the lone goal in UW's 1-0 win over Ole Miss in the NCAA First Round ... her other game-winner came in the season's third match as she scored the first goal in UW's 3-0 win over Columbia in the Husky Nike Invitational ... it was her first goal of the season ... also scored a goal in UW's 2-1 win over Utah State ... had the game-tying assist in UW's 3-2 overtime win over UC-Irvine, setting up Veronica Perez in the 88th minute to send the match into OT ... assisted on UW's only goal in a 1-1 draw with Arizona State ... also set up Perez for UW's lone goal in a 2-1 loss to No. 4 UCLA.\n\n2008 (Freshman): Made an immediate impact in her first season, scoring seven goals, which ranked second on the team ... the mark also ties for the second-most goals by a freshman in Husky history behind Kim Taylor's eight ... named to the Pac-10 All-Freshman First Team and was also named honorable mention All-Pac-10 ... also voted Soccer Buzz First-Team Freshman All-American along with All-West Region Second-Team and First-Team Freshman All-West Region ... named the team's Rookie of the Year ... four of her goals came in Pac-10 play ... Also second on the team in points (14) and shots (37) ... two of her goals were game winners ... started all 22 games ... scored her first goal just 33 minutes into her career, scoring the second goal in UW's 3-0 opening win over Montana ... scored her first Pac-10 goal in UW's 3-2 win over Cal, evening the score at 1-1 in the 47th minute ... scored the game-winner in UW's next game, a 2-1 win at Oregon State ... her second game-winning goal came in UW's regular-season finale against Arizona when she made the score 2-0 in the 63rd minute; UW went on to hold on for a 2-1 win .... also scored against San Diego State and Arizona State and added her first postseason goal in UW's 3-2 win over LSU in the NCAA First Round ... the goal against LSU came with UW trailing 2-0 in the 60th minute and kicked off a run of three unanswered goals which sent the Huskies into the Second Round.\n\nIssaquah High School:\n\nTwo-time Gatorade State (WA) Player of the Year (2006, 2007) ... four-time all-state selection ... a NSCAA All-American in 2007 ... led the Eagles to three Class AAA state titles in her four championship game appearances ... team won the KingCo league title in all four of her years ... registered 22 goals and four assists during her senior year as the team finished its second-straight undefeated season at 19-0-1 ... team posted a 75-5-3 record in her four years ... amassed 76 career goals including the game-winner against Seattle Prep in the 71st minute of the 2007 state final ... served one year as captain ... named First-Team All-KingCo Conference all four years ... honored as Class AAA Player of the Year and named to the Seattle Times all-area team in both her junior and senior seasons.\n\nPersonal:\n\nParents are Betsy and Matt Deines ... has a younger brother, Jay ... won an ODP national championship with the Washington state ODP squad in 2004 ... team also finished first in the WSYSA (Washington) State club championships in 2006-07 ... spent two years as a volunteer with Athletes for Kids ... prep teammate of former Husky teammate Lindsey Kasser ... also considered Portland and Stanford.\n\nCoach Gallimore on Deines:\n\n\"Kate is one of the most technically sound players I have seen in a long time. She is a very complete player who is extremely self-motivated to become the best. She is a proven winner on and off the field.\"\n\nGETTING TO KNOW KATE DEINES\n\nNickname KTG Favorite song Replay by Sean Kingston Guilty pleasure Chocolate covered strawberries Strangest thing a coach ever said to you \"Go to jail\" - The Warden (aka Jim Thomas) Most embarrassing soccer moment When I peed my pants in our preseason game last year against Purdue Favorite part of being a Husky Having the opportunity to be a part of such an awesome team. Love you all! Favorite restaurant in Seattle Marrakesh (it's a fun time) Favorite place on UW campus Husky Soccer Field at 7 p.m. on a Friday night Current cell phone ring tone Use Somebody by Kings of Leon Zodiac sign Virgo If you could guest star on a TV show, what would it be? Gossip Girl Biggest celebrity crush Johnny Depp and Thierry Henry (equally as great) Store where you would like to spend a $10,000 gift card Nordstrom If you could have dinner with anyone, who would it be My family (mom, dad and brother) Why did you choose your number No. 2 is lucky Random fact people wouldn't know about Kate Deines If I didn't play soccer, I would die to be a star on Broadway If you could trade places with a teammate for a day, who would it be and why Veronica Perez (so I could experience some \"V-Magic\") Best thing about playing for Coach Gallimore Lesle's knowledge and high expectations coupled with a true caring for her players on and off the field, make her the ultimate role model and coach!\n\nCareer Statistics"}, {"url": "https://www.wikiwand.com/en/Kate_Deines", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Kate Deines?\n\nSummarize this article for a 10 years old"}, {"url": "https://wiki2.org/en/Kate_Deines", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican soccer midfielder-defender\n\nKathleen Ann Deines (born September 17, 1989) is an American soccer midfielder–defender. She most recently played for Turbine Potsdam in the German Bundesliga and Seattle Reign FC of the National Women's Soccer League. Deines was a fourth round pick (23rd overall) of the Atlanta Beat of Women's Professional Soccer in the 2012 WPS Draft of college seniors on January 13, 2012. The WPS Board of Governors voted to suspend the 2012 season on January 30 citing pending legal issues.[2] Subsequently, she was free to sign with other teams and rejoined the Seattle Sounders Women, the organization she had previously played for from 2007 to 2009. After the formation of the National Women's Soccer League in late 2012, Deines played for the Seattle Reign during the league's first two seasons. She was traded to FC Kansas City in late 2014[3] but announced her retirement from professional soccer on March 31, 2015, before the 2015 season began.[4]\n\nYouTube Encyclopedic\n\n1 / 5 Views: 1 933 393 1 665 2 180 3 175\n\nWomen's Soccer Fall Media Day\n\nKate Deines m4v\n\nKickin' it with Kate (Episode 3) - Victorious on the Road\n\nInterview: Laura Harvey 5/28\n\nHope Solo Signs Regan's Soccer Ball Transcription\n\nEarly life\n\nDeines was born in Portland, Oregon, on September 17, 1989, to Matt and Betsy Deines. As a freshman at Issaquah High School, Deines helped lead the soccer team to its first state championship final since 1988 and first title ever.[5] Deines led the team to four consecutive conference championships from 2004 to 2007 and four state title games, winning three of them.[6] Issaquah's lone runner-up finish was in 2005 when Deines was forced to miss the championship game to join the United States Youth Soccer Association Olympic Development Program in Boca Raton, Florida following the semifinal.[7] Issaquah went on undefeated the next two years with Deines in the lineup.\n\nDeines capped off her high school career by scoring the game-winning goal in the 71st minute of the 2007 state final, a 1–0 victory over Seattle Prep.[8]\n\nDeines finished with a total of 76 goals and was named to the all-state team four times and chosen as the state's Gatorade Player of the Year twice. During her senior year she was named to the Parade and NSCAA/adidas Girls High School All-America teams.[9]\n\nDeines has played soccer with the Seattle Sounders Women since joining the team in 2007 while still in high school.\n\nUniversity of Washington\n\nDeines was a four-year starter for the Washington Huskies, starting a school-record 86 games and scoring 21 goals.[10] She was named to the Pac-10 All-Freshman First Team and was a four-time All-Pac-10 selection and a two-time NSCAA Scholar All-American.[11]\n\nAs a freshman at the University of Washington, Deines helped the Huskies return to the NCAA Tournament after a three-year absence.[12] She played a leading role as team captain during her junior year. She converted two key penalty kicks, including the game winner, during an epic penalty shoot-out in a shocking upset of the No. 2 overall seed University of Portland in the second round of the NCAA Tournament.[13] The Huskies would eventually go on to the Elite Eight where they were eliminated in an overtime loss at Boston College.\n\nPlaying career\n\nClub\n\nDrafted to the Atlanta Beat, 2012\n\nDeines was selected as a fourth round pick (23rd overall) by the Atlanta Beat in the 2012 WPS Draft of college seniors on January 13, 2012; however, the league suspended operations before play began.[14][15]\n\nFrom Seattle to Iceland, 2012\n\nAfter the WPS folded in 2012, Deines signed with the Seattle Sounders Women. She made 12 appearances for the club, scoring one goal.[16] Following the conclusion of the W-League season, Deines and her Sounders teammate and fellow University of Washington alum, Verónica Pérez, played for Stjarnan Women in Iceland's top division. The team won the Icelandic Women's Cup after a 1–0 win over Valur.[17] Of her time in Iceland, Deines said, \"Even though it was a spur of the moment decision to play overseas in Iceland, I believe my three month stint helped in my development as a player. Icelandic soccer was not nearly as technical or tactical as soccer in the United States but the extreme physicality of our practices and games challenged me to play with a whole new level of aggression. Playing professionally in Iceland also allowed me an opportunity to keep practicing and playing games on a daily basis which would not have been the case if I would have stayed in the United States.\"[18]\n\nSeattle Reign FC, 2013–14\n\nIn February 2013, Deines signed with the Seattle Reign FC as a free agent for the inaugural season of the NWSL.[19][20][21][22][23] Deines made 17 appearances for the club with 11 starts, tallying a total of 979 minutes.[24]\n\nPotsdam, 2014–15\n\nIn September 2014, Deines signed a one-year contract with Germany's Turbine Potsdam in the Bundesliga.[25]\n\nInternational\n\nDeines was a member of the United States U-23 women's national soccer team and traveled to Sweden in June 2011.[26]\n\nPersonal life\n\nDeines' younger brother Jay is an offensive lineman on the football team at Eastern Washington University.[27][28]\n\nSee also\n\nReferences"}, {"url": "https://fbref.com/en/players/e666d0dd/Kate-Deines", "page_content": "About FBref.com\n\nFBref.com launched (June 13, 2018) with domestic league coverage for England, France, Germany, Italy, Spain, and United States. Since then we have been steadily expanding our coverage to include domestic leagues from over 40 countries as well as domestic cup, super cup and youth leagues from top European countries. We have also added coverage for major international cups such as the UEFA Champions League and Copa Libertadores.\n\nFBref is the most complete sources for women's football data on the internet. This includes the entire history of the FIFA Women's World Cup as well as recent domestic league seasons from nine countries, including advanced stats like xG for most of those nine.\n\nIn collaboration with Opta, we are including advanced analytical data such as xG, xA, progressive passing, duels and more for over twenty competitions. For more information on the expected goals model and which competitions have advanced data, see our xG explainer.\n\nView Additional Information"}, {"url": "https://www.celebsagewiki.com/kate-deines", "page_content": "Age, Biography and Wiki\n\nKate Deines was born on 17 September, 1989 in Portland, OR, is an American soccer midfielder-defender. Discover Kate Deines's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 33 years old?\n\nPopular As N/A Occupation N/A Age 33 years old Zodiac Sign Virgo Born 17 September 1989 Birthday 17 September Birthplace Portland, OR Nationality OR\n\nWe recommend you to check the complete list of Famous People born on 17 September. She is a member of famous with the age 33 years old group.\n\nKate Deines Height, Weight & Measurements\n\nAt 33 years old, Kate Deines height is 5′ 11″ .\n\nPhysical Status Height 5′ 11″ Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nKate Deines Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Kate Deines worth at the age of 33 years old? Kate Deines’s income source is mostly from being a successful . She is from OR. We have estimated Kate Deines's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nKate Deines Social Network\n\nInstagram Linkedin Twitter Kate Deines Twitter Facebook Wikipedia Kate Deines Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.howold.co/person/kate-deines/biography", "page_content": "Kate Deines Biography\n\nAmerican soccer midfielder-defender\n\nKathleen Ann Deines (born September 17, 1989) is an American soccer midfielder–defender. She most recently played for Turbine Potsdam in the German Bundesliga and Seattle Reign FC of the National Women's Soccer League. Deines was a fourth round pick (23rd overall) of the Atlanta Beat of Women's Professional Soccer in the 2012 WPS Draft of college seniors on January 13, 2012. The WPS Board of Governors voted to suspend the 2012 season on January 30 citing pending legal issues. Subsequently, she was free to sign with other teams and rejoined the Seattle Sounders Women, the organization she had previously played for from 2007 to 2009. After the formation of the National Women's Soccer League in late 2012, Deines played for the Seattle Reign during the league's first two seasons. She was traded to FC Kansas City in late 2014 but announced her retirement from professional soccer on March 31, 2015, before the 2015 season began.\n\nEarly life\n\nDeines was born in Portland, Oregon, on September 17, 1989, to Matt and Betsy Deines. As a freshman at Issaquah High School, Deines helped lead the soccer team to its first state championship final since 1988 and first *le ever. Deines led the team to four consecutive conference championships from 2004 to 2007 and four state *le games, winning three of them. Issaquah's lone runner-up finish was in 2005 when Deines was forced to miss the championship game to join the United States Youth Soccer *ociation Olympic Development Program in Boca Raton, Florida following the semifinal. Issaquah went on undefeated the next two years with Deines in the lineup.\n\nDeines capped off her high school career by scoring the game-winning goal in the 71st minute of the 2007 state final, a 1–0 victory over Seattle Prep.\n\nDeines finished with a total of 76 goals and was named to the all-state team four times and chosen as the state's Gatorade Player of the Year twice. During her senior year she was named to the Parade and NSCAA/adidas Girls High School All-America teams.\n\nDeines has played soccer with the Seattle Sounders Women since joining the team in 2007 while still in high school.\n\nUniversity of Washington\n\nDeines was a four-year starter for the Washington Huskies, starting a school-record 86 games and scoring 21 goals. She was named to the Pac-10 All-Freshman First Team and was a four-time All-Pac-10 selection and a two-time NSCAA Scholar All-American.\n\nAs a freshman at the University of Washington, Deines helped the Huskies return to the NCAA Tournament after a three-year absence. She played a leading role as team captain during her junior year. She converted two key penalty kicks, including the game winner, during an epic penalty shoot-out in a shocking upset of the No. 2 overall seed University of Portland in the second round of the NCAA Tournament. The Huskies would eventually go on to the Elite Eight where they were eliminated in an overtime loss at Boston College.\n\nPlaying career\n\nClub\n\nDrafted to the Atlanta Beat, 2012\n\nDeines was selected as a fourth round pick (23rd overall) by the Atlanta Beat in the 2012 WPS Draft of college seniors on January 13, 2012; however, the league suspended operations before play began.\n\nFrom Seattle to Iceland, 2012\n\nAfter the WPS folded in 2012, Deines signed with the Seattle Sounders Women. She made 12 appearances for the club, scoring one goal. Following the conclusion of the W-League season, Deines and her Sounders teammate and fellow University of Washington alum, Verónica Pérez, played for Stjarnan Women in Iceland's top division. The team won the Icelandic Women's Cup after a 1–0 win over Valur. Of her time in Iceland, Deines said, \"Even though it was a spur of the moment decision to play overseas in Iceland, I believe my three month stint helped in my development as a player. Icelandic soccer was not nearly as technical or tactical as soccer in the United States but the extreme physicality of our practices and games challenged me to play with a whole new level of aggression. Playing professionally in Iceland also allowed me an opportunity to keep practicing and playing games on a daily basis which would not have been the case if I would have stayed in the United States.\"\n\nSeattle Reign FC, 2013–14\n\nIn February 2013, Deines signed with the Seattle Reign FC as a free agent for the inaugural season of the NWSL. Deines made 17 appearances for the club with 11 starts, tallying a total of 979 minutes.\n\nPotsdam, 2014–15\n\nIn September 2014, Deines signed a one-year contract with Germany's Turbine Potsdam in the Bundesliga.\n\nInternational\n\nDeines was a member of the United States U-23 women's national soccer team and traveled to Sweden in June 2011.\n\nPersonal life\n\nDeines' younger brother Jay is an offensive lineman on the football team at Eastern Washington University.\n\nSee also\n\nWomen's *ociation football portal\n\nSports portal\n\n*ociation football portal\n\nBiography portal\n\nList of University of Washington people\n\nList of people from Portland, Oregon\n\nReferences\n\nExternal links\n\nWashington player profile\n\nSeattle Sounders Women player profile\n\nKate Deines at Soccerway\n\nKate Deines on Twitter\n\nWikimedia Commons has media related to Kate Deines."}, {"url": "https://sportsworld.nbcsports.com/tag/kate-deines/", "page_content": "One-by-one this offseason, National Women’s Soccer League players opting to retire possessed a common trait: they are women in their mid-20s, and are either at their athletic peak or nearing it.\n\nIn September 2014, Jazmine Reeves (right, above) was the first to grab headlines. She played one season with the Boston Breakers, in which she scored seven goals and showed that she could have had a bright future in soccer. For instance, in a May 28, 2014 game she scored a hat trick against the then defending champion Portland Thorns. Reeves retired at 22 years old, however, to take a job she “simply could not pass up” with Amazon.\n\nA few months later, another Breaker, Courtney Jones, left the game to pursue a new business opportunity. Jones, the daughter of former NFL tight end Brent Jones, is 24. She won two national championships at the University of North Carolina and played in the first two seasons of the National Women’s Soccer League.\n\nThen there was 26-year-old Nikki Washington, a former Under-20 Women’s World Cup champion with the United States who retired after stints in two professional leagues.\n\nNikki Marshall, also 26 — and also a member of the U-20 team in 2008 — retired in February, less than a year after getting her first call-up to the senior United States national team.\n\nDefender CoCo Goodson hung up her boots at age 24. Goalkeeper Taylor Vancil moved on at age 23. And most recently, 25-year-old Kate Deines made the decision to stop playing.\n\nSpecific reasons for retirement vary among all of these players, but their realities do not. They play in a fringe sector of a still-growing sport, in a fledgling league looking to break the curse of its predecessors and last longer than three seasons.\n\n* * *\n\nIn 2004, then Minnesota Timberwolves swingman Latrell Sprewell offered one of sports’ all-time out-of-touch moments. Sprewell was in the final year of his NBA contract, slated to pay him $14.6 million that season as a 34-year-old. But he didn’t get what he deemed an acceptable offer from the team for an extension and he took to the media to voice his discontent.\n\n“I’ve got a family to feed,” he said in frustration.\n\nSome athletes, however, are legitimately scraping by just to feed themselves.\n\nThe National Women’s Soccer League kicked off in 2013, over a year after the second attempt at a professional league – Women’s Professional Soccer – went under after three seasons of play.\n\nBefore the WPS, there was the WUSA, which was the first attempt at a full-fledged professional league that was born out of the hysteria of the 1999 Women’s World Cup in the United States. But from 2001-2003, the WUSA burned through $100 million and closed its doors on the eve of the next Women’s World Cup.\n\nWPS opened play in 2009 with what were thought to be more realistic expectations, initially implementing a salary cap of over $500,000 (the cap disappeared in later seasons). But losses there were still in the millions – even if a fraction of those of WUSA – and the league eventually lost too many owners and too much money to continue.\n\nSo this iteration, considered the most viable yet, is realistic in its financial approach. It just doesn’t offer what many would deem a realistic way to live.\n\nThe minimum salary for an NWSL player is $6,842 for the course of the six-month season; the maximum is $37,800, made primarily by international-level players. The team salary cap for 20 players is $265,000, which doesn’t include the top U.S., Canadian and Mexican players who play on club teams but whose salaries are paid by their respective federations.\n\n“It’s actually pathetic when I think about what we make,” says Deines, who played for Seattle Reign FC for the first two seasons of the NWSL.\n\nDeines played in 18 matches in 2014 for the Reign, starting half of them. The longtime Pacific Northwest inhabitant was traded to FC Kansas City in the offseason and she is exactly the type of player who is likely to have a great opportunity to take on a more prominent role this season and next as clubs deal with player absences due to the World Cup and Olympics. But Deines, who has a bachelor’s degree in communications and media studies as well as a master’s in continued education from the University of Washington, couldn’t continue to turn down business opportunities in favor of the low-paying league.\n\nIn the increasingly expensive Seattle housing market, Deines’ income level meant she lived in a five-bedroom house with three teammates and a pair of players from Major League Soccer’s Seattle Sounders.\n\n“It definitely feels like an extension of college life, and it is way less glamorous than college,” Deines said.\n\nThe NWSL kicks off its third season on Friday in Houston, where the Dash are owned by the same group that owns MLS’ Houston Dynamo. The struggles that the NWSL faces in its early years draw parallels to those still present in MLS.\n\nMajor League Soccer signed a new collective bargaining agreement with its players union in March only days before the start of the league’s 20th season. A 64 percent hike of the minimum salary to $60,000 was a small victory for players, who even a decade ago had a floor of $24,000.\n\nThese are the realities of a growing business.\n\nJeff Plush took over as commissioner of the NWSL in December. He previously worked for the Colorado Rapids in MLS and served on Major League Soccer’s board, working in the thick of many of the growing pains of that league.\n\n“Look, the player looking to make a career out of this who is on the lower end of the wage scale is going to have to do [additional things], whether that is coaching at a high school or club or those kind of things,” Plush told NBC SportsWorld. “We are very respectful of that and we fully understand that we need to continue to build out our potential business platforms that they can tap into to help augment their salary. We have to be mindful of where we are. I’m very cognizant of this – it’s not all the money in the world, but where we are today is we are in the third year of a long-term strategy to have a very sustainable, robust league in this country. It’s just going to take some time.”\n\nPlush contends that the number of players retiring this offseason is relatively small in regards to the overall player pool.\n\nWhile the NWSL salary cap and maximum salary figure have each grown over 20 percent in two years, the minimum remains a four-digit number and is stretched out over a longer season in 2015. Players live like average Americans, not professional athletes. Off the field, it’s just about getting by.\n\nGibby Wagner is living at home with her parents in Wall, N.J. As an amateur player on Sky Blue FC’s reserve team, she won’t be paid but she could take on a significant role in the middle of the season due to World Cup absences. Wagner left a local newspaper job in hopes of just playing in the league, even if she doesn’t immediately get paid.\n\nBoston Breakers defender Julie King, 25, lives on her own now after two years of living with host families, a common arrangement that NWSL clubs set up to defray player housing costs. But living on her own in greater Boston on an NWSL salary means she needs financial support from her parents.\n\n“I’m definitely chasing the dream,” King says. “I feel very fortunate to have parents who are willing to support me if I need them. I really did need them my first couple of years, as far as my salary went. I wouldn’t have been able to survive without them.”\n\n* * *\n\nBecky Edwards is one of the best midfielders in the National Women’s Soccer League. In 2013 she was playing for Portland Thorns FC when she was approached by then U.S. national team coach Tom Sermanni about possibly joining a future training camp.\n\nEdwards, like countless other players in the league, has long dreamed of wearing the red, white and blue. She was part of that 2008 Under-20 U.S. team, which also included the likes of national team regulars Alex Morgan and Sydney Leroux.\n\nTwo weeks after that conversation with Sermanni and before she received any formal invite to the U.S. senior team, Edwards tore her ACL. She rehabbed quickly, in time to be the 2014 cornerstone of the expansion Houston Dash, who traded her in the offseason. Now on her third team in three seasons – the Western New York Flash – and in her second professional league, Edwards still exudes positivity.\n\n“This is the life we live,” she said. “For me, personally, I still wake up every day and love what I do. I don’t want to have any regrets at the end of the day when I am done playing. I have the rest of my life to work or coach or whatever I decide to do, but right now, for me, it is still worth it.”\n\nEdwards still hopes to make the United States’ 2019 World Cup team; she would be 30 years old. Representing their nation is a dream that keeps many players in the league despite the extremely low salaries. But the dream can grow tiring for some. The United States national team is one of the best in the world and those who aren’t already a part of it can understandably feel it is an enigma that often proves inaccessible to those on the outside.\n\nMarshall left the NWSL to take an increased role with the Colorado branch of AvNet Technology Solutions, for whom she worked remotely year-round while playing. Constant work outside of work wasn’t ideal for training to play at the international level, which Marshall was on the cusp of doing.\n\n“In order to make it to that elite level, you have to live and breathe the game,” Marshall said. “You really don’t have time for another job. You want to train hard during the offseason. You have to pour your life into it and you have to be extremely dedicated.”\n\nBoth Marshall and Deines acknowledged that the hardest part of the low pay is the unpaid offseason, which stretches up to six months. Some players find short-term opportunities overseas, while others train or try to find coaching jobs. Unable to focus entirely on training, the gap only widens between those who have and those who don’t. Being a member of the United States national team is a rare job in women’s soccer that can pay six figures.\n\n“That becomes a huge part of it as well and something that women’s soccer is really missing. Some of our best athletes are not getting a chance,” Marshall says. “Maybe they get a half-look, but these coaches are not necessarily committed to giving them a real chance. I think that will change here soon, but for now that is definitely how it is. The women who are on the (U.S.) national team now, they are making a lot of money. They are the top echelon of women’s soccer and they are the only women who are making a lot of money, so they can afford to train every day during the offseason without having a second job. It’s a bit of a different lifestyle. It’s more of an opportunity I think.”\n\n* * *\n\nFixing some of these issues requires time and money, which is easier said than done.\n\nPlayers largely understand the financial constraints under which their clubs operate. They play because they love the game, an intangible passion that is uniquely unwavering across sports.\n\nAnd they play to try to pave a path for a better future in the sport – “laying the foundations for future generations,” as King calls it. They are everyday women hoping that in some ways, they will be pioneers through their sacrifice.\n\n“We’re trying to grow something here,” Edwards says. “We understand the situation from the league. We understand the limitations that they have financially. I want to continue to grow this game and make it possible so that players can make a better living in the future.”\n\nDeines hopes that the NWSL can progress to the point of the WNBA, which stands on solid footing thanks to the backing of the NBA. Portland and Houston are the current NWSL teams backed by MLS clubs, although several MLS clubs are interested in professional women’s teams, according to Plush.\n\nMuch like it is for some of the WNBA’s best players, there is money in Europe for women’s soccer players. Diana Taurasi will sit out this WNBA season to play for her Russian team, U.M.M.C Yekaterinburg, for about $1.5 million, close to 15 times the maximum salary in the WNBA.\n\nUnited States national team midfielder Megan Rapinoe reportedly made $14,000 per month recently playing for Lyon in France. That is more than many NWSL players make in a season.\n\nSuch success stories in Europe vary greatly, however. The average player can get slightly more in Europe, but that may only mean between $1,000 and $2,000 per month, according to Faudlin Pierre, an agent who represents several players domestically and overseas.\n\nBut if anyone is in women’s soccer for the money – well, they are going to be very disappointed.\n\n“We certainly don’t play soccer because we make a lot of money or because it’s glamorous,” Marshall said. “We do it because we absolutely love it. I think I just got to the point where it wasn’t worth the sacrifice for me anymore.”\n\nIn time, the National Women’s Soccer League and the United States Soccer Federation hope to make the grind more worthwhile."}, {"url": "https://www.calendarz.com/on-this-day/september/17/kate-deines", "page_content": "Birth\n\nSep, 17\n\nKate Deines\n\nKate Deines, American soccer player\n\nKathleen Ann Deines (born September 17, 1989) is an American soccer midfielder-defender. She most recently played for Turbine Potsdam in the German Bundesliga and Seattle Reign FC of the National Women's Soccer League. Deines was a fourth round pick (23rd overall) of the Atlanta Beat of Women's Professional Soccer in the 2012 WPS Draft of college seniors on January 13, 2012. The WPS Board of Governors voted to suspend the 2012 season on January 30 citing pending legal issues. Subsequently, she was free to sign with other teams and rejoined the Seattle Sounders Women, the organization she had previously played for from 2007 to 2009. After the formation of the National Women's Soccer League in late 2012, Deines played for the Seattle Reign during the league's first two seasons. She was traded to FC Kansas City in late 2014 but announced her retirement from professional soccer on March 31, 2015 before the 2015 season began."}, {"url": "https://www.vavel.com/en/international-football/2016/01/10/589090-kif-orebro-signs-anna-bjork-kristjansdottir-and-veronica-perez.html", "page_content": "KIF Örebro continue to perform well in the transfer window ahead of the 2016 Damallsvenskan season.\n\nHaving signed 34-year-old Canadian forward Melissa Tancredi earlier this week, they have now added Icelandic defender Anna Björk Kristjánsdóttir, who was playing in her country with Stjarnan, and Mexican attacking midfielder Véronica Perez, from Canberra United in Australia, to their squad.\n\nVerónica Pérez: New experience in a European team\n\nThe American-born Mexican international, Perez is an attacking midfielder who played for the University of Washington Huskies and was twice named in the All-Pac-10 second team. Pérez left the University of Washington ranked in the all-time top-10 in several categories, including third in shots (194) and games played (83).\n\nThe 27-year-old was the 37th pick overall in the College Draft in America's old Women's Professional Soccer league, selected by the Saint Louis Athletica in 2010.\n\nHaving dual nationality, she chose to play for Mexico at senior level after playing for the United States at under-23 level. The attacker would then score against the USWNT in Mexico's 2-1 victory in qualifying for the 2011 World Cup in Germany. The goal ensured Mexico reached the World Cup after 12 years of absence.\n\nPerez has previously played in Europe too. During the summer of 2012, she and her Seattle Sounders teammate - and fellow University of Washington alum - Kate Deines, played for Stjarnan, Kristjánsdóttir's former club, in Iceland's top division. The team won the Icelandic Women's Cup after a 1–0 win over Valur.\n\nAfter playing for the Western New York Flash and the Washington Spirit, clubs of the NWSL, Perez's transferred to Canberra United to play in the W-League - for whom she has three goals this season. Perez also played at this year's World Cup and scored Mexico's goal in their draw against Colombia.\n\nAnna Björk Kristjánsdóttir: First experience outside of her country\n\nKristjánsdóttir began her career at 15-years-old with KR and, after five seasons, she moved to Stjarnan, where she has been since 2009.\n\nThe player won the Úrvalsdeild in 2011, 2013 and 2014 and the Icelandic Women's Cup in 2012 and 2014. She and Perez actually played together for the team in 2012 too.\n\nHer contract with the Icelandic team was due to end in October of next year, but she has decided to leave ahead of its expiry to join Örebro.\n\n(Photo: Jose Manuel Ribeiro/AFP/Getty Images)\n\nKristjánsdóttir went to Euro 2013 in Sweden, but did not play a game, still slowly integrating into the senior team after playing for all of Iceland's youth sides.\n\nShe made her full debut in 2013 against Serbia in a World Cup qualifier and, since then, has already made 16 appearances and is frequent presence in Freyr Alexandersson's squads.\n\nManager thrilled with new signings\n\nÖrebro manager George Papchristou told the club's official website of his delight with the new signings, highlighting the experience that they will add to the team.\n\n\"Anna is an experienced, tall and athletic defender who has played in both national teams in club teams. She is a player who is keen to win and now wants to take the next step in her career with us. Veronica is an experienced midfielder, with experience of clubs in the United States, Iceland and Australia, and not least in the Mexican national team. She has high quality, easily understands the game and is a player who can create opportunities.\"\n\nThe team also announced on its official website the contract renewals of three players in their squad - goalkeepers Mimmi Paulsson Febo and Lina Domberg, as well as fullback Jennie Wecksell, all extending their stay with the club."}, {"url": "https://www.footballdatabase.eu/en/player/details/448579-kate-deines", "page_content": "Adblocker detected! Please consider reading this notice.\n\nWe've detected that you are using AdBlock Plus or some other adblocking software which is preventing the page from fully loading.\n\nWe don't have any banner, Flash, animation, obnoxious sound, or popup ad. We do not implement these annoying types of ads!\n\nWe need money to operate the site, and almost all of it comes from our online advertising.\n\nPlease add footballdatabase.eu to your ad blocking whitelist or disable your adblocking software."}]}