{"C. V. Ananda Bose (1886–1954) was an Indian freedom fighter, lawyer, and politician.": [{"url": "https://www.wikiwand.com/simple/C._V._Ananda_Bose", "page_content": "Dr. C. V. Ananda Bose (born 2 January 1951) is an Indian politician and former civil servent. A member of Bharatiya Janata Party, he became the governor of West Bengal in November 2022.[1][2] Before that, he was advisor of Government of Meghalaya.[3]\n\nQuick facts: C. V. Ananda Bose, 22nd Governor of West Beng... ▼\n\nBose is a retired Indian Administrative Service officer of 1977 batch from Kerala cadre. He has been secretary in various departments and ministries of the Government of India and the state of Kerala.[4]"}, {"url": "https://www.inc.in/leadership/past-party-presidents/ananda-mohan-bose", "page_content": "Ananda Mohan Bose\n\nPresident: 1847-1906 (Madras, 1898)\n\nIndia's first Wrangler, leader of the Brahmo Samaj, pioneer of the freedom movement, educationist and social reformer, Ananda Mohan Bose was born on 23 September 1847 in Mymensingh, Bengal in an upper middle class family.\n\nAfter his schooling he left for England and enrolled himself as a student of Higher Mathematics at Christ Church College, Cambridge. Simultaneously, he was called to the Bar in 1874.\n\nOn returning home, he plunged into his public career alongside Surendranath Banerjea and Sivanath Sastri. During this time he came also under the influence of Devendranath Tagore and Keshab Chandra Sen, for both of whom he entertained the highest regard.\n\nBose’s interest in the political scene in India may be dated from 1871 when he first met Surendranath Banerjea in England. On his return to India in 1874 and right up to the days of the Swadeshi movement in 1905, the two were closely associated in all their political enterprises.\n\nWith Surendranath as his mentor and through his own organisational ability, Ananda Mohan Bose set up a number of pioneering institutions. The Calcutta Students Association was the earliest attempt made to organise students for constructive political work. The Indian Association was the first political organisation at an All - India level to institute a vigorous constitutional agitation for rights and privileges of the Indian citizens.\n\nOne of it's by - products was the convening of the, first National Conference in 1883 which became a precursor of the Indian National Congress (1885). Bose was associated with the Congress since its inauguration and was elected President of its Madras Session in 1898.\n\nAs a social reformer, his services for the upliftment of women and the illiterate masses, his crusade against social vices and the work he did to promote temperance are still remembered with gratitude. Under his enlightened direction, the Sadharan Brahmo Samaj, of which he was a joint founder (1878) not only became a church and a congregation but also an active centre for the spread of education and social uplift.\n\nA moderate and a constitutionalist in his political outlook, Bose was progressive and one of the earliest to have pleaded for large scale technical education and industrialisation. He is remembered in particular for the last speech that he made on 16 October 1905 at a public meeting organised in Calcutta to protest against the partition of Bengal.\n\nWhat he said then might sound almost ironical in the context of what happened in 1947 when the Province of Bengal was sundered once again 'by an official fiat'. Carried practically from his sickbed to preside over the foundation of the Federation Hall, Bose described the meeting as a great and historic occasion, which will live in the annals of Bengal, and mark an epoch in its history.\n\nHe added: “. . . this Federation Hall, the foundation stone of which is being laid today, not only on this spot of land but on our moistened and tearful hearts, is the visible symbol of this spirit of union, the memorial to future generations yet unborn of this unhappy day and of the unhappy policy which has attempted to separate us into two parts.” Shortly after this crowning act of his career, he passed away in Calcutta on 20 August 1906 at the somewhat premature age of 59.\n\n“I will tell you what they have done. They have dared to think for themselves; and not only for themselves, but for millions of poor ignorant people who compose our Indian Empire. They have been content to sacrifice their own interests and to brave the displeasure of Government in order to lend a helping hand to those poor people.”\n\nFrom the Presidential Address - Ananda Mohan Bose I.N.C. Session, 1898, Madras"}, {"url": "https://simple.wikipedia.org/wiki/C._V._Ananda_Bose", "page_content": "Dr. C. V. Ananda Bose (born 2 January 1951) is an Indian politician and former civil servent. A member of Bharatiya Janata Party, he became the governor of West Bengal in November 2022.[1][2] Before that, he was advisor of Government of Meghalaya.[3]\n\nBose is a retired Indian Administrative Service officer of 1977 batch from Kerala cadre. He has been secretary in various departments and ministries of the Government of India and the state of Kerala.[4]\n\nEarly life [ change | change source ]\n\nBose was born on 2 January 1951 at Kottayam, a village in Indian state of Kerala. He spent his childhood over there. His parents were P K Vasudevan Pillai and C Padmavaty Amma.[5]\n\nBose holds a Ph.D from BITS Pilani; B.A in KE College[6] and M.A in English Language and Literature from Kerala University.\n\nAs civil servant [ change | change source ]\n\nBose has worked as Vice Chancellor in National Museum Insttitute.[7] He served as Principal Secretary to the Chief Minister, Chairman of central public sector undertaking Central Warehousing Corporation (CWC) and District Collector in Kerala. He also served the Chairman of the Habitat Alliance, in consultative status with the United Nations.[8]\n\nBose has represented India in the European Council for Nuclear Research (CERN), Geneva and International Fusion Energy Organisation (ITER), France. He was the chairman of the Atomic Energy Education Society.[9]\n\nHe was the head of the prestigious Supreme Court Committee on the treasures of ‘Sree Padmanabhaswamy Temple’ Kerala.[10]\n\nHe also worked during Modi government.[11]\n\nAs Governor [ change | change source ]\n\nBose was appointed as 22nd governor of West Bengal by President of India Draupadi Murmu on November 2022. He succeeded La. Ganesan.\n\nPersonal life [ change | change source ]\n\nBose has married with L S Lakshmi. He has a son and a daughter. He has published 32 books in English, Malayalam."}, {"url": "https://starsunfolded.com/c-v-ananda-bose/", "page_content": "Profession(s) Politician, Former Civil Servant\n\nFamous for Being appointed as the twenty-second governor of West Bengal\n\nPhysical Stats & More\n\nHeight (approx.) in centimeters- 167 cm\n\nin meters- 1.67 m\n\nin feet & inches- 5’ 6”\n\nEye Colour Black\n\nHair Colour Black (semi-bald)\n\nPolitics\n\nPolitical Party Bharatiya Janata Party\n\n\n\n\n\nNote: He joined the Bharatiya Janata Party in 2019.\n\nCivil Service\n\nService Indian Administrative Service (IAS)\n\nBatch 1977\n\nCadre Kerala\n\nRetirement 20 September 2011\n\nMajor Designation(s) • Assistant Collector, Kasargod (1 July 1979- 1 June 1980)\n\n• Sub Collector, Kasargod (1 June 1980- 1 October 1981)\n\n• Joint General Manager in Finance Department (1 October 1981- 1 September 1982)\n\n• Deputy Secretary in Planning Department (1 September 1982- 1 January 1984)\n\n• Deputy Secretary in Welfare Department (1 January 1984- 1 April 1985)\n\n• District Collector of Kollam (1 April 1985- 1 July 1987)\n\n• Managing Director (Industries) (1 July 1987- 1 January 1988)\n\n• Secretary in Revenue Department (1 January 1988- 1 July 1990)\n\n• Secretary to Chief Minister in General Administration Department (1 March 1991- 1 March 1995)\n\n• Secretary to Chief Minister in Home Department (1 July 1991- 1 March 1995)\n\n• Director of Housing & Urban Dev Department and Kerala State Nirmithi Kendra (1 March 1995- 1 March 1999)\n\n• Secretary of Kerala Labour Department (1 March 1999- 1 October 2001)\n\n• Chairman & Managing Director of Kerala State Transport Corporation (1 October 2001- 5 January 2002)\n\n• Secretary of Administrative Reforms and General Administration (1 August 2002- 26 September 2002)\n\n• Secretary of Parliamentary Affairs (26 September 2002- 29 November 2002)\n\n• Secretary of Youth Affairs (29 November 2002- 16 January 2003)\n\n• Secretary of SC/ST Welfare (16 January 2003- 16 July 2003)\n\n• Secretary of Administrative Reforms (6 March 2003- 16 July 2003)\n\n• Principal Secretary of Higher Education Department (16 July 2003- 14 June 2004)\n\n• Principal Secretary of Forest & Wild Life Department of Thiruvananthapuram (17 September 2004- 1 April 2005)\n\n• Joint Secretary of Atomic Energy (Mumbai City) (1 April 2005- 12 January 2008)\n\n• Additional Secretary of Agriculture & Cooperation (12 January 2008- 14 September 2009)\n\n• Managing Director of Agriculture & Cooperation, NAFED, New Delhi (14 September 2009- 21 September 2010)\n\n• Administrator (Additional Secretary Equivalent) of Culture Affairs of National Museum (22 September 2010- 14 January 2011)\n\n• Administrator (Secretary Equivalent) of Culture Affairs of National Museum (1 February 2011- 20 September 2011)\n\nAwards, Honours, Achievements • National Special Habitat Award instituted by the Government of India and HUDCO for outstanding contributions to Housing in India (1989)\n\n\n\n• Jawaharlal Nehru Fellowship awarded by Jawaharlal Nehru Memorial Fund, New Delhi, for Habitat Management (1994)\n\n• Finalist of the World Habitat Awards (1994)\n\n• UN-Habitat Global Best Practice for Building Centre Movement (1996)\n\n• Diwaliben Mohanlal Mehta Award Instituted by Diwaliben Mehta Charitable Trust (1996)\n\n• Dr. Pam Davar Award Instituted by Siri Ram Washeshran Devi Bhatia Memorial Charitable Trust (1997)\n\n• Gold Medal by Management Leadership Awards (TMA) (1997)\n\n• Akshaya Award for outstanding contributions in promoting traditional architecture (Vastu) and heritage (1998)\n\n• Overseas Literary Critics Awards (1999)\n\n• Cities Asia Urban Green Management Excellence Award (2001)\n\n• Bremen Partnership Award for efficient use of Natural Resources (2001)\n\n• UN-Habitat Global Best Practice for GNN (Sustainable Habitat Development) (2002)\n\n• Overseas Literary Critics Awards (2017)\n\n• International Book Fair Awards (Sustainable Habitat Development) (2017)\n\n• Lion Centennial Malia Jones Award (2018)\n\n• Swathi Pratibha Puraskar (2018)\n\n• Rajiv Gandhi National Award for Excellence in Management\n\n• UNCHS – Awards for Excellence – Good Practice selection for transparent governance\n\n• United Nations Global Best Practice\n\n• Singapore Government Award for Urban Green Management Excellence\n\n• First-ever Fellow of the Lal Bahadur Shastri National Academy of Administration, Mussoorie\n\nPersonal Life\n\nDate of Birth 2 January 1951 (Tuesday)\n\nAge (as of 2023) 72 Years\n\nBirthplace Mannanam, Kottayam, Kerala\n\nZodiac sign Capricorn\n\nNationality Indian\n\nHometown Mannanam, Kottayam, Kerala\n\nCollege/University • Kuriakose Elias College, Mannanam\n\n• St. Berchmans College, Changanassery\n\n• Ph. D. in Housing and Environment\n\nEducational Qualification(s) • Graduation in English from Kuriakose Elias College, Mannanam\n\n• Post-graduation in English from St. Berchmans College, Changanassery\n\n• Ph. D. in Housing and Environment from Birla Institute of Technology and Science, Pilani\n\nEthnicity Malayali\n\nRelationships & More\n\nMarital Status Married\n\nFamily\n\nWife/Spouse L S Lakshmi (manages her family-owned plantation)\n\n\n\nChildren Son- A Vasudev Bose (pursuing an acting course at Stella Adler acting studio in Los Angeles as of 2022)\n\n\n\nDaughter- Nanditha Bose (died in 2017 due to cancer)\n\nParents Father- P K Vasudevan Pillai (Nair) (freedom fighter)\n\nMother- C Padmavathy Amma (former government official)\n\n\n\nSiblings Brother(s)- Er. C V Venugopalan Nair, Prof. C V Mohan Bose, Er. C V Sundara Bose, Adv. C V Sukumar Bose\n\nSister(s)- Prof. Omana Kunjamma, C V Komala Bose, C V Indira Bose\n\nMoney Factor"}, {"url": "https://drcvanandabose.com/biography/", "page_content": "Dr. Bose has been the recipient of thirty three (33) International and National awards for his outstanding contributions in different fields. In recognition of his pioneering efforts in the field of housing, United Nations has selected his initiatives as ‘Global Best Practice’ four times. Govt. of India awarded him the National (Special) Habitat award.\n\nHe was the head of the prestigious Supreme Court Committee on the treasures of ‘Sree Padmanabhaswamy Temple’ Kerala. An internationally renowned orator, Dr. Bose has addressed many prestigious global fora, including the United Nations General Assembly. Dr. Bose has won more than one hundred (100) prizes, including fifteen (15) gold medals, during his University days. He was the best speaker of the Kerala University three consecutive years and topped in the debates in the IAS training academy, Mussoorie.\n\nDr. Ananda Bose was Chairman of the working group which prepared the development agenda for Kerala presented to the Prime Minister of India, Sri. Narendra Modi. Dr. Bose’s concept of ‘affordable housing for all Indians’ is reflected in the national project to provide houses for all. Dr. Ananda Bose’s motivational speeches and inspirational writings have received global recognition and acclaim.\n\nSince his superannuation from IAS in 2011, Dr. Bose has been devoting his time and efforts in upholding India's heritage, nationalism in his writings, lectures and media interviews. His efforts at social integration and mainstreaming of minorities has made perceptible impact in society. Described by Kerala Government as ‘Lord of Ideas’ and former Prime minister Dr. Manmohan Singh as ‘inspired civil servant’, Dr. Bose was addressed by Prime Minister Narendra Modi as ‘Man of Ideas’. Known as the ' make over man' of the service, Dr Bose was sent to cleanse many corruption ridden organisations in the government.\n\nSon of the freedom fighter, late Sri P.K Vasudevan Nair and Smt. C. Padmavathy Amma, former govt of India official, Dr. Bose was born in Mannanam , Kottayam Kerala on 2/1/1951 . Married to Smt L.S Lakshmi, managing her own plantation, Dr Bose has A. Vasudev Bose (pursuing acting at Stella Adler acting studio, Los Angeles ) as his son and Advaith Nair, as grandson.\n\nDr. Ananda Bose holds a Ph.D from BITS Pilani and M.A in English Language and Literature from Kerala University."}, {"url": "https://www.indiatoday.in/india-today-insight/story/meet-cv-ananda-bose-visionary-bureaucrat-and-now-west-bengal-governor-2299642-2022-11-20", "page_content": "Dr C.V. Ananda Bose, who assumes the challenging position of governor of the politically sensitive state of West Bengal, is no ordinary politician but carries the reputation of being an innovator in his distinguished civil services career. The 71-year-old former bureaucrat is a retired Union secretary who has made a mark wherever he worked. Bose joined the IAS in 1977 in the Kerala cadre and has held the offices of university vice-chancellor, additional chief secretary and district collector in Kerala.\n\nA prolific writer and columnist, Bose has published 40 books in English, Malayalam and Hindi, including novels, short stories, poems and essays. He is a recipient of 29 international and national awards for his outstanding contribution in various fields. He served as chairman of the working group that prepared the national development agenda for Prime Minister Narendra Modi.\n\nadvertisement\n\nBorn on January 2, 1951, in Mannanam village in Kottayam district of Kerala, Ananda Bose’s father P.K. Vasudevan Nair was a freedom fighter and follower of Netaji Subhas Chandra Bose. It was Nair who added ‘Bose’ to his son’s name.\n\nIn his early career, Ananda Bose was an English lecturer. He subsequently joined the State Bank group of banks as a probationary officer in Bengal and worked in the remote areas. He joined the IAS at the age of 26.\n\nDuring his tenure as the sub-collector of Kasargod, Bose, in 1978, initiated Gramotsav, a festival celebrating the culture and art forms of villages. The idea got replicated across Kerala and even today, the event forms an important part of the state’s tourism calendar.\n\nAs the district collector of Kollam, Bose, in 1985, founded the Kerala State Nirmithi Kendra to provide cost-effective and environment-friendly housing solutions to the people. The initiative later became a part of the national housing policy. “His greatest contribution has been to introduce low-cost housing technology to Kerala. He did it brilliantly with the support of Sarala Gopalan, then revenue secretary of Kerala,” says S.M. Vijayanand, former chief secretary of Kerala and former Kollam district collector.\n\nDuring his first meeting with Narendra Modi in 2014, while the latter was Gujarat chief minister, Bose introduced the idea and submitted a proposal. His ideas had also impressed former prime minister Manmohan Singh, who called him an ‘inspired’ civil servant.\n\nBose joined the BJP in 2019 but staying away from the local politics of Kerala, he networked with national leaders. After the 2021 Kerala assembly poll, PM Modi had sought his suggestions to revive the BJP in the state. His report did not go down well with the current BJP leadership in Kerala. But Bose has survived their annoyance and now got governorship of a critical state like Bengal, where former governor and current vice-president Jagdeep Dhankhar had several confrontations with the Trinamool Congress government. “Ananda Bose’s appointment as Bengal governor will make Kerala BJP leaders more uncomfortable,” says a senior BJP leader from Kerala.\n\nSubscribe to India Today Magazine"}, {"url": "https://www.wikiwand.com/en/Ananda_Mohan_Bose", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Ananda Mohan Bose?\n\nSummarize this article for a 10 years old"}, {"url": "https://thediplomat.com/2015/09/subhas-chandra-bose-an-indian-freedom-fighter-surrounded-in-myth/", "page_content": "Advertisement\n\nSometimes myth is more powerful than reality. Myths are often extremely enduring, and sometimes no amount of reality can change a preconceived notion. The mythos of Subhas Chandra Bose’s contribution to India’s freedom struggle is far stronger than his actual contribution.\n\nBose was a senior Indian National Congress leader who became the head of the party in 1938, but later fell out with the party leadership over the issue of ideology. He left the organization at a crucial stage of the freedom struggle in 1939.\n\nHaving left the party, he charted a new strategy to take on the British colonial power: force. He escaped British custody in Calcutta in 1940 and traveled to Germany, Italy, and Japan to explore the possibility of Axis military support for India’s liberation. He was one of the founders of the Indian National Army (INA) in Singapore, comprising mostly Indian expatriates who were Japanese prisoners of war in British Malaya in Southeast Asia. Despite his meeting with the Nazi German leader, Adolf Hitler, Italian ruler Benito Mussolini, and Imperial Japan’s military leadership, he was unable to mobilize much support and the INA ultimately played a marginal role during World War II. Bose is widely believed to have died in a plane crash in Taiwan in 1945.\n\nThese exploits gave birth to a bevy of myths and folktales about Bose. In the eyes of fellow ethnic Bengalis and those opposed to the Congress’ role in the freedom struggle, Bose became a preeminent hero. Any questioning of his political methods and achievements are frowned upon. What added a cult image to his name was his mysterious death in a plane crash. Since no one supposedly saw his corpse, his death became an unending mystery and the subject of much speculation and conspiracy theorizing. There are stories that he survived his accident and lived as an ascetic until the mid-60s, a fact which the government supposedly suppressed.\n\nDiplomat Brief Weekly Newsletter N Get briefed on the story of the week, and developing stories to watch across the Asia-Pacific. Get the Newsletter\n\nConspiracy theories about his death abound. India’s first prime minister, Jawaharlal Nehru, who happened to be Bose’s rival in the Congress party in the 1930s, had been held responsible for Bose’s mysterious disappearance. Over the years Nehru’s political opponents kept on fanning the flames of the conspiracy theories surrounding his involvement in Bose’s death. The Nehru government only made things worse by ordering surveillance of Bose’s family. The Indian government’s refusal to declassify government files related to Bose’s death also added weight to the conspiracy angle and made the INA leader a cult figure in India.\n\nEnjoying this article? Click here to subscribe for full access. Just $5 a month.\n\nLast week, the West Bengal government decided to declassify the 40-plus files related to the INA leader, thereby bringing all information related to Bose into the public domain. So far, not even a single sensational story has emerged from these declassified documents. The Hindu writes that the files have “little in terms of definitive evidence on Bose’s death or disappearance post-1945, but have documented unconfirmed reports that he may have survived the plane crash of 1945 in Taiwan in which he was supposed to have been killed.”\n\nThe state government’s decision to declassify files has put pressure on Prime Minister Narendra Modi to act on his pre-election promise of making all documents related to Bose public. But the government in Delhi is dithering and feels that the content of the files might jeopardize India’s relationship with neighboring countries. Some critics believe that by keeping the files secret, the government wants to keep the conspiracy theories alive, and damage the reputation of the Congress and Nehru-Gandhi family for not accepting Bose.\n\nHistorian Chandra S. Sundaram writes in Economic and Political Weekly that “generally in India there is mindless and hagiographical glorification of the INA. Mythic accounts of its exploits—often bearing no relation to historical reality—abound. This can be seen as an attempt by the Hindu right to assert its masculinity, to oppose ‘feminine’ Gandhian values.” But there are others who question the cult status given to Bose. They question his actual contributions and political methods in India’s freedom struggle. He sought out the support of fascist leaders like Hitler and Mussolini to achieve his political objectives. Had he succeeded in his mission, India would have been ruled by fascist forces in place of the British, an alternative which could have been fraught with danger.\n\nAdvertisement\n\n“So what vision did Netaji (Bose) have for India when he envisaged an Azad Hind (independent India)?” asks Vijay Shekhar in the Business Standard. He asks if Bose wanted “to follow the examples of Hitler or Mussolini or did he just want to throw out the British and invite the Japanese in their place… it was clear this was a man who would shake hands with the devil to get him what he wants.”\n\nIndia’s polarized politics do not allow any critical appraisal of a man who could have played a pivotal role in directing India’s future had he not left the country at the crucial stage when India was negotiating its independence from the British. The sad part is that a secular firebrand leader has been appropriated by the Hindu right and been made a mascot of Hindu sectarian interests. Summarizing his personality, Sundaram says that “in the end, he comes across as a misguided, tragic figure, diplomatically and militarily out of his depth … both the Germans and the Japanese regarded Bose as a puppet, a characterization he was never able to overcome. Had he never left India, he might have played a pivotal role in the endgame of empire there.”\n\nMany Indians would not be happy with this realistic assessment of Bose, but myths die hard in India."}, {"url": "https://www.business-standard.com/article/beyond-business/newsmaker-c-v-ananda-bose-110071600036_1.html", "page_content": "The IAS officer’ s dismissal and reinstatement as head of this apex agricultural procurement agency turned the spotlight on the rampant corruption within.\n\nLast week, senior civil servant C V Ananda Bose found himself in the news for the wrong reasons. He was sacked as managing director of National Agricultural Cooperative Marketing Federation (Nafed) on the pretext of misusing funds.\n\nEarlier this week, he was back in the headlines, this time for the right reasons: the agriculture ministry dismissed the allegations as baseless and clarified that the Nafed board could request the ministry to replace Bose but it could not remove him.\n\nBetween the two incidents lies a bizarre story of vested interests that does little credit to this apex government agency for procuring non-cereal grain. Bose’s contention was that by sacking him the board was trying to stop the crusade he led against some corrupt officials, primarily politicians. The cause célèbre was a 2003 tie-up between Nafed and certain companies for an import venture. Under this, Nafed provided a bank guarantee of Rs 3,900 crore to 29 private companies, most of which defaulted, and left Nafed with a loss of Rs 1,600 crore. Bose had raised allegations of corruption against some Nafed officials and was planning to take against certain others. In 2009, Nafed’s 23-member board, mainly comprising politicians like Bijender Singh (a Congress MLA in the Delhi Legislative Assembly) and Chander Pal Singh Yadav (a former MP) proposed an arbitrary one-time settlement scheme with defaulters. Bose opposed this saying the government had stipulated that dues could not be settled without a transparent structure.\n\nThe incident was eyebrow-raising for two reasons. First, the board decided to sack Bose even though his objections essentially conveyed the views of the ministry under which Nafed operates. Second, Bose, who was an additional secretary in the agriculture ministry and took charge of Nafed in September 2009, has succeeded in getting this troubled cooperative back on even keel. “He was getting Nafed back in shape,” said a Nafed official on condition of anonymity. For instance, just two months after he joined Bose managed to arrange a Rs 200 crore working capital loan for the cooperative. “He also renegotiated interest rates on earlier loans and helped the cooperative save Rs 20-25 crore a year,” the official added.\n\nIn February, when retail sugar prices were hovering at Rs 50 per kg, Nafed offered to sell sugar at Rs 41 per kg through its retail outlets and mobile vans. Under him, Nafed also launched a “Farmgate to Homegate” (Khet Se Ghar Tak) initiative that involved procuring essential commodities directly from farmers (instead of through middlemen) and making them available to consumers at prices considerably below market rates. This scheme led to a significant jump in Nafed’s turnover of Rs 4,800 crore. He also came up with the idea of finding an export market for Kerala-specific products to West Asia, which has a sizeable Keralite population.\n\nAlso Read Government gives clean chit to Nafed MD Nafed sacks its MD over fund misuse Rationally unconvincing Former IAS officer Sanjiv Misra joins BSE board Chhattisgarh suspends tainted IAS officer Directors special <b>My Life My Style:</b> Chetan Bhagat Organised the Maha Kumbh <b>Newsmaker:</b> Rajnath Singh Rahul Gandhi has empowered the youth: Rajeev Satav Directors special\n\nA ministry official who has worked with Bose said the 59-year-old civil servant had been appointed to head Nafed with the explicit mandate of purging the organisation of corrupt officials. The fact that the government backed him when he did just that was telling enough. Bose himself called the whole episode a “battle of the right against might” and said he would not give in to such “arm twisting”. He was, he said, ready to take “bruises” if his job so demanded. In that spirit, he continued to clear Nafed files from Krishi Bhavan, headquarters of the agriculture ministry, even as the board discussed his removal.\n\nOther than this case, Bose, who also chairs the Coconut Development Board, has had a faultless career as a civil servant. He has been Principal Secretary to K Karunakaran when he was Kerala Chief Minister. A PhD in habitat technology and environment from BITS, Pilani, Bose conceptualised and implemented the Kerala Nirmithi Kendra scheme to promote low-cost housing. His administrative initiatives have won him several awards such as the United Nations Global Best Practice Award and the Singapore Government Award for Urban Green Management Excellence.\n\nBose is a Keralite but was named after freedom fighter Subhash Chandra Bose by his father Vasudevan Nair, who fought alongside Netaji. He is also a prolific writer. Apart from regular columnist and writer in publications like Malayala Manorama and Deepika, he’s also an award-winning author of fiction, publishing nine books in English and Malayalam. If he’s looking for a subject for his next novel, the events of the past two weeks could provide him good material."}, {"url": "https://indianexpress.com/article/political-pulse/west-bengal-governor-c-v-ananda-bose-8275151/", "page_content": "IN what could signal a dialing down of tension between Raj Bhavan and the West Bengal government, newly appointed Governor, veteran bureaucrat C V Ananda Bose, said late Thursday that he would act as a “rainbow bridge” between the Centre and the state by “sorting out” issues and being a “conduit for…cooperation.”\n\nBose’s predecessor and current Vice President of India Jagdeep Dhankar and the Mamata Banerjee-led TMC government had been at loggerheads since his appointment to the Raj Bhavan in 2019.\n\nSpeaking to The Indian Express, Bose, appointed as Governor Thursday evening, said: “I do expect cordial relations with the elected government. The Governor’s role is as the head of the state. I would like to extend all co-operation to function within the parameters of the Constitution.”\n\nBose’s appointment will take effect on the date he assumes charge of his office, Press Secretary to President Draupadi Murmu, Ajay Kumar Singh, said in a communique.\n\n“West Bengal is a great state with culture and heritage unparalleled and the people in the state are good at heart and peace-loving,” Bose said. “Kolkata is a city with a soul. I consider the Governor’s office not as a high office but as an opportunity to be at the service of the people. I will be a Governor with access to people. I will try my best to be of help in the development and growth of the state.”\n\nAlso Read | Intrusive Governors make universities primary battleground\n\nAsked about the face-off between Dhankar and the Chief Minister, Bose said: “I would like to build a rainbow bridge with the Centre…By sorting out issues between the two, by being a conduit for mutual relationship, cooperation and interaction between the Centre and the state which will ultimately lead to the growth and development of the state.”\n\nBose’s appointment comes amid tension between the Raj Bhavans and non-BJP state governments, especially in Kerala and Tamil Nadu. Asked about this, Bose said: “All differences of opinion need not be seen as controversies. Protests and divided opinion need to be seen not as weakness but as (the) strength of democracy.”\n\nAdvertisement\n\nBose, 71, is a 1977 batch (retired) IAS officer of Kerala cadre, who has served in various roles in Kerala and the Centre in the departments of Education, Forest and Environment and Labour. He has been Principal Secretary to the late Congress veteran K Karunakaran during his term as Kerala Chief Minister. He was District Collector of Quilon district (now Kollam).\n\nBose joined the BJP before the 2019 general elections. During the Covid pandemic, Bose was asked by the Union Labour Ministry to prepare an action plan for the welfare of migrant workers.\n\nIn 2021, after the BJP’s defeat in the state elections, Prime Minister Narendra Modi had asked Bose and two other former bureaucrats, Jacob Thomas and E Sreedharan, to submit a report after talking to various leaders and candidates on funds sent from the central BJP to the state unit ahead of the elections. Bose had submitted the report to the Prime Minister after the state police launched a probe against state BJP leaders in connection with a highway robbery of Rs 3.5 crore that was suspected to be “unaccounted election funds.”\n\nAdvertisement\n\nA PhD from BITS, Pilani, Bose was a fellow of the Lal Bahadur Shastri National Academy of Administration, Mussoorie. As Director General of National Museum, he had headed the Supreme Court-appointed committee asked to conduct an inventory of the treasures of Sree Padmanabhaswamy temple in Thiruvananthapuram.\n\nBose was named after freedom fighter Subhash Chandra Bose by his father Vasudevan Nair who fought alongside Netaji."}]}