{"C. V. Ananda Bose was educated at the University of Calcutta and the University of London.": [{"url": "https://www.indiatoday.in/india-today-insight/story/meet-cv-ananda-bose-visionary-bureaucrat-and-now-west-bengal-governor-2299642-2022-11-20", "page_content": "Dr C.V. Ananda Bose, who assumes the challenging position of governor of the politically sensitive state of West Bengal, is no ordinary politician but carries the reputation of being an innovator in his distinguished civil services career. The 71-year-old former bureaucrat is a retired Union secretary who has made a mark wherever he worked. Bose joined the IAS in 1977 in the Kerala cadre and has held the offices of university vice-chancellor, additional chief secretary and district collector in Kerala.\n\nA prolific writer and columnist, Bose has published 40 books in English, Malayalam and Hindi, including novels, short stories, poems and essays. He is a recipient of 29 international and national awards for his outstanding contribution in various fields. He served as chairman of the working group that prepared the national development agenda for Prime Minister Narendra Modi.\n\nadvertisement\n\nBorn on January 2, 1951, in Mannanam village in Kottayam district of Kerala, Ananda Bose’s father P.K. Vasudevan Nair was a freedom fighter and follower of Netaji Subhas Chandra Bose. It was Nair who added ‘Bose’ to his son’s name.\n\nIn his early career, Ananda Bose was an English lecturer. He subsequently joined the State Bank group of banks as a probationary officer in Bengal and worked in the remote areas. He joined the IAS at the age of 26.\n\nDuring his tenure as the sub-collector of Kasargod, Bose, in 1978, initiated Gramotsav, a festival celebrating the culture and art forms of villages. The idea got replicated across Kerala and even today, the event forms an important part of the state’s tourism calendar.\n\nAs the district collector of Kollam, Bose, in 1985, founded the Kerala State Nirmithi Kendra to provide cost-effective and environment-friendly housing solutions to the people. The initiative later became a part of the national housing policy. “His greatest contribution has been to introduce low-cost housing technology to Kerala. He did it brilliantly with the support of Sarala Gopalan, then revenue secretary of Kerala,” says S.M. Vijayanand, former chief secretary of Kerala and former Kollam district collector.\n\nDuring his first meeting with Narendra Modi in 2014, while the latter was Gujarat chief minister, Bose introduced the idea and submitted a proposal. His ideas had also impressed former prime minister Manmohan Singh, who called him an ‘inspired’ civil servant.\n\nBose joined the BJP in 2019 but staying away from the local politics of Kerala, he networked with national leaders. After the 2021 Kerala assembly poll, PM Modi had sought his suggestions to revive the BJP in the state. His report did not go down well with the current BJP leadership in Kerala. But Bose has survived their annoyance and now got governorship of a critical state like Bengal, where former governor and current vice-president Jagdeep Dhankhar had several confrontations with the Trinamool Congress government. “Ananda Bose’s appointment as Bengal governor will make Kerala BJP leaders more uncomfortable,” says a senior BJP leader from Kerala.\n\nSubscribe to India Today Magazine"}, {"url": "https://starsunfolded.com/c-v-ananda-bose/", "page_content": "Profession(s) Politician, Former Civil Servant\n\nFamous for Being appointed as the twenty-second governor of West Bengal\n\nPhysical Stats & More\n\nHeight (approx.) in centimeters- 167 cm\n\nin meters- 1.67 m\n\nin feet & inches- 5’ 6”\n\nEye Colour Black\n\nHair Colour Black (semi-bald)\n\nPolitics\n\nPolitical Party Bharatiya Janata Party\n\n\n\n\n\nNote: He joined the Bharatiya Janata Party in 2019.\n\nCivil Service\n\nService Indian Administrative Service (IAS)\n\nBatch 1977\n\nCadre Kerala\n\nRetirement 20 September 2011\n\nMajor Designation(s) • Assistant Collector, Kasargod (1 July 1979- 1 June 1980)\n\n• Sub Collector, Kasargod (1 June 1980- 1 October 1981)\n\n• Joint General Manager in Finance Department (1 October 1981- 1 September 1982)\n\n• Deputy Secretary in Planning Department (1 September 1982- 1 January 1984)\n\n• Deputy Secretary in Welfare Department (1 January 1984- 1 April 1985)\n\n• District Collector of Kollam (1 April 1985- 1 July 1987)\n\n• Managing Director (Industries) (1 July 1987- 1 January 1988)\n\n• Secretary in Revenue Department (1 January 1988- 1 July 1990)\n\n• Secretary to Chief Minister in General Administration Department (1 March 1991- 1 March 1995)\n\n• Secretary to Chief Minister in Home Department (1 July 1991- 1 March 1995)\n\n• Director of Housing & Urban Dev Department and Kerala State Nirmithi Kendra (1 March 1995- 1 March 1999)\n\n• Secretary of Kerala Labour Department (1 March 1999- 1 October 2001)\n\n• Chairman & Managing Director of Kerala State Transport Corporation (1 October 2001- 5 January 2002)\n\n• Secretary of Administrative Reforms and General Administration (1 August 2002- 26 September 2002)\n\n• Secretary of Parliamentary Affairs (26 September 2002- 29 November 2002)\n\n• Secretary of Youth Affairs (29 November 2002- 16 January 2003)\n\n• Secretary of SC/ST Welfare (16 January 2003- 16 July 2003)\n\n• Secretary of Administrative Reforms (6 March 2003- 16 July 2003)\n\n• Principal Secretary of Higher Education Department (16 July 2003- 14 June 2004)\n\n• Principal Secretary of Forest & Wild Life Department of Thiruvananthapuram (17 September 2004- 1 April 2005)\n\n• Joint Secretary of Atomic Energy (Mumbai City) (1 April 2005- 12 January 2008)\n\n• Additional Secretary of Agriculture & Cooperation (12 January 2008- 14 September 2009)\n\n• Managing Director of Agriculture & Cooperation, NAFED, New Delhi (14 September 2009- 21 September 2010)\n\n• Administrator (Additional Secretary Equivalent) of Culture Affairs of National Museum (22 September 2010- 14 January 2011)\n\n• Administrator (Secretary Equivalent) of Culture Affairs of National Museum (1 February 2011- 20 September 2011)\n\nAwards, Honours, Achievements • National Special Habitat Award instituted by the Government of India and HUDCO for outstanding contributions to Housing in India (1989)\n\n\n\n• Jawaharlal Nehru Fellowship awarded by Jawaharlal Nehru Memorial Fund, New Delhi, for Habitat Management (1994)\n\n• Finalist of the World Habitat Awards (1994)\n\n• UN-Habitat Global Best Practice for Building Centre Movement (1996)\n\n• Diwaliben Mohanlal Mehta Award Instituted by Diwaliben Mehta Charitable Trust (1996)\n\n• Dr. Pam Davar Award Instituted by Siri Ram Washeshran Devi Bhatia Memorial Charitable Trust (1997)\n\n• Gold Medal by Management Leadership Awards (TMA) (1997)\n\n• Akshaya Award for outstanding contributions in promoting traditional architecture (Vastu) and heritage (1998)\n\n• Overseas Literary Critics Awards (1999)\n\n• Cities Asia Urban Green Management Excellence Award (2001)\n\n• Bremen Partnership Award for efficient use of Natural Resources (2001)\n\n• UN-Habitat Global Best Practice for GNN (Sustainable Habitat Development) (2002)\n\n• Overseas Literary Critics Awards (2017)\n\n• International Book Fair Awards (Sustainable Habitat Development) (2017)\n\n• Lion Centennial Malia Jones Award (2018)\n\n• Swathi Pratibha Puraskar (2018)\n\n• Rajiv Gandhi National Award for Excellence in Management\n\n• UNCHS – Awards for Excellence – Good Practice selection for transparent governance\n\n• United Nations Global Best Practice\n\n• Singapore Government Award for Urban Green Management Excellence\n\n• First-ever Fellow of the Lal Bahadur Shastri National Academy of Administration, Mussoorie\n\nPersonal Life\n\nDate of Birth 2 January 1951 (Tuesday)\n\nAge (as of 2023) 72 Years\n\nBirthplace Mannanam, Kottayam, Kerala\n\nZodiac sign Capricorn\n\nNationality Indian\n\nHometown Mannanam, Kottayam, Kerala\n\nCollege/University • Kuriakose Elias College, Mannanam\n\n• St. Berchmans College, Changanassery\n\n• Ph. D. in Housing and Environment\n\nEducational Qualification(s) • Graduation in English from Kuriakose Elias College, Mannanam\n\n• Post-graduation in English from St. Berchmans College, Changanassery\n\n• Ph. D. in Housing and Environment from Birla Institute of Technology and Science, Pilani\n\nEthnicity Malayali\n\nRelationships & More\n\nMarital Status Married\n\nFamily\n\nWife/Spouse L S Lakshmi (manages her family-owned plantation)\n\n\n\nChildren Son- A Vasudev Bose (pursuing an acting course at Stella Adler acting studio in Los Angeles as of 2022)\n\n\n\nDaughter- Nanditha Bose (died in 2017 due to cancer)\n\nParents Father- P K Vasudevan Pillai (Nair) (freedom fighter)\n\nMother- C Padmavathy Amma (former government official)\n\n\n\nSiblings Brother(s)- Er. C V Venugopalan Nair, Prof. C V Mohan Bose, Er. C V Sundara Bose, Adv. C V Sukumar Bose\n\nSister(s)- Prof. Omana Kunjamma, C V Komala Bose, C V Indira Bose\n\nMoney Factor"}, {"url": "https://drcvanandabose.com/biography/", "page_content": "Dr. Bose has been the recipient of thirty three (33) International and National awards for his outstanding contributions in different fields. In recognition of his pioneering efforts in the field of housing, United Nations has selected his initiatives as ‘Global Best Practice’ four times. Govt. of India awarded him the National (Special) Habitat award.\n\nHe was the head of the prestigious Supreme Court Committee on the treasures of ‘Sree Padmanabhaswamy Temple’ Kerala. An internationally renowned orator, Dr. Bose has addressed many prestigious global fora, including the United Nations General Assembly. Dr. Bose has won more than one hundred (100) prizes, including fifteen (15) gold medals, during his University days. He was the best speaker of the Kerala University three consecutive years and topped in the debates in the IAS training academy, Mussoorie.\n\nDr. Ananda Bose was Chairman of the working group which prepared the development agenda for Kerala presented to the Prime Minister of India, Sri. Narendra Modi. Dr. Bose’s concept of ‘affordable housing for all Indians’ is reflected in the national project to provide houses for all. Dr. Ananda Bose’s motivational speeches and inspirational writings have received global recognition and acclaim.\n\nSince his superannuation from IAS in 2011, Dr. Bose has been devoting his time and efforts in upholding India's heritage, nationalism in his writings, lectures and media interviews. His efforts at social integration and mainstreaming of minorities has made perceptible impact in society. Described by Kerala Government as ‘Lord of Ideas’ and former Prime minister Dr. Manmohan Singh as ‘inspired civil servant’, Dr. Bose was addressed by Prime Minister Narendra Modi as ‘Man of Ideas’. Known as the ' make over man' of the service, Dr Bose was sent to cleanse many corruption ridden organisations in the government.\n\nSon of the freedom fighter, late Sri P.K Vasudevan Nair and Smt. C. Padmavathy Amma, former govt of India official, Dr. Bose was born in Mannanam , Kottayam Kerala on 2/1/1951 . Married to Smt L.S Lakshmi, managing her own plantation, Dr Bose has A. Vasudev Bose (pursuing acting at Stella Adler acting studio, Los Angeles ) as his son and Advaith Nair, as grandson.\n\nDr. Ananda Bose holds a Ph.D from BITS Pilani and M.A in English Language and Literature from Kerala University."}, {"url": "https://simple.wikipedia.org/wiki/C._V._Ananda_Bose", "page_content": "Dr. C. V. Ananda Bose (born 2 January 1951) is an Indian politician and former civil servent. A member of Bharatiya Janata Party, he became the governor of West Bengal in November 2022.[1][2] Before that, he was advisor of Government of Meghalaya.[3]\n\nBose is a retired Indian Administrative Service officer of 1977 batch from Kerala cadre. He has been secretary in various departments and ministries of the Government of India and the state of Kerala.[4]\n\nEarly life [ change | change source ]\n\nBose was born on 2 January 1951 at Kottayam, a village in Indian state of Kerala. He spent his childhood over there. His parents were P K Vasudevan Pillai and C Padmavaty Amma.[5]\n\nBose holds a Ph.D from BITS Pilani; B.A in KE College[6] and M.A in English Language and Literature from Kerala University.\n\nAs civil servant [ change | change source ]\n\nBose has worked as Vice Chancellor in National Museum Insttitute.[7] He served as Principal Secretary to the Chief Minister, Chairman of central public sector undertaking Central Warehousing Corporation (CWC) and District Collector in Kerala. He also served the Chairman of the Habitat Alliance, in consultative status with the United Nations.[8]\n\nBose has represented India in the European Council for Nuclear Research (CERN), Geneva and International Fusion Energy Organisation (ITER), France. He was the chairman of the Atomic Energy Education Society.[9]\n\nHe was the head of the prestigious Supreme Court Committee on the treasures of ‘Sree Padmanabhaswamy Temple’ Kerala.[10]\n\nHe also worked during Modi government.[11]\n\nAs Governor [ change | change source ]\n\nBose was appointed as 22nd governor of West Bengal by President of India Draupadi Murmu on November 2022. He succeeded La. Ganesan.\n\nPersonal life [ change | change source ]\n\nBose has married with L S Lakshmi. He has a son and a daughter. He has published 32 books in English, Malayalam."}, {"url": "https://www.thehindu.com/news/cities/kolkata/cv-ananda-bose-sworn-in-as-west-bengal-governor/article66172890.ece", "page_content": "November 23, 2022 11:55 am | Updated 04:26 pm IST - Kolkata\n\nC.V. Ananda Bose was on November 23 sworn in as the Governor of West Bengal. The Governor was administered the oath by Chief Justice of Calcutta High Court Prakash Shrivastava at Raj Bhawan, Kolkata.\n\nChief Minister Mamata Banerjee, members of the State Cabinet, former Governor Gopalkrishna Gandhi, Left Front chairperson Biman Bose were among the dignitaries present at the swearing-in ceremony.\n\nLeader of Opposition Suvendu Adhikari was not present at the swearing-in ceremony. Mr. Bose has taken over responsibilities from Manipur Governor La. Ganesan who assumed charge of the State on July 18 when Jagdeep Dhankhar was elected Vice-President of India.\n\nMr. Bose is a 1977-batch former officer of the Indian Administrative Services who has served as the Secretary of Government of India and Chief Secretary to State Governments as well as University Vice-Chancellor.\n\nThe appointment of new West Bengal Governor comes at a time when serious differences between Raj Bhawan and State Government have come to fore in several States like Kerala and Tamil Nadu. Till recently, West Bengal too witnessed a similar standoff between Raj Bhawan and the State Government.\n\nMeanwhile, the absence of Leader of Opposition at the swearing in ceremony has triggered a controversy. Mr. Adhikari had taken to social media raising objection at the seating arrangement at the swearing-in ceremony. The BJP leader said that the chair which was designated to him was next to two BJP turncoats who have defected to Trinamool Congress (TMC) after the 2021 Assembly polls."}, {"url": "https://news.abplive.com/news/dr-c-v-ananda-bose-appointed-new-governor-of-west-bengal-know-about-him-in-details-1564015", "page_content": "CV Ananda Bose, who was appointed as West Bengal’s 21st Governor on Thursday, November 17, is a former Chief Secretary to the Government of India. He will take over the charge of the state from acting Governor LA Ganesan Iyer, who is also the Governor of Manipur.\n\nALSO READ | Dr CV Ananda Bose Appointed Governor Of West Bengal\n\nHere’s all that you need to know about West Bengal’s new Governor:\n\nThe 71-year-old CV Ananda Bose retired from the Indian Administrative service at the rank of Chief Secretary (Secretary to Govt. of India) retired from the Indian Administrative service at the rank of Chief Secretary. He last served as an advisor to the Meghalaya government.\n\nBorn in Mannanam in Kottayam, Kerala, Ananda Bose joined the Indian Administrative Service in 1977.\n\nHe initiated several innovative projects during his career. One such initiative was the institution of the District Tourism Promotion Council in 1986, which was replicated by the Government of Kerala in all the districts. The project eventually led to Kerala earning the tag of ‘God’s own country’.\n\nHe also started several initiatives in the fields of women’s welfare, entrepreneurship, affordable medical care, Ayurveda, and microeconomy.\n\nALSO READ | Who Is Jagdeep Dhankhar? Ex-Bengal Governor Who Is Now India's 14th Vice President\n\nThe United Nations selected his initiatives as 'Global Best Practice' four times.\n\nDuring his stint as the Chairman of the Atomic Energy Education Society, he represented India at the European Council for Nuclear Research (CERN), Geneva, and the International Fusion Energy Organisation in France.\n\nHis website states: “Dr. Bose has brought out three hundred and fifty (350) publications, including 45 books in English, Malayalam and Hindi consisting of novels, short stories, poems and essays.”\n\nAnanda Bose also received of 33 international and national awards for his outstanding contributions in different fields. In fact, PM Narendra Modi addressed him as a ‘man of ideas’."}, {"url": "https://drcvanandabose.com/", "page_content": "MOTIVATIONAL SPEAKER\n\nDr C. V Ananda Bose has been appointed as the Governor of West Bengal with effect from November 17 2022.\n\nDr. C.V. Ananda Bose IAS, eminent civil servant, housing expert, innovator, writer and orator, retired from service at the rank of Chief Secretary, Secretary to Govt. of India.\n\nDescribed by the Prime Minister of India, Sri. Narendra Modi, as an ‘ace debater’ and ‘man of ideas’, Dr. Bose is known for his mastery of oratory. He has won over a hundred prizes in intercollegiate debating contests, including 15 gold medals, was the Best Speaker of the Kerala University and toped the debates at India’s national academy of administration, Mussoorie which trains the top civil service of the country.\n\nHaving addressed the UN General Assembly, Economic and Social Council and the UN Habitat many times, Dr. Bose has been a highly sought after speaker at many international events in various countries.\n\nDr. Bose has set apart a major portion of his time for motivational speeches, motivational writings, conducting courses in human resource development and offers one to one interaction for those who seek counselling, motivation and personality development.\n\nDr. Bose’s speeches are marked by wit and humour, erudition and enlightenment, and arrest the attention of the listeners with their mesmerising magic."}, {"url": "https://www.thehindu.com/news/national/other-states/cv-ananda-bose-to-be-sworn-in-governor-of-west-bengal-on-november-23/article66169645.ece", "page_content": "November 22, 2022 09:58 pm | Updated 09:58 pm IST - Kolkata\n\nGovernor designate of West Bengal C.V. Ananda Bose on Tuesday arrived in Kolkata. He will be sworn in as the Governor on Wednesday.\n\nMr. Bose was received by State Ministers Sashi Panja and Firhad Hakim including top State government officials Chief Secretary H.K. Dwivedi and Kolkata Police Commissioner Vineet Kumar Goyal. He was given a guard of honour at the airport, before being escorted to the Raj Bhavan.\n\nChief Minister Mamata Banerjee spoke to Mr. Bose on the telephone and conveyed her best wishes for being designated for the highest constitutional office of the State. On Wednesday along with the Chief Minister, other dignitaries including Leader of the Opposition Suvendu Adhikari and Assembly Speaker Biman Bose will participate in the swearing-in programme that is likely to be held at the Raj Bhavan in Kolkata. The Governor will be administered the oath by Chief Justice of Calcutta High Court Prakash Shrivastava.\n\nMr. Bose will take over responsibilities from La Ganesan who assumed charge on July 18 when Jagdeep Dhankhar was elected Vice-President of India. Mr. Dhankhar was Governor of West Bengal from July 30, 2019 - July 18, 2022,\n\nMr. Bose is a 1977-batch former officer of the Indian Administrative Services who has served as the Secretary of Government of India and Chief Secretary to State governments as well as University Vice-Chancellor. He has a West Bengal connection and served as an administrator of the National Museum in Kolkata before superannuating in 2011.\n\nThe appointment comes at a time when serious differences between Raj Bhavan and State government have come to fore in several States like Kerala and Tamil Nadu. Till recently, West Bengal too witnessed a similar standoff between the Raj Bhavan and the State government."}, {"url": "https://indianexpress.com/article/cities/kolkata/cv-ananda-bose-oath-west-bengal-governor-8285026/", "page_content": "C V ANANDA Bose on Wednesday took oath as the new governor of West Bengal.\n\nHe was administered the oath of office by Chief Justice of Calcutta High Court Prakash Shrivastava in the presence of Chief Minister Mamata Banerjee and Speaker Biman Banerjee at a programme in Raj Bhavan.\n\nLeader of Opposition Suvendu Adhikari on Wednesday boycotted the oath taking ceremony, claiming that his seat was arranged beside two MLAs Krishna Kalyani and Biswajit Das who joined TMC from BJP.\n\nBose, a retired Kerala cadre IAS officer of the 1977 batch, was named the new Governor of West Bengal on November 17.\n\nHe replaced La Ganesan as the state’s constitutional head.\n\nBose was administered the oath of office by Chief Justice of Calcutta High Court Prakash Shrivastava in the presence of Chief Minister Mamata Banerjee. (Express Photo by Partha Paul) Bose was administered the oath of office by Chief Justice of Calcutta High Court Prakash Shrivastava in the presence of Chief Minister Mamata Banerjee. (Express Photo by Partha Paul)\n\nBose, the 22nd Governor of the state, had served as an administrator of the National Museum in Kolkata before superannuation in 2011.\n\nHe had started his work life as a probationary officer at the State Bank of India in Kolkata.\n\nAdvertisement\n\nAmong others who attended the ceremony were city mayor Firhad Hakim and state minister Chandrima Bhattacharya.\n\nThe new Governor’s wife, son and other family members were also present at the event.\n\nThe CM, following the swearing-in, offered rosogollas to Bose.\n\nMeanwhile, citing “insult” of Leader of Opposition, BJP state president Sukanta Majumdar boycotted the ceremony.\n\nAdvertisement\n\nLater in the day, Adhikarri went to Raj Bhavan and met with Governor Bose. He said, “Today my visit is a courtesy visit. I am not here to complain.”\n\nEarlier on Wednesday, the Leader of Opposition tweeted, “Heartiest congratulations to Dr CV Ananda Bose as he takes oath as the Governor of West Bengal. The Information & Cultural Affairs Dept; WB Govt. has made the arrangements for the oath taking ceremony. Seating arrangements as per the Minister in charge @MamataOfficial’’s whim. “\n\nHe further said, “In an absolutely disgraceful instance of uncourteous politics; the LoP has been made to sit next to ‘soon to be disqualified’ MLAs Krishna Kalyani & Biswajit Das. Both got elected on BJP tickets & later defected to TMC, so Anti-Defection proceedings are going on against them.”\n\nHe said, “I won’t be attending the ceremony as it’s not possible for me to take a seat next to such objectionable persons. I’ve requested the Hon’ble Governor to kindly give me an appointment separately at any time according to his convenience. It’s fine even if he asks me to visit today.”\n\nTraditionally, the swearing-in ceremony of the Governor is conducted by the Chief Secretary of the state at the Raj Bhavan. According to Nabanna sources, Chief Secretary Harikrishna Dwivedi invited the state Opposition leader to attend the swearing-in ceremony of the new Governor of the state on Wednesday. Suvendu also informed about attending the event, the sources said.\n\nBut Wednesday morning saw a different picture.\n\nAdvertisement\n\nSuvendu said that his chair was placed behind the seats of Trinamool MP and Rajya Sabha leader Derek O’Brien, Trinamool Lok Sabha leader Sudeep Banerjee and Mala Roy. He also said that next to him were the chairs of Bangaon MLA Biswajit Das and Raiganj MLA Krishna Kalyani who switched from BJP to Trinamool. Suvendu alleged that this has happened due to his “criticism” of the Chief Minister. He alleged that he was “insulted” for “pursuing political revenge.”\n\n“He (Adhikari) is named in an FIR and BJP leaders are demanding his arrest in the Narada case…. He joined BJP to save himself from the ED and CBI. The truth is that he is suffering from guilt conscience. As a result, he can’t sit alongside TMC leaders,” TMC spokesperson Kunal Ghosh said."}, {"url": "https://www.thehindu.com/features/metroplus/game-for-a-challenge-always/article2365759.ece", "page_content": "August 17, 2011 05:07 pm | Updated 05:08 pm IST\n\nDr. C. V. Ananda Bose, IAS, a Secretary level officer of the Government of India serving as the Administrator, National Museum, and Vice-Chancellor, National Museum Institute, has the spotlight firmly trained on him. Not surprising, for this bureaucrat heads the five-member panel appointed by the Supreme Court to assess the wealth in the cellars of the Sree Padmanabha Swamy Temple.\n\nAnanda Bose was not ready to reveal his findings but said that his mission was to make a scientific plan that would help assess the wealth in the vaults. When asked whether the artefacts of historical and archaeological value would be moved to a museum, he said, “That is one of the mandates of the Supreme Court. Assessing the value of these artefacts is tough. How can one put a price on these priceless antiques? In the National Museum, we have the famous Dancing Girl of Mohenjo-Daro. What price can we put on something like this? It's only when we take some of them for exhibitions abroad, for the sake of insurance, that we put a price tag on them. We have now decided not to take the AA category artefacts out of the museum after one of them got damaged a bit,” informs Ananda Bose, who has consistently attempted to think out-of-the-box, made innovative decisions.\n\nIn his three plus decades in service Ananda Bose has proved that he is game for challenges and his administrative innovations, like Nirmithi Kendra, the cost-effective housing solution, that has won international recognition and the District Tourism Promotion Council have made a perceptible impact in society.\n\nConcept changing\n\nYet, the latest appointment made him a bit apprehensive. But he got cracking quickly. He called on experts, understood the urgent needs and has now started work on a slew of projects. “The concept of museums is changing. Museums can longer be an abode of dead artefacts. They must function as a hub for disseminating knowledge, of cultural activities. We have embarked on projects that will transform our museums,” informs Ananda Bose.\n\nOne important project that Ananda Bose is piloting is the People's Museum. “As I said, museums should connect with the people. They must act as a bridge between the past and future through the present. Museum activities, as this project envisions, moves out of the limits of the secure museum space right into the middle of the people. There are three segments here, like the campus museums, community museums and the panchayats museum. The National Museum will provide these museums authenticated replicas to exhibit. But they will also have to replenish the stock by collecting antiques from within the local area that has relevance to the culture and heritage of the place.”\n\nThese museums will also function as a centre for cultural activities with performances from the local artistes, painting and sculpture workshops. Initiatives have been taken by various states including Kerala. Museums in the country, a large majority of them at least, lack basic visitor amenities. They do not have information desks, book and souvenir shops, audio tours, restaurants or cafes, ramps for the aged etc.\n\n“Yes, this is true. We have now embarked on a mission to upgrade our museums. In fact, the National Museum is in the process of a makeover. It will be a complete renovation and our aim is to make it one of the best, internationally. We will include the best of talent in museology, architecture and interior decoration for this. Some of the other museums like the Chattrapati Sivaji Maharaj Vastu Sangrahalaya, Mumbai, Indian Museum, Kolkata, The Salarjung Museum, Hyderabad, and some others are also in the process of modernisation.”\n\nBarrier-free museums\n\nAnanda Bose also hinted at some of the other innovations he proposed to introduce at these renovated museums. “We will make the museums barrier-free. There will be ramps to give easy access to the aged and physically challenged. We have already put in place a system to enable the visually-impaired to walk through and appreciate art at the National Museum. We have installed monograms, signs and Braille inscriptions to make objects in the museum visually-impaired-friendly. .”\n\nAnother significant project Anand Bose is working on is upgrading the National Museum Institute into a cultural university. “The proposal has been accepted by the Human Resource Development Ministry, a detailed project has been finalised; the department has given the go ahead. It requires legislation, detailing has to be done.” This is part of the two projects that are going to be upgraded, the other being the Rajiv Gandhi Centre for Sports, Sriperumbudur."}]}