{"C. V. Ananda Bose was a member of the Constituent Assembly of India.": [{"url": "https://simple.wikipedia.org/wiki/C._V._Ananda_Bose", "page_content": "Dr. C. V. Ananda Bose (born 2 January 1951) is an Indian politician and former civil servent. A member of Bharatiya Janata Party, he became the governor of West Bengal in November 2022.[1][2] Before that, he was advisor of Government of Meghalaya.[3]\n\nBose is a retired Indian Administrative Service officer of 1977 batch from Kerala cadre. He has been secretary in various departments and ministries of the Government of India and the state of Kerala.[4]\n\nEarly life [ change | change source ]\n\nBose was born on 2 January 1951 at Kottayam, a village in Indian state of Kerala. He spent his childhood over there. His parents were P K Vasudevan Pillai and C Padmavaty Amma.[5]\n\nBose holds a Ph.D from BITS Pilani; B.A in KE College[6] and M.A in English Language and Literature from Kerala University.\n\nAs civil servant [ change | change source ]\n\nBose has worked as Vice Chancellor in National Museum Insttitute.[7] He served as Principal Secretary to the Chief Minister, Chairman of central public sector undertaking Central Warehousing Corporation (CWC) and District Collector in Kerala. He also served the Chairman of the Habitat Alliance, in consultative status with the United Nations.[8]\n\nBose has represented India in the European Council for Nuclear Research (CERN), Geneva and International Fusion Energy Organisation (ITER), France. He was the chairman of the Atomic Energy Education Society.[9]\n\nHe was the head of the prestigious Supreme Court Committee on the treasures of ‘Sree Padmanabhaswamy Temple’ Kerala.[10]\n\nHe also worked during Modi government.[11]\n\nAs Governor [ change | change source ]\n\nBose was appointed as 22nd governor of West Bengal by President of India Draupadi Murmu on November 2022. He succeeded La. Ganesan.\n\nPersonal life [ change | change source ]\n\nBose has married with L S Lakshmi. He has a son and a daughter. He has published 32 books in English, Malayalam."}, {"url": "https://www.indiatoday.in/india-today-insight/story/meet-cv-ananda-bose-visionary-bureaucrat-and-now-west-bengal-governor-2299642-2022-11-20", "page_content": "Dr C.V. Ananda Bose, who assumes the challenging position of governor of the politically sensitive state of West Bengal, is no ordinary politician but carries the reputation of being an innovator in his distinguished civil services career. The 71-year-old former bureaucrat is a retired Union secretary who has made a mark wherever he worked. Bose joined the IAS in 1977 in the Kerala cadre and has held the offices of university vice-chancellor, additional chief secretary and district collector in Kerala.\n\nA prolific writer and columnist, Bose has published 40 books in English, Malayalam and Hindi, including novels, short stories, poems and essays. He is a recipient of 29 international and national awards for his outstanding contribution in various fields. He served as chairman of the working group that prepared the national development agenda for Prime Minister Narendra Modi.\n\nadvertisement\n\nBorn on January 2, 1951, in Mannanam village in Kottayam district of Kerala, Ananda Bose’s father P.K. Vasudevan Nair was a freedom fighter and follower of Netaji Subhas Chandra Bose. It was Nair who added ‘Bose’ to his son’s name.\n\nIn his early career, Ananda Bose was an English lecturer. He subsequently joined the State Bank group of banks as a probationary officer in Bengal and worked in the remote areas. He joined the IAS at the age of 26.\n\nDuring his tenure as the sub-collector of Kasargod, Bose, in 1978, initiated Gramotsav, a festival celebrating the culture and art forms of villages. The idea got replicated across Kerala and even today, the event forms an important part of the state’s tourism calendar.\n\nAs the district collector of Kollam, Bose, in 1985, founded the Kerala State Nirmithi Kendra to provide cost-effective and environment-friendly housing solutions to the people. The initiative later became a part of the national housing policy. “His greatest contribution has been to introduce low-cost housing technology to Kerala. He did it brilliantly with the support of Sarala Gopalan, then revenue secretary of Kerala,” says S.M. Vijayanand, former chief secretary of Kerala and former Kollam district collector.\n\nDuring his first meeting with Narendra Modi in 2014, while the latter was Gujarat chief minister, Bose introduced the idea and submitted a proposal. His ideas had also impressed former prime minister Manmohan Singh, who called him an ‘inspired’ civil servant.\n\nBose joined the BJP in 2019 but staying away from the local politics of Kerala, he networked with national leaders. After the 2021 Kerala assembly poll, PM Modi had sought his suggestions to revive the BJP in the state. His report did not go down well with the current BJP leadership in Kerala. But Bose has survived their annoyance and now got governorship of a critical state like Bengal, where former governor and current vice-president Jagdeep Dhankhar had several confrontations with the Trinamool Congress government. “Ananda Bose’s appointment as Bengal governor will make Kerala BJP leaders more uncomfortable,” says a senior BJP leader from Kerala.\n\nSubscribe to India Today Magazine"}, {"url": "https://www.wikiwand.com/simple/C._V._Ananda_Bose", "page_content": "Dr. C. V. Ananda Bose (born 2 January 1951) is an Indian politician and former civil servent. A member of Bharatiya Janata Party, he became the governor of West Bengal in November 2022.[1][2] Before that, he was advisor of Government of Meghalaya.[3]\n\nQuick facts: C. V. Ananda Bose, 22nd Governor of West Beng... ▼\n\nBose is a retired Indian Administrative Service officer of 1977 batch from Kerala cadre. He has been secretary in various departments and ministries of the Government of India and the state of Kerala.[4]"}, {"url": "https://news.abplive.com/news/dr-c-v-ananda-bose-appointed-new-governor-of-west-bengal-know-about-him-in-details-1564015", "page_content": "CV Ananda Bose, who was appointed as West Bengal’s 21st Governor on Thursday, November 17, is a former Chief Secretary to the Government of India. He will take over the charge of the state from acting Governor LA Ganesan Iyer, who is also the Governor of Manipur.\n\nALSO READ | Dr CV Ananda Bose Appointed Governor Of West Bengal\n\nHere’s all that you need to know about West Bengal’s new Governor:\n\nThe 71-year-old CV Ananda Bose retired from the Indian Administrative service at the rank of Chief Secretary (Secretary to Govt. of India) retired from the Indian Administrative service at the rank of Chief Secretary. He last served as an advisor to the Meghalaya government.\n\nBorn in Mannanam in Kottayam, Kerala, Ananda Bose joined the Indian Administrative Service in 1977.\n\nHe initiated several innovative projects during his career. One such initiative was the institution of the District Tourism Promotion Council in 1986, which was replicated by the Government of Kerala in all the districts. The project eventually led to Kerala earning the tag of ‘God’s own country’.\n\nHe also started several initiatives in the fields of women’s welfare, entrepreneurship, affordable medical care, Ayurveda, and microeconomy.\n\nALSO READ | Who Is Jagdeep Dhankhar? Ex-Bengal Governor Who Is Now India's 14th Vice President\n\nThe United Nations selected his initiatives as 'Global Best Practice' four times.\n\nDuring his stint as the Chairman of the Atomic Energy Education Society, he represented India at the European Council for Nuclear Research (CERN), Geneva, and the International Fusion Energy Organisation in France.\n\nHis website states: “Dr. Bose has brought out three hundred and fifty (350) publications, including 45 books in English, Malayalam and Hindi consisting of novels, short stories, poems and essays.”\n\nAnanda Bose also received of 33 international and national awards for his outstanding contributions in different fields. In fact, PM Narendra Modi addressed him as a ‘man of ideas’."}, {"url": "https://www.hindustantimes.com/india-news/who-is-cv-ananda-bose-west-bengal-s-new-governor-101668698614296.html", "page_content": "CV Ananda Bose has been appointed governor of West Bengal. In a statement, the office of President Droupadi Murmu said, “The President of India is pleased to appoint Dr C V Ananda Bose as regular governor of West Bengal.\" CV Ananda Bose.\n\nManipur governor La Ganesan had been holding the additional charge of West Bengal since July after the former governor, Jagdeep Dhankhar, quit the post to contest for the vice-presidential election.\n\nFive things you need to know about new West Bengal governor Ananda Bose:\n\n1) CV Ananda Bose, a former civil servant, had served in the Indian Administrative Services.\n\n2) Bose has worked as University vice-chancellor, additional chief sectary, and district collector.\n\n3) He is the chairman of Habitat Alliance in consultative status with the United Nations.\n\n4) Bose is the recipient of the prestigious Jawaharlal Nehru Fellowship. He is also the first-ever fellow of the Lal Bahadur Shastri National Academy of Administration Mussoorie, which trains the top civil servants of the nation.\n\n5) A writer and columnist, Bose has published 40 books in English, Malayalam, and Hindi including novels, short stories, poems, and essays. Some of his books have become best sellers, according to The Institute of Cost Accountants of India website.\n\nSHARE THIS ARTICLE ON"}, {"url": "https://www.jagranjosh.com/current-affairs/c-v-ananda-bose-appointed-as-the-governor-of-west-bengal-1668748566-1", "page_content": "The former bureaucrat C V Ananda Bose on November 17, 2022, was appointed as the Governor of West Bengal. As per the Communique from the Rashtrapati Bhavan, “The President of India is pleased to appoint Dr C V Ananda Bose as regular Governor of West Bengal.”\n\nThe appointment of C V Ananda Bose as the Governor of West Bengal will take effect on the date he assumes charge of his office. Governor of Manipur La Ganesan was holding the additional charge of West Bengal since July 2022 after incumbent Jagdeep Dhankhar was nominated as the Vice President Candidate by the National Democratic Alliance (NDA).\n\nDr CV Ananda Bose appointed as the Governor of West Bengal. pic.twitter.com/PsGKySLgGO — ANI (@ANI) November 17, 2022\n\nWho is C V Ananda Bose?\n\nThe former bureaucrat C V Ananda Bose is a 1977 (retired) Indian Administrative Service (IAS) Officer of the Kerala cadre. He last served as an administrator in the National Museum before superannuating in 2011.\n\nC V Ananda Bose was a Chairman of a working group that prepared the development agenda for Prime Minister Narendra Modi’s government. Bose’s concept of ‘affordable housing for all’ was also adopted by the ruling government.\n\nAs per the official records, Bose has been the District Collector of Quilon district in Kerala. He served as a Secretary to the then Chief Minister of the state and as an additional secretary in the Ministry of Agriculture, among others.\n\nC V Ananda Bose: Other Achievements\n\n1. C V Ananda Bose is the recipient of the Jawaharlal Nehru Fellowship.\n\n2. He is also the first-ever fellow of the Lal Bahadur Shastri National Academy of Administration in Mussoorie. It trains top Civil Service Officers.\n\n3. Bose is a prolific writer and columnist. He has published 40 books in English, Malayalam, and Hindi including short stories, novels, poems, and essays.\n\nAppointment of West Bengal Governor: Background\n\nManipur Governor La Ganesan was holding the additional charge of West Bengal since July 2022 after the former Governor Jagdeep Dhankhar became the Vice President of India.\n\nDhankhar was also accused of overstepping his role by the ruling Trinamool Congress of West Bengal. However, La Ganesan shared a cordial relationship with the Government of West Bengal.\n\nLance Naik Manju becomes Indian Army’s first woman skydiver with 10,000 ft jump"}, {"url": "https://zeenews.india.com/india/cv-ananda-bose-appointed-governor-of-west-bengal-2536816.html", "page_content": "New Delhi: C V Ananda Bose was on Thursday (November 17, 2022) appointed the regular Governor of West Bengal, a communique from the Rashtrapati Bhavan said. His appointment will take effect on the date he assumes charge of his office, it added.\n\n\"The President of India is pleased to appoint Dr C V Ananda Bose as regular Governor of West Bengal,\" the communique said.\n\nManipur Governor La Ganesan has been holding the additional charge of West Bengal since July this year after incumbent Jagdeep Dhankhar was nominated as the vice presidential candidate by the BJP-led NDA.\n\nCV Ananda Bose is a former Bureaucrat\n\nBorn in Kerala's Kottayam District on January 2, 1951, CV Ananda Bose is a former Bureaucrat who retired from the Indian Administrative service at the rank of Chief Secretary (Secretary to Govt. of India). He has done his Ph.D. from BITS Pilani and MA in English Language and Literature from Kerala University.\n\nHe has also been the district collector of Quilon district (now Kollam) in Kerala.\n\nA 1977 batch (retired) IAS officer of Kerala cadre, Bose last served as an administrator in the National Museum in Kolkata before superannuating in 2011.\n\nMeanwhile, the Trinamool Congress hoped that the West Bengal government and the Raj Bhawan would share cordial relations after CV Ananda Bose was appointed as the governor of the state.\n\n\n\n\"If he works within the Constitution's limits, the people of the state will welcome him. We hoped that the state government and the Raj Bhawan would share cordial relations,\" senior TMC MP Sougata Roy said.\n\nPrior to his election as the Vice President of India, Jagdeep Dhankhar was the governor of the state for nearly three years and had engaged in tussles with the Mamata Banerjee-led government over several issues, including the law and order situation, in the state."}, {"url": "https://www.thehindu.com/news/cities/kolkata/cv-ananda-bose-appointed-west-bengal-governor/article66150198.ece", "page_content": "November 17, 2022 09:31 pm | Updated 10:27 pm IST - New Delhi\n\nFormer bureaucrat C. V. Ananda Bose was on Thursday appointed the Governor of West Bengal, a communique from the Rashtrapati Bhavan said.\n\nManipur Governor La Ganesan had been holding the additional charge of West Bengal since July, when Jagdeep Dhankhar resigned to contest the Vice Presidential polls.\n\n“The President of India is pleased to appoint Dr C V Ananda Bose as regular Governor of West Bengal. The above appointment will take effect from the date he assumes charge of his office,” the communique said.\n\nMr. Ananda Bose is a 1977-batch former officer of the Indian Administrative Services who has served as the Secretary of Government of India and Chief Secretary to State governments as well as University Vice-Chancellor.\n\nHe is known for his innovative ideas in the field of good governance, and the United Nations has selected his initiatives ‘Global Best Practice’ four times. A prolific writer, he has published 32 books in English, Hindi, and Malayalam across different genres including novels, short stories and poems."}, {"url": "https://drcvanandabose.com/biography/", "page_content": "Dr. Bose has been the recipient of thirty three (33) International and National awards for his outstanding contributions in different fields. In recognition of his pioneering efforts in the field of housing, United Nations has selected his initiatives as ‘Global Best Practice’ four times. Govt. of India awarded him the National (Special) Habitat award.\n\nHe was the head of the prestigious Supreme Court Committee on the treasures of ‘Sree Padmanabhaswamy Temple’ Kerala. An internationally renowned orator, Dr. Bose has addressed many prestigious global fora, including the United Nations General Assembly. Dr. Bose has won more than one hundred (100) prizes, including fifteen (15) gold medals, during his University days. He was the best speaker of the Kerala University three consecutive years and topped in the debates in the IAS training academy, Mussoorie.\n\nDr. Ananda Bose was Chairman of the working group which prepared the development agenda for Kerala presented to the Prime Minister of India, Sri. Narendra Modi. Dr. Bose’s concept of ‘affordable housing for all Indians’ is reflected in the national project to provide houses for all. Dr. Ananda Bose’s motivational speeches and inspirational writings have received global recognition and acclaim.\n\nSince his superannuation from IAS in 2011, Dr. Bose has been devoting his time and efforts in upholding India's heritage, nationalism in his writings, lectures and media interviews. His efforts at social integration and mainstreaming of minorities has made perceptible impact in society. Described by Kerala Government as ‘Lord of Ideas’ and former Prime minister Dr. Manmohan Singh as ‘inspired civil servant’, Dr. Bose was addressed by Prime Minister Narendra Modi as ‘Man of Ideas’. Known as the ' make over man' of the service, Dr Bose was sent to cleanse many corruption ridden organisations in the government.\n\nSon of the freedom fighter, late Sri P.K Vasudevan Nair and Smt. C. Padmavathy Amma, former govt of India official, Dr. Bose was born in Mannanam , Kottayam Kerala on 2/1/1951 . Married to Smt L.S Lakshmi, managing her own plantation, Dr Bose has A. Vasudev Bose (pursuing acting at Stella Adler acting studio, Los Angeles ) as his son and Advaith Nair, as grandson.\n\nDr. Ananda Bose holds a Ph.D from BITS Pilani and M.A in English Language and Literature from Kerala University."}, {"url": "https://www.thehindu.com/news/cities/kolkata/cv-ananda-bose-sworn-in-as-west-bengal-governor/article66172890.ece", "page_content": "November 23, 2022 11:55 am | Updated 04:26 pm IST - Kolkata\n\nC.V. Ananda Bose was on November 23 sworn in as the Governor of West Bengal. The Governor was administered the oath by Chief Justice of Calcutta High Court Prakash Shrivastava at Raj Bhawan, Kolkata.\n\nChief Minister Mamata Banerjee, members of the State Cabinet, former Governor Gopalkrishna Gandhi, Left Front chairperson Biman Bose were among the dignitaries present at the swearing-in ceremony.\n\nLeader of Opposition Suvendu Adhikari was not present at the swearing-in ceremony. Mr. Bose has taken over responsibilities from Manipur Governor La. Ganesan who assumed charge of the State on July 18 when Jagdeep Dhankhar was elected Vice-President of India.\n\nMr. Bose is a 1977-batch former officer of the Indian Administrative Services who has served as the Secretary of Government of India and Chief Secretary to State Governments as well as University Vice-Chancellor.\n\nThe appointment of new West Bengal Governor comes at a time when serious differences between Raj Bhawan and State Government have come to fore in several States like Kerala and Tamil Nadu. Till recently, West Bengal too witnessed a similar standoff between Raj Bhawan and the State Government.\n\nMeanwhile, the absence of Leader of Opposition at the swearing in ceremony has triggered a controversy. Mr. Adhikari had taken to social media raising objection at the seating arrangement at the swearing-in ceremony. The BJP leader said that the chair which was designated to him was next to two BJP turncoats who have defected to Trinamool Congress (TMC) after the 2021 Assembly polls."}], "C. V. Ananda Bose was a member of the Indian delegation to the United Nations in 1948.": [{"url": "https://simple.wikipedia.org/wiki/C._V._Ananda_Bose", "page_content": "Dr. C. V. Ananda Bose (born 2 January 1951) is an Indian politician and former civil servent. A member of Bharatiya Janata Party, he became the governor of West Bengal in November 2022.[1][2] Before that, he was advisor of Government of Meghalaya.[3]\n\nBose is a retired Indian Administrative Service officer of 1977 batch from Kerala cadre. He has been secretary in various departments and ministries of the Government of India and the state of Kerala.[4]\n\nEarly life [ change | change source ]\n\nBose was born on 2 January 1951 at Kottayam, a village in Indian state of Kerala. He spent his childhood over there. His parents were P K Vasudevan Pillai and C Padmavaty Amma.[5]\n\nBose holds a Ph.D from BITS Pilani; B.A in KE College[6] and M.A in English Language and Literature from Kerala University.\n\nAs civil servant [ change | change source ]\n\nBose has worked as Vice Chancellor in National Museum Insttitute.[7] He served as Principal Secretary to the Chief Minister, Chairman of central public sector undertaking Central Warehousing Corporation (CWC) and District Collector in Kerala. He also served the Chairman of the Habitat Alliance, in consultative status with the United Nations.[8]\n\nBose has represented India in the European Council for Nuclear Research (CERN), Geneva and International Fusion Energy Organisation (ITER), France. He was the chairman of the Atomic Energy Education Society.[9]\n\nHe was the head of the prestigious Supreme Court Committee on the treasures of ‘Sree Padmanabhaswamy Temple’ Kerala.[10]\n\nHe also worked during Modi government.[11]\n\nAs Governor [ change | change source ]\n\nBose was appointed as 22nd governor of West Bengal by President of India Draupadi Murmu on November 2022. He succeeded La. Ganesan.\n\nPersonal life [ change | change source ]\n\nBose has married with L S Lakshmi. He has a son and a daughter. He has published 32 books in English, Malayalam."}, {"url": "https://www.wikiwand.com/simple/C._V._Ananda_Bose", "page_content": "Dr. C. V. Ananda Bose (born 2 January 1951) is an Indian politician and former civil servent. A member of Bharatiya Janata Party, he became the governor of West Bengal in November 2022.[1][2] Before that, he was advisor of Government of Meghalaya.[3]\n\nQuick facts: C. V. Ananda Bose, 22nd Governor of West Beng... ▼\n\nBose is a retired Indian Administrative Service officer of 1977 batch from Kerala cadre. He has been secretary in various departments and ministries of the Government of India and the state of Kerala.[4]"}, {"url": "https://www.indiatoday.in/india-today-insight/story/meet-cv-ananda-bose-visionary-bureaucrat-and-now-west-bengal-governor-2299642-2022-11-20", "page_content": "Dr C.V. Ananda Bose, who assumes the challenging position of governor of the politically sensitive state of West Bengal, is no ordinary politician but carries the reputation of being an innovator in his distinguished civil services career. The 71-year-old former bureaucrat is a retired Union secretary who has made a mark wherever he worked. Bose joined the IAS in 1977 in the Kerala cadre and has held the offices of university vice-chancellor, additional chief secretary and district collector in Kerala.\n\nA prolific writer and columnist, Bose has published 40 books in English, Malayalam and Hindi, including novels, short stories, poems and essays. He is a recipient of 29 international and national awards for his outstanding contribution in various fields. He served as chairman of the working group that prepared the national development agenda for Prime Minister Narendra Modi.\n\nadvertisement\n\nBorn on January 2, 1951, in Mannanam village in Kottayam district of Kerala, Ananda Bose’s father P.K. Vasudevan Nair was a freedom fighter and follower of Netaji Subhas Chandra Bose. It was Nair who added ‘Bose’ to his son’s name.\n\nIn his early career, Ananda Bose was an English lecturer. He subsequently joined the State Bank group of banks as a probationary officer in Bengal and worked in the remote areas. He joined the IAS at the age of 26.\n\nDuring his tenure as the sub-collector of Kasargod, Bose, in 1978, initiated Gramotsav, a festival celebrating the culture and art forms of villages. The idea got replicated across Kerala and even today, the event forms an important part of the state’s tourism calendar.\n\nAs the district collector of Kollam, Bose, in 1985, founded the Kerala State Nirmithi Kendra to provide cost-effective and environment-friendly housing solutions to the people. The initiative later became a part of the national housing policy. “His greatest contribution has been to introduce low-cost housing technology to Kerala. He did it brilliantly with the support of Sarala Gopalan, then revenue secretary of Kerala,” says S.M. Vijayanand, former chief secretary of Kerala and former Kollam district collector.\n\nDuring his first meeting with Narendra Modi in 2014, while the latter was Gujarat chief minister, Bose introduced the idea and submitted a proposal. His ideas had also impressed former prime minister Manmohan Singh, who called him an ‘inspired’ civil servant.\n\nBose joined the BJP in 2019 but staying away from the local politics of Kerala, he networked with national leaders. After the 2021 Kerala assembly poll, PM Modi had sought his suggestions to revive the BJP in the state. His report did not go down well with the current BJP leadership in Kerala. But Bose has survived their annoyance and now got governorship of a critical state like Bengal, where former governor and current vice-president Jagdeep Dhankhar had several confrontations with the Trinamool Congress government. “Ananda Bose’s appointment as Bengal governor will make Kerala BJP leaders more uncomfortable,” says a senior BJP leader from Kerala.\n\nSubscribe to India Today Magazine"}, {"url": "https://www.financialexpress.com/india-news/cv-ananda-bose-west-bengal-governor-jagdeep-dhankar-mamata-banerjee/2838733/", "page_content": "Former bureaucrat CV Ananda Bose has been appointed as the new governor of West Bengal. A communique issued by the Rashtrapati Bhavan confirmed his appointment. Manipur’s Governor La Ganesan had been holding additional charge of the state since July after incumbent Jagdeep Dhankhar was nominated as the vice presidential candidate by the National Democratic Alliance (NDA).\n\nIn a conversation with The Indian Express, Bose on Thursday said that he expects cordial relations with the elected government. “The Governor’s role is as the head of the state. I would like to extend all cooperation to function within the parameters of the Constitution,” he said. Bose also said that he would act as a rainbow bridge between the Centre and the state.\n\nBose succeeds Jagdeep Dhankar, who had frequent run-ins with the Chief Minister Mamata Banerjee-led Trinamool Congress (TMC) government in the state.\n\nAll you need to know about the new West Bengal Governor CV Ananda Bose:\n\n-The 71-year-old former bureaucrat is a 1977-batch (retired) Indian Administrative Service (IAS) officer of Kerala cadre.\n\n-He was born on 2 January, 1951, in Mannanam in Kerala’s Kottayam district, and holds a PhD from BITS, Pilani in Rajasthan.\n\n-His father’s name is P K Vasudevan Pillai, and mother’s name is C Padmavaty Amma.\n\n-He wife’s name is L S Lakshmi, and has two children – Nanditha Bose and A Vasudev Bose.\n\n-Bose was named after freedom fighter Subhash Chandra Bose by his father Vasudevan Nair who fought alongside Netaji.\n\n-The new governor is also the recipient of the prestigious Jawaharlal Nehru Fellowship, and is also the first-ever Fellow of the Lal Bahadur Shastri National Academy of Administration, Mussoorie.\n\nAlso Read: CV Ananda Bose appointed West Bengal Governor\n\n-He joined the BJP before the 2019 general elections, and was asked by the union labour ministry to prepare an action plan for welfare of migrant workers during the COVID-19 crisis times.\n\n-Bose last served as an administrator at the National Museum in New Delhi before superannuating in 2011.\n\n-As Director General of National Museum, Bose had headed the Supreme Court-appointed committee asked to conduct an inventory of the treasures of Sree Padmanabhaswamy temple, one of the wealthiest shrines in the world, in Kerala’s Thiruvananthapuram.\n\n-He has been the district collector of Quilon district (now Kollam) in Kerala.\n\n-Bose also served as Principal Secretary to the late Congress veteran K Karunakaran during his term as Kerala Chief Minister, and as additional secretary in the Ministry of Agriculture.\n\nAlso Read: West Bengal seeks faster release of Central funds\n\n-An orator, the new Governor has addressed many prestigious global events, including the United Nations General Assembly.\n\n-Not just an orator, Bose is a writer too, and has brought out 350 publications including 45 books in English, Malayalam and Hindi consisting of novels, short stories, poems and essays.\n\n(With inputs from PTI)"}, {"url": "https://starsunfolded.com/c-v-ananda-bose/", "page_content": "Profession(s) Politician, Former Civil Servant\n\nFamous for Being appointed as the twenty-second governor of West Bengal\n\nPhysical Stats & More\n\nHeight (approx.) in centimeters- 167 cm\n\nin meters- 1.67 m\n\nin feet & inches- 5’ 6”\n\nEye Colour Black\n\nHair Colour Black (semi-bald)\n\nPolitics\n\nPolitical Party Bharatiya Janata Party\n\n\n\n\n\nNote: He joined the Bharatiya Janata Party in 2019.\n\nCivil Service\n\nService Indian Administrative Service (IAS)\n\nBatch 1977\n\nCadre Kerala\n\nRetirement 20 September 2011\n\nMajor Designation(s) • Assistant Collector, Kasargod (1 July 1979- 1 June 1980)\n\n• Sub Collector, Kasargod (1 June 1980- 1 October 1981)\n\n• Joint General Manager in Finance Department (1 October 1981- 1 September 1982)\n\n• Deputy Secretary in Planning Department (1 September 1982- 1 January 1984)\n\n• Deputy Secretary in Welfare Department (1 January 1984- 1 April 1985)\n\n• District Collector of Kollam (1 April 1985- 1 July 1987)\n\n• Managing Director (Industries) (1 July 1987- 1 January 1988)\n\n• Secretary in Revenue Department (1 January 1988- 1 July 1990)\n\n• Secretary to Chief Minister in General Administration Department (1 March 1991- 1 March 1995)\n\n• Secretary to Chief Minister in Home Department (1 July 1991- 1 March 1995)\n\n• Director of Housing & Urban Dev Department and Kerala State Nirmithi Kendra (1 March 1995- 1 March 1999)\n\n• Secretary of Kerala Labour Department (1 March 1999- 1 October 2001)\n\n• Chairman & Managing Director of Kerala State Transport Corporation (1 October 2001- 5 January 2002)\n\n• Secretary of Administrative Reforms and General Administration (1 August 2002- 26 September 2002)\n\n• Secretary of Parliamentary Affairs (26 September 2002- 29 November 2002)\n\n• Secretary of Youth Affairs (29 November 2002- 16 January 2003)\n\n• Secretary of SC/ST Welfare (16 January 2003- 16 July 2003)\n\n• Secretary of Administrative Reforms (6 March 2003- 16 July 2003)\n\n• Principal Secretary of Higher Education Department (16 July 2003- 14 June 2004)\n\n• Principal Secretary of Forest & Wild Life Department of Thiruvananthapuram (17 September 2004- 1 April 2005)\n\n• Joint Secretary of Atomic Energy (Mumbai City) (1 April 2005- 12 January 2008)\n\n• Additional Secretary of Agriculture & Cooperation (12 January 2008- 14 September 2009)\n\n• Managing Director of Agriculture & Cooperation, NAFED, New Delhi (14 September 2009- 21 September 2010)\n\n• Administrator (Additional Secretary Equivalent) of Culture Affairs of National Museum (22 September 2010- 14 January 2011)\n\n• Administrator (Secretary Equivalent) of Culture Affairs of National Museum (1 February 2011- 20 September 2011)\n\nAwards, Honours, Achievements • National Special Habitat Award instituted by the Government of India and HUDCO for outstanding contributions to Housing in India (1989)\n\n\n\n• Jawaharlal Nehru Fellowship awarded by Jawaharlal Nehru Memorial Fund, New Delhi, for Habitat Management (1994)\n\n• Finalist of the World Habitat Awards (1994)\n\n• UN-Habitat Global Best Practice for Building Centre Movement (1996)\n\n• Diwaliben Mohanlal Mehta Award Instituted by Diwaliben Mehta Charitable Trust (1996)\n\n• Dr. Pam Davar Award Instituted by Siri Ram Washeshran Devi Bhatia Memorial Charitable Trust (1997)\n\n• Gold Medal by Management Leadership Awards (TMA) (1997)\n\n• Akshaya Award for outstanding contributions in promoting traditional architecture (Vastu) and heritage (1998)\n\n• Overseas Literary Critics Awards (1999)\n\n• Cities Asia Urban Green Management Excellence Award (2001)\n\n• Bremen Partnership Award for efficient use of Natural Resources (2001)\n\n• UN-Habitat Global Best Practice for GNN (Sustainable Habitat Development) (2002)\n\n• Overseas Literary Critics Awards (2017)\n\n• International Book Fair Awards (Sustainable Habitat Development) (2017)\n\n• Lion Centennial Malia Jones Award (2018)\n\n• Swathi Pratibha Puraskar (2018)\n\n• Rajiv Gandhi National Award for Excellence in Management\n\n• UNCHS – Awards for Excellence – Good Practice selection for transparent governance\n\n• United Nations Global Best Practice\n\n• Singapore Government Award for Urban Green Management Excellence\n\n• First-ever Fellow of the Lal Bahadur Shastri National Academy of Administration, Mussoorie\n\nPersonal Life\n\nDate of Birth 2 January 1951 (Tuesday)\n\nAge (as of 2023) 72 Years\n\nBirthplace Mannanam, Kottayam, Kerala\n\nZodiac sign Capricorn\n\nNationality Indian\n\nHometown Mannanam, Kottayam, Kerala\n\nCollege/University • Kuriakose Elias College, Mannanam\n\n• St. Berchmans College, Changanassery\n\n• Ph. D. in Housing and Environment\n\nEducational Qualification(s) • Graduation in English from Kuriakose Elias College, Mannanam\n\n• Post-graduation in English from St. Berchmans College, Changanassery\n\n• Ph. D. in Housing and Environment from Birla Institute of Technology and Science, Pilani\n\nEthnicity Malayali\n\nRelationships & More\n\nMarital Status Married\n\nFamily\n\nWife/Spouse L S Lakshmi (manages her family-owned plantation)\n\n\n\nChildren Son- A Vasudev Bose (pursuing an acting course at Stella Adler acting studio in Los Angeles as of 2022)\n\n\n\nDaughter- Nanditha Bose (died in 2017 due to cancer)\n\nParents Father- P K Vasudevan Pillai (Nair) (freedom fighter)\n\nMother- C Padmavathy Amma (former government official)\n\n\n\nSiblings Brother(s)- Er. C V Venugopalan Nair, Prof. C V Mohan Bose, Er. C V Sundara Bose, Adv. C V Sukumar Bose\n\nSister(s)- Prof. Omana Kunjamma, C V Komala Bose, C V Indira Bose\n\nMoney Factor"}, {"url": "https://drcvanandabose.com/biography/", "page_content": "Dr. Bose has been the recipient of thirty three (33) International and National awards for his outstanding contributions in different fields. In recognition of his pioneering efforts in the field of housing, United Nations has selected his initiatives as ‘Global Best Practice’ four times. Govt. of India awarded him the National (Special) Habitat award.\n\nHe was the head of the prestigious Supreme Court Committee on the treasures of ‘Sree Padmanabhaswamy Temple’ Kerala. An internationally renowned orator, Dr. Bose has addressed many prestigious global fora, including the United Nations General Assembly. Dr. Bose has won more than one hundred (100) prizes, including fifteen (15) gold medals, during his University days. He was the best speaker of the Kerala University three consecutive years and topped in the debates in the IAS training academy, Mussoorie.\n\nDr. Ananda Bose was Chairman of the working group which prepared the development agenda for Kerala presented to the Prime Minister of India, Sri. Narendra Modi. Dr. Bose’s concept of ‘affordable housing for all Indians’ is reflected in the national project to provide houses for all. Dr. Ananda Bose’s motivational speeches and inspirational writings have received global recognition and acclaim.\n\nSince his superannuation from IAS in 2011, Dr. Bose has been devoting his time and efforts in upholding India's heritage, nationalism in his writings, lectures and media interviews. His efforts at social integration and mainstreaming of minorities has made perceptible impact in society. Described by Kerala Government as ‘Lord of Ideas’ and former Prime minister Dr. Manmohan Singh as ‘inspired civil servant’, Dr. Bose was addressed by Prime Minister Narendra Modi as ‘Man of Ideas’. Known as the ' make over man' of the service, Dr Bose was sent to cleanse many corruption ridden organisations in the government.\n\nSon of the freedom fighter, late Sri P.K Vasudevan Nair and Smt. C. Padmavathy Amma, former govt of India official, Dr. Bose was born in Mannanam , Kottayam Kerala on 2/1/1951 . Married to Smt L.S Lakshmi, managing her own plantation, Dr Bose has A. Vasudev Bose (pursuing acting at Stella Adler acting studio, Los Angeles ) as his son and Advaith Nair, as grandson.\n\nDr. Ananda Bose holds a Ph.D from BITS Pilani and M.A in English Language and Literature from Kerala University."}, {"url": "https://indianexpress.com/article/india/kerala/kerala-bjp-report-hawala-allegation-ananda-bose-7359609/", "page_content": "A report on Kerala BJP, which is under the hawala allegation cloud, has been submitted to the “competent authority”, said retired civil servant C V Ananda Bose. Bose’s confirmation on the existence of a report on the state of affairs in Kerala unit of the BJP comes a day after the party officially denied it.\n\n“The party has not asked for a report. I have given my views to the competent authority who sought it. Nothing less, nothing more,” Bose told The Indian Express.\n\nOn June 7, The Indian Express had reported that Prime Minister Narendra Modi had asked three former bureaucrats–Bose, Jacob Thomas and E Sreedharan–to submit a report after talking to various leaders and candidates on funds sent from the central BJP to the state unit ahead of the just-concluded elections. At least one of them had confirmed to The Indian Express that the report has been submitted."}, {"url": "https://zeenews.india.com/india/cv-ananda-bose-appointed-governor-of-west-bengal-2536816.html", "page_content": "New Delhi: C V Ananda Bose was on Thursday (November 17, 2022) appointed the regular Governor of West Bengal, a communique from the Rashtrapati Bhavan said. His appointment will take effect on the date he assumes charge of his office, it added.\n\n\"The President of India is pleased to appoint Dr C V Ananda Bose as regular Governor of West Bengal,\" the communique said.\n\nManipur Governor La Ganesan has been holding the additional charge of West Bengal since July this year after incumbent Jagdeep Dhankhar was nominated as the vice presidential candidate by the BJP-led NDA.\n\nCV Ananda Bose is a former Bureaucrat\n\nBorn in Kerala's Kottayam District on January 2, 1951, CV Ananda Bose is a former Bureaucrat who retired from the Indian Administrative service at the rank of Chief Secretary (Secretary to Govt. of India). He has done his Ph.D. from BITS Pilani and MA in English Language and Literature from Kerala University.\n\nHe has also been the district collector of Quilon district (now Kollam) in Kerala.\n\nA 1977 batch (retired) IAS officer of Kerala cadre, Bose last served as an administrator in the National Museum in Kolkata before superannuating in 2011.\n\nMeanwhile, the Trinamool Congress hoped that the West Bengal government and the Raj Bhawan would share cordial relations after CV Ananda Bose was appointed as the governor of the state.\n\n\n\n\"If he works within the Constitution's limits, the people of the state will welcome him. We hoped that the state government and the Raj Bhawan would share cordial relations,\" senior TMC MP Sougata Roy said.\n\nPrior to his election as the Vice President of India, Jagdeep Dhankhar was the governor of the state for nearly three years and had engaged in tussles with the Mamata Banerjee-led government over several issues, including the law and order situation, in the state."}, {"url": "https://www.thehindu.com/news/cities/kolkata/cv-ananda-bose-appointed-west-bengal-governor/article66150198.ece", "page_content": "November 17, 2022 09:31 pm | Updated 10:27 pm IST - New Delhi\n\nFormer bureaucrat C. V. Ananda Bose was on Thursday appointed the Governor of West Bengal, a communique from the Rashtrapati Bhavan said.\n\nManipur Governor La Ganesan had been holding the additional charge of West Bengal since July, when Jagdeep Dhankhar resigned to contest the Vice Presidential polls.\n\n“The President of India is pleased to appoint Dr C V Ananda Bose as regular Governor of West Bengal. The above appointment will take effect from the date he assumes charge of his office,” the communique said.\n\nMr. Ananda Bose is a 1977-batch former officer of the Indian Administrative Services who has served as the Secretary of Government of India and Chief Secretary to State governments as well as University Vice-Chancellor.\n\nHe is known for his innovative ideas in the field of good governance, and the United Nations has selected his initiatives ‘Global Best Practice’ four times. A prolific writer, he has published 32 books in English, Hindi, and Malayalam across different genres including novels, short stories and poems."}, {"url": "https://www.livemint.com/news/india/5-things-to-know-about-cv-ananda-bose-the-new-west-bengal-governor-11668701500286.html", "page_content": "Former Indian Administrative Services (IAS) officer C V Ananda Bose was on Thursday appointed the Governor of West Bengal, a communique from the Rashtrapati Bhavan said.\n\nThe official statement further noted that Governor Bose's appointment will take effect on the date he assumes charge of his office. \"The President of India is pleased to appoint Dr C V Ananda Bose as regular Governor of West Bengal,\" the communique said.\n\nIt is interesting to note that Bose has worked as District Collector, and Principal Secretary and Additional Chief Secretary in various ministries such as Education, Forest and Environment, Labour, and General Administration.\n\nFurther, Bose who joined as IAS in 1977, has also represented India in the European Council for Nuclear Research (CERN), Geneva and the International Fusion Energy Organisation, ITER, France. He was Chairman of the Atomic Energy Education Society.\n\nThe United Nations has also selected Bose's initiatives as 'Global Best Practice' four times. Government of India awarded him the National (Special) Habitat award.\n\nManipur Governor La Ganesan has been holding the additional charge of West Bengal since July, when former Governor Jagdeep Dhankar quit to contest the election for the post of Vice President of India in July.\n\nHere are 5 facts about the newly appointed Governor of West Bengal\n\n-Recipient of the Jawaharlal Nehru Fellowship, Bose is also Fellow of the Lal Bahadur Shastri National Academy of Administration, Mussoorie\n\n-The 71 year old former civil servant is also a housing expert, writer and orator. Further he has held the rank of Secretary to Government of India, Chief Secretary, and University Vice Chancellor\n\n-Bose has published 32 books in several languages including English, Malayalam, and Hindi. He has published novels, short stories, poems, and essays\n\n-CV Ananda Bose is the Chairman of the Habitat Alliance, in consultative status with UN and was member of the UN Habitat Governing Council.\n\n-Bose was the Head of the Supreme Court Committee on the treasures of 'Sree Padmanabhaswamy Temple'"}]}