{"Anthony Dimond was born in New York City.": [{"url": "https://kids.britannica.com/students/article/Anthony-Joseph-Dimond/311018", "page_content": "Harris and Ewing Collection/Library of Congress, Washington, D.C. (digital file no. LC-DIG-hec-28851)\n\n(1881–1953). American lawyer and political leader Anthony Joseph Dimond was a champion of Alaskan statehood. He also stressed the importance of the Alaska Highway, which, when completed, was the only land route to connect Alaska with the mainland United States (through Canada).\n\nDimond was born on November 30, 1881, in Palatine Bridge, New York. After teaching from 1900 to 1903, he moved to Alaska in 1904 to work as a prospector and miner. Dimond also studied law, and in 1913 he was admitted to the bar and began practicing in Valdez, Alaska. Later that year he became the U.S. commissioner at Chisana, Alaska, where he worked with gold miners and their claims. In 1917 Dimond became the special assistant to the U.S. attorney in Valdez.\n\nDimond served as mayor of Valdez for nine years, from 1920 to 1922 and from 1925 to 1932. From 1923 to 1926 and from 1929 to 1932 he was a member of the Alaska Territorial Senate. In 1933 Dimond was elected as the Alaskan representative to the U.S. Congress, and he was reelected five successive times. Although he worked tirelessly for Alaskan statehood, the feat would not be accomplished until 1959, after his death. Dimond left Congress in 1945 to become a district court judge in Anchorage, Alaska. He died there on May 28, 1953."}, {"url": "https://www.asdk12.org/domain/3908", "page_content": "Dimond High School was named for Anthony Joseph Dimond, an Alaskan pioneer legislator and federal judge who promoted statehood for the young territory.\n\nDimond was born in New York on November 30, 1881. Dimond left a teaching position in New York to emigrate to Alaska in 1905 and spent the next 48 years protecting and defending the land he loved. In 1913, he became an attorney and later that year was appointed U.S. Commissioner at Chisana, recording gold miners’ claims and settling their disputes. Later he became Special Assistant to the U.S. Attorney in Valdez. Motivated by the goal of statehood for this Last Frontier, Dimond entered politics and served four terms in the Alaska Territorial Legislature and as mayor of Valdez for nearly a decade. He worked hard to unify the Territory’s interests and became Alaska’s sole delegate to the Congress of the United States from 1933-1945. His first acts were to introduce a Statehood Bill, which was ignored, to urge construction of the Alaska Highway, and to advise that fortifications be built in Fairbanks and Anchorage.\n\nDimond ended forty years of public service as a Federal Judge for the Third Judicial District of Alaska. In May of 1953, Judge Dimond suffered a heart attack and died a week later at Providence Hospital in Anchorage. November 30, his birthdate, was designated as A.J. Dimond Day to commemorate the distinguished service of the Alaskan Statesman."}, {"url": "https://www.liquisearch.com/anthony_dimond", "page_content": "Anthony Joseph Dimond (November 30, 1881 – May 28, 1953) was an American Democratic Party politician who was the Alaska Territory Delegate in the United States House of Representatives for many years (1933–1945). Dimond was also an early champion of Alaska statehood.\n\nDimond was born in New York and attended Catholic schools, taught school in Montgomery County, New York (1900–1903) and was a prospector/miner in Alaska (1904–1912) before studying law and beginning practice in Valdez (1913).\n\nDimond's political experience includes: US Commissioner in Chisana, Alaska (1913–1914); Special Assistant US Attorney for the 3rd Judicial Division of Alaska in Valdez (1917); Mayor of Valdez (1920–1922, 1925–1932); Alaska Territorial Senate (1923–1926, 1929–1932); and District Judge for the 3rd Division of Alaska (1945–1953). He also served as a Delegate to the Democratic National Convention in 1936 and 1940. He died on May 28, 1953 in Anchorage.\n\nA Roman Catholic, Dimond was a member of organizations such as the Elks, Moose and Eagles. His secretary, Bob Bartlett, eventually became a United States Senator from Alaska.\n\nToday, November 30 is celebrated by the State of Alaska as \"Anthony Dimond Day.\" In Anchorage, A. J. Dimond High School and Dimond Blvd, a major thoroughfare, are named after him.\n\nIn 1940, when President Franklin D. Roosevelt was considering making Alaska an international Jewish homeland, Dimond was the main force behind defeating the effort. Dimond High School is named in his honor."}, {"url": "https://peoplepill.com/people/anthony-dimond/", "page_content": "Anthony Joseph \"Tony\" Dimond (November 30, 1881 – May 28, 1953) was an American Democratic Party politician who was the Alaska Territory Delegate in the United States House of Representatives for many years (1933–1945). Dimond was also an early champion of Alaska statehood.\n\nDimond was born in Palatine Bridge, Montgomery County, New York and attended Catholic schools, taught school in Montgomery County (1900–1903), and was a prospector/miner in Alaska (1905–1912) before studying law and beginning practice in Valdez (1913).\n\nDimond's political experience includes: US Commissioner in Chisana, Alaska (1913–1914); Special Assistant US Attorney for the 3rd Judicial Division of Alaska in Valdez (1917); Mayor of Valdez (1920–1922, 1925–1932); Alaska Territorial Senate (1923–1926, 1929–1932); and District Judge for the 3rd Division of Alaska (1945–1953). He also served as a Delegate to the Democratic National Convention in 1936 and 1940. He died on May 28, 1953 in Anchorage.\n\nA Roman Catholic, Dimond was a member of organizations such as the Elks, Moose and Eagles. His secretary, Bob Bartlett, eventually became a United States Senator from Alaska.\n\nToday, November 30 is celebrated by the State of Alaska as \"Anthony Dimond Day.\" In Anchorage, A. J. Dimond High School and Dimond Boulevard, a major thoroughfare, are named after him.\n\nIn 1940, when President Franklin D. Roosevelt was considering making Alaska an international Jewish homeland, Dimond was the main force behind defeating the effort."}, {"url": "https://prabook.com/web/anthony.dimond/2591103", "page_content": "Anthony Dimond\n\njudge lawyer representative teacher\n\nNovember 30, 1881 (age 71) Palatine Bridge, Montgomery County, New York and attended Catholic\n\nDimond\"s political experience includes: United States Commissioner in Chisana, Alaska (1913–1914). Special Assistant United States Attorney for the 3rd Judicial Division of Alaska in Valdez (1917). Mayor of Valdez (1920–1922, 1925–1932). Alaska Territorial Senate (1923–1926, 1929–1932). And District Judge for the 3rd Division of Alaska (1945–1953). He also served as a Delegate to the Democratic National Convention in 1936 and 1940. He died on May 28, 1953 in Anchorage. His secretary, Bob Bartlett, eventually became a United States Senator from Alaska. Today, November 30 is celebrated by the State of Alaska as \"Anthony Dimond Day.\" In Anchorage, A. J. Dimond High School and Dimond Boulevard, a major thoroughfare, are named after him. In 1940, when President Franklin Doctorate. Roosevelt was considering making Alaska an international Jewish homeland, Dimond was the main force behind defeating the effort."}, {"url": "https://www.findagrave.com/memorial/7366335/anthony-joseph-dimond", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://en-academic.com/dic.nsf/enwiki/943085", "page_content": "Anthony Joseph Dimond ( November 30 , 1881 – May 28 , 1953 ) was an American Democratic Party politician who was the Alaska Territory Delegate in the United States House of Representatives for many years (1933-1945). Dimond was also an early champion of Alaska statehood.\n\nDimond was born in New York and attended Catholic schools, taught school in Montgomery County, New York (1900-1903) and was a prospector/miner in Alaska (1904-1912) before studying law and beginning practice in Valdez (1913).\n\nDimond's political experience includes: US Commissioner in Chisana, Alaska (1913-1914); Special Assistant US Attorney for the 3rd Judicial Division of Alaska in Valdez (1917); Mayor of Valdez (1920-1922, 1925-1932); Alaska Territorial Senate (1923–1926, 1929–1932); and District Judge for the 3rd Division of Alaska (1945–1953). He also served as a Delegate to the Democratic National Convention in 1936 and 1940. He died on May 28 , 1953 in Anchorage.\n\nA Roman Catholic , Dimond was a member of organizations such as the Elks, Moose and Eagles. His secretary, Bob Bartlett , eventually became a United States Senator from Alaska.\n\nToday, November 30 is celebrated by the State of Alaska as \"Anthony Dimond Day.\" In Anchorage, A. J. Dimond High School and Dimond Blvd, a major thoroughfare, are named after him.\n\nIn 1940, when President Franklin D. Roosevelt was considering making Alaska an international Jewish homeland, Dimond was the main force behind defeating the effort. Some Alaskan papers have attributed this to anti-Semitism on the part of Dimond and others, although the charge was challenged by historians who claimed that Dimond was mostly concerned about the finances.\n\nSee also\n\n* Dimond Center\n\n*\" The Yiddish Policemen's Union \"\n\nExternal links\n\n* CongBio|D000353\n\n* [ http://www.findagrave.com/cgi-bin/fg.cgi?page=gr&GRid=7366335&pt=Anthony%20Dimond Gravesite of Anthony Dimond ]\n\n* [ http://www.adn.com/news/alaska/story/8828757p-8729537c.html In the context of the times, Jews from Germany weren't welcome ] , Tom Kizzia, \"Anchorage Daily News\", 2007-04-26."}, {"url": "https://history.house.gov/People/Detail/12264", "page_content": "University of Alaska-Fairbanks\n\nElmer E. Rasmuson Library Alaska and Polar Regions Department\n\nFairbanks, AK\n\nPapers: 1904-1953, 33 cubic feet. The Anthony J. Dimond Papers consist of legislative, political and personal files relating to his work from 1904 until his death. The bulk of the material relates directly to his service as Territorial Delegate to Congress. His activities as federal court judge are related in the personal files. A finding aid is available in the repository.\n\nPapers: In Donohoe-Ostrander-Dimond papers, 1903-1933. ca. 15 feet. Law firm records. Finding aid in repository. Restricted.\n\nOral History: Mary Lee Council and Vide Bartlett. April 23, 1975. Council worked in Bartlett's office and discusses issues affecting Alaska.\n\nOral History: Sister Marie Theresa Dimond, daughter. April 20, 1975. Discusses her father's political career, Bob Bartlett, and growing up in Valdez, Alaska.\n\nOral History: Dorothy Haaland. July 30, 1981. Discusses her association with Dimond and activities in statehood movement. Summary and log available.\n\nOral History: Bruce B. Kendall. July 23, 1981. Discusses his activities in Republican Party during statehood struggle of 1940's and 1950's. Summary and log available.\n\nOral History: Katherine D. Nordale. August 10, 1981. Discusses government and public policy before and after statehood. Summary and log available."}, {"url": "https://akhistory.lpsd.com/articles/article.php?artID=221/", "page_content": "Governing Alaska Campaign for Statehood A New Era in Alaska\n\nIn the United States Capitol building in Washington, D.C., every state is allowed to display statues of two outstanding citizens. The National Statuary Hall collection includes presidents, vice presidents, signers of the Declaration of Independence, framers of the United States Constitution and other distinguished Americans. The two Alaskans cast in bronze are Sen. E.L. \"Bob\" Bartlett and Sen. Ernest Gruening. Before they served as Alaska's first United States Senators, Bartlett and Gruening were the powerful one-two punch of the Alaska statehood fight in the 1940s and 1950s. Historian Claus Naske has written that while Bartlett and Gruening did not invent the statehood movement, they \"gave it a vitality and dynamism which it had not possessed before.\" Although Gruening and Bartlett shared a commitment to statehood and membership in the Democratic party, their personalities couldn't have been more different. Bartlett served as Alaska's non-voting delegate to Congress for 14 years before statehood and Gruening worked as territorial governor from 1939-53. A. Robert Smith, a newspaper reporter who wrote about Congress for 25 years said, that Bartlett was \"Mr. Nice Guy in a body overpopulated with SOBs.\" Gruening was a brilliant politician and writer who had a knack of making his opponents, and sometimes even his friends uncomfortable. As the non-voting Alaska delegate, Bartlett had no votes to trade, so he concentrated on winning friends and influencing people. A former miner and Fairbanks newspaperman, Bartlett earned the respect of Alaskans, who knew him as \"Bob,\" a name he picked up as a child when his 4-year-old sister refused to call him by his real name \"Edward.\" Bartlett represented Alaska in Washington, D.C. for the last 25 years of his life, first as a delegate and then for nine years as a senator. Elected seven times as delegate from 1944-59, he devoted his energies to persuading members of Congress that Alaskans deserved better than the \"second-class citizenship\" of territorial rule. Bartlett became a convert to the statehood campaign after former Delegate Anthony Dimond advised that it was the only practical way to proceed, because Congress would probably fight any effort to seek piecemeal improvements in the First Organic Act.\n\nAlaska Capitol, Juneau, ca. 1931\n\nBird's-eye view of the Federal and Territorial Building in Juneau, from the south. Bird's-eye view of the Federal and Territorial Building in Juneau, from the south. After completing 13 years as governor, Gruening wrote a book titled \"The State of Alaska,\" which was published five years before statehood. He used the book as a way to publicize what he thought of as federal neglect of the territory. Gruening's awareness of Alaska's situation really started when President Franklin D. Roosevelt appointed him as governor in 1939, two days after Hitler attacked Poland and began World War II. In Alaska, Gruening soon found himself at odds with the canned salmon industry, the shipping industry and the mining industry over new taxes. He wanted them. They didn't. Describing revenues to the territory from Alaska's resources as \"virtually negligible,\" he spent the next ten years fighting for change. \"The wealth of Alaska was being drained off and next to nothing was staying there for its needs,\" he wrote later. Gruening complained that the old tax system benefited special interests and harmed the average Alaskan. He said the dividends from the huge Kennecott mine, which had been abandoned in 1938 after producing $200 million in copper, had enriched \"many individuals who never saw Alaska and had no thought of ever coming here or doing anything for the Territory. . .\" Although mining and fishing topped the list of industries, by 1947 more money poured into the treasury from alcohol than anything else. \"At that time we had no financial structure that was worthy of the name,\" Mildred Hermann, a Juneau attorney, recalled. \"We financed our government on the basis of how the red salmon ran and how much liquor people drank and that was almost the total source of our revenues. . ..\" Starting in 1941, Gruening introduced measures for a modern tax system. The legislature though refused to act. The low point came in 1947, when lawmakers created a fiscal crisis, authorizing more than $10 million in spending and only $6.3 million in income. The money ran out that fall. In the crisis that followed, the University of Alaska kept going only because members of the Board of Regents, UA President Charles Bunnell and business leaders offered emergency loans to keep the doors open. Gruening wrote in his autobiography that Alaska voters responded by \"throwing the rascals out\" in the 1948 election. \"Alaskans realized how an effectively organized minority in the legislature had betrayed their interests and had left the territory in a deplorable state,\" he said. With the change in Juneau, a comprehensive new tax system won approval in 1949, an act that some viewed as a prerequisite to show that Alaska was ready for statehood. For Bartlett and Gruening, another decade would pass before they achieved their common goal. Links: Biographies of E.L. \"Bob\" Bartlett\n\nBiographical Directory of the United States Congress\n\nBiographies of Ernest Gruening\n\nBiographical Directory of the United States Congress\n\nInformation about Statuary Hall\n\nNational Statuary Hall\n\nSelling Statehood In his 1946 State of the Union address President Harry S. Truman said that statehood should be granted as soon as the government knew where the people of Alaska stood on the issue. He had an answer soon enough. In an advisory vote that fall, Alaskans voted 9,630 to 6,822 in favor of joining the union. George Sundborg, a journalist who had made a pro-statehood study, said the size of the negative vote was due to the \"sourpuss branch of the sourdough family.\" Many Alaskans looked for more support from the Truman administration and Congress after the vote, but resistance remained. Bartlett introduced one of many statehood bills in 1947. In one hearing, the head of Alaska Airlines testified about pressure by the salmon industry to keep quiet, or else he would lose their business.\n\nAK Governor Mike Stepovich and Congressional Advocates for Statehood In 1949, the legislature approved creation of the Alaska Statehood Committee, an 11-member group headed by Anchorage Times Publisher Bob Atwood. The Committee pushed the statehood effort through education and lobbying. The campaign failed to make much national headway for three years though, because of the Korean War. Following the war, Sen. Hugh Butler of Nebraska, a statehood opponent, announced that his committee would hold hearings in Alaska. He said he didn't want to hear from \"just a few aspiring politicians who want to be senators and representatives, but from the \"little people\" of Alaska. A group of supporters that formed with the name \"Little Men For Statehood\" turned out in support of statehood at Butler's 1953 hearings. Signs popped up in Anchorage store windows that said, \"I'm a Little Man Who Wants Statehood.\" Women agreed. Margaret Rutledge of Anchorage told a story of how she had been on her way to the inauguration of President Dwight D. Eisenhower when she was reminded of the second-class status of Alaskans. At the Seattle airport she had to go through immigration procedures, which she said was humiliating. Before ending her testimony in tears, Rutledge told the senators that a \"degrading influence had robbed me of the thing I value most--my birthright as an American.\" The statehood movement developed strong support in the mid and late 1950s among average Alaskans, who signed onto grassroots organizations such as \"Operation Statehood\" and the \"John Q. Citizen\" campaign. National politics entered into the picture because Republicans feared that Alaska would send Democrats to Congress, which could tip the scales of power. The Republican Eisenhower administration supported statehood for Hawaii, which was expected to be favorable to the GOP, but delayed on admitting Alaska. Links: Speech by President Truman in which he gave tentative support to statehood.\n\n\n\nPresident Truman's 1948 message to Congress about Alaska.\n\n\n\n1950 letter by President Truman to Sen. Mahoney about statehood\n\n\n\nA brief history of Alaska statehood\n\nPublic Papers of the Presidents\n\nPresident Eisenhower's comments in 1955 about why he wanted to delay statehood.\n\nPresident Eisenhower's misgivings about statehood in 1956 The Canned Salmon Lobbyist Because he had once been a commissioner, people often referred to him as \"Judge\" Arnold. Because of his work for the canned salmon industry, his opponents dubbed him \"Fish\" Arnold. To his friends he was \"Bill.\" By any name, Winton C. Arnold was perhaps the most influential lobbyist in Alaska in the 1940s and 1950s. Arnold represented the canned salmon industry in Juneau during those years, and was a strong voice at Congressional hearings and in Juneau. John Butrovich, a long time territorial and state senator from Fairbanks, once told a reporter that Arnold was exceptionally capable. \"You couldn't be that good and not be smart,\" Butrovich said. \"He was the best I saw, in my time, and I was there for 30 years. And I'm looking at it from the other side.\" Butrovich opposed Arnold's work to continue the advantages of the canned salmon industry - including big tax breaks - in Alaska. Many said Arnold stopped andy tax reform legislation for a decade in the territorial Legislature. He became the most effective and articulate opponent of Alaska statehood. Arnold typically did not say he opposed statehood. . He made a habit, though of pointing out obstacles, such as transportation problems, and the need to settle Alaska Native land claims. He also said Alaska could not afford to become a state because of the additional burdens that it would place on its citizens. Since less than 1% of Alaska had been surveyed, it would take thousands of years for Alaska to acquire its land if a traditional land grant system was used with the granting of statehood, he said at one hearing. Alaska territorial delegate E.L. \"Bob\" Bartlett described Arnold as an opponent of every progressive proposal for Alaska and \"a smooth operator­--intelligent and with a pleasing personality.\" He hosted private lunches for senators, and made elaborate presentations to show the economic damage that statehood would cause Alaska. Mary Lee Council, Bartlett's administrative assistant, said that by explaining the problems with statehood bills before Congress in an attempt to stop statehood, Arnold's complaints forced Congress to resolve those issues. In that way, Arnold's stalling tactics improved the chances that the state would have the resources it needed for survival. The provisions eventually adopted by Congress gave the new state more than five times as much land as had been proposed in some of the early proposals. Links: Women in Alaska's History - Elizabeth Peratrovch\n\n<< Previous Page Next Page >> Federal Influence in the Territory The Constitutional Convention"}, {"url": "https://www.govtrack.us/congress/members/anthony_dimond/403471", "page_content": "We’re looking to learn more about who uses GovTrack and what features you find helpful or think could be improved. If you can, please take a few minutes to help us improve GovTrack for users like you.\n\nStart by telling us more about yourself:\n\nWe hope to make GovTrack more useful to policy professionals like you. Please sign up for our advisory group to be a part of making GovTrack a better tool for what you do.\n\nYoung Americans have historically been the least involved in politics, despite the huge consequences policies can have on them. By joining our advisory group, you can help us make GovTrack more useful and engaging to young voters like you.\n\nOur mission is to empower every American with the tools to understand and impact Congress. We hope that with your input we can make GovTrack more accessible to minority and disadvantaged communities who we may currently struggle to reach. Please join our advisory group to let us know what more we can do.\n\nWe love educating Americans about how their government works too! Please help us make GovTrack better address the needs of educators by joining our advisory group.\n\nWould you like to join our advisory group to work with us on the future of GovTrack?\n\nEmail address where we can reach you:"}], "Anthony Dimond moved to California in 1868.": [{"url": "https://kids.britannica.com/students/article/Anthony-Joseph-Dimond/311018", "page_content": "Harris and Ewing Collection/Library of Congress, Washington, D.C. (digital file no. LC-DIG-hec-28851)\n\n(1881–1953). American lawyer and political leader Anthony Joseph Dimond was a champion of Alaskan statehood. He also stressed the importance of the Alaska Highway, which, when completed, was the only land route to connect Alaska with the mainland United States (through Canada).\n\nDimond was born on November 30, 1881, in Palatine Bridge, New York. After teaching from 1900 to 1903, he moved to Alaska in 1904 to work as a prospector and miner. Dimond also studied law, and in 1913 he was admitted to the bar and began practicing in Valdez, Alaska. Later that year he became the U.S. commissioner at Chisana, Alaska, where he worked with gold miners and their claims. In 1917 Dimond became the special assistant to the U.S. attorney in Valdez.\n\nDimond served as mayor of Valdez for nine years, from 1920 to 1922 and from 1925 to 1932. From 1923 to 1926 and from 1929 to 1932 he was a member of the Alaska Territorial Senate. In 1933 Dimond was elected as the Alaskan representative to the U.S. Congress, and he was reelected five successive times. Although he worked tirelessly for Alaskan statehood, the feat would not be accomplished until 1959, after his death. Dimond left Congress in 1945 to become a district court judge in Anchorage, Alaska. He died there on May 28, 1953."}, {"url": "https://www.britannica.com/topic/California-Gold-Rush", "page_content": "Travel across the United States with gold miners to explore the dynamics of the California Gold Rush See all videos for this article\n\nCalifornia Gold Rush, rapid influx of fortune seekers in California that began after gold was found at Sutter’s Mill in early 1848 and reached its peak in 1852. According to estimates, more than 300,000 people came to the territory during the Gold Rush.\n\nIn 1848 John Sutter was having a water-powered sawmill built along the American River in Coloma, California, approximately 50 miles (80 km) east of present-day Sacramento. On January 24 his carpenter, James W. Marshall, found flakes of gold in a streambed. Sutter and Marshall agreed to become partners and tried to keep their find a secret. News of the discovery, however, soon spread, and they were besieged by thousands of fortune seekers. (With his property overrun and his goods and livestock stolen or destroyed, Sutter was bankrupt by 1852.) From the East, prospectors sailed around Cape Horn or risked disease hiking across the Isthmus of Panama. The hardiest took the 2,000-mile (3,220-km) overland route, on which cholera proved a far greater killer than the Native Americans. By August 1848, 4,000 gold miners were in the area, and within a year about 80,000 “forty-niners” (as the fortune seekers of 1849 were called) had arrived at the California goldfields. By 1853 their numbers had grown to 250,000. Although it was estimated that some $2 billion in gold was extracted, few of the prospectors struck it rich. The work was hard, prices were high, and living conditions were primitive.\n\nIn what was a typical pattern, the Gold Rush slackened as the most-workable deposits were exhausted and organized capital and machinery replaced the efforts of individual miner-adventurers with more efficient and businesslike operations. Likewise, the lawless and violent mining camps gave way to permanent settlements with organized government and law enforcement. Those settlements that lacked other viable economic activities soon became ghost towns after the gold was exhausted. The California Gold Rush peaked in 1852, and by the end of the decade, it was over.\n\nThe Gold Rush had a profound impact on California, dramatically changing its demographics. Before the discovery of gold, the territory’s population was approximately 160,000, the vast majority of whom were Native Americans. By about 1855, more than 300,000 people had arrived. Most were Americans, though a number of settlers also came from China, Europe, and South America. The massive influx gave rise to numerous cities and towns, with San Francisco gaining particular prominence. The Gold Rush was credited with hastening statehood for California in 1850."}, {"url": "https://localwiki.org/oakland/Hugh_Dimond", "page_content": "Hugh Dimond\n\nfrom SF Call, 1896\n\nHugh Dimond (March 27, 1830 – January 14, 1896) came to California for the Gold Rush and purchased the land that became the Dimond District district in 1867. Originally the Peraltas owned the land, who passed the land via some investors to Henderson Luelling, who planted numerous fruit trees and named the plot Fruit Vale.\n\nDimond was born in County Kerry, Ireland in 1830. At age 14, he and his younger brother Neil made their way to New York in 1844. Lured to California by the Gold Rush, Hugh came via Panama, sailing through the Golden Gate on June 22, 1850. He headed straight to gold country in Mariposa County and got to work. Having made some money mining, he then entered into a partnership with C. D. O'Sullivan and W. F. Cashman and opened a general store. The firm \"made money at a lively rate\". In 1862, they moved to San Francisco, opening O'Sullivan, Cashman & Co., a wholesale liquor business. 2\n\nHe invested some of his profits in real estate, purchasing 267 acres in 1867 in the Oakland foothills along Sausal Creek, an area including the Luelling spread near the cherry orchards and the hay farms. He settled there immediately.\n\n[ In 1876 Hugh Dimond's occupation was listed as 'farmer' and his address was 967 Jackson Street. Was this before he moved to the Fruitvale area? Or was there a Jackson Street in what is now the Dimond? The latter would fit better with the dates above. ]\n\nFamily\n\nWhile in the gold country, Hugh married Jane McGreer (September 7, 1841 – July 30, 1869) whose family lived in Mariposa. They were married October 4, 1860 and had two children, Mary Jane Dimond (April 10, 1862 – April 4, 1864), who died a few weeks after her brother William Hugh Dimond (March 23, 1864 – July 3, 1864) was born; William died a few months later. Tragically, Jane died five years later in San Rafael.\n\nA few years later, Hugh married Ellen Sullivan (? – April, 1877) on October 24, 1872 at St. Mary's Cathedral 6 in San Francisco. At 41, having made his fortune, in 1873 he retired from the liquor business. While the old Luelling house was being enlarged and refurbished for his new family, Hugh and Ellen traveled in Europe. Daughter Ellen \"Nellie\" Sullivan Dimond (August 2, 1874 – October 10, 1951) was born in Switzerland, son Hugh Sullivan Dimond (June, 1875 – ?) in Paris, France, and son Denis Sullivan Dimond (August 10, 1876 – ?) back in Oakland. They moved into their new home in 1877. Sadly, Ellen died shortly afterwards.\n\nNellie never married, but lived with her brothers and their families. Hugh attended St. Mary's College (class of 1894) in Oakland, and was active in athletics there; he married Ellen T. Boland (Dimond) in 1899. Denis married Madeline \"Mandy\" Stirling (Dimond), who was the niece of Frank C. Havens. Although Denis was active at St. Anthony's, they were married at Sacred Heart Church c. January, 1906.\n\nHome\n\nEyewitness accounts say the home was an imposing two-story white wooden structure surrounded by a spacious one-story veranda. Dimond Avenue began as the carriage entrance to the Dimond place, which was situated just beyond the grove of redwood trees in today's Dimond Park. In 1896, the year of Hugh Dimond's death, his son Denis moved some of the adobe bricks from the original Peralta adobe to the area of Dimond Park, and built a studio cottage.\n\nAbout 223 acres of the land was sold to the Pacific Mutual Life Insurance Company in 1905; more was sold to Borax Smith in 1907. By 1910 the last of Hugh and Ellen's children had moved out of Oakland. The main Dimond house was badly damaged in a fire in 1913 1, leaving the adobe cottage. Four years later in 1917, the Dimond family sold the last 12 acres of the property to the city. The cottage was used by the Boy Scouts from 1919 until a fire in 1954.\n\nDeath and Burial\n\nHugh suffered a heart attack during a meeting of the Hibernia Savings and Loan Society. He returned home, then died January 14, 1896 after another heart attack. 2 The funeral was held at St. Anthony's Church in Oakland. Hugh Dimond was buried in Laurel Hill Cemetery in San Francisco (which was eventually moved to Colma along with San Francisco's other cemeteries.) In his will, he left $2,000 in gold coin to his brother Neil (who lived in Wisconsin) and $2,000 to his friend (and surviving executor of the will) Lawrence Cunningham. The rest was divided between his children. His will also specified that he was \"opposed to any ostentation at funerals\" and gave specific instructions. 4 His estate was estimated to be $324,231.17 plus $18,847.12 cash, and including the Dimond property, as well as property in Alameda, San Francisco, Glenn County, and San Mateo County. 5\n\nLinks and References"}, {"url": "https://thetombstonenews.com/the-unsolved-mystery-of-californias-idle-diamond-mine-p1576-84.htm", "page_content": "The \"Cherokee\" Yielded Millions in Gold, but when miners began to find some of the worlds finest diamonds a stranger appeared and the mine was closed forever...\n\n\n\nBy Ben T. Traywick\n\nWorld Renowned Author\n\n\n\nIn the proximity of Round Mountain, a few miles from Chico, lies the ghost town of Cherokee and the remains of the once famous Cherokee Mine.##M(READMORE)##\n\nThrough the now crumbling walls of Cherokee’s old assay office $10,000,000 worth of gold was poured into shiny bars of precious yellow metal and shipped down to Oroville.\n\nAnd here, today, on the side of an extinct Butte County volcano, amid the decaying remains of a Gold Rush Ghost town, lies the only diamond mine in California. It has never yielded up its secrets.\n\nNot only did Cherokee have the distinction of being a real boom town, but it was here the first diamond found in California was discovered.\n\nIn 1866, while cleaning his sluice box at the mouth of the great Cherokee hydraulic wash, Mike Maher discovered a perfect blue diamond. In 1867 William Brandreth found a diamond at Cherokee which cut a stone of one and a third .carats. John Moore found a gem in 1868 that weighed six carats. And yet another miner named Slissman picked up a total of twenty diamonds in the Cherokee placers.\n\nIn the late 1870’s Cherokee was the largest and most famous hydraulic mine in America. In a short period of 25 years, miners grubbed $50,000,000 in raw gold from its vast treasure house, not to mention a sizeable fortune in glittering diamonds.\n\nThe mine in Cherokee was discovered in 1852 by prospectors guided there by Indians who had found gold near what is now called Round Mountain. Actually Cherokee was a rich gold mine, but thru the years of gold mining, approximately 400 ice clear diamonds were found. These gems were of such a quality as to compare with the best stones of Africa and South America.\n\nAt the Cherokee wash, huge nozzles, called monitors, shot high pressure streams of water against the earth, crumbling and washing hundreds of tons of earth an hour through enormous sluice boxes. This method of mining was perfectly adapted for separating the heavier gold from gravel, but it will never be known how many millions in diamonds were washed away with the gravel tailings.\n\nBy the year 1870 the population of Cherokee was roughly 7,000 persons. About this same time, the gravel and mud tailings were fast becoming a real problem. These tailings flowed down to the valley farms covering everything in their wake. Dams were built to hold these tailings, but when the muddy mass built up to capacity, they gave way and allowed their contents to flow downstream, covering fields, crops, and everything else in the area.\n\nAfter the break of a tailing dam, mine representatives would ride through the newly flooded areas, their pockets bulging with $20 gold pieces. At each flooded area they stopped and asked the owner his losses. They paid the named damages in gold—with no argument.\n\nBy 1890 a growing resentment against hydraulic mining appeared. Millions of tons of rock and earth from the huge hydraulic monitors had clogged streams, filled rivers, and covered vast areas of agricultural land. In 1893, pressure exerted on the California Legislature- caused the anti-hydraulic mining law to be passed, thus ending hydraulic mining.\n\nUnder the new mining restrictions the owners felt they could not operate with a desired profit, so in 1906 organized mining completely ceased in Cherokee. When the mine shut down, the town of Cherokee died. Miners and their families moved away, stores and saloons closed, and a new ghost town came into being.\n\nSoon after organized mining ceased, individual miners and prospectors began to drift in and grub through the rocks and bluffs in search of gold. A few diamonds were continually picked up or dug from the blue volcanic clay—enough to keep the legend of diamonds alive.\n\nThen appeared on the scene a man named Cooney, who claimed to have worked in the South African diamond fields. He expressed confidence that the Oroville area abounded in kimberlite, the blue volcanic clay in which diamonds are found. His efforts then were directed toward finding men who would assist him in securing land and beginning diamond mining operations.\n\nIn 1907, Cooney and four other men, Lorbeer, Moss, Christie, and McMullen, formed the United States Diamond Mining Company in Oroville. They secured an option on 40 acres of land and incorporated the company under the laws of Arizona for 2,500.000 shares at one dollar per share. Five blocks of stock were reserved for the five partners and the remainder put up for sale to the citizens of Oroville, Chico, and Marysville.\n\nAdvertisements were issued in local papers in order to obtain subscribers for the stock issue. In a very few days a long list of people had signed to invest their money in purchase of the stock. With the new stockholders’ money Cooney got the mining operations underway. Three shifts were put to work in the mines at eight hours each, late in November of 1908.\n\nThe stockholders held a meeting to organize and elect officers. Cooney was elected president of the company, Henry Vail, a wealthy Oroville dredger-man, was elected vice-president. Lorbeer was named general superintendent, and Christie and Moss were placed en the board of directors.\n\nStock values showed a substantial increase and sales went up in proportion, when in December 1908, a woman, cleaning her Christmas turkey, found a two carat diamond in its craw. This particular bird had been raised in the vicinity of Oroville.\n\nAs the cost of operations increased, the partners ran short of ready cash. From somewhere Cooney came up with the needed funds and accepted a portion of his partners’ stocks in return. Unnoticed by the others, Cooney slowly began to gain control of the company.\n\nOn Saturday, March 27, 1909, Henry Vail, vice-president of the company, washed some disintegrated blue clay taken from the 180 feet level. A small blue, perfectly formed diamond appeared. Two smaller stones were also found in this lump of blue clay.\n\nAbout the time Vail found these three gems a representative of the DeBeers syndicate arrived in Oroville. DeBeers was the greatest producer of diamonds in the world and wanted controlling interest in the United States Diamond Mining Company. Americans were paying DeBeers 40 million dollars a year for diamonds produced from their South African properties; so from an economic viewpoint they could tolerate no competition in America. DeBeer’s syndicate had set aside a fund of 500 million dollars to be used only for obtaining the controlling interest of every new diamond discovery in the world. Their representative attempted to get a man named Sweetman, who was the City Assessor of Chico and a stockholder, to purchase a controlling share of stock, offering him a position with DeBeers and promising to make him a rich man. Sweetman refused because of the mining interests held by friends.\n\nOn May 8, 1909, two miners, working on a drift from the 200 feet level, dug out a big chunk of soft blue material. Their lamps picked up blazing lights in the clay. The miners grabbed all the clay they could hold in their hands and ‘rushed out of the mine. In the sunshine the handfuls of muddy stones reflected the sunlight with a dazzling brilliance. Lorbeer washed the gems clean of mud and found there were more than 100 of them!\n\nLorbeer and the two miners rushed into Oroville shouting, “Diamonds! Real diamonds! We found diamonds!” A large crowd gathered in the street to inspect the newly found diamonds.\n\nCooney had been in Butte, Montana when the strike had been made. When informed of the discovery of the gems, he seemed rather upset over the news. Early Sunday morning, Lorbeer had finished panning the clay brought up by the miners. He rushed to Cooney at the hotel, his hat filled with muddy, greasy, and glistening stones.\n\nOne glance at the stones and Cooney remarked, “These are nothing but rocks.” With that he took the hatful of stones and rushed Lorbeer into the hotel. The two remained inside for over an hour. When they emerged, Cooney said, “Those stones were no good. I threw them away!”\n\nHe and Lorbeer then went down to the Chamber of Commerce to look at the other stones. Cooney carefully examined them and shook his head; he told the crowd that had gathered the stones were poor quality, fit only for industrial use as drill points and cutting tools.\n\nThe following Monday Cooney unexpectedly suspended all operations in the mine. Immediately thereafter he caught the train for San Francisco. He returned two days later accompanied by two strangers. A meeting with his partners was called. At once a fierce argument developed between Moss, McMullen, Christie, and Cooney over the closing of the mine. Lorbeer sided with Cooney, obviously thinking this was his most advantageous move. Moss, McMullen, and Christie were voted out of the directorship and the two strangers voted in. This business completed, the two strangers departed, never to be seen again.\n\nCooney had the mine boarded and barricaded so no one could enter. So far as is known no one has been down inside the mine since the day the two miners came clambering out with their hands full of diamonds.\n\nAlthough Cooney already controlled the company without question, he offered his former partners $2500 each for the stocks they still retained. Already panicky, they sold their holdings without question. Two other investors in San Francisco, who held large blocks of stock, became suspicious and sent a diamond expert to Oroville to examine the 200 gems that had been taken from the mine. Cooney flatly refused to let him see the stones or even tell him where they were.\n\nSome weeks passed, then Cooney’s agent appeared in San Francisco and offered to buy all the stocks owned by the investors. Disgusted with Cooney’s methods and attitude, and afraid they might lose all they had invested, the two men sold all their stocks for several thousand dollars. It is still a mys-tery as to where Cooney obtained such an enormous amount of cash as that which he used to purchase absolute control of the mine.\n\nStranger still, Cooney did not resume operations in the mine as everyone expected, but instead left it closed, shut down all operations permanently, and even sold off the mining equipment. He remained in the Oroville area for approximately three more years. It appeared he had sufficient funds with which to live quite comfortably. And yet another mystery is the fact that when Cooney died twenty years later on November 18, 1929, in Salem, Oregon, at the age of ninety, he was a pauper.\n\nWith him in death he took the unanswered questions to the puzzle:\n\nDid Cooney sell out to DeBeer’s syndicate?\n\nDid he salt the mine and then change his mind?\n\nWere there really diamonds in the mine?\n\nWhy did Cooney close the mine?\n\nWhy has it never been reopened?\n\nThe mine has never been reopened and the answers will never be known or the secret unfolded until miners again pursue the discovery of the glittering stones in the old shafts of California's only diamond mine, abandoned 98 years ago."}, {"url": "https://prabook.com/web/anthony.dimond/2591103", "page_content": "Anthony Dimond\n\njudge lawyer representative teacher\n\nNovember 30, 1881 (age 71) Palatine Bridge, Montgomery County, New York and attended Catholic\n\nDimond\"s political experience includes: United States Commissioner in Chisana, Alaska (1913–1914). Special Assistant United States Attorney for the 3rd Judicial Division of Alaska in Valdez (1917). Mayor of Valdez (1920–1922, 1925–1932). Alaska Territorial Senate (1923–1926, 1929–1932). And District Judge for the 3rd Division of Alaska (1945–1953). He also served as a Delegate to the Democratic National Convention in 1936 and 1940. He died on May 28, 1953 in Anchorage. His secretary, Bob Bartlett, eventually became a United States Senator from Alaska. Today, November 30 is celebrated by the State of Alaska as \"Anthony Dimond Day.\" In Anchorage, A. J. Dimond High School and Dimond Boulevard, a major thoroughfare, are named after him. In 1940, when President Franklin Doctorate. Roosevelt was considering making Alaska an international Jewish homeland, Dimond was the main force behind defeating the effort."}, {"url": "https://researchworks.oclc.org/archivegrid/data/42065546", "page_content": "Details\n\n44 ms. boxes 33 cu. ft\n\nThe Anthony J. Dimond papers consist of legislative, political and personal files relating to his work from 1904 until his death. The bulk of the material relates directly to his service as Territorial Delegate to Congress. His activities as federal court judge are related in the personal files\n\nAnthony J. Dimond was a prospector-freighter in the Copper River Valley until injured by an accidental gunshot, after which he studied law and passed the Alaska Bar in 1913. He served as U.S. Commissioner in Chisana, practiced law with Tom Donohoe in Valdez, served as Mayor of Valdez, as special assistant to the U.S. Distrtict Attorney and as Territorial Senator, Delegate to Congress and U.S. District Judge for the 3rd Division in Anchorage\n\nThis collection, the prime source for the study of one of Alaska's outstanding public figures, is one of the most significant sources available in a public repository for research into the work and function of an Alaskan Territorial Delegate to Congress\n\nRelated Resources"}, {"url": "https://www.spokeo.com/Anthony-Dimond/California", "page_content": "Showing 2 records of 2 Criminal Records & Traffic Violations that matched the name Anthony Dimond:\n\nDisclaimer: By using this website, you accept the Spokeo Terms of Use. Spokeo is not a consumer reporting agency as defined by the Fair Credit Reporting Act (FCRA). This site should not be used to make decisions about employment, tenant screening, or any purpose covered by the FCRA.\n\n\n\nThe records were matched using first and last name only. The records below may not pertain to the individual that you're looking for, and may or may not pertain to the same charge. Please make your own determination of the relevance of these court records."}, {"url": "http://cprr.org/Museum/Silvis/", "page_content": "Central Pacific Railroad Photographic History Museum Home Exhibits Chinese History FAQ's Links Rights & Permissions; Homework Museum HOMEPAGE EXHIBITS Index —Favorite CPRR Stereographs —Hart Stereoviews —New York Public Library —Muybridge Stereoviews —Union Pacific Railroad —Unknowns —Railroad Maps —Engravings —Ephemera and Collectibles —Nelson's Guidebook, 1871 —Railroads Shipped by Sea —Locomotive Falcon Stereograph Catalogs READ ABOUT —Lewis M. Clement Biography —Eastward to Promontory ... Chinese Railroad Workers Book List Online Books Hopkins RR Library Catalog Links to other websites Webrings Frequently Asked Questions How you can help / plans What's New Technical Notes Special Requests User Agreement Site Map CPRR.org Welcome E-mail Search Internet\n\n© 2014 CPRR.org. Use of this Web site constitutes acceptance of the User Agreement which permits personal use web viewing only; no copying; arbitration; no warranty.\n\nJ. B. Silvis, the Union Pacific's Nomadic Photographer by Barry A. Swackhamer Published in Journal of the West, Vol. 33, No. 2; April 1994\n\nCopyright © 1994 by Journal of the West, Inc. Reprinted with permission of\n\nJournal of the West, P. O. Box 1009, 1531 Yuma, Manhattan, KS 66505-1009, USA This revised article contains additional and expanded endnotes.\n\nThe following item appeared in an 1874 edition of the Papillion Times (Nebraska):\n\n\"J. B. Silvis - he who meanders up and down the U.P. [Union Pacific] in his palatial photograph car, seeking the shadows of us poor mortals...If we can't induce you to settle among us, we are glad...we can occasionally see your smiling countenance and hear your hearty laugh.\"1\n\n\n\n4-4-0 T Locomotive #5 and the UPRR Photograph Car near Point of Rocks, Wyoming\n\nPhoto credit: Union Pacific Railroad.\n\nJohn B. Silvis, obviously well liked by his public, was never one to remain for long in one place. Born with a wanderlust that first took him to California during the Gold Rush, he moved from one mining camp to another. Then, unable to live the rigorous life of a miner, he took up photography and traveled the breadth of the West as proprietor of the U.P.R.R. Photograph Car. In his travels he saw and recorded our great national experience, the settling of the American West.\n\nJohn B. Silvis was born in June 1830, 2 the second of the eight children of Henry and Catharine (née Eyster) Silvis. 3 He grew up in Lockhaven, 4 Pennsylvania, a canal town named for its location on the Susquehanna River West Branch of the Pennsylvania State Canal system. Views of passing canal boats and log rafts deeply influenced his life and he dreamed of far off places. His dreams were fulfilled when news reached the East telling of the fabulous wealth to be found in the goldfields of California. That spring of 1849, at the age of 18, he began the journey of a lifetime by traveling overland to California. 5\n\nWeaver Creek\n\nFrench Town\n\n\n\nSilvis' early California experiences were unrewarding. Unsuccessful in the mines, \"in company with another young man from Bradford county [Pennsylvania], he started a trading post on Weaver Creek [a branch of the Trinity River] and bought eight mules for transporting merchandise.\" 6 On their second trip from Chester City 7 to the trading post, the mules either strayed or were stolen, representing a loss of $1,300 to him. 8 Accepting his losses, he moved into Butte County. 9 He tried his hand again at mining, only to be \"broken up several times\" and to suffer with fever and ague for sixteen months. 10 Not being \"disposed to hire out...[for] five dollars a day,\" Silvis started farming \"two quarter sections of land in a [Concow] valley about five miles from French Town, right in the neighborhood of the Indians.\" The Indians he reported \"can be hired for little and be paid in old clothes.\" 11 He sold the land after one season, 12 perhaps because the Indians upon whom he had relied upon for labor began to die from cholera. 13 Silvis then made another unsuccessful attempt to strike it rich mining 14 before he moved to Chico township in the northern Sacramento Valley. There he took up ranching. Initially, he began raising sheep but later switched to cattle and hogs. Between 1856-1860, tax records 15 show he was able to attain some degree of prosperity. He married Virginia Ann Carpenter on June 28, 1856 in Oroville. 16 Still he remained a restless spirit at heart, and in 1861 they moved to Diamondville, 17 closer to the mining activities.\n\n\n\nGrand Hotel, Humboldt Wells, Nevada\n\nIn the early 1860s, Nevada became the new focus of mining activity. Investing a considerable portion of his personal wealth, $1,500, Silvis bought an interest in several mining claims located in the Echo Mining District in Humboldt (now Pershing) County. 18 Ultimately, these claims proved worthless, and he faced having to start over. The Reese River area (Lander county, Nevada) was just beginning to boom so in September 1863 Silvis moved to Canyon City in the Big Creek mining district, about 12 miles south of Austin, Nevada. 19 Canyon City wasn't much, containing \"about fifty 'permanent' residents, one hotel, one store, two restaurants, three saloons, one meat market, a Notary Public and Recorder's office, telegraph office, and twelve houses and cabins.\" 20 There, in partnership with Daniel Jewett, he became a storekeeper. 21 Silvis continued to maintain his interest in mining activities. With two other partners, he incorporated the Venus Gold and Silver Mining Company with capital stock of $140,000. 22 However, the company collapsed the next year along with the rest of the Big Creek mining district. Little did the luckless Silvis know this same area would become valuable for its antimony deposits in 1891. 23\n\nSilvis seems to have salvaged something from the district's collapse. He sold his store 24 and became a saloonkeeper in partnership with Fred C. Chase. 25 They moved their business to Garden Ranch, 375 acres of grass or farming land about five miles southwest of Austin, Nevada. Isolated and without what she felt were the \"necessaries of life,\" Silvis' wife, Virginia, was not happy there. She had already given birth to four children of whom only a son, Charles Henry (born December 1859), survived. In the spring of 1864, she gave birth to a daughter, Eva Lilley. That summer Silvis sold out to his partner, Fred Chase. 26 What happened next is lost in the claims and counter-claims of a divorce action. Virginia claimed she was abandoned and left without support when she became ill while on route to California. Silvis denied it. Virginia then moved to Unionville, Nevada where she filed for divorce in April 1865. On September 6, 1865 the judge granted her a divorce and custody of her children. 27\n\nThe next two years of Silvis' life are a bit of a mystery. A biography of Silvis in the History of the State of Nebraska (published in 1882) states \"In 1859 he began the study of his profession [photography], in consequence of injuries received that incapacitated him from active service in the mines.\" 28 However, there is no other evidence to suggest he was interested in photography prior to his divorce. The author has a photograph of a Wyoming stage station, on the reverse of which is imprinted \"Silvis, Photographer...Austin, Nev.\" Austin had at least two photographic galleries at this time, Krause's Pioneer Gallery and one operated by a former Philadelphian, Leo Schumacher. 29 Silvis may have learned the craft at either gallery, but neither tax records nor newspaper accounts show that he operated a business there. Another possibility is that he traveled to the East, where he studied photography, and that he was in the process of returning to Austin when he made the stage station photograph. In any case, in 1867 he went to Salt Lake City, perhaps because, at that time, it was the closest source of photographic supplies. There he met Charles William Carter, who had previously been an employee of the photographic firm of Savage & Ottinger. 30 That June, Carter had started his own business, Carter's View Emporium, where he sold photographs of the Overland Route depicting Mormon immigration. He also offered to photograph \"stores and residences ... on reasonable terms.\" 31 In December 1867 Carter and Silvis formed a partnership. 32 They took over the Sutterley Brothers Photographic Gallery on East Temple Street, next door to the Wells, Fargo & Co. stage office. 33\n\n\n\nStage Ranch, 37 miles southwest of Byran, Wyoming\n\nIn 1866 Wells, Fargo & Co. put together a unified Overland Mail Company with the \"Grand Consolidation\" of a number of independent stage companies. Two years later their business was threatened by the imminent juncture of the Union Pacific and Central Pacific Railroads. A revolution was about to take place: a nation that had taken months to cross would soon be crossed in a matter of days. William F. Horspool, who managed several Utah stage stations for Wells, Fargo & Co., probably recognized that an era was about to end. He commissioned Carter & Silvis to photograph his stage stations. 34 Those photographs remain as a rare record of what overland staging was like. Within a year the Pacific Railroad was completed and overland stages ran no more.\n\nBefore the two railroads were joined with the driving of Golden Spike at Promontory, Utah on May 10th, 1869, the Carter & Silvis partnership dissolved. Their partnership had lasted less than a year. 35 Carter kept the photographic gallery and became a well-recognized photographer of Utah and the Mormons. 36 Working out of a tent, Silvis did portrait photography along the newly constructed Pacific Railroad right-of-way. 37 While Silvis was not present at the ceremony that completed the last link in the transcontinental railroad, he arrived at Promontory shortly afterwards. The empty sagebrush plain of a few months earlier was now transformed by track and canvas into, reportedly, one of the wickedest places on earth. 38 However, the last \"Hell-on-Wheels\" town created by the Pacific Railroad construction was short lived. Within a few months, the terminus of the two railroads was relocated to Ogden, and the sagebrush reclaimed the town of Promontory.\n\nSilvis spent the rest of the summer doing portrait photography along the Union Pacific right-of-way. At the same time, William H. Jackson was traveling between Cheyenne and Promontory, taking views for his Omaha-based photography business. Jackson met a number of photographers along the Union Pacific line, including Andrew J. Russell and Charles R. Savage. In September at Wasatch, Utah, Jackson and Silvis met. The brevity of Jackson's entry in his journal suggests they already knew each other, as Jackson usually elaborated when he made the acquaintance of a new photographer. In this case, all Jackson wrote was, \"Was in Silvis' tent a good deal getting him straightened out.\" 39 Silvis was having a problem with his photographic chemicals.\n\nPhotography, using the wet-plate process, was a tricky business, and conditions in the West made it even more so. Mineral-laden water rendered chemicals unusable. Wind blown dust stuck to the collodion emulsified plate. Cinders showering down from passing locomotives burned holes in the darkroom tent. Supplies of even the most basic chemicals needed for photography were difficult to obtain, and when they were found, the price was dear. Hard cash was scarce among those working along the rail line: after the saloonkeepers, gamblers, and dance hall girls received their share, there was little left for a photographer. Frequently, it was necessary to barter photographs for food or transportation to some other location along the line. 40 Given these circumstances, it is easy to understand why Silvis sought a less rigorous way to practice his profession.\n\nThe circumstances that brought Silvis, a roving photograph studio in a railroad car, and the Union Pacific Railroad together are not known. Silvis' contact with the Union Pacific surely began when he was photographing along their lines during the summer of 1869. His association with the railroad may also date from this time. The photograph car with the portrait studio, developing and printing facilities, and sales office all in one mobile unit, was an idea whose time had come. Photography has a long history of itinerant practitioners who earned their living by moving from town to town. In the days when photographic plates were developed shortly after exposure, a portable darkroom or photo wagon gave the photographer mobility. Horse-drawn studios had been in use from the daguerreian days of photography.\n\nHowever, along the transcontinental railroad, the distances were too great and the population too sparse for an itinerant photographer with a horse-drawn photo wagon to make a living. On the other hand, the railroad compensated with speed and mobility. The photographers of the Central and Union Pacific construction, Alfred A. Hart and Andrew J. Russell, were quick to put their photo wagons on flat cars. However, neither photographer took his photo wagon to the ceremony at Promontory. Instead, each operated out of the railroad car that brought him. Still, these men returned to their home-based studios to make prints and conduct sales. It remained for Silvis, or perhaps someone else in the Union Pacific, to put all the elements together, and the U.P.R.R. Photograph Car was born.\n\n\n\nUPRR Photograph Car imprint\n\n\n\n\n\n\n\n\n\n\n\nThe U.P.R.R. Photograph Car was not much more than a standard Union Pacific caboose fitted with living quarters, a darkroom, and a portrait studio illuminated by a skylight cut into the roof. The skylight also made it possible to print photographs during inclement weather. Elaborately painted on the exterior, signs on its sides declaring \"STEREOSCOPIC & LANDSCAPE VIEWS of NOTABLE POINTS on LINE of PACIFIC R.R. ALWAYS on HAND.\" Trophy horns of elk and bighorn sheep, and sometimes the American flag, decorated the roof. While the car was stationary, Silvis hung examples of his work on the outside. On one occasion, in mourning for slain President James A. Garfield, the Photograph Car was draped with black bunting. 41\n\nSurviving Union Pacific records (held by the Nebraska State Historical Society, Lincoln) do not shed any light on Silvis' arrangement with the company. However, it may have been similar to the one F. Jay Haynes enjoyed with the Northern Pacific. Haynes, the \"Official Photographer\" to the Northern Pacific (a title which he used prominently in his business), was not a salaried employee of the N.P. Instead, he owned his own photograph car, which the N.P. 42 moved on their tracks at a favorable mileage fee. This arrangement was \"contingent on [Haynes]...furnishing the Passenger department, free of charge, with views...for illustrating purposes, of new station buildings, passenger trains in motion, views of towns, views of track, river views along the track, views of wheat fields, views of scenery, and such other pictures as [you]...may be able to make that will be suitable for illustrating purposes.\" 43 The Northern Pacific used the photographs it received from Haynes for promotional purposes, particularly in the sale of the company's lands. Assuming the Union Pacific had a similar agreement with Silvis, the Union Pacific probably used his views for similar promotions.\n\nThe Union Pacific needed to sell some of the approximately 11.3 million acres of the land it had received as a benefit of constructing the railroad. After the driving of the Golden Spike at Promontory, the company was left in a ruinous financial condition as a result of the excesses of its construction. Built through 1,100 miles of sparsely settled territory, there were few commercial markets, other than the Salt Lake Valley, to support it. Anticipated trade with the Orient was lost with the opening of the Suez Canal (November 1869). Much of the California commerce continued to go by sea because it remained cheaper. Only by developing the natural resources along its right-of-way and promoting immigration to populate the West, could the Union Pacific hope to find its financial salvation.\n\nAmong the many railroads that received generous land grants, the competition to sell land was fierce. During the 1870s the railroads distributed numerous illustrated (photograph-based lithographs) pamphlets, circulars and magazines, many in foreign languages. The Union Pacific land advertisements appeared in over two thousand publications. The railroads also sent agents to Europe. Armed with stereopticon viewers, these agents gave free, illustrated lectures to attract immigrants to the cheap land available in the American West. 44 As a result of this strategy, tremendous changes took place, forever altering the face of the West. The railroads' lands became farms, and the West was settled. Silvis, with the U.P.R.R. Photograph Car, was fortunate enough to be there to record the transformation.\n\n\n\nThe Platte Valley Independent, Nov. 30, 1872\n\nBy the fall of 1870 all arrangements were made, and Silvis and the U.P.R.R. Photograph Car were in business, traveling the Union Pacific tracks. 45 As proprietor of the U.P.R.R. Photograph Car, Silvis moved from locale to locale, taking portraits of the local inhabitants. The Photograph Car rolled into a town several times each year, usually advertising several weeks in advance of its arrival. Years later, Mrs. Ida Breternizt recalled, \"The great thing we looked forward to...was the photograph car. It...stood on the side tracks where we went to have our pictures taken...I remember so well how we talked of it and planned what we would wear.\" 46 If F. Jay Haynes was any example, business was sometimes brisk; $100 or more could be earned in a single day. 47 From advertisements on the side of the Photograph Car, it is known that Silvis' portrait work included ferrotypes (tintypes), gems and porcelains. 48 However, he primarily used the wet-plate/albumen print process to make photographs. The carte-de-visite, a paper image glued on a small 2 1/2\" x 4 1/4\" card, was popular at this time. Most of the portraits taken by Silvis, identified by the Photograph Car imprint on the reverse, are of this type.\n\n\n\nWinnemucca Family, Nevada\n\n\n\nWasatch, Utah\n\nArtesian Well, Rock Springs, Wyoming\n\nCoal Tipple, Carbon, Wyoming\n\nPhoto credit: Union Pacific Railroad.\n\nIn addition to taking portrait photographs, Silvis sold stereoscopic and other landscape views. Stereographs were at the height of their popularity, and most homes had a stereopticon viewer in their parlor. Silvis advertised that he stocked a large selection of views \"embracing...all the most interesting scenes of Nebraska, Colorado, Utah, California, Oregon &c.\" 49 Whether he sold only his own photographs or also vended those of others is a matter of conjecture. However, he had access to the places he advertised (except perhaps Oregon) by traveling on the U.P. tracks or by making occasional excursions on the Central Pacific, Utah Central, or Denver Pacific Railroads. Traveling up and down the railroad line several times a year, Silvis had splendid opportunities to photograph the natural wonders, as well as the impact upon the land made by the railroad and the population influx it brought. Railroad facilities (sidings, water towers, roundhouses, etc.) were the potential sites for the development of new towns. Mineral discoveries, such as coal, grew into mines and tipples. As a whole, Silvis' views illustrate the changes that took place in the West during the post-Civil War era.\n\nTraveling the Union Pacific's tracks from one end to the other was not without excitement, nor hazard. The Photograph Car was fitted with the comforts of home, and Silvis traveled in all seasons, witnessing blizzards and flash floods. On occasion, his second wife, Alice Victoria (née Allen), whom he married in Chicago on June 16, 1873, 50 accompanied him. 51 One exciting incident occurred in December 1878. The residents of Kearny, Nebraska were enraged over the lynching of Luther Mitchell and Ami Ketchum by I. P. (Print) Olive for the murder of Olive's brother, Robert. Such swift justice was not uncommon. However, the possible complicity of the sheriff in the lynching and the fact that the victims' bodies were burned incensed the townspeople. Silvis made the most of the excitement by selling \"Views of the Hanging of Mitchell and Ketchum\" and a photographic mosaic of the \"Olive Gang.\" 52\n\nRobbery\n\n\n\nSilvis was not immune from violence either. One August night in 1881, while in Evanston, Wyoming he was the intended victim of a potentially deadly robbery attempt. 53 Awakened by the sound of a plank being placed against the outside of the Photograph Car, Silvis slipped from his bed and got his pistol. Observing an intruder climbing through an open window, Silvis fired, striking him on the shoulder. The burglar and his partner fled with Silvis in pursuit, firing his revolver, until the pain of his bare feet on the rocks compelled him to stop. Returning to the car, he found a heavy iron bar on the floor. The intruder obviously intended to dispatch him with it.\n\nAt the end of 1882 Silvis retired from the Photograph Car and from photography. Business was dwindling because of the increased competition from local photographers who resided in some of the more thriving towns along the track. Grand Island, Nebraska, for example, had three commercial photographers by this time. 54 He may also have been influenced by the fact his wife had just given birth to a daughter, Hazel. 55 However, even after Silvis' retirement the U.P.R.R. Photograph Car continued to operate on Union Pacific tracks. The business arrangements are unknown, but Charles Tate became the proprietor of the Photograph Car. In 1883, he took it to Hailey, Idaho Territory, on a newly completed portion of the Union Pacific's subsidiary, the Oregon Short Line. 56 The purpose of the trip was to take photographs of the scenery and objects of interest for a new Union Pacific travel guide. Tate also took portraits and made stereographs in route. Evidently Tate's proprietorship was short lived as he did not have his own stereograph cards imprinted. Instead he mounted his images on Silvis' remaining unused stock of cards. 57 After Tate, W.A. Bradley operated the Photograph Car. By this time, the tracks of the Utah & Northern, another U.P. subsidiary, had been laid to Butte, Montana Territory, and Bradley included it on his route. He continued to use the Photograph Car until at least 1889. 58\n\nBefore the U.P.R.R. Photograph Car ceased operating, it had inspired a number of imitations. An article in the November 1884 issue of Photographic Times and American Photographer, entitled \"A Railway Studio,\" offered extensive design details for a photograph car. 59 The new generation of photograph cars were a vast improvement over Silvis' caboose. The new photograph cars were modified passenger cars with large glass areas for better studio lighting. Some cars even had \"carefully fitted darkrooms for the development of negatives,\" a display gallery, and living quarters offering \"every convenience -- excepting a cook.\" 60 The Haynes Palace Studio Car, operated on the Northern Pacific tracks from 1885 to 1905 by F. Jay Haynes, was just such a photograph car. Haynes purchased a Pullman business car from the N.P. and had it converted to his specifications. 61 As the years passed, Haynes turned over the operation of his photograph car to his employees. Several photograph cars operated from time to time on the southern transcontinental routes. In 1891 the Boston Railroad Photo Car made a tour through the Southwest to California. Its staff of four cameramen claimed to have taken 13,000 negatives in Albuquerque (NM), 7,000 in Las Vegas (NM), and 3,000 in Flagstaff (AZ). 62 While these figures are probably inflated, they do indicate there was considerable photographic business available to photograph car operators in that sparsely settled country. Perhaps one of the last photograph cars in the West was the Sunset Photograph Car. Operated by the Southern Pacific Railroad in the early 1900s the car was used to provide photographs for Sunset Magazine, an S.P. publication devoted to promoting the West. 63 This is just what the U.P.R.R. Photograph Car and J.B. Silvis had done three decades earlier.\n\nIn retirement Silvis lived on his farm, Sunny Side, at Elkhorn (Station), Nebraska. Silvis had begun acquiring property there in 1873, and by the time he retired, he owned three farms totaling over 500 acres. Each of these properties were improved and under cultivation. One farm was said to have the best house in western Douglas County in addition to \"a large orchard of bearing trees, and a large grove of forest and ornamental trees.\" 64 Silvis also purchased a thoroughbred stallion and an imported shorthorn bull named Duke of Oxford for breeding. An active promoter of his community, he was a charter member of the Waterloo Immigration and Improvement Association. 65 By the late 1880s Silvis had either sold or leased his farms and resided part-time in Omaha. 66 Finally, in 1892 Silvis moved to a farm near Tallahassee, Florida (today it is a portion of the Florida A&M University campus) where he lived until his death on July 1, 1900. 67\n\nWhen John B. Silvis left Pennsylvania to join the California Gold Rush the American West was largely uninhabited, except by the Native American Indians. By the time of his death, some fifty years later, an American frontier could no longer be said to exist. 68 In between, a remarkable transformation took place; a series of events that resulted in the settling of the West. As a miner, saloonkeeper, rancher, and farmer, Silvis was very much a participant in these events. As a photographer, he was an observer and recorder of them. As proprietor of the U.P.R.R. Photograph Car, he was a wanderer who roamed the West on the track of the Union Pacific Railroad. A wanderer seems to be what he enjoyed being the most.\n\nADDENDUM\n\nToday, photographs by J. B. Silvis are quite rare. The largest public holdings, consisting of about a dozen views, are at the Denver Public Library. Two of these views may be seen on the library\u0092s website. The Union Pacific Railroad Museum, where one would expect to find a number of views, has but a single original image. However, they do have several copy photographs. The George Eastman House and the Museum of New Mexico also have single original images. The Church of Jesus Christ of Latter-day Saints\u0092 Church Archives has three copy photographs of Wells, Fargo & Co. stage stations taken by Carter & Silvis. They also hold a number of original negatives taken by C. W. Carter. Perhaps some are the work of Silvis. The Nebraska State Historical Society has a copy photograph of the \"Olive Gang.\" Undoubtedly there are more photographs by J. B. Silvis to be located, lost among the numerous collections filed only by category rather than photographer.\n\nNOTES\n\n1 Reprinted in Anthony's Photographic Bulletin, 5 (Feb. 1875): 53.\n\n2 Twelfth Census of the United States (1900), State of Florida, Leon County, Precinct No. 14, E.D. 88, Sheet 16, Line 15. Taken on June 22, 1900, Silvis is listed as age 69. In the 1850 Census, taken in late September or early October, Silvis is 20. The 1860 Census, taken July 7th, lists Silvis (under the name Silvey) as being 30. In the 1880 Census, taken June 15th, Silvis is listed as age 50. No birth record for Silvis has been located, nor has the location of his birth been identified. The town in which he claimed to have been born, Lockhaven, PA, was not founded until three years after his birth. The 1830 US Census lists a Henry Silvis family in Turbut Township, North Unberland County, PA. Information in this census is limited, but the family profile matches what the Silvis family would have been like at that time.\n\n3 Henry Silvis was born in Reading, PA on November 9, 1798. He died in Lockhaven, PA on December 31, 1879. He was a tanner, butcher, farmer and lumberman by trade. Clinton Democrat, 1 Jan. 1880.\n\nCatharine (née Eyster) Silvis was born in Rockland, Venango Co., PA on January 1, 1803. The exact year is uncertain as she was reported to be between 92 and 97 at the time of her death on September 18, 1900. Clinton Republican, 29 Sept. 1900.\n\nThe children of Henry and Catharine Silvis were Francis (b. ?, d. 1851), John (b. 1830, d. 1900), Ellen (b. 1833, d. after 1900), Catherine (b. 1836, d. after 1900), Lucy (b. 1838, d. Feb. 8, 1869), William (b. 1843, d. April 20, 1858), Malinda (b. 1841, d. Aug. 1 1850), Emma (b. 1845, d. after 1900), and Etherelda Hope (adopted 1866).\n\n4 Lockhaven was laid out by town founder Jeremiah Church in 1833. Its name is derived from its location by a \"lock\" of the Susquehanna River West Branch Canal and wing dam, which provided a rest-\"haven\" for log rafts. It became the county seat when Clinton County was formed in 1839. The Henry Silvis' had one of the earliest homes in town and may have pre-dated the town's founding.\n\n5 The statement of overland travel to California is taken from Silvis' questionable (see comments in endnote 28) biography in History of the State of Nebraska (816). Events described in Silvis' August 28, 1850 letter from Chester City, CA (Clinton Democrat, 19 Nov. 1850) place him in California too early to have been a part of the 1850 overland migration. The author has examined numerous 1849 overland journals, including C.W. Haskins' The Argonauts of California, but did not find Silvis listed. Hovever, even by the best estimates, the names of only about a quarter of the California 49ers are known. It is possible that Silvis went by sea, including Panama, but, again, his name does not appear on any published list.\n\n6 Clinton Democrat, 19 Nov. 1850. Silvis' partner may have been Matthew Stuart, one of the founders of Weaverville.\n\n7 Erwin Gudde in California Gold Camps (Berkeley: University of California Press, 1975) does not list Chester City. Judging by Silvis\u0092 description Chester City is probably a phonetic spelling of Shasta City.\n\n8 John Carr in Pioneer Days in California (Eureka: Times Publishing Co., 1891) reported that mules were quite scarce in the Trinity area, costing as much as $300 apiece, and were stolen frequently. The punishment for stealing a mule could be quite severe, including public whipping, and, in one case, the thieves were \"shot and killed...then scalped and the hair pieces nailed to the corral gateposts as a warning to others.\" (99-120).\n\nIt is appropriate to comment here on the anti-Gold Rush vies of the Clinton Democrat. The newspaper was very much opposed to the California venture. Most of its comments reflected on the lawlessness there, the high price of goods, and illness (cholera) found on the trail and in California. The newspaper even took to reporting several (false?) gold strikes in Pennsylvania to dampen the enthusiasm. Silvis\u0092 first letter, written 29 August 1850 and published 19 November 1850 supported the paper\u0092s views. It concludes, \"I advise my friends to stay home and my enemies to come to California.\" Two years latter the Clinton Democrat abruptly reversed its position and started writing more positive things about California. The reason for this is not entirely clear, however, about this time John Bigler was elected governor of California. The Clinton Democrat, a highly political newspaper, was supporting William Bigler, John\u0092s brother, for governor of Pennsylvania at this time.\n\n9 Seventh United State Census (1850), Butte County, California, page 24(83), line 21. The census was taken in late September or early October. John Silvis, age 20, miner, is listed as sharing a cabin with J.B. Nelson of Indiana, age 20, trader, and Tron Priceau of France, age 24, miner.\n\n10 Clinton Democrat, 20 April 1852.\n\n11 Ibid. As reprehensible as Silvis' behavior may seem, paying California Indians with food and clothing for their labor was common among the Anglo-whites of California. The practice had its roots in \"the system of Indian peonage which had existed on the ranchos of Hispanic California.\" (Rawls, 30). Indian labor was also common in the mines during the first year after the discovery of gold. A number of early California pioneers became wealthy by employing Indians. However, Indian laborers were soon driven from the mines by newly arriving whites who viewed such cheap labor, including slaves and Chinese, as an unfair advantage to the employer. Also, the experiences of the new arrivals with the Indians back home differed sharply from the Hispanic California system. James J. Rawls, \"Gold Diggers: Indian Miners in the California Gold Rush,\" California Historical Quarterly, 55 (Spring, 1976): 28-45.\n\nAccording to the Clinton Democrat, 20 April 1852, Silvis\u0092 partner in the enterprise was a \"Dr. Thompson of Iowa.\"\n\n12 Silvis filed a pre-emption claim on the Concow Valley property (Pre-emption Claims Index 1850-1875, Butte Co., California, Meriman Library, California State Universtiy at Chico.). The property, 158 acres, was sold to Preston Brown for $260 on October 11, 1852 (Deeds, Book A, Butte Co., California, 82.).\n\n13 David Wooster, The Gold Rush: Letters of David Wooster from California to the Adrian Michigan, Expositor 1850-1855 (Mount Pleasant, The Cumming Press, 1972), 69.\n\n14 Weekly Butte Record, 18 July 1856. \"The claim of John Silvis & Co., yielded last week, with seven men, three days washing, $810.\"\n\n15 Assessment Rolls, Chico Township, Butte County, Meriman Library; California State University at Chico. Silvis' personal property total for 1857 was $1,750; for 1858, $1,330; for 1859, $2,046 and for 1860* (under the name J.B. Silvey), $3,000. Silvis' does not appear to have owned any real estate at this time. *Eighth United State Census (1860), Chico Township, Butte County, California, page 567, line 11\n\n16 Silvis v. Silvis, Civil Court Case 76, Humboldt County Clerk, Winnemucca, NV. Virginia Ann Carpenter was born November 1838 in Mississippi, the daughter of Dangerfield and Ellen (née Randall) Carpenter. The Carpenter family moved to California, arriving in San Francisco aboard the Winfield Scott, June 15, 1852.* The Carpenters were ranching in Chico Township by 1854. * Louis J. Rassmussen, San Francisco Ship Passenger Lists (Colma: San Francisco Historic Records, 1967), 3:214.\n\n17 According to Gudde (96) Diamondville was northeast of Chico on Butte Creek. Founded in 1857, and originally named Goatville, it was renamed in honor of James Diamond, a miner.\n\n18 Deeds,B: 373-4, Humboldt County Recorder, Winnemucca, NV. The Echo Mining District is on the western slope of the West Humboldt range of mountains. Silvis' bought \"one-third of one-fifth interest\" in the American Co., Miou Ledge; Washburn Co., Winfield Scott Ledge; Oregon Co., Noloeneeu Ledge; Dounel Co., Morning Star Ledge; Miou Co., Constitution Ledge; Echo Co., Washington Ledge; Independent Co., Pacific Ledge; Iowa Co., Arkansas Ledge; and the Wisconsin Co., Empire Ledge.\n\nNote: Perhaps not worthless, but in need of the right technology. Upon personal examination of the area, the author found active mining in the vicinity\n\n19 Silvis v. Silvis.\n\n20 History of Nevada, 1881 (1881; rpt. Berkeley: Howell-North, 1958), 472.\n\n21 Internal Revenue Assessments Lists for the Territory of Nevada, 1863-1866 (Washington: National Archives, 1981, microfilm), Annual List, 1863: 27. \"Silva [sic] and Jewett\" are listed as \"Retail Dealers.\"\n\n22 Certificates of Incorporation, Box 31, file 52, Nevada State Archives, Carson City, NV. Silvis' partners were H.C. Merritt and J.T. Monroe.\n\n23 Francis C. Lincoln, Mining Districts and Mineral Resources of Nevada (1923, rpt. Las Vegas: Nevada Publications, 1982), 109.\n\n24 Deeds. 16:64, Lander County Recorder, Battle Mountain, NV. Sale of store and property to G. Bowkofsky on 12 October, 1863.\n\n25 Internal Revenue Assessment...Nevada, Annual List, 1864: 18. Silvis and Chase are listed as \"Retail Dealers in Liquor.\" This represents a change in Silvis as he had been a member of the Lockhaven Temperance Society. Clinton Democrat, 2 Feb. 1849.\n\n26 Deeds. 22:409-10, Lander County Recorder, Battle Mountain, NV. Sale of Garden Ranch to Fred C. Chase on 22 July, 1864.\n\n27 Silvis v. Silvis. Virginia was also given the use of her maiden name. On December 11, 1865, Virginia married William R. Usher** of Unionville. The next year they moved to Silver City, Idaho Territory, where they lived for five years. After moving to Utah, then Nevada, in 1880, they settled in Eagle Valley, Oregon. There they platted and founded the town of Richland. * Of Virginia's six children only Charles Henry survived to adulthood. He never married*** and lived with his mother until her death in 1924. Charles died in Baker, Oregon in 1936. *Illustrated History of Baker, Grant, Malheur and Harvey Counties...State of Oregon (Western Historical Publishing Company, 1902), 299.\n\n** It is a matter of speculation, but Virginia may have known Usher earlier. The Eighth United State Census (1860) shows a Wm. Usher, Saloon Keeper, living in Kinshaw Township, Butte County. Tax records show Virginia\u0092s father, Dangerfield Carpenter, residing there in 1861.\n\n*** I admit to taking some liberties with this statement. On 15 October 1829, Henry, at age 71, married Bee Alice Ralston, 50, of Whitney, Oregon in Baker, Oregon. (Marriage Certificate No. 6900, Certification of Vital Records, Oregon Health Division) At Henry Silvis\u0092 death she is not listed as having survived him. However, I have not been able to locate a death certificate for her, nor any divorce records.\n\n28 History of the State of Nebraska (Chicago: The Western Historical Company, 1882) 1:816. The History of the State of Nebraska is one of those histories popular in the late 19th and early 20th centuries in which the subscribers could include their own biographies. Silvis' biography is full of exaggerations, inaccuracies, and falsehoods, the most glaring of which is the statement claiming he served in \"Company F, Fifteenth Pennsylvania Cavalry\" during the Civil War. No record of any such service can be found in the files of the National Archives nor does Silvis' name appear on any unit roster. Also, the Special Schedule of Surviving Soldiers, Sailors, and Marines, and Widows, etc. (gathered as part of the Eleventh United States Census, 1890) and Nebraska's Enumeration of Soldiers, Sailors and Marines of the War of 1812, the Mexican War and the War of the Rebellion, Residing in Nebraska June 1st, 1887 indicate that Silvis was a major in the 1st California Cavalry, but no record of this service can be found.\n\n29 Reese River Reveille, 17 Oct. 1867.\n\n30 The Salt Lake City Directory (G. Owens, New York, 1867) for 1867 list C.W. Carter as an employee of Savage & Ottinger. C.R. Savage's diary (Archives & Manuscripts, Harold B. Lee Library, Brigham Young University, Provo, UT) for 30 May 1869 mentions Savage meeting \"Carter my old employe [sic].\"\n\n31 Nelson B. Wadsworth, Set in Stone, Fixed in Glass (Salt Lake City: Signature Books, 1992) 143. Salt Lake Daily Telegraph, 2 July 1867.\n\n32 Application for Licenses: Internal Revenue, Utah Territory, DeGolyer Library, Dallas, TX. Listed as \"Carter & Silvas [sic].\"\n\n33 A photograph in Nelson B. Wadsworth's Set in Stone, Fixed in Glass (Salt Lake City: Signature Books, 1992, page 152) shows Carter's banner draped over a barely discernable Sutterley Bros.\n\n34 Francis L. Horspool, Wells Fargo State Stations in 1868 (Salt Lake City: Francis L. Horspool, 1946), np.\n\n35 Application for Licenses. Carter applied for an annual business license under his own name in March 1869. Between February 13 and August 5, 1868 Carter & Silvis was listed under \"Photograph Galleries\" in the Salt Lake Telegraph. Although their partnership may have dissolved at this time, discontinuation of the advertisement appears to have been more a change in format of the newspaper than anything else.\n\n36 The History Department of the Church of Jesus Christ of Latter-day Saints in Salt Lake City, UT houses approximately one thousand original glass negatives by Carter. Many were taken about the time of the Carter & Silvis partnership; perhaps some were taken by Silvis himself.\n\n37 Silvis' whereabouts during late 1868 and early 1869 are not entirely clear. The Union Pacific Museum at Omaha Nebraska has a copy photograph, X186, which shows Federal Railroad Commissioners Clements and Blinkendoffer sitting on the pilot of the locomotive \"Falcon,\" covered with a buffalo robe, on an inspection trip. The photographer is credited as being \"Silvis of Reno.\" The photograph was taken at Argenta, Nevada, February 9, 1896.\n\nThere have been some references to Silvis being a member of a \"photographic corp\" headed by A. J. Russell. Gerald Best in Iron Horses to Promontory (San Marino: Golden West Books, 1969, page 144) says, \"After Andrew J. Russell and his assistant S.J. Sedgewick had returned to New York in 1869, another member of Russell's group, J.B. Silvis, made a number of trips over the Union Pacific [in the Union Pacific photograph car].\" However Best cites no reference for this statement. William D. Patterson in \"Westward by Rail with Professor Sedwick: A Lantern Slide Journey of 1873.\" (Historical Society of Southern California Quarterly, 42 (1962): 338,348) said \"he [S.J. Sedgwick] was never on the Union Pacific payroll [as a member of the \"photographic corps of the U.P.R.R.\"], unlike Russell, a Brooklyn photographer named O.C. Smith, and one J.P. (sic) Silvis.8 [Endnote] 8. See construction records, Union Pacific Railroad, Omaha.\" However, neither Don Snoddy, director of the Union Pacific Museum (Omaha); Susan Williams, who did her dissertation on Russell (contact Oakland Museum, Oakland, CA); Maury Klein, author of Union Pacific, the Birth of a Railroad, 1862-1893 (Garden City: Doubleday, 1987); nor the author have found any record of the U.P.'s employment of A.J. Russell or Silvis' membership in Russell's photographic corps among the Union Pacific Railroad records (now in the hands of the Nebraska State Historical Society).\n\n38 Newspaperman John H. Beadle characterized Promontory as being \"4900 feet above sea level, though, theologically speaking, if we interpret scripture literally, it ought to have been 49,000 below sea level; for it certainly was, for its size, morally nearest to the infernal regions of any town on the [rail]road.\" Barry B. Combs, Westward to Promontory (New York: Promontory Press, 1969), 68.\n\n39 William H. Jackson, 2 Sept. 1869, William H. Jackson Papers, New York Public Library, New York, NY. This is the original journal entry. The entry was later expanded in the typescript copy of his diary, done in preparation for his autobiography. The entry was expanded further in his autobiography, Time Exposure (1940; rpt. Albuquerque, University of New Mexico, 1986), where it reads, \"Silvis, photographer [for the Union Pacific] [sic] is here with tent doing portrait work. Spent some time with him helping to get his bath and collodion in better condition.\" (183).\n\n40 The experiences of William H. Jackson as set down in his autobiography, Time Exposure, and his journals (held by the New York Public Library) offer excellent examples of the trials and tribulations of the photographer in the West.\n\n41 Ralph C. Wilson, \"J.B. Silvis: Union Pacific Photographer With Area Ties,\" The Post-Gazette, 21 Jan. 1986. This article was based primarily on the History of the State of Nebraska (see Endnote 28) as is incorrect in many places.\n\n42 As stated in endnote #37, no reference to the employment of A.J. Russell, J.B. Silvis, or any other photographer has recently been found in the remaining files of the Union Pacific Railroad. However, Maury Klein, author of Union Pacific, the Birth of a Railroad, 1862-1893 (Garden City: Doubleday, 1987), has located a letter among the Union Pacific files by Sidney Dillion in which he questions the need to employ a photographer. Telephone conversation with the author.\n\n43 Edward W. Nolan, Northern Pacific Views: The Railroad Photography of F. Jay Haynes, 1876-1905 (Helena: Montana Historical Society Press, 1983), 20-22. Charles S. Fee to F. Jay Haynes, 1 Nov. 1901.\n\n44 Dee Brown, Hear That Lonesome Whistle Blow (New York: Holt, Rinehart & Winston, 1977), 245.\n\n45 The Platte Valley Independent (Grand Island), 22 Oct. 1870.\n\n46 \"First Girl Born in NP Awaited Photo Car,\" Telegraph-Bulletin, 17 Sept. 1973. Reprint of a 1939 interview.\n\n47 Nolan, 20.\n\n48 Gems were small 7/8 inch by 1 inch, postage-stamp size, tintypes made with multiple image cameras. Some were cut to fit lockets, cufflinks, and rings, even garter clasps. Porcelains were made by floating a collodion image from its glass base onto a chinaware surface, then sealing it with glazes and heat treatments. George Gilbert, Photography: The Early Years (New York: Harper & Row, 1980), 72, 164.\n\n49 Platte Valley Independent (Grand Island), 30 Nov. 1872.\n\n50 Marriage Licenses, Certificate No. 10292, Cook County, IL (LDS microfilm #1030082). This certificate is made out to John B. Silvis and M. Ella Allen (sic). All other records indicate that Silvis was married to Alice Victoria (née Allen). This discrepancy has not been resolved.\n\n51 Ralph C. Wilson. From an article in the Waterloo Weekly Gazette (9 July 1881), which reported that, Mrs. Silvis was with her husband in Evanston, Wyoming and ill with pneumonia.\n\n52 A copy photograph of the \"Olive Gang\" (O48-13) is in the collection of the Nebraska State Historical Society, Lincoln. Information taken from the reverse. An account of the Mitchell and Ketchum affair appears in Pioneer History of Custer County by Solomon D. Butcher (1901; rpt Broken Bow, Purcelli's Inc., 1976, 43-62). A photograph of the charred remains of victims appears in the book (56). While no photographer is credited with the picture, based upon Silvis offer of \"Views of the Hanging of Mitchell and Ketchum,\" it might be concluded that he took the photograph.\n\n53 Waterloo Weekly Gazette, 26 Aug. 1881. Reprinted from the Evanston Chieftain.\n\n54 Tom Anderson, Stuhr Museum of the Prairie Pioneer. Letter to the author August 1991.\n\n55 According to the 1900 Census (Twelfth Census of the United States, State of Florida, County of Leon, Enumeration District 88, Sheet 16, line 16) Mrs. Alice Silvis had given birth to 7 children. Only a daughter, Hazel, survived to adulthood. The passing of one of these children was noted in the Nebraska State Journal, 31 July 1878.\n\n56 Bruce Hooper, \"Gems of the Mountains,\" Stereo World, 16 (July/August 1989): 35.\n\n57 Stereographs in the collection of the author.\n\n58 Photograph in the possession of Nelson B. Wadsworth. New Northwest, 1 March 1889.\n\n59 Nolan, 18.\n\n60 John Gruber, \"Rolling Studios: Company Photographers Tour in Photo Cars,\" Mid-Continent Railway Gazette, 23 (Feb. 1990): 12-13.\n\n61 Nolan, 20.\n\n62 Bruce Hooper, Ralph M. Bilby Research Center, Northern Arizona University. Letter to the author September 1992. Based on information in the Arizona Weekly Journal-Miner, 16 Sept. 1891, and the Conconino Sun, 1 Aug. 1891.\n\n63 Arizona Republican, 24 June 1907.\n\n64 Waterloo Weekly Gazette, 13 Jan. 1882.\n\n65 History of Nebraska, 813.\n\n66 Omaha and Douglas County Directory (Omaha: J.M. Wolfe & Co., 1888) 791. \"Silvis, John B. res 3002 N. 16th.\"\n\n67 Letters of Testamentary and Administration, 2:207-8, Leon County Circuit Court, Tallahassee, FL. The obituary of Silvis' mother, Catharine, indicated that he died of heart disease. Daily Democrat, 18 Sept. 1900. There is no death certificate on file for John Silvis. The State of Florida had only begun requiring them in 1899, and Silvis may have slipped through the cracks. Also, there is no Tallahasee newspaper for this time period available on microform. In addition, Silvis\u0092 gravesite has not been located.\n\nAlice V. Silvis and her daughter, Hazel, sold the Silvis farm on 9 April 1901 to Mrs. Annie Thompson of La Salle County, Illinois for $3500 (Deeds [Leon County], 2:442, Tallahassee, FL). Alice is last heard from on 26 March 1902 in Cook Co., Illinois, when she notarized a document (deed) disposing of he mother-in-law\u0092s estate (Deeds [Clinton County], 66:655, Lockhaven, PA).\n\nIt has been difficult to follow Silvis\u0092 daughter, Hazel. In the sale of the Silvis farm she is presented as \"Hazel Silvis Shumway\" (Deeds [Leon County], 2:442, Tallahassee, FL). On 24 September 1901 she is called the \"wife of Ralph S. Wood\" (Wills, B:321 (Affidavit of the Widow), Leon County Circuit Court, Tallahassee, FL). Finally, in settlement of her grandmother\u0092s, Catherine Silvis, estate (Deeds [Clinton County], 66:654, Lockhaven, PA) she is presented as \"Hazel Silvis Shumway Wood (Widow) [sic] of Spartenburg [SC?]\". Hazel notarized this deed in Douglas County, Nebraska on 22 April 1902.\n\n68 In 1890 the Superintendent of the Census reported \"the unsettled area has been so broken up by isolated bodies of settlement that there can hardly be said to be a frontier line.\" Ray A. Billington, Westward Expansion (New York: The MacMillan Company, 1967), 753.\n\nCourtesy Barry A. Swackhamer and Carol A. Williams, Publisher, Journal of the West.\n\n"}, {"url": "https://library.uaf.edu/aprca/research-guides/movement-towards-statehood", "page_content": "\n\nIn commemoration of the 50th anniversary of Alaska's admission into the Union, the Alaska & Polar Regions Collections (APR), with funding from the Alaska Humanities Forum, has published this bibliography as an attempt to familiarize researchers with the primary resources available in APR collections pertaining to the statehood movement. These materials were created by the people who were directly involved. Examples include committee reports and notes from a Constitutional Convention delegate, or a television broadcast of a debate about the need for Alaskan statehood, correspondence of the Alaskan delegates to Congress, political cartoons depicting the Alaskan plight, and recorded interviews with those who played key roles in the struggle. It is our hope that this guide will help the stories of Alaskan statehood be told…and retold.\n\n\n\nImage of what may have been an alternate version of the 49-star flag after the statehood of Alaska.\n\nERNEST H. GRUENING PAPERS, 1914-[1959-1969] 1974, UAF-1976-21-77747"}, {"url": "https://www.gia.edu/gia-news-research/historical-reading-diamond-fields-south-africa-1868-1893", "page_content": "A view of the Kimberley Diamond Mine in South Africa, taken from a booklet entitled, “A Short Sketch of the African Diamond Mines,” published in 1881 by Alfred H. Smith & Company in New York.\n\nThe classical Roman scholar Pliny wrote: “Maximum in rebus humanis, non solum inter gemmas, pretium habet adamas” (Among all human things, not only among gems, the diamond is the most precious).\n\n\n\nThe discovery of diamonds in South Africa occurred in early 1867 on the land of a poor Boer farmer, Daniel Jacobs, near the small isolated settlement of Hopetown on the Orange River in the Cape of Good Hope Colony. This region of South Africa, near the junction of the Orange and Vaal rivers, was one of several destinations for thousands of European settlers (mainly Dutch and English) who traveled from the coast toward the interior of the country to farm and raise livestock. No one thought the region might contain diamonds, or thought to search for any precious stones. Brazil had been the principal source of diamonds for at least 150 years.\n\n\n\nJacob’s son Erasmus collected pretty stones, including a shiny pebble, along the south bank of the Orange River that he and other children used in games. His mother noticed it and showed it to a neighboring farmer, Schalk van Niekerk, who was so intrigued by its appearance that he offered to buy it. The woman laughed at this idea and gave the pebble to him.\n\n\n\nThe farmer thought it might have some value and showed it to several individuals in Hopetown and nearby Colesberg, but found little interest. The civil commissioner in Colesberg, Lorenzo Boyes, examined the pebble and discovered that it could scratch glass. He then sent it to Dr. W.G. Atherstone, a physician and amateur geologist residing at Grahamstown who, based on its physical properties, pronounced it a diamond weighing 21.25 carats.\n\n\n\nIt was purchased for £500 by Sir Phillip Wodehouse, the governor of the Cape Colony, who was able to confirm its identity. This news was viewed with some skepticism, however. Most people at that time had never seen a diamond and only knew of them from books. They debated how and why diamonds occurred in South Africa.\n\n\n\nThis surprise discovery prompted Boer farmers along the rivers to look more carefully for “blink klippe” (bright stones). As news of the initial diamond discovery spread, small parties of prospectors rushed into the region to search for similar gems. Over the following months, additional diamonds continued to be found, and by 1869 these river diggings had yielded hundreds of diamonds (including the discovery of the 83.5 carat diamond known as the “Star of South Africa” at Sandfontein). Those involved in the search recognized that the presence of garnets was often a very good indicator of the proximity of alluvial diamonds. Much of the scientific effort during this time was directed toward finding the host rock in which the diamonds originally formed.\n\n\n\nIn 1870 diamonds were being found in some abundance on the Bultfontein farm (20 miles southeast of the river diggings) in what came to be called the “dry diggings” (later recognized as diamonds occurring in the upper weathered and decomposed sections of a volcanic pipe). These events started a rush of thousands of people (of all backgrounds and from a number of countries) to lay claim to sections of land to explore for diamonds over a large area of the Cape Colony, and within two decades, many rich deposits were found that would later become the famous diamond mines of South Africa.\n\nHow to Use this Reading List\n\nThis reading list was compiled to give you an opportunity to learn more about the history of diamond fields of South Africa. A number of the articles were published in the 1800s and early 1900s – when many classical gem deposits of historical importance were discovered and gemology and mineralogy became sciences. The list is presented in chronological order to emphasize the development of ideas over time. The list is not comprehensive, but a compilation of some interesting gemological information that has often been forgotten or overlooked.\n\n\n\nMany of the articles exist in the public domain and can be found online at digital libraries such as Hathitrust, Internet Archive, or other digital repositories. More recent publications can often be found in libraries, including the Richard T. Liddicoat Gemological Library. Abstracts of these articles can usually be found on the website of the original journal or magazine, and the article itself is often available for purchase from the publisher.\n\n\n\nRegarding the GIA library’s holdings and on-site access, please contact the GIA library in Carlsbad.\n\n\n\nOn the Discovery of Diamonds at Hope Town in the Cape Colony, J. Tennant, Proceedings of the Royal Geographic Society, Vol. 12, No. 5, pp. 322-323, (1868). A report of the initial discovery, along with notes on several diamonds found during the previous year, some of which were already among the jewelry firms in London, and others being shown in the summer and fall of 1867 at an international exhibition in Paris.\n\n\n\nDiamonds at the Cape Colony, H. Emanuel, Journal of the Society of Arts, Vol. 16, No. 83, pp. 849-850, (1868). A letter from a noted diamond merchant in London who, after learning of the reports of the diamond discovery, commissioned a friend with geological experience (James R. Gregory) to visit the region in South Africa to determine the truthfulness of the reports. After an extensive tour of the area, Gregory apparently could find no geological or mineralogical evidence for the occurrence of diamonds.\n\n\n\nDiamonds from the Cape of Good Hope, J.R. Gregory, Geological Magazine, Vol. 5, No. 54, pp. 558-561, (1868). After visiting several districts in South Africa, the author reported that he “saw no indications whatever that would warrant the expectation of the finding of diamonds, or of diamond-bearing deposits, at any of the localities.”\n\n\n\nDiamonds at the Cape Colony, W.B. Chalmers, Journal of the Society of Arts, Vol. 17, No. 747, pp. 199-200, (1869). A letter from the Civil Commissioner in Hopetown describes 17 rough diamonds, including information on their shape and size, where they were found, along with their disposition and purchase price, based on personal information from trusted individuals.\n\n\n\nDiamonds at the Cape, E. Muskett, Journal of the Society of Arts, Vol. 17, No. 855, p. 379, (1869). A letter from a medical doctor in Hopetown, affirming the occurrence of diamonds in the area and disputing James R. Gregory’s (see second and third entries above) conclusions about the absence of diamonds, which he felt were based on an insufficient effort to obtain a complete story about the recent discovery.\n\n\n\nDiamonds, A. Wilmont, South African Magazine, Vol. 3, pp. 570-586, (1869). Besides giving general information on diamonds, the author recounts the story of their discovery in South Africa.\n\n\n\nDiamonds at the Cape, H. Emanuel, Journal of the Society of Arts, Vol. 17, No. 861, p. 517, (1869). According to the author, “I am very anxious to state that there no longer exists any doubt in my mind as to the Cape Colony being a ‘diamond-producing country.’ That diamonds should have been found there under such novel conditions, occurring in a soil which differs considerably from that of all previously known diamond-producing districts, is no doubt startling; but it would be utterly unreasonable to set up geological precedents against patent facts [such as finding large diamonds], the well-authenticated existence of which destroys all suspicion of trickery or imposition.”\n\n\n\nThe Discovery of Diamonds at the Cape of Good Hope, W.G. Atherstone, Geological Magazine, Vol. 6, No. 59, pp. 208-213, (1869). The author disputes the conclusions of James R. Gregory (see second and third entries above), and the latter’s declaration that “the whole story of the Cape diamond discovery [was] ‘false’, ‘an imposture’, [and] a ‘bubble scheme’ got up to promote the expenditure of capital in searching for this precious substance in the colony; and stating that, from the geological character of the district which he had lately very carefully and thoroughly examined, that it was impossible that diamonds had been or could ever be found there.” The author summarizes the evidence for the occurrence of diamonds.\n\n\n\nDiscovery of Diamonds, etc., at the Cape, J.R. Gregory, Geological Magazine, Vol. 6, No. 61, pp. 333-334, (1869). A response to the letter from W.G. Atherstone (see entry above) on the occurrence of diamonds in South Africa.\n\n\n\nDiamonds and Gold at the Cape, G.S. Higson, Journal of the Society of Arts, Vol. 18, No. 923, pp. 759-760, (1870). A report by a visitor to the dry diggings near Du Toit’s Pan and nearby areas that describes the methods to sieve the soil to recover the diamonds. The author notes that it was being undertaken “with a fair modicum of success.”\n\n\n\nOn the Geology of the Diamondiferous Tracts of South Africa, J. Shaw, Cape Monthly Magazine, Vol. 1, No. 3, pp. 129-133, No. 4, pp. 249-253, and No. 5, pp. 368-372, (1870). The author presents a number of observations on the alluvial diamond deposits in the Vaal River basin. A summary of this information appeared in the South African Magazine, Vol. 3, pp. 785-787, (1869), and in Nature, Vol. 3, No. 53, pp. 2-3, (1870).\n\n\n\nDiamonds at the Cape of Good Hope, Author unknown, Mechanic’s Magazine, Vol. 93, (Oct. 14), p. 271, (1870). A brief discussion of the discovery of diamonds in South Africa and some practical means of distinguishing them from quartz or paste glass.\n\n\n\nThe Diamond-Fields of South Africa, H. Hall, English Mechanic and World of Science, Vol. 12, No. 291, pp. 99-100, (1870). The geographical setting of the diamond fields is briefly summarized by the author.\n\n\n\n“The South African Diamond Fields,” Author unknown, Edward Stafford, London, 46 pp., (1870). This booklet contains extracts of letters about the diamond fields published in South African newspapers.\n\n\n\nSouth African Diamonds, J. Tennant, Journal of the Society of Arts, Vol. 19, No. 940, pp. 15-18, (1870). A report on a public lecture on the discovery and occurrence of diamonds in South Africa. A summary of the lecture can be found in Mechanic’s Magazine, Vol. 93, (Dec. 9), p. 421, (1870), the English Mechanic and World of Science, Vol. 12, No. 299, pp. 296-297, (1870), and Hardwicke’s Science Gossip, Vol. 7, No. 73, pp. 11-12, (1871).\n\n\n\nIn Quest of Diamonds, Author unknown, Littell’s Living Age, Vol. 109, No. 1407, pp. 490-498, (1871). A description of the 500-mile wagon journey from Durban on the South African coast to the inland diamond fields along the Vaal River. The same article appears in the Cornhill Magazine, Vol. 23, No. 136, pp. 457-467, (1871).\n\n\n\nAcross the Karoo to the Diamond-Fields, Author unknown, Cape Monthly Magazine, Vol. 2, No. 10, pp. 222-231, (1871). The author recounts his experiences traveling across the arid Karoo region to the diamond fields.\n\n\n\nSouth African Diamonds, Author unknown, Progress in Chemistry, (January), pp. 130-131, (1871). “When the discovery of diamonds in South Africa was first announced … some three or four years ago, there was a tendency among many men of science to indulge in a little incredulity as to the genuineness of the reputed discovery. But whatever may have been the doubts which were conscientiously entertained at the time, they have assuredly been long since dispelled by the glowing accounts which have reached us – substantiated as those accounts have been by the arrival of larger consignments of the veritable gems … during the past quarter.” The author reports that diamonds are found on the summits or the slopes of little kopjies, or hillocks, where they are sparsely disseminated amid detrital accumulations. “We understand that many practical men at the diggings believe that the distribution of the diamonds bears some relation to the occurrence of certain trap rocks in the district, and even suspected that in or near such rocks they may find the original matrix of the gem.”\n\n\n\nAmong the Diamonds, by One Who has Visited the Fields, Author unknown, Cape Monthly Magazine, Vol. 2, No. 8, pp. 112-127, (1871). The famous Roman-era naturalist, Pliny, remarked in ancient times: “Africa is always producing something new” (Africa semper aliquid novi parti). The author states that this remark was never more appropriate than with the “startling reality” during the past year of the discovery of diamonds in the great basin of the Orange and Vaal Rivers on the border of the Cape Colony. The author presents a detailed report of a visit he made to the so-called “diamond fields.”\n\n\n\nOn the Diamondiferous Regions of South Africa, J. Shaw, Cape Monthly Magazine, Vol. 2, No. 12, pp. 358-364, (1871). The author presents preliminary geological observations on the occurrence of diamonds in sediments in the Vaal River basin.\n\n\n\nK. Mauch’s Wasserfahrt von Potchefstroom nach den Diamantenfeldern am Vaal-Fluss (Dezember 1870 – January 1871) [K. Mauch’s Water Trip from Potchefstroom to the Diamond Fields on the Vaal-River (December 1870 – January 1871)], K. Mauch, Petermann’s Geographische Mittheilungen, Vol. 17, pp. 254-257, (1871). The author summarizes a month-long trip by river to the diamond fields.\n\n\n\nThe African Diamond-Fields, Author unknown, Every Saturday Magazine, Vol. 2, No. 64, p. 251, (1871). A brief description is presented of the diamond fields.\n\n\n\nSouth-African Diamond-Mines, Author unknown, Appleton’s Journal, Vol. 5, No. 115, pp. 672-675, (1871). An early description of traveling to the diamond fields and the means used to get there to recover diamonds.\n\n\n\nThe South African Diamond-Fields, Author unknown, The Year-Book of Facts in Science and Art, pp. 202-204, (1871). The author quotes Reverend Dr. Williams of Graham’s Town who, in a letter to the London Times newspaper, stated the following about the diamond fields: “The [diamond] mine as yet, if there be any, is not in the least degree traceable. All that is certain is that there the precious gems are – on the surface and close to the surface, spread over an area of hundreds of square miles that were uninhabited and unnoticed until within two months previously…”\n\n\n\nSouth African Diamond Fields, Author unknown, The African Repository, Vol. 47, (December), pp. 367-368, (1871). A brief report on the conditions in the diamond fields.\n\n\n\nOn the Diamond Fields of South Africa, T.R. Jones, Geological Magazine, Vol. 8, No. 80, pp. 49-60, (1871). The author summarizes observations a number of individuals were making on the geologic occurrence of diamonds. Since at first it was unclear where the alluvial diamonds were coming from, some of these observations proved valuable; others were later found to be incorrect.\n\n\n\nSouth Africa and its Diamonds, T.R. Jones, Popular Science Review, Vol. 10, pp. 169-176, (1871). The author reviews the diamond occurrences in the Vaal River basin and provides observations on the geologic conditions in which they are found.\n\n\n\nGeognostische Skizzen von den Süd-Afrikanischen Diamanten-Distrikten [Geognostic Sketches of the South African Diamond District], A. Hübner, Petermann’s Geographische Mittheilungen, Vol. 17, pp. 81-87 and 210-215, (1871). The author presents a geologic description of the diamond district.\n\n\n\nThe Diamond Diggings, Author unknown, Saturday Review, Vol. 31, No. 793, pp. 16-17, (1871). A short description of the dry diggings around a place known as Klipdrift.\n\n\n\nFrom Pniel to Hebron, and What May Come from the Diamond-Fields, Author unknown, Cape Monthly Magazine, Vol. 2, No. 11, pp. 310-316, (1871). A record of the author’s travels through the diamond fields and a discussion of what their discovery might mean for the development of the country.\n\n\n\nThe Diamond Fields of South Africa, Author Unknown, London Society, Vol. 21, pp. 365-368, (1871). The author draws comparisons between the discovery of the diamond fields to the California and Australian gold rushes of the 1840s and 1850s.\n\n\n\nThirty Days at the Diamond Fields, Author unknown, All the Year Round, Vol. 25, No. 130, pp. 617-620, (1871). The author describes a month’s period along the banks of the Vaal River in search of diamonds.\n\n\n\nThe South African Diamond Mines, Author unknown, Chambers’s Journal, Vol. 48, No. 374, pp. 117-120, (1871). The early history of the diamond mines and some of the individuals involved with that history.\n\n\n\nOn the Diamond-Districts of the Cape of Good Hope, G. Gilfillan, Quarterly Journal of the Geological Society of London, Vol. 27, No. 1, pp. 72-73, (1871). The author presents observations from on a visit in June 1870.\n\n\n\nThe Diamond Fields of South Africa, Author unknown, London Society, Vol. 21, No. 124, pp. 365-368, (1872). The author discusses some of the effects of the discovery of rich diamond deposits in the country.\n\n\n\nLes Nouvelle Mines de Diamants [The New Diamond Mines], Author unknown, Magasin Pittoresque, Vol. 40, No. 23, pp. 183-184, (1872). A brief description of the diamond fields.\n\n\n\nAt the Diamond Fields by One Who has been There, Author unknown, Cassell’s Magazine, Vol. 5, pp. 15-16 and 30-32, (1872). The author describes traveling to and working at the diamond fields.\n\n\n\nAfrican Diamonds – An Invention Wanted, Author unknown, Scientific American, Vol. 26, No. 15, p. 231, (1872). A brief mention of the need for a mechanical invention to help crush the weathered rock to more easily separate the diamonds.\n\n\n\nOn the Diamond-Gravels of the Vaal River, South Africa, G.W. Stow, Quarterly Journal of the Geological Society, Vol. 28, No. 1/2, pp. 3-21, (1872). The author describes the geological occurrence of alluvial diamonds along the Vaal River.\n\n\n\nOn the Geology of the Diamond-Fields of South Africa, J. Shaw, Quarterly Journal of the Geological Society, Vol. 28, No. 1/2, pp. 21-27, (1872). Observations of the geologic setting of the alluvial diamond deposits.\n\n\n\nNotes from a Diamond Tour through South Africa, T.W. Tobin, Journal of the Society of Arts, Vol. 20, No. 1009, pp. 351-355, (1872). The author describes his experiences on an 1870 tour of the diamond fields with Edwin Streeter, the famous London jeweler.\n\n\n\nDigging for Diamonds, Author unknown, The Spectator, No. 2289, pp. 591-592, (1872). A review of a book by Charles Payton that offers practical advice for individuals thinking of traveling to the South Africa diamond fields. By this time, thousands of individuals were searching for diamonds. A review of the same book appeared in The Mining Magazine and Review, Vol. 1, pp. 372-375, (1872).\n\n\n\nThe End of the Cape Diamonds, Author unknown, Once a Week, No. 243, pp. 172-174, (1872). Based on personal experience in the diamond fields, the author advises potential immigrants to stay away because of the diminishing productivity of the alluvial and weathered surface deposits.\n\n\n\n“Diamond Fields of South Africa,” Author unknown, American News Company, New York, 238 pp., (1872). The author recounts his travels to and from the diamond fields.\n\n\n\n“The Diamond Diggings of South Africa,” C.A. Payton, Horace Cox, London, 240 pp., (1872). This book provides a description of the diamond diggings. A summary of it appeared in The Mining Magazine and Review, Vol. 1, pp. 372-375. (1872).\n\n\n\nDu Toits Pan, and Klipdrift, Griqualand-West, E. Cohen, Neues Jahrbuch für Mineralogie, Geologie und Palaeontologie, pp. 857-861, (1872) and pp. 150-155, (1873). The author describes the mining of diamonds at Du Toits Pan and at Klipdrift.\n\n\n\nLife in the Diamond Fields, A.E. Coleman, Harper’s New Monthly Magazine, Vol. 46, No. 273, pp. 321-336, (1873). A description of the 450-mile journey from the nearest coast to the diamond fields (650 miles from Cape Town), and the author’s attempt to work a claim.\n\n\n\n“Adamantia – The Truth about the South African Diamond Fields,” A.F. Lindley, W.H. & L. Collingridge, London, 423 pp. (1873). The author discusses the takeover of Boer territory in South Africa by the British.\n\n\n\nLes Mines de Diamante d’Afrique [The Diamond Mines of Africa], M. Desdemaines-Hugon, La Revue Scientifique, Series 2, Vol. 3, No. 21, pp. 493-497, (1873). A summary of diamond mining.\n\n\n\nDiamond-Digging at Pniel, Author unknown, Chambers’s Journal, Vol. 50, No. 500, pp. 468-470, (1873). The author’s account of his 10-day trip from Cape Town to Pniel, which he terms was the “eldest” of the diamond diggings, and his work as a miner.\n\n\n\n“To the Cape for Diamonds,” F. Boyle, Chapman and Hall, London, 415 pp. (1873). A book about the experiences of an individual who traveled to and worked in the diamond fields.\n\n\n\nLife in the New Diamond Diggings, R.W. Miller, Scribner’s Monthly, Vol. 5, No. 5, pp. 529-538, (1873). A description of normal life in the diamond fields. Includes an description of diamond mining methods being used.\n\n\n\nOn A Visit to the Diamond Fields of South Africa, with Notices of Geological Phenomena by the Wayside, J. Paterson, Proceedings of the Geologists’ Association, Vol. 3, No. 2, pp. 70-80, (1873). The author’s observations of various geological characteristics of the countryside from Port Elizabeth to the diamond fields.\n\n\n\nThe Diamond Mines of Africa, Author unknown, Science Record, pp. 535-542, (1874). This article presents a description of the methods used to mine the dry alluvial diamond diggings.\n\n\n\nRemarks on the Geographical and Physical Character of the Diamond Fields of South Africa, T. Shepstone, Journal of the Society of Arts, Vol. 22, No. 1113, pp. 390-392, (1874). A discussion of the geography of the diamondiferous country in the Vaal River basin.\n\n\n\nSupplementary Remarks on the Commercial Aspects and Influences of the South African Diamond and Gold Fields, R.J. Mann, Journal of the Society of Arts, Vol. 22, No. 1113, pp. 392-397, (1874). After reviewing the gold and diamond deposits, the author discusses the economic impact mining was having on South Africa.\n\n\n\nLes Mines de Diamans du Cap [The Diamond Mines of the Cape], M. Desdemaines-Hugon, Revue des Deux Mondes, Vol. 3, Pt. 3, pp. 569-600, (1874). A detailed description of the alluvial deposits in the diamond fields.\n\n\n\nOn the Mode of Occurrence of Diamonds in South Africa, E.J. Dunn, Quarterly Journal of the Geological Society of South Africa, Vol. 30, No. 1/2, pp. 54-60, (1874). Diamond recovery is being made from the rocks that brought them to the land’s surface. The igneous rocks occur in circular, pipe-like bodies emplaced in sedimentary shales.\n\n\n\nOn the Character of the Diamontiferous Rock of South Africa, N. Story-Maskelyne and W. Flight, Quarterly Journal of the Geological Society of London, Vol. 30, No. 1/2, pp. 406-416, (1874). Observations on the diamond-bearing rocks recovered at several of the deposits.\n\n\n\n“The South African Diamond Fields,” A.H. Hornsby, Inter-Ocean Steam Book and Job Print, Chicago, 78 pp., (1874). The author recounts his experiences traveling and working in the diamond fields.\n\n\n\nNotes on Diamonds from the Cape of Good Hope , J. Tennant, Geological Magazine, Vol. 2, No. 11, pp. 545-547, (1875). The author comments on some of the first South African diamonds being brought to the United Kingdom, including the statement that they are of a “number and quality [..] equal to those from the Brasils, which have chiefly supplied Europe during the last eighty years.” He also mentions the revival of diamond-cutting taking place in London.\n\n\n\nThe Diamond-Mines of the Cape, Author unknown, Appleton’s Journal, Vol. 13, No. 304, pp. 78-79, (1875). A short description of the travel routes from the coast to the diamond fields, and of the character of the countryside.\n\n\n\nNotes on the Diamonds from the Cape of Good Hope, J. Tennant, Geological Magazine, Vol. 2, No. 11, pp. 545-547, (1875). The author provides a general description of the nature of the diamonds found recently in South Africa.\n\n\n\nThe Diamond Fields of Griqualand, and their Probable Influence on the Native Races of South Africa, J.B. Currey, Journal of the Society of Arts, Vol. 24, No. 1217, pp. 372-381, (1876). The article reviews the history of discovery and the extent of the diamond fields, the methods used to recover the diamonds, and the possible economic benefits that could be used to improve the lives of the native races.\n\n\n\nFurther Notes on the Diamond-Fields of South Africa…, E.J. Dunn, Quarterly Journal of the Geological Society, Vol. 33, No. 1/2, pp. 879-883, (1877). Based on a visit, the author describes some geologic features of the kimberlite pipes at the De Beer’s mine.\n\n\n\n“South African Diamond Fields and the Journey to the Mines,” W.J. Morton, American Geophysical Society, 32 pp., (1877). The author describes his travel to South Africa and life in the diamond fields in an address given to the American Geophysical Society.\n\n\n\nTo South Africa for Diamonds!, W.J. Morton, Scribner’s Monthly, Vol. 16, No. 4, pp. 551-563 and No. 5, pp. 662-675, (1878). The author describes a journey from America to England, to Cape Town in South Africa, and then by stagecoach and mule-or ox-team the 800 miles inland from the coast to reach the diamond fields (in all, a distance of more than 10,000 miles). He describes the diamond mines, the nearby settlements and the methods used to recover the diamonds.\n\n\n\nComposition et Origine du Sable Diamantifère de Du Toit’s Pan (Afrique Australe) [On the Composition and Origin of the Diamondiferous Sands at Du Toit’s Pan, South Africa], S. Meunier, Comptes Rendus Hebdomadaires des Séances de L’Académie des Sciences, Vol. 84, No. 6, pp. 250-252, (1877). The author discusses the diamond-bearing sediments in one of the alluvial diamond areas.\n\n\n\nLes Mines de Diamants de l’Afrique Australe [The Diamond Mines of Southern Africa], H. Blerzy, La Nature, Vol. 6, No. 240, pp. 81-83, (1878). A brief report on the diamond mines.\n\n\n\nVoyage aux Mines de Diamants dans le Sud de l’Afrique [Voyage to the Diamond Mines of South Africa], Author unknown, Le Tour du Monde, Vol. 36, No. 931, pp. 289-304, No. 932, pp. 305-320, No. 933, pp. 321-335, (1878). A female traveler’s record of a visit to the diamond fields in 1872.\n\n\n\nDiamonds, F.M. Endlich, American Naturalist, Vol. 12, No. 7, pp. 419-430, (1878). General information on diamonds, including their sources, ideas on their causes of color and famous gemstones.\n\n\n\nDie Diamantfelder Süd-Afrika’s [The South African Diamond Fields], E. Lippert, Mitteilungen der Geographischen Gesellschaft in Hamburg, Vol. 2, pp. 327-340, (1878). A review of diamond mining for the decade of 1868 to 1878.\n\n\n\nSur les Mines de Diamant de l’Afrique Australe [About the Diamond Mines of Southern Africa], M. Chaper, Bulletin de la Société Minéralogique de France, Vol. 2, No. 7, pp. 195-197, (1879). A short description of the diamond mines.\n\n\n\nThe South-African Diamond Fields, Author unknown, Chambers’s Journal, Vol. 57, No. 870, pp. 551-553, (1880). A short summary of life in the diamond fields.\n\n\n\nOn a Crystal of Diamond, H. Baker, Journal of the Chemical Society, Vol. 37, pp. 579-581, (1880). An unusual twinned diamond − eight crystals intergrown in a parallel arrangement − is described.\n\n\n\nLes Mines de Diamants de l’Afrique Australe [The Diamond Mines of Southern Africa], J.A. Roorda-Smit, Archives Néerlandaises des Sciences Exactes et Naturelles, Vol. 15, pp. 61-74, (1880). The geological setting of the diamond diggings is presented.\n\n\n\nJourney through Central South Africa, from the Diamond Fields to the Upper Zambesi, E. Holub, Proceedings of the Royal Geographical Society, Vol. 2, pp. 166-182, (1880). An account of an individual who visited the diamond fields in 1872.\n\n\n\nLes Mines de Diamant de l’Afrique Australe [The Diamond Mines of Southern Africa], G. Tissandier, La Nature, Vol. 9, No. 410, pp. 295-298, (1881). A brief summary of the diamond mines near Kimberley.\n\n\n\nDiamond Fields of South Africa, E.W. Murray, Journal of the Society of Arts, Vol. 29, No. 1478, pp. 370-384, (1881). The author describes the development of diamond mining along the Vaal and Orange rivers.\n\n\n\nThe Diamond Mines of South Africa, E.B. Biggar, Lippincott’s Magazine, Vol. 29, No. 159, pp. 217-231, (1881). A description of life in the diamond fields.\n\n\n\nNotes on the Diamond Fields, South Africa , E.J. Dunn, Quarterly Journal of the Geological Society of London , Vol. 37, No. 1/4, pp. 609-612, (1881). Observations on the setting of the diamond deposits near Kimberley.\n\n\n\nUeber die Südafrikanischen Diamantfelder [About the South African Diamond Fields] , E. Cohen, Vierter Jahresbericht des Vereins für Erdkunde zu Metz , No. 6, pp. 129-165, (1882). A detailed description of the diamond fields.\n\n\n\nOn the Diamond Fields and Mines of Kimberley, South Africa , J.N. Paxman, Minutes of Proceedings of the Institution of Civil Engineers, Vol. 74, pp. 59-90, (1883). A detailed description of a presentation on the mines around Kimberley and of the mining methods in use at the time. A summary of the presentation appeared in the Engineering and Mining Journal, Vol. 35, No. 26, p. 882, (1883).\n\n\n\nLes Mines de Diamants du Cap [The Diamond Mines of the Cape] , F. Boxhorn, La Nature, Vol. 11, No. 1, pp. 311-315, (1883). The author describes the diamond mining operations near Kimberley.\n\n\n\nOn a Recent Hypothesis with Respect to the Diamond Rock of South Africa , W.H. Huddleston, Mineralogical Magazine, Vol. 5, No. 25, pp. 199-210, (1883). The author discusses some of the varied geological observations on the diamond host rock and what those observations might imply for the rock’s formation.\n\n\n\nA Recent Visit to the Boers , R. Loyd-Lindsay, Littell’s Living Age, Vol. 160, No. 2066, pp. 212-222, (1884). This article describes the voyage from England to South Africa (three weeks by boat), and then the journey inland to the diamond fields. By this time, the surface dry diggings had been mostly exploited, and mining was reaching down to unweathered kimberlite. This harder rock was hoisted to the surface in buckets and spread out on the surface for several months to break down. Washing this decomposed rock reduced it into mud, which could then be processed to recover the diamonds without damaging them. The author describes the principal diamond mines and the nearby settlements.\n\n\n\nThe South Africa Diamond Fields, Author unknown, Mining and Scientific Press, Vol. 49, No. 21, p. 322, (1884). This brief report gives some statistics about the mining operations. It states that in 1883, 350,000 loads of kimberlite ore (each load representing 16 cubic feet) were removed from the Kimberley mine and yielded 947,787 carats of diamonds.\n\n\n\n“L’Etoile du Sud – Le Pays des Diamants” [The Star of the South – The Diamond Deposits ] , J. Verne, Collection Hetzel , Paris, (1884). A fictional story by the famous novelist about the diamond fields and a famous diamond.\n\n\n\nNotes on the Great Kimberley Diamond Mine , W.P. Marshall, Midland Naturalist, Vol. 7, pp. 93-98, (1884). The author describes the diamond mines near Kimberley.\n\n\n\nThe Diamond Fields of South Africa , G.E. Smith, Transactions of the Mining Institute of Scotland, Vol. 6, Pt. 1, pp. 48-57, (1884), and A Mining Tour through South Africa, (same journal and author), Vol. 9, pp. 17-36, (1887). The author describes the diamond fields in these two articles.\n\n\n\nThe True Story of the Finding of the First Cape Diamond , Author unknown, Leisure Hour, Vol. 34, pp. 686-687, (1885). A short story about how Schalk van Niekerk purchased what later proved to be a diamond from the Jacobs family. The article states that when he sold it for £500, he gave half to the family as a reward.\n\n\n\nThe Origin and Home of the Diamond , W.J. Harrison, Knowledge Magazine, Vol. 7, (May 8), pp. 390-391, (May 22), pp. 438-439, and (June 5), p. 478, (1885). By the early 1880s, there were six principal mines in the dry diggings – Du Toit’s Pan, De Beers, Bultfontein, Kimberley, Koffiefontein and Jagersfontein – all in an area south of the Vaal River. Exploitation of these mines revealed that the diamond-bearing kimberlite rock occurred in vertical pipes that were thought to represent magma channels below volcanic craters removed by erosion. The author reviews several theories of the origin of these igneous rock pipes.\n\n\n\nMémoire su la Géologie Générale et sur les Mines de Diamants de l’Afrique du Sud [Memoir on the General Geology and the Diamond Mines of South Africa] , A. Moulle, Annales des Mines, Vol. 7, No. 2, pp. 193-342, (1885). The author presents a detailed description of the geology and diamond mines in South Africa.\n\n\n\nOn the Diamond Rocks of South Africa , H.E. Roscoe, Proceedings of the Manchester Literary and Philosophical Society, Vol. 24, pp. 5-10, (1885). Some analytical data are presented on the composition of the diamond-bearing kimberlite rocks.\n\n\n\nNotes on the Diamond Rock of South Africa , W.H. Huddleston, Proceedings of the Geologists’ Association, Vol. 8, pp. 63-81, (1885). The author discusses observations on the diamond host rock and ideas on its formation.\n\n\n\nDiamond Mining at the Cape , T. Reunert, “Official Handbook – History, Productions and Resources of the Cape of Good Hope”, Cape Town, pp. 177-219, (1886). This chapter describes in detail the history, development and operation of the diamond mines.\n\n\n\nObservations Complémentaires sur l’Origine des Sables Diamantiféres de l’Afrique Australe [Additional Observations on the Origin of the Diamond-bearing Sands of Southern Africa] , S. Meunier, Comptes Rendus Hebdomadaires des Séances de l’Academie des Sciences, Vol. 102, No. 11, pp. 637-640, (1886). The author discusses the origin of the diamond-bearing sediments.\n\n\n\nAfrican Diamond Mining , Author unknown, Scientific American Supplement , Vol. 22, No. 553, pp. 8833-8834, (1886). A brief report of the diamond mines.\n\n\n\nThe Diamond Mines of South Africa , G.F. Williams, Engineering and Mining Journal , Vol. 42, No. 20, pp. 345-347 and No. 21, pp. 363-366, (1886). The author describes operations at the major diamond mines in an address before the American Institute of Mining Engineers. The article was also published in the Transactions of the American Institute of Mining Engineers, Vol. 15, pp. 392-417, (1887).\n\n\n\nThe Diamond Fields of South Africa , G.J. Nathan, Longman’s Magazine , pp. 535-546, (1886). The author discusses the development of the diamond mines near Kimberley.\n\n\n\nDiamonds and the Diamond Fields , P.M. Laurence, “The South African Exhibition, Port Elizabeth, 1885,” Chapter 13, pp. 255-283, (1886). The published record of a public lecture given by the author as part of this national exhibition.\n\n\n\nThe South-African Diamond Mines , Author unknown, Popular Science Monthly, Vol. 30, (February), pp. 459-473, (1887). The author reviews the historic sources of diamonds, than summarizes the history and mining operations in the diamond fields.\n\n\n\nThe Diamond Mines of South Africa , G.F. Williams, Transactions of the American Institute of Mining Engineers, Vol. 15, pp. 392-417, (1887). The author describes in detail the main diamond-mining operations near Kimberley.\n\n\n\nFour Large South African Diamonds , G.F. Kunz, Science, Vol. 10, No. 235, pp. 69-70, (1887). Four large diamond crystals, including the one that yielded the 128.54-ct Tiffany Yellow diamond, are briefly described.\n\n\n\nDiamond Mines, Author unknown, Mining and Scientific Press, Vol. 54, No.26, p. 1 and Vol. 55, No. 1, p. 5, No. 2, p. 1, No. 3, p. 37, No. 4, p. 53, No. 5, p. 67, (1887). A brief description of the diamond mines.\n\n\n\nSouth African Diamond Mines, Author unknown, Mining and Scientific Press, Vol. 55, No. 13, p. 196, (1887). Gardner F. Williams, a mining engineer from the United States, departs for South Africa to become the general manager of the De Beers mine.\n\n\n\nOn the Origin of the Diamond-Mines of South-Africa, R. Marloth, Transactions of the South African Philosophical Society, Vol. 4, Pt. 1, pp. 62-65, (1887). The author discusses ideas related to the formation of the diamond-bearing kimberlite pipes.\n\n\n\nDiamond Digging in South Africa, J. Andrew, Papers and Proceedings of the Royal Society of Tasmania for 1887, pp. 98-106, (1888). The importance of diamond mining to the economic development of the country is discussed by the author.\n\n\n\n“Diamonds and Gold of South Africa”, H. Mitchell, F.C. Mathieson & Son, London, 131 pp., (1888). This book describes the principal diamond mines and provides information on their annual diamond production.\n\n\n\nThe Matrix of the Diamond, C. Lewis, Geological Magazine, Series 3, Vol. 5, No. 3, pp. 129-131, (1888). The author describes the igneous host rock of the diamond, and on the basis of its unique structure and composition, proposes it be given the name kimberlite. A short version of this article appeared in the Chemical News, Vol. 56, No. 1454, p. 153, (1887).\n\n\n\nDiamond Mining, Author unknown, Mining and Scientific Press, Vol. 57, No. 3, p. 40, (1888). A brief report of the operations of the De Beers mine in 1887 under the direction of G.F. Williams.\n\n\n\nLes Mines de Diamants [The Diamond Mines], L. Beauval, La Science Illustrée, Vol. 4, No. 98, pp. 307-308, (1889). The author briefly describes the diamond mines and how diamonds from South Africa were being exhibited at international exhibitions in Europe.\n\n\n\nLe Diamant dans l’Afrique Asutrale [The Diamonds of Southern Africa], G.A. Daubrée, Journal des Savants, (December), pp. 740-753, (1889). Based on information taken from several published books, this article presents a review of the diamond fields. A similar article by the same author was published in Cosmos, Vol. 15, No. 262, pp. 244-245, No. 263, pp. 271-273, and No. 264, pp. 299-300, (1890).\n\n\n\nDiamond Mining, Author unknown, Mining and Scientific Press, Vol. 54, No. 19, pp. 279, 287, (1889). A brief description with illustrations of the De Beers mine.\n\n\n\nKimberley and Its Diamonds, Author unknown, Illustrated American, Vol. 4, No. 37, pp. 283-287, (1890). The author describes a visit to the diamond mines.\n\n\n\nDiamond-Digging in South Africa, H. Knollys, Blackwood’s Edinburgh Magazine, Vol. 150, No. 911, pp. 317-333, (1891). This article describes the life of miners in the diamond fields near Kimberley. The same article appeared in Littell’s Living Age, Vol. 191, No. 2473, pp. 471-482, (1891).\n\n\n\nThe Diamond Mines of South Africa, V. Cornish, Knowledge Magazine, Vol. 14, (October 1), pp. 186-188, (1891). A short description of the diamond mines.\n\n\n\nDiamond Mining in South Africa, G.D. Stonestreet, Engineering Magazine, Vol. 1, No. 5, pp. 579-591, (1891). A description of recovering diamonds near Kimberley.\n\n\n\nThe Discovery of the South African Diamond Mines, J. Thorburn, Engineering and Mining Journal, Vol. 52, No. 17, pp. 481-482, (1891). A brief recounting of the story of the discovery of diamonds in 1867.\n\n\n\nDie Diamant-Gruben von Kimberley in Süd-Afrika [The Diamond Mines of Kimberley in South Africa], B. Knochenhauer, Zeitschrift für das Berg-, Hütten- und Salinen-Wesen im Preussichen Staate, Vol. 39, pp. 261-282, (1891). The author describes the mines near Kimberley based on a visit to the area in 1889 and 1890.\n\n\n\nLes Mines de Diamant de l’Afrique Australe [The Diamond Mines of Southern Africa], M. Chaper, Revue Scientifique, Vol. 49, No. 10, pp. 289-296, (1892). The author describes the diamond fields.\n\n\n\nThe Diamond Industry at Kimberley, R. Churchill, Popular Science Monthly, Vol. 41, (August), pp. 455-463, (1892). The author discusses the diamond mining operations at Kimberley.\n\n\n\nThe Kimberley Diamond Mines, W.H. Hazell, Hazell’s Magazine, Vol. 6, (September), pp. 255-257, (1892). The author describes Kimberley as the most prosperous town in South Africa because of the diamond industry − 25 years after diamonds are found.\n\n\n\nRecherches Minéralogiques sur les Gisements Diamantifères de l’Afrique Australe [Mineralogical Research on the Diamond Deposits of South Africa], S. Meunier, Bulletin de la Société d’Histoire Naturelle d’Autun, Vol. 6, pp. 153-202, (1893). A study of the various igneous rocks found in the diamond mines.\n\n\n\nThe Story of the South African Diamond Mines , J. Reid, Good Works, Vol. 34, No. 43, pp. 613-620, (1893). The author describes the recovery of diamonds in the Kimberley region during the first two decades of mining activity.\n\n\n\nPuzzles from a Diamond Mine , Author unknown, Chambers’s Journal, Vol. 10, No. 490, pp. 310-312, (1893). Interesting discoveries in kimberlite ore at the Premier and Kimberley mines include pieces of charred fossilized wood and broken pieces of diamond crystals, which were found widely separated and could be reassembled.\n\n\n\nThe Diamond Mines , T. Reunert, “Illustrated Official Handbook of the Cape and South Africa,” Chap. 15, pp. 323-356, (1893). The history and development of the first 25 years of the diamond fields.\n\n\n\n“Diamonds and Gold in South Africa ,” T. Reunert, J.C. Juta & Company, Capetown, 242 pp. (1893). This book describes mining techniques used in the country.\n\n\n\nThe Mining Industries of South Africa, as Shown at the Kimberley Exhibition, B.H. Brough, Journal of the Society of Arts, Vol. 41, No. 2096, pp. 166-178, (1893). An international exhibition held in the fall of 1892 in Kimberley contained a display of diamond mining. The article is a published account of a lecture about the exhibition that was given by the author in London."}]}