{"Anthony Dimond was elected to the California State Assembly in 1883.": [{"url": "https://kids.britannica.com/students/article/Anthony-Joseph-Dimond/311018", "page_content": "Harris and Ewing Collection/Library of Congress, Washington, D.C. (digital file no. LC-DIG-hec-28851)\n\n(1881–1953). American lawyer and political leader Anthony Joseph Dimond was a champion of Alaskan statehood. He also stressed the importance of the Alaska Highway, which, when completed, was the only land route to connect Alaska with the mainland United States (through Canada).\n\nDimond was born on November 30, 1881, in Palatine Bridge, New York. After teaching from 1900 to 1903, he moved to Alaska in 1904 to work as a prospector and miner. Dimond also studied law, and in 1913 he was admitted to the bar and began practicing in Valdez, Alaska. Later that year he became the U.S. commissioner at Chisana, Alaska, where he worked with gold miners and their claims. In 1917 Dimond became the special assistant to the U.S. attorney in Valdez.\n\nDimond served as mayor of Valdez for nine years, from 1920 to 1922 and from 1925 to 1932. From 1923 to 1926 and from 1929 to 1932 he was a member of the Alaska Territorial Senate. In 1933 Dimond was elected as the Alaskan representative to the U.S. Congress, and he was reelected five successive times. Although he worked tirelessly for Alaskan statehood, the feat would not be accomplished until 1959, after his death. Dimond left Congress in 1945 to become a district court judge in Anchorage, Alaska. He died there on May 28, 1953."}, {"url": "https://www.latimes.com/california/story/2022-11-10/california-assembly-elects-democrat-robert-rivas-as-speaker", "page_content": "California Democrats voted in a new leader in the state Assembly on Thursday, selecting San Benito County Assemblyman Robert Rivas after a chaotic hours-long power struggle over one of the top political positions in the state.\n\nRivas, 42, will replace Speaker Anthony Rendon (D-Lakewood) in June, marking an end to months of jockeying in the lower house of the state Legislature. Rendon, whose seven years as speaker marked the longest tenure since the 1990s, will term out of office in 2024.\n\n“I’m excited to just finally get this vote on the books,” Rivas (D-Hollister) joked after the announcement. “We will begin this process united.”\n\nAdvertisement\n\nRendon and Rivas clashed this year when Rivas said he had secured the votes to become speaker, which Rendon acknowledged, only for there to be no timeline for the transition.\n\nCalifornia Gov. Gavin Newsom loses top aide, taps two key advisors California Gov. Gavin Newsom tapped a former top aide to Jerry Brown and promoted a staff member to fill the two most powerful roles in his administration.\n\nLeadership changes in the Legislature are often negotiated in private before being made public in a statement by the outgoing and incoming leaders. A formal vote typically takes place when a new legislative session convenes, which this year will be Dec. 5.\n\n“I’m pleased to retain my colleagues’ support to continue as Speaker of the California Assembly and leader of our Democratic Caucus,” Rendon said in a statement. “I will continue working for the Californians who need it most, and keep putting power in the hands of my members, especially those who are underrepresented.”\n\nWith a massive turnover among lawmakers in the Assembly, the general election Tuesday stood to erode or cement Rivas’ support ahead of a caucus meeting Thursday and a formal vote Dec. 5.\n\nThough Rivas’ camp entered Thursday’s leadership vote assured, the meeting became a chaotic scramble for power, with questions about parliamentary procedure and a new name for speaker briefly pushed forward: Assemblyman Evan Low (D-Campbell), numerous sources told The Times. Low previously angered Rendon by trying to make a run for speaker last year.\n\nRendon’s laid-back personality and hands-off management style have caused some to criticize him as not being involved enough in shepherding legislation through the Assembly. He instead empowered his committee chairs. Rivas’ ascent next year is likely to mean a shakeup among key Assembly positions, including those on committees that determine which bills are passed each year.\n\nRivas was elected to the Assembly in 2018 after serving eight years on the San Benito County Board of Supervisors. The Latino lawmaker was raised by his single mother and grandparents in Paicines, where his grandfather was a farmworker who joined United Farm Workers in fighting for fair pay.\n\nRivas’ Assembly district encompasses Paicines, along with Big Sur, Gilroy, Salinas, Watsonville and other Central Coast communities.\n\nTimes staff writers Taryn Luna and Mackenzie Mays contributed to this report."}, {"url": "https://www.usnews.com/news/best-states/california/articles/2022-11-11/california-assembly-announces-leadership-change-for-2023", "page_content": "By ADAM BEAM, Associated Press\n\nSACRAMENTO, Calif. (AP) — California Assembly Speaker Anthony Rendon says he will step down next summer, ending what will be a seven-year run as one of the state's most powerful politicians before he is termed out of office in 2024.\n\nRendon said Thursday he will relinquish the speakership on June 30, turning it over to Robert Rivas, a Democrat from California's Central Coast — the region along the Pacific Ocean between Los Angeles and the San Francisco Bay Area.\n\n“I will continue working for the Californians who need it most, and keep putting power in the hands of my members, especially those who are underrepresented,” Rendon, a Democrat, said in a news release. “I look forward to working with Assemblymember Rivas in anticipation of a smooth transition in 2023.”\n\nThe Assembly speaker wields immense power in California, acting as the 80-member chamber's chief negotiator with the governor and the president of the state Senate on major legislation and the state's $300 billion operating budget.\n\nPolitical Cartoons View All 1021 Images\n\nRivas is the grandson of Mexican immigrants. He said his grandfather was a migrant farmworker who stood with Cesar Chavez and the United Farm Workers to advocate for worker rights.\n\nRivas’ biography on his official website says he struggled to overcome a severe stutter as a child “that rendered him almost speechless.” He was first elected to the Legislature in 2018. His district includes San Benito County and parts of Monterey, Santa Clara and Santa Cruz counties.\n\nIn the Assembly, Rivas has been chair of the Agriculture Committee and worked to pass coronavirus protections and more housing opportunities for farmworkers.\n\n“As the grandson of immigrant farmworkers, I hope to ensure the door of opportunity that was available to my family remains open for future generations,” Rivas said.\n\nRendon and Rivas have few policy differences, so the change is not likely to alter the priorities of the Assembly. Democrats control so many seats that they can pass bills without the need of Republican votes.\n\nBut the announcement ends a messy power struggle that has divided Democratic lawmakers since the summer, when Rivas first approached Rendon about taking over the top job. Rendon resisted, sparking a leadership fight that carried over into the November elections.\n\nRivas and Rendon campaigned for Democratic candidates in an attempt to secure enough support to win the job. Thursday — two days after the election — newly elected Assembly Democrats met for the first time to elect their officers.\n\nAfter hours of meeting in private, lawmakers emerged to announce that Rendon would remain speaker through next summer, allowing him to lead one more budget cycle and a likely special session focused on gas prices.\n\nThe caucus named Rivas “speaker designee.”\n\n“I would like to thank Speaker Rendon and my colleagues, and I am humbled by this opportunity,” he said."}, {"url": "https://history.house.gov/People/Detail/12264", "page_content": "University of Alaska-Fairbanks\n\nElmer E. Rasmuson Library Alaska and Polar Regions Department\n\nFairbanks, AK\n\nPapers: 1904-1953, 33 cubic feet. The Anthony J. Dimond Papers consist of legislative, political and personal files relating to his work from 1904 until his death. The bulk of the material relates directly to his service as Territorial Delegate to Congress. His activities as federal court judge are related in the personal files. A finding aid is available in the repository.\n\nPapers: In Donohoe-Ostrander-Dimond papers, 1903-1933. ca. 15 feet. Law firm records. Finding aid in repository. Restricted.\n\nOral History: Mary Lee Council and Vide Bartlett. April 23, 1975. Council worked in Bartlett's office and discusses issues affecting Alaska.\n\nOral History: Sister Marie Theresa Dimond, daughter. April 20, 1975. Discusses her father's political career, Bob Bartlett, and growing up in Valdez, Alaska.\n\nOral History: Dorothy Haaland. July 30, 1981. Discusses her association with Dimond and activities in statehood movement. Summary and log available.\n\nOral History: Bruce B. Kendall. July 23, 1981. Discusses his activities in Republican Party during statehood struggle of 1940's and 1950's. Summary and log available.\n\nOral History: Katherine D. Nordale. August 10, 1981. Discusses government and public policy before and after statehood. Summary and log available."}, {"url": "https://blackcaucus.legislature.ca.gov/members/past", "page_content": "Hon. Frederick M. Roberts – California's First African American Legislator 1918-1934 | California State Assembly Frederick Madison Roberts, was born September 14, 1879 in Chillicothe, Ohio. He was a newspaper owner, editor, educator and business owner, and California’s first known African American state legislator. A member of the Republican Party representing Los Angeles, he was the great grandson of Sally Hemmings and is believed to be the great grandson of President Thomas Jefferson. Roberts sponsored California’s early civil rights legislation and authored a bill to establish UCLA. He served 16-years in the California State Assembly from 1918 to 1934. He died in 1952, at the age of 72.\n\nHon. Augustus F. Hawkins 1934-1960 | California State Assembly Augustus Freeman ‘Gus’ Hawkins, was born August 31, 1907 in Shreveport, Louisiana. A graduate of UCLA and a Democratic Party member from Los Angeles, was elected to the California State Assembly in 1934, succeeding Frederick M. Roberts. He chaired the Assembly’s powerful Rules Committee during his tenure in the Legislature. His legislative agenda reflected the importance he placed on education, civil rights, organized labor and fair practices in employment and housing. ‘Gus’ Hawkins served more than 20-years in the California State Assembly, and was subsequently elected to the U.S. House of Representatives in 1962. He retired from the House of Representatives in 1991, and died in 2007, at the age of 100.\n\nHon. W. Byron Rumford 1948-1966 | California State Assembly William Byron Rumford was born in 1908 in Courtland, Arizona. A graduate of UC San Francisco School of Pharmacy and certified pharmacist, Rumford also earned a BA in Political Science and MA in Public Administration, both from UC Berkeley. He applied his knowledge in the areas of housing, health, and narcotics legislation. He passed the Fair Employment Practices Act of 1959 that outlawed discrimination in employment. Rumford’s bill led to the establishment of California’s Fair Employment Practices Commission. He authored the Rumford Fair Housing Act signed by Governor Edmund G. Brown, Sr. in 1963 that outlawed discrimination in housing. The California Supreme Court upheld the Rumford Fair Housing Act when it ruled that Proposition 14, a Constitutional Amendment to invalidate the act and permit housing discrimination, was unconstitutional. Byron Rumford was the first African American elected to public office in Northern California. He died in 1986, at the age of 80.\n\nHon. Mervyn M. Dymally 1962-1966 | California State Assembly\n\n1966-1982 | California State Senate\n\n2002-2006 | California State Assembly Mervyn Malcolm Dymally, PhD, was born May 12, 1926 in Cedros, Trinidad. A graduate of California State University, Los Angeles with a BA in education, he also earned a MA in government from California State University, Sacramento and a PhD from United States International University, San Diego. During his extraordinary career in government service, he served in the California State Assembly (1962), the first African American member of the California State Senate (1966), Lieutenant Governor (1974), U.S. House of Representatives (1980), and a second term in the California State Assembly (2002). Among his accomplishments in the California State Legislature, was his role in passing legislation that created the Charles R. Drew Postgraduate Medical School through a state partnership with UCLA. In 1968, the medical school, now known as the Charles R. Drew University of Medicine and Science, became the academic institution for doctor training at L.A. County’s Martin Luther King, Jr. General Hospital, which opened to patients in 1972. He was also one of the founding members of the California Legislative Black Caucus. After retiring from the U.S. House of Representatives, Mervyn Dymally was re-elected forty years after first serving in the California State Legislature, to the Assembly and served until his second retirement in 2008. He died in 2012, at the age of 86.\n\nHon. F. Douglas Ferrell 1963-1966 | California State Assembly Reverend F. Douglas Ferrell was born February 21, 1915 in Gonzales City, Texas. He was the first African American to represent the Watts community in Los Angeles in the California State Legislature. He earned a doctorate in Divinity, was an ordained Baptist minister. He founded Tabernacle of Faith Baptist Church in South Los Angeles, and also served as vice president of the California State Baptist Convention prior to his Assembly election as a Democrat in 1962. His political philosophy was: \"Therefore all things whatsoever ye would that men would do to you, do ye even so to them; for this is the law and the prophets.\" He was an ardent advocate for civil rights and equal rights, and a staunch opponent of racial discrimination. His vocation as a pastor and legislator focused on youth and missionary causes. He fought for school integration in the Los Angeles Unified School District in the early 1960s. Reverend Ferrell died in 1982, at the age of 67.\n\nHon. Willie L. Brown, Jr. 1965-1995 | California State Assembly Willie Lewis Brown, Jr., was born March 20, 1934 in Mineola, Texas. A graduate of San Francisco State College (now known as California State University, San Francisco) with a BA in Liberal Studies, he also earned his JD from UC Hastings College of Law. He was the fourth African American to serve in the 80-member Assembly when he was elected in 1964. He was the first African American and longest serving Speaker of the Assembly, a top legislative leadership post he held for 16-years. In the early 1980s, he led efforts to divest state university holdings in South Africa during that nation’s apartheid era and was a strong advocate for increased funds for AIDS research. Additionally, he authored landmark legislation that legalized sex between consenting adults in California. He retired from the Assembly in 1995, and was elected Mayor of San Francisco in 1995, until his retirement in 2004. In 2013, legislation to rename the western span of the Bay Bridge, the Willie L. Brown, Jr., bridge was passed. The signs went up in 2014 and Brown said that he hoped having the bridge named for him would be, “inspirational for kids.”\n\nHon. Yvonne Brathwaite Burke 1966-1972 | California State Assembly Yvonne Brathwaite Burke, was born October 5, 1932 in Los Angeles, California. A graduate of UCLA with a law degree from University of Southern California (USC) Gould School of Law in 1956, she was the first African American woman elected to the California State Assembly in 1966. During her legislative tenure, she focused on civil rights and juvenile issues. She chaired the Assembly Committee on Urban Development. One year before her election to the Assembly, she was appointed by Governor Edmund G. ‘Pat’ Brown, Sr. to serve on the McCone Commission to study social conditions that led to the August 1965 Watts Rebellion (also referred to as the 1965 Watts Riots). She was the first African American woman from the Golden State in the U.S. House of Representatives in 1973, and continued to break new ground as the first woman to have a child and secure maternity leave while serving in the U.S. Congress. She became the first African-American member of the Los Angeles Board of Supervisors, a position she has held on and off since 1978. Assemblywoman Burke retired from the Los Angeles County Board of Supervisors in 2008.\n\nHon. Bill Greene 1966-1975 | California State Assembly\n\n1975-1992 | California State Senate Bill Greene was born in 1930 in Kansas City, Missouri. He attended the University of Michigan, and served in the U.S. Army. Bill Greene was a freedom rider during the Civil Rights Movement and was jailed in Mississippi. A Democrat representing South Los Angeles, served in the Assembly from 1967 to 1975. He succeeded his close friend, Mervyn M. Dymally. In 1975, when then Senator Mervyn Dymally won election as state Lieutenant Governor, Bill Greene won his election to represent Dymally’s former Senate district. He served in the Senate until 1992. Bill Greene served as chair of the Senate Industrial Relations Committee. He became an expert on labor and workers’ compensation insurance issues. Before his election to the Assembly, Bill Greene was the first African American to serve as a Clerk of the Assembly. With deep roots in civil rights activism and union advocacy, he made major contributions to the fields of education, childcare, employment, and equal rights. He retired from the Senate in 1992, and died December 2, 2002. He was 72 years old.\n\nHon. John J. Miller 1966-1975 | California State Assembly John J. Miller, was born July 28, 1932 in Savannah, Georgia. A Democrat representing Berkeley, John Miller graduated from Howard University School of Law. He was elected to serve as Assembly Minority Leader by his fellow Democratic Assembly colleagues in 1970. Prior to his election to the Assembly, he served as President of the Berkeley Board of Education and a member of the Berkeley Housing Advisory and Appeals Board. He succeeded Assembly member Byron Rumford in office, and fought to preserve Rumford’s California Fair Housing Act of 1963. A successful attorney, he was appointed by Governor Jerry Brown to California’s First District Court of Appeal in San Francisco in 1978. He remained on the Court until his death on February 16, 1985. He was 52 years old.\n\nHon. Leon D. Ralph 1966-1975 | California State Assembly Leon D. Ralph, was born in 1932, in Richmond, Virginia. A Democrat and University of Redlands graduate, Leon Ralph represented South Los Angeles in the Assembly. He served in the U.S. Air Force during the Korean War. When he returned, he settled in Los Angeles where he worked in aerospace for Douglas Aircraft. He pursued politics by his participation in the John F. Kennedy Presidential Campaign. He became an administrative assistant for Assembly Speaker Jesse Unruh. He was elected to serve in the Assembly in 1966, and during his tenure was appointed Chair of the powerful Assembly Rules Committee. He championed causes for poor, disenfranchised constituents. He focused his legislative efforts on education, civil rights and business interests. As Rules Committee Chairman, he oversaw the multi-million dollar restoration of the Historic State Capitol Building in Sacramento. Assemblymember Leon Ralph was active in California’s Democratic Party leadership and a political force during his tenure in the Assembly. In 1976, after a spiritual transformation, he left the legislature and founded the International Denominational Church of God of America. Leon Ralph died February 2007. He was 75 years old.\n\nHon. Frank Holoman 1972-1974 | California State Assembly Frank Holoman was born July 10, 1934 in McCaskill, Arkansas. A one-term Democrat from Los Angeles and a graduate of Washburn University, he was a former staff member to Assembly Speaker Jesse M. Unruh. His legislative agenda focused on improving urban communities and supporting African American businesses. He served as Chair of the Black Caucus of Southern California. One of Frank Holoman’s legislative achievements was introducing the bill to declare a state holiday on the January 15 birthday of Dr. Martin Luther King, Jr. He died on May 22, 2012 at the age of 78.\n\nHon. Julian C. Dixon 1972-1978 | California State Assembly Julian Carey Dixon was born August 8, 1934 in Washington D.C. He served in the U.S. Army, and was a graduate of California State University, Los Angeles. He earned his law degree from Southwestern University School of Law. A three-term Democrat representing Southwest Los Angeles, he succeeded Yvonne Brathwaite Burke. Julian Dixon served as chair of the Southern California Legislative Black Caucus and the California Congress of Black Elected Officials. His legislative agenda focused on juvenile justice issues and correctional system reforms. Julian Dixon also fought for equal access for women and minorities in business and professional services.\n\nHon. Nathaniel N. ‘Nate’ Holden 1974-1978 | California State Senate Nathaniel N. ‘Nate’ Holden, was born June 19, 1929 in Macon, Georgia. A Democrat representing Southwest Los Angeles, he earned his BS in Applied Physics, and master’s degree in Systems Engineering from West Coast University in New Jersey. He worked for Bell Labs in New Jersey, and moved to California in 1955, where he worked in the aerospace industry. Nate Holden became active in Democratic Party politics and became President of the California Democratic Council in 1970. He was elected to the California State Senate in 1974, and served as Chair of the Senate Elections and Reapportionment Committee, vice chair of the Senate Public Utilities, Transit and Energy Committee and chair of the Senate Select Committee on Southern California Rapid Transit. In 1975, Nate Holden passed legislation to require public schools and educational institutions to commemorate the birthday of Dr. Martin Luther King, Jr. for his contributions to the U.S. civil rights movement. He passed legislation to provide health care for sickle cell anemia sufferers. He won approval of his bill to provide state funding for Baldwin Hills Regional Park. He completed one term, and in 1987 ran for the Los Angeles City Council, was elected and stayed in office until 2002.\n\nHon. Curtis R. Tucker, Sr. 1974-1988 | California State Assembly Curtis R. Tucker, Sr., was born March 26, 1918 in Union, Louisiana. A Democrat representing Inglewood, he served in the U.S. Army during WWII and Korea. He was a West Point Academy instructor. In 1972, he was the first Black person elected to the Inglewood City Council. In 1974, he was elected to the California State Assembly, where he authored legislation to promote racial and gender equality and justice for poor and underserved residents. He supported divestment in companies affiliated with the South African government during its apartheid era. He chaired the Assembly Health Committee and focused his legislative agenda on health issues. He died in office in 1988 and was succeeded by his son, Curtis R. Tucker, Jr. He was 70 years old.\n\nHon. Teresa P. Hughes 1975-1992 | California State Assembly\n\n1992-2000 | California State Senate Teresa Patterson Hughes, was born October 3, 1931 in New York City, New York. A Democrat representing South Los Angeles, she earned a BA in Physiology and Public Health from Hunter College in New York, MA in Education Administration from New York University, and a PhD in education administration from Claremont Graduate School. Prior to moving to California from New York, she established a distinguished career in education serving as a teacher, social worker, and school administrator. After moving to Los Angeles, Teresa Hughes worked for the State Commission for Teacher Preparation, as an Assistant Professor of Education at California State University, Los Angeles and an Assistant Professor of Education at California State University, Los Angeles, and for the Honorable Mervyn M. Dymally. She was the second African American woman elected to the California Legislature. She succeeded Bill Greene in the Assembly in 1975 and was elected to the State Senate in 1992. She was a state lawmaker for more than 25 years. Teresa Hughes sponsored legislation to create the California African American Museum in Exposition Park. Her legislative agenda focused on broadening learning at schools and through museums, promoting equal opportunity for home loans, providing $800 million in bond funds for school classroom construction and creation of a state school of the arts. She was a past chair of the California Legislative Black Caucus and the Caucus of Women Legislators. Teresa Hughes died on November 13, 2011. She was 80 years old.\n\nHon. Maxine Waters 1976-1990 | California State Assembly Maxine Moore Waters, was born August 15, 1938 in St. Louis, Missouri. A Democrat representing South Los Angeles, she earned her BA in Sociology from California State University, Los Angeles. Maxine Waters worked for Los Angeles City Councilman David Cunningham before her election to the California State Assembly in 1976. She was the leading voice in the political campaign and legislative effort to divest from apartheid in South Africa. During her Assembly tenure, Maxine Waters chaired the Assembly Democratic Caucus and was a member of the powerful Ways and Means Committee. Maxine Waters’ legislative agenda focused on civil rights, justice and equal rights and opportunities for women. After seven terms in the Assembly, Waters was elected to Congress in 1990. Over the course of a nearly forty-year career in politics, the Honorable Maxine Waters remains one of the most important African American figures in California and national politics.\n\nHon. Gwen Moore 1978-1994 | California State Assembly Gwen Moore, was born October 28, 1940 in Los Angeles, California. A Democrat from Southwest Los Angeles, she earned her BA and MA in Public Administration. She was a community college professor and former elected member of the Los Angeles Community College Board of Trustees. Gwen Moore was an authority on utilities and telecommunications issues, having served as the chair of the committee for 12 years, and served as Assembly Democratic Whip. She authored legislation that opened the utility rate-setting process to greater public scrutiny, championed equal rights for women and fought for women’s access to health care. As an Assemblywoman, Gwen Moore developed legislative and political strategies on a variety of issues such as diversity in procurement, taxation and international trade, consumer affairs, business and labor issues. She had a record number of over 400 bills signed into law. She founded and serves as principal for GeM Communications Group, a consulting firm, “working with clients to develop and implement public affairs and legislative strategies and community outreach programs.”\n\nHon. Elihu M. Harris 1978-1990 | California State Assembly Elihu Mason Harris was born August 15, 1947 in Los Angeles, California. A Democrat representing Oakland, he earned a BA in Political Science from California State University, Hayward, an MA in Public Policy from University of California, Davis, and a JD from University of California, Davis. He is a past executive director of the National Bar Association, and chaired the Assembly Judiciary Committee. His legislative agenda focused on civil rights, criminal justice, tax reform, transportation and poverty. He passed legislation to establish Dr. Martin Luther King, Jr.’s birthday as a state holiday. After leaving the State Legislature, he was elected Mayor of Oakland in 1991, which he held until 1998, and from 2003-2010 he was Chancellor of the Peralta Community College District.\n\nHon. Diane E. Watson 1978-1998 | California State Senate Diane Edith Watson, was born November 12, 1933 in Los Angeles, California. A Democrat representing Southwest and Central Los Angeles, she earned a BA in Education from University of California, Los Angeles (UCLA), an MS in School Psychology from California State University, Los Angeles, and a Ph.D. in Educational Administration from Claremont Graduate University. Diane Watson was only the second woman elected to the Senate, and the first African American woman to serve in the legislature’s 40-member upper house. She served as Chair of the Health and Human Services Committee. Her legislative agenda focused on health care with an emphasis on the health needs of poor children. Over an impressive 30year career as a public servant, Diane Watson has served on the Los Angeles School Board, the California State Senate, Ambassador to the Federated States of Micronesia, and in 2001 she was elected to Congress, representing the 33rd District, and served until she retired in 2011. She also founded the National Organization of Black Elected Legislators/Women.\n\nHon. Willard H. Murray, Jr. 1988-1996 | California State Assembly Willard H. Murray Jr. was born January 1, 1931 in Los Angeles, California. A Democrat representing Compton, he earned his BS from Northridge State College, JD from Loyola Law School, and MBA from Loyola Marymount University. He was an engineer who worked in the Aerospace Division of TRW, and was active in the 1960s civil rights movement. He dedicated more than 25 years to government service, working for Congressman Mervyn Dymally, the Los Angeles City Council, and the Los Angeles Mayor, Sam Yorty. He was elected to the State Assembly in 1988. He chaired the Assembly Budget Subcommittee on State Administration. His legislative agenda focused on education, criminal justice, economic development and healthcare. Willard Murray and his son, Kevin Murray, were the first father and son duo to serve in the Assembly at the same time. He was a past chair of the California Legislative Black Caucus. Willard Murray served in the Assembly until 1996. Willard H. Murray, Jr. died on December 20, 2021, at the age of 90.\n\nHon. Curtis R. Tucker, Jr. 1989-1996 | California State Assembly Curtis R. Tucker, Jr., was born April 16, 1954 in New Orleans, Louisiana. A Democrat representing Inglewood, he worked as a legislative aide for Democratic Majority Whip Gwen Moore, and Speaker pro Tem, Mike Roos. He was elected to the Assembly in a special election held after the death of his father, Assemblymember Curtis R. Tucker, Sr., and took office February 7, 1989. He served as Chairman of the Assembly Governmental Organization Committee and Vice Chairman of the Assembly Insurance Committee. He also served as Chair of the Select Committee on the Los Angeles Unrest following the verdict announcement in the 1992 trial of Los Angeles police officers accused of beating motorist Rodney King. His legislative agenda focused on education, health- care and crime. Curtis Tucker, Jr. sponsored legislation to ban the sale of cigarettes from vending machines to stop tobacco product purchases by minors. He served as Chair of the California Legislative Black Caucus. He completed his service in the Assembly in 1996.\n\nHon. Marguerite Archie-Hudson 1990-1996 | California State Assembly Dr. Marguerite Archie-Hudson was born on November 18, 1937 in Yonges Island, South Carolina. A Democrat representing Los Angeles, she earned her BA in Psychology from Talladega College, Talladega, Alabama, an MA in Education from Harvard University, and a Ph.D. in Higher Education Administration from University of California, Los Angeles (UCLA). Elected to the Assembly in 1990, her legislative agenda focused on protecting the safety of children and youth, in addition to expanding educational opportunities. She chaired the Assembly Committee on Higher Education. She fought the passage of Proposition 209, the statewide ballot measure that ended affirmative action in state-funded programs and admissions to California public colleges and universities. Among her major legislative achievements is the creation of the California Science Center, now considered a leader nationally in innovative science and education programs and selected by NASA in April 2011 as the permanent home of the Space Shuttle Endeavor when it retired after its last space mission. In 1998, Dr. Marguerite Archie-Hudson was named president of Talladega College. The college’s 17th president, she is the first woman to hold the position. Today, she is a visiting assistant professor offering courses in Health Policy, Education Policy, Policymaking in State Legislatures and American Government.\n\nHon. Barbara Lee 1990-1996 | California State Assembly\n\n1996-1998 | California State Senate Barbara Jean Lee was born July 16, 1946 in El Paso, Texas. A Democrat representing Oakland, she earned her BA from Mills College, and her MS in Social Welfare from University of California, Berkeley. She was elected to the Assembly and later, in a special election, to the Senate. Barbara Lee’s legislative agenda focused on African American economic and social status, and safety of women and children. During her Assembly tenure, Barbara Lee was a member of the Committees of Correspondence in Berkeley. She was elected to the 9th and 13th U.S. Congressional Districts, and has represented her East Bay area constituents for more than 15 years.\n\nHon. Juanita Millender-McDonald 1992-1996 | California State Assembly Juanita Millender-McDonald was born September 7, 1938 in Birmingham, Alabama. A Democrat representing Los Angeles County’s South Bay area, she earned her BA from the University of Redlands, MA in Education from California State University, Los Angeles and her Ed.D. in Education from University of Southern California. She enjoyed an extensive political career in Democratic Party politics, serving at the municipal, state, and federal levels in addition to volunteering for several political campaigns of prominent Democratic candidates. Shortly after her election to the Carson City Council in 1990, McDonald ran for and was elected to serve the 55th Assembly District in the California State Legislature. Her Assembly legislative agenda focused on education, housing, community development and transportation. She passed legislation to speed land acquisition and acquire railroad right-of-ways for the Alameda Corridor fast-freight rail train project. Due to the resignation of Congressman Walter Tucker (D-37th District), Millender-McDonald decided to run for and won a special election in 1996. She served for 10 years in Congress. She died April 22, 2007, at the age of 69.\n\nHon. Kevin Murray 1994-1998 | California State Assembly\n\n1998-2006 | California State Senate Kevin Murray was born March 12, 1960 in Los Angeles, California. A Democrat representing Southwest Los Angeles, he earned a BS from California State University, Northridge. He earned an MBA from Loyola Marymount University and earned his JD from Loyola Law School. He chaired the Assembly Transportation Committee. Before entering politics, he practiced law in the fields of entertainment, insurance, and real estate. He was elected to the Assembly in 1994. He and his father were the first in California to serve in the same legislative house at the same time. He served as the Assistant Democratic Floor Leader and Majority Whip. Elected to the Senate in 1998, he chaired the Senate Democratic Caucus, Senate Appropriations, Senate Elections and Transportation Committees. His legislative agenda focused on the entertainment industry, real estate and insurance. He also served as chair of the California Legislative Black Caucus. Upon retirement from the Legislature, he resumed his career in entertainment.\n\nHon. Edward Vincent, Jr. 1996-2000 | California State Assembly\n\n2000-2008 | California State Senate Edward Vincent, Jr., was born June 23, 1934 in Stuebenville, Ohio. A Democrat representing Inglewood, he earned a BA in Corrections and Social Welfare from the California State University, Los Angeles. In 1959, he began a 35-year career with the Los Angeles County Probation Department. He was elected to the Inglewood Unified School District Board of Trustees, Mayor of Inglewood, and also served as Commissioner of the State of California World Trade Commission. He was elected to the California State Assembly from 1996 to 2000. During his Assembly tenure, he chaired the Assembly Committee on Elections Reapportionment and Constitutional Amendments and the Assembly Select Committee on the California Horse Racing Industry. He served in the California State Senate in 2000. He chaired the Senate Committees on Agriculture, Governmental Organization and Health, and the Senate Select Committee on the Horse Racing Industry. His legislative agenda focused on state teacher retirement benefits, community care facilities for senior citizens, gambling licenses and horse racing. He died August 31, 2012, at the age of 78.\n\nHon. Carl Washington 1996-2002 | California State Assembly Carl Edward Washington, was born January 25, 1965 in Littlefield, Texas. A Democrat representing Compton, he was active in devising alternatives to gangs in Los Angeles, as well as educating others in public safety professions. Prior to his legislative service, he served on the staff of Los Angeles County Supervisor Yvonne Brathwaite Burke. He was elected to the Assembly in 1996, and chaired the Assembly Public Safety Committee. His legislative agenda focused on community public safety, crime prevention, employment and creating community youth after school programs to serve as alternatives to street gang membership. Carl Washington authored the School Safety and Violence Prevention Act of 1999.\n\nHon. Roderick D. Wright 1996-2002 | California State Assembly\n\n2008-2014 | California State Senate Roderick Wright was born July 3, 1952 in Chicago, Illinois. A Democrat representing South Los Angeles, he earned a BS in Urban Studies and City Planning from Pepperdine University. Prior to serving in the Legislature, he worked on Congresswoman Maxine Waters’ staff. He was elected to serve in the California State Assembly in 1996, and chaired the Committee on Utilities and Commerce. Rod Wright’s legislative agenda has focused on public safety, education, energy, utilities and consumer privacy. After being out of politics for six years, he was elected to the California State Senate in 2008. He chaired the Senate Governmental Organization Committee, Governmental Organization Subcommittee on Gaming and Select Committee on California Job Creation and Retention. He served as both chair and vice-chair of the California Legislative Black Caucus.\n\nHon. Speaker Emeritus Herb J. Wesson, Jr. 1998-2004 | California State Assembly Herb J. Wesson, Jr., was born November 11, 1951 in Cleveland, Ohio. A Democrat representing Southwest Los Angeles, he earned a BA in History from Lincoln University, Philadelphia. He served as a Chief of Staff to Councilman Nate Holden and Supervisor Yvonne Brathwaite-Burke. Herb Wesson was elected to the Assembly in 1998, and was unanimously elected Speaker of the Assembly by his colleagues in 2002. Herb Wesson was the second African American to hold the powerful position of Assembly Speaker. His legislative agenda focused on education, environmental protection, and healthcare. During his tenure as Speaker, he was an effective voice for the voiceless and diligently worked to pass legislation protecting the environment and expanding educational opportunities and access to healthcare. In 2005, Herb J. Wesson, Jr., was elected to Los Angeles City Council District 10. Today, he is the President of the Los Angeles City Council. He is the first African American to hold the position of Council President in the city’s history and has been re-elected three times to lead the city’s legislative body.\n\nHon. Jerome E. Horton 2001-2006 | California State Assembly Jerome Edgar Horton, was born September 14, 1956 in Pine Bluff, Arkansas. A Democrat representing Inglewood, he earned a BS in Accounting and Finance from California State University, Dominguez Hills. He served as chair of the Assembly Governmental Organization and Assembly Rules Committee. His legislative agenda focused on public safety, education, healthcare, work force training and crime prevention by juveniles. Jerome Horton served on the California State Work Force Investment Board and California Historical and Cultural Endowment Board. He currently serves on the California State Board of Equalization.\n\nHon. Mark Ridley-Thomas 2002-2006 | California State Assembly\n\n2006-2008 | California State Senate Mark Ridley-Thomas, was born in November 6, 1954 in Los Angeles, California. A Democrat representing Southwest and South Los Angeles, he earned his BA in Social Relations, MA in Religious Studies from Immaculate Heart College, and Ph.D. in Social Ethics from the University of Southern California. He was elected to the Assembly in 2002, and chaired the Assembly Jobs, Economic Development and the Economy Committee and the Assembly Select Committee on the Los Angeles Healthcare Crisis. He was also the leading voice in efforts to get an NFL team to move to the Los Angeles Memorial Coliseum. Mark Ridley-Thomas ran a successful campaign and was elected to the Senate in 2006. During his tenure, he was among the lawmakers calling for tourists to boycott the LAX Hilton because of the hotel’s efforts to overturn a city ordinance requiring that airport area hotel workers receive a living wage. He chaired the Senate Business, Professions and Economic Development Committee and the Subcommittees on Professional Sports and Entertainment and The Economy, Workforce Preparation and Development. His legislative agenda focused on job development, public safety, education, economic development, healthcare access and community empowerment. He served as chair of the California Legislative Black Caucus. Ridley-Thomas is currently Supervisor for the Second District in Los Angeles County.\n\nHon. Speaker Emeritus Karen Bass 2005-2010 | California State Assembly Karen Ruth Bass, was born October 3, 1953 in Los Angeles, California. A Democrat representing Southwest Los Angeles, she earned a BS in Health Sciences from California State University, Dominguez Hills. First elected to the Assembly in 2005, was the first African American woman to serve in the powerful positions of Majority Floor Leader and Assembly Majority Whip. She was the first African American woman to be elected as Speaker of the Assembly in 2008. Her legislative agenda focused on the needs of foster care children, job creation and healthcare. As vice chair of the California Legislative Black Caucus, she commissioned a research report on the ‘State of Black California’. Karen Bass won the Congressional seat vacated by retiring Diane Watson in 2012. During her tenure in Congress, she has been an outspoken advocate for foster youth, healthcare, criminal justice reform, and U.S.-Africa relations.\n\nHon. Laura Richardson 2006-2007 | California State Assembly Assemblywoman Richardson was born April 14, 1962 in Los Angeles, California. A Democrat from Long Beach, she earned a BA in Political Science from the University of California, Los Angeles and a MA in Business Administration from the University of Southern California. She served on the Long Beach City Council from 2000 to 2006. As a Councilwoman, her priorities were neighborhood improvement, public safety, attracting jobs and businesses to the citie’s central corridors, job training programs for adults, after school programs for youth and expanding senior programs. She was elected to the Assembly in 2006 where she was appointed to serve as the Assistant Speaker pro Tempore. Additionally, she was appointed to serve on the Budget, Human Services, Utilities & Commerce, Government Organization, and Joint Legislative Budget committees. She was chair of the Select Committee on Proposition 209-Equal Opportunity. She was elected to the House of Representatives in the 37th Congressional District in 2007, where she served until 2013.\n\nHon. Wilmer Amina Carter 2006-2012 | California State Assembly Wilmer Amina Carter was born July 12, 1941 in Neshoba County, Mississippi. A Democrat from the Inland Empire, she earned her BA in English, and MA in Education at California State University, San Bernardino. She served as Assistant Majority Policy Leader of the 2011 – 2012 Assembly session. She was elected to the Assembly in 2006 and her legislative focus includes but is not limited to transportation, job creation and education. Prior to the Assembly, she served on the Rialto Unified School District Board for sixteen years and was honored with the naming of a local high school. Wilmer Amina Carter High School is the first high school in the Inland Empire to be named in honor of a living African American woman.\n\nHon. Mike Davis 2006-2012 | California State Assembly Mike Davis was born April 2, 1957 in Charlotte, North Carolina. A Democrat from Los Angeles, he earned a BA in History from the University of North Carolina at Charlotte, and a MA in Public Administration and Behavioral Science from California State University, Northridge, and California State University, Dominguez Hills, respectively. He was the first elected official to graduate from the Executive Master of Leadership Program at University of Southern California’s School of Policy, Planning and Development. He also completed a fellowship at Harvard University in the Innovations in Governance program at the John F. Kennedy School of Government. He served as Senior Deputy Supervisor for Los Angeles County Supervisor Yvonne Brathwaite Burke and District Director for Congresswoman Maxine Waters. Mike Davis was elected to the Assembly in 2006. During his tenure in the Assembly, he chaired the Arts, Entertainment, Sports, Tourism and Internet Media Committee. Davis also passed legislation in the Assembly, ending three strikes law and became Co-chair of Proposition 36 which won the popular vote by 70%- ending three strikes in California. As Vice-Chair of the California Legislative Black Caucus, he was responsible for coordinating the CLBC Weekend, a statewide policy conference on African American issues. He also authored AB 420 ending prison gerrymandering, which was signed into law. Today, Mike Davis serves as President Pro Tem of the Los Angeles Board of Public Works Commission.\n\nHon. Sandré Swanson 2006-2012 | California State Assembly Sandré R. Swanson was born November 28, 1948 in Oakland, California. A Democrat from Oakland, he was elected to the Assembly in 2006. He served three terms in the Assembly where he was Chair of the Labor and Employment Committee, the Budget Committee, the Subcommittee on Education Finance, Committee on Utilities and Commerce, and the State Workforce Investment Board. Prior to the Assembly he served his community as Congresswoman Barbara Lee’s Chief of Staff after working for 25 years as the District Director and Senior Policy Advisor to former Congressman Ron Dellums. He is an expert in the fields of labor, education, and budget reform. Following his work in the Assembly, he served as Deputy Mayor for the City of Oakland.\n\nHon. Curren D. Price, Jr. 2006-2009 | California State Assembly\n\n2009-2013 | California State Senate Curren De Mille Price, Jr., was born December 16, 1950 in Los Angeles, California. A Democrat representing Los Angeles, Inglewood and Culver City, he earned his BA in Political Science from Stanford University, and his law degree from Santa Clara University School of Law. Prior to his election to the Assembly, he served on the Inglewood City Council from 1993-2005. Price then went on to serve in the California State Assembly in 2006 where he served as the Chair of the Elections and Redistricting and Governmental Organization committees. In 2009, as a State Senator, he chaired the Business and Professions Committee and was chosen by his colleagues to lead the California Legislative Black Caucus, as Chair, in 2010. His legislation focused on small business, health and education. Today, he serves as Councilmember of Los Angeles City Council’s 9th District.\n\nHon. Isadore Hall, III 2008-2014 | California State Assembly\n\n2014-2016 | California State Senate Senator Isadore Hall, III, was born December 10, 1971 in Compton, California. A Democrat from Los Angeles, he earned a BA in Business Administration from the University of Phoenix, MA in Public Administration from National University, a MA in Management and Leadership from the University of Southern California, and dual doctorates in Theology and Religious Studies from Next Dimension Bible College. He was elected to the California State Senate in December of 2014. Hall previously represented California's 64th Assembly District from 2008 to 2014 and also served six years on the Compton City Council. Hall’s legislative agenda is focused on job creation, reducing childhood obesity and diabetes, improving public safety and expanding access to education technology. In January 2017, Hall was appointed by Governor Jerry Brown to the California Agricultural Labor Relations Board.\n\nHon. Cheryl R. Brown 2012-2016 | California State Assembly Assemblymember Cheryl R. Brown was born February 11, 1944 in Ayer, Massachusetts. A Democrat representing San Bernardino, she earned a BA in Geography from California State University, San Bernardino. She was elected to the California State Assembly in 2012. Prior to joining the California State Assembly, Brown worked for the San Bernardino County Planning Department and later served on the County and City Planning Commissions for 17 years. Brown and her husband also founded, 34 years ago, Brown Publishing Company, which produces a weekly community newspaper, Black Voice News. Brown’s key legislative agenda included economic development, small business growth, public safety and education.\n\nHon. Sebastian Ridley-Thomas 2013-2017 | California State Assembly Assemblymember Sebastian Ridley-Thomas was born August 12, 1987 in Los Angeles, CA. A democrat representing the Los Angeles County communities, he earned his BA in in Sociology from Morehouse College. He was elected to the California State Assembly in 2013. Prior to joining the Assembly, Ridley-Thomas served as public policy director for State Senator Curren Price. Ridley-Thomas also served as legislative consultant to the Senate Select Committee on Procurement. His legislative priorities included a focus on job creation, access to high-quality and affordable education, and ensuring that all Californians get the healthcare and mental health services they need to fully participate in California's promise.\n\nHon. Holly J. Mitchell 2010-2013 | California State Assembly\n\n2013-2020 | California State Senate Holly J. Mitchell was born on September 7, 1969 in Leimert Park. A Democrat with a lifelong career of public service, Supervisor Mitchell has always worked with the understanding – that creating a California where all residents can thrive – means investing in the communities, families, and children of LA County. Having authored and passed over 90 laws in the California Legislature, Supervisor Mitchell brings an extensive public policy record to the Board of Supervisors. Many of her bills have been at the forefront of expanding healthcare access, addressing systemic racism, and championing criminal justice reform."}, {"url": "https://www.assembly.ca.gov/", "page_content": "Message From\n\nSpeaker Anthony Rendon\n\nWelcome to the California State Assembly’s homepage. If you would like to contact your legislator, read about bills, or learn about the Capitol, this is the place.\n\nThere are also links to several other sites you may find useful as well. Remember, we're here to represent you. So I hope you will let us know your thoughts — on legislation, issues, or even how this site can be improved.\n\nThanks for visiting."}, {"url": "https://www.findagrave.com/memorial/7366335/anthony-joseph-dimond", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://californiaglobe.com/articles/mike-fong-sworn-in-as-newset-assemblyman/", "page_content": "Los Angeles Community College Board Trustee and City of Alhambra Transportation Commission Member Mike Fong was sworn in as the newest member of the California State Assembly on Tuesday.\n\nNewly-elected Assemblyman Fong (D-Alhambra), a graduate of UCLA and CSU Northridge, had previously served as the East Area Director for Los Angeles Mayor Antonio Villaraigosa during the late 2000’s and early 2010’s before becoming the Director of Policy and Government Relations for the City of Los Angeles Department of Neighborhood Empowerment. In 2017, he ventured into elected positions. Following an abortive 2017 candidacy for the 51st Assembly District race, Fong won the LA Community College Board Trustee seat in 2020 by 30% of the vote over the next closest candidate.\n\nIn November of last year, Governor Gavin Newsom appointed then-Assemblyman Ed Chau as a Los Angeles County Superior Court Judge, opening up the 49th District Assembly seat. With Fong now residing in the district, he put his name in for the special election. With only Republican and former La County Sheriff’s Sergeant Burton Brink being the only other candidate to enter the race, the February primary was switched to becoming the final election for the seat, eschewing a runoff that was likely to be held in April.\n\nLast week, Fong received 68% of the vote compared to Brink’s 32%. However, Brink refused to concede the race for several days as he wanted all votes to be counted. Despite the delay, Fong eventually declared victory, leading to his swearing-in on Tuesday as the next District 49 Assemblyman.\n\n“The San Gabriel Valley is filled with talent, hope, hard work, untapped opportunity, and dreams for the future. I ran for State Assembly because I want to help our communities by solving problems, both big and small,” said Fong in a statement. “From constituents who need help with state services, to challenges like rising homelessness, climate change, and keeping our neighborhoods and communities safe, I promise to work every day to deliver results for the San Gabriel Valley, and to be a relentless advocate for every person who lives here.”\n\nNumerous Assembly members welcomed him to the Assembly on Tuesday, including Assembly Speaker Anthony Rendon (D-Los Angeles) who noted in a tweet “Congratulations and welcome to our newest Assembly member, Mike Fong of Assembly District 49! His experience in education, transportation and community service will benefit not only his district, but our body as a whole. We’re happy to have you on board, Assembly member Fong!”\n\nCongratulations and welcome to our newest Assemblymember, Mike Fong of Assembly District 49! His experience in education, transportation and community service will benefit not only his district, but our body as a whole. We're happy to have you on board, Assemblymember Fong! pic.twitter.com/ELIWGgX4p2 — Anthony Rendon (@Rendon63rd) February 22, 2022\n\nWhile sworn in and welcomed on Tuesday, many in Sacramento cautioned that Fong may only have a limited impact due to having a term that would last for only a matter of months.\n\n“Fong won handily, but the term ends in November,” stressed “Dana,” a state Capitol staffer to the Globe on Tuesday. “We’ll see where he is come later in the year. Districts are changing and there may be a lot of turmoil. A placeholder Assemblyman like Fong may not make it past November, even in a strongly Democratic district. But he may also win by a big margin again. For right now, the Democrats are just happy to have another Democrat in the Assembly when voting time comes. There’s still a lot of vacancies in the Assembly, so he helped fill it.”\n\nOther run-offs from the February 15th special election primary are expected to take place in April."}, {"url": "https://www.wikiwand.com/en/Speaker_of_the_California_State_Assembly", "page_content": "The Speaker of the California State Assembly is the presiding officer of the California State Assembly in the chief leadership position, and controls the flow of legislation and committee assignments. The Speaker is nominated by the majority party's caucus and elected by the full Assembly. Meanwhile, other floor leaders, such as the majority and minority leaders, are elected by their respective party caucuses according to each party's strength in the chamber. The current Speaker is Democrat Anthony Rendon of the 63rd district.\n\nPresiding officer of the California State Assembly\n\nThe speaker formerly had far more power, and was able to issue committee assignments to both parties' members, control State Assembly funds, and had broad administrative authority, but many of these powers were transferred to committee chairs after the speakership of Curt Pringle.[1]\n\nThe Speaker of the Assembly is also third in the order of succession to the Governor of California, after the Lieutenant Governor and the President pro tempore of the California State Senate.[2][3][4]"}], "Anthony Dimond served as Speaker of the Assembly in 1885.": [{"url": "https://kids.britannica.com/students/article/Anthony-Joseph-Dimond/311018", "page_content": "Harris and Ewing Collection/Library of Congress, Washington, D.C. (digital file no. LC-DIG-hec-28851)\n\n(1881–1953). American lawyer and political leader Anthony Joseph Dimond was a champion of Alaskan statehood. He also stressed the importance of the Alaska Highway, which, when completed, was the only land route to connect Alaska with the mainland United States (through Canada).\n\nDimond was born on November 30, 1881, in Palatine Bridge, New York. After teaching from 1900 to 1903, he moved to Alaska in 1904 to work as a prospector and miner. Dimond also studied law, and in 1913 he was admitted to the bar and began practicing in Valdez, Alaska. Later that year he became the U.S. commissioner at Chisana, Alaska, where he worked with gold miners and their claims. In 1917 Dimond became the special assistant to the U.S. attorney in Valdez.\n\nDimond served as mayor of Valdez for nine years, from 1920 to 1922 and from 1925 to 1932. From 1923 to 1926 and from 1929 to 1932 he was a member of the Alaska Territorial Senate. In 1933 Dimond was elected as the Alaskan representative to the U.S. Congress, and he was reelected five successive times. Although he worked tirelessly for Alaskan statehood, the feat would not be accomplished until 1959, after his death. Dimond left Congress in 1945 to become a district court judge in Anchorage, Alaska. He died there on May 28, 1953."}, {"url": "https://history.house.gov/People/Detail/12264", "page_content": "University of Alaska-Fairbanks\n\nElmer E. Rasmuson Library Alaska and Polar Regions Department\n\nFairbanks, AK\n\nPapers: 1904-1953, 33 cubic feet. The Anthony J. Dimond Papers consist of legislative, political and personal files relating to his work from 1904 until his death. The bulk of the material relates directly to his service as Territorial Delegate to Congress. His activities as federal court judge are related in the personal files. A finding aid is available in the repository.\n\nPapers: In Donohoe-Ostrander-Dimond papers, 1903-1933. ca. 15 feet. Law firm records. Finding aid in repository. Restricted.\n\nOral History: Mary Lee Council and Vide Bartlett. April 23, 1975. Council worked in Bartlett's office and discusses issues affecting Alaska.\n\nOral History: Sister Marie Theresa Dimond, daughter. April 20, 1975. Discusses her father's political career, Bob Bartlett, and growing up in Valdez, Alaska.\n\nOral History: Dorothy Haaland. July 30, 1981. Discusses her association with Dimond and activities in statehood movement. Summary and log available.\n\nOral History: Bruce B. Kendall. July 23, 1981. Discusses his activities in Republican Party during statehood struggle of 1940's and 1950's. Summary and log available.\n\nOral History: Katherine D. Nordale. August 10, 1981. Discusses government and public policy before and after statehood. Summary and log available."}, {"url": "https://library.uaf.edu/aprca/research-guides/movement-towards-statehood", "page_content": "\n\nIn commemoration of the 50th anniversary of Alaska's admission into the Union, the Alaska & Polar Regions Collections (APR), with funding from the Alaska Humanities Forum, has published this bibliography as an attempt to familiarize researchers with the primary resources available in APR collections pertaining to the statehood movement. These materials were created by the people who were directly involved. Examples include committee reports and notes from a Constitutional Convention delegate, or a television broadcast of a debate about the need for Alaskan statehood, correspondence of the Alaskan delegates to Congress, political cartoons depicting the Alaskan plight, and recorded interviews with those who played key roles in the struggle. It is our hope that this guide will help the stories of Alaskan statehood be told…and retold.\n\n\n\nImage of what may have been an alternate version of the 49-star flag after the statehood of Alaska.\n\nERNEST H. GRUENING PAPERS, 1914-[1959-1969] 1974, UAF-1976-21-77747"}, {"url": "https://www.asdk12.org/domain/3908", "page_content": "Dimond High School was named for Anthony Joseph Dimond, an Alaskan pioneer legislator and federal judge who promoted statehood for the young territory.\n\nDimond was born in New York on November 30, 1881. Dimond left a teaching position in New York to emigrate to Alaska in 1905 and spent the next 48 years protecting and defending the land he loved. In 1913, he became an attorney and later that year was appointed U.S. Commissioner at Chisana, recording gold miners’ claims and settling their disputes. Later he became Special Assistant to the U.S. Attorney in Valdez. Motivated by the goal of statehood for this Last Frontier, Dimond entered politics and served four terms in the Alaska Territorial Legislature and as mayor of Valdez for nearly a decade. He worked hard to unify the Territory’s interests and became Alaska’s sole delegate to the Congress of the United States from 1933-1945. His first acts were to introduce a Statehood Bill, which was ignored, to urge construction of the Alaska Highway, and to advise that fortifications be built in Fairbanks and Anchorage.\n\nDimond ended forty years of public service as a Federal Judge for the Third Judicial District of Alaska. In May of 1953, Judge Dimond suffered a heart attack and died a week later at Providence Hospital in Anchorage. November 30, his birthdate, was designated as A.J. Dimond Day to commemorate the distinguished service of the Alaskan Statesman."}, {"url": "https://prabook.com/web/anthony.dimond/2591103", "page_content": "Anthony Dimond\n\njudge lawyer representative teacher\n\nNovember 30, 1881 (age 71) Palatine Bridge, Montgomery County, New York and attended Catholic\n\nDimond\"s political experience includes: United States Commissioner in Chisana, Alaska (1913–1914). Special Assistant United States Attorney for the 3rd Judicial Division of Alaska in Valdez (1917). Mayor of Valdez (1920–1922, 1925–1932). Alaska Territorial Senate (1923–1926, 1929–1932). And District Judge for the 3rd Division of Alaska (1945–1953). He also served as a Delegate to the Democratic National Convention in 1936 and 1940. He died on May 28, 1953 in Anchorage. His secretary, Bob Bartlett, eventually became a United States Senator from Alaska. Today, November 30 is celebrated by the State of Alaska as \"Anthony Dimond Day.\" In Anchorage, A. J. Dimond High School and Dimond Boulevard, a major thoroughfare, are named after him. In 1940, when President Franklin Doctorate. Roosevelt was considering making Alaska an international Jewish homeland, Dimond was the main force behind defeating the effort."}, {"url": "https://peoplepill.com/people/anthony-dimond/", "page_content": "Anthony Joseph \"Tony\" Dimond (November 30, 1881 – May 28, 1953) was an American Democratic Party politician who was the Alaska Territory Delegate in the United States House of Representatives for many years (1933–1945). Dimond was also an early champion of Alaska statehood.\n\nDimond was born in Palatine Bridge, Montgomery County, New York and attended Catholic schools, taught school in Montgomery County (1900–1903), and was a prospector/miner in Alaska (1905–1912) before studying law and beginning practice in Valdez (1913).\n\nDimond's political experience includes: US Commissioner in Chisana, Alaska (1913–1914); Special Assistant US Attorney for the 3rd Judicial Division of Alaska in Valdez (1917); Mayor of Valdez (1920–1922, 1925–1932); Alaska Territorial Senate (1923–1926, 1929–1932); and District Judge for the 3rd Division of Alaska (1945–1953). He also served as a Delegate to the Democratic National Convention in 1936 and 1940. He died on May 28, 1953 in Anchorage.\n\nA Roman Catholic, Dimond was a member of organizations such as the Elks, Moose and Eagles. His secretary, Bob Bartlett, eventually became a United States Senator from Alaska.\n\nToday, November 30 is celebrated by the State of Alaska as \"Anthony Dimond Day.\" In Anchorage, A. J. Dimond High School and Dimond Boulevard, a major thoroughfare, are named after him.\n\nIn 1940, when President Franklin D. Roosevelt was considering making Alaska an international Jewish homeland, Dimond was the main force behind defeating the effort."}, {"url": "https://en-academic.com/dic.nsf/enwiki/943085", "page_content": "Anthony Joseph Dimond ( November 30 , 1881 – May 28 , 1953 ) was an American Democratic Party politician who was the Alaska Territory Delegate in the United States House of Representatives for many years (1933-1945). Dimond was also an early champion of Alaska statehood.\n\nDimond was born in New York and attended Catholic schools, taught school in Montgomery County, New York (1900-1903) and was a prospector/miner in Alaska (1904-1912) before studying law and beginning practice in Valdez (1913).\n\nDimond's political experience includes: US Commissioner in Chisana, Alaska (1913-1914); Special Assistant US Attorney for the 3rd Judicial Division of Alaska in Valdez (1917); Mayor of Valdez (1920-1922, 1925-1932); Alaska Territorial Senate (1923–1926, 1929–1932); and District Judge for the 3rd Division of Alaska (1945–1953). He also served as a Delegate to the Democratic National Convention in 1936 and 1940. He died on May 28 , 1953 in Anchorage.\n\nA Roman Catholic , Dimond was a member of organizations such as the Elks, Moose and Eagles. His secretary, Bob Bartlett , eventually became a United States Senator from Alaska.\n\nToday, November 30 is celebrated by the State of Alaska as \"Anthony Dimond Day.\" In Anchorage, A. J. Dimond High School and Dimond Blvd, a major thoroughfare, are named after him.\n\nIn 1940, when President Franklin D. Roosevelt was considering making Alaska an international Jewish homeland, Dimond was the main force behind defeating the effort. Some Alaskan papers have attributed this to anti-Semitism on the part of Dimond and others, although the charge was challenged by historians who claimed that Dimond was mostly concerned about the finances.\n\nSee also\n\n* Dimond Center\n\n*\" The Yiddish Policemen's Union \"\n\nExternal links\n\n* CongBio|D000353\n\n* [ http://www.findagrave.com/cgi-bin/fg.cgi?page=gr&GRid=7366335&pt=Anthony%20Dimond Gravesite of Anthony Dimond ]\n\n* [ http://www.adn.com/news/alaska/story/8828757p-8729537c.html In the context of the times, Jews from Germany weren't welcome ] , Tom Kizzia, \"Anchorage Daily News\", 2007-04-26."}, {"url": "https://researchworks.oclc.org/archivegrid/data/42065546", "page_content": "Details\n\n44 ms. boxes 33 cu. ft\n\nThe Anthony J. Dimond papers consist of legislative, political and personal files relating to his work from 1904 until his death. The bulk of the material relates directly to his service as Territorial Delegate to Congress. His activities as federal court judge are related in the personal files\n\nAnthony J. Dimond was a prospector-freighter in the Copper River Valley until injured by an accidental gunshot, after which he studied law and passed the Alaska Bar in 1913. He served as U.S. Commissioner in Chisana, practiced law with Tom Donohoe in Valdez, served as Mayor of Valdez, as special assistant to the U.S. Distrtict Attorney and as Territorial Senator, Delegate to Congress and U.S. District Judge for the 3rd Division in Anchorage\n\nThis collection, the prime source for the study of one of Alaska's outstanding public figures, is one of the most significant sources available in a public repository for research into the work and function of an Alaskan Territorial Delegate to Congress\n\nRelated Resources"}, {"url": "https://hyperleap.com/topic/Anthony_Dimond", "page_content": "John H. Dimond 0 links 0 links\n\nAmerican jurist who served as a justice of the Supreme Court of Alaska from August 7, 1959 to November 30, 1971.\n\nAmerican jurist who served as a justice of the Supreme Court of Alaska from August 7, 1959 to November 30, 1971."}, {"url": "https://www.govtrack.us/congress/members/anthony_dimond/403471", "page_content": "We’re looking to learn more about who uses GovTrack and what features you find helpful or think could be improved. If you can, please take a few minutes to help us improve GovTrack for users like you.\n\nStart by telling us more about yourself:\n\nWe hope to make GovTrack more useful to policy professionals like you. Please sign up for our advisory group to be a part of making GovTrack a better tool for what you do.\n\nYoung Americans have historically been the least involved in politics, despite the huge consequences policies can have on them. By joining our advisory group, you can help us make GovTrack more useful and engaging to young voters like you.\n\nOur mission is to empower every American with the tools to understand and impact Congress. We hope that with your input we can make GovTrack more accessible to minority and disadvantaged communities who we may currently struggle to reach. Please join our advisory group to let us know what more we can do.\n\nWe love educating Americans about how their government works too! Please help us make GovTrack better address the needs of educators by joining our advisory group.\n\nWould you like to join our advisory group to work with us on the future of GovTrack?\n\nEmail address where we can reach you:"}]}