{"Honoré IV was Prince of Monaco and Duke of Valentinois.": [{"url": "https://pantheon.world/profile/person/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "Honoré IV, Prince of Monaco\n\nHonoré IV (Honoré Charles Anne Grimaldi; 17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 1814 to 16 February 1819 . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Honoré IV, Prince of Monaco has received more than 162,372 page views. His biography is available in 23 different languages on Wikipedia (up from 20 in 2019) . Honoré IV, Prince of Monaco is the 5,788th most popular politician (down from 4,580th in 2019), the 1,731st most popular biography from France (down from 1,446th in 2019) and the 429th most popular French Politician."}, {"url": "https://dbpedia.org/page/Florestan,_Prince_of_Monaco", "page_content": "Ο Φλορεστάνος Α΄ (γαλλικά: Florestan I) ήταν ο Πρίγκιπας του Μονακό από τις 2 Οκτωβρίου 1841 μέχρι το θάνατό του στις 20 Ιουνίου 1856. Το πλήρες όνομά του ήταν το Τανκρέντ Φλορεστάνος Ρογήρος Λουδοβίκος Γκριμάλντι και γονείς του ήταν ο Πρίγκιπας Ονώριος Δ΄ του Μονακό και η . (el)\n\nFlorestan (* 10. Oktober 1785 in Paris; † 20. Juni 1856 ebenda) war von 1841 bis 1856 regierender Fürst von Monaco aus dem Haus Grimaldi. (de)\n\nFlorestan (Tancrède Florestan Roger Louis Grimaldi; 10 October 1785, in Paris – 20 June 1856) was Prince of Monaco and Duke of Valentinois from 2 October 1841 until his death. He was the second son of Prince Honoré IV and Louise d'Aumont Mazarin and succeeded to the throne on the death of his brother, Honoré V. (en)\n\nFlorestán I de Mónaco (París, 10 de octubre de 1785-ibidem, 20 de junio de 1856) fue príncipe de Mónaco desde el 2 de octubre de 1841 hasta su muerte. Fue el segundo hijo del príncipe Honorato IV de Mónaco y de su esposa, , duquesa de Mazarin (hija de , duque de Aumont, de Mazarin y de La Meilleraye y de , duquesa de Mazarin y de La Meilleraye), y sucedió a su hermano, Honorato V, en el Principado de Mónaco. (es)\n\nFlorestan, né le 10 octobre 1785 à Paris et mort le 20 juin 1856, est le second fils du prince Honoré IV. Il devient prince souverain de Monaco le 2 octobre 1841, au décès de son frère aîné, Honoré V. (fr)\n\nタンクレード・フロレスタン・ロジェ・ルイ（Tancrède Florestan Roger Louis, prince de Monaco, 1785年10月10日 - 1856年6月20日）は、モナコ公（在位：1841年 - 1856年）。 (ja)\n\nFlorestano I di Monaco (Parigi, 10 ottobre 1785 – Parigi, 20 giugno 1856) fu Principe sovrano di Monaco dal 1841 al 1856. (it)\n\nTancred Florestan Rogier Lodewijk Grimaldi (Parijs, 10 oktober 1785 – aldaar, 20 juni 1856) was vorst van Monaco van 2 oktober 1841 tot aan zijn dood in 1856. Hij was de tweede zoon van prins Honorius IV en volgde zijn broer Honorius V op die zonder wettelijke opvolger was overleden. Onvoorbereid op deze taak - hij was acteur bij een theatergezelschap - liet hij het feitelijke bestuur over aan zijn echtgenote Maria Caroline Gibert de Lametz, eveneens een actrice die hij huwde in 1816. Tijdens zijn regeerperiode kwamen de plaatsen Menton en Roquebrune-Cap-Martin in opstand en verklaarden zichzelf onafhankelijk onder de bescherming van het koninkrijk Sardinië. Deze plaatsen maakten 80% uit van de oppervlakte van het prinsdom. In het jaar 1861, bij de assimilatie van Sardinië door het ontstane koninkrijk Italië, werden de plaatsen formeel aan Frankrijk afgestaan. Het vorstelijke paar had 2 kinderen: * prins Karel, als troonopvolger (1818-1889) * prinses Florestine (1833-1897) (nl)\n\nFlorestan I av Monaco, född i Paris 10 oktober 1785, död 20 juni 1856, var en monark (furste) av Monaco. Han var son till Honoré IV av Monaco och Louise d'Aumont. Florestan var initialt verksam som skådespelare, och gifte sig 1816 med en kollega, Maria Caroline Gibert de Lametz, med vilken han fick en dotter och en son. Han hade en äldre bror, Honoré V, och förväntades aldrig bli furste i Monaco, som han aldrig hade besökt före sitt trontillträde. 1826 ärvde han en förmögenhet av sin mor. År 1841 avled brodern ogift och utan en legitim son, och Florestan efterträdde honom. Han överlät alla regeringsangelägenheter åt sin fru och hade ingenting att göra med politik under sin tid som formell regent. När revolutionen 1848 nådde Monaco tvingades han abdikera, men återinsattes med sardinsk hjälp 1849, och avled 1856. (sv)\n\nTancrede Florestan Roger Louis Grimaldi, książę Monako, książę Valentinois (ur. 10 października 1785 w Paryżu, zm. 20 czerwca 1856 w Paryżu) – 9. książę Monako od 2 października 1841 do 20 czerwca 1856, syn księcia Honoriusza IV Grimaldi i księżnej Ludwiki d’Aumont Mazarin. (pl)\n\nФлорестан I (10 октября 1785, Париж — 20 июня 1856, Париж) — девятый князь Монако с 1841 по 1856 год из династии Гримальди. (ru)\n\nFlorestan I (Paris, 10 de outubro de 1785 – Paris, 20 de junho de 1856) foi o Príncipe de Mônaco de 1841 até sua morte. Era o segundo filho do príncipe Honorato IV e Luísa de Aumont, tendo ascendido ao trono após a morte de seu irmão Honorato V. Florestan nunca foi preparado para assumir o papel de príncipe soberano: ele tinha sido um ator no Theatre de l’Ambigu-Comique. Na verdade, o poder real durante seu reinado estava concentrado nas mãos de sua esposa, Maria Carolina Gibert de Lametz. Por algum tempo, ela pôde aliviar a situação de dificuldade econômica originária da nova posição de Mônaco como protectorado do Reino de Sardenha, então o poder regional, em vez da França. O casal real também tentou encontrar demandas locais por maior democracia e ofereceu duas constituições à população local, mas estas foram rejeitadas, particularmente pelo povo de Menton. Quando eles perceberam que seus esforços falharam, concederam o poder ao seu filho Carlos (depois Carlos III). No entanto, era tarde demais. Encorajados pelos eventos de 1848, as cidades de Menton e Roquebrune se revoltaram e declararam-se independentes. Elas esperavam ser anexadas por Sardenha, mas isso não ocorreu, e continuaram no estado de limbo político até serem finalmente cedidas à França em 1861, no reinado de Carlos III. Apesar de suas boas intenções, no momento de morte de Florestan em 1856, Mônaco era um país dividido com poucas perspectivas de prosperidade financeira. Restou ao seu herdeiro remediar a situação. (pt)\n\nФлореста́н I (фр. Tancrède Florestan Roger Louis Grimaldi; 10 жовтня 1785 — 20 червня 1856, Париж) — князь Монако з 2 жовтня 1841 до своєї смерті. (uk)\n\n佛洛雷斯坦一世（法語：Florestan，1785年10月10日－1856年6月20日），摩納哥親王，1841年至1856年在位。 (zh)"}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/honore-ii-monacos-first-ruler-formally-titled-sovereign-prince/", "page_content": "The history of Monaco has always been one of crafting an independent path while great power rivalries swirled around it. Between the reigns of Honoré I in 1523 and Honoré II just over one hundred years later it was the great rivalries between Spain and France through which Monaco had to ingeniously steer a course.\n\nThe reign of Honoré II (1604–1662) in many ways could be considered a miracle against the turbulence of the age. Not only did he protect Monaco’s independence, he secured additional formal recognition of it in the diplomatic arena with clarity on the title Prince (rather than Lord or Seigneur) and had the right to mint his own coinage since 1640.\n\nHonoré II lulled his Spanish host-occupiers into believing their strategy of limiting his powers was working. They were happy to see him immerse himself in a role devoted to cultural pursuits and entertainment of foreign guests. Meanwhile the Spanish kept a tight rein on governance, protected by their occupying garrison on the Rock. They also limited the role of the Monaco Ruling Council much to the resentment of the Monegasque population. In the meantime Honoré turned his custodianship in the cultural domain into a strategic victory for the Principality. Monaco became a magnet for poets, artists, sculptors and musicians. The Princely Palace joined Paris and Florence as a European centre of great culture and learning. Indeed, the quality of the art collection of Prince Honoré became a topic of conversation across Europe.\n\nAnd another transformation took place out of what had been originally more a feature of the military fortifications on the Rock. The apartments for the Prince, previously enlarged and renovated by Honoré I, became even more regal and palatial. And similarly with the Church of Saint Nicholas.\n\nWhile all the time lulling the Spanish occupiers into a false sense of security Honoré was quietly planning his crowning achievement — to rid Monaco of the oppressive Spanish to whom it had become partially victim.\n\nTreaty of Péronne\n\nWorking discreetly, Prince Honoré II negotiated with Cardinal Richelieu of France, who represented King Louis XIII. Out of that came the Treaty of Péronne (1641) which stipulated that Monaco become a French protectorate. However, most importantly the independent status of the Prince was guaranteed. Monaco was also granted lands in France to compensate for inevitable losses that the break from Spain would entail.\n\nFrench troops were envisaged as garrisoning Monaco with their officers being directly answerable to the Prince of Monaco rather than to the French State. And just as importantly Monegasque independence was to be maintained.\n\nExpulsion of the Spanish\n\nOn November 17, 1641 Honoré II put his plan to expel the Spanish garrison into effect. He quickly imprisoned those individuals known to be sympathetic to Spanish rule. Then that same evening he threw a sumptuous banquet for the Spanish troops and their commanders. The soldiers were given generous amounts of alcohol to subdue them and then, at a prearranged signal of a canon shot numerous Monegasques sprang on the Spanish. French troops came rushing out of hiding to finish them off and force them to surrender. Records report only 5 killed and 10 wounded before the Spanish garrison yielded. Monaco then officially expelled them and Honoré relinquished his Spanish honorary title of Order of the Golden Fleece. As expected the Spanish confiscated all of the Prince’s property in Spain and Monaco’s Spanish-linked possessions in Italy.\n\nDuke of Valentinois\n\nThe French compensated Honoré for the losses of land and titles. Louis XIII made Honoré II the Duke of Valentinois, Count of Carladès, Baron of Buis and Calvinet as well as granting him the lands and title of St-Rémy. The monarchs of France and Monaco became very close. Thus when Honoré was approached by English Royalists to harbour a fleet in Monaco with the intention of wrestling power from Cromwell, Honoré consulted with France’s Cardinal Mazarin who was looking to ally with Cromwell against Spain. On Mazarin’s advice he very diplomatically resisted.\n\nAn Enviable Legacy\n\nPrince Honoré II died on January 10, 1662 at the age of 64 deservedly very popular and with a legacy of numerous achievements. He had removed Monaco from being under the yolk of Spain. He created a new alliance with the increasingly powerful French while maintaining Monaco’s independence. It also fell to him to help his subjects survive through a plague. Thanks to advice from monks in Nice on cleanliness and sanitation the plague abated. His cultural achievements flowed from a natural passion and the prestige he gained from them led him to be referred to as the «Louis XIV of Monaco». And the Sun King Louis XIV would stand as godfather to Honoré II’s grandson who was also named Louis, cementing relations with France that last to this very day."}, {"url": "https://dbpedia.org/page/Honor%C3%A9_V,_Prince_of_Monaco", "page_content": "Honoré V. von Monaco (* 14. Mai 1778 in Paris; † 2. Oktober 1841 ebenda) war von 1819 bis zu seinem Tod regierender Fürst von Monaco. Er war der Sohn seines Vorgängers Honoré IV. und der Louise d’Aumont Mazarin, Herzogin von Mazarin und von . Honoré übernahm die Herrschaft im Jahre 1819, nachdem das Fürstentum 1815 zu einem Protektorat des Königreichs Sardinien geworden war. Durch eine straffe Staatsführung versuchte er, die schlechte wirtschaftliche Lage des Fürstentums – teilweise auch auf Kosten des Volkes – zu verbessern. Im Jahre 1833 kam es in Menton zu Protesten des Volkes gegen ihn. Nach seinem Tod übernahm sein Bruder Florestan die Herrschaft. (de)\n\nΟ Ονώριος Ε΄ (γαλλικά: Honoré V) ήταν ο Πρίγκιπας του Μονακό από τις 16 Φεβρουαρίου 1819 μέχρι το θάνατό του στις 2 Οκτωβρίου 1841. Το πλήρες όνομά του ήταν το Ονώριος Γαβριήλ Γκριμάλντι και γονείς του ήταν ο Πρίγκιπας Ονώριος Δ΄ του Μονακό και η . Σε ηλικία 20 ετών κατετάγη στο γαλλικό ιππικό. Εκεί, ως αξιωματικός έγινε διαδοχικά υπασπιστής του Εμανουέλ ντε Γκρουσί και του Ζοακίμ Μυρά. Με εντολή του τελευταίου ο Ονώριος έγινε στις 3 Ιουλίου 1807 λεγεωνάριος. Έχοντας ακολουθήσει τον Μουρά στην Ισπανία έγινε αργότερα πρώτος σταβλάρχης της . Από το 1815 είχε αναλάβει τα χρέη του πατέρα του στο Μονακό και τέσσερα χρόνια αργότερα τον διαδέχτηκε στο θρόνο. Έχοντας νομικές γνώσεις θα υιοθετήσει έναν αστικό κώδικα, εμπνευσμένο από τον ναπολεόντειο κώδικα. Αυτός ο αστικός κώδικας αναθεωρήθηκε το 1818 και παρέμεινε σε ισχύ αμετάλλακτος μέχρι το 1880. Ο Ονώριος απέκτησε με την ερωμένη του, Φελισιτέ Προνό ντε Γκαμάς, έναν γιο, τον Όσκαρ (ή Λουδοβίκο) (1807-1894), ο οποίος ωστόσο δεν είχε δικαίωμα επί του μονεγασκικού θρόνου. Με το θάνατο του Ονώριου Ε΄ το 1841, τον διαδέχτηκε ο αδελφός του Φλορεστάνος. (el)\n\nHonorato V Gabriel Grimaldi (París, 13 de mayo de 1778-2 de octubre de 1841) era hijo de Honorato IV de Mónaco (1758-1819) y de su esposa, , duquesa de Mazarin (1759-1826), heredera del ducado de . Sin alianza, tuvo sin embargo un hijo con su ama , Luis Grimaldi (1807-1814)- ú para otros-, titulado marqués de Baux por su padre según el derecho monegasco. Primero barón de Mónaco y del Imperio (decreto imperial del 15 de marzo de 1810 sin cartas patentes): este título simple de barón es el reflejo de las dificultades entonces encontradas por la antigua familia reinante de un principado anexionado por Francia del 1793 a 1814. Fue regente durante el gobierno de su padre, Honorato IV, desde el 3 de marzo de 1815, hasta su muerte. Fue príncipe de Monaco desde el 16 de febrero de 1819 hasta el 2 de octubre de 1841. Le sucedió su hermano Florestán I. (es)\n\nHonoré V (Honoré Gabriel Grimaldi; 13/14 May 1778 – 2 October 1841) was Prince of Monaco and Duke of Valentinois. He was the first son of Honoré IV of Monaco and Louise d'Aumont. (en)\n\nHonoré V (monégasque : Unuratu Vtu), né le 14 mai 1778 à Paris et mort le 2 octobre 1841 dans la même ville, est prince souverain de Monaco de 1819 à sa mort. (fr)\n\nOnorato V Gabriele di Monaco (Parigi, 14 maggio 1778 – Parigi, 2 ottobre 1841) è stato Principe sovrano di Monaco dal 1819 al 1841. (it)\n\nオノレ5世・ガブリエル（Honoré V Gabriel, 1778年5月14日 - 1841年10月2日）は、モナコ公（在位：1819年 - 1841年）。 (ja)\n\nHonorius V Gabriël Grimaldi (Parijs, 14 mei 1778 — aldaar, 2 oktober 1841) was van 1819 tot 1841 vorst van Monaco. Toen de macht van zijn vader Honorius IV na de capitulatie van Napoleon Bonaparte krachtens het Verdrag van Parijs in 1814 werd hersteld, wilde deze vanwege zijn slechte gezondheid de macht overdragen aan zijn broer . Na protesten van Honorius Gabriël aanvaardde Honorius IV toch zelf de regering, sinds 1815 onder regentschap van zijn zoon. Honorius V besteeg na de dood van zijn vader in 1819 de troon van het vorstendom Monaco, dat sinds 1815 een protectoraat van het koninkrijk Sardinië was. Koning Lodewijk XVIII bekrachtigde, als nieuwe koning van Frankrijk tijdens de Restauratie, zijn titel van hertog van Valentinois voor het leven (1817). Honorius V trachtte door draconische maatregelen de economische malaise in zijn staat aan te pakken, hetgeen tot misnoegen leidde bij de bevolking. In 1833 kwam het in Menton tot protesten tegen de vorst. Met zijn minnares, Félicité Rouault de Gamaches, had hij een zoon Louis Gabriel Oscar Grimaldi (1814-1894). Louis Gabriel Oscar Grimaldi werd gelegitimeerd, maar Honorius V werd na zijn dood op 2 oktober 1841 toch opgevolgd door zijn broer Florestan I. (nl)\n\nОноре V (фр. Honoré V; 13 мая 1778 — 2 октября 1841) — князь Монако и герцог Валентинуа с 1819 по 1841 год из династии Гримальди. Сын князя Оноре IV (1758—1819) и его жены Луизы д’Омон, герцогини де Мазарини (1759—1826). При рождении получил имя Оноре Габриэль. С 1793 по 1814 год княжество Монако было аннексировано Францией. Оноре Гримальди в 1798—1815 годах служил во французской армии как простой офицер кавалерии. Был адъютантом генерала (впоследствии маршала) Груши и маршала Мюрата. Барон Империи (1810). По легенде, в начале Ста дней Наполеон, только что высадившийся в бухте Жуан, повстречал едущего верхом Оноре Гримальди. Когда Оноре сказал «Я еду домой, в Монако», Наполеон ответил: «Я тоже еду домой, в Тюильри». В 1815—1819 годах правил Монако от имени отца, с 1819 года — в качестве князя. Пэр Франции (1815). Создал новое законодательство для Монако на основе кодекса Наполеона. Оноре V не был женат, и после его смерти княжество Монако унаследовал младший брат — Флорестан I. У князя Оноре V был внебрачный узаконенный сын (1814—1894). (ru)\n\nHonore Gabriel Grimaldi, książę Monako, książę Valentinois (ur. 14 maja 1778 w Paryżu, zm. 2 października 1841 w Paryżu) – 8. książę Monako od 16 lutego 1819 do 2 października 1841, syn księcia Honoriusza IV Grimaldi i księżnej Ludwiki d’Aumont. (pl)\n\nHonoré V av Monaco, född i Paris 13 maj 1778, död i Paris 2 oktober 1841, var monark (furste) av Monaco 1819-1841, efter att ha varit regent redan fem år före sin tronbestigning. Han var son till Honoré IV av Monaco och Louise d'Aumont. Han tjänstgjorde i den franska armén, och beskrivs som lojal till Napoleon I. När furstendömet Monaco återupprättades 1814, blev hans far furste, men på grund av hans hälsotillstånd sattes faderns bror, prins Josef av Monaco, som hans regent. Honoré krävde framgångsrikt att som tronarvinge själv få bli faderns regent året därpå. Under De hundra dagarna förklarade sig Honoré V trogen Napoleon. Vid Napoleons slutliga fall 1815, blev Monaco därför placerat under Sardinien snarare än Frankrike, och utsattes för en ekonomisk bojkott som orsakade kris i furstendömet. Honoré V, som formellt blev furste vid faderns död 1819, försökte lösa den ekonomiska krisen genom att bygga fabriker och uppmana till tobaksplantager bland befolkningen, men hans åtgärder gjorde honom impopulär och han blev uppfattad som snål och girig och auktoritär. Han beskrivs som en ensamvarg som inte litade på någon och levde i konflikt med sin bror, som efterträdde honom eftersom han inte gifte sig, och endast hade en utomäktenskaplig och därmed inte arvsberättigad son. (sv)\n\nHonorato V, Príncipe de Mônaco (Honoré Gabriel Grimaldi; 13 de maio de 1778 - 2 de outubro de 1841) foi o príncipe soberano de Mônaco de 1819 até sua morte. Nascido em Paris, na França, Honorato era filho de Honorato IV, Príncipe de Mônaco e de Luísa de Aumont, Duquesa de Mazarino. Ele foi sucedido por seu irmão menor, Florestan I. (pt)\n\n奧諾雷五世（法語：Honoré V，1778年5月13日－1841年10月2日），摩納哥親王，1819年至1841年在位。 奧諾雷終生未婚，去世後由弟弟佛洛雷斯坦繼位為摩納哥親王。 (zh)\n\nОноре V (фр. Honoré V; 13 травня 1778 — 2 жовтня 1841) — князь Монако і герцог Валентінуа з 1819 по 1841 з династії Грімальді. Син князя Оноре IV (1758—1819) і його дружини Луїзи д'Омон, герцогині де Мазаріні (1759—1826). При народженні отримав ім'я Оноре Габріель. У 1798—1815 служив у французькій армії (офіцер кавалерії). У 1815—1819 правив Монако від імені батька, з 1819 — як князь. Пер Франції (1815). Оноре V не був одружений, і після його смерті князівство Монако успадкував молодший брат — Флорестан І. У князя Оноре V був позашлюбний узаконений син Оскар Грімальді, маркіз де Бо (1814—1894). (uk)"}, {"url": "https://wiki.alquds.edu/?query=Honor%C3%A9_V,_Prince_of_Monaco", "page_content": "Prince of Monaco from 1819 to 1841\n\nHonoré V (Honoré Gabriel Grimaldi; 13/14 May 1778 – 2 October 1841) was Prince of Monaco and Duke of Valentinois. He was the first son of Honoré IV of Monaco and Louise d'Aumont.\n\nRegent [ edit ]\n\nIllnesses resulting from his imprisonment incapacitated Honoré IV in his later years, and following the re-establishment of the Principality in 1814, a regency was established to rule in Honoré's name. This regency was directed, first, by his brother Joseph Grimaldi, then from 1815 by his son, the Hereditary Prince Honoré, who succeeded him in 1819 as Sovereign Prince Honoré V.[1]\n\nReign [ edit ]\n\nA professor of the period, Victor de la Canorgue, wrote of Prince Honoré in negative terms: extravagant and fond of luxuries for himself, but miserly for others, even his own family, to whom he gave \"pensions disproportionate to his means.\"[2] This professor endeavored to collect accounts of the reigns of Honoré V and of his brother and successor, Prince Florestan, and to translate them from Italian to French, for the purpose of better understanding the causes of the ever-increasing anti-monarchist movements, especially in former parts of the Principality like Menton and Roquebrune-Cap-Martin. One ordinance, dated from 1815, suggested that Prince Honoré V was not only miserly but greedy, that he brought even \"the benches of the parish church, which some persons had built at their own expense\",[2] under his control, for his own profit.\n\nGustave Saige described him as a loner who did not trust anyone, including his brother, to help him govern. He was invisible to the public.[3] His focus was on the crippled economy of Monaco; he raised taxes and tried to restore the tobacco plant his grandfather Honoré III had founded but which had been closed by the government of Turin.[4] He endeavored to open factories and initiate citrus farm cooperatives in order put people to work, generate production, and alleviate poverty. However, none of his efforts raised his popularity, as his measures were seen by the people as autocratic.[4]\n\nChild and succession [ edit ]\n\nHonoré V never married. He had a son, with his mistress Félicité de Gamaches, Louis Gabriel Oscar Grimaldi, born in Paris on 9 June 1814 and died in Saint-Germain-en-Laye on 15 July 1894.[5][6][7] Honoré's son was legitimized,[7] but the throne nevertheless passed to Honoré's brother, Florestan.\n\nReferences [ edit ]\n\n\n\n"}, {"url": "https://en.unionpedia.org/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "Honoré IV, Prince of Monaco Honoré IV (17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 12 March 1795 to 16 February 1819. [1]\n\n25 relations: Antonio I, Prince of Monaco, Catherine Charlotte de Gramont, Charles Maurice de Talleyrand-Périgord, Congress of Vienna, Doge of Genoa, Duke of Valentinois, Florestan I, Prince of Monaco, Giuseppe Brignole, Honoré III, Prince of Monaco, Honoré V, Prince of Monaco, House of Grimaldi, Jacques I, Prince of Monaco, Louis I, Prince of Monaco, Louis, Count of Armagnac, Louise d'Aumont, Louise Hippolyte, Princess of Monaco, Maria Caterina Brignole, Marie of Lorraine, Monarchy of Monaco, Napoleon, Paris, Prince Joseph of Monaco, Regent, Republic of Genoa, Saint Nicholas Cathedral, Monaco.\n\nAntonio I (25 January 1661 – 20 February 1731) was the sovereign Prince of Monaco from 1701 to 1731.\n\nNew!!: Honoré IV, Prince of Monaco and Antonio I, Prince of Monaco · See more »\n\nCatherine Charlotte de Gramont (1639 – 4 June 1678) was a French noblewoman and Princess of Monaco as the wife of Louis I of Monaco and a mistress of Louis XIV of France.\n\nNew!!: Honoré IV, Prince of Monaco and Catherine Charlotte de Gramont · See more »\n\nCharles Maurice de Talleyrand-Périgord (2 February 1754 – 17 May 1838), 1st Prince of Benevento, then 1st Prince of Talleyrand, was a laicized French bishop, politician, and diplomat.\n\nNew!!: Honoré IV, Prince of Monaco and Charles Maurice de Talleyrand-Périgord · See more »\n\nThe Congress of Vienna (Wiener Kongress) also called Vienna Congress, was a meeting of ambassadors of European states chaired by Austrian statesman Klemens von Metternich, and held in Vienna from November 1814 to June 1815, though the delegates had arrived and were already negotiating by late September 1814.\n\nNew!!: Honoré IV, Prince of Monaco and Congress of Vienna · See more »\n\nThe Doge of Genoa (Ligurian: Dûxe, pron. /'dy:ʒe/; Januensium dux et populi defensor, \"Commander of the Genoese and Defender of the People\") was the ruler of the Republic of Genoa, a communal republic, from 1339 until the state's extinction in 1797.\n\nNew!!: Honoré IV, Prince of Monaco and Doge of Genoa · See more »\n\nDuke of Valentinois (French: Duc de Valentinois; Duca Valentino), formerly Count of Valentinois, is a title of nobility, originally in the French peerage.\n\nNew!!: Honoré IV, Prince of Monaco and Duke of Valentinois · See more »\n\nFlorestan I, Prince of Monaco (10 October 1785 in Paris – 20 June 1856) was Prince of Monaco and Duke of Valentinois from 2 October 1841 until his death.\n\nNew!!: Honoré IV, Prince of Monaco and Florestan I, Prince of Monaco · See more »\n\nGiuseppe Maria Brignole Sale (1703–1769) was a Genovese nobleman and father of Maria Caterina Brignole, Princess of Monaco and later Princess of Condé.\n\nNew!!: Honoré IV, Prince of Monaco and Giuseppe Brignole · See more »\n\nHonoré III (10 November 1720 – 21 March 1795) ruled as Prince of Monaco and was Duke of Valentinois for almost sixty years from 1733 to 1793.\n\nNew!!: Honoré IV, Prince of Monaco and Honoré III, Prince of Monaco · See more »\n\nHonoré V (13 May/14 May 1778 in Paris – 2 October 1841 in Paris) was Prince of Monaco and Duke of Valentinois.\n\nNew!!: Honoré IV, Prince of Monaco and Honoré V, Prince of Monaco · See more »\n\nThe House of Grimaldi is associated with the history of the Republic of Genoa, Italy and of the Principality of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and House of Grimaldi · See more »\n\nJacques Goÿon de Matignon (Jacques François Léonor; 21 November 1689 – 23 April 1751) was Count of Thorigny, Prince of Monaco as Jacques I, and the fourth Duke of Valentinois from 1731 until 1733.\n\nNew!!: Honoré IV, Prince of Monaco and Jacques I, Prince of Monaco · See more »\n\nLouis I, Prince of Monaco (25 July 1642 in Prince's Palace of Monaco – 3 January 1701 in Rome) was Prince of Monaco from 1662 until 1701.\n\nNew!!: Honoré IV, Prince of Monaco and Louis I, Prince of Monaco · See more »\n\nLouis of Lorraine (7 December 1641 – 13 June 1718) was the Count of Armagnac from his father's death in 1666.\n\nNew!!: Honoré IV, Prince of Monaco and Louis, Count of Armagnac · See more »\n\nLouise d'Aumont, duchesse d'Aumont, duchesse Mazarin et de La Meilleraye (Louise Félicité Victoire; 22 October 1759 in Paris – 13 December 1826 in Paris) was the only child and daughter of Louis Marie d'Aumont, Duke of Aumont (1732–1799), and his wife, Louise Jeanne de Durfort, duchesse Mazarin et de La Meilleraye (Paris, 1 September 1735 - Paris, 17 March 1781).\n\nNew!!: Honoré IV, Prince of Monaco and Louise d'Aumont · See more »\n\nLouise Hippolyte (10 November 1697 – 29 December 1731) was one of only two women to reign over the Principality of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and Louise Hippolyte, Princess of Monaco · See more »\n\nMaria Caterina Brignole (or Marie-Christine de Brignole; 7 October 1737 – 18 March 1813) was Princess consort of Monaco by marriage to Honoré III, Prince of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and Maria Caterina Brignole · See more »\n\nMarie de Lorraine (12 August 1674 – 30 October 1724) was a princess of the House of Lorraine-Guise and Princess of Monaco as consort of Antonio I of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and Marie of Lorraine · See more »\n\nThe Sovereign Prince or Princess of Monaco is the reigning monarch and head of state of the Principality of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and Monarchy of Monaco · See more »\n\nNapoléon Bonaparte (15 August 1769 – 5 May 1821) was a French statesman and military leader who rose to prominence during the French Revolution and led several successful campaigns during the French Revolutionary Wars.\n\nNew!!: Honoré IV, Prince of Monaco and Napoleon · See more »\n\nParis is the capital and most populous city of France, with an area of and a population of 2,206,488.\n\nNew!!: Honoré IV, Prince of Monaco and Paris · See more »\n\nPrince Joseph of Monaco (Joseph Marie Jerôme Honoré; 10 September 1763 – 28 June 1816) was a Monagasque prince and brother of Honoré IV, Prince of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and Prince Joseph of Monaco · See more »\n\nA regent (from the Latin regens: ruling, governing) is a person appointed to govern a state because the monarch is a minor, is absent or is incapacitated.\n\nNew!!: Honoré IV, Prince of Monaco and Regent · See more »\n\nThe Republic of Genoa (Repúbrica de Zêna,; Res Publica Ianuensis; Repubblica di Genova) was an independent state from 1005 to 1797 in Liguria on the northwestern Italian coast, incorporating Corsica from 1347 to 1768, and numerous other territories throughout the Mediterranean.\n\nNew!!: Honoré IV, Prince of Monaco and Republic of Genoa · See more »\n\nCathédrale Notre-Dame-Immaculée (Cathedral of Our Lady of the Immaculate Conception), also known as Saint Nicholas Cathedral (name of the old church which was demolished in 1874), Monaco Cathedral (French: Cathédrale de Monaco), is the cathedral of the Roman Catholic Archdiocese of Monaco in Monaco-Ville, Monaco, where many of the Grimaldis were buried, including Grace Kelly and—more recently—Rainier III.\n\nNew!!: Honoré IV, Prince of Monaco and Saint Nicholas Cathedral, Monaco · See more »\n\nRedirects here:\n\nHonore IV, Honore IV of Monaco, Honore IV, Prince of Monaco, Honore IV,5FPrince of Monaco, Honoré IV, Honoré IV of Monaco, Honoré IV,5FPrince of Monaco, Prince Honore IV of Monaco.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Honoré_IV,_Prince_of_Monaco"}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iii-one-of-the-longest-reigns-in-european-history-en/", "page_content": "Everybody knows that the reign of French King Louis XIV, ‘Le Roi Soleil’, was the longest in European history. Two British Queens — Elizabeth II who will celebrate 70 years on the throne in 2022 and her great-great-grandmother Victoria (who reigned for 63 years) also had lengthy reigns. But few know that the fifth prince of Monaco is also on the list of the longest-reigning European monarchs: after coming to the Monegasque throne in 1733 he reigned for nearly 60 years and so passed his ancestor Honoré, Lord of Monaco, who ruled for 58 years in the XVI century.\n\nAscension to the Throne at the age of 13\n\nHonoré Camille Léonor Grimaldi was born on November 10, 1720. He was the son of Louise-Hyppolite, and the grandson of Prince Antoine I, who both died in 1731. Honoré came to the throne just after turning 13 when his father, Prince Jacques I, abdicated. Prince Honoré III spent much of his time away on campaign with the Royal French Army fighting the English in the War of the Austrian Succession. Honoré III was wounded fighting in the French victory at Rocoux. Later, he earned the Cross of St Louis for his conduct and after the Peace of Aix-la-Chapelle in 1748 he was given the rank of Marshal of France.\n\nWhat is interesting is that despite the heroic service of Honoré III in the wars, the Principality of Monaco was neutral in the conflict and, administered by the Chevalier de Grimaldi, assisted both French and English ships in need of help. The Austrians and Sardinians did blockade the Monegasque coast for a time and much of the countryside was pillaged by Croat soldiers of the Austrian army but French forces later cleared the region of all invaders in 1748.\n\nThe Royal Marriage\n\nIn 1757 Honoré III married Maria Caterina di Brignole-Sale who was descended from the Doges of Genoa and called “the most beautiful woman in France”. They were a very proud family and the arrival of the bride-to-be in Monaco turned into a disaster as many of the bridal attendants were seasick and the future mother-in-law insisted that Honoré III come onboard to greet his fiancé and escort her ashore. However, as a monarch in his own right, Honoré III refused as it was considered a breach of protocol for a prince to go to meet someone rather than them being brought to meet him. A stand-off ensued and eventually the Genoese fleet sailed away and stopped farther up the coast before a compromise was negotiated by which the couple would meet in the middle of a bridge extended between ship and shore. Nonetheless, the two were married and in 1758 the future Prince Honoré IV was born followed by Prince Joseph some years later. In 1770, though, Honoré III and Princess Maria Caterina divorced, and she later married the Prince de Condé in 1798.\n\nIn 1767 the British Duke of York was sailing from Marseilles to Genoa when he was suddenly taken ill and had to put in at Monaco. Prince Honoré III quickly offered all the help he could and put his palace at the disposal of the Prince who died after 11 days in what has forever after been known as the York Room of the Princely Palace.\n\nIn the meantime Prince Honoré III did what he could to guide his little principality along, improving trade and the economy which was heavily dependent on growing citrus fruits such as lemons in those days. His reign also saw the establishment of the first printing press in Monaco and the first newspaper the ‘Courrier de Monaco’. Prince Honoré III did take the initiative in pushing for some reforms, the most major of which was the repeal of the law that the Sovereign Prince would receive the inheritance of anyone who died on his property. On August 18, 1770 Honoré saw the practice, which he viewed as barbaric, abolished.\n\nThe French Revolution, Arrest and Imprisonment\n\nAs France slipped increasingly rapidly towards revolution things in Monaco remained calm and peaceful until the fateful day of July 14, 1789; the date of the storming of the Bastille. The shock spread to Monaco where crowds embraced the Declaration of the Rights of Man, influenced by the rise of republicanism in France as well as some newly introduced nostalgia for the Genoese Republic. Honoré III was concerned with the loss of his noble titles in France at the hands of the French National Constituent Assembly which was intent on abolishing all aristocratic privileges and soon he rushed to Paris to try to defend his titles there before the Constituent Assembly.\n\nHonoré III was extremely convincing when dealing with the French revolutionaries. His estates were, he insisted, not the gift of the King of France alone but payment for services rendered in the cause of French national glory. He struck just the right cord and the Assembly voted a generous pension for the Prince of Monaco in reparation for his confiscated properties.\n\nUnfortunately, before the order could be carried out, Danton came to power and the republic was declared. In all the turmoil France lost interest in Monaco and ultimately all Honoré was able to gain was recognition from the republican government of Monegasque neutrality. Unfortunately, that was a promise that would never be respected.\n\nThe French Republic declared their expansionist policy at the end of 1792. Monaco quickly fell victim to this policy and on January 13, 1793 Prince Honoré III was officially declared deposed by the Monegasque National Convention. Members of the Convention immediately filed a petition for accession to France. Some people in France however did protest on the grounds that Honoré III had always been a loyal friend and ally of the French, but republican hatred of monarchy prevailed and Monaco was absorbed into the French Republic and renamed Fort Hercules.\n\nAt the height of the Reign of Terror Honoré III was arrested as was his son, Honoré IV, who had been in Paris at the time and who would remain imprisoned for 15 months. Honoré III had suffered greatly from his own imprisonment and after his release had to stay in his house on the rue de Varennes as the Princely Palace in Monaco had been confiscated by the revolution though, thankfully, there was no ‘Reign of Terror’ or mass arrests and bloodshed in Monaco. Overcome with sadness, suffering, a number of ailments and the ravages of old age Prince Honoré III of Monaco died on March 21, 1795.\n\nIn 2020, the Principality paid a tribute to Prince Honoré III by having issued a 2€ commemorative coin celebrating the 300th anniversary of his birth. At the time of writing, the price of the coin, which was issued in 15,000 copies, has reached in the region of €300."}, {"url": "http://www.worldheritage.org/articles/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://www.wikiwand.com/en/Duke%20of%20Valentinois", "page_content": "Duke of Valentinois (French: Duc de Valentinois; Italian: Duca Valentino) is a title of nobility, originally in the French peerage. It is currently one of the many hereditary titles claimed by the Prince of Monaco despite its extinction in French law in 1949. Though it originally indicated administrative control of the Duchy of Valentinois, based around the city of Valence, the duchy has since become part of France, making the title simply one of courtesy.\n\nTitle of nobility originally within French peerage\n\nIt has been created at least four times: on August 17, 1498, for Cesare Borgia, in 1548 for Diane of Poitiers, in 1642 for Prince Honoré II of Monaco, and most recently in 1715 for Prince Jacques I of Monaco."}, {"url": "https://simple.wikipedia.org/wiki/Honor%C3%A9_III,_Prince_of_Monaco", "page_content": "Honoré III, Prince of Monaco (Honoré Camille Léonor; 10 November 1720 – 21 March 1795) was a reigning prince of the small state of Monaco. He succeeded his mother Louise Hippolyte and is to this day still one of the longest reigning European rulers.\n\nBrief biography [ change | change source ]\n\nThe eldest surviving son of Princess Louise Hippolyte of Monaco and her husband Prince Jacques\n\nIn May 1732 he moved to Paris to be with his father till he was officially proclaimed the prince of Monaco. Antoine Grimaldi, the Chevalier de Grimaldi, acted as regent for the prince between 1732 and 1784, when Honoré chose to live in Paris. This situation remained the same for half a century until Antoine's death in 1784,\n\nOn 5 June 1757 he married Maria Caterina Brignole a member of one of the most powerful and wealthy familys in the Republic of Genoa. The had two sons before divorcing in 1770.\n\nPrince Honoré IV of Monaco (17 May 1758 – 16 February 1819) married Louise d'Aumont and had children. Prince Joseph of Monaco (10 September 1763 – 28 June 1816) married Marie Thérèse de Choiseul and had children.\n\nTitles and styles [ change | change source ]\n\n20 February 1731 - 17 May 1758 His Serene Highness The Marquis of Baux.\n\nThe Marquis of Baux. 7 November 1733 – 19 January 1793 His Serene Highness The Prince of Monaco, Duke of Valentinois.\n\nFurther reading [ change | change source ]"}], "Honoré IV was born on 14 November 1758.": [{"url": "https://pantheon.world/profile/person/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "Honoré IV, Prince of Monaco\n\nHonoré IV (Honoré Charles Anne Grimaldi; 17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 1814 to 16 February 1819 . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Honoré IV, Prince of Monaco has received more than 162,372 page views. His biography is available in 23 different languages on Wikipedia (up from 20 in 2019) . Honoré IV, Prince of Monaco is the 5,788th most popular politician (down from 4,580th in 2019), the 1,731st most popular biography from France (down from 1,446th in 2019) and the 429th most popular French Politician."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iv-prisoner-of-the-french-revolution-2/", "page_content": "Prince Honoré IV was born on May 17, 1758 in Paris, to his parents Prince Honoré III and Princess Maria-Caterina de Brignole-Sale. This prince, perhaps, experienced more challenges in life than any other Grimaldi. Most of his hardships were caused by the French Revolution, and the last hours of his life are still shrouded in mystery …\n\nThe victims of the Great Terror\n\nPrince Honoré IV was unlucky enough to be living in Paris when the Reign of Terror broke out in France. As a nobleman and prince he was soon arrested and thrown into prison. The prince’s former wife, Duchess of Mazarin, was also taken into custody. Assisted by their family doctor, however, she managed to escape and hide with her youngest son Florestan.\n\nThe revolution did not spare the family of Prince’s Honore IV’s youngest brother, Joseph. His wife, Marie Thérèse de Choiseul, was arrested on suspicion of espionage and executed by guillotine. She was only 27, leaving behind three little daughters.\n\nAs for Prince Honoré, he was imprisoned for one and a half years. This time in prison greatly undermined his health, and he never fully recovered from it afterwards. On March 21, 1795 his father died and Honoré IV ascended the throne of Monaco. At that time the monarchy had just been banned and Monaco was once again annexed to the French Republic under the name of Port Hercule.\n\nEven after Prince Honoré was released from prison, it took another seven years of negotiations before the French regime restored some of Honoré IV’s and his brother Prince Joseph’s income. The future started to look brighter for the Grimaldi’s once the radical revolutionary regime was followed by the French consulate and, finally, by the First French Empire of Napoleon Bonaparte.\n\nReturn to the throne\n\nWhen the Napoleonic Wars finally came to an end, the status of Monaco was restored by the Congress of Vienna (1814–1815) thanks to the efforts of Prince Talleyrand. On May 30, 1814 Honoré IV was officially named the Principality’s ruler. However, he was too ill to take control of his country. So it was his brother Prince Joseph who became regent.\n\nThe Prince’s eldest son, 36-year-old Honoré Gabriel, however, was not happy about this decision. A brilliant soldier, he entered the cavalry service at the age of 20 and prospered in the army of the Empire Marshal, Emmanuel de Grouchy. Since Prince Joseph was not particularly eager to deal with the Principality’s affairs, preferring his life in the capital, he easily facilitated handing over the reins to his nephew, Honoré Gabriel, who ruled Monaco up until the death of Honoré IV (later becoming Prince Honoré V). As for Honoré IV, he lived in Paris until his very death which remains mysterious to this day…\n\nAccident or murder ..?\n\nOn a winter’s day of February 16, 1819, Honoré IV drowned in the Seine river. The death of the Monaco prince looked like a typical accident. That’s what the investigation concluded as an official version. It must not be forgotten, however, that Honoré IV was not a very healthy person, to say the least. This is the reason why he was not only unwilling, but was also physically unfit to rule the country. Imprisonment and numerous personal tragedies had taken their toll on the Prince, making him, for all intents and purposes, disabled. This is what the scanty preserved data suggests. A legitimate question arises: how could a 60-year-old monarch, in deplorable physical state, manage to cover such a considerable distance away from home (Avenue Denfert-Rochereau) to the Seine river bank..?\n\nWas it really an accident? Or rather a premeditated murder? Or could it be that the Prince decided to put an end to his own unhappy life? Being a depressed person, did he step into the Seine himself..? The answer remains a mystery.\n\nThe main legacy of Prince Honore IV\n\nAs Prince of Monaco, Honoré IV suffered three arrests and never actually ruled Monaco. He spent part of his life in a prison cell and the rest, trying to improve his health. Needless to say, there are very few mentions of the Prince, even in the archives of Monaco. His most important contribution to the history of Monaco was the birth of his two sons — the future princes, Honoré V and Florestan I, who consistently ruled the Principality and left their mark on the state’s history."}, {"url": "https://www.unofficialroyalty.com/honore-iv-prince-of-monaco/", "page_content": "by Susan Flantzer\n\n© Unofficial Royalty 2022\n\nHonoré Charles Anne Grimaldi was born in Paris, France on May 17, 1758. He was the elder of the two sons of Honoré III, Prince of Monaco and Maria Caterina Brignole who came from a Republic of Genoa (now in Italy) noble family. Honoré’s paternal grandparents were Louise-Hippolyte, Sovereign Princess of Monaco for ten months before her death from smallpox, and Jacques I, briefly the Sovereign Prince of Monaco, born Jacques François Leonor Goyon de Matignon. His maternal grandparents were Giuseppe Brignole, Marquis di Groppoli, the Ambassador to France from the Republic of Genoa, now in Italy, and Maria Anna Balbi.\n\nHonoré IV had one younger brother:\n\nPrince Joseph of Monaco, Regent of Monaco (1763 – 1816), married (1) Marie Thérèse de Choiseul, had three children, Marie Thérèse was guillotined during the French Revolution (2) Frances Margaret Powell, no children\n\nHonoré IV’s parents had issues with their marriage. Honoré III and Maria Caterina initially lived in Monaco but by 1760, Honoré III was dissatisfied with his life there, and returned to France without his wife, spending time with his mistresses at his French homes. Eventually, Maria Caterina was allowed to come to France. However, Honoré III continued his affairs and Maria Caterina began an affair, that would become long-term, with Louis Joseph de Bourbon, Prince of Condé. In 1770, Louis Joseph used his influence to obtain a legal separation for Maria Caterina from Honoré III and the right to manage her own finances. Honoré III finally realized his relationship with Maria Caterina was over and eventually accepted Maria Caterina’s relationship with Louis Joseph de Bourbon, Prince of Condé. Three years after Honoré III’s death in 1798, Maria Caterina and Louis Joseph were married but their marriage was kept secret for ten years.\n\nHonoré IV and his brother Joseph grew up mostly in France, living in homes inherited from their paternal grandfather Jacques III Goyon de Matignon, Count of Thorigny: a Paris mansion, the Hôtel de Matignon, now the official residence of the Prime Minister of France, and the Château des Matignon (link in French) in Torigni-sur-Vire in Normandy, France. In 1641, during the reign of Honoré II, Monaco had become a French protectorate, and the Princes of Monaco became vassals of the Kings of France while remaining sovereign princes. Many successive Princes of Monaco and their families spent most of their lives in France and intermarried with French and Italian noble families.\n\nHonoré III arranged a marriage for his son Honoré (IV) to Louise d’Aumont, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the only child of Louis Marie Guy d’Aumont de Rochebaron, Duke of Aumont (1732 – 1799) and Louise-Jeanne de Durfort, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye (1735 – 1781). Through her mother, Louise was the great-great-great-granddaughter of Hortense Mancini, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the mistress of King Charles II of England, and one of the two heirs of her uncle Cardinal Jules Mazarin, the First Minister of King Louis XIV of France. Louise was the heir of Hortense Mancini’s titles and the Mazarin family wealth. Therefore, a marriage to Louise came with a large dowry and the prospect of a fortune. Honoré (IV) and Louise married on July 15, 1777.\n\nThe marriage did produce two sons, both Sovereign Princes of Monaco:\n\nThe French Revolution had dire consequences for the Grimaldi family. In January 1793, Honoré III, Prince of Monaco was officially declared deposed and the Principality of Monaco was annexed by France. The members of the former ruling Grimaldi dynasty lost all aristocratic privileges in France, were dispossessed of their French property, and became French citizens. During the Reign of Terror, in September 1793, Honoré (IV), his wife Louise, their son Florestan, and Honoré (IV)’s father Honoré III were arrested and imprisoned in Paris as enemies of the people. Louise and her son Florestan were rescued by a family doctor who forged release papers and then hid them in his home until the Reign of Terror was over. The wife of Honoré IV’s brother Joseph was not as lucky. Joseph spent most of his time abroad negotiating foreign loans which made him a suspect of counter-revolutionary activities. When Joseph did become involved in a counter-revolution, his wife Marie Thérèse was arrested in the absence of her husband, condemned to death, and guillotined in 1794, one of the last victims before the end of the Reign of Terror.\n\nIn October 1794, Honoré III and Honoré (IV) were released from prison. Honoré III never recovered from his imprisonment and died in Paris on March 21, 1795, at the age of 74, but his burial place is unknown. Honoré IV, whose chronic ill health had been worsened by imprisonment, would have become Prince of Monaco but Monaco was no longer a sovereign monarchy. However, Honoré IV’s family properties in France were returned to him but they were in poor condition and all of the contents were gone.\n\nIn 1794, while Honoré IV was still in prison, Louise had given birth to an illegitimate daughter Amélie Céleste Erodore d’Aumont. The father of the child is believed to have been Antoine de Montazet, Archbishop of Lyon. After Honoré IV’s release from prison, Louise and Honoré IV’s marriage became unhappy and the couple separated. In 1798, Louise divorced Honoré IV, giving Louise sole access to her fortune.\n\nIn 1804, Napoleon crowned himself Emperor of the French. Honoré IV could not adapt to the new French society and for the most part, remained an outsider. Because of a lack of funds, he needed to sell his family’s Paris and Normandy homes. Surprisingly, Honoré IV’s health improved and he joined the French Army. He was wounded during Napoleon’s Russian Campaign, lost the use of one arm, and was sent back to Paris.\n\nAfter Napoleon’s defeat in 1814 and the Bourbon Restoration which saw Louis XVIII, a younger brother of the beheaded King Louis XVI, become King of France, Florestan’s uncle Joseph petitioned King Louis XVIII to restore the Principality of Monaco to the Grimaldi family. Florestan’s father Honoré IV finally became Sovereign Prince of Monaco in 1814. The independence of Monaco lasted for only one year. In 1815, the Congress of Vienna, an international diplomatic conference that reconstituted the European political order after the downfall of Napoleon I, declared that Monaco would be a protectorate of the Kingdom of Sardinia.\n\nBy the time Honoré IV became the Sovereign Prince of Monaco, his physical condition had worsened and he was now paralyzed on one side of his body. Because of his condition, a regency was established to rule in his name. Honoré IV’s brother Joseph was regent from 1814 -1815 and then Florestan’s brother Honoré V served as regent until his father’s death in 1819 when he succeeded him as Honoré V, Prince of Monaco.\n\nHonoré IV, Prince of Monaco died in Paris, France on February 16, 1819, aged 60. He was buried at the Church of Saint Nicholas in Monaco. During the late 19th century, a new and larger church, the Cathedral of Monaco, was built on the site of the Church of Saint Nicholas. The original church was demolished in 1874 but the current cathedral was built over the areas of the previous church and the old burial site so that the sovereign princes and consorts originally buried at the Church of Saint Nicholas are now buried in the Cathedral of Monaco.\n\nThis article is the intellectual property of Unofficial Royalty and is NOT TO BE COPIED, EDITED, OR POSTED IN ANY FORM ON ANOTHER WEBSITE under any circumstances. It is permissible to use a link that directs to Unofficial Royalty.\n\nWorks Cited\n\nEdwards, Anne, 2017. The Grimaldis of Monaco . Blue Ridge Summit: Lyons Press.\n\n. Blue Ridge Summit: Lyons Press. En.wikipedia.org. 2022. Honoré IV, Prince of Monaco – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022]. En.wikipedia.org. 2022. Louise d’Aumont – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Honoré III, Prince of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Maria Caterina Brignole, Princess of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Honoré IV (prince de Monaco) — Wikipédia . [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022].\n\n. [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Louise d’Aumont — Wikipédia. [online] Available at: <https://fr.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]."}, {"url": "https://geneee.org/honore/von+monaco/2?lang=en", "page_content": "Support Geneee, become part of the community!\n\nGenealogy is always work over generations. Many helping hands have gathered extensive information, and Geneee provides the necessary technical infrastructure.\n\nWith your help, we can do that in the future too. Help us, be part of the community and support us with your donation. Every contribution counts.\n\nSupport now! Later\n\nThis notice will be hidden for a period of 30 days upon receipt of a donation."}, {"url": "https://www.genealogieonline.nl/en/rois-europe/I31438.php", "page_content": "search for your ancestors and publish your family tree\n\nRois Europe Honoré IV de Monaco (1758-1819)\n\nDo you have supplementary information, corrections or questions with regards to Honoré IV de Monaco?\n\nThe author of this publication would love to hear from you!\n\nSources\n\n\n\n\n\nTimeline Honoré IV de Monaco\n\nThis functionality is only available in Javascript supporting browsers.\n\nClick on the names for more info. Symbols used: grandparents parents brothers/sisters children Symbols used:grandparentsparentsbrothers/sisterschildren\n\nAbout the surname De Monaco View the information that Genealogie Online has about the surname De Monaco.\n\nhas about the surname De Monaco. Check the information Open Archives has about De Monaco.\n\nhas about De Monaco. Check the Wie (onder)zoekt wie? register to see who is (re)searching De Monaco.\n\nHistorical events\n\n\n\nThe temperature on May 17, 1758 was about 15.0 °C. Wind direction mainly east-northeast. Weather type: helder. Source: KNMI\n\nErfstadhouder Prins Willem V (Willem Batavus) (Huis van Oranje-Nassau) was from 1751 till 1795 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden)\n\nErfstadhouder Prins Willem V (Willem Batavus) (Huis van Oranje-Nassau) was from 1751 till 1795 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden) Regentes Anna (Huis van Oranje-Nassau) was from 1751 till 1759 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden)\n\nIn the year 1758: Source: Wikipedia January 24 » During the Seven Years' War the leading burghers of Königsberg submit to Elizabeth of Russia, thus forming Russian Prussia (until 1763). February 4 » The city of Macapá in Brazil is founded by Sebastião Veiga Cabral. July 26 » French and Indian War: The Siege of Louisbourg ends with British forces defeating the French and taking control of the Gulf of Saint Lawrence. August 29 » The Treaty of Easton establishes the first American Indian reservation, at Indian Mills, New Jersey, for the Lenape. October 14 » Seven Years' War: Frederick the Great suffers a rare defeat at the Battle of Hochkirch. December 13 » The English transport ship Duke William sinks in the North Atlantic, killing over 360 people.\n\nTip: herlaad deze pagina voor een nieuwe selectie van gebeurtenissen vanuit Wikipedia.\n\nThe temperature on July 15, 1777 was about 19.0 °C. Wind direction mainly west-northwest. Weather type: zeer betrokken. Source: KNMI\n\nErfstadhouder Prins Willem V (Willem Batavus) (Huis van Oranje-Nassau) was from 1751 till 1795 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden)\n\nErfstadhouder Prins Willem V (Willem Batavus) (Huis van Oranje-Nassau) was from 1751 till 1795 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden) In the year 1777: Source: Wikipedia July 7 » American forces retreating from Fort Ticonderoga are defeated in the Battle of Hubbardton. August 6 » American Revolutionary War: The bloody Battle of Oriskany prevents American relief of the Siege of Fort Stanwix. September 19 » American Revolutionary War: British forces win a tactically expensive victory over the Continental Army in the First Battle of Saratoga. September 26 » American Revolution: British troops occupy Philadelphia. November 15 » American Revolutionary War: After 16 months of debate the Continental Congress approves the Articles of Confederation. December 16 » Virginia becomes the first state to ratify the Articles of Confederation. [1]\n\nTip: herlaad deze pagina voor een nieuwe selectie van gebeurtenissen vanuit Wikipedia.\n\nThe temperature on February 16, 1819 was about 5.0 °C. Wind direction mainly south east. Weather type: betrokken. Source: KNMI\n\nThis page is only available in Dutch. This page is only available in Dutch. Republiek der Verenigde Nederlanden werd in 1794-1795 door de Fransen veroverd onder leiding van bevelhebber Charles Pichegru (geholpen door de Nederlander Herman Willem Daendels); de verovering werd vergemakkelijkt door het dichtvriezen van de Waterlinie; Willem V moest op 18 januari 1795 uitwijken naar Engeland (en van daaruit in 1801 naar Duitsland); de patriotten namen de macht over van de aristocratische regenten en proclameerden de Bataafsche Republiek; op 16 mei 1795 werd het Haags Verdrag gesloten, waarmee ons land een vazalstaat werd van Frankrijk; in 3.1796 kwam er een Nationale Vergadering; in 1798 pleegde Daendels een staatsgreep, die de unitarissen aan de macht bracht; er kwam een nieuwe grondwet, die een Vertegenwoordigend Lichaam (met een Eerste en Tweede Kamer) instelde en als regering een Directoire; in 1799 sloeg Daendels bij Castricum een Brits-Russische invasie af; in 1801 kwam er een nieuwe grondwet; bij de Vrede van Amiens (1802) kreeg ons land van Engeland zijn koloniën terug (behalve Ceylon); na de grondwetswijziging van 1805 kwam er een raadpensionaris als eenhoofdig gezag, namelijk Rutger Jan Schimmelpenninck (van 31 oktober 1761 tot 25 maart 1825).\n\nRepubliek der Verenigde Nederlanden werd in 1794-1795 door de Fransen veroverd onder leiding van bevelhebber Charles Pichegru (geholpen door de Nederlander Herman Willem Daendels); de verovering werd vergemakkelijkt door het dichtvriezen van de Waterlinie; Willem V moest op 18 januari 1795 uitwijken naar Engeland (en van daaruit in 1801 naar Duitsland); de patriotten namen de macht over van de aristocratische regenten en proclameerden de Bataafsche Republiek; op 16 mei 1795 werd het Haags Verdrag gesloten, waarmee ons land een vazalstaat werd van Frankrijk; in 3.1796 kwam er een Nationale Vergadering; in 1798 pleegde Daendels een staatsgreep, die de unitarissen aan de macht bracht; er kwam een nieuwe grondwet, die een Vertegenwoordigend Lichaam (met een Eerste en Tweede Kamer) instelde en als regering een Directoire; in 1799 sloeg Daendels bij Castricum een Brits-Russische invasie af; in 1801 kwam er een nieuwe grondwet; bij de Vrede van Amiens (1802) kreeg ons land van Engeland zijn koloniën terug (behalve Ceylon); na de grondwetswijziging van 1805 kwam er een raadpensionaris als eenhoofdig gezag, namelijk Rutger Jan Schimmelpenninck (van 31 oktober 1761 tot 25 maart 1825). In the year 1819: Source: Wikipedia February 17 » The United States House of Representatives passes the Missouri Compromise for the first time. May 22 » SSSavannah leaves port at Savannah, Georgia, United States, on a voyage to become the first steamship to cross the Atlantic Ocean. July 1 » Johann Georg Tralles discovers the Great Comet of 1819, (C/1819 N1). It was the first comet analyzed using polarimetry, by François Arago. August 6 » Norwich University is founded in Vermont as the first private military school in the United States. August 16 » Peterloo Massacre: Seventeen people die and over 600 are injured in cavalry charges at a public meeting at St. Peter's Field, Manchester, England. December 17 » Simón Bolívar declares the independence of Gran Colombia in Angostura (now Ciudad Bolívar in Venezuela).\n\nTip: herlaad deze pagina voor een nieuwe selectie van gebeurtenissen vanuit Wikipedia.\n\n\n\nGo to person ? With Quick Search you can search by name, first name followed by a last name. You type in a few letters (at least 3) and a list of personal names within this publication will immediately appear. The more characters you enter the more specific the results. Click on a person's name to go to that person's page. You can enter text in lowercase or uppercase.\n\nIf you are not sure about the first name or exact spelling, you can use an asterisk (*). Example: \"*ornelis de b*r\" finds both \"cornelis de boer\" and \"kornelis de buur\".\n\nIt is not possible to enter charachters outside the standard alphabet (so no diacritic characters like ö and é). Close\n\ncontact the author) The publication Rois Europe has been compiled by Michel Schmiliver contact the author) . When copying data from this family tree, please include a reference to the origin:\n\nMichel Schmiliver, \"Rois Europe\", database, Genealogy Online ( https://www.genealogieonline.nl/rois-europe/I31438.php : accessed June 9, 2023), \"Honoré IV de Monaco (1758-1819)\".\n\nCapture this web page as it appears now in the Internet Archive Wayback Machine for use as a trusted citation in the future.\n\n﻿ Do not miss out new genealogical publications! Enter your e-mail address and you will receive the monthly, free Genealogy Online newsletter (in English) with new pedigrees and news and tips on the largest genealogy website in the Netherlands and Belgium.\n\n\n\nKeep me informed! × Copy warning Genealogical publications are copyright protected. Although data is often retrieved from public archives, the searching, interpreting, collecting, selecting and sorting of the data results in a unique product. Copyright protected work may not simply be copied or republished. Please stick to the following rules Request permission to copy data or at least inform the author, chances are that the author gives permission, often the contact also leads to more exchange of data.\n\nDo not use this data until you have checked it, preferably at the source (the archives).\n\nState from whom you have copied the data and ideally also his/her original source.\n\nDo not show this message again When copying data from this family tree, please include a reference to the origin:\n\nMichel Schmiliver, \"Rois Europe\", database, Genealogy Online ( https://www.genealogieonline.nl/rois-europe/I31438.php : accessed June 9, 2023), \"Honoré IV de Monaco (1758-1819)\".\n\nCapture this web page as it appears now in the Internet Archive Wayback Machine for use as a trusted citation in the future.\n\n﻿"}, {"url": "https://www.genealogieonline.nl/en/familiekring-koppenol-van-starkenburg/I66098.php", "page_content": "search for your ancestors and publish your family tree\n\nDo you have supplementary information, corrections or questions with regards to Honoré IV.?\n\nThe author of this publication would love to hear from you!\n\n\n\n\n\nTimeline Honoré IV.\n\nThis functionality is only available in Javascript supporting browsers.\n\nClick on the names for more info. Symbols used: grandparents parents brothers/sisters children Symbols used:grandparentsparentsbrothers/sisterschildren\n\nAbout the surname IV. View the information that Genealogie Online has about the surname IV..\n\nhas about the surname IV.. Check the information Open Archives has about IV..\n\nhas about IV.. Check the Wie (onder)zoekt wie? register to see who is (re)searching IV..\n\n\n\nGo to person ? With Quick Search you can search by name, first name followed by a last name. You type in a few letters (at least 3) and a list of personal names within this publication will immediately appear. The more characters you enter the more specific the results. Click on a person's name to go to that person's page. You can enter text in lowercase or uppercase.\n\nIf you are not sure about the first name or exact spelling, you can use an asterisk (*). Example: \"*ornelis de b*r\" finds both \"cornelis de boer\" and \"kornelis de buur\".\n\nIt is not possible to enter charachters outside the standard alphabet (so no diacritic characters like ö and é). Close\n\ncontact the author) The publication Familiekring Koppenol-van Starkenburg has been compiled by Dirk Koppenol contact the author) . When copying data from this family tree, please include a reference to the origin:\n\nDirk Koppenol, \"Familiekring Koppenol-van Starkenburg\", database, Genealogy Online ( https://www.genealogieonline.nl/familiekring-koppenol-van-starkenburg/I66098.php : accessed June 9, 2023), \"Honoré IV. (1758-1819)\".\n\nCapture this web page as it appears now in the Internet Archive Wayback Machine for use as a trusted citation in the future.\n\n﻿ Do not miss out new genealogical publications! Enter your e-mail address and you will receive the monthly, free Genealogy Online newsletter (in English) with new pedigrees and news and tips on the largest genealogy website in the Netherlands and Belgium.\n\n\n\nKeep me informed! × Copy warning Genealogical publications are copyright protected. Although data is often retrieved from public archives, the searching, interpreting, collecting, selecting and sorting of the data results in a unique product. Copyright protected work may not simply be copied or republished. Please stick to the following rules Request permission to copy data or at least inform the author, chances are that the author gives permission, often the contact also leads to more exchange of data.\n\nDo not use this data until you have checked it, preferably at the source (the archives).\n\nState from whom you have copied the data and ideally also his/her original source.\n\nDo not show this message again When copying data from this family tree, please include a reference to the origin:\n\nDirk Koppenol, \"Familiekring Koppenol-van Starkenburg\", database, Genealogy Online ( https://www.genealogieonline.nl/familiekring-koppenol-van-starkenburg/I66098.php : accessed June 9, 2023), \"Honoré IV. (1758-1819)\".\n\nCapture this web page as it appears now in the Internet Archive Wayback Machine for use as a trusted citation in the future.\n\n﻿"}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-v-a-brilliant-officer-and-an-unlucky-sovereign/", "page_content": "The eldest son of Prince Honoré IV was so eager for power that he declared himself a ruler against the will of his father. Tough and authoritarian, accustomed to military discipline from his youth, he made important economic decisions alone but failed to make the country prosperous and failed to make its population rich and happy. In fairness, we note that the Prince sincerely did his best.\n\nMilitary service for France\n\nPrince Honoré-Gabriel, the eldest son of Prince Honoré IV of Monaco and Princess Louise Felicite Victoire d’Aumont, was born in Paris on May 14, 1778. He enlisted in a French cavalry regiment when he was 20 years old and worked his way up through the ranks by his own merits until he became an officer on the staff of Marshal Grouchy. He was an exemplary soldier and was cited for his bravery many times. Being wounded in the arm he couldn’t take part in the action at Austerlitz (1805) but did serve with great distinction at the battle of Jena (1806) with Marshal Murat’s cavalry corps. Marshal Grouchy recommended him for the star of the Legion of Honour, relating that the Prince had taken a handful of cavalry and forced the surrender of an entire enemy battalion.\n\nIn April 1814, Napoleon Bonaparte abdicated the throne and was sent into exile on the island of Elba. The restored King Louis XVIII of France himself then also restored the Grimaldis to their places in the French nobility. Therefore, after the restoration of 1814, Honoré-Gabriel was also named member of the House of Peers by King Louis XVIII. But many were afraid that Monegasque independence would not be secure or that the Principality might be annexed by the Kingdom of Piedmont-Sardinia. Thanks to Prince Talleyrand, however, a clause was inserted into the Treaty of Paris to put Monaco securely back in order and independent.\n\nReturn to Monaco and meeting with Napoleon\n\nHonoré IV was unable to return to Monaco because of his poor health and so appointed his brother Joseph to rule on his behalf. But Honoré-Gabriel didn’t like that idea and he protested fiercely about this and after some struggle he was himself appointed to govern Monaco.\n\nIn March, 1815 on his way to Monaco he met with his old commander Napoleon who was on his way to Paris to seize power at the start of the 100 days. “Where are you going?”, Napoleon asked. “Going home, to Monaco”, Honoré-Gabriel answered. “Me too, I’m going home, to the Tuileries,” Napoleon said. When Napoleon attempted to restore his empire during the 100 days Monaco was occupied by British troops and so the Grimaldis played no part in the affair.\n\nDifficult years of reign\n\nIn 1819, when his father passed away, Honoré-Gabriel became the Sovereign Prince of Monaco as Honoré V and inherited a Principality beset with problems. At the same time being both a member of the French Parliament and the Sovereign of Monaco, he picked up on the project of his grandfather to diversify economic resources and encouraged the installation of factories. The Great Powers of Europe had taken Monaco out of the French sphere of influence and made the Principality a protectorate of Piedmont-Sardinia. The government in Turin closed the tobacco plant that Honoré III had established and enforced a number of other changes that had left Monaco impoverished.\n\nHonoré V went to Turin to try to reason with the King of Piedmont-Sardinia but, although he was treated with great honour and respect, none of his grievances were addressed. Honoré V also had to raise taxes considerably which made him increasingly unpopular. His granting of a monopoly on flour caused a bread shortage but no one had the nerve to voice opposition to him. He also pushed opportunities for tourism. However, the lack of a market for local products, the omnipresence of the State and the lack of presence of the Sovereign created tensions, especially in Menton. The Sovereign ended up pacifying Menton before going forward with his effort to provide the Principality with amenities. By his own admission he “desired to do good” but “did not manage to”, despite his philanthropic ideals.\n\nWhen liberal movements began to oppose the counter revolutionary tide of post-Napoleonic Europe some in Monaco thought of joining in but Sardinian troops arrived to crush the potential rebellion in its infancy.\n\nUnjust dislike\n\nHistory has tended to record Prince Honoré V as a very unpopular and autocratic monarch, but, in reality he was quite progressive. He sincerely wished to help his people and had great sympathy for the poor. His reaction to seeing beggars on the streets was to form state-owned industries and put them to work. Some of the industries he set up included a lace factory and a hat factory. He also had them put to work on farm cooperatives as citrus orchards had long been a large part of the Monegasque economy. All of this has led some people to regard Prince Honoré V as a sort of socialist, though he probably would not have seen it that way.\n\nBut all efforts to save the economy did not make Monegasques appreciate their Prince. Honoré V of Monaco died on October 2, 1841 in Paris and remained in the history of the country as an authoritarian ruler who did not trust anyone, including family members, and made decisions alone. As he was not married and had no children the Monegasque throne passed to his poet-actor brother Florestan."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iii-one-of-the-longest-reigns-in-european-history-en/", "page_content": "Everybody knows that the reign of French King Louis XIV, ‘Le Roi Soleil’, was the longest in European history. Two British Queens — Elizabeth II who will celebrate 70 years on the throne in 2022 and her great-great-grandmother Victoria (who reigned for 63 years) also had lengthy reigns. But few know that the fifth prince of Monaco is also on the list of the longest-reigning European monarchs: after coming to the Monegasque throne in 1733 he reigned for nearly 60 years and so passed his ancestor Honoré, Lord of Monaco, who ruled for 58 years in the XVI century.\n\nAscension to the Throne at the age of 13\n\nHonoré Camille Léonor Grimaldi was born on November 10, 1720. He was the son of Louise-Hyppolite, and the grandson of Prince Antoine I, who both died in 1731. Honoré came to the throne just after turning 13 when his father, Prince Jacques I, abdicated. Prince Honoré III spent much of his time away on campaign with the Royal French Army fighting the English in the War of the Austrian Succession. Honoré III was wounded fighting in the French victory at Rocoux. Later, he earned the Cross of St Louis for his conduct and after the Peace of Aix-la-Chapelle in 1748 he was given the rank of Marshal of France.\n\nWhat is interesting is that despite the heroic service of Honoré III in the wars, the Principality of Monaco was neutral in the conflict and, administered by the Chevalier de Grimaldi, assisted both French and English ships in need of help. The Austrians and Sardinians did blockade the Monegasque coast for a time and much of the countryside was pillaged by Croat soldiers of the Austrian army but French forces later cleared the region of all invaders in 1748.\n\nThe Royal Marriage\n\nIn 1757 Honoré III married Maria Caterina di Brignole-Sale who was descended from the Doges of Genoa and called “the most beautiful woman in France”. They were a very proud family and the arrival of the bride-to-be in Monaco turned into a disaster as many of the bridal attendants were seasick and the future mother-in-law insisted that Honoré III come onboard to greet his fiancé and escort her ashore. However, as a monarch in his own right, Honoré III refused as it was considered a breach of protocol for a prince to go to meet someone rather than them being brought to meet him. A stand-off ensued and eventually the Genoese fleet sailed away and stopped farther up the coast before a compromise was negotiated by which the couple would meet in the middle of a bridge extended between ship and shore. Nonetheless, the two were married and in 1758 the future Prince Honoré IV was born followed by Prince Joseph some years later. In 1770, though, Honoré III and Princess Maria Caterina divorced, and she later married the Prince de Condé in 1798.\n\nIn 1767 the British Duke of York was sailing from Marseilles to Genoa when he was suddenly taken ill and had to put in at Monaco. Prince Honoré III quickly offered all the help he could and put his palace at the disposal of the Prince who died after 11 days in what has forever after been known as the York Room of the Princely Palace.\n\nIn the meantime Prince Honoré III did what he could to guide his little principality along, improving trade and the economy which was heavily dependent on growing citrus fruits such as lemons in those days. His reign also saw the establishment of the first printing press in Monaco and the first newspaper the ‘Courrier de Monaco’. Prince Honoré III did take the initiative in pushing for some reforms, the most major of which was the repeal of the law that the Sovereign Prince would receive the inheritance of anyone who died on his property. On August 18, 1770 Honoré saw the practice, which he viewed as barbaric, abolished.\n\nThe French Revolution, Arrest and Imprisonment\n\nAs France slipped increasingly rapidly towards revolution things in Monaco remained calm and peaceful until the fateful day of July 14, 1789; the date of the storming of the Bastille. The shock spread to Monaco where crowds embraced the Declaration of the Rights of Man, influenced by the rise of republicanism in France as well as some newly introduced nostalgia for the Genoese Republic. Honoré III was concerned with the loss of his noble titles in France at the hands of the French National Constituent Assembly which was intent on abolishing all aristocratic privileges and soon he rushed to Paris to try to defend his titles there before the Constituent Assembly.\n\nHonoré III was extremely convincing when dealing with the French revolutionaries. His estates were, he insisted, not the gift of the King of France alone but payment for services rendered in the cause of French national glory. He struck just the right cord and the Assembly voted a generous pension for the Prince of Monaco in reparation for his confiscated properties.\n\nUnfortunately, before the order could be carried out, Danton came to power and the republic was declared. In all the turmoil France lost interest in Monaco and ultimately all Honoré was able to gain was recognition from the republican government of Monegasque neutrality. Unfortunately, that was a promise that would never be respected.\n\nThe French Republic declared their expansionist policy at the end of 1792. Monaco quickly fell victim to this policy and on January 13, 1793 Prince Honoré III was officially declared deposed by the Monegasque National Convention. Members of the Convention immediately filed a petition for accession to France. Some people in France however did protest on the grounds that Honoré III had always been a loyal friend and ally of the French, but republican hatred of monarchy prevailed and Monaco was absorbed into the French Republic and renamed Fort Hercules.\n\nAt the height of the Reign of Terror Honoré III was arrested as was his son, Honoré IV, who had been in Paris at the time and who would remain imprisoned for 15 months. Honoré III had suffered greatly from his own imprisonment and after his release had to stay in his house on the rue de Varennes as the Princely Palace in Monaco had been confiscated by the revolution though, thankfully, there was no ‘Reign of Terror’ or mass arrests and bloodshed in Monaco. Overcome with sadness, suffering, a number of ailments and the ravages of old age Prince Honoré III of Monaco died on March 21, 1795.\n\nIn 2020, the Principality paid a tribute to Prince Honoré III by having issued a 2€ commemorative coin celebrating the 300th anniversary of his birth. At the time of writing, the price of the coin, which was issued in 15,000 copies, has reached in the region of €300."}, {"url": "https://www.findagrave.com/memorial/7832651/honor%C3%A9_iv-of_monaco", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/grimaldi-family-the-legacy-of-prince-honore-v/", "page_content": "Prince Honoré-Gabriel was born in Paris on May 14, 1778, the eldest son of Prince Honoré IV of Monaco and Princess Louise Felicite Victoire d’Aumont, Duchesse de Mazarin et de La Meilleraye.\n\nHe enlisted in a French cavalry regiment when he was 20 years old and worked his way up through the ranks by his own merits until he became an officer on the staff of Marshal Grouchy. He was an exemplary soldier and was cited for his bravery many times. He was wounded in the arm at the great Napoleonic victory in the battle of Hohenlinden which prevented him from seeing action at Austerlitz.\n\nHe did serve with great distinction at the battles of Jena with Marshal Murat’s cavalry corps. Marshal Grouchy recommended him for the star of the Legion of Honor, relating that the Prince had taken a handful of cavalry and forced the surrender of an entire enemy battalion.\n\nWhen Napoleon was sent into exile the restored King Louis XVIII of France restored the Grimaldis to their places in the French nobility. Grandson of Honoré III and son of Honoré IV, Honoré V (1778-1841) was therefore too named, after the restoration of 1814, member of the House of Peers by king Louis XVIII. But many were afraid that Monegasque independence would not be or that they would be annexed by the Kingdom of Piedmont-Sardinia. Thanks to the Prince Talleyrand, however, a clause was inserted into the Treaty of Paris to put Monaco back in order. When Napoleon attempted to restore his empire during the 100 days Monaco was occupied by British troops and so the Grimaldis played no part in the affair.\n\nHonoré IV was unable to return to Monaco because of his poor health and so appointed his brother Joseph to rule on his behalf. But Honoré-Gabriel didn’t like that idea and he protested fiercely this and after some struggle he was himself appointed to govern Monaco.\n\nOn his way to Monaco he met with his old commander Napoleon as he was on his way to Paris to seize power at the start of the 100 days. Napoleon asked where he was going and Honoré-Gabriel said he was going home to Monaco. Napoleon said he was going home to the Tuileries, but as things unfolded he was not to remain there long.\n\nIn 1819, when his father passed away, Honoré-Gabriel became the Sovereign Prince of Monaco as Honoré V and inherited a Principality beset with problems. At once a member of the French Parliament and a Sovereign, he picked up on the project of his grandfather to diversify economic resources and encouraged the installation of factories. The Great Powers of Europe had taken Monaco out of the French sphere of influence and made the Principality a protectorate of Piedmont-Sardinia. The government in Turin closed the tobacco plant that Honoré III had established and enforced a number of other changes that left Monaco impoverished.\n\nHonoré V went to Turin to try to reason with the King but, although he was treated with great honor and respect, none of his grievances were addressed. Honoré V also had to raise taxes considerably which made him increasingly unpopular. His granting of a monopoly on flour caused a bread shortage but no one had the nerve to voice opposition to him. He also pushed opportunities for tourism. However, the lack of a market for local products, the omnipresence of the State and the lack of presence of the Sovereign created tensions, especially in Menton. The sovereign ended up pacifying Menton before going forward with his effort to provide the Principality with amenities. By his own admission he “desired to do good” but “did not manage to”, despite his philanthropic ideals.\n\nWhen liberal movements began to oppose the counter revolutionary tide of post-Napoleonic Europe some in Monaco thought of joining in but Sardinian troops arrived to crush the potential rebellion in its infancy.\n\nHistory has tended to record Prince Honoré V as a very unpopular and autocratic monarch, but, in reality he was quite progressive. He wished to help his people sincerely and had great sympathy for the poor. His reaction to seeing beggars on the streets was to form state-owned industries and put them to work. Some of the industries he set up included a lace factory and a hat factory. He also had them put to work on farm cooperatives as citrus orchards had long been a large part of the Monegasque economy. All of this has led some people to regard Prince Honoré V as a sort of socialist, though he probably would not have seen it that way.\n\nPrince Honore V died, unpopular and unappreciated on October 2, 1841 in Paris. As he was not married and had no children the Monegasque throne passed to his poet-actor brother who became Prince Florestan I of Monaco."}], "Honoré IV died on 3 October 1819.": [{"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iv-prisoner-of-the-french-revolution-2/", "page_content": "Prince Honoré IV was born on May 17, 1758 in Paris, to his parents Prince Honoré III and Princess Maria-Caterina de Brignole-Sale. This prince, perhaps, experienced more challenges in life than any other Grimaldi. Most of his hardships were caused by the French Revolution, and the last hours of his life are still shrouded in mystery …\n\nThe victims of the Great Terror\n\nPrince Honoré IV was unlucky enough to be living in Paris when the Reign of Terror broke out in France. As a nobleman and prince he was soon arrested and thrown into prison. The prince’s former wife, Duchess of Mazarin, was also taken into custody. Assisted by their family doctor, however, she managed to escape and hide with her youngest son Florestan.\n\nThe revolution did not spare the family of Prince’s Honore IV’s youngest brother, Joseph. His wife, Marie Thérèse de Choiseul, was arrested on suspicion of espionage and executed by guillotine. She was only 27, leaving behind three little daughters.\n\nAs for Prince Honoré, he was imprisoned for one and a half years. This time in prison greatly undermined his health, and he never fully recovered from it afterwards. On March 21, 1795 his father died and Honoré IV ascended the throne of Monaco. At that time the monarchy had just been banned and Monaco was once again annexed to the French Republic under the name of Port Hercule.\n\nEven after Prince Honoré was released from prison, it took another seven years of negotiations before the French regime restored some of Honoré IV’s and his brother Prince Joseph’s income. The future started to look brighter for the Grimaldi’s once the radical revolutionary regime was followed by the French consulate and, finally, by the First French Empire of Napoleon Bonaparte.\n\nReturn to the throne\n\nWhen the Napoleonic Wars finally came to an end, the status of Monaco was restored by the Congress of Vienna (1814–1815) thanks to the efforts of Prince Talleyrand. On May 30, 1814 Honoré IV was officially named the Principality’s ruler. However, he was too ill to take control of his country. So it was his brother Prince Joseph who became regent.\n\nThe Prince’s eldest son, 36-year-old Honoré Gabriel, however, was not happy about this decision. A brilliant soldier, he entered the cavalry service at the age of 20 and prospered in the army of the Empire Marshal, Emmanuel de Grouchy. Since Prince Joseph was not particularly eager to deal with the Principality’s affairs, preferring his life in the capital, he easily facilitated handing over the reins to his nephew, Honoré Gabriel, who ruled Monaco up until the death of Honoré IV (later becoming Prince Honoré V). As for Honoré IV, he lived in Paris until his very death which remains mysterious to this day…\n\nAccident or murder ..?\n\nOn a winter’s day of February 16, 1819, Honoré IV drowned in the Seine river. The death of the Monaco prince looked like a typical accident. That’s what the investigation concluded as an official version. It must not be forgotten, however, that Honoré IV was not a very healthy person, to say the least. This is the reason why he was not only unwilling, but was also physically unfit to rule the country. Imprisonment and numerous personal tragedies had taken their toll on the Prince, making him, for all intents and purposes, disabled. This is what the scanty preserved data suggests. A legitimate question arises: how could a 60-year-old monarch, in deplorable physical state, manage to cover such a considerable distance away from home (Avenue Denfert-Rochereau) to the Seine river bank..?\n\nWas it really an accident? Or rather a premeditated murder? Or could it be that the Prince decided to put an end to his own unhappy life? Being a depressed person, did he step into the Seine himself..? The answer remains a mystery.\n\nThe main legacy of Prince Honore IV\n\nAs Prince of Monaco, Honoré IV suffered three arrests and never actually ruled Monaco. He spent part of his life in a prison cell and the rest, trying to improve his health. Needless to say, there are very few mentions of the Prince, even in the archives of Monaco. His most important contribution to the history of Monaco was the birth of his two sons — the future princes, Honoré V and Florestan I, who consistently ruled the Principality and left their mark on the state’s history."}, {"url": "https://royalty.miraheze.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "Honoré IV, Prince of Monaco (Honoré Charles Anne; 17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 1814 to 16 February 1819. Because of his health, the state of affairs was managed by a regency of his brother Joseph Grimaldi, and his eldest son Prince Honoré V.\n\n\n\n\n\n\n\n\n\n\n\n\n\nIssue [ edit ]\n\n\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://geneee.org/honore/von+monaco/2?lang=en", "page_content": "Support Geneee, become part of the community!\n\nGenealogy is always work over generations. Many helping hands have gathered extensive information, and Geneee provides the necessary technical infrastructure.\n\nWith your help, we can do that in the future too. Help us, be part of the community and support us with your donation. Every contribution counts.\n\nSupport now! Later\n\nThis notice will be hidden for a period of 30 days upon receipt of a donation."}, {"url": "https://www.unofficialroyalty.com/honore-iv-prince-of-monaco/", "page_content": "by Susan Flantzer\n\n© Unofficial Royalty 2022\n\nHonoré Charles Anne Grimaldi was born in Paris, France on May 17, 1758. He was the elder of the two sons of Honoré III, Prince of Monaco and Maria Caterina Brignole who came from a Republic of Genoa (now in Italy) noble family. Honoré’s paternal grandparents were Louise-Hippolyte, Sovereign Princess of Monaco for ten months before her death from smallpox, and Jacques I, briefly the Sovereign Prince of Monaco, born Jacques François Leonor Goyon de Matignon. His maternal grandparents were Giuseppe Brignole, Marquis di Groppoli, the Ambassador to France from the Republic of Genoa, now in Italy, and Maria Anna Balbi.\n\nHonoré IV had one younger brother:\n\nPrince Joseph of Monaco, Regent of Monaco (1763 – 1816), married (1) Marie Thérèse de Choiseul, had three children, Marie Thérèse was guillotined during the French Revolution (2) Frances Margaret Powell, no children\n\nHonoré IV’s parents had issues with their marriage. Honoré III and Maria Caterina initially lived in Monaco but by 1760, Honoré III was dissatisfied with his life there, and returned to France without his wife, spending time with his mistresses at his French homes. Eventually, Maria Caterina was allowed to come to France. However, Honoré III continued his affairs and Maria Caterina began an affair, that would become long-term, with Louis Joseph de Bourbon, Prince of Condé. In 1770, Louis Joseph used his influence to obtain a legal separation for Maria Caterina from Honoré III and the right to manage her own finances. Honoré III finally realized his relationship with Maria Caterina was over and eventually accepted Maria Caterina’s relationship with Louis Joseph de Bourbon, Prince of Condé. Three years after Honoré III’s death in 1798, Maria Caterina and Louis Joseph were married but their marriage was kept secret for ten years.\n\nHonoré IV and his brother Joseph grew up mostly in France, living in homes inherited from their paternal grandfather Jacques III Goyon de Matignon, Count of Thorigny: a Paris mansion, the Hôtel de Matignon, now the official residence of the Prime Minister of France, and the Château des Matignon (link in French) in Torigni-sur-Vire in Normandy, France. In 1641, during the reign of Honoré II, Monaco had become a French protectorate, and the Princes of Monaco became vassals of the Kings of France while remaining sovereign princes. Many successive Princes of Monaco and their families spent most of their lives in France and intermarried with French and Italian noble families.\n\nHonoré III arranged a marriage for his son Honoré (IV) to Louise d’Aumont, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the only child of Louis Marie Guy d’Aumont de Rochebaron, Duke of Aumont (1732 – 1799) and Louise-Jeanne de Durfort, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye (1735 – 1781). Through her mother, Louise was the great-great-great-granddaughter of Hortense Mancini, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the mistress of King Charles II of England, and one of the two heirs of her uncle Cardinal Jules Mazarin, the First Minister of King Louis XIV of France. Louise was the heir of Hortense Mancini’s titles and the Mazarin family wealth. Therefore, a marriage to Louise came with a large dowry and the prospect of a fortune. Honoré (IV) and Louise married on July 15, 1777.\n\nThe marriage did produce two sons, both Sovereign Princes of Monaco:\n\nThe French Revolution had dire consequences for the Grimaldi family. In January 1793, Honoré III, Prince of Monaco was officially declared deposed and the Principality of Monaco was annexed by France. The members of the former ruling Grimaldi dynasty lost all aristocratic privileges in France, were dispossessed of their French property, and became French citizens. During the Reign of Terror, in September 1793, Honoré (IV), his wife Louise, their son Florestan, and Honoré (IV)’s father Honoré III were arrested and imprisoned in Paris as enemies of the people. Louise and her son Florestan were rescued by a family doctor who forged release papers and then hid them in his home until the Reign of Terror was over. The wife of Honoré IV’s brother Joseph was not as lucky. Joseph spent most of his time abroad negotiating foreign loans which made him a suspect of counter-revolutionary activities. When Joseph did become involved in a counter-revolution, his wife Marie Thérèse was arrested in the absence of her husband, condemned to death, and guillotined in 1794, one of the last victims before the end of the Reign of Terror.\n\nIn October 1794, Honoré III and Honoré (IV) were released from prison. Honoré III never recovered from his imprisonment and died in Paris on March 21, 1795, at the age of 74, but his burial place is unknown. Honoré IV, whose chronic ill health had been worsened by imprisonment, would have become Prince of Monaco but Monaco was no longer a sovereign monarchy. However, Honoré IV’s family properties in France were returned to him but they were in poor condition and all of the contents were gone.\n\nIn 1794, while Honoré IV was still in prison, Louise had given birth to an illegitimate daughter Amélie Céleste Erodore d’Aumont. The father of the child is believed to have been Antoine de Montazet, Archbishop of Lyon. After Honoré IV’s release from prison, Louise and Honoré IV’s marriage became unhappy and the couple separated. In 1798, Louise divorced Honoré IV, giving Louise sole access to her fortune.\n\nIn 1804, Napoleon crowned himself Emperor of the French. Honoré IV could not adapt to the new French society and for the most part, remained an outsider. Because of a lack of funds, he needed to sell his family’s Paris and Normandy homes. Surprisingly, Honoré IV’s health improved and he joined the French Army. He was wounded during Napoleon’s Russian Campaign, lost the use of one arm, and was sent back to Paris.\n\nAfter Napoleon’s defeat in 1814 and the Bourbon Restoration which saw Louis XVIII, a younger brother of the beheaded King Louis XVI, become King of France, Florestan’s uncle Joseph petitioned King Louis XVIII to restore the Principality of Monaco to the Grimaldi family. Florestan’s father Honoré IV finally became Sovereign Prince of Monaco in 1814. The independence of Monaco lasted for only one year. In 1815, the Congress of Vienna, an international diplomatic conference that reconstituted the European political order after the downfall of Napoleon I, declared that Monaco would be a protectorate of the Kingdom of Sardinia.\n\nBy the time Honoré IV became the Sovereign Prince of Monaco, his physical condition had worsened and he was now paralyzed on one side of his body. Because of his condition, a regency was established to rule in his name. Honoré IV’s brother Joseph was regent from 1814 -1815 and then Florestan’s brother Honoré V served as regent until his father’s death in 1819 when he succeeded him as Honoré V, Prince of Monaco.\n\nHonoré IV, Prince of Monaco died in Paris, France on February 16, 1819, aged 60. He was buried at the Church of Saint Nicholas in Monaco. During the late 19th century, a new and larger church, the Cathedral of Monaco, was built on the site of the Church of Saint Nicholas. The original church was demolished in 1874 but the current cathedral was built over the areas of the previous church and the old burial site so that the sovereign princes and consorts originally buried at the Church of Saint Nicholas are now buried in the Cathedral of Monaco.\n\nThis article is the intellectual property of Unofficial Royalty and is NOT TO BE COPIED, EDITED, OR POSTED IN ANY FORM ON ANOTHER WEBSITE under any circumstances. It is permissible to use a link that directs to Unofficial Royalty.\n\nWorks Cited\n\nEdwards, Anne, 2017. The Grimaldis of Monaco . Blue Ridge Summit: Lyons Press.\n\n. Blue Ridge Summit: Lyons Press. En.wikipedia.org. 2022. Honoré IV, Prince of Monaco – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022]. En.wikipedia.org. 2022. Louise d’Aumont – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Honoré III, Prince of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Maria Caterina Brignole, Princess of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Honoré IV (prince de Monaco) — Wikipédia . [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022].\n\n. [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Louise d’Aumont — Wikipédia. [online] Available at: <https://fr.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]."}, {"url": "https://peoplepill.com/people/honore-iv-prince-of-monaco/", "page_content": "Honoré IV (17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 12 March 1795 to 16 February 1819. He was the son of Prince Honoré III by his wife, Maria Caterina Brignole, a Genoese noblewoman. After the fall of Napoleon I, he regained control of the principality thanks to a clause added by Charles Maurice de Talleyrand-Périgord at the Congress of Vienna stating that, \"the Prince of Monaco should return to his estates\", and passed on his titles to his eldest son, Honoré V, Prince of Monaco.\n\nHonoré IV married Louise Félicité Victoire d'Aumont, Duchess of Aumont, Duchess Mazarin and of La Meilleraye on 15 July 1777 in Paris. They divorced in 1798. They had two sons:\n\nHonoré V, Prince of Monaco (1778–1841)\n\nFlorestan I, Prince of Monaco (1785–1856)\n\nDuring the French occupation of Monaco, Honoré IV was imprisoned for several years. Illnesses resulting from this imprisonment incapacitated Honoré IV in his later years, and following the re-establishment of the Principality a regency was established to rule in Honoré's name.\n\nAncestry\n\nAncestors of Honoré IV, Prince of Monaco 16. François Goyon de Matignon 8. Jacques III Goyon de Matignon 17. Anne Malon de Bercy 4. Jacques Goyon de Matignon, Prince of Monaco 18. Henri Goyon de Matignon, Count of Thorigny 9. Charlotte Goyon de Matignon, Countess of Thorigny 19. Marie Francoise Le Tellier, Lady of Luthumière 2. Honoré III Grimaldi, Prince of Monaco 20. Louis Grimaldi, Prince of Monaco 10. Antonio Grimaldi, Prince of Monaco 21. Catherine Charlotte de Gramont 5. Louise Hippolyte Grimaldi, Princess of Monaco 22. Louis of Lorraine, Count of Armagnac 11. Marie of Lorraine 23. Catherine de Neufville de Villeroy 1. Honoré IV, Prince of Monaco 24. Giovanni Francesco Brignole Sale, 4th Marquis of Groppoli 12. Anton Giulio Brignole Sale, 5th Marquis of Groppoli 25. Maria Anna Durazzo 6. Giuseppe Brignole Sale, 7th Marquis of Groppoli 26. Giovanni Giacomo Brignole Sale 13. Isabella Brignole Sale 27. Lucrezia Pallavicini 3. Maria Caterina Brignole Sale 28. Giacomo Balbi 14. Francesco Maria Balbi, Doge of Genoa 29. Olimpia Pinelli 7. Maria Anna Balbi 30. Giovanni Agostino Durazzo 15. Maria Clarice Durazzo 31. Maddalena Spinola\n\n\n\n"}, {"url": "https://www.genealogieonline.nl/en/rois-europe/I31438.php", "page_content": "search for your ancestors and publish your family tree\n\nRois Europe Honoré IV de Monaco (1758-1819)\n\nDo you have supplementary information, corrections or questions with regards to Honoré IV de Monaco?\n\nThe author of this publication would love to hear from you!\n\nSources\n\n\n\n\n\nTimeline Honoré IV de Monaco\n\nThis functionality is only available in Javascript supporting browsers.\n\nClick on the names for more info. Symbols used: grandparents parents brothers/sisters children Symbols used:grandparentsparentsbrothers/sisterschildren\n\nAbout the surname De Monaco View the information that Genealogie Online has about the surname De Monaco.\n\nhas about the surname De Monaco. Check the information Open Archives has about De Monaco.\n\nhas about De Monaco. Check the Wie (onder)zoekt wie? register to see who is (re)searching De Monaco.\n\nHistorical events\n\n\n\nThe temperature on May 17, 1758 was about 15.0 °C. Wind direction mainly east-northeast. Weather type: helder. Source: KNMI\n\nErfstadhouder Prins Willem V (Willem Batavus) (Huis van Oranje-Nassau) was from 1751 till 1795 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden)\n\nErfstadhouder Prins Willem V (Willem Batavus) (Huis van Oranje-Nassau) was from 1751 till 1795 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden) Regentes Anna (Huis van Oranje-Nassau) was from 1751 till 1759 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden)\n\nIn the year 1758: Source: Wikipedia January 24 » During the Seven Years' War the leading burghers of Königsberg submit to Elizabeth of Russia, thus forming Russian Prussia (until 1763). July 26 » French and Indian War: The Siege of Louisbourg ends with British forces defeating the French and taking control of the Gulf of Saint Lawrence. August 25 » Seven Years' War: Frederick II of Prussia defeats the Russian army at the Battle of Zorndorf. October 14 » Seven Years' War: Frederick the Great suffers a rare defeat at the Battle of Hochkirch. November 25 » French and Indian War: British forces capture Fort Duquesne from French control. Later, Fort Pitt will be built nearby and grow into modern Pittsburgh. December 13 » The English transport ship Duke William sinks in the North Atlantic, killing over 360 people.\n\nTip: herlaad deze pagina voor een nieuwe selectie van gebeurtenissen vanuit Wikipedia.\n\nThe temperature on July 15, 1777 was about 19.0 °C. Wind direction mainly west-northwest. Weather type: zeer betrokken. Source: KNMI\n\nErfstadhouder Prins Willem V (Willem Batavus) (Huis van Oranje-Nassau) was from 1751 till 1795 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden)\n\nErfstadhouder Prins Willem V (Willem Batavus) (Huis van Oranje-Nassau) was from 1751 till 1795 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden) In the year 1777: Source: Wikipedia June 14 » The Second Continental Congress passes the Flag Act of 1777 adopting the Stars and Stripes as the Flag of the United States. August 16 » American Revolutionary War: The Americans led by General John Stark rout British and Brunswick troops under Friedrich Baum at the Battle of Bennington in Walloomsac, New York. September 26 » American Revolution: British troops occupy Philadelphia. October 4 » American Revolutionary War: Troops under George Washington are repelled by British troops under William Howe. November 29 » San Jose, California, is founded as Pueblo de San José de Guadalupe by José Joaquín Moraga. It is the first civilian settlement, or pueblo, in Alta California. December 16 » Virginia becomes the first state to ratify the Articles of Confederation. [1]\n\nTip: herlaad deze pagina voor een nieuwe selectie van gebeurtenissen vanuit Wikipedia.\n\nThe temperature on February 16, 1819 was about 5.0 °C. Wind direction mainly south east. Weather type: betrokken. Source: KNMI\n\nThis page is only available in Dutch. This page is only available in Dutch. Republiek der Verenigde Nederlanden werd in 1794-1795 door de Fransen veroverd onder leiding van bevelhebber Charles Pichegru (geholpen door de Nederlander Herman Willem Daendels); de verovering werd vergemakkelijkt door het dichtvriezen van de Waterlinie; Willem V moest op 18 januari 1795 uitwijken naar Engeland (en van daaruit in 1801 naar Duitsland); de patriotten namen de macht over van de aristocratische regenten en proclameerden de Bataafsche Republiek; op 16 mei 1795 werd het Haags Verdrag gesloten, waarmee ons land een vazalstaat werd van Frankrijk; in 3.1796 kwam er een Nationale Vergadering; in 1798 pleegde Daendels een staatsgreep, die de unitarissen aan de macht bracht; er kwam een nieuwe grondwet, die een Vertegenwoordigend Lichaam (met een Eerste en Tweede Kamer) instelde en als regering een Directoire; in 1799 sloeg Daendels bij Castricum een Brits-Russische invasie af; in 1801 kwam er een nieuwe grondwet; bij de Vrede van Amiens (1802) kreeg ons land van Engeland zijn koloniën terug (behalve Ceylon); na de grondwetswijziging van 1805 kwam er een raadpensionaris als eenhoofdig gezag, namelijk Rutger Jan Schimmelpenninck (van 31 oktober 1761 tot 25 maart 1825).\n\nRepubliek der Verenigde Nederlanden werd in 1794-1795 door de Fransen veroverd onder leiding van bevelhebber Charles Pichegru (geholpen door de Nederlander Herman Willem Daendels); de verovering werd vergemakkelijkt door het dichtvriezen van de Waterlinie; Willem V moest op 18 januari 1795 uitwijken naar Engeland (en van daaruit in 1801 naar Duitsland); de patriotten namen de macht over van de aristocratische regenten en proclameerden de Bataafsche Republiek; op 16 mei 1795 werd het Haags Verdrag gesloten, waarmee ons land een vazalstaat werd van Frankrijk; in 3.1796 kwam er een Nationale Vergadering; in 1798 pleegde Daendels een staatsgreep, die de unitarissen aan de macht bracht; er kwam een nieuwe grondwet, die een Vertegenwoordigend Lichaam (met een Eerste en Tweede Kamer) instelde en als regering een Directoire; in 1799 sloeg Daendels bij Castricum een Brits-Russische invasie af; in 1801 kwam er een nieuwe grondwet; bij de Vrede van Amiens (1802) kreeg ons land van Engeland zijn koloniën terug (behalve Ceylon); na de grondwetswijziging van 1805 kwam er een raadpensionaris als eenhoofdig gezag, namelijk Rutger Jan Schimmelpenninck (van 31 oktober 1761 tot 25 maart 1825). In the year 1819: Source: Wikipedia February 19 » British explorer William Smith discovers the South Shetland Islands and claims them in the name of King George III. May 25 » The Argentine Constitution of 1819 is promulgated. June 16 » A major earthquake strikes the Kutch district of western India, killing over 1,543 people and raising a 6m high, 6km wide, ridge, extending for at least 80km, that was known as the Allah Bund (\"Dam of God\"). July 3 » The Bank for Savings in the City of New-York, the first savings bank in the United States, opens. August 6 » Norwich University is founded in Vermont as the first private military school in the United States. December 14 » Alabama becomes the 22nd U.S. state.\n\nTip: herlaad deze pagina voor een nieuwe selectie van gebeurtenissen vanuit Wikipedia.\n\n\n\nGo to person ? With Quick Search you can search by name, first name followed by a last name. You type in a few letters (at least 3) and a list of personal names within this publication will immediately appear. The more characters you enter the more specific the results. Click on a person's name to go to that person's page. You can enter text in lowercase or uppercase.\n\nIf you are not sure about the first name or exact spelling, you can use an asterisk (*). Example: \"*ornelis de b*r\" finds both \"cornelis de boer\" and \"kornelis de buur\".\n\nIt is not possible to enter charachters outside the standard alphabet (so no diacritic characters like ö and é). Close\n\ncontact the author) The publication Rois Europe has been compiled by Michel Schmiliver contact the author) . When copying data from this family tree, please include a reference to the origin:\n\nMichel Schmiliver, \"Rois Europe\", database, Genealogy Online ( https://www.genealogieonline.nl/rois-europe/I31438.php : accessed June 9, 2023), \"Honoré IV de Monaco (1758-1819)\".\n\nCapture this web page as it appears now in the Internet Archive Wayback Machine for use as a trusted citation in the future.\n\n﻿ Do not miss out new genealogical publications! Enter your e-mail address and you will receive the monthly, free Genealogy Online newsletter (in English) with new pedigrees and news and tips on the largest genealogy website in the Netherlands and Belgium.\n\n\n\nKeep me informed! × Copy warning Genealogical publications are copyright protected. Although data is often retrieved from public archives, the searching, interpreting, collecting, selecting and sorting of the data results in a unique product. Copyright protected work may not simply be copied or republished. Please stick to the following rules Request permission to copy data or at least inform the author, chances are that the author gives permission, often the contact also leads to more exchange of data.\n\nDo not use this data until you have checked it, preferably at the source (the archives).\n\nState from whom you have copied the data and ideally also his/her original source.\n\nDo not show this message again When copying data from this family tree, please include a reference to the origin:\n\nMichel Schmiliver, \"Rois Europe\", database, Genealogy Online ( https://www.genealogieonline.nl/rois-europe/I31438.php : accessed June 9, 2023), \"Honoré IV de Monaco (1758-1819)\".\n\nCapture this web page as it appears now in the Internet Archive Wayback Machine for use as a trusted citation in the future.\n\n﻿"}, {"url": "https://pantheon.world/profile/person/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "Honoré IV, Prince of Monaco\n\nHonoré IV (Honoré Charles Anne Grimaldi; 17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 1814 to 16 February 1819 . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Honoré IV, Prince of Monaco has received more than 162,372 page views. His biography is available in 23 different languages on Wikipedia (up from 20 in 2019) . Honoré IV, Prince of Monaco is the 5,788th most popular politician (down from 4,580th in 2019), the 1,731st most popular biography from France (down from 1,446th in 2019) and the 429th most popular French Politician."}, {"url": "https://www.findagrave.com/memorial/7832651/honor%C3%A9_iv-of_monaco", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://wiki2.org/en/Honor%C3%A9_IV", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nPrince of Monaco from 1814 to 1819\n\nHonoré IV (Honoré Charles Anne Grimaldi; 17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 1814 to 16 February 1819. Because of his health, the state of affairs was managed by a regency of his brother Joseph Grimaldi, and his son Prince Honoré V.\n\nYouTube Encyclopedic\n\n1 / 5 Views: 1 541 1 504 1 950 1 276 1 219\n\nHouse of Grimaldi\n\nNapoleonic Wars\n\nNapoléon à Bayonne (1808) Premier Empire\n\nVoltaire - Zadig ou la destinée (audio et texte français) Compilation\n\nDu contrat social - intégrale (audio et texte français) jacques rousseau Transcription\n\nLife\n\nHe was the son of Prince Honoré III and Maria Caterina Brignole.\n\nDuring the French occupation of Monaco, Honoré IV was imprisoned for several years. After the fall of Napoleon I in 1814, he regained control of the principality – thanks to a clause added by Charles Maurice de Talleyrand-Périgord at the Congress of Vienna stating, \"the Prince of Monaco should return to his estates\" – and passed on his titles to his eldest son, Prince Honoré V.\n\nIllnesses resulting from his imprisonment incapacitated Honoré IV in his later years, and following the re-establishment of the Principality in 1814, a regency was established to rule in Honoré's name. This regency was directed, first, by his brother Joseph Grimaldi, then from 1815 by his son, the Hereditary Prince Honoré, who succeeded him in 1819 as Sovereign Prince Honoré V.[1]\n\nFamily\n\nHonoré IV married Louise Félicité Victoire d'Aumont, Duchess of Aumont, Duchess Mazarin and of La Meilleraye on 15 July 1777 in Paris. They divorced in 1798. They had two sons:\n\nRoyal Monogram of Prince Honoré IV of Monaco\n\nAncestry\n\nReferences"}, {"url": "https://www.genealogieonline.nl/en/fermin-de-la-fuente-iii/P4720.php", "page_content": "search for your ancestors and publish your family tree\n\nFermin de la Fuente III, descendant from King Pelayo Balthes of Asturias Honore IV Grimaldi Monaco (1758-1819)\n\nDo you have supplementary information, corrections or questions with regards to Honore IV Grimaldi Monaco?\n\nThe author of this publication would love to hear from you!\n\n\n\n\n\nTimeline Honore IV Grimaldi Monaco\n\nThis functionality is only available in Javascript supporting browsers.\n\nClick on the names for more info. Symbols used: grandparents parents brothers/sisters children Symbols used:grandparentsparentsbrothers/sisterschildren\n\nHistorical events\n\n\n\nThe temperature on May 17, 1758 was about 15.0 °C. Wind direction mainly east-northeast. Weather type: helder. Source: KNMI\n\nErfstadhouder Prins Willem V (Willem Batavus) (Huis van Oranje-Nassau) was from 1751 till 1795 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden)\n\nErfstadhouder Prins Willem V (Willem Batavus) (Huis van Oranje-Nassau) was from 1751 till 1795 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden) Regentes Anna (Huis van Oranje-Nassau) was from 1751 till 1759 sovereign of the Netherlands (also known as Republiek der Zeven Verenigde Nederlanden)\n\nIn the year 1758: Source: Wikipedia April 28 » The Marathas defeat the Afghans in the Battle of Attock and capture the city. June 30 » Seven Years' War: Habsburg Austrian forces destroy a Prussian reinforcement and supply convoy in the Battle of Domstadtl, helping to expel Prussian King Frederick the Great from Moravia. July 26 » French and Indian War: The Siege of Louisbourg ends with British forces defeating the French and taking control of the Gulf of Saint Lawrence. August 25 » Seven Years' War: Frederick II of Prussia defeats the Russian army at the Battle of Zorndorf. August 29 » The Treaty of Easton establishes the first American Indian reservation, at Indian Mills, New Jersey, for the Lenape. October 14 » Seven Years' War: Frederick the Great suffers a rare defeat at the Battle of Hochkirch.\n\nTip: herlaad deze pagina voor een nieuwe selectie van gebeurtenissen vanuit Wikipedia.\n\nThe temperature on February 16, 1819 was about 5.0 °C. Wind direction mainly south east. Weather type: betrokken. Source: KNMI\n\nThis page is only available in Dutch. This page is only available in Dutch. Republiek der Verenigde Nederlanden werd in 1794-1795 door de Fransen veroverd onder leiding van bevelhebber Charles Pichegru (geholpen door de Nederlander Herman Willem Daendels); de verovering werd vergemakkelijkt door het dichtvriezen van de Waterlinie; Willem V moest op 18 januari 1795 uitwijken naar Engeland (en van daaruit in 1801 naar Duitsland); de patriotten namen de macht over van de aristocratische regenten en proclameerden de Bataafsche Republiek; op 16 mei 1795 werd het Haags Verdrag gesloten, waarmee ons land een vazalstaat werd van Frankrijk; in 3.1796 kwam er een Nationale Vergadering; in 1798 pleegde Daendels een staatsgreep, die de unitarissen aan de macht bracht; er kwam een nieuwe grondwet, die een Vertegenwoordigend Lichaam (met een Eerste en Tweede Kamer) instelde en als regering een Directoire; in 1799 sloeg Daendels bij Castricum een Brits-Russische invasie af; in 1801 kwam er een nieuwe grondwet; bij de Vrede van Amiens (1802) kreeg ons land van Engeland zijn koloniën terug (behalve Ceylon); na de grondwetswijziging van 1805 kwam er een raadpensionaris als eenhoofdig gezag, namelijk Rutger Jan Schimmelpenninck (van 31 oktober 1761 tot 25 maart 1825).\n\nRepubliek der Verenigde Nederlanden werd in 1794-1795 door de Fransen veroverd onder leiding van bevelhebber Charles Pichegru (geholpen door de Nederlander Herman Willem Daendels); de verovering werd vergemakkelijkt door het dichtvriezen van de Waterlinie; Willem V moest op 18 januari 1795 uitwijken naar Engeland (en van daaruit in 1801 naar Duitsland); de patriotten namen de macht over van de aristocratische regenten en proclameerden de Bataafsche Republiek; op 16 mei 1795 werd het Haags Verdrag gesloten, waarmee ons land een vazalstaat werd van Frankrijk; in 3.1796 kwam er een Nationale Vergadering; in 1798 pleegde Daendels een staatsgreep, die de unitarissen aan de macht bracht; er kwam een nieuwe grondwet, die een Vertegenwoordigend Lichaam (met een Eerste en Tweede Kamer) instelde en als regering een Directoire; in 1799 sloeg Daendels bij Castricum een Brits-Russische invasie af; in 1801 kwam er een nieuwe grondwet; bij de Vrede van Amiens (1802) kreeg ons land van Engeland zijn koloniën terug (behalve Ceylon); na de grondwetswijziging van 1805 kwam er een raadpensionaris als eenhoofdig gezag, namelijk Rutger Jan Schimmelpenninck (van 31 oktober 1761 tot 25 maart 1825). In the year 1819: Source: Wikipedia January 29 » Stamford Raffles lands on the island of Singapore. February 6 » Sir Thomas Stamford Raffles founds Singapore. February 17 » The United States House of Representatives passes the Missouri Compromise for the first time. February 19 » British explorer William Smith discovers the South Shetland Islands and claims them in the name of King George III. August 16 » Peterloo Massacre: Seventeen people die and over 600 are injured in cavalry charges at a public meeting at St. Peter's Field, Manchester, England. December 14 » Alabama becomes the 22nd U.S. state.\n\nTip: herlaad deze pagina voor een nieuwe selectie van gebeurtenissen vanuit Wikipedia.\n\n\n\nGo to person ? With Quick Search you can search by name, first name followed by a last name. You type in a few letters (at least 3) and a list of personal names within this publication will immediately appear. The more characters you enter the more specific the results. Click on a person's name to go to that person's page. You can enter text in lowercase or uppercase.\n\nIf you are not sure about the first name or exact spelling, you can use an asterisk (*). Example: \"*ornelis de b*r\" finds both \"cornelis de boer\" and \"kornelis de buur\".\n\nIt is not possible to enter charachters outside the standard alphabet (so no diacritic characters like ö and é). Close\n\ncontact the author) The publication Fermin de la Fuente III, descendant from King Pelayo Balthes of Asturias has been compiled by Fermin de la Fuente III contact the author) . When copying data from this family tree, please include a reference to the origin:\n\nFermin de la Fuente III, \"Fermin de la Fuente III, descendant from King Pelayo Balthes of Asturias\", database, Genealogy Online ( https://www.genealogieonline.nl/fermin-de-la-fuente-iii/P4720.php : accessed June 9, 2023), \"Honore IV Grimaldi Monaco (1758-1819)\".\n\nCapture this web page as it appears now in the Internet Archive Wayback Machine for use as a trusted citation in the future.\n\nDo not miss out new genealogical publications! Enter your e-mail address and you will receive the monthly, free Genealogy Online newsletter (in English) with new pedigrees and news and tips on the largest genealogy website in the Netherlands and Belgium.\n\n\n\nKeep me informed! × Copy warning Genealogical publications are copyright protected. Although data is often retrieved from public archives, the searching, interpreting, collecting, selecting and sorting of the data results in a unique product. Copyright protected work may not simply be copied or republished. Please stick to the following rules Request permission to copy data or at least inform the author, chances are that the author gives permission, often the contact also leads to more exchange of data.\n\nDo not use this data until you have checked it, preferably at the source (the archives).\n\nState from whom you have copied the data and ideally also his/her original source.\n\nDo not show this message again When copying data from this family tree, please include a reference to the origin:\n\nFermin de la Fuente III, \"Fermin de la Fuente III, descendant from King Pelayo Balthes of Asturias\", database, Genealogy Online ( https://www.genealogieonline.nl/fermin-de-la-fuente-iii/P4720.php : accessed June 9, 2023), \"Honore IV Grimaldi Monaco (1758-1819)\"."}], "Honoré IV was Catholic.": [{"url": "https://www.newadvent.org/cathen/07459a.htm", "page_content": "Pope Honorius IV\n\nPlease help support the mission of New Advent and get the full contents of this website as an instant download. Includes the Catholic Encyclopedia, Church Fathers, Summa, Bible and more \u0097 all for only $19.99...\n\n(Giacomo Savelli)\n\nBorn at Rome about 1210; died at Rome, 3 April, 1287. He belonged to the rich and influential family of the Savelli and was a grandnephew of Honorius III. Very little is known of his life before he ascended the papal throne. He studied at the University of Paris, during which time he held a prebend and a canonry at the cathedral of Châlons-sur-Marne. Later he obtained the benefice of rector at the church of Berton, in the Diocese of Norwich. In 1261 he was created Cardinal-Deacon of Santa Maria in Cosmedin by Martin IV, who also appointed him papal prefect in Tuscany and captain of the papal army. By order of Clement IV he and three other cardinals invested Charles of Anjou as King of Sicily at Rome on 28 July, 1265. He was one of the six cardinals who elected Gregory X by compromise at Viterbo on 1 Sept., 1271. In 1274 he accompanied Gregory X to the Fourteenth General Council at Lyons, and in July, 1276, he was one of the three cardinals whom Adrian V sent to Viterbo with instructions to treat with King Rudolf I of Hapsburg concerning his imperial coronation at Rome and his future relations towards Charles of Anjou, King of Sicily. The death of Adrian V in the following month rendered fruitless the negotiations with Rudolf. Nothing further is known of the cardinal's doings until, nine years later, he was elected pope.\n\nMartin IV died 28 March, 1285, at Perugia, and three days after his death fifteen out of the eighteen cardinals who then composed the Sacred College had a preliminary consultation at the episcopal residence at Perugia, and appointed the following day, 2 April, 1285, for the election of the new pope. The election took place without the conclave, which had been prescribed by Gregory X, but suspended by John XXI. At the first vote taken, Giacomo Savelli was unanimously elected and took the name of Honorius IV. His election was one of the speediest in the history of the papacy. The reason for this great haste may be found in the Sicilian complications, which did not allow any interregnum, and especially in the fact that the cardinals wished to avoid the unjustifiable interference which occurred at the election of the preceding pope, when Charles of Anjou induced the inhabitants of Viterbo to imprison two cousins of the deceased Nicholas III, in order to effect the election of a pope of French nationality. On 19 May, 1285, the new pontiff was ordained priest by Cardinal Malabranca Orsini of Ostia, and the following day he was consecrated bishop and crowned pope in the basilica of St. Peter at Rome. Honorius IV was already advanced in age and so severely affected with the gout that he could neither stand nor walk. When saying Mass he was obliged to sit on a stool and at the Elevation his hands had to be raised by a mechanical contrivance.\n\nSicilian affairs required the immediate attention of the pope. By throwing off the rule of Charles of Anjou and taking Pedro III of Aragon as their king without the consent and approval of the pope, the Sicilians had practically denied his suzerainty over Sicily. The awful massacre of 31 March, 1282, known as the Sicilian Vespers, had precluded every possibility of coming to an amicable understanding with Martin IV, a Frenchman who owed the tiara to Charles of Anjou. Pope Martin demanded unconditional submission to Charles of Anjou and the Apostolic See and, when this was refused, put Sicily and Pedro III under the ban, deprived Pedro of the Kingdom of Aragon, and gave it to Charles of Valois, the son of King Philip III of France. He, moreover, assisted Charles of Anjou in his attempts to recover Sicily by force of arms. The Sicilians not only repulsed the attacks of Charles of Anjou but also captured his son Charles of Salerno. On 6 January, 1285, Charles of Anjou died, leaving his captive son Charles of Salerno as his natural successor. Such were the conditions in Sicily when Honorius IV ascended the papal throne. The Sicilians cherished the hope that the new pontiff would take a different stand from that of his predecessor in the Sicilian question, but their hopes were only partly realized. He was indeed less impulsive and more peaceably inclined than Martin IV, but he did not renounce the claims of the Church and of the House of Anjou upon the Sicilian crown. Neither did he set aside the severe ecclesiastical punishments imposed upon Sicily or restore to Pedro III the Kingdom of Aragon which Martin IV had transferred to Charles of Valois. On the other hand, he did not approve of the tyrannical government to which the Sicilians had been subject under Charles of Anjou. This is evident from his wise legislation as embodied in his constitution of 17 September, 1285 (\"Constitutio super ordinatione regni Siciliae\" in \"Bullarium Romanum\", Turin, IV, 70-80). In this constitution he inculcates that no government can prosper which is not founded on justice and peace, and he passes forty-five ordinances intended chiefly to protect the people of Sicily against their king and his officials. In case of any violation of these ordinances by the king or his officials, the people were free to appeal to the Apostolic See for redress. The king, moreover, was bound to observe the ordinances contained in this constitution under pain of excommunication. Martin IV had allowed King Philip III of France to tax the clergy in France, and in a few dioceses of Germany, one-tenth of their revenues for the space of four years. The money thus collected was to be used for waging war against Pedro III with the purpose of conquering Aragon for Charles of Valois. Honorius IV approved this action of his predecessor. When Edward I of England requested him to use his influence to put an end to the war, he answered that Pedro III deserved to be punished and that Philip III should not be kept from reaping the fruits of a war which he had undertaken in the service and at the instance of the Church. The death of Pedro III on 11 November, 1285, somewhat changed the Sicilian situation. His two sons Alfonso and James succeeded him, the former as King of Aragon, the latter as King of Sicily. Honorius IV, of course, acknowledged neither the one nor the other. On 11 April, 1286, he solemnly excommunicated King James of Sicily and the bishops who had taken part in his coronation at Palermo on 2 February, 1286; but neither the king nor the bishops concerned themselves about the excommunication. The king even sent a hostile fleet to the Roman coast and destroyed the city of Astura by fire. Charles of Salerno, the lawful King of Sicily, who was still held captive by the Sicilians, finally grew tired of his long captivity and signed a contract on 27 February, 1287, in which he renounced his claims to the Kingdom of Sicily in favour of James of Aragon and his heirs. Honorius IV, however, who was asked for his approval, refused to listen to such an unprincipled act, which surrendered the rights of the Church and of the House of Anjou to refractory rebels. He declared the contract invalid and forbade all similar agreements for the future. While Honorius IV was inexorable in the stand he had taken towards Sicily and its self-imposed king, his relations towards Alfonso of Aragon became less hostile. Through the efforts of King Edward I of England, negotiations for peace were begun by Honorius IV and King Alfonso. The pope, however, did not live long enough to complete these negotiations, which finally resulted in a peaceful settlement of the Aragonese as well as the Sicilian question.\n\nRome and the States of the Church enjoyed a period of tranquillity during the pontificate of Honorius IV, the like of which they had not enjoyed for many years. He had the satisfaction of reducing the most powerful and obstinate enemy of papal authority, Count Guido of Montefeltro, who for many years had successfully resisted the papal troops. The authority of the pope was now recognized throughout the papal territory, which then comprised the Exarchate of Ravenna, the March of Ancona, the Duchy of Spoleto, the County of Bertinoro, the Mathildian lands, and the Pentapolis, viz. the cities of Rimini, Pesaro, Fano, Sinigaglia, and Ancona. The Romans were greatly elated at the election of Honorius IV, for he was a citizen of Rome and a brother of Pandulf, who had during the preceding summer been elected one of the two annual senators of Rome. The continuous disturbances in Rome during the pontificate of Martin V had not allowed that pope to reside in Rome, but now the Romans cordially invited Honorius IV to make Rome his permanent residence. During the first few months of his pontificate he lived in the Vatican, but in the autumn of 1285 he removed to the magnificent palace which he had just erected on the Aventine. With Northern Italy Honorius IV had few dealings beyond those that were of a purely ecclesiastical character. On 16 March, 1286, he removed the interdict which had been imprudently placed upon Venice by Martin IV because that city had refused to equip a fleet for the service of Charles of Anjou in his war against Pedro III of Aragon. At Florence and Bergamo he brought about the abolition of some newly-made laws that were hostile to the Church and the clergy.\n\nThe relations between Honorius IV and the German King Rudolf of Hapsburg were most cordial. The negotiations for Rudolf's imperial coronation which had been begun during the pontificate of Adrian V (1276) and continued during that of Nicholas III (1277-1280) were entirely suspended during the pontificate of Martin IV (1281-1285) who had little love for the Germans. Immediately upon the accession of Honorius IV these negotiations were resumed and the feast of the Purification of the Blessed Virgin, 2 February, 1287, was determined as the day on which Rudolf should be crowned emperor in the Basilica of St. Peter at Rome. The pope requested the German prelates to contribute a share of their revenues to cover the expenses of his journey to Rome. He even sent Cardinal John of Tusculum, the only one who received the purple during the pontificate of Honorius, as legate to Germany, Sweden, Russia, and the other countries of the north to hasten the king's Italian expedition, but Rudolf's war with Count Eberhard of Wurtemberg and other dissensions in Germany prevented his departure. The same legate presided at the national council of Würzburg, which began its sessions on 16 March, 1287. The decrees which were passed at this council are practically the same as those of the general council of Lyons in 1274.\n\nThe two great mendicant orders which at that time exerted great influence, both as pastors of the faithful and as professors at the great seats of learning in Europe, received many new privileges from Honorius IV. He also approved the privileges of the Carmelites and the Augustinian hermits and permitted the former to exchange their striped habit for a white one. He was especially devoted to the Williamites, an order founded by St. William, Duke of Aquitaine (d. 1156), and added numerous privileges to those which they had already received from Alexander IV and Urban IV. Besides turning over to them some deserted Benedictine monasteries, he presented them with the monastery of St. Paul at Albano, which he himself had founded and richly endowed when he was still cardinal. On 11 March, 1286, he condemned the sect of the Apostolics or false apostles, which had been started by a certain Gerard Segarelli at Parma in 1260. At the University of Paris he advocated the erection of chairs for the Oriental languages in order to give an opportunity of studying these languages to those who intended to labour for the conversion of the Musselmans and the reunion of the schismatic churches in the East.\n\nSources PROU, Les Registres d'Honorius IV, recueil des bulles de ce pape, publiees ou analysees d'apres le manuscrit original des archives du Vatican (Paris, 1887-89); PAWLICKI, Papst Honorius IV., eine Monographie (Munster, 1896); REDLICH, Regesta Imperii, Die Regesten des Kaiserreichs unter Rudolph, Adolph, Albrecht, Heinrich VII. 1273-1313 (Innsbruck, 1898)."}, {"url": "https://pantheon.world/profile/person/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "Honoré IV, Prince of Monaco\n\nHonoré IV (Honoré Charles Anne Grimaldi; 17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 1814 to 16 February 1819 . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Honoré IV, Prince of Monaco has received more than 162,372 page views. His biography is available in 23 different languages on Wikipedia (up from 20 in 2019) . Honoré IV, Prince of Monaco is the 5,788th most popular politician (down from 4,580th in 2019), the 1,731st most popular biography from France (down from 1,446th in 2019) and the 429th most popular French Politician."}, {"url": "https://dbpedia.org/page/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "أونوريه الرابع هو سياسي فرنسي، ولد في 17 مايو 1758 في باريس في فرنسا، وتوفي بنفس المكان في 16 فبراير 1819. انتخب Pair of France ‏. (ar)\n\nHonoré IV. von Monaco (* 17. Mai 1758; † 16. Februar 1819) war von 1814 bis zu seinem Tod regierender Fürst von Monaco. Honoré war der ältere Sohn des Fürsten Honoré III. und dessen Gemahlin Marie Catherine de Brignole Sale. Er war seit 1777 verheiratet mit Louise d’Aumont Mazarin, Herzogin von Mazarin (1759–1829) und hatte mit dieser zwei Söhne, die nacheinander regierenden Fürsten Honoré V. und Florestan I. Nach dem französischen Annexionsbeschluss 1793 war er teils unter harten materiellen Bedingungen in einem Kerker in Paris inhaftiert, ehe er mit der Restauration 1814 gesundheitlich angeschlagen die Gelegenheit bekam, als Erbe seines Vaters die Herrschaft über Monaco anzutreten. (de)\n\nΟ Ονώριος Δ΄ (γαλλικά: Honoré IV) ήταν ο Πρίγκιπας του Μονακό από τις 30 Μαΐου 1814 ως τις 16 Φεβρουαρίου 1819. Γονείς του ήταν ο Πρίγκιπας Ονώριος Γ΄ και η Γενοβέζα αριστοκράτισσα . Ο Ονώριος Δ΄ παντρεύτηκε την στις 15 Ιουλίου 1777 στο Παρίσι. Χώρισαν το 1798, αφού προηγουμένως είχαν αποκτήσει δύο γιους: 1. * τον Ονώριο (1778–1841) 2. * τον Φλορεστάνο (1785–1856) Ανέλαβε τα ηνία του Πριγκιπάτου του Μονακό στις 30 Μαΐου 1814, μετά τη λήξη της περιόδου της γαλλικής κατοχής (1793-1814). Κατά τη διάρκεια της γαλλικής κατοχής του Μονακό ο Πρίγκιπας Ονώριος είχε φυλακιστεί για πολλά χρόνια. Εξαιτίας αυτού ασθένησε και στα τελευταία του χρόνια κατέστη ανίκανος να κυβερνήσει. Έτσι, από το 1815 παραχώρησε τα καθήκοντά του στον αδελφό του και έπειτα στο γιο του Ονώριο Ε΄. (el)\n\nHonoré IV (Honoré Charles Anne Grimaldi; 17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 1814 to 16 February 1819. Because of his health, the state of affairs was managed by a regency of his brother Joseph Grimaldi, and his son Prince Honoré V. (en)\n\nHonorato IV, Príncipe de Mónaco (París, 17 de mayo de 1758 – París, 16 de febrero de 1819) fue Príncipe Soberano de Mónaco entre 1814 y 1819, luego de la Ocupación Francesa (1793 - 1814). Hijo de Honorato III y de su esposa, María Catalina Brignole Sale. Fue sucedido por su hijo mayor, el Príncipe Honorato. Recuperó el control del principado con ayuda exterior y pasó sus títulos a su hijo mayor, Honorato V. Se casó el 15 de julio de 1771 con , , de la cual se divorció en 1798. Tuvieron dos hijos, que reinaron a su vez: * Honorato V (1778-1841). * Florestán I (1785-1856). En materia de política exterior fue capaz de ganar el favor de Génova, secular opositor del dominio independiente del Principado de Mónaco, esto se logró con su madre, María Catalina Brignole Sale, proveniente de una poderosa familia que tenía entre sus miembros varios Dux de Génova. (es)\n\nHonoré IV, né le 17 mai 1758 à Paris et mort le 16 février 1819 dans la même ville, est prince souverain de Monaco du 30 mai 1814 au 16 février 1819, après la période d'occupation française (1793-1814). (fr)\n\nOnorato IV di Monaco (Parigi, 17 maggio 1758 – Monaco, 16 febbraio 1819) è stato Principe sovrano di Monaco dal 1814 fino al 1819. (it)\n\nオノレ4世（Honoré IV, 1758年5月17日 - 1819年2月16日）は、モナコ公（在位：1814年 - 1819年）。 (ja)\n\nHonorato IV, Príncipe de Mônaco (17 de Maio de 1758 - 16 de Fevereiro de 1819) foi o sexto príncipe soberano de Mônaco, tendo reinado entre 1795 até sua morte. Também havia sido o sexto . Honorato IV era filho de Honorato III, Príncipe de Mônaco e de Maria Catarina de Brignole. Em 1777, desposou Luísa Felícia Vitória de Aumont, Duquesa de Mazarino, com quem teve dois filhos: * Honorato V, Príncipe de Mônaco * Florestan I, Príncipe de Mônaco (pt)\n\nHonorius IV Karel Anna Maria Maurits Grimaldi (Monaco, 17 mei 1758 – Parijs, 16 februari 1819) was van 1814 tot 1819 vorst van Monaco. Hij was de zoon van prins Honorius III, die in de Franse Revolutie werd onteigend (1793) en in 1795 in gevangenschap stierf. Na de val van Napoleon in 1814 werd de onafhankelijkheid van Monaco door het Verdrag van Parijs hersteld. Honorius wilde vanwege zijn slechte gezondheid de macht overdragen aan zijn broer . Na protesten van zijn zoon Honorius Gabriël aanvaardde hij toch zelf de regering, hoewel het bestuur in feite door regenten werd gevoerd. Na de terugkeer van Napoleon werd Honorius IV gevangengenomen en voor de keizer gevoerd. Na 's keizers uiteindelijke val werd op het Congres van Wenen de soevereiniteit van Monaco opnieuw hersteld, nu echter als protectoraat van het Koninkrijk Sardinië. Honorius werd na zijn dood in 1819 opgevolgd door zijn zoon Honorius V. Uit zijn huwelijk met , hertogin de Mazarin et de la Meilleraye, werden twee kinderen geboren: * Honorius Gabriël (1778-1841), de latere vorst Honorius V; * Tancred Florestan Rogier Lodewijk (1785-1856), de latere vorst Florestan. (nl)\n\nHonore Grimaldi, książę Monako, książę Valentinois (ur. 17 maja 1758, zm. 16 lutego 1819 w Paryżu) – 7. książę Monako od 30 maja 1814 do 16 lutego 1819, syn księcia Honoriusza III Grimaldi i księżnej Marii de Brignole. (pl)\n\nHonoré IV av Monaco, född 17 maj 1758, död 16 februari 1819, var en monark (furste) av Monaco. Han var son till Honoré III av Monaco och Maria Caterina Brignole Sale. Han satt fängslad under franska revolutionen, men undgick avrättning. Monaco anslöts till Frankrike i mars 1793, och han blev därför inte furste vid sin fars död 1795. Efter Napoleons fall 1814 återupprättades furstendömet Monaco och han placerades på dess tron i enlighet med legitimitetsprincipen. Eftersom han var för sjuk för att kunna resa till Monaco och tillträda regeringen, insattes regenter i hans ställe; först hans bror Josef av Monaco, och från 1815 hans son Honoré V. (sv)\n\n奧諾雷四世（德語：Honoré IV，1758年5月17日－1819年2月16日），摩納哥親王，1814年至1819年在位。 (zh)\n\nОноре IV (фр. Honoré IV, 17 мая 1758, Париж — 16 февраля 1819, Париж) — шестой князь Монако, правивший в 1814—1819 годах. (ru)\n\nОноре IV (фр. Honoré IV; 17 травня 1758 — 16 лютого 1819) — шостий князь Монако, що правив в 1814—1819 роках. (uk)"}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iv-prisoner-of-the-french-revolution-2/", "page_content": "Prince Honoré IV was born on May 17, 1758 in Paris, to his parents Prince Honoré III and Princess Maria-Caterina de Brignole-Sale. This prince, perhaps, experienced more challenges in life than any other Grimaldi. Most of his hardships were caused by the French Revolution, and the last hours of his life are still shrouded in mystery …\n\nThe victims of the Great Terror\n\nPrince Honoré IV was unlucky enough to be living in Paris when the Reign of Terror broke out in France. As a nobleman and prince he was soon arrested and thrown into prison. The prince’s former wife, Duchess of Mazarin, was also taken into custody. Assisted by their family doctor, however, she managed to escape and hide with her youngest son Florestan.\n\nThe revolution did not spare the family of Prince’s Honore IV’s youngest brother, Joseph. His wife, Marie Thérèse de Choiseul, was arrested on suspicion of espionage and executed by guillotine. She was only 27, leaving behind three little daughters.\n\nAs for Prince Honoré, he was imprisoned for one and a half years. This time in prison greatly undermined his health, and he never fully recovered from it afterwards. On March 21, 1795 his father died and Honoré IV ascended the throne of Monaco. At that time the monarchy had just been banned and Monaco was once again annexed to the French Republic under the name of Port Hercule.\n\nEven after Prince Honoré was released from prison, it took another seven years of negotiations before the French regime restored some of Honoré IV’s and his brother Prince Joseph’s income. The future started to look brighter for the Grimaldi’s once the radical revolutionary regime was followed by the French consulate and, finally, by the First French Empire of Napoleon Bonaparte.\n\nReturn to the throne\n\nWhen the Napoleonic Wars finally came to an end, the status of Monaco was restored by the Congress of Vienna (1814–1815) thanks to the efforts of Prince Talleyrand. On May 30, 1814 Honoré IV was officially named the Principality’s ruler. However, he was too ill to take control of his country. So it was his brother Prince Joseph who became regent.\n\nThe Prince’s eldest son, 36-year-old Honoré Gabriel, however, was not happy about this decision. A brilliant soldier, he entered the cavalry service at the age of 20 and prospered in the army of the Empire Marshal, Emmanuel de Grouchy. Since Prince Joseph was not particularly eager to deal with the Principality’s affairs, preferring his life in the capital, he easily facilitated handing over the reins to his nephew, Honoré Gabriel, who ruled Monaco up until the death of Honoré IV (later becoming Prince Honoré V). As for Honoré IV, he lived in Paris until his very death which remains mysterious to this day…\n\nAccident or murder ..?\n\nOn a winter’s day of February 16, 1819, Honoré IV drowned in the Seine river. The death of the Monaco prince looked like a typical accident. That’s what the investigation concluded as an official version. It must not be forgotten, however, that Honoré IV was not a very healthy person, to say the least. This is the reason why he was not only unwilling, but was also physically unfit to rule the country. Imprisonment and numerous personal tragedies had taken their toll on the Prince, making him, for all intents and purposes, disabled. This is what the scanty preserved data suggests. A legitimate question arises: how could a 60-year-old monarch, in deplorable physical state, manage to cover such a considerable distance away from home (Avenue Denfert-Rochereau) to the Seine river bank..?\n\nWas it really an accident? Or rather a premeditated murder? Or could it be that the Prince decided to put an end to his own unhappy life? Being a depressed person, did he step into the Seine himself..? The answer remains a mystery.\n\nThe main legacy of Prince Honore IV\n\nAs Prince of Monaco, Honoré IV suffered three arrests and never actually ruled Monaco. He spent part of his life in a prison cell and the rest, trying to improve his health. Needless to say, there are very few mentions of the Prince, even in the archives of Monaco. His most important contribution to the history of Monaco was the birth of his two sons — the future princes, Honoré V and Florestan I, who consistently ruled the Principality and left their mark on the state’s history."}, {"url": "https://www.unofficialroyalty.com/honore-iv-prince-of-monaco/", "page_content": "by Susan Flantzer\n\n© Unofficial Royalty 2022\n\nHonoré Charles Anne Grimaldi was born in Paris, France on May 17, 1758. He was the elder of the two sons of Honoré III, Prince of Monaco and Maria Caterina Brignole who came from a Republic of Genoa (now in Italy) noble family. Honoré’s paternal grandparents were Louise-Hippolyte, Sovereign Princess of Monaco for ten months before her death from smallpox, and Jacques I, briefly the Sovereign Prince of Monaco, born Jacques François Leonor Goyon de Matignon. His maternal grandparents were Giuseppe Brignole, Marquis di Groppoli, the Ambassador to France from the Republic of Genoa, now in Italy, and Maria Anna Balbi.\n\nHonoré IV had one younger brother:\n\nPrince Joseph of Monaco, Regent of Monaco (1763 – 1816), married (1) Marie Thérèse de Choiseul, had three children, Marie Thérèse was guillotined during the French Revolution (2) Frances Margaret Powell, no children\n\nHonoré IV’s parents had issues with their marriage. Honoré III and Maria Caterina initially lived in Monaco but by 1760, Honoré III was dissatisfied with his life there, and returned to France without his wife, spending time with his mistresses at his French homes. Eventually, Maria Caterina was allowed to come to France. However, Honoré III continued his affairs and Maria Caterina began an affair, that would become long-term, with Louis Joseph de Bourbon, Prince of Condé. In 1770, Louis Joseph used his influence to obtain a legal separation for Maria Caterina from Honoré III and the right to manage her own finances. Honoré III finally realized his relationship with Maria Caterina was over and eventually accepted Maria Caterina’s relationship with Louis Joseph de Bourbon, Prince of Condé. Three years after Honoré III’s death in 1798, Maria Caterina and Louis Joseph were married but their marriage was kept secret for ten years.\n\nHonoré IV and his brother Joseph grew up mostly in France, living in homes inherited from their paternal grandfather Jacques III Goyon de Matignon, Count of Thorigny: a Paris mansion, the Hôtel de Matignon, now the official residence of the Prime Minister of France, and the Château des Matignon (link in French) in Torigni-sur-Vire in Normandy, France. In 1641, during the reign of Honoré II, Monaco had become a French protectorate, and the Princes of Monaco became vassals of the Kings of France while remaining sovereign princes. Many successive Princes of Monaco and their families spent most of their lives in France and intermarried with French and Italian noble families.\n\nHonoré III arranged a marriage for his son Honoré (IV) to Louise d’Aumont, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the only child of Louis Marie Guy d’Aumont de Rochebaron, Duke of Aumont (1732 – 1799) and Louise-Jeanne de Durfort, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye (1735 – 1781). Through her mother, Louise was the great-great-great-granddaughter of Hortense Mancini, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the mistress of King Charles II of England, and one of the two heirs of her uncle Cardinal Jules Mazarin, the First Minister of King Louis XIV of France. Louise was the heir of Hortense Mancini’s titles and the Mazarin family wealth. Therefore, a marriage to Louise came with a large dowry and the prospect of a fortune. Honoré (IV) and Louise married on July 15, 1777.\n\nThe marriage did produce two sons, both Sovereign Princes of Monaco:\n\nThe French Revolution had dire consequences for the Grimaldi family. In January 1793, Honoré III, Prince of Monaco was officially declared deposed and the Principality of Monaco was annexed by France. The members of the former ruling Grimaldi dynasty lost all aristocratic privileges in France, were dispossessed of their French property, and became French citizens. During the Reign of Terror, in September 1793, Honoré (IV), his wife Louise, their son Florestan, and Honoré (IV)’s father Honoré III were arrested and imprisoned in Paris as enemies of the people. Louise and her son Florestan were rescued by a family doctor who forged release papers and then hid them in his home until the Reign of Terror was over. The wife of Honoré IV’s brother Joseph was not as lucky. Joseph spent most of his time abroad negotiating foreign loans which made him a suspect of counter-revolutionary activities. When Joseph did become involved in a counter-revolution, his wife Marie Thérèse was arrested in the absence of her husband, condemned to death, and guillotined in 1794, one of the last victims before the end of the Reign of Terror.\n\nIn October 1794, Honoré III and Honoré (IV) were released from prison. Honoré III never recovered from his imprisonment and died in Paris on March 21, 1795, at the age of 74, but his burial place is unknown. Honoré IV, whose chronic ill health had been worsened by imprisonment, would have become Prince of Monaco but Monaco was no longer a sovereign monarchy. However, Honoré IV’s family properties in France were returned to him but they were in poor condition and all of the contents were gone.\n\nIn 1794, while Honoré IV was still in prison, Louise had given birth to an illegitimate daughter Amélie Céleste Erodore d’Aumont. The father of the child is believed to have been Antoine de Montazet, Archbishop of Lyon. After Honoré IV’s release from prison, Louise and Honoré IV’s marriage became unhappy and the couple separated. In 1798, Louise divorced Honoré IV, giving Louise sole access to her fortune.\n\nIn 1804, Napoleon crowned himself Emperor of the French. Honoré IV could not adapt to the new French society and for the most part, remained an outsider. Because of a lack of funds, he needed to sell his family’s Paris and Normandy homes. Surprisingly, Honoré IV’s health improved and he joined the French Army. He was wounded during Napoleon’s Russian Campaign, lost the use of one arm, and was sent back to Paris.\n\nAfter Napoleon’s defeat in 1814 and the Bourbon Restoration which saw Louis XVIII, a younger brother of the beheaded King Louis XVI, become King of France, Florestan’s uncle Joseph petitioned King Louis XVIII to restore the Principality of Monaco to the Grimaldi family. Florestan’s father Honoré IV finally became Sovereign Prince of Monaco in 1814. The independence of Monaco lasted for only one year. In 1815, the Congress of Vienna, an international diplomatic conference that reconstituted the European political order after the downfall of Napoleon I, declared that Monaco would be a protectorate of the Kingdom of Sardinia.\n\nBy the time Honoré IV became the Sovereign Prince of Monaco, his physical condition had worsened and he was now paralyzed on one side of his body. Because of his condition, a regency was established to rule in his name. Honoré IV’s brother Joseph was regent from 1814 -1815 and then Florestan’s brother Honoré V served as regent until his father’s death in 1819 when he succeeded him as Honoré V, Prince of Monaco.\n\nHonoré IV, Prince of Monaco died in Paris, France on February 16, 1819, aged 60. He was buried at the Church of Saint Nicholas in Monaco. During the late 19th century, a new and larger church, the Cathedral of Monaco, was built on the site of the Church of Saint Nicholas. The original church was demolished in 1874 but the current cathedral was built over the areas of the previous church and the old burial site so that the sovereign princes and consorts originally buried at the Church of Saint Nicholas are now buried in the Cathedral of Monaco.\n\nThis article is the intellectual property of Unofficial Royalty and is NOT TO BE COPIED, EDITED, OR POSTED IN ANY FORM ON ANOTHER WEBSITE under any circumstances. It is permissible to use a link that directs to Unofficial Royalty.\n\nWorks Cited\n\nEdwards, Anne, 2017. The Grimaldis of Monaco . Blue Ridge Summit: Lyons Press.\n\n. Blue Ridge Summit: Lyons Press. En.wikipedia.org. 2022. Honoré IV, Prince of Monaco – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022]. En.wikipedia.org. 2022. Louise d’Aumont – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Honoré III, Prince of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Maria Caterina Brignole, Princess of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Honoré IV (prince de Monaco) — Wikipédia . [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022].\n\n. [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Louise d’Aumont — Wikipédia. [online] Available at: <https://fr.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]."}, {"url": "https://infogalactic.com/info/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "From Infogalactic: the planetary knowledge core\n\nHonoré IV (17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 12 March 1795 to 16 February 1819. He was the son of Prince Honoré III by his wife, Maria Caterina Brignole, a Genoese noblewoman. After the fall of Napoleon I, he regained control of the principality thanks to a clause added by Charles Maurice de Talleyrand-Périgord at the Congress of Vienna stating that, \"the Prince of Monaco should return to his estates\", and passed on his titles to his eldest son, Honoré V, Prince of Monaco.\n\nHonoré IV married Louise Félicité Victoire d'Aumont, Duchess of Aumont, Duchess Mazarin and of La Meilleraye on 15 July 1777 in Paris. They divorced in 1798. They had two sons:\n\nDuring the French occupation of Monaco, Honoré IV was imprisoned for several years. Illnesses resulting from this imprisonment incapacitated Honoré IV in his later years, and following the re-establishment of the Principality a regency was established to rule in Honoré's name.\n\nAncestry\n\n<templatestyles src=\"Asbox/styles.css\"></templatestyles>\n\n<templatestyles src=\"Asbox/styles.css\"></templatestyles>"}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iii-one-of-the-longest-reigns-in-european-history-en/", "page_content": "Everybody knows that the reign of French King Louis XIV, ‘Le Roi Soleil’, was the longest in European history. Two British Queens — Elizabeth II who will celebrate 70 years on the throne in 2022 and her great-great-grandmother Victoria (who reigned for 63 years) also had lengthy reigns. But few know that the fifth prince of Monaco is also on the list of the longest-reigning European monarchs: after coming to the Monegasque throne in 1733 he reigned for nearly 60 years and so passed his ancestor Honoré, Lord of Monaco, who ruled for 58 years in the XVI century.\n\nAscension to the Throne at the age of 13\n\nHonoré Camille Léonor Grimaldi was born on November 10, 1720. He was the son of Louise-Hyppolite, and the grandson of Prince Antoine I, who both died in 1731. Honoré came to the throne just after turning 13 when his father, Prince Jacques I, abdicated. Prince Honoré III spent much of his time away on campaign with the Royal French Army fighting the English in the War of the Austrian Succession. Honoré III was wounded fighting in the French victory at Rocoux. Later, he earned the Cross of St Louis for his conduct and after the Peace of Aix-la-Chapelle in 1748 he was given the rank of Marshal of France.\n\nWhat is interesting is that despite the heroic service of Honoré III in the wars, the Principality of Monaco was neutral in the conflict and, administered by the Chevalier de Grimaldi, assisted both French and English ships in need of help. The Austrians and Sardinians did blockade the Monegasque coast for a time and much of the countryside was pillaged by Croat soldiers of the Austrian army but French forces later cleared the region of all invaders in 1748.\n\nThe Royal Marriage\n\nIn 1757 Honoré III married Maria Caterina di Brignole-Sale who was descended from the Doges of Genoa and called “the most beautiful woman in France”. They were a very proud family and the arrival of the bride-to-be in Monaco turned into a disaster as many of the bridal attendants were seasick and the future mother-in-law insisted that Honoré III come onboard to greet his fiancé and escort her ashore. However, as a monarch in his own right, Honoré III refused as it was considered a breach of protocol for a prince to go to meet someone rather than them being brought to meet him. A stand-off ensued and eventually the Genoese fleet sailed away and stopped farther up the coast before a compromise was negotiated by which the couple would meet in the middle of a bridge extended between ship and shore. Nonetheless, the two were married and in 1758 the future Prince Honoré IV was born followed by Prince Joseph some years later. In 1770, though, Honoré III and Princess Maria Caterina divorced, and she later married the Prince de Condé in 1798.\n\nIn 1767 the British Duke of York was sailing from Marseilles to Genoa when he was suddenly taken ill and had to put in at Monaco. Prince Honoré III quickly offered all the help he could and put his palace at the disposal of the Prince who died after 11 days in what has forever after been known as the York Room of the Princely Palace.\n\nIn the meantime Prince Honoré III did what he could to guide his little principality along, improving trade and the economy which was heavily dependent on growing citrus fruits such as lemons in those days. His reign also saw the establishment of the first printing press in Monaco and the first newspaper the ‘Courrier de Monaco’. Prince Honoré III did take the initiative in pushing for some reforms, the most major of which was the repeal of the law that the Sovereign Prince would receive the inheritance of anyone who died on his property. On August 18, 1770 Honoré saw the practice, which he viewed as barbaric, abolished.\n\nThe French Revolution, Arrest and Imprisonment\n\nAs France slipped increasingly rapidly towards revolution things in Monaco remained calm and peaceful until the fateful day of July 14, 1789; the date of the storming of the Bastille. The shock spread to Monaco where crowds embraced the Declaration of the Rights of Man, influenced by the rise of republicanism in France as well as some newly introduced nostalgia for the Genoese Republic. Honoré III was concerned with the loss of his noble titles in France at the hands of the French National Constituent Assembly which was intent on abolishing all aristocratic privileges and soon he rushed to Paris to try to defend his titles there before the Constituent Assembly.\n\nHonoré III was extremely convincing when dealing with the French revolutionaries. His estates were, he insisted, not the gift of the King of France alone but payment for services rendered in the cause of French national glory. He struck just the right cord and the Assembly voted a generous pension for the Prince of Monaco in reparation for his confiscated properties.\n\nUnfortunately, before the order could be carried out, Danton came to power and the republic was declared. In all the turmoil France lost interest in Monaco and ultimately all Honoré was able to gain was recognition from the republican government of Monegasque neutrality. Unfortunately, that was a promise that would never be respected.\n\nThe French Republic declared their expansionist policy at the end of 1792. Monaco quickly fell victim to this policy and on January 13, 1793 Prince Honoré III was officially declared deposed by the Monegasque National Convention. Members of the Convention immediately filed a petition for accession to France. Some people in France however did protest on the grounds that Honoré III had always been a loyal friend and ally of the French, but republican hatred of monarchy prevailed and Monaco was absorbed into the French Republic and renamed Fort Hercules.\n\nAt the height of the Reign of Terror Honoré III was arrested as was his son, Honoré IV, who had been in Paris at the time and who would remain imprisoned for 15 months. Honoré III had suffered greatly from his own imprisonment and after his release had to stay in his house on the rue de Varennes as the Princely Palace in Monaco had been confiscated by the revolution though, thankfully, there was no ‘Reign of Terror’ or mass arrests and bloodshed in Monaco. Overcome with sadness, suffering, a number of ailments and the ravages of old age Prince Honoré III of Monaco died on March 21, 1795.\n\nIn 2020, the Principality paid a tribute to Prince Honoré III by having issued a 2€ commemorative coin celebrating the 300th anniversary of his birth. At the time of writing, the price of the coin, which was issued in 15,000 copies, has reached in the region of €300."}, {"url": "https://www.catholic.com/encyclopedia/Pope-Honorius-IV", "page_content": "Honorius IV (GIACOMO SAVELLI), POPE, b. at Rome about 1210; d. at Rome, April 3, 1287. He belonged to the rich and influential family of the Savelli and was a grandnephew of Honorius III. Very little is known of his life before he ascended the papal throne. He studied at the University of Paris, during which time he held a prebend and a canonry at the cathedral of Chalons-sur-Marne. Later he obtained the benefice of rector at the church of Berton, in the Diocese of Norwich. In 1261 he was created Cardinal-Deacon of Santa Maria in Cosmedin by Martin IV, who also appointed him papal prefect in Tuscany and captain of the papal army. By order of Clement IV he and three other cardinals invested Charles of Anjou as King of Sicily at Rome on July 28, 1265. He was one of the six cardinals who elected Gregory X by compromise at Viterbo on September 1, 1271. In 1274 he accompanied Gregory X to the Fourteenth General Council at Lyons, and in July, 1276, he was one of the three cardinals whom Adrian V sent to Viterbo with instructions to treat with King Rudolf I of Hapsburg concerning his imperial coronation at Rome and his future relations towards Charles of Anjou, King of Sicily. The death of Adrian V in the following month rendered fruitless the negotiations with Rudolf. Nothing further is known of the cardinal’s doings until, nine years later, he was elected pope.\n\nMartin IV died March 28, 1285, at Perugia, and three days after his death fifteen out of the eighteen cardinals who then composed the Sacred College had a preliminary consultation at the episcopal residence at Perugia, and appointed the following day, April 2, 1285, for the election of the new pope. The election took place without the conclave, which had been pre-scribed by Gregory X, but suspended by John XXI. At the first vote taken, Giacomo Savelli was unanimously elected and took the name of Honorius IV. His election was one of the speediest in the history of the papacy. The reason for this great haste may be found in the Sicilian complications, which did not allow any interregnum, and especially in the fact that the cardinals wished to avoid the unjustifiable interference which occurred at the election of the preceding pope, when Charles of Anjou induced the inhabitants of Viterbo to imprison two cousins of the deceased Nicholas III, in order to effect the election of a pope of French nationality. On May 19, 1285, the new pontiff was ordained priest by Cardinal Malabranca Orsini of Ostia, and the following day he was consecrated bishop and crowned pope in the basilica of St. Peter at Rome. Honorius IV was already advanced in age and so severely affected with the gout that he could neither stand nor walk. When saying Mass he was obliged to sit on a stool and at the Elevation his hands had to be raised by a mechanical contrivance.\n\nSicilian affairs required the immediate attention of the pope. By throwing off the rule of Charles of Anjou and taking Pedro III of Aragon as their king without the consent and approval of the pope, the Sicilians had practically denied his suzerainty over Sicily. The awful massacre of March 31, 1282, known as the Sicilian Vespers, had precluded every possibility of coming to an amicable understanding with Martin IV, a Frenchman who owed the tiara to Charles of Anjou. Pope Martin demanded unconditional submission to Charles of Anjou and the Apostolic See and, when this was refused, put Sicily and Pedro III under the ban, deprived Pedro of the Kingdom of Aragon, and gave it to Charles of Valois, the son of King Philip III of France. He, moreover, assisted Charles of Anjou in his attempts to recover Sicily by force of arms. The Sicilians not only repulsed the attacks of Charles of Anjou but also captured his son Charles of Salerno. On January 6, 1285, Charles of Anjou died, leaving his captive son Charles of Salerno as his natural successor. Such were the conditions in Sicily when Honorius IV ascended the papal throne. The Sicilians cherished the hope that the new pontiff would take a different stand from that of his predecessor in the Sicilian question, but their hopes were only partly realized. He was indeed less impulsive and more peaceably inclined than Martin IV, but he did not renounce the claims of the Church and of the House of Anjou upon the Sicilian crown. Neither did he set aside the severe ecclesiastical punishments imposed upon Sicily or restore to Pedro III the Kingdom of Aragon which Martin IV had transferred to Charles of Valois. On the other hand, he did not approve of the tyrannical government to which the Sicilians had been subject under Charles of Anjou. This is evident from his wise legislation as embodied in his constitution of September 17, 1285 (“Constitutio super ordinatione regni Siciliae” in “Bullarium Romanum”, Turin, IV, 70-80). In this constitution he inculcates that no government can prosper which is not founded on justice and peace, and he passes forty-five ordinances intended chiefly to protect the people of Sicily against their king and his officials. In case of any violation of these ordinances by the king or his officials, the people were free to appeal to the Apostolic See for redress. The king, moreover, was bound to observe the ordinances contained in this constitution under pain of excommunication. Martin IV had allowed King Philip III of France to tax the clergy in France, and in a few dioceses of Germany, one-tenth of their revenues for the space of four years. The money thus collected was to be used for waging war against Pedro III with the purpose of conquering Aragon for Charles of Valois. Honorius IV approved this action of his predecessor. When Edward I of England requested him to use his influence to put an end to the war, he answered that Pedro III deserved to be punished and that Philip III should not be kept from reaping the fruits of a war which he had undertaken in the service and at the instance of the Church. The death of Pedro III on November 11, 1285, somewhat changed the Sicilian situation. His two sons Alfonso and James succeeded him, the former as King of Aragon, the latter as King of Sicily. Honorius IV, of course, acknowledged neither the one nor the other. On April 11, 1286, he solemnly excommunicated King James of Sicily and the bishops who had taken part in his coronation at Palermo on February 2, 1286; but neither the king nor the bishops concerned themselves about the excommunication. The king even sent a hostile fleet to the Roman coast and destroyed the city of Astura by fire. Charles of Salerno, the lawful King of Sicily, who was still held captive by the Sicilians, finally grew tired of his long captivity and signed a contract on February 27, 1287, in which he renounced his claims to the Kingdom of Sicily in favor of James of Aragon and his heirs. Honorius IV, however, who was asked for his approval, refused to listen to such an unprincipled act, which surrendered the rights of the Church and of the House of Anjou to refractory rebels. He declared the contract invalid and forbade all similar agreements for the future. While Honorius IV was inexorable in the stand he had taken towards Sicily and its self-imposed king, his relations towards Alfonso of Aragon became less hostile. Through the efforts of King Edward I of England, negotiations for peace were begun by Honorius IV and King Alfonso. The pope, however, did not live long enough to complete these negotiations, which finally resulted in a peaceful settlement of the Aragonese as well as the Sicilian question."}, {"url": "http://www.worldheritage.org/articles/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://en.unionpedia.org/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "Honoré IV, Prince of Monaco Honoré IV (17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 12 March 1795 to 16 February 1819. [1]\n\n25 relations: Antonio I, Prince of Monaco, Catherine Charlotte de Gramont, Charles Maurice de Talleyrand-Périgord, Congress of Vienna, Doge of Genoa, Duke of Valentinois, Florestan I, Prince of Monaco, Giuseppe Brignole, Honoré III, Prince of Monaco, Honoré V, Prince of Monaco, House of Grimaldi, Jacques I, Prince of Monaco, Louis I, Prince of Monaco, Louis, Count of Armagnac, Louise d'Aumont, Louise Hippolyte, Princess of Monaco, Maria Caterina Brignole, Marie of Lorraine, Monarchy of Monaco, Napoleon, Paris, Prince Joseph of Monaco, Regent, Republic of Genoa, Saint Nicholas Cathedral, Monaco.\n\nAntonio I (25 January 1661 – 20 February 1731) was the sovereign Prince of Monaco from 1701 to 1731.\n\nNew!!: Honoré IV, Prince of Monaco and Antonio I, Prince of Monaco · See more »\n\nCatherine Charlotte de Gramont (1639 – 4 June 1678) was a French noblewoman and Princess of Monaco as the wife of Louis I of Monaco and a mistress of Louis XIV of France.\n\nNew!!: Honoré IV, Prince of Monaco and Catherine Charlotte de Gramont · See more »\n\nCharles Maurice de Talleyrand-Périgord (2 February 1754 – 17 May 1838), 1st Prince of Benevento, then 1st Prince of Talleyrand, was a laicized French bishop, politician, and diplomat.\n\nNew!!: Honoré IV, Prince of Monaco and Charles Maurice de Talleyrand-Périgord · See more »\n\nThe Congress of Vienna (Wiener Kongress) also called Vienna Congress, was a meeting of ambassadors of European states chaired by Austrian statesman Klemens von Metternich, and held in Vienna from November 1814 to June 1815, though the delegates had arrived and were already negotiating by late September 1814.\n\nNew!!: Honoré IV, Prince of Monaco and Congress of Vienna · See more »\n\nThe Doge of Genoa (Ligurian: Dûxe, pron. /'dy:ʒe/; Januensium dux et populi defensor, \"Commander of the Genoese and Defender of the People\") was the ruler of the Republic of Genoa, a communal republic, from 1339 until the state's extinction in 1797.\n\nNew!!: Honoré IV, Prince of Monaco and Doge of Genoa · See more »\n\nDuke of Valentinois (French: Duc de Valentinois; Duca Valentino), formerly Count of Valentinois, is a title of nobility, originally in the French peerage.\n\nNew!!: Honoré IV, Prince of Monaco and Duke of Valentinois · See more »\n\nFlorestan I, Prince of Monaco (10 October 1785 in Paris – 20 June 1856) was Prince of Monaco and Duke of Valentinois from 2 October 1841 until his death.\n\nNew!!: Honoré IV, Prince of Monaco and Florestan I, Prince of Monaco · See more »\n\nGiuseppe Maria Brignole Sale (1703–1769) was a Genovese nobleman and father of Maria Caterina Brignole, Princess of Monaco and later Princess of Condé.\n\nNew!!: Honoré IV, Prince of Monaco and Giuseppe Brignole · See more »\n\nHonoré III (10 November 1720 – 21 March 1795) ruled as Prince of Monaco and was Duke of Valentinois for almost sixty years from 1733 to 1793.\n\nNew!!: Honoré IV, Prince of Monaco and Honoré III, Prince of Monaco · See more »\n\nHonoré V (13 May/14 May 1778 in Paris – 2 October 1841 in Paris) was Prince of Monaco and Duke of Valentinois.\n\nNew!!: Honoré IV, Prince of Monaco and Honoré V, Prince of Monaco · See more »\n\nThe House of Grimaldi is associated with the history of the Republic of Genoa, Italy and of the Principality of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and House of Grimaldi · See more »\n\nJacques Goÿon de Matignon (Jacques François Léonor; 21 November 1689 – 23 April 1751) was Count of Thorigny, Prince of Monaco as Jacques I, and the fourth Duke of Valentinois from 1731 until 1733.\n\nNew!!: Honoré IV, Prince of Monaco and Jacques I, Prince of Monaco · See more »\n\nLouis I, Prince of Monaco (25 July 1642 in Prince's Palace of Monaco – 3 January 1701 in Rome) was Prince of Monaco from 1662 until 1701.\n\nNew!!: Honoré IV, Prince of Monaco and Louis I, Prince of Monaco · See more »\n\nLouis of Lorraine (7 December 1641 – 13 June 1718) was the Count of Armagnac from his father's death in 1666.\n\nNew!!: Honoré IV, Prince of Monaco and Louis, Count of Armagnac · See more »\n\nLouise d'Aumont, duchesse d'Aumont, duchesse Mazarin et de La Meilleraye (Louise Félicité Victoire; 22 October 1759 in Paris – 13 December 1826 in Paris) was the only child and daughter of Louis Marie d'Aumont, Duke of Aumont (1732–1799), and his wife, Louise Jeanne de Durfort, duchesse Mazarin et de La Meilleraye (Paris, 1 September 1735 - Paris, 17 March 1781).\n\nNew!!: Honoré IV, Prince of Monaco and Louise d'Aumont · See more »\n\nLouise Hippolyte (10 November 1697 – 29 December 1731) was one of only two women to reign over the Principality of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and Louise Hippolyte, Princess of Monaco · See more »\n\nMaria Caterina Brignole (or Marie-Christine de Brignole; 7 October 1737 – 18 March 1813) was Princess consort of Monaco by marriage to Honoré III, Prince of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and Maria Caterina Brignole · See more »\n\nMarie de Lorraine (12 August 1674 – 30 October 1724) was a princess of the House of Lorraine-Guise and Princess of Monaco as consort of Antonio I of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and Marie of Lorraine · See more »\n\nThe Sovereign Prince or Princess of Monaco is the reigning monarch and head of state of the Principality of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and Monarchy of Monaco · See more »\n\nNapoléon Bonaparte (15 August 1769 – 5 May 1821) was a French statesman and military leader who rose to prominence during the French Revolution and led several successful campaigns during the French Revolutionary Wars.\n\nNew!!: Honoré IV, Prince of Monaco and Napoleon · See more »\n\nParis is the capital and most populous city of France, with an area of and a population of 2,206,488.\n\nNew!!: Honoré IV, Prince of Monaco and Paris · See more »\n\nPrince Joseph of Monaco (Joseph Marie Jerôme Honoré; 10 September 1763 – 28 June 1816) was a Monagasque prince and brother of Honoré IV, Prince of Monaco.\n\nNew!!: Honoré IV, Prince of Monaco and Prince Joseph of Monaco · See more »\n\nA regent (from the Latin regens: ruling, governing) is a person appointed to govern a state because the monarch is a minor, is absent or is incapacitated.\n\nNew!!: Honoré IV, Prince of Monaco and Regent · See more »\n\nThe Republic of Genoa (Repúbrica de Zêna,; Res Publica Ianuensis; Repubblica di Genova) was an independent state from 1005 to 1797 in Liguria on the northwestern Italian coast, incorporating Corsica from 1347 to 1768, and numerous other territories throughout the Mediterranean.\n\nNew!!: Honoré IV, Prince of Monaco and Republic of Genoa · See more »\n\nCathédrale Notre-Dame-Immaculée (Cathedral of Our Lady of the Immaculate Conception), also known as Saint Nicholas Cathedral (name of the old church which was demolished in 1874), Monaco Cathedral (French: Cathédrale de Monaco), is the cathedral of the Roman Catholic Archdiocese of Monaco in Monaco-Ville, Monaco, where many of the Grimaldis were buried, including Grace Kelly and—more recently—Rainier III.\n\nNew!!: Honoré IV, Prince of Monaco and Saint Nicholas Cathedral, Monaco · See more »\n\nRedirects here:\n\nHonore IV, Honore IV of Monaco, Honore IV, Prince of Monaco, Honore IV,5FPrince of Monaco, Honoré IV, Honoré IV of Monaco, Honoré IV,5FPrince of Monaco, Prince Honore IV of Monaco.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Honoré_IV,_Prince_of_Monaco"}]}