{"Honoré IV's father was Prince Honoré III.": [{"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iii-one-of-the-longest-reigns-in-european-history-en/", "page_content": "Everybody knows that the reign of French King Louis XIV, ‘Le Roi Soleil’, was the longest in European history. Two British Queens — Elizabeth II who will celebrate 70 years on the throne in 2022 and her great-great-grandmother Victoria (who reigned for 63 years) also had lengthy reigns. But few know that the fifth prince of Monaco is also on the list of the longest-reigning European monarchs: after coming to the Monegasque throne in 1733 he reigned for nearly 60 years and so passed his ancestor Honoré, Lord of Monaco, who ruled for 58 years in the XVI century.\n\nAscension to the Throne at the age of 13\n\nHonoré Camille Léonor Grimaldi was born on November 10, 1720. He was the son of Louise-Hyppolite, and the grandson of Prince Antoine I, who both died in 1731. Honoré came to the throne just after turning 13 when his father, Prince Jacques I, abdicated. Prince Honoré III spent much of his time away on campaign with the Royal French Army fighting the English in the War of the Austrian Succession. Honoré III was wounded fighting in the French victory at Rocoux. Later, he earned the Cross of St Louis for his conduct and after the Peace of Aix-la-Chapelle in 1748 he was given the rank of Marshal of France.\n\nWhat is interesting is that despite the heroic service of Honoré III in the wars, the Principality of Monaco was neutral in the conflict and, administered by the Chevalier de Grimaldi, assisted both French and English ships in need of help. The Austrians and Sardinians did blockade the Monegasque coast for a time and much of the countryside was pillaged by Croat soldiers of the Austrian army but French forces later cleared the region of all invaders in 1748.\n\nThe Royal Marriage\n\nIn 1757 Honoré III married Maria Caterina di Brignole-Sale who was descended from the Doges of Genoa and called “the most beautiful woman in France”. They were a very proud family and the arrival of the bride-to-be in Monaco turned into a disaster as many of the bridal attendants were seasick and the future mother-in-law insisted that Honoré III come onboard to greet his fiancé and escort her ashore. However, as a monarch in his own right, Honoré III refused as it was considered a breach of protocol for a prince to go to meet someone rather than them being brought to meet him. A stand-off ensued and eventually the Genoese fleet sailed away and stopped farther up the coast before a compromise was negotiated by which the couple would meet in the middle of a bridge extended between ship and shore. Nonetheless, the two were married and in 1758 the future Prince Honoré IV was born followed by Prince Joseph some years later. In 1770, though, Honoré III and Princess Maria Caterina divorced, and she later married the Prince de Condé in 1798.\n\nIn 1767 the British Duke of York was sailing from Marseilles to Genoa when he was suddenly taken ill and had to put in at Monaco. Prince Honoré III quickly offered all the help he could and put his palace at the disposal of the Prince who died after 11 days in what has forever after been known as the York Room of the Princely Palace.\n\nIn the meantime Prince Honoré III did what he could to guide his little principality along, improving trade and the economy which was heavily dependent on growing citrus fruits such as lemons in those days. His reign also saw the establishment of the first printing press in Monaco and the first newspaper the ‘Courrier de Monaco’. Prince Honoré III did take the initiative in pushing for some reforms, the most major of which was the repeal of the law that the Sovereign Prince would receive the inheritance of anyone who died on his property. On August 18, 1770 Honoré saw the practice, which he viewed as barbaric, abolished.\n\nThe French Revolution, Arrest and Imprisonment\n\nAs France slipped increasingly rapidly towards revolution things in Monaco remained calm and peaceful until the fateful day of July 14, 1789; the date of the storming of the Bastille. The shock spread to Monaco where crowds embraced the Declaration of the Rights of Man, influenced by the rise of republicanism in France as well as some newly introduced nostalgia for the Genoese Republic. Honoré III was concerned with the loss of his noble titles in France at the hands of the French National Constituent Assembly which was intent on abolishing all aristocratic privileges and soon he rushed to Paris to try to defend his titles there before the Constituent Assembly.\n\nHonoré III was extremely convincing when dealing with the French revolutionaries. His estates were, he insisted, not the gift of the King of France alone but payment for services rendered in the cause of French national glory. He struck just the right cord and the Assembly voted a generous pension for the Prince of Monaco in reparation for his confiscated properties.\n\nUnfortunately, before the order could be carried out, Danton came to power and the republic was declared. In all the turmoil France lost interest in Monaco and ultimately all Honoré was able to gain was recognition from the republican government of Monegasque neutrality. Unfortunately, that was a promise that would never be respected.\n\nThe French Republic declared their expansionist policy at the end of 1792. Monaco quickly fell victim to this policy and on January 13, 1793 Prince Honoré III was officially declared deposed by the Monegasque National Convention. Members of the Convention immediately filed a petition for accession to France. Some people in France however did protest on the grounds that Honoré III had always been a loyal friend and ally of the French, but republican hatred of monarchy prevailed and Monaco was absorbed into the French Republic and renamed Fort Hercules.\n\nAt the height of the Reign of Terror Honoré III was arrested as was his son, Honoré IV, who had been in Paris at the time and who would remain imprisoned for 15 months. Honoré III had suffered greatly from his own imprisonment and after his release had to stay in his house on the rue de Varennes as the Princely Palace in Monaco had been confiscated by the revolution though, thankfully, there was no ‘Reign of Terror’ or mass arrests and bloodshed in Monaco. Overcome with sadness, suffering, a number of ailments and the ravages of old age Prince Honoré III of Monaco died on March 21, 1795.\n\nIn 2020, the Principality paid a tribute to Prince Honoré III by having issued a 2€ commemorative coin celebrating the 300th anniversary of his birth. At the time of writing, the price of the coin, which was issued in 15,000 copies, has reached in the region of €300."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iv-prisoner-of-the-french-revolution-2/", "page_content": "Prince Honoré IV was born on May 17, 1758 in Paris, to his parents Prince Honoré III and Princess Maria-Caterina de Brignole-Sale. This prince, perhaps, experienced more challenges in life than any other Grimaldi. Most of his hardships were caused by the French Revolution, and the last hours of his life are still shrouded in mystery …\n\nThe victims of the Great Terror\n\nPrince Honoré IV was unlucky enough to be living in Paris when the Reign of Terror broke out in France. As a nobleman and prince he was soon arrested and thrown into prison. The prince’s former wife, Duchess of Mazarin, was also taken into custody. Assisted by their family doctor, however, she managed to escape and hide with her youngest son Florestan.\n\nThe revolution did not spare the family of Prince’s Honore IV’s youngest brother, Joseph. His wife, Marie Thérèse de Choiseul, was arrested on suspicion of espionage and executed by guillotine. She was only 27, leaving behind three little daughters.\n\nAs for Prince Honoré, he was imprisoned for one and a half years. This time in prison greatly undermined his health, and he never fully recovered from it afterwards. On March 21, 1795 his father died and Honoré IV ascended the throne of Monaco. At that time the monarchy had just been banned and Monaco was once again annexed to the French Republic under the name of Port Hercule.\n\nEven after Prince Honoré was released from prison, it took another seven years of negotiations before the French regime restored some of Honoré IV’s and his brother Prince Joseph’s income. The future started to look brighter for the Grimaldi’s once the radical revolutionary regime was followed by the French consulate and, finally, by the First French Empire of Napoleon Bonaparte.\n\nReturn to the throne\n\nWhen the Napoleonic Wars finally came to an end, the status of Monaco was restored by the Congress of Vienna (1814–1815) thanks to the efforts of Prince Talleyrand. On May 30, 1814 Honoré IV was officially named the Principality’s ruler. However, he was too ill to take control of his country. So it was his brother Prince Joseph who became regent.\n\nThe Prince’s eldest son, 36-year-old Honoré Gabriel, however, was not happy about this decision. A brilliant soldier, he entered the cavalry service at the age of 20 and prospered in the army of the Empire Marshal, Emmanuel de Grouchy. Since Prince Joseph was not particularly eager to deal with the Principality’s affairs, preferring his life in the capital, he easily facilitated handing over the reins to his nephew, Honoré Gabriel, who ruled Monaco up until the death of Honoré IV (later becoming Prince Honoré V). As for Honoré IV, he lived in Paris until his very death which remains mysterious to this day…\n\nAccident or murder ..?\n\nOn a winter’s day of February 16, 1819, Honoré IV drowned in the Seine river. The death of the Monaco prince looked like a typical accident. That’s what the investigation concluded as an official version. It must not be forgotten, however, that Honoré IV was not a very healthy person, to say the least. This is the reason why he was not only unwilling, but was also physically unfit to rule the country. Imprisonment and numerous personal tragedies had taken their toll on the Prince, making him, for all intents and purposes, disabled. This is what the scanty preserved data suggests. A legitimate question arises: how could a 60-year-old monarch, in deplorable physical state, manage to cover such a considerable distance away from home (Avenue Denfert-Rochereau) to the Seine river bank..?\n\nWas it really an accident? Or rather a premeditated murder? Or could it be that the Prince decided to put an end to his own unhappy life? Being a depressed person, did he step into the Seine himself..? The answer remains a mystery.\n\nThe main legacy of Prince Honore IV\n\nAs Prince of Monaco, Honoré IV suffered three arrests and never actually ruled Monaco. He spent part of his life in a prison cell and the rest, trying to improve his health. Needless to say, there are very few mentions of the Prince, even in the archives of Monaco. His most important contribution to the history of Monaco was the birth of his two sons — the future princes, Honoré V and Florestan I, who consistently ruled the Principality and left their mark on the state’s history."}, {"url": "https://simple.wikipedia.org/wiki/Honor%C3%A9_III,_Prince_of_Monaco", "page_content": "Honoré III, Prince of Monaco (Honoré Camille Léonor; 10 November 1720 – 21 March 1795) was a reigning prince of the small state of Monaco. He succeeded his mother Louise Hippolyte and is to this day still one of the longest reigning European rulers.\n\nBrief biography [ change | change source ]\n\nThe eldest surviving son of Princess Louise Hippolyte of Monaco and her husband Prince Jacques\n\nIn May 1732 he moved to Paris to be with his father till he was officially proclaimed the prince of Monaco. Antoine Grimaldi, the Chevalier de Grimaldi, acted as regent for the prince between 1732 and 1784, when Honoré chose to live in Paris. This situation remained the same for half a century until Antoine's death in 1784,\n\nOn 5 June 1757 he married Maria Caterina Brignole a member of one of the most powerful and wealthy familys in the Republic of Genoa. The had two sons before divorcing in 1770.\n\nPrince Honoré IV of Monaco (17 May 1758 – 16 February 1819) married Louise d'Aumont and had children. Prince Joseph of Monaco (10 September 1763 – 28 June 1816) married Marie Thérèse de Choiseul and had children.\n\nTitles and styles [ change | change source ]\n\n20 February 1731 - 17 May 1758 His Serene Highness The Marquis of Baux.\n\nThe Marquis of Baux. 7 November 1733 – 19 January 1793 His Serene Highness The Prince of Monaco, Duke of Valentinois.\n\nFurther reading [ change | change source ]"}, {"url": "https://infogalactic.com/info/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "From Infogalactic: the planetary knowledge core\n\nHonoré IV (17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 12 March 1795 to 16 February 1819. He was the son of Prince Honoré III by his wife, Maria Caterina Brignole, a Genoese noblewoman. After the fall of Napoleon I, he regained control of the principality thanks to a clause added by Charles Maurice de Talleyrand-Périgord at the Congress of Vienna stating that, \"the Prince of Monaco should return to his estates\", and passed on his titles to his eldest son, Honoré V, Prince of Monaco.\n\nHonoré IV married Louise Félicité Victoire d'Aumont, Duchess of Aumont, Duchess Mazarin and of La Meilleraye on 15 July 1777 in Paris. They divorced in 1798. They had two sons:\n\nDuring the French occupation of Monaco, Honoré IV was imprisoned for several years. Illnesses resulting from this imprisonment incapacitated Honoré IV in his later years, and following the re-establishment of the Principality a regency was established to rule in Honoré's name.\n\nAncestry\n\n<templatestyles src=\"Asbox/styles.css\"></templatestyles>\n\n<templatestyles src=\"Asbox/styles.css\"></templatestyles>"}, {"url": "https://www.unofficialroyalty.com/honore-iv-prince-of-monaco/", "page_content": "by Susan Flantzer\n\n© Unofficial Royalty 2022\n\nHonoré Charles Anne Grimaldi was born in Paris, France on May 17, 1758. He was the elder of the two sons of Honoré III, Prince of Monaco and Maria Caterina Brignole who came from a Republic of Genoa (now in Italy) noble family. Honoré’s paternal grandparents were Louise-Hippolyte, Sovereign Princess of Monaco for ten months before her death from smallpox, and Jacques I, briefly the Sovereign Prince of Monaco, born Jacques François Leonor Goyon de Matignon. His maternal grandparents were Giuseppe Brignole, Marquis di Groppoli, the Ambassador to France from the Republic of Genoa, now in Italy, and Maria Anna Balbi.\n\nHonoré IV had one younger brother:\n\nPrince Joseph of Monaco, Regent of Monaco (1763 – 1816), married (1) Marie Thérèse de Choiseul, had three children, Marie Thérèse was guillotined during the French Revolution (2) Frances Margaret Powell, no children\n\nHonoré IV’s parents had issues with their marriage. Honoré III and Maria Caterina initially lived in Monaco but by 1760, Honoré III was dissatisfied with his life there, and returned to France without his wife, spending time with his mistresses at his French homes. Eventually, Maria Caterina was allowed to come to France. However, Honoré III continued his affairs and Maria Caterina began an affair, that would become long-term, with Louis Joseph de Bourbon, Prince of Condé. In 1770, Louis Joseph used his influence to obtain a legal separation for Maria Caterina from Honoré III and the right to manage her own finances. Honoré III finally realized his relationship with Maria Caterina was over and eventually accepted Maria Caterina’s relationship with Louis Joseph de Bourbon, Prince of Condé. Three years after Honoré III’s death in 1798, Maria Caterina and Louis Joseph were married but their marriage was kept secret for ten years.\n\nHonoré IV and his brother Joseph grew up mostly in France, living in homes inherited from their paternal grandfather Jacques III Goyon de Matignon, Count of Thorigny: a Paris mansion, the Hôtel de Matignon, now the official residence of the Prime Minister of France, and the Château des Matignon (link in French) in Torigni-sur-Vire in Normandy, France. In 1641, during the reign of Honoré II, Monaco had become a French protectorate, and the Princes of Monaco became vassals of the Kings of France while remaining sovereign princes. Many successive Princes of Monaco and their families spent most of their lives in France and intermarried with French and Italian noble families.\n\nHonoré III arranged a marriage for his son Honoré (IV) to Louise d’Aumont, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the only child of Louis Marie Guy d’Aumont de Rochebaron, Duke of Aumont (1732 – 1799) and Louise-Jeanne de Durfort, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye (1735 – 1781). Through her mother, Louise was the great-great-great-granddaughter of Hortense Mancini, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the mistress of King Charles II of England, and one of the two heirs of her uncle Cardinal Jules Mazarin, the First Minister of King Louis XIV of France. Louise was the heir of Hortense Mancini’s titles and the Mazarin family wealth. Therefore, a marriage to Louise came with a large dowry and the prospect of a fortune. Honoré (IV) and Louise married on July 15, 1777.\n\nThe marriage did produce two sons, both Sovereign Princes of Monaco:\n\nThe French Revolution had dire consequences for the Grimaldi family. In January 1793, Honoré III, Prince of Monaco was officially declared deposed and the Principality of Monaco was annexed by France. The members of the former ruling Grimaldi dynasty lost all aristocratic privileges in France, were dispossessed of their French property, and became French citizens. During the Reign of Terror, in September 1793, Honoré (IV), his wife Louise, their son Florestan, and Honoré (IV)’s father Honoré III were arrested and imprisoned in Paris as enemies of the people. Louise and her son Florestan were rescued by a family doctor who forged release papers and then hid them in his home until the Reign of Terror was over. The wife of Honoré IV’s brother Joseph was not as lucky. Joseph spent most of his time abroad negotiating foreign loans which made him a suspect of counter-revolutionary activities. When Joseph did become involved in a counter-revolution, his wife Marie Thérèse was arrested in the absence of her husband, condemned to death, and guillotined in 1794, one of the last victims before the end of the Reign of Terror.\n\nIn October 1794, Honoré III and Honoré (IV) were released from prison. Honoré III never recovered from his imprisonment and died in Paris on March 21, 1795, at the age of 74, but his burial place is unknown. Honoré IV, whose chronic ill health had been worsened by imprisonment, would have become Prince of Monaco but Monaco was no longer a sovereign monarchy. However, Honoré IV’s family properties in France were returned to him but they were in poor condition and all of the contents were gone.\n\nIn 1794, while Honoré IV was still in prison, Louise had given birth to an illegitimate daughter Amélie Céleste Erodore d’Aumont. The father of the child is believed to have been Antoine de Montazet, Archbishop of Lyon. After Honoré IV’s release from prison, Louise and Honoré IV’s marriage became unhappy and the couple separated. In 1798, Louise divorced Honoré IV, giving Louise sole access to her fortune.\n\nIn 1804, Napoleon crowned himself Emperor of the French. Honoré IV could not adapt to the new French society and for the most part, remained an outsider. Because of a lack of funds, he needed to sell his family’s Paris and Normandy homes. Surprisingly, Honoré IV’s health improved and he joined the French Army. He was wounded during Napoleon’s Russian Campaign, lost the use of one arm, and was sent back to Paris.\n\nAfter Napoleon’s defeat in 1814 and the Bourbon Restoration which saw Louis XVIII, a younger brother of the beheaded King Louis XVI, become King of France, Florestan’s uncle Joseph petitioned King Louis XVIII to restore the Principality of Monaco to the Grimaldi family. Florestan’s father Honoré IV finally became Sovereign Prince of Monaco in 1814. The independence of Monaco lasted for only one year. In 1815, the Congress of Vienna, an international diplomatic conference that reconstituted the European political order after the downfall of Napoleon I, declared that Monaco would be a protectorate of the Kingdom of Sardinia.\n\nBy the time Honoré IV became the Sovereign Prince of Monaco, his physical condition had worsened and he was now paralyzed on one side of his body. Because of his condition, a regency was established to rule in his name. Honoré IV’s brother Joseph was regent from 1814 -1815 and then Florestan’s brother Honoré V served as regent until his father’s death in 1819 when he succeeded him as Honoré V, Prince of Monaco.\n\nHonoré IV, Prince of Monaco died in Paris, France on February 16, 1819, aged 60. He was buried at the Church of Saint Nicholas in Monaco. During the late 19th century, a new and larger church, the Cathedral of Monaco, was built on the site of the Church of Saint Nicholas. The original church was demolished in 1874 but the current cathedral was built over the areas of the previous church and the old burial site so that the sovereign princes and consorts originally buried at the Church of Saint Nicholas are now buried in the Cathedral of Monaco.\n\nThis article is the intellectual property of Unofficial Royalty and is NOT TO BE COPIED, EDITED, OR POSTED IN ANY FORM ON ANOTHER WEBSITE under any circumstances. It is permissible to use a link that directs to Unofficial Royalty.\n\nWorks Cited\n\nEdwards, Anne, 2017. The Grimaldis of Monaco . Blue Ridge Summit: Lyons Press.\n\n. Blue Ridge Summit: Lyons Press. En.wikipedia.org. 2022. Honoré IV, Prince of Monaco – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022]. En.wikipedia.org. 2022. Louise d’Aumont – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Honoré III, Prince of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Maria Caterina Brignole, Princess of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Honoré IV (prince de Monaco) — Wikipédia . [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022].\n\n. [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Louise d’Aumont — Wikipédia. [online] Available at: <https://fr.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]."}, {"url": "https://dbpedia.org/page/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "أونوريه الرابع هو سياسي فرنسي، ولد في 17 مايو 1758 في باريس في فرنسا، وتوفي بنفس المكان في 16 فبراير 1819. انتخب Pair of France ‏. (ar)\n\nHonoré IV. von Monaco (* 17. Mai 1758; † 16. Februar 1819) war von 1814 bis zu seinem Tod regierender Fürst von Monaco. Honoré war der ältere Sohn des Fürsten Honoré III. und dessen Gemahlin Marie Catherine de Brignole Sale. Er war seit 1777 verheiratet mit Louise d’Aumont Mazarin, Herzogin von Mazarin (1759–1829) und hatte mit dieser zwei Söhne, die nacheinander regierenden Fürsten Honoré V. und Florestan I. Nach dem französischen Annexionsbeschluss 1793 war er teils unter harten materiellen Bedingungen in einem Kerker in Paris inhaftiert, ehe er mit der Restauration 1814 gesundheitlich angeschlagen die Gelegenheit bekam, als Erbe seines Vaters die Herrschaft über Monaco anzutreten. (de)\n\nΟ Ονώριος Δ΄ (γαλλικά: Honoré IV) ήταν ο Πρίγκιπας του Μονακό από τις 30 Μαΐου 1814 ως τις 16 Φεβρουαρίου 1819. Γονείς του ήταν ο Πρίγκιπας Ονώριος Γ΄ και η Γενοβέζα αριστοκράτισσα . Ο Ονώριος Δ΄ παντρεύτηκε την στις 15 Ιουλίου 1777 στο Παρίσι. Χώρισαν το 1798, αφού προηγουμένως είχαν αποκτήσει δύο γιους: 1. * τον Ονώριο (1778–1841) 2. * τον Φλορεστάνο (1785–1856) Ανέλαβε τα ηνία του Πριγκιπάτου του Μονακό στις 30 Μαΐου 1814, μετά τη λήξη της περιόδου της γαλλικής κατοχής (1793-1814). Κατά τη διάρκεια της γαλλικής κατοχής του Μονακό ο Πρίγκιπας Ονώριος είχε φυλακιστεί για πολλά χρόνια. Εξαιτίας αυτού ασθένησε και στα τελευταία του χρόνια κατέστη ανίκανος να κυβερνήσει. Έτσι, από το 1815 παραχώρησε τα καθήκοντά του στον αδελφό του και έπειτα στο γιο του Ονώριο Ε΄. (el)\n\nHonoré IV (Honoré Charles Anne Grimaldi; 17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 1814 to 16 February 1819. Because of his health, the state of affairs was managed by a regency of his brother Joseph Grimaldi, and his son Prince Honoré V. (en)\n\nHonorato IV, Príncipe de Mónaco (París, 17 de mayo de 1758 – París, 16 de febrero de 1819) fue Príncipe Soberano de Mónaco entre 1814 y 1819, luego de la Ocupación Francesa (1793 - 1814). Hijo de Honorato III y de su esposa, María Catalina Brignole Sale. Fue sucedido por su hijo mayor, el Príncipe Honorato. Recuperó el control del principado con ayuda exterior y pasó sus títulos a su hijo mayor, Honorato V. Se casó el 15 de julio de 1771 con , , de la cual se divorció en 1798. Tuvieron dos hijos, que reinaron a su vez: * Honorato V (1778-1841). * Florestán I (1785-1856). En materia de política exterior fue capaz de ganar el favor de Génova, secular opositor del dominio independiente del Principado de Mónaco, esto se logró con su madre, María Catalina Brignole Sale, proveniente de una poderosa familia que tenía entre sus miembros varios Dux de Génova. (es)\n\nHonoré IV, né le 17 mai 1758 à Paris et mort le 16 février 1819 dans la même ville, est prince souverain de Monaco du 30 mai 1814 au 16 février 1819, après la période d'occupation française (1793-1814). (fr)\n\nOnorato IV di Monaco (Parigi, 17 maggio 1758 – Monaco, 16 febbraio 1819) è stato Principe sovrano di Monaco dal 1814 fino al 1819. (it)\n\nオノレ4世（Honoré IV, 1758年5月17日 - 1819年2月16日）は、モナコ公（在位：1814年 - 1819年）。 (ja)\n\nHonorato IV, Príncipe de Mônaco (17 de Maio de 1758 - 16 de Fevereiro de 1819) foi o sexto príncipe soberano de Mônaco, tendo reinado entre 1795 até sua morte. Também havia sido o sexto . Honorato IV era filho de Honorato III, Príncipe de Mônaco e de Maria Catarina de Brignole. Em 1777, desposou Luísa Felícia Vitória de Aumont, Duquesa de Mazarino, com quem teve dois filhos: * Honorato V, Príncipe de Mônaco * Florestan I, Príncipe de Mônaco (pt)\n\nHonorius IV Karel Anna Maria Maurits Grimaldi (Monaco, 17 mei 1758 – Parijs, 16 februari 1819) was van 1814 tot 1819 vorst van Monaco. Hij was de zoon van prins Honorius III, die in de Franse Revolutie werd onteigend (1793) en in 1795 in gevangenschap stierf. Na de val van Napoleon in 1814 werd de onafhankelijkheid van Monaco door het Verdrag van Parijs hersteld. Honorius wilde vanwege zijn slechte gezondheid de macht overdragen aan zijn broer . Na protesten van zijn zoon Honorius Gabriël aanvaardde hij toch zelf de regering, hoewel het bestuur in feite door regenten werd gevoerd. Na de terugkeer van Napoleon werd Honorius IV gevangengenomen en voor de keizer gevoerd. Na 's keizers uiteindelijke val werd op het Congres van Wenen de soevereiniteit van Monaco opnieuw hersteld, nu echter als protectoraat van het Koninkrijk Sardinië. Honorius werd na zijn dood in 1819 opgevolgd door zijn zoon Honorius V. Uit zijn huwelijk met , hertogin de Mazarin et de la Meilleraye, werden twee kinderen geboren: * Honorius Gabriël (1778-1841), de latere vorst Honorius V; * Tancred Florestan Rogier Lodewijk (1785-1856), de latere vorst Florestan. (nl)\n\nHonore Grimaldi, książę Monako, książę Valentinois (ur. 17 maja 1758, zm. 16 lutego 1819 w Paryżu) – 7. książę Monako od 30 maja 1814 do 16 lutego 1819, syn księcia Honoriusza III Grimaldi i księżnej Marii de Brignole. (pl)\n\nHonoré IV av Monaco, född 17 maj 1758, död 16 februari 1819, var en monark (furste) av Monaco. Han var son till Honoré III av Monaco och Maria Caterina Brignole Sale. Han satt fängslad under franska revolutionen, men undgick avrättning. Monaco anslöts till Frankrike i mars 1793, och han blev därför inte furste vid sin fars död 1795. Efter Napoleons fall 1814 återupprättades furstendömet Monaco och han placerades på dess tron i enlighet med legitimitetsprincipen. Eftersom han var för sjuk för att kunna resa till Monaco och tillträda regeringen, insattes regenter i hans ställe; först hans bror Josef av Monaco, och från 1815 hans son Honoré V. (sv)\n\n奧諾雷四世（德語：Honoré IV，1758年5月17日－1819年2月16日），摩納哥親王，1814年至1819年在位。 (zh)\n\nОноре IV (фр. Honoré IV, 17 мая 1758, Париж — 16 февраля 1819, Париж) — шестой князь Монако, правивший в 1814—1819 годах. (ru)\n\nОноре IV (фр. Honoré IV; 17 травня 1758 — 16 лютого 1819) — шостий князь Монако, що правив в 1814—1819 роках. (uk)"}, {"url": "https://www.findagrave.com/memorial/7832651/honor%C3%A9_iv-of_monaco", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/", "page_content": "by Susan Flantzer\n\n© Unofficial Royalty 2022\n\nHonoré III, Prince of Monaco is the longest-reigning sovereign of Monaco but the French Revolution had dire consequences for his family and caused the Principality of Monaco to be annexed to France from 1793 until the defeat of Napoleon I, Emperor of the French in 1814. Honoré Camille Léonor Grimaldi was born on November 10, 1720, in Paris, France. He was the third of the nine children and the second but the eldest surviving of the six sons of Louise-Hippolyte, Sovereign Princess of Monaco for ten months before her death from smallpox, and Jacques I, briefly the Sovereign Prince of Monaco, born Jacques François Leonor Goyon de Matignon. Honoré’s maternal grandparents were Antonio I, Prince of Monaco and Marie of Lorraine. His paternal grandparents were the French nobles Jacques III Goyon de Matignon, Count of Thorigny, a Lieutenant General in the French army, (1644 – 1725) and Charlotte de Goyon de Matignon, Countess of Thorigny (1657 – 1721).\n\nHonoré III had eight siblings but only three survived to adulthood:\n\nAntoine-Charles, Marquis des Baux and Count de Matignon, (1717 – 1718), died in infancy\n\nCharlotte Thérèse Nathalie (1719 – 1790), a nun at the Convent of the Visitation in Paris, France\n\nCharles, Count de Carladés and Count de Matignon (1722 – 1749), unmarried, died from smallpox at the age of 27\n\nJacques (born and died 1723), died in infancy\n\nLouise Françoise, Mademoiselle des Baux (1724 – 1729), died in childhood\n\nFrançois-Charles, Count of Thorigny (1726 – 1743), died in his teens\n\nCharles-Maurice, Count de Valentinois (1727 – 1798), married Marie Christine Chrétienne de Rouvrois, no children\n\nMarie Françoise Thérése, Mademoiselle d’Estouteville (1728 – 1743), died in her teens\n\nIn 1641, during the reign of Honoré II, Monaco had become a French protectorate, and the Princes of Monaco became vassals of the Kings of France while remaining sovereign princes. Many successive Princes of Monaco and their families spent most of their lives in France and intermarried with French and Italian noble families.\n\nHonoré III’s parents Louise-Hippolyte and Jacques; Credit – Wikipedia\n\nBecause of the poor relationship of his maternal grandparents, Honoré III’s parents Louise-Hippolyte and Jacques decided to live in France. They spent their time between Jacques’ mansion in Paris, the Hôtel de Matignon, now the official residence of the Prime Minister of France, and Torigni-sur-Vire in Normandy, France where the de Goyon de Matignon family chateau, Château des Matignon, was located. Honoré was mostly raised at the French court under the supervision of Anne Louise Bénédicte de Bourbon, Duchess of Maine, the wife of Louis-Auguste de Bourbon, Duke of Maine, King Louis XIV’s legitimized son by his official mistress Françoise-Athénaïs de Rochechouart de Mortemart, Marquise of Montespan.\n\nOn February 20, 1731, Honoré III’s maternal grandfather Antonio I, Prince of Monaco died and his mother Louise-Hippolyte was now the Sovereign Princess of Monaco. Louise-Hippolyte had a very short reign of ten months. Several weeks before Christmas of 1731, a smallpox epidemic spread through the Mediterranean coastal areas. Louise-Hippolyte died from smallpox at the age of 34, on December 29, 1731.\n\nUpon Louise-Hippolyte’s death, her husband Jacques was now the legal guardian of their ten-year-old eldest son Honoré and had a plan. Jacques should rule as Prince of Monaco until Honoré reached his twenty-fifth birthday. At that time, Honoré would abdicate in favor of his father following the example of sons who gave up to their fathers land they had inherited through their mothers. Although the plan was initially accepted, it met with increasing opposition.\n\nFinally, in May 1732, Jacques handed over the rule of Monaco to his brother-in-law Antonio Grimaldi, Chevalier de Grimaldi, an illegitimate son of Antonio I, Prince of Monaco. Jacques’ official abdication date was November 7, 1733, but he had long since returned to Paris with his eldest son who was now technically Honoré III, Prince of Monaco. Antonio Grimaldi, Chevalier de Grimaldi became Governor-General of Monaco, was the de facto ruler of Monaco from 1732 until he died in 1784, and ably served as regent for more than fifty years for his nephew Honoré III. Honoré resided at his father’s Paris home the Hôtel de Matignon and spent much time at the French court at the Palace of Versailles. His father Jacques lived the remainder of his life in France, dying aged 61, on April 23, 1751, at his Paris home, the Hôtel de Matignon.\n\nAs Colonel of the Regiment of Monaco, part of the French army, Honoré III took part in the War of the Austrian Succession (1740 – 1748) and was wounded at the 1746 Battle of Rocoux and then at the 1747 Battle of Lawfeld. Honoré had close ties to the French kings Louis XV and Louis XVI. In 1756, Honoré decreed that Monaco would be ceded to the King of France if the Grimaldi dynasty was to die out.\n\nOver the years, Honoré III had declined many marriage proposals. In 1755, a marriage was proposed between 35-year-old Honoré and 18-year-old Maria Caterina Brignole, daughter of Giuseppe Brignole, Marquis di Groppoli, the Ambassador to France from the Republic of Genoa, now in Italy, and Maria Anna Balbi. Maria Caterina’s parents came from two of the most powerful families in the Republic of Genoa. Her paternal grandfather Anton Giulio Brignole Sale, 5th Marquis of Groppoli had been Ambassador of the Republic of Genoa to France. Two of her paternal uncles were Doges of the Republic of Genoa. Maria Caterina’s maternal grandfather Francesco Maria Balbi also had been a Doge of the Republic of Genoa.\n\nHonoré III had previously been the lover of Maria Caterina’s mother but wished to marry to provide an heir to the throne of Monaco. However, Maria Caterina’s father opposed the marriage because of Honoré’s bad reputation and because of his fear that Honoré might inherit his fortune. In 1756, only after the intervention of King Louis XV of France and his mistress Madame de Pompadour did Maria Caternina’s father consent to the marriage.\n\nThe wedding of Honoré III and Maria Caterina was to occur on July 5, 1757, in Monaco, and it got off on a bad foot. Maria Caterina traveled to Monaco by boat accompanied by a contingent of Genovese nobility. When they arrived, Honoré did not come aboard the ship to welcome his bride. He said his status as a monarch demanded that Maria Caterina come to him. The Genovese contingent refused, saying that Maria Caterina was a member of a ruling family of the Republic of Genoa. The ship was stranded offshore for several days while a bridge was built between the port and Maria Caterina’s ship. Honoré and Maria Caterina walked towards each other at the same distance and met each other over the sea.\n\nHonoré III and Maria Caterina had two sons:\n\nHonoré III and Maria Caterina initially lived in Monaco but by 1760, Honoré was dissatisfied with his life there, and returned to France without his wife, spending time with his mistresses at his French homes. Eventually, Maria Caterina was allowed to come to France. However, Honoré continued his affairs and Maria Caterina began an affair, that would become long-term, with Louis Joseph de Bourbon, Prince of Condé. In 1770, Louis Joseph used his influence to obtain a legal separation for Maria Caterina from Honoré and the right to manage her own finances. Honoré finally realized his relationship with Maria Caterina was over and eventually accepted Maria Caterina’s relationship with Louis Joseph de Bourbon, Prince of Condé. Three years after Honoré’s death, Maria Caterina and Louis Joseph were married but their marriage was kept secret for ten years.\n\nThe French Revolution had dire consequences for Honoré III and his family. The Grimaldi family lost all aristocratic privileges in France and was dispossessed of their French property. In January 1793, Honoré III was officially declared deposed and the Principality of Monaco was annexed by France. During the Reign of Terror, in September 1793, Honoré III was arrested and imprisoned in Paris. Honoré III’s son Honoré (IV) was also arrested as were Honoré (IV)’s wife Louise d’Aumont and his son Florestan. Honoré (IV) was released after fifteen months in prison and his wife and son were saved by their family doctor.\n\nThe last victims of the Reign of Terror on their way to the guillotine – Among them was Honoré III’s daughter-in-law Marie Thérèse de Choiseul\n\nThe wife of Honoré III’s other son Joseph was not as lucky. Joseph spent most of his time abroad negotiating foreign loans which made him a suspect of counter-revolutionary activities. Joseph did become involved in a counter-revolution in Vendée. His wife Marie Thérèse was arrested in the absence of her husband, condemned to death, and guillotined in 1794, one of the last victims before the end of the Reign of Terror.\n\nHonoré III was eventually released from prison. He died soon afterward in Paris on March 21, 1795, at the age of 74, but his burial place is unknown. At 59 years, the reign of Honoré III remains the longest in the history of Monaco. Following the defeat of Napoleon I, Emperor of the French in 1814, Honoré III’s son Honoré IV, aged 56 and in ill health since his imprisonment during the Reign of Terror, returned to Monaco where he reigned as Sovereign Prince until his death in 1819.\n\nThis article is the intellectual property of Unofficial Royalty and is NOT TO BE COPIED, EDITED, OR POSTED IN ANY FORM ON ANOTHER WEBSITE under any circumstances. It is permissible to use a link that directs to Unofficial Royalty.\n\nWorks Cited\n\nDe.wikipedia.org. 2022. Honoré III. (Monaco) – Wikipedia . [online] Available at: <https://de.wikipedia.org/wiki/Honor%C3%A9_III._(Monaco)> [Accessed 8 March 2022].\n\n. [online] Available at: <https://de.wikipedia.org/wiki/Honor%C3%A9_III._(Monaco)> [Accessed 8 March 2022]. Edwards, Anne, 2017. The Grimaldis of Monaco . Blue Ridge Summit: Lyons Press.\n\n. Blue Ridge Summit: Lyons Press. En.wikipedia.org. 2022. Honoré III, Prince of Monaco – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_III,_Prince_of_Monaco> [Accessed 8 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_III,_Prince_of_Monaco> [Accessed 8 March 2022]. En.wikipedia.org. 2022. Maria Caterina Brignole – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Maria_Caterina_Brignole> [Accessed 8 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Maria_Caterina_Brignole> [Accessed 8 March 2022]. Flantzer, Susan, 2022. Jacques I, Prince of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/jacques-i-prince-of-monaco/> [Accessed 8 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/jacques-i-prince-of-monaco/> [Accessed 8 March 2022]. Fr.wikipedia.org. 2022. Honoré III (prince de Monaco) — Wikipédia. [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_III_(prince_de_Monaco)> [Accessed 8 March 2022]."}, {"url": "http://cn.worldheritage.org/articles/Honor%C3%A9_III,_Prince_of_Monaco", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-v-a-brilliant-officer-and-an-unlucky-sovereign/", "page_content": "The eldest son of Prince Honoré IV was so eager for power that he declared himself a ruler against the will of his father. Tough and authoritarian, accustomed to military discipline from his youth, he made important economic decisions alone but failed to make the country prosperous and failed to make its population rich and happy. In fairness, we note that the Prince sincerely did his best.\n\nMilitary service for France\n\nPrince Honoré-Gabriel, the eldest son of Prince Honoré IV of Monaco and Princess Louise Felicite Victoire d’Aumont, was born in Paris on May 14, 1778. He enlisted in a French cavalry regiment when he was 20 years old and worked his way up through the ranks by his own merits until he became an officer on the staff of Marshal Grouchy. He was an exemplary soldier and was cited for his bravery many times. Being wounded in the arm he couldn’t take part in the action at Austerlitz (1805) but did serve with great distinction at the battle of Jena (1806) with Marshal Murat’s cavalry corps. Marshal Grouchy recommended him for the star of the Legion of Honour, relating that the Prince had taken a handful of cavalry and forced the surrender of an entire enemy battalion.\n\nIn April 1814, Napoleon Bonaparte abdicated the throne and was sent into exile on the island of Elba. The restored King Louis XVIII of France himself then also restored the Grimaldis to their places in the French nobility. Therefore, after the restoration of 1814, Honoré-Gabriel was also named member of the House of Peers by King Louis XVIII. But many were afraid that Monegasque independence would not be secure or that the Principality might be annexed by the Kingdom of Piedmont-Sardinia. Thanks to Prince Talleyrand, however, a clause was inserted into the Treaty of Paris to put Monaco securely back in order and independent.\n\nReturn to Monaco and meeting with Napoleon\n\nHonoré IV was unable to return to Monaco because of his poor health and so appointed his brother Joseph to rule on his behalf. But Honoré-Gabriel didn’t like that idea and he protested fiercely about this and after some struggle he was himself appointed to govern Monaco.\n\nIn March, 1815 on his way to Monaco he met with his old commander Napoleon who was on his way to Paris to seize power at the start of the 100 days. “Where are you going?”, Napoleon asked. “Going home, to Monaco”, Honoré-Gabriel answered. “Me too, I’m going home, to the Tuileries,” Napoleon said. When Napoleon attempted to restore his empire during the 100 days Monaco was occupied by British troops and so the Grimaldis played no part in the affair.\n\nDifficult years of reign\n\nIn 1819, when his father passed away, Honoré-Gabriel became the Sovereign Prince of Monaco as Honoré V and inherited a Principality beset with problems. At the same time being both a member of the French Parliament and the Sovereign of Monaco, he picked up on the project of his grandfather to diversify economic resources and encouraged the installation of factories. The Great Powers of Europe had taken Monaco out of the French sphere of influence and made the Principality a protectorate of Piedmont-Sardinia. The government in Turin closed the tobacco plant that Honoré III had established and enforced a number of other changes that had left Monaco impoverished.\n\nHonoré V went to Turin to try to reason with the King of Piedmont-Sardinia but, although he was treated with great honour and respect, none of his grievances were addressed. Honoré V also had to raise taxes considerably which made him increasingly unpopular. His granting of a monopoly on flour caused a bread shortage but no one had the nerve to voice opposition to him. He also pushed opportunities for tourism. However, the lack of a market for local products, the omnipresence of the State and the lack of presence of the Sovereign created tensions, especially in Menton. The Sovereign ended up pacifying Menton before going forward with his effort to provide the Principality with amenities. By his own admission he “desired to do good” but “did not manage to”, despite his philanthropic ideals.\n\nWhen liberal movements began to oppose the counter revolutionary tide of post-Napoleonic Europe some in Monaco thought of joining in but Sardinian troops arrived to crush the potential rebellion in its infancy.\n\nUnjust dislike\n\nHistory has tended to record Prince Honoré V as a very unpopular and autocratic monarch, but, in reality he was quite progressive. He sincerely wished to help his people and had great sympathy for the poor. His reaction to seeing beggars on the streets was to form state-owned industries and put them to work. Some of the industries he set up included a lace factory and a hat factory. He also had them put to work on farm cooperatives as citrus orchards had long been a large part of the Monegasque economy. All of this has led some people to regard Prince Honoré V as a sort of socialist, though he probably would not have seen it that way.\n\nBut all efforts to save the economy did not make Monegasques appreciate their Prince. Honoré V of Monaco died on October 2, 1841 in Paris and remained in the history of the country as an authoritarian ruler who did not trust anyone, including family members, and made decisions alone. As he was not married and had no children the Monegasque throne passed to his poet-actor brother Florestan."}], "Honoré IV's mother was Maria Caterina Brignole.": [{"url": "https://www.wikiwand.com/en/Maria_Caterina_Brignole", "page_content": "Maria Caterina Brignole (or Marie-Christine de Brignole;[2] 7 October 1737 – 18 March 1813) was Princess consort of Monaco by marriage to Honoré III, Prince of Monaco.\n\nPrincess of Condé\n\nQuick facts: Maria Caterina Brignole, Princess consort of ... ▼\n\nMaria Caterina Brignole de Sale, principessa di Monaco\n\nCoat of arms of Maria Caterina as Princess of Monaco\n\nShe separated from her husband in 1770: he died in 1795, and in 1798 she married Louis Joseph de Bourbon, Prince de Condé."}, {"url": "https://infogalactic.com/info/Maria_Caterina_Brignole", "page_content": "From Infogalactic: the planetary knowledge core\n\nMaria Caterina Brignole (or Marie-Christine de Brignole;[2] 7 October 1737 – 18 March 1813) was the daughter of a Genovese nobleman. On 5 June 1757 she married Honoré III, Prince of Monaco.\n\nHer husband died in 1795, and in 1798 she married Louis Joseph de Bourbon, Prince de Condé, a French prince du sang.\n\nBackground\n\nMaria Caterina was the daughter of Giuseppe Maria Brignole Sale, 7th Marchese di Groppoli, of a family whose members had occupied the position of doge in the Republic of Genoa, and Maria Anna Balbi, daughter of a doge of Genoa. As her father was the Genovese ambassador to France, Maria Caterina and her mother frequented the salons of Paris and the royal court of Versailles. Her biographer, Philippe Paul, comte de Ségur, called Maria Caterina \"the most beautiful woman in France\".[citation needed]\n\nMaria Caterina fell in love with the Prince de Condé, Louis Joseph de Bourbon,[citation needed] In 1755, however, her mother proposed a marriage between Maria Caterina and her own former lover, Honoré III of Monaco.[citation needed]\n\nThe family wanted to raise its status and forestall a marriage for Honoré arranged by the French court and designed to further French influence in Monaco.[citation needed] Honoré had declined many marriage proposals but was willing to marry Maria Caterina because of her beauty and dowry and soon seduced her.[citation needed] Her father, however, disagreed because of the bad reputation of Prince Honoré as well as the prospect of the prince inheriting his fortune. He relented only after intervention by Louis XV and Madame de Pompadour, giving his consent in 1757.[citation needed]\n\nPrincess of Monaco\n\nMaria Caterina came to Monaco by boat accompanied by a suite of the Genovese nobility. When they arrived, however, Prince Honoré did not come aboard the ship to welcome his bride. When they asked him to do so, he replied that his status as a monarch demanded that she come to him instead. The Genovese entourage answered that Maria Caterina was a member of a ruling family of the Republic of Genoa and refused to do so.[citation needed] The ship was therefore stranded offshore for several days, until the predicament was resolved by the couple meeting halfway on a bridge between the boat and the shore.\n\nThe relationship was at first amicable, and the couple had two sons, Honoré IV, Prince of Monaco (born 17 May 1758) and Prince Joseph (born in 1767). Maria Caterina lived in Matignon, where she spent her days with the Prince de Condé, and seldom took part in court life. Honoré became more and more jealous, and demanded that she write down her thoughts for him. Once, she was alone for several hours with a handsome nobleman, who helped her to open a cupboard which had been stuck. After this incident, the jealousy of her husband worsened to the point where it was no longer endurable.[citation needed]\n\nIn the meantime the Prince de Condé's wife, Charlotte de Rohan, whom he had married in 1753, died in 1760, and as time passed his relationship with Maria Caterina became more serious. By 1769 she had begun to set up a home in the Hôtel de Lassay, an annex of the Prince de Condé's primary residence in Paris, the Palais-Bourbon.[3] In 1770 her jealous spouse ordered the borders of Monaco closed in an attempt to prevent her from escaping. That same night, she went out on the balcony and did not return. It was discovered that she had managed to cross into France and had travelled all the way to Le Mans to the southwest of Paris where she had taken refuge in a nearby convent. Eventually she was able to return to Paris.\n\nDue to Maria Caterina's illicit position as Condé's mistress, the new French queen, 18-year-old Marie Antoinette, offended Condé by treating Maria Caterina poorly at court.[citation needed] But around that time (1774) Condé and Maria Caterina began the construction of the Hôtel de Monaco, to be her permanent home in Paris. It was in the rue Saint-Dominique, near the Palais Bourbon, and was completed in 1777.[3] Honoré finally realized his relationship with Maria Caterina was completely finished and turned his attention to his own lovers. Maria Caterina wrote to her spouse that the marriage could be summarised by three words: greed, bravery, and jealousy.[citation needed]\n\nLater life\n\nMaria lived with Condé in France until the French revolution, when the couple left for Germany and then Great Britain. In 1795 Prince Honoré died, and on 24 October 1798 she and the prince de Condé were married in London.[4][5] The marriage was kept secret for a decade, the couple reportedly only becoming openly known as husband and wife as of 26 December 1808.[4]\n\nThe prince was the leader of the Condé army of émigrés. She used her great fortune to help finance the exiled French community's armed resistance.\n\nShe died in Wimbledon.\n\nAncestry\n\nFamily of Maria Caterina Brignole 16. Antonio Giulio Brignole Sale, 2nd Marchese di Groppoli 8. Giovanni Francesco Brignole Sale, 4th Marchese di Groppoli 17. Paola Maria Adorno 4. Anton Giulio Brignole Sale, 5th Marchese di Groppoli 18. Giuseppe Maria Durazzo 9. Maria Anna Durazzo 19. Francesca Balbi 2. Giuseppe Maria Brignole Sale, 7th Marchese di Groppoli 20. Giovanni Battista Brignole Sale 10. Giovanni Giacomo Brignole Sale 21. Isabella Raggi 5. Isabella Brignole Sale 22. Angelo Pallavicini, Doge of Genoa 11. Lucrezia Pallavicini 23. Anna Raggi 1. Maria Caterina Brignole 24. Francesco Balbi 12. Giacomo Balbi 25. Barbara Airoli 6. Francesco Maria Balbi, Doge of Genoa 26. Antonio Pinelli 13. Olimpia Pinelli 27. 3. Maria Anna Balbi 28. Giovanni Domenico Durazzo 14. Giovanni Agostino Durazzo 29. Maria Chiavari 7. Maria Clarice Durazzo 30. Napoleone Spinola 15. Maddalena Spinola 31. Agata Girolama Brignole Sale\n\nReferences\n\n↑ Lua error in package.lua at line 80: module 'strict' not found. ↑ Lua error in package.lua at line 80: module 'strict' not found. 3.0 3.1 Braham (1980), p. 215. 4.0 4.1 Lua error in package.lua at line 80: module 'strict' not found. ↑ The Royalty, peerage and aristocracy of the world, Vol 90\n\nSources\n\nThis page is a translation of its French equivalent unless otherwise noted.\n\nBraham, Allan (1980). The architecture of the French enlightenment, pp. 210–219. Berkeley, California: University of California Press. ISBN 978-0-520-04117-2. Limited view at Google Books."}, {"url": "https://dbpedia.org/page/Maria_Caterina_Brignole", "page_content": "dbo: abstract Marie Kateřina Brignole (7. října 1737, Palazzo Rosso – 18. března 1813, Londýn) byla sňatkem s monackou kněžnou. Její manžel v roce 1795 zemřel a ona se v roce 1798 podruhé provdala za Ludvíka Josefa Bourbona, knížete z Condé. (cs)\n\nΗ Μαρία-Αικατερίνη, ιταλ. Maria Caterina Brignole (7 Οκτωβρίου 1737 - 18 Μαρτίου 1813) από τον Οίκο του Μπρίνιολε ήταν κόρη Γενουάτη ευγενούς, του μαρκησίου του Γκρόπολι και με τους γάμους της έγινε πρώτα πριγκίπισσα του Μονακό και μετά πριγκίπισσα του Κονντέ. (el)\n\nMarie Catherine Brignole (* 7. Oktober 1737 in Genua; † 18. März 1813 in Wimbledon) war Fürstin von Monaco sowie Fürstin Condé. (de)\n\nMarie-Catherine Brignole, née le 7 octobre 1737 à Gênes et morte le 18 mars 1813 à Wimbledon, est une princesse de Monaco par son mariage avec le prince Honoré III en 1757 et une princesse de Condé par son remariage avec Louis Joseph de Bourbon en 1798. (fr)\n\nMaria Caterina Brignole (or Marie-Christine de Brignole; 7 October 1737 – 18 March 1813) was Princess consort of Monaco by marriage to Honoré III, Prince of Monaco. She separated from her husband in 1770: he died in 1795, and in 1798 she married Louis Joseph de Bourbon, Prince de Condé. (en)\n\nMaría Catalina Brignole (Génova, 7 de octubre de 1737 - Wimbledon, 18 de marzo de 1813) fue por nacimiento una noble genovesa. El 5 de junio de 1757 se convirtió en princesa de Mónaco, al casarse con Honorato III, príncipe de Mónaco. Su marido falleció en 1795, y en 1798 se casó en segundas nupcias con el noble francés Luis José de Borbón-Condé, príncipe de Condé, y se convirtió en la princesa de Condé y por lo tanto miembro de la familia real francesa. (es)\n\nMaria Caterina Brignole Sale (Genova, 7 ottobre 1737 – Wimbledon, 18 marzo 1813) era la figlia di un nobiluomo genovese. Il 5 giugno 1757 sposò Onorato III, Principe di Monaco diventando principessa di Monaco. Suo marito morì nel 1795 e nel 1798 sposò Luigi Giuseppe, principe di Condé della Casa Reale di Francia.. (it)\n\nマリーア・カテリーナ・ブリニョーレ・サーレ（Maria Caterina Brignole Sale, 1737年10月7日 - 1813年3月18日）は、モナコ公オノレ3世の妻。フランス語名はマリー＝カトリーヌ（Marie-Catherine Brignole）。フランス王族のコンデ公ルイ・ジョゼフの長年の愛人であり、モナコ公と死別後、コンデ公と再婚した。 (ja)\n\nMaria Caterina Brignole, księżna Monako, księżna de Condé (ur. 7 października 1737 w Genui, zm. 18 marca 1813 w Wimbledonie, Londyn), włoska artystokratka, od 5 czerwca 1757 do 9 stycznia 1771 księżna Monako jako żona księcia Honoriusza III, od 24 października 1798 do 18 marca 1813 księżna de Condé jako żona księcia Ludwika V Burbona. (pl)\n\nМария Катерина Бриньоле-Сале (7 октября 1737, Генуя — 18 марта 1813, Wimbledon House[d]) — представительница рода Бриньоле, княгиня Монако , супруга князя Оноре III. После смерти супруга в 1795 году она вышла замуж за Людовика-Жозефа де Бурбона, принца Конде. (ru)\n\nMaria Catarina Brignole-Sale (Italienska: Maria Caterina Brignole, Franska: Marie-Catherine de Brignole), född 7 oktober 1737, död 18 mars 1813, furstinna av Monaco, gift med furst Honoré III av Monaco. (sv)\n\nMaria Catarina Brignole (Palazzo Rosso, 7 de outubro de 1737 — Wimbledon, 18 de março de 1813), foi princesa consorte de Mônaco como esposa de Honorato III, Príncipe de Mônaco. Após o divórcio, tornou-se princesa de Condé como esposa de Luís José de Bourbon. (pt)\n\ndbo: title Princess of Condé (en)\n\ndbp: as prince consort (en)\n\ndbp: burialPlace St Aloysius Church, Somers Town, London (en)\n\ndbp: deathPlace Wimbledon House, Wimbledon, London (en)\n\ndbp: fullName Maria Caterina Brignole Sale (en)\n\ndbp: mother Maria Anna Balbi (en)\n\ndbp: name Maria Caterina Brignole (en)\n\nrdfs: comment Marie Kateřina Brignole (7. října 1737, Palazzo Rosso – 18. března 1813, Londýn) byla sňatkem s monackou kněžnou. Její manžel v roce 1795 zemřel a ona se v roce 1798 podruhé provdala za Ludvíka Josefa Bourbona, knížete z Condé. (cs)\n\nΗ Μαρία-Αικατερίνη, ιταλ. Maria Caterina Brignole (7 Οκτωβρίου 1737 - 18 Μαρτίου 1813) από τον Οίκο του Μπρίνιολε ήταν κόρη Γενουάτη ευγενούς, του μαρκησίου του Γκρόπολι και με τους γάμους της έγινε πρώτα πριγκίπισσα του Μονακό και μετά πριγκίπισσα του Κονντέ. (el)\n\nMarie Catherine Brignole (* 7. Oktober 1737 in Genua; † 18. März 1813 in Wimbledon) war Fürstin von Monaco sowie Fürstin Condé. (de)\n\nMarie-Catherine Brignole, née le 7 octobre 1737 à Gênes et morte le 18 mars 1813 à Wimbledon, est une princesse de Monaco par son mariage avec le prince Honoré III en 1757 et une princesse de Condé par son remariage avec Louis Joseph de Bourbon en 1798. (fr)\n\nMaria Caterina Brignole (or Marie-Christine de Brignole; 7 October 1737 – 18 March 1813) was Princess consort of Monaco by marriage to Honoré III, Prince of Monaco. She separated from her husband in 1770: he died in 1795, and in 1798 she married Louis Joseph de Bourbon, Prince de Condé. (en)\n\nMaría Catalina Brignole (Génova, 7 de octubre de 1737 - Wimbledon, 18 de marzo de 1813) fue por nacimiento una noble genovesa. El 5 de junio de 1757 se convirtió en princesa de Mónaco, al casarse con Honorato III, príncipe de Mónaco. Su marido falleció en 1795, y en 1798 se casó en segundas nupcias con el noble francés Luis José de Borbón-Condé, príncipe de Condé, y se convirtió en la princesa de Condé y por lo tanto miembro de la familia real francesa. (es)\n\nMaria Caterina Brignole Sale (Genova, 7 ottobre 1737 – Wimbledon, 18 marzo 1813) era la figlia di un nobiluomo genovese. Il 5 giugno 1757 sposò Onorato III, Principe di Monaco diventando principessa di Monaco. Suo marito morì nel 1795 e nel 1798 sposò Luigi Giuseppe, principe di Condé della Casa Reale di Francia.. (it)\n\nマリーア・カテリーナ・ブリニョーレ・サーレ（Maria Caterina Brignole Sale, 1737年10月7日 - 1813年3月18日）は、モナコ公オノレ3世の妻。フランス語名はマリー＝カトリーヌ（Marie-Catherine Brignole）。フランス王族のコンデ公ルイ・ジョゼフの長年の愛人であり、モナコ公と死別後、コンデ公と再婚した。 (ja)\n\nMaria Caterina Brignole, księżna Monako, księżna de Condé (ur. 7 października 1737 w Genui, zm. 18 marca 1813 w Wimbledonie, Londyn), włoska artystokratka, od 5 czerwca 1757 do 9 stycznia 1771 księżna Monako jako żona księcia Honoriusza III, od 24 października 1798 do 18 marca 1813 księżna de Condé jako żona księcia Ludwika V Burbona. (pl)\n\nМария Катерина Бриньоле-Сале (7 октября 1737, Генуя — 18 марта 1813, Wimbledon House[d]) — представительница рода Бриньоле, княгиня Монако , супруга князя Оноре III. После смерти супруга в 1795 году она вышла замуж за Людовика-Жозефа де Бурбона, принца Конде. (ru)\n\nMaria Catarina Brignole-Sale (Italienska: Maria Caterina Brignole, Franska: Marie-Catherine de Brignole), född 7 oktober 1737, död 18 mars 1813, furstinna av Monaco, gift med furst Honoré III av Monaco. (sv)\n\nMaria Catarina Brignole (Palazzo Rosso, 7 de outubro de 1737 — Wimbledon, 18 de março de 1813), foi princesa consorte de Mônaco como esposa de Honorato III, Príncipe de Mônaco. Após o divórcio, tornou-se princesa de Condé como esposa de Luís José de Bourbon. (pt)\n\nrdfs: label Marie Kateřina Brignole (cs)\n\nMarie Catherine Brignole (de)\n\nΜαρία Αικατερίνη Μπρίνιολε (el)\n\nMaría Catalina Brignole Sale (es)\n\nMarie-Catherine Brignole (fr)\n\nMaria Caterina Brignole Sale (it)\n\nマリーア・カテリーナ・ブリニョーレ・サーレ (ja)\n\nMaria Caterina Brignole (en)\n\nMaria Burbon (księżna de Condé) (pl)\n\nMaria Catarina Brignole (pt)\n\nБриньоле-Сале, Мария Катерина (ru)\n\nMaria Caterina Brignole Sale (sv)"}, {"url": "http://worldheritage.org/articles/Maria_Caterina_Brignole", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://www.historyofroyalwomen.com/maria-caterina-brignole/princesses-consort-monaco-maria-caterina-brignole/", "page_content": "Maria Caterina Brignole was born on 7 October 1737 as the daughter of Giuseppe Maria Brignole Sale, 7th Marchese di Groppoli and Maria Anna Balbi. Her father was the Genovese ambassador to France, and so Maria Caterina and her mother regularly attended Versailles and the salons of Paris.\n\nMaria Caterina fell in love with Louis-Joseph de Bourbon, Prince de Condé, but by 1755 her mother proposed a marriage between her daughter and a former lover of her own, Prince Honoré III of Monaco. Maria Anna and Prince Honoré had a passionate love affair for several years, but as Maria Anna began to age (she was already ten years older than her lover), Prince Honoré began to notice her fifteen-year-old daughter. By then, Maria Caterina was a “well-developed beauty of fifteen with a handsome widow’s peak, wide, dark eyes, a bewitching smile, full bosom and a slim waist.” Maria Caterina was obviously not hindered by the fact that he had been her mother’s lover as she wrote him, “I, the undersigned, declare and promise to the Prince de Monaco never to marry anyone but him, whatever may happen and never to listen to any proposal that might tend to release me.”\n\nMaria Caterina’s father was less than amused, and Prince Honoré pressured him for several months to no avail. Instead, he opened discussions with the Duke de la Vallière. He eventually relented after intervention by King Louis XV and Madame de Pompadour. The couple were married by proxy on 15 June 1757, and by then they had not seen each other for two years. When her ship finally arrived at the harbour in Monaco, Maria Caterina did not disembark. Finally, a note was sent to the waiting Prince from Maria Caterina’s mother informing him that “conscious of her birth and rank” Prince Honoré should board the ship to greet his new wife, instead of Maria Caterina disembarking to greet him. Prince Honoré insisted that as a sovereign prince, his rank was greater than hers and that she must be the one to advance first. The gangplank was raised.\n\nAfter six days, an agreement was reached. “This was to make a bridge out from the Condamine landing-stage to join one let down from their boat. The next day…a general post was sounded, we all took up our positions for the great event, the fleet arrived in the harbour, the palace guns fired a salute, the galley drew near our bridge and started to lower another, as had been agreed. The Prince grew tired of waiting for the end of what seemed a long job and became impatient to embrace his darling bride. He jumped into a boat, followed by his most intrepid courtiers, and in spite of the fuss reached the galley’s ladder. He had scarcely put foot on it when the Princess came down followed by her mother, three uncles and a cousin.”\n\nEleven months after their wedding Maria Caterina gave birth to a son, who was named after his father. Prince Honoré soon grew restless, and he left his wife for an extended visit to France, promising her that she could join him soon. Maria Caterina missed him a lot, “My dear love, I swear I feel as deeply as you how cruel it is to be separated from the one you love most in the world. My sorrow is ever with me. I’m only truly happy when dreaming, for then I’ve always the feeling of being with you…and I’m always happy to see you respond affectionately to the signs I give of my tenderness for you; but waking up is cruel for however much I look I don’t find you…” She was finally allowed to join him in December, and they remained in France for two years. She returned to Monaco when she found herself pregnant, but she suffered a miscarriage in the fifth month. Prince Honoré returned to Monaco to collect her and bring her back to Paris. Maria Caterina began to feel neglected by him. “You are forgetting about me, dear love”, she wrote in May 1763. By then, she was pregnant once again, but Prince Honoré was even further away in Normandy. She gave birth to another son, Joseph Marie Jérôme on 10 September 1763. Prince Honoré did not come rushing back to her.\n\nMaria Caterina did not live up to the expectations of the French court, and she was one of the few women not to paint her face. She was described by Lady Sarah Lennox as having “a round face with a sweet and charming expression. Her complexion is lovely, and she’s got the best figure of any woman I know. She is the only one her not to paint her face, all the others dab rouge on in a horrible manner.” She managed to attract the attention of the Prince de Condé, who she saw as a kind friend. Prince Honoré descended upon Paris with rage, leaving behind his mistress in Normandy. If there was any love left, it was now completely gone between them.\n\nOn 9 January 1771, Maria Caterina was granted a legal separation from her husband, and she moved into the Château de Chantilly, and she bought the Château de Betz. Despite their problems, Prince Honoré allowed their sons to visit her. Now separated from her husband, she could finally allow love to grow for the Prince de Condé, and she became his mistress.\n\nThe French Revolution threw everything into turmoil. Her estranged husband, her eldest son and her grandson and the wife of her second son were imprisoned. The wife of her second son, Thérèse Françoise de Choiseul was executed on 27 July 1794. Her husband never regained his strength after eventually being released, and he died on 12 May 1795. However, Monaco was no longer a principality and her son succeeded to an empty title.\n\nOn 24 October 1798, Maria Caterina finally married the Prince de Condé in London, but the marriage was kept a secret for a decade. Maria Caterina put much of her wealth into supporting the exiled French community’s armed resistance. She did not live to see her son restored to Monaco’s throne. She died on 18 March 1813 in London."}, {"url": "https://pantheon.world/profile/person/Maria_Caterina_Brignole/", "page_content": "Maria Caterina Brignole\n\nMaria Caterina Brignole (or Marie-Christine de Brignole; 7 October 1737 – 18 March 1813) was Princess consort of Monaco by marriage to Honoré III, Prince of Monaco. She separated from her husband in 1770: he died in 1795, and in 1798 she married Louis Joseph de Bourbon, Prince de Condé . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Maria Caterina Brignole has received more than 62,108 page views. Her biography is available in 17 different languages on Wikipedia (up from 15 in 2019) . Maria Caterina Brignole is the 572nd most popular companion (down from 520th in 2019), the 2,184th most popular biography from Italy (down from 2,034th in 2019) and the 54th most popular Italian Companion."}, {"url": "https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/", "page_content": "by Susan Flantzer\n\n© Unofficial Royalty 2022\n\nThe wife of Honoré III, Prince of Monaco, Maria Caterina Brignole, was born on October 7, 1737, at the Palazzo Rosso in the Republic of Genoa, now in Italy. She was the only child of Giuseppe Brignole Sale, 7th Marquis di Groppoli, an Ambassador of the Republic of Genoa to France, and Maria Anna Balbi. After the death of his brother Gian Giacomo Brignole Sale (1696 – 1734), Giuseppe married his brother’s wife Maria Anna Balbi. Maria Caterina’s parents came from two of the most powerful and wealthy families in the Republic of Genoa. Her paternal grandparents were cousins Anton Giulio II Brignole Sale, 5th Marquis of Groppoli (1673 – 1710 ), an Ambassador of the Republic of Genoa to France, and Isabella Brignole. Two of Maria Caterina’s paternal uncles had been the Doge (ruler) of the Republic of Genoa. Maria Caterina’s maternal grandparents were Francesco Maria Balbi (1671 – 1747), a Doge of the Republic of Genoa and Maria Clarice Durazzo, who also had Doges of the Republic of Genoa in her family.\n\nBecause her father was the ambassador to the French court, Maria Caterina and her mother Maria Anna took part in French high society, frequenting the salons in Paris and the Palace of Versailles. Maria Anna had several affairs including one with Honoré III, Prince of Monaco, her daughter’s future husband, and another with Louis François Armand de Vignerot du Plessis, Duke of Richelieu.\n\nIn 1755, a marriage was proposed between 18-year-old Maria Caterina and 35-year-old Honoré III, Prince of Monaco who was eager to marry to provide Monaco with an heir and to obtain Maria Caterina’s large dowry. However, Maria Caterina’s father opposed the marriage because of Honoré’s bad reputation and because of his fear that Honoré might inherit his fortune. In 1756, only after the intervention of King Louis XV of France and his mistress Madame de Pompadour did Maria Caternina’s father consent to the marriage.\n\nThe wedding of Honoré III and Maria Caterina was to occur on July 5, 1757, in Monaco, and it got off on a bad foot. Maria Caterina and her mother traveled to Monaco by boat accompanied by a contingent of Genovese nobility. When they arrived, Honoré did not come aboard the ship to welcome his bride. He said his status as a monarch demanded that Maria Caterina come to him. The Genovese contingent refused, saying that Maria Caterina was a member of a ruling family of the Republic of Genoa. The ship was stranded offshore for several days while a bridge was built between the port and Maria Caterina’s ship. Honoré and Maria Caterina walked towards each other at the same distance and met each other over the sea.\n\nHonoré III and Maria Caterina had two sons:\n\nHonoré III and Maria Caterina initially lived in Monaco but by 1760, Honoré was dissatisfied with his life there, and returned to France without his wife, spending time with his mistresses at his French homes. Eventually, Maria Caterina was allowed to come to France. She lived at the Hôtel Matignon, Honoré’s home in Paris. However, she rarely participated in social events and spent time with Louis Joseph de Bourbon, Prince of Condé, a great-grandson of Louis XIV, King of France and his mistress Françoise-Athénaïs de Rochechouart, Marquise de Montespan. Louis Joseph’s wife Charlotte de Rohan had died in 1760. During the reigns of King Louis XV and his grandson King Louis XVI, Louis Joseph held the position of Grand Maître de France, the head of the King’s household.\n\nIn 1765, rumors reached Honoré III that Maria Caterina was being courted by Louis Joseph. Being somewhat hypocritical, he left his mistress at his home in Normandy and went to Paris to scold Maria Caterina. Up to that point, Maria Caterina had regarded Louis Joseph just as a friend, but she returned Louis Joseph’s feelings and the two became involved in a love affair. After that Honoré III and Maria Caterina lived separate lives with their lovers. Eventually, Maria Caterina set up a home in the Hôtel de Lassay, an annex of the Palais-Bourbon, Louis Joseph’s residence in Paris, now the meeting place of the National Assembly, the lower legislative chamber of the French Parliament.\n\nHowever, in 1770, Honoré III made one last attempt to keep a hold on Maria Caterina. He planned to send Maria Caterina to Monaco and close the borders to prevent her from escaping. Before this could happen Maria Caterina left Paris to seek asylum at the Convent of the Visitation in Le Mans, France. Louis Joseph used his influence to obtain a legal separation for Maria Caterina from Honoré and the right to manage her own finances. Honoré finally realized his relationship with Maria Caterina was over and eventually accepted Maria Caterina’s relationship with Louis Joseph. There was never a divorce or annulment. Honoré continued with his mistresses and he allowed Maria Caterina to see her two sons.\n\nIn 1774, Marie Antoinette, the wife of the new King of France, Louis XVI, offended Louis Joseph, who was Grand Maître de France, the head of the King’s household, by refusing to receive Maria Caterina at court due to her status as a Louis Joseph’s mistress and as a separated woman. Maria Catarina and Louis Joseph lived in France until the French Revolution. After the Storming of the Bastille in 1789, Louis Joseph fled France, before the Reign of Terror, with Maria Caterina, and his son and grandson from his first marriage.\n\nThe French Revolution had dire consequences for Honoré III and the two sons he shared with Maria Caterina. They lost all aristocratic privileges in France and were dispossessed of their French property. In January 1793, Honoré III was officially declared deposed and the Principality of Monaco was annexed by France. During the Reign of Terror, in September 1793, Honoré III was arrested and imprisoned in Paris. Maria Catarina and Honoré III’s son Honoré (IV) was also arrested as were Honoré (IV)’s wife Louise d’Aumont and his son Florestan. Honoré (IV) was released after fifteen months in prison and his wife and son were saved by their family doctor.\n\nHowever, Maria Catarina’s daughter-in-law, the wife of her son Joseph, was not as lucky. Joseph spent most of his time abroad negotiating foreign loans which made him a suspect of counter-revolutionary activities. Joseph did become involved in a counter-revolution in Vendée. His wife Marie Thérèse was arrested in the absence of her husband, condemned to death, and guillotined in 1794, one of the last victims before the end of the Reign of Terror.\n\nHonoré III was eventually released from prison. He died soon afterward in Paris on March 21, 1795, at the age of 74, but his burial place is unknown. Following the defeat of Napoleon I, Emperor of the French in 1814, Maria Catarina’s son Honoré IV, aged 56 and in ill health since his imprisonment during the Reign of Terror, returned to Monaco where he reigned as Sovereign Prince until his death in 1819.\n\nAs for, Maria Caterina and Louis Joseph, after they fled France, they settled in Koblenz in the Electorate of Saxony, now in the German state of Rhineland-Palatinate. Koblenz became the home of many royalist émigrés who had fled France. Louis Joseph helped to organize and lead a counter-revolutionary army of émigrés called the Army of Condé. Maria Caterina used her fortune to help finance the exiled French community’s armed resistance. In 1792, the émigrée court at Koblenz was dissolved and Maria Caterina and Louis Joseph left for Great Britain.\n\nThree years after the death of Honoré III, Maria Caterina and Louis Joseph were married on October 24, 1798, in London, England. However, their marriage was kept secret for ten years and was not revealed until December 26, 1808. Maria Caterina, aged 76, died in Wimbledon, England on March 18, 1813, and was buried at Saint Aloysius Catholic Church in London, England, founded by Guy-Toussaint-Julien Carron, a French priest who had settled in England having fled the French Revolution.\n\nAfter the defeat of Napoleon I, Emperor of the French in 1814, the Bourbon Restoration saw a younger brother of the beheaded King Louis XVI become King Louis XVIII of France. Louis Joseph returned to France and at the age of 78, resumed his duties as Grand Maître de France, in the household of King Louis XVIII. Louis Joseph survived Maria Caterina by five years, dying on May 13, 1818, at the Palais-Bourbon in Paris, France, aged 81. He was buried at the Basilica of St. Denis in St. Denis, France, near Paris.\n\nThis article is the intellectual property of Unofficial Royalty and is NOT TO BE COPIED, EDITED, OR POSTED IN ANY FORM ON ANOTHER WEBSITE under any circumstances. It is permissible to use a link that directs to Unofficial Royalty.\n\nWorks Cited\n\nEdwards, Anne, 2017. The Grimaldis of Monaco. Blue Ridge Summit: Lyons Press.\n\nEn.wikipedia.org. 2022. Louis Joseph, Prince of Condé – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Louis_Joseph,_Prince_of_Cond%C3%A9> [Accessed 13 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Louis_Joseph,_Prince_of_Cond%C3%A9> [Accessed 13 March 2022]. En.wikipedia.org. 2022. Maria Caterina Brignole – Wikipedia. [online] Available at: <https://en.wikipedia.org/wiki/Maria_Caterina_Brignole> [Accessed 8 March 2022].\n\nFlantzer, Susan, 2022. Honoré III, Prince of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 13 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 13 March 2022]. geni_family_tree. 2022. Marie-Catherine Brignole, Princesse de Monaco. [online] Available at: <https://www.geni.com/people/Marie-Catherine-Brignole-Princesse-de-Monaco/5294696734550123378> [Accessed 13 March 2022]."}, {"url": "https://www.unofficialroyalty.com/honore-iv-prince-of-monaco/", "page_content": "by Susan Flantzer\n\n© Unofficial Royalty 2022\n\nHonoré Charles Anne Grimaldi was born in Paris, France on May 17, 1758. He was the elder of the two sons of Honoré III, Prince of Monaco and Maria Caterina Brignole who came from a Republic of Genoa (now in Italy) noble family. Honoré’s paternal grandparents were Louise-Hippolyte, Sovereign Princess of Monaco for ten months before her death from smallpox, and Jacques I, briefly the Sovereign Prince of Monaco, born Jacques François Leonor Goyon de Matignon. His maternal grandparents were Giuseppe Brignole, Marquis di Groppoli, the Ambassador to France from the Republic of Genoa, now in Italy, and Maria Anna Balbi.\n\nHonoré IV had one younger brother:\n\nPrince Joseph of Monaco, Regent of Monaco (1763 – 1816), married (1) Marie Thérèse de Choiseul, had three children, Marie Thérèse was guillotined during the French Revolution (2) Frances Margaret Powell, no children\n\nHonoré IV’s parents had issues with their marriage. Honoré III and Maria Caterina initially lived in Monaco but by 1760, Honoré III was dissatisfied with his life there, and returned to France without his wife, spending time with his mistresses at his French homes. Eventually, Maria Caterina was allowed to come to France. However, Honoré III continued his affairs and Maria Caterina began an affair, that would become long-term, with Louis Joseph de Bourbon, Prince of Condé. In 1770, Louis Joseph used his influence to obtain a legal separation for Maria Caterina from Honoré III and the right to manage her own finances. Honoré III finally realized his relationship with Maria Caterina was over and eventually accepted Maria Caterina’s relationship with Louis Joseph de Bourbon, Prince of Condé. Three years after Honoré III’s death in 1798, Maria Caterina and Louis Joseph were married but their marriage was kept secret for ten years.\n\nHonoré IV and his brother Joseph grew up mostly in France, living in homes inherited from their paternal grandfather Jacques III Goyon de Matignon, Count of Thorigny: a Paris mansion, the Hôtel de Matignon, now the official residence of the Prime Minister of France, and the Château des Matignon (link in French) in Torigni-sur-Vire in Normandy, France. In 1641, during the reign of Honoré II, Monaco had become a French protectorate, and the Princes of Monaco became vassals of the Kings of France while remaining sovereign princes. Many successive Princes of Monaco and their families spent most of their lives in France and intermarried with French and Italian noble families.\n\nHonoré III arranged a marriage for his son Honoré (IV) to Louise d’Aumont, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the only child of Louis Marie Guy d’Aumont de Rochebaron, Duke of Aumont (1732 – 1799) and Louise-Jeanne de Durfort, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye (1735 – 1781). Through her mother, Louise was the great-great-great-granddaughter of Hortense Mancini, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the mistress of King Charles II of England, and one of the two heirs of her uncle Cardinal Jules Mazarin, the First Minister of King Louis XIV of France. Louise was the heir of Hortense Mancini’s titles and the Mazarin family wealth. Therefore, a marriage to Louise came with a large dowry and the prospect of a fortune. Honoré (IV) and Louise married on July 15, 1777.\n\nThe marriage did produce two sons, both Sovereign Princes of Monaco:\n\nThe French Revolution had dire consequences for the Grimaldi family. In January 1793, Honoré III, Prince of Monaco was officially declared deposed and the Principality of Monaco was annexed by France. The members of the former ruling Grimaldi dynasty lost all aristocratic privileges in France, were dispossessed of their French property, and became French citizens. During the Reign of Terror, in September 1793, Honoré (IV), his wife Louise, their son Florestan, and Honoré (IV)’s father Honoré III were arrested and imprisoned in Paris as enemies of the people. Louise and her son Florestan were rescued by a family doctor who forged release papers and then hid them in his home until the Reign of Terror was over. The wife of Honoré IV’s brother Joseph was not as lucky. Joseph spent most of his time abroad negotiating foreign loans which made him a suspect of counter-revolutionary activities. When Joseph did become involved in a counter-revolution, his wife Marie Thérèse was arrested in the absence of her husband, condemned to death, and guillotined in 1794, one of the last victims before the end of the Reign of Terror.\n\nIn October 1794, Honoré III and Honoré (IV) were released from prison. Honoré III never recovered from his imprisonment and died in Paris on March 21, 1795, at the age of 74, but his burial place is unknown. Honoré IV, whose chronic ill health had been worsened by imprisonment, would have become Prince of Monaco but Monaco was no longer a sovereign monarchy. However, Honoré IV’s family properties in France were returned to him but they were in poor condition and all of the contents were gone.\n\nIn 1794, while Honoré IV was still in prison, Louise had given birth to an illegitimate daughter Amélie Céleste Erodore d’Aumont. The father of the child is believed to have been Antoine de Montazet, Archbishop of Lyon. After Honoré IV’s release from prison, Louise and Honoré IV’s marriage became unhappy and the couple separated. In 1798, Louise divorced Honoré IV, giving Louise sole access to her fortune.\n\nIn 1804, Napoleon crowned himself Emperor of the French. Honoré IV could not adapt to the new French society and for the most part, remained an outsider. Because of a lack of funds, he needed to sell his family’s Paris and Normandy homes. Surprisingly, Honoré IV’s health improved and he joined the French Army. He was wounded during Napoleon’s Russian Campaign, lost the use of one arm, and was sent back to Paris.\n\nAfter Napoleon’s defeat in 1814 and the Bourbon Restoration which saw Louis XVIII, a younger brother of the beheaded King Louis XVI, become King of France, Florestan’s uncle Joseph petitioned King Louis XVIII to restore the Principality of Monaco to the Grimaldi family. Florestan’s father Honoré IV finally became Sovereign Prince of Monaco in 1814. The independence of Monaco lasted for only one year. In 1815, the Congress of Vienna, an international diplomatic conference that reconstituted the European political order after the downfall of Napoleon I, declared that Monaco would be a protectorate of the Kingdom of Sardinia.\n\nBy the time Honoré IV became the Sovereign Prince of Monaco, his physical condition had worsened and he was now paralyzed on one side of his body. Because of his condition, a regency was established to rule in his name. Honoré IV’s brother Joseph was regent from 1814 -1815 and then Florestan’s brother Honoré V served as regent until his father’s death in 1819 when he succeeded him as Honoré V, Prince of Monaco.\n\nHonoré IV, Prince of Monaco died in Paris, France on February 16, 1819, aged 60. He was buried at the Church of Saint Nicholas in Monaco. During the late 19th century, a new and larger church, the Cathedral of Monaco, was built on the site of the Church of Saint Nicholas. The original church was demolished in 1874 but the current cathedral was built over the areas of the previous church and the old burial site so that the sovereign princes and consorts originally buried at the Church of Saint Nicholas are now buried in the Cathedral of Monaco.\n\nThis article is the intellectual property of Unofficial Royalty and is NOT TO BE COPIED, EDITED, OR POSTED IN ANY FORM ON ANOTHER WEBSITE under any circumstances. It is permissible to use a link that directs to Unofficial Royalty.\n\nWorks Cited\n\nEdwards, Anne, 2017. The Grimaldis of Monaco . Blue Ridge Summit: Lyons Press.\n\n. Blue Ridge Summit: Lyons Press. En.wikipedia.org. 2022. Honoré IV, Prince of Monaco – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022]. En.wikipedia.org. 2022. Louise d’Aumont – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Honoré III, Prince of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Maria Caterina Brignole, Princess of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Honoré IV (prince de Monaco) — Wikipédia . [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022].\n\n. [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Louise d’Aumont — Wikipédia. [online] Available at: <https://fr.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]."}, {"url": "https://www.findagrave.com/memorial/232352902/maria-caterina-de_bourbon-cond%C3%A9", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://simple.wikipedia.org/wiki/Honor%C3%A9_III,_Prince_of_Monaco", "page_content": "Honoré III, Prince of Monaco (Honoré Camille Léonor; 10 November 1720 – 21 March 1795) was a reigning prince of the small state of Monaco. He succeeded his mother Louise Hippolyte and is to this day still one of the longest reigning European rulers.\n\nBrief biography [ change | change source ]\n\nThe eldest surviving son of Princess Louise Hippolyte of Monaco and her husband Prince Jacques\n\nIn May 1732 he moved to Paris to be with his father till he was officially proclaimed the prince of Monaco. Antoine Grimaldi, the Chevalier de Grimaldi, acted as regent for the prince between 1732 and 1784, when Honoré chose to live in Paris. This situation remained the same for half a century until Antoine's death in 1784,\n\nOn 5 June 1757 he married Maria Caterina Brignole a member of one of the most powerful and wealthy familys in the Republic of Genoa. The had two sons before divorcing in 1770.\n\nPrince Honoré IV of Monaco (17 May 1758 – 16 February 1819) married Louise d'Aumont and had children. Prince Joseph of Monaco (10 September 1763 – 28 June 1816) married Marie Thérèse de Choiseul and had children.\n\nTitles and styles [ change | change source ]\n\n20 February 1731 - 17 May 1758 His Serene Highness The Marquis of Baux.\n\nThe Marquis of Baux. 7 November 1733 – 19 January 1793 His Serene Highness The Prince of Monaco, Duke of Valentinois.\n\nFurther reading [ change | change source ]"}]}