{"Honoré IV was born in Paris where his father was living in exile, and was baptized at the church of Saint-Sulpice..": [{"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iv-prisoner-of-the-french-revolution-2/", "page_content": "Prince Honoré IV was born on May 17, 1758 in Paris, to his parents Prince Honoré III and Princess Maria-Caterina de Brignole-Sale. This prince, perhaps, experienced more challenges in life than any other Grimaldi. Most of his hardships were caused by the French Revolution, and the last hours of his life are still shrouded in mystery …\n\nThe victims of the Great Terror\n\nPrince Honoré IV was unlucky enough to be living in Paris when the Reign of Terror broke out in France. As a nobleman and prince he was soon arrested and thrown into prison. The prince’s former wife, Duchess of Mazarin, was also taken into custody. Assisted by their family doctor, however, she managed to escape and hide with her youngest son Florestan.\n\nThe revolution did not spare the family of Prince’s Honore IV’s youngest brother, Joseph. His wife, Marie Thérèse de Choiseul, was arrested on suspicion of espionage and executed by guillotine. She was only 27, leaving behind three little daughters.\n\nAs for Prince Honoré, he was imprisoned for one and a half years. This time in prison greatly undermined his health, and he never fully recovered from it afterwards. On March 21, 1795 his father died and Honoré IV ascended the throne of Monaco. At that time the monarchy had just been banned and Monaco was once again annexed to the French Republic under the name of Port Hercule.\n\nEven after Prince Honoré was released from prison, it took another seven years of negotiations before the French regime restored some of Honoré IV’s and his brother Prince Joseph’s income. The future started to look brighter for the Grimaldi’s once the radical revolutionary regime was followed by the French consulate and, finally, by the First French Empire of Napoleon Bonaparte.\n\nReturn to the throne\n\nWhen the Napoleonic Wars finally came to an end, the status of Monaco was restored by the Congress of Vienna (1814–1815) thanks to the efforts of Prince Talleyrand. On May 30, 1814 Honoré IV was officially named the Principality’s ruler. However, he was too ill to take control of his country. So it was his brother Prince Joseph who became regent.\n\nThe Prince’s eldest son, 36-year-old Honoré Gabriel, however, was not happy about this decision. A brilliant soldier, he entered the cavalry service at the age of 20 and prospered in the army of the Empire Marshal, Emmanuel de Grouchy. Since Prince Joseph was not particularly eager to deal with the Principality’s affairs, preferring his life in the capital, he easily facilitated handing over the reins to his nephew, Honoré Gabriel, who ruled Monaco up until the death of Honoré IV (later becoming Prince Honoré V). As for Honoré IV, he lived in Paris until his very death which remains mysterious to this day…\n\nAccident or murder ..?\n\nOn a winter’s day of February 16, 1819, Honoré IV drowned in the Seine river. The death of the Monaco prince looked like a typical accident. That’s what the investigation concluded as an official version. It must not be forgotten, however, that Honoré IV was not a very healthy person, to say the least. This is the reason why he was not only unwilling, but was also physically unfit to rule the country. Imprisonment and numerous personal tragedies had taken their toll on the Prince, making him, for all intents and purposes, disabled. This is what the scanty preserved data suggests. A legitimate question arises: how could a 60-year-old monarch, in deplorable physical state, manage to cover such a considerable distance away from home (Avenue Denfert-Rochereau) to the Seine river bank..?\n\nWas it really an accident? Or rather a premeditated murder? Or could it be that the Prince decided to put an end to his own unhappy life? Being a depressed person, did he step into the Seine himself..? The answer remains a mystery.\n\nThe main legacy of Prince Honore IV\n\nAs Prince of Monaco, Honoré IV suffered three arrests and never actually ruled Monaco. He spent part of his life in a prison cell and the rest, trying to improve his health. Needless to say, there are very few mentions of the Prince, even in the archives of Monaco. His most important contribution to the history of Monaco was the birth of his two sons — the future princes, Honoré V and Florestan I, who consistently ruled the Principality and left their mark on the state’s history."}, {"url": "https://www.unofficialroyalty.com/honore-iv-prince-of-monaco/", "page_content": "by Susan Flantzer\n\n© Unofficial Royalty 2022\n\nHonoré Charles Anne Grimaldi was born in Paris, France on May 17, 1758. He was the elder of the two sons of Honoré III, Prince of Monaco and Maria Caterina Brignole who came from a Republic of Genoa (now in Italy) noble family. Honoré’s paternal grandparents were Louise-Hippolyte, Sovereign Princess of Monaco for ten months before her death from smallpox, and Jacques I, briefly the Sovereign Prince of Monaco, born Jacques François Leonor Goyon de Matignon. His maternal grandparents were Giuseppe Brignole, Marquis di Groppoli, the Ambassador to France from the Republic of Genoa, now in Italy, and Maria Anna Balbi.\n\nHonoré IV had one younger brother:\n\nPrince Joseph of Monaco, Regent of Monaco (1763 – 1816), married (1) Marie Thérèse de Choiseul, had three children, Marie Thérèse was guillotined during the French Revolution (2) Frances Margaret Powell, no children\n\nHonoré IV’s parents had issues with their marriage. Honoré III and Maria Caterina initially lived in Monaco but by 1760, Honoré III was dissatisfied with his life there, and returned to France without his wife, spending time with his mistresses at his French homes. Eventually, Maria Caterina was allowed to come to France. However, Honoré III continued his affairs and Maria Caterina began an affair, that would become long-term, with Louis Joseph de Bourbon, Prince of Condé. In 1770, Louis Joseph used his influence to obtain a legal separation for Maria Caterina from Honoré III and the right to manage her own finances. Honoré III finally realized his relationship with Maria Caterina was over and eventually accepted Maria Caterina’s relationship with Louis Joseph de Bourbon, Prince of Condé. Three years after Honoré III’s death in 1798, Maria Caterina and Louis Joseph were married but their marriage was kept secret for ten years.\n\nHonoré IV and his brother Joseph grew up mostly in France, living in homes inherited from their paternal grandfather Jacques III Goyon de Matignon, Count of Thorigny: a Paris mansion, the Hôtel de Matignon, now the official residence of the Prime Minister of France, and the Château des Matignon (link in French) in Torigni-sur-Vire in Normandy, France. In 1641, during the reign of Honoré II, Monaco had become a French protectorate, and the Princes of Monaco became vassals of the Kings of France while remaining sovereign princes. Many successive Princes of Monaco and their families spent most of their lives in France and intermarried with French and Italian noble families.\n\nHonoré III arranged a marriage for his son Honoré (IV) to Louise d’Aumont, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the only child of Louis Marie Guy d’Aumont de Rochebaron, Duke of Aumont (1732 – 1799) and Louise-Jeanne de Durfort, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye (1735 – 1781). Through her mother, Louise was the great-great-great-granddaughter of Hortense Mancini, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the mistress of King Charles II of England, and one of the two heirs of her uncle Cardinal Jules Mazarin, the First Minister of King Louis XIV of France. Louise was the heir of Hortense Mancini’s titles and the Mazarin family wealth. Therefore, a marriage to Louise came with a large dowry and the prospect of a fortune. Honoré (IV) and Louise married on July 15, 1777.\n\nThe marriage did produce two sons, both Sovereign Princes of Monaco:\n\nThe French Revolution had dire consequences for the Grimaldi family. In January 1793, Honoré III, Prince of Monaco was officially declared deposed and the Principality of Monaco was annexed by France. The members of the former ruling Grimaldi dynasty lost all aristocratic privileges in France, were dispossessed of their French property, and became French citizens. During the Reign of Terror, in September 1793, Honoré (IV), his wife Louise, their son Florestan, and Honoré (IV)’s father Honoré III were arrested and imprisoned in Paris as enemies of the people. Louise and her son Florestan were rescued by a family doctor who forged release papers and then hid them in his home until the Reign of Terror was over. The wife of Honoré IV’s brother Joseph was not as lucky. Joseph spent most of his time abroad negotiating foreign loans which made him a suspect of counter-revolutionary activities. When Joseph did become involved in a counter-revolution, his wife Marie Thérèse was arrested in the absence of her husband, condemned to death, and guillotined in 1794, one of the last victims before the end of the Reign of Terror.\n\nIn October 1794, Honoré III and Honoré (IV) were released from prison. Honoré III never recovered from his imprisonment and died in Paris on March 21, 1795, at the age of 74, but his burial place is unknown. Honoré IV, whose chronic ill health had been worsened by imprisonment, would have become Prince of Monaco but Monaco was no longer a sovereign monarchy. However, Honoré IV’s family properties in France were returned to him but they were in poor condition and all of the contents were gone.\n\nIn 1794, while Honoré IV was still in prison, Louise had given birth to an illegitimate daughter Amélie Céleste Erodore d’Aumont. The father of the child is believed to have been Antoine de Montazet, Archbishop of Lyon. After Honoré IV’s release from prison, Louise and Honoré IV’s marriage became unhappy and the couple separated. In 1798, Louise divorced Honoré IV, giving Louise sole access to her fortune.\n\nIn 1804, Napoleon crowned himself Emperor of the French. Honoré IV could not adapt to the new French society and for the most part, remained an outsider. Because of a lack of funds, he needed to sell his family’s Paris and Normandy homes. Surprisingly, Honoré IV’s health improved and he joined the French Army. He was wounded during Napoleon’s Russian Campaign, lost the use of one arm, and was sent back to Paris.\n\nAfter Napoleon’s defeat in 1814 and the Bourbon Restoration which saw Louis XVIII, a younger brother of the beheaded King Louis XVI, become King of France, Florestan’s uncle Joseph petitioned King Louis XVIII to restore the Principality of Monaco to the Grimaldi family. Florestan’s father Honoré IV finally became Sovereign Prince of Monaco in 1814. The independence of Monaco lasted for only one year. In 1815, the Congress of Vienna, an international diplomatic conference that reconstituted the European political order after the downfall of Napoleon I, declared that Monaco would be a protectorate of the Kingdom of Sardinia.\n\nBy the time Honoré IV became the Sovereign Prince of Monaco, his physical condition had worsened and he was now paralyzed on one side of his body. Because of his condition, a regency was established to rule in his name. Honoré IV’s brother Joseph was regent from 1814 -1815 and then Florestan’s brother Honoré V served as regent until his father’s death in 1819 when he succeeded him as Honoré V, Prince of Monaco.\n\nHonoré IV, Prince of Monaco died in Paris, France on February 16, 1819, aged 60. He was buried at the Church of Saint Nicholas in Monaco. During the late 19th century, a new and larger church, the Cathedral of Monaco, was built on the site of the Church of Saint Nicholas. The original church was demolished in 1874 but the current cathedral was built over the areas of the previous church and the old burial site so that the sovereign princes and consorts originally buried at the Church of Saint Nicholas are now buried in the Cathedral of Monaco.\n\nThis article is the intellectual property of Unofficial Royalty and is NOT TO BE COPIED, EDITED, OR POSTED IN ANY FORM ON ANOTHER WEBSITE under any circumstances. It is permissible to use a link that directs to Unofficial Royalty.\n\nWorks Cited\n\nEdwards, Anne, 2017. The Grimaldis of Monaco . Blue Ridge Summit: Lyons Press.\n\n. Blue Ridge Summit: Lyons Press. En.wikipedia.org. 2022. Honoré IV, Prince of Monaco – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022]. En.wikipedia.org. 2022. Louise d’Aumont – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Honoré III, Prince of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Maria Caterina Brignole, Princess of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Honoré IV (prince de Monaco) — Wikipédia . [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022].\n\n. [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Louise d’Aumont — Wikipédia. [online] Available at: <https://fr.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]."}, {"url": "https://www.findagrave.com/memorial/7832651/honor%C3%A9_iv-of_monaco", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-v-a-brilliant-officer-and-an-unlucky-sovereign/", "page_content": "The eldest son of Prince Honoré IV was so eager for power that he declared himself a ruler against the will of his father. Tough and authoritarian, accustomed to military discipline from his youth, he made important economic decisions alone but failed to make the country prosperous and failed to make its population rich and happy. In fairness, we note that the Prince sincerely did his best.\n\nMilitary service for France\n\nPrince Honoré-Gabriel, the eldest son of Prince Honoré IV of Monaco and Princess Louise Felicite Victoire d’Aumont, was born in Paris on May 14, 1778. He enlisted in a French cavalry regiment when he was 20 years old and worked his way up through the ranks by his own merits until he became an officer on the staff of Marshal Grouchy. He was an exemplary soldier and was cited for his bravery many times. Being wounded in the arm he couldn’t take part in the action at Austerlitz (1805) but did serve with great distinction at the battle of Jena (1806) with Marshal Murat’s cavalry corps. Marshal Grouchy recommended him for the star of the Legion of Honour, relating that the Prince had taken a handful of cavalry and forced the surrender of an entire enemy battalion.\n\nIn April 1814, Napoleon Bonaparte abdicated the throne and was sent into exile on the island of Elba. The restored King Louis XVIII of France himself then also restored the Grimaldis to their places in the French nobility. Therefore, after the restoration of 1814, Honoré-Gabriel was also named member of the House of Peers by King Louis XVIII. But many were afraid that Monegasque independence would not be secure or that the Principality might be annexed by the Kingdom of Piedmont-Sardinia. Thanks to Prince Talleyrand, however, a clause was inserted into the Treaty of Paris to put Monaco securely back in order and independent.\n\nReturn to Monaco and meeting with Napoleon\n\nHonoré IV was unable to return to Monaco because of his poor health and so appointed his brother Joseph to rule on his behalf. But Honoré-Gabriel didn’t like that idea and he protested fiercely about this and after some struggle he was himself appointed to govern Monaco.\n\nIn March, 1815 on his way to Monaco he met with his old commander Napoleon who was on his way to Paris to seize power at the start of the 100 days. “Where are you going?”, Napoleon asked. “Going home, to Monaco”, Honoré-Gabriel answered. “Me too, I’m going home, to the Tuileries,” Napoleon said. When Napoleon attempted to restore his empire during the 100 days Monaco was occupied by British troops and so the Grimaldis played no part in the affair.\n\nDifficult years of reign\n\nIn 1819, when his father passed away, Honoré-Gabriel became the Sovereign Prince of Monaco as Honoré V and inherited a Principality beset with problems. At the same time being both a member of the French Parliament and the Sovereign of Monaco, he picked up on the project of his grandfather to diversify economic resources and encouraged the installation of factories. The Great Powers of Europe had taken Monaco out of the French sphere of influence and made the Principality a protectorate of Piedmont-Sardinia. The government in Turin closed the tobacco plant that Honoré III had established and enforced a number of other changes that had left Monaco impoverished.\n\nHonoré V went to Turin to try to reason with the King of Piedmont-Sardinia but, although he was treated with great honour and respect, none of his grievances were addressed. Honoré V also had to raise taxes considerably which made him increasingly unpopular. His granting of a monopoly on flour caused a bread shortage but no one had the nerve to voice opposition to him. He also pushed opportunities for tourism. However, the lack of a market for local products, the omnipresence of the State and the lack of presence of the Sovereign created tensions, especially in Menton. The Sovereign ended up pacifying Menton before going forward with his effort to provide the Principality with amenities. By his own admission he “desired to do good” but “did not manage to”, despite his philanthropic ideals.\n\nWhen liberal movements began to oppose the counter revolutionary tide of post-Napoleonic Europe some in Monaco thought of joining in but Sardinian troops arrived to crush the potential rebellion in its infancy.\n\nUnjust dislike\n\nHistory has tended to record Prince Honoré V as a very unpopular and autocratic monarch, but, in reality he was quite progressive. He sincerely wished to help his people and had great sympathy for the poor. His reaction to seeing beggars on the streets was to form state-owned industries and put them to work. Some of the industries he set up included a lace factory and a hat factory. He also had them put to work on farm cooperatives as citrus orchards had long been a large part of the Monegasque economy. All of this has led some people to regard Prince Honoré V as a sort of socialist, though he probably would not have seen it that way.\n\nBut all efforts to save the economy did not make Monegasques appreciate their Prince. Honoré V of Monaco died on October 2, 1841 in Paris and remained in the history of the country as an authoritarian ruler who did not trust anyone, including family members, and made decisions alone. As he was not married and had no children the Monegasque throne passed to his poet-actor brother Florestan."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iii-one-of-the-longest-reigns-in-european-history-en/", "page_content": "Everybody knows that the reign of French King Louis XIV, ‘Le Roi Soleil’, was the longest in European history. Two British Queens — Elizabeth II who will celebrate 70 years on the throne in 2022 and her great-great-grandmother Victoria (who reigned for 63 years) also had lengthy reigns. But few know that the fifth prince of Monaco is also on the list of the longest-reigning European monarchs: after coming to the Monegasque throne in 1733 he reigned for nearly 60 years and so passed his ancestor Honoré, Lord of Monaco, who ruled for 58 years in the XVI century.\n\nAscension to the Throne at the age of 13\n\nHonoré Camille Léonor Grimaldi was born on November 10, 1720. He was the son of Louise-Hyppolite, and the grandson of Prince Antoine I, who both died in 1731. Honoré came to the throne just after turning 13 when his father, Prince Jacques I, abdicated. Prince Honoré III spent much of his time away on campaign with the Royal French Army fighting the English in the War of the Austrian Succession. Honoré III was wounded fighting in the French victory at Rocoux. Later, he earned the Cross of St Louis for his conduct and after the Peace of Aix-la-Chapelle in 1748 he was given the rank of Marshal of France.\n\nWhat is interesting is that despite the heroic service of Honoré III in the wars, the Principality of Monaco was neutral in the conflict and, administered by the Chevalier de Grimaldi, assisted both French and English ships in need of help. The Austrians and Sardinians did blockade the Monegasque coast for a time and much of the countryside was pillaged by Croat soldiers of the Austrian army but French forces later cleared the region of all invaders in 1748.\n\nThe Royal Marriage\n\nIn 1757 Honoré III married Maria Caterina di Brignole-Sale who was descended from the Doges of Genoa and called “the most beautiful woman in France”. They were a very proud family and the arrival of the bride-to-be in Monaco turned into a disaster as many of the bridal attendants were seasick and the future mother-in-law insisted that Honoré III come onboard to greet his fiancé and escort her ashore. However, as a monarch in his own right, Honoré III refused as it was considered a breach of protocol for a prince to go to meet someone rather than them being brought to meet him. A stand-off ensued and eventually the Genoese fleet sailed away and stopped farther up the coast before a compromise was negotiated by which the couple would meet in the middle of a bridge extended between ship and shore. Nonetheless, the two were married and in 1758 the future Prince Honoré IV was born followed by Prince Joseph some years later. In 1770, though, Honoré III and Princess Maria Caterina divorced, and she later married the Prince de Condé in 1798.\n\nIn 1767 the British Duke of York was sailing from Marseilles to Genoa when he was suddenly taken ill and had to put in at Monaco. Prince Honoré III quickly offered all the help he could and put his palace at the disposal of the Prince who died after 11 days in what has forever after been known as the York Room of the Princely Palace.\n\nIn the meantime Prince Honoré III did what he could to guide his little principality along, improving trade and the economy which was heavily dependent on growing citrus fruits such as lemons in those days. His reign also saw the establishment of the first printing press in Monaco and the first newspaper the ‘Courrier de Monaco’. Prince Honoré III did take the initiative in pushing for some reforms, the most major of which was the repeal of the law that the Sovereign Prince would receive the inheritance of anyone who died on his property. On August 18, 1770 Honoré saw the practice, which he viewed as barbaric, abolished.\n\nThe French Revolution, Arrest and Imprisonment\n\nAs France slipped increasingly rapidly towards revolution things in Monaco remained calm and peaceful until the fateful day of July 14, 1789; the date of the storming of the Bastille. The shock spread to Monaco where crowds embraced the Declaration of the Rights of Man, influenced by the rise of republicanism in France as well as some newly introduced nostalgia for the Genoese Republic. Honoré III was concerned with the loss of his noble titles in France at the hands of the French National Constituent Assembly which was intent on abolishing all aristocratic privileges and soon he rushed to Paris to try to defend his titles there before the Constituent Assembly.\n\nHonoré III was extremely convincing when dealing with the French revolutionaries. His estates were, he insisted, not the gift of the King of France alone but payment for services rendered in the cause of French national glory. He struck just the right cord and the Assembly voted a generous pension for the Prince of Monaco in reparation for his confiscated properties.\n\nUnfortunately, before the order could be carried out, Danton came to power and the republic was declared. In all the turmoil France lost interest in Monaco and ultimately all Honoré was able to gain was recognition from the republican government of Monegasque neutrality. Unfortunately, that was a promise that would never be respected.\n\nThe French Republic declared their expansionist policy at the end of 1792. Monaco quickly fell victim to this policy and on January 13, 1793 Prince Honoré III was officially declared deposed by the Monegasque National Convention. Members of the Convention immediately filed a petition for accession to France. Some people in France however did protest on the grounds that Honoré III had always been a loyal friend and ally of the French, but republican hatred of monarchy prevailed and Monaco was absorbed into the French Republic and renamed Fort Hercules.\n\nAt the height of the Reign of Terror Honoré III was arrested as was his son, Honoré IV, who had been in Paris at the time and who would remain imprisoned for 15 months. Honoré III had suffered greatly from his own imprisonment and after his release had to stay in his house on the rue de Varennes as the Princely Palace in Monaco had been confiscated by the revolution though, thankfully, there was no ‘Reign of Terror’ or mass arrests and bloodshed in Monaco. Overcome with sadness, suffering, a number of ailments and the ravages of old age Prince Honoré III of Monaco died on March 21, 1795.\n\nIn 2020, the Principality paid a tribute to Prince Honoré III by having issued a 2€ commemorative coin celebrating the 300th anniversary of his birth. At the time of writing, the price of the coin, which was issued in 15,000 copies, has reached in the region of €300."}, {"url": "https://www.britannica.com/biography/Honore-de-Balzac", "page_content": "Honoré de Balzac , original name Honoré Balssa , (born May 20, 1799, Tours , France—died August 18, 1850, Paris), French literary artist who produced a vast number of novels and short stories collectively called La Comédie humaine (The Human Comedy). He helped to establish the traditional form of the novel and is generally considered to be one of the greatest novelists of all time.\n\nEarly career\n\nBalzac’s father was a man of southern peasant stock who worked in the civil service for 43 years under Louis XVI and Napoleon. Honoré’s mother came from a family of prosperous Parisian cloth merchants. His sister Laure (later de Surville) was his only childhood friend, and she became his first biographer.\n\nBalzac was sent to school at the Collège des Oratoriens at Vendôme from age 8 to 14. At Napoleon’s downfall his family moved from Tours to Paris, where he went to school for two more years and then spent three years as a lawyer’s clerk. During this time he already aimed at a literary career, but as the writer of Cromwell (1819) and other tragic plays he was utterly unsuccessful. He then began writing novels filled with mystic and philosophical speculations before turning to the production of potboilers—gothic, humorous, historical novels—written under composite pseudonyms. Then he tried a business career as a publisher, printer, and owner of a typefoundry, but disaster soon followed. In 1828 he was narrowly saved from bankruptcy and was left with debts of more than 60,000 francs. From then on his life was to be one of mounting debts and almost incessant toil. He returned to writing with a new mastery, and his literary apprenticeship was over.\n\nTwo works of 1829 brought Balzac to the brink of success. Les Chouans, the first novel he felt enough confidence about to have published under his own name, is a historical novel about the Breton peasants called Chouans who took part in a royalist insurrection against Revolutionary France in 1799. The other, La Physiologie du mariage (The Physiology of Marriage), is a humorous and satirical essay on the subject of marital infidelity, encompassing both its causes and its cure. The six stories in his Scènes de la vie privée (1830; “Scenes from Private Life”) further increased his reputation. These long short stories are for the most part psychological studies of girls in conflict with parental authority. The minute attention he gave to describing domestic background in his works anticipated the spectacularly detailed societal observations of his later Parisian studies.\n\nBritannica Quiz Novels and Novelists Quiz\n\nFrom this point forward Balzac spent much of his time in Paris. He began to frequent some of the best-known Parisian salons of the day and redoubled his efforts to set himself up as a dazzling figure in society. To most people he seemed full of exuberant vitality, talkative, jovial and robustious, egoistic, credulous, and boastful. He adopted for his own use the armorial bearings of an ancient noble family with which he had no connection and assumed the honorific particle de. He was avid for fame, fortune, and love but was above all conscious of his own genius. He also began to have love affairs with fashionable or aristocratic women at this time, finally gaining that firsthand understanding of mature women that is so evident in his novels.\n\nBetween 1828 and 1834 Balzac led a tumultuous existence, spending his earnings in advance as a dandy and man-about-town. A fascinating raconteur, he was fairly well received in society. But social ostentation was only a relaxation from phenomenal bouts of work—14 to 16 hours spent writing at his table in his white, quasi-monastic dressing gown, with his goose-quill pen and his endless cups of black coffee. In 1832 Balzac became friendly with Éveline Hanska, a Polish countess who was married to an elderly Ukrainian landowner. She, like many other women, had written to Balzac expressing admiration of his writings. They met twice in Switzerland in 1833—the second time in Geneva, where they became lovers—and again in Vienna in 1835. They agreed to marry when her husband died, and so Balzac continued to conduct his courtship of her by correspondence; the resulting Lettres à l’étrangère (“Letters to a Foreigner”), which appeared posthumously (4 vol., 1889–1950), are an important source of information for the history both of Balzac’s life and of his work.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nTo clear his debts and put himself in a position to marry Madame Hanska now became Balzac’s great incentive. He was at the peak of his creative power. In the period 1832–35 he produced more than 20 works, including the novels Le Médecin de campagne (1833; The Country Doctor), Eugénie Grandet (1833), L’Illustre Gaudissart (1833; The Illustrious Gaudissart), and Le Père Goriot (1835), one of his masterpieces. Among the shorter works were Le Colonel Chabert (1832), Le Curé de Tours (1832; The Vicar of Tours), the trilogy of stories entitled Histoire des treize (1833–35; History of the Thirteen), and Gobseck (1835). Between 1836 and 1839 he wrote Le Cabinet des antiques (1839), the first two parts of another masterpiece, Illusions perdues (1837–43; Lost Illusions), César Birotteau (1837), and La Maison Nucingen (1838; The Firm of Nucingen). Between 1832 and 1837 he also published three sets of Contes drolatiques (Droll Stories). These stories, Rabelaisian in theme, are written with great verve and gusto in an ingenious pastiche of 16th-century language. During the 1830s he also wrote a number of philosophical novels dealing with mystical, pseudoscientific, and other exotic themes. Among these are La Peau de chagrin (1831; The Wild Ass’s Skin), Le Chef-d’oeuvre inconnu (1831; The Unknown Masterpiece), Louis Lambert (1834), La Recherche de l’absolu (1834; The Quest of the Absolute), and Séraphîta (1834–35).\n\nIn all these varied works Balzac emerged as the supreme observer and chronicler of contemporary French society. These novels are unsurpassed for their narrative drive, their large casts of vital, diverse, and interesting characters, and their obsessive interest in and examination of virtually all spheres of life: the contrast between provincial and metropolitan manners and customs; the commercial spheres of banking, publishing, and industrial enterprise; the worlds of art, literature, and high culture; politics and partisan intrigue; romantic love in all its aspects; and the intricate social relations and scandals among the aristocracy and the haute bourgeoisie.\n\nNo theme is more typically Balzacian than that of the ambitious young provincial fighting for advancement in the competitive world of Paris. Balzac admired those individuals who were ruthless, astute, and, above all, successful in thrusting their way up the social and economic scale at all costs. He was especially attracted by the theme of the individual in conflict with society: the adventurer, the scoundrel, the unscrupulous financier, and the criminal. Frequently his villains are more vigorous and interesting than his virtuous characters. He was both fascinated and appalled by the French social system of his time, in which the bourgeois values of material acquisitiveness and gain were steadily replacing what he viewed as the more stable moral values of the old-time aristocracy.\n\nThese topics provided material largely unknown, or unexplored, by earlier writers of French fiction. The individual in Balzac’s stories is continually affected by the pressure of material difficulties and social ambitions, and he may expend his tremendous vitality in ways Balzac views as socially destructive and self-destructive. Linked with this idea of the potentially destructive power of passionate will, emotion, and thought is Balzac’s peculiar notion of a vital fluid concentrated inside the person, a store of energy that he may husband or squander as he desires, thereby lengthening or shortening his vital span. Indeed, a supremely important feature in Balzac’s characters is that most are spendthrifts of this vital force, a fact that explains his monomaniacs who are both victim and embodiment of some ruling passion; avarice, as in the main character of Gobseck, a usurer gloating over his sense of power, or the miserly father obsessed with riches in Eugénie Grandet; excessive paternal affection, as in the idolatrous Learlike father in Le Père Goriot; feminine vindictiveness, as evidenced in La Cousine Bette and a half-dozen other novels; the mania of the art collector, as in Le Cousin Pons; the artist’s desire for perfection, as in Le Chef-d’oeuvre inconnu; the curiosity of the scientist, as in the fanatical chemist of La Recherche de l’absolu; or the vaulting and frustrated ambition of the astonishingly resourceful criminal mastermind Vautrin in Illusions perdues and Splendeurs et misères des courtisanes. Once such an obsession has gained a hold, Balzac shows it growing irresistibly in power and blinding the person concerned to all other considerations. The typical structure of his novels from the early 1830s onward is determined by this approach: there is a long period of preparation and exposition, and then tension mounts swiftly to an inevitable climax, as in classical tragedy."}, {"url": "https://www.thoughtco.com/honore-de-balzac-life-works-4174975", "page_content": "Honoré de Balzac (born Honoré Balssa, May 20, 1799 – August 18, 1850) was a novelist and playwright in nineteenth-century France. His work formed part of the foundation of the realist tradition in European literature, with particular focus on his remarkably complex characters.\n\nFast Facts: Honoré de Balzac Occupation: Writer\n\nWriter Born: May 20, 1799 in Tours, France\n\nMay 20, 1799 in Tours, France Died: August 18, 1850 in Paris, France\n\nAugust 18, 1850 in Paris, France Key Accomplishments: Groundbreaking French novelist whose realist style and complex characters shaped the modern novel\n\nGroundbreaking French novelist whose realist style and complex characters shaped the modern novel Selected Work : Les Chouans (1829), Eugénie Grandet (1833), La Père Goriot (1835), La Comédie humaine (collected works)\n\n: Les Chouans (1829), Eugénie Grandet (1833), La Père Goriot (1835), La Comédie humaine (collected works) Quote: \"There is no such thing as a great talent without great will power.”\n\nFamily and Early Life\n\nHonoré’s father, Bernard-Francois Balssa, was from a large lower-class family. As a young man, he worked hard to climb up the social ladder and eventually did so, working for the governments of both Louis XVI and, later, Napoleon. He changed his name to Francois Balzac to sound more like the aristocrats he now interacted with, and eventually married the daughter of a wealthy family, Anne-Charlotte-Laure Sallambier. The age gap was considerable – thirty-two years – and was arranged in gratitude for Francois’s assistance to the family. It never was a love match.\n\nDespite this, the couple had five children. Honoré was the eldest to survive infancy, and was closest in age and affection to his sister Laure, born a year later. Honoré attended the local grammar school, but struggled with the rigid structure and consequently was a poor student, even once he was returned to the care of his family and private tutors. It was not until he entered university at the Sorbonne that he began to thrive, studying history, literature, and philosophy under some of the great minds of the day.\n\nAfter college, Honoré began a career as a law clerk on the advice of his father. He was intensely dissatisfied with the work, but it did provide him with the opportunity to come into contact with and observe people of all walks of life and the moral dilemmas inherent in the practice of the law. Leaving his law career caused some discord with his family, but Honoré held firm.\n\nEarly Career\n\nHonoré began his attempts at a literary career as a playwright, then, under a pseudonym, as a co-writer of “potboiler” novels: quickly-written, often scandalous novels, the equivalent of modern-day “trashy” paperbacks. He tried his hand at journalism, commenting on the political and cultural state of the post-Napoleon era in France, and failed miserably at his business venture when he tried to make a living as a publisher and printer.\n\nIn this literary era, two specific subgenres of novels were in vogue both critically and popularly: historical novels and personal novels (that is, those which narrate a specific person’s life in detail). Honoré embraced this style of writing, bringing his own experiences with debtors, the printing industry, and the law into his novels. This experience set him apart from the bourgeois novelists of the past and many of his contemporaries, whose knowledge of other ways of life was entirely gleaned from previous writers’ depictions.\n\nLa Comedie Humaine\n\nIn 1829, he wrote Les Chouans, the first novel he published under his own name. This would become the first entry into his career-defining work: a series of intertwined stories depicting various facets of French life during the Restoration and July Monarchy periods (that is, from about 1815 to 1848). When he published his next novel, El Verdugo, he again used a new name: Honoré de Balzac, rather than just “Honoré Balzac.” The “de” was used to denote noble origins, so Honoré adopted it in order to better fit into respected circles of society.\n\nIn many of the novels that make up La Comedie Humaine, Honoré moved between sweeping portraits of French society as a whole and the small, intimate details of individual lives. Among his most successful works were La Duchesse de Langeais, Eugenie Grandet, and Pere Goriot. The novels ranged hugely in length, from the thousand-page epic Illusions Perdues to the novella La Fille aux yeux d’or.\n\nThe novels in this series were notable for their realism, particularly when it came to their characters. Rather than writing characters who were paragons of good or evil, Honoré depicted people in a much more realistic, nuanced light; even his minor characters were shaded with different layers. He also gained a reputation for his naturalistic depictions of time and place, as well as driving narratives and intricate relationships.\n\nHonoré’s writing habits were the stuff of legend. He could write for fifteen or sixteen hours a day, with copious amounts of coffee to fuel his concentration and energy. In many instances, he became obsessed with perfecting the smallest details, often making change after change. This didn’t necessarily stop when the books were sent off to the printers, either: he frustrated many a printer by rewriting and editing even after the proofs were sent to him.\n\nSocial and Family Life\n\nDespite his obsessive work life, Honoré managed to have a thriving social life. He was popular in society circles for his storytelling prowess, and he counted other famous figures of the day – including fellow novelist Victor Hugo – among his acquaintance. His first love was Maria Du Fresnay, a fellow writer who was unhappily married to a much older man. She bore Honoré’s daughter, Marie-Caroline Du Fresnay, in 1834. He had also had an earlier mistress, an older woman by the name of Madame de Berny, who had saved him from financial ruin prior to his novelistic success.\n\nHonoré’s great love story, though, began in a way that seems like something from a novel. He received an anonymous letter in 1832 that criticized the cynical depictions of faith and of women in one of his novels. In response, he posted an advertisement in a newspaper to attract his critic’s attention, and the pair began a correspondence that lasted fifteen years. The person on the other side of these letters was Ewelina Hanska, a Polish countess. Honoré and Ewelina were both highly intelligent, passionate people, and their letters were full of such topics. They first met in person in 1833.\n\nHer much-older husband died in 1841, and Honoré traveled to St. Petersburg, where she was staying, in 1843 to meet her again. Because they both had complicated finances, and Ewelina’s family was mistrusted by the Russian tsar, they were unable to marry until 1850, by which time they were both suffering health issues. Honoré had no children with Ewelina, although he did father children from other earlier affairs.\n\nDeath and Literary Legacy\n\nHonoré only enjoyed his marriage for a few months before he fell ill. His mother arrived in time to say goodbye, and his friend Victor Hugo visited him on the day before his death. Honoré de Balzac died quietly on August 18, 1850. He is buried in Pere Lachaise Cemetery in Paris, and a statue of him, the Balzac Monument, sits at a nearby intersection.\n\nThe greatest legacy Honoré de Balzac left behind was the use of realism in the novel. The structure of his novels, in which the plot is presented in sequential order by an omniscient narrator and one event causes another, was influential for many later writers. Literary scholars have also focused on his exploration of the links between social standing and character development, as well as a belief in the strength of the human spirit that has endured to this day.\n\nSources"}, {"url": "https://www.britannica.com/biography/Victor-Hugo", "page_content": "Victor Hugo is remembered as a beloved writer of the people, who knew how to write with simplicity and power of common joys and sorrows. He is also remembered for the verbal inventiveness and technical virtuosity with which he created poems ranging from intimate lyrics to visionary and prophetic epics.\n\nVictor Hugo was an influential proponent of Romanticism . In a preface to his verse play Cromwell (1827), he called for a drama of action—which he saw as appropriate to modern man, the battleground of matter and spirit—that could transcend Classical categories and mix the sublime and the grotesque.\n\nPoet , novelist, and dramatist Victor Hugo is considered the most important of the French Romantic writers. Though regarded in France as one of that country’s greatest poets, he is better known abroad for such novels as Notre-Dame de Paris (1831; The Hunchback of Notre-Dame) and Les Misérables (1862).\n\nVictor Hugo , in full Victor-Marie Hugo , (born February 26, 1802, Besançon , France—died May 22, 1885, Paris), poet, novelist, and dramatist who was the most important of the French Romantic writers. Though regarded in France as one of that country’s greatest poets, he is better known abroad for such novels as Notre-Dame de Paris (1831) and Les Misérables (1862).\n\nHugo emerged as a true Romantic, however, with the publication in 1827 of his verse drama Cromwell . The subject of this play, with its near-contemporary overtones, is that of a national leader risen from the people who seeks to be crowned king. But the play’s reputation rested largely on the long, elaborate preface, in which Hugo proposed a doctrine of Romanticism that for all its intellectual moderation was extremely provocative. He demanded a verse drama in which the contradictions of human existence—good and evil, beauty and ugliness, tears and laughter—would be resolved by the inclusion of both tragic and comic elements in a single play. Such a type of drama would abandon the formal rules of classical tragedy for the freedom and truth to be found in the plays of William Shakespeare . Cromwell itself, though immensely long and almost impossible to stage, was written in verse of great force and originality. In fact, the preface to Cromwell, as an important statement of the tenets of Romanticism, has proved far more important than the play itself.\n\nIn 1823 he published his first novel, Han d’Islande, which in 1825 appeared in an English translation as Hans of Iceland. The journalist Charles Nodier was enthusiastic about it and drew Hugo into the group of friends, all devotees of Romanticism , who met regularly at the Bibliothèque de L’Arsenal. While frequenting this literary circle, which was called the Cénacle , Hugo shared in launching a new review of moderate tendencies, the Muse Française (1823–24). In 1824 he published a new verse collection, Nouvelles Odes, and followed it two years later with an exotic romance, Bug-Jargal (Eng. trans. The Slave King). In 1826 he also published Odes et ballades, an enlarged edition of his previously printed verse, the latest of these poems being brilliant variations on the fashionable Romantic modes of mirth and terror. The youthful vigour of these poems was also characteristic of another collection, Les Orientales (1829), which appealed to the Romantic taste for Oriental local colour. In these poems Hugo, while skillfully employing a great variety of metres in his verse and using ardent and brilliant imagery, was also gradually shedding the legitimist royalism of his youth. It may be noted, too, that “Le Feu du ciel,” a visionary poem, forecast those he was to write 25 years later. The fusion of the contemporary with the apocalyptic was always a particular mark of Hugo’s genius.\n\nFrom 1816, at least, Hugo had conceived ambitions other than the law. He was already filling notebooks with verses, translations—particularly from Virgil —two tragedies, a play, and elegies. Encouraged by his mother, Hugo founded a review, the Conservateur Littéraire (1819–21), in which his own articles on the poets Alphonse de Lamartine and André de Chénier stand out. His mother died in 1821, and a year later Victor married a childhood friend, Adèle Foucher, with whom he had five children. In that same year he published his first book of poems, Odes et poésies diverses, whose royalist sentiments earned him a pension from Louis XVIII . Behind Hugo’s concern for classical form and his political inspiration, it is possible to recognize in these poems a personal voice and his own particular vein of fantasy.\n\nVictor was the third son of Joseph-Léopold-Sigisbert Hugo, a major and, later, general in Napoleon ’s army. His childhood was coloured by his father’s constant traveling with the imperial army and by the disagreements that soon alienated his parents from one another. His mother’s royalism and his father’s loyalty to successive governments—the Convention, the Empire, the Restoration—reflected their deeper incompatibility. It was a chaotic time for Victor, continually uprooted from Paris to set out for Elba or Naples or Madrid , yet always returning to Paris with his mother, whose royalist opinions he initially adopted. The fall of the empire gave him, from 1815 to 1818, a time of uninterrupted study at the Pension Cordier and the Lycée Louis-le-Grand, after which he graduated from the law faculty at Paris, where his studies seem to have been purposeless and irregular. Memories of his life as a poor student later inspired the figure of Marius in his novel Les Misérables.\n\nSuccess (1830–51)\n\nThe defense of freedom and the cult of an idealized Napoleon in such poems as the ode “À la Colonne” and “Lui” brought Hugo into touch with the liberal group of writers on the newspaper Le Globe, and his move toward liberalism was strengthened by the French king Charles X’s restrictions on the liberty of the press as well as by the censor’s prohibiting the stage performance of his play Marion de Lorme (1829), which portrays the character of Louis XIII unfavourably. Hugo immediately retorted with Hernani, the first performance of which, on February 25, 1830, gained victory for the young Romantics over the Classicists in what came to be known as the battle of Hernani. In this play Hugo extolled the Romantic hero in the form of a noble outlaw at war with society, dedicated to a passionate love and driven on by inexorable fate. The actual impact of the play owed less to the plot than to the sound and beat of the verse, which was softened only in the elegiac passages spoken by Hernani and Doña Sol.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nWhile Hugo had derived his early renown from his plays, he gained wider fame in 1831 with his historical novel Notre-Dame de Paris (Eng. trans. The Hunchback of Notre-Dame), an evocation of life in medieval Paris during the reign of Louis XI. The novel condemns a society that, in the persons of Frollo the archdeacon and Phoebus the soldier, heaps misery on the hunchback Quasimodo and the gypsy girl Esmeralda. The theme touched the public consciousness more deeply than had that of his previous novel, Le Dernier Jour d’un condamné (1829; The Last Days of a Condemned), the story of a condemned man’s last day, in which Hugo launched a humanitarian protest against the death penalty. While Notre-Dame was being written, Louis-Philippe, a constitutional king, had been brought to power by the July Revolution. Hugo composed a poem in honour of this event, Dicté aprés juillet 1830. It was a forerunner of much of his political verse.\n\nFour books of poems came from Hugo in the period of the July Monarchy: Les Feuilles d’automne (1831; “Autumn Leaves”), intimate and personal in inspiration; Les Chants du crépuscule (1835; Songs of Twilight), overtly political; Les Voix intérieures (1837; “Inner Voices”), both personal and philosophical; and Les Rayons et les ombres (1840; “Sunlight and Shadows”), in which the poet, renewing these different themes, indulges his gift for colour and picturesque detail. But Hugo was not content merely to express personal emotions; he wanted to be what he called the “sonorous echo” of his time. In his verse political and philosophical problems were integrated with the religious and social disquiet of the period; one poem evoked the misery of the workers, another praised the efficacy of prayer. He addressed many poems to the glory of Napoleon, though he shared with his contemporaries the reversion to republican ideals. Hugo restated the problems of his century and the great and eternal human questions, and he spoke with a warmhearted eloquence and reasonableness that moved people’s souls.\n\nSo intense was Hugo’s creative activity during these years that he also continued to pour out plays. There were two motives for this: first, he needed a platform for his political and social ideas, and, second, he wished to write parts for a young and beautiful actress, Juliette Drouet, with whom he had begun a liaison in 1833. Juliette had little talent and soon renounced the stage in order to devote herself exclusively to him, becoming the discreet and faithful companion she was to remain until her death in 1883. The first of these plays was another verse drama, Le Roi s’amuse (1832; Eng. trans. The King’s Fool), set in Renaissance France and depicting the frivolous love affairs of Francis I while revealing the noble character of his court jester. This play was at first banned but was later used by Giuseppe Verdi as the libretto of his opera Rigoletto. Three prose plays followed: Lucrèce Borgia and Marie Tudor in 1833 and Angelo, tyran de Padoue (“Angelo, Tyrant of Padua”) in 1835. Ruy Blas, a play in verse, appeared in 1838 and was followed by Les Burgraves in 1843.\n\nHugo’s literary achievement was recognized in 1841 by his election, after three unsuccessful attempts, to the French Academy and by his nomination in 1845 to the Chamber of Peers. From this time he almost ceased to publish, partly because of the demands of society and political life but also as a result of personal loss: his daughter Léopoldine, recently married, was accidentally drowned with her husband in September 1843. Hugo’s intense grief found some mitigation in poems that later appeared in Les Contemplations, a volume that he divided into “Autrefois” and “Aujourd’hui,” the moment of his daughter’s death being the mark between yesterday and today. He found relief above all in working on a new novel, which became Les Misérables, published in 1862 after work on it had been set aside for a time and then resumed.\n\nWith the Revolution of 1848, Hugo was elected a deputy for Paris in the Constituent Assembly and later in the Legislative Assembly. He supported the successful candidacy of Prince Louis-Napoléon for the presidency that year. The more the president evolved toward an authoritarianism of the right, however, the more Hugo moved toward the assembly’s left. When in December 1851 a coup d’état took place, which eventually resulted in the Second Empire under Napoleon III, Hugo made one attempt at resistance and then fled to Brussels."}, {"url": "https://www.biography.com/musician/hector-berlioz", "page_content": "(1803-1869)\n\nWho Was Hector Berlioz?\n\nHector Berlioz turned his back on a career in medicine to follow his passion for music, and went on to compose works that showcased the innovativeness and search for expression that were hallmarks of Romanticism. His well-known pieces include the Symphonie fantastique and Grande messe des morts. At the age of 65, Berlioz died in Paris on March 8, 1869.\n\nEarly Life\n\nLouis-Hector Berlioz was born on December 11, 1803, in La Côte-St-André, Isère, France (near Grenoble). Hector Berlioz, as he was known, was entranced with music as a child. He learned to play the flute and guitar, and became a self-taught composer.\n\nHeeding his physician father's wishes, Berlioz went to Paris in 1821 to study medicine. However, much of his time was spent at the Paris-Opéra, where he absorbed Christoph Willibald Gluck's operas. Two years later, he left medicine behind to become a composer.\n\nBeginning a Career in Music\n\nIn 1826, Berlioz enrolled at the Paris Conservatoire. The next year, he saw Harriet Smithson in the role of Ophelia and became captivated by the Irish actress. His ardor inspired the Symphonie fantastique (1830), a piece that broke new ground in orchestral expression. With its use of music to relate a story of desperate passion, it was a hallmark of Romantic composition.\n\nFollowing three unsuccessful attempts to win the Prix de Rome, Berlioz finally succeeded in 1830. After spending more than a year in Italy, he headed back to Paris, where a performance of his \"fantastic symphony\" took place in 1832. Smithson attended the concert; after meeting the woman who had haunted him, Berlioz married her the next year.\n\nThe 1830s saw Berlioz produce more of his inventive compositions, such as the symphony Harold en Italie (1834) and the impressive choral work Requiem, Grande messe des morts (1837). However, an opera, Benvenuto Cellini (1838), flopped. Berlioz was often forced to rely on music criticism and other writing jobs to make ends meet, though a large financial gift from violinist Niccolò Paganini helped him write the choral symphony Roméo et Juliette (1839). That same year he was appointed as a deputy librarian at the Paris Conservatory. Around this time, he began making a comfortable living off of being a music critic, but he found himself feeling artistically frustrated since he was spending less time working on his own compositions.\n\nGrowing Musical Success\n\nIn the 1840s, touring throughout Europe began to offer Berlioz another source of income; he was particularly appreciated as a conductor in Germany, Russia and England. When the production of another choral work, La Damnation de Faust, became a financial sinkhole after its premiere in 1846, touring again came to the rescue.\n\nBerlioz found his financial footing in the 1850s, when his L'Enfance du Christ (1854) was a success and he was elected to the Institut de France, thus enabling him to receive a stipend. He wrote Les Troyens, inspired by Virgil's Aeneid, at this time, but only got to see a few of the opera's acts be performed in 1863. He also returned to William Shakespeare once more, creating the opera Béatrice et Bénédict (based on Much Ado About Nothing), which had a successful debut in Germany in 1862.\n\nLater Years and Legacy\n\nFollowing more European tours, a lonely Berlioz returned to Paris in 1868. His marriage to Smithson had not lasted, and his second wife had passed away in 1862. He had lost his only child, Louis, in 1867. At the age of 65, he died in Paris on March 8, 1869.\n\nBerlioz left behind many innovative compositions that had set the tone for the Romantic period; though the originality of his work may have worked against him during his lifetime, appreciation of his music would continue to grow after his death.\n\nQUICK FACTS\n\nName: Hector Berlioz\n\nBirth Year: 1803\n\nBirth date: December 11, 1803\n\nBirth City: La Côte-Saint-André, Isère\n\nBirth Country: France\n\nGender: Male\n\nBest Known For: French composer Hector Berlioz followed the ideals of 19th century Romanticism in musical creations such as the Symphonie fantastique and La Damnation de Faust.\n\nIndustries\n\nOpera\n\n\n\nClassical\n\nAstrological Sign: Sagittarius\n\nSchools\n\nParis Conservatoire\n\nNacionalities\n\nFrench\n\nInteresting Facts\n\nFamed violinist Niccolò Paganini so appreciated Hector Berlioz's work that he gave him a present of 20,000 francs.\n\nDeath Year: 1869\n\nDeath date: March 8, 1869\n\nDeath City: Paris\n\nDeath Country: France\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Hector Berlioz Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/musicians/hector-berlioz\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: May 17, 2021\n\nOriginal Published Date: April 3, 2014\n\nQUOTES"}, {"url": "https://www.biography.com/artist/jacques-louis-david", "page_content": "(1748-1825)\n\nWho Was Jacques-Louis David?\n\nJacques-Louis David was a painter of great renown as his style of history painting helped end the frivolity of the Rococo period, moving art back to the realm of classical austerity. One of David's most famous works, \"The Death of Marat\" (1793), portrays the famous French Revolutionary figure dead in his bath after an assassination.\n\nEarly Life\n\nDavid was born on August 30, 1748, in Paris, France. His father was killed in a duel in when David was 9 years old, and the boy was subsequently left by his mother to be raised by two uncles.\n\nWhen David showed an interest in painting, his uncles sent him to François Boucher, a leading painter of the time and family friend. Boucher was a Rococo painter, but the Rococo era was giving way to a more classical style, so Boucher decided to send David to his friend Joseph-Marie Vien, a painter more in tune with the neoclassical reaction to Rococo.\n\nBy age 18, the gifted young artist was enrolled at the Académie Royale (Royal Academy of Painting and Sculpture). After several failures in competitions and finding more discouragement than support, during a period that included a suicide attempt (apparently by avoiding food), in 1774, he finally obtained the Prix de Rome, a government scholarship that ensured well-paid commissions in France. Also included in the scholarship was a trip to Italy, and in 1775, he and Vien went to Rome together, where David studied Italian masterpieces and the ruins of ancient Rome.\n\nBefore he left Paris, he proclaimed, \"The art of antiquity will not seduce me, for it lacks liveliness,\" and the works of the great masters almost held him to his word, such was the pull of their genius. Instead, though, he became interested in the Neoclassical ideas originated in Rome by, among others, German painter Anton Raphael Mengs and art historian Johann Joachim Winckelmann.\n\nBack in Paris in 1780, and to much acclaim, David exhibited \"Belisarius Asking Alms,\" in which he combined his own approach to antiquity with a Neoclassical style reminiscent of Nicolas Poussin. In 1782, David married Marguerite Pécoul, whose father was an influential building contractor and the superintendent of construction at the Louvre. David began to prosper at this point, and he was elected to the Académie Royale in 1784 on the heels of his \"Andromache Mourning Hector.\"\n\nA Rising Figure in the Art World\n\nThat same year, David returned to Rome to complete \"Oath of the Horatii,\" whose austere visual treatment — somber color, frieze-like composition and clear lighting — was a sharp departure from the prevailing Rococo style of the time. Exhibited in the official Paris Salon of 1785, the painting created a sensation and was regarded as a declaration of an artistic movement (revival, in fact) that would put an end to the delicate frivolity of the Rococo period. It also came, before too long, to symbolize the end of aristocratic corruption and a return in France to the patriotic morals of republican Rome.\n\nIn 1787, David displayed \"Death of Socrates.\" Two years later, in 1789, he unveiled \"The Lictors Bringing to Brutus the Bodies of His Sons.\" At this point, the French Revolution had begun, and, thusly, this portrayal of Brutus — the patriotic Roman consul who ordered the deaths of his traitorous sons to save the republic—took on political significance, as did David himself.\n\nThe French Revolution\n\nIn the early years of the Revolution, David was a member of the extremist Jacobin group led by Maximilien de Robespierre, and he became an active, politically committed artist involved in a good deal of revolutionary propaganda. He produced such works as \"Joseph Bara\", the sketched \"Oath of the Tennis Court\" and \"Death of Lepeletier de Saint-Fargeau\" during this period, all with revolutionary themes marked by martyrdom and heroics in the face of the establishment.\n\nDavid's revolutionary inspiration is ultimately best represented by \"The Death of Marat,\" painted in 1793, soon after the murder of revolutionary leader Jean-Paul Marat. This so-called \"piet of the Revolution\" is considered David's masterpiece. As one modern critic put it, the piece is \"a moving testimony to what can be achieved when an artist's political convictions are directly manifested in his work.\" Marat became an instant political martyr while the painting became a symbol of sacrifice in the name of the republic.\n\nElected to the National Convention in 1792, David voted for the execution of Louis XVI and Marie Antoinette. By 1793, David, having gained much power through his association with Robespierre, was effectively the art dictator of France. Once in this role, he promptly abolished the Académie Royale (whether out of spite for his struggles there years before, or by a desire for a complete overhaul of every system in place, remains unclear).\n\nPost-Revolution and Later Years\n\nBy 1794, Robespierre and his revolutionary allies had gone too far in silencing counter-revolutionary voices, and the people of France began to question his authority. In July of that year, it came to a head, and Robespierre was sent to the guillotine. David was arrested, remaining in prison until the amnesty of 1795.\n\nUpon release, David devoted his time to teaching. With the same energy he had spent on revolutionary politics, he trained hundreds of young European painters, among them such future masters as Franois Gérard and Jean-Auguste-Dominique Ingres. (Some 60 years later, Eugene Delacroix would refer to David as the \"father of the whole modern school.\") He also became the official painter of Napoleon I.\n\nDavid had admired Napoleon since their first meeting and sketched him for the first time in 1797. After Napoleon's coup in 1799, he commissioned David to commemorate his crossing of the Alps: David painted \"Napoleon Crossing the Saint-Bernard\" (also known as \"Napoleon Crossing the Alps\"). Napoleon named David court painter in 1804.\n\nAfter Napoleon fell in 1815, David was exiled to Brussels, Belgium, where he lost much of his old creative energy. Ten years into his exile, he was struck by a carriage, sustaining injuries from which he would never recover.\n\nDeath\n\nDavid died on December 29, 1825, in Brussels, Belgium. Because he had participated in the execution of King Louis XVI, David was not allowed to be buried in France, so he was buried at Evere Cemetery in Brussels. His heart, meanwhile, was buried at the Père Lachaise Cemetery in Paris.\n\nQUICK FACTS\n\nName: Jacques-Louis\n\nBirth Year: 1748\n\nBirth date: August 30, 1748\n\nBirth City: Paris\n\nBirth Country: France\n\nGender: Male\n\nBest Known For: Jacques-Louis David was a 19th-century painter who is considered to be the principal proponent of the Neoclassical style. His most famous works include \"The Death of Marat\" and \"Napoleon Crossing the Alps.\"\n\nIndustries\n\nArt\n\nAstrological Sign: Virgo\n\nSchools\n\nCollège des Quatre-Nations\n\n\n\nAcadémie Royale (Royal Academy of Painting and Sculpture)\n\nNacionalities\n\nFrench\n\nDeath Year: 1825\n\nDeath date: December 29, 1825\n\nDeath City: Brussels\n\nDeath Country: Belgium\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Jacques-Louis David Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/artists/jacques-louis-david\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: April 13, 2021\n\nOriginal Published Date: April 2, 2014\n\nQUOTES"}]}