{"Honoré IV was a member of the House of Grimaldi, a Genoese family that had ruled Monaco since 1297.": [{"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iv-prisoner-of-the-french-revolution-2/", "page_content": "Prince Honoré IV was born on May 17, 1758 in Paris, to his parents Prince Honoré III and Princess Maria-Caterina de Brignole-Sale. This prince, perhaps, experienced more challenges in life than any other Grimaldi. Most of his hardships were caused by the French Revolution, and the last hours of his life are still shrouded in mystery …\n\nThe victims of the Great Terror\n\nPrince Honoré IV was unlucky enough to be living in Paris when the Reign of Terror broke out in France. As a nobleman and prince he was soon arrested and thrown into prison. The prince’s former wife, Duchess of Mazarin, was also taken into custody. Assisted by their family doctor, however, she managed to escape and hide with her youngest son Florestan.\n\nThe revolution did not spare the family of Prince’s Honore IV’s youngest brother, Joseph. His wife, Marie Thérèse de Choiseul, was arrested on suspicion of espionage and executed by guillotine. She was only 27, leaving behind three little daughters.\n\nAs for Prince Honoré, he was imprisoned for one and a half years. This time in prison greatly undermined his health, and he never fully recovered from it afterwards. On March 21, 1795 his father died and Honoré IV ascended the throne of Monaco. At that time the monarchy had just been banned and Monaco was once again annexed to the French Republic under the name of Port Hercule.\n\nEven after Prince Honoré was released from prison, it took another seven years of negotiations before the French regime restored some of Honoré IV’s and his brother Prince Joseph’s income. The future started to look brighter for the Grimaldi’s once the radical revolutionary regime was followed by the French consulate and, finally, by the First French Empire of Napoleon Bonaparte.\n\nReturn to the throne\n\nWhen the Napoleonic Wars finally came to an end, the status of Monaco was restored by the Congress of Vienna (1814–1815) thanks to the efforts of Prince Talleyrand. On May 30, 1814 Honoré IV was officially named the Principality’s ruler. However, he was too ill to take control of his country. So it was his brother Prince Joseph who became regent.\n\nThe Prince’s eldest son, 36-year-old Honoré Gabriel, however, was not happy about this decision. A brilliant soldier, he entered the cavalry service at the age of 20 and prospered in the army of the Empire Marshal, Emmanuel de Grouchy. Since Prince Joseph was not particularly eager to deal with the Principality’s affairs, preferring his life in the capital, he easily facilitated handing over the reins to his nephew, Honoré Gabriel, who ruled Monaco up until the death of Honoré IV (later becoming Prince Honoré V). As for Honoré IV, he lived in Paris until his very death which remains mysterious to this day…\n\nAccident or murder ..?\n\nOn a winter’s day of February 16, 1819, Honoré IV drowned in the Seine river. The death of the Monaco prince looked like a typical accident. That’s what the investigation concluded as an official version. It must not be forgotten, however, that Honoré IV was not a very healthy person, to say the least. This is the reason why he was not only unwilling, but was also physically unfit to rule the country. Imprisonment and numerous personal tragedies had taken their toll on the Prince, making him, for all intents and purposes, disabled. This is what the scanty preserved data suggests. A legitimate question arises: how could a 60-year-old monarch, in deplorable physical state, manage to cover such a considerable distance away from home (Avenue Denfert-Rochereau) to the Seine river bank..?\n\nWas it really an accident? Or rather a premeditated murder? Or could it be that the Prince decided to put an end to his own unhappy life? Being a depressed person, did he step into the Seine himself..? The answer remains a mystery.\n\nThe main legacy of Prince Honore IV\n\nAs Prince of Monaco, Honoré IV suffered three arrests and never actually ruled Monaco. He spent part of his life in a prison cell and the rest, trying to improve his health. Needless to say, there are very few mentions of the Prince, even in the archives of Monaco. His most important contribution to the history of Monaco was the birth of his two sons — the future princes, Honoré V and Florestan I, who consistently ruled the Principality and left their mark on the state’s history."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iii-one-of-the-longest-reigns-in-european-history-en/", "page_content": "Everybody knows that the reign of French King Louis XIV, ‘Le Roi Soleil’, was the longest in European history. Two British Queens — Elizabeth II who will celebrate 70 years on the throne in 2022 and her great-great-grandmother Victoria (who reigned for 63 years) also had lengthy reigns. But few know that the fifth prince of Monaco is also on the list of the longest-reigning European monarchs: after coming to the Monegasque throne in 1733 he reigned for nearly 60 years and so passed his ancestor Honoré, Lord of Monaco, who ruled for 58 years in the XVI century.\n\nAscension to the Throne at the age of 13\n\nHonoré Camille Léonor Grimaldi was born on November 10, 1720. He was the son of Louise-Hyppolite, and the grandson of Prince Antoine I, who both died in 1731. Honoré came to the throne just after turning 13 when his father, Prince Jacques I, abdicated. Prince Honoré III spent much of his time away on campaign with the Royal French Army fighting the English in the War of the Austrian Succession. Honoré III was wounded fighting in the French victory at Rocoux. Later, he earned the Cross of St Louis for his conduct and after the Peace of Aix-la-Chapelle in 1748 he was given the rank of Marshal of France.\n\nWhat is interesting is that despite the heroic service of Honoré III in the wars, the Principality of Monaco was neutral in the conflict and, administered by the Chevalier de Grimaldi, assisted both French and English ships in need of help. The Austrians and Sardinians did blockade the Monegasque coast for a time and much of the countryside was pillaged by Croat soldiers of the Austrian army but French forces later cleared the region of all invaders in 1748.\n\nThe Royal Marriage\n\nIn 1757 Honoré III married Maria Caterina di Brignole-Sale who was descended from the Doges of Genoa and called “the most beautiful woman in France”. They were a very proud family and the arrival of the bride-to-be in Monaco turned into a disaster as many of the bridal attendants were seasick and the future mother-in-law insisted that Honoré III come onboard to greet his fiancé and escort her ashore. However, as a monarch in his own right, Honoré III refused as it was considered a breach of protocol for a prince to go to meet someone rather than them being brought to meet him. A stand-off ensued and eventually the Genoese fleet sailed away and stopped farther up the coast before a compromise was negotiated by which the couple would meet in the middle of a bridge extended between ship and shore. Nonetheless, the two were married and in 1758 the future Prince Honoré IV was born followed by Prince Joseph some years later. In 1770, though, Honoré III and Princess Maria Caterina divorced, and she later married the Prince de Condé in 1798.\n\nIn 1767 the British Duke of York was sailing from Marseilles to Genoa when he was suddenly taken ill and had to put in at Monaco. Prince Honoré III quickly offered all the help he could and put his palace at the disposal of the Prince who died after 11 days in what has forever after been known as the York Room of the Princely Palace.\n\nIn the meantime Prince Honoré III did what he could to guide his little principality along, improving trade and the economy which was heavily dependent on growing citrus fruits such as lemons in those days. His reign also saw the establishment of the first printing press in Monaco and the first newspaper the ‘Courrier de Monaco’. Prince Honoré III did take the initiative in pushing for some reforms, the most major of which was the repeal of the law that the Sovereign Prince would receive the inheritance of anyone who died on his property. On August 18, 1770 Honoré saw the practice, which he viewed as barbaric, abolished.\n\nThe French Revolution, Arrest and Imprisonment\n\nAs France slipped increasingly rapidly towards revolution things in Monaco remained calm and peaceful until the fateful day of July 14, 1789; the date of the storming of the Bastille. The shock spread to Monaco where crowds embraced the Declaration of the Rights of Man, influenced by the rise of republicanism in France as well as some newly introduced nostalgia for the Genoese Republic. Honoré III was concerned with the loss of his noble titles in France at the hands of the French National Constituent Assembly which was intent on abolishing all aristocratic privileges and soon he rushed to Paris to try to defend his titles there before the Constituent Assembly.\n\nHonoré III was extremely convincing when dealing with the French revolutionaries. His estates were, he insisted, not the gift of the King of France alone but payment for services rendered in the cause of French national glory. He struck just the right cord and the Assembly voted a generous pension for the Prince of Monaco in reparation for his confiscated properties.\n\nUnfortunately, before the order could be carried out, Danton came to power and the republic was declared. In all the turmoil France lost interest in Monaco and ultimately all Honoré was able to gain was recognition from the republican government of Monegasque neutrality. Unfortunately, that was a promise that would never be respected.\n\nThe French Republic declared their expansionist policy at the end of 1792. Monaco quickly fell victim to this policy and on January 13, 1793 Prince Honoré III was officially declared deposed by the Monegasque National Convention. Members of the Convention immediately filed a petition for accession to France. Some people in France however did protest on the grounds that Honoré III had always been a loyal friend and ally of the French, but republican hatred of monarchy prevailed and Monaco was absorbed into the French Republic and renamed Fort Hercules.\n\nAt the height of the Reign of Terror Honoré III was arrested as was his son, Honoré IV, who had been in Paris at the time and who would remain imprisoned for 15 months. Honoré III had suffered greatly from his own imprisonment and after his release had to stay in his house on the rue de Varennes as the Princely Palace in Monaco had been confiscated by the revolution though, thankfully, there was no ‘Reign of Terror’ or mass arrests and bloodshed in Monaco. Overcome with sadness, suffering, a number of ailments and the ravages of old age Prince Honoré III of Monaco died on March 21, 1795.\n\nIn 2020, the Principality paid a tribute to Prince Honoré III by having issued a 2€ commemorative coin celebrating the 300th anniversary of his birth. At the time of writing, the price of the coin, which was issued in 15,000 copies, has reached in the region of €300."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/grimaldi-family-the-legacy-of-prince-honore-v/", "page_content": "Prince Honoré-Gabriel was born in Paris on May 14, 1778, the eldest son of Prince Honoré IV of Monaco and Princess Louise Felicite Victoire d’Aumont, Duchesse de Mazarin et de La Meilleraye.\n\nHe enlisted in a French cavalry regiment when he was 20 years old and worked his way up through the ranks by his own merits until he became an officer on the staff of Marshal Grouchy. He was an exemplary soldier and was cited for his bravery many times. He was wounded in the arm at the great Napoleonic victory in the battle of Hohenlinden which prevented him from seeing action at Austerlitz.\n\nHe did serve with great distinction at the battles of Jena with Marshal Murat’s cavalry corps. Marshal Grouchy recommended him for the star of the Legion of Honor, relating that the Prince had taken a handful of cavalry and forced the surrender of an entire enemy battalion.\n\nWhen Napoleon was sent into exile the restored King Louis XVIII of France restored the Grimaldis to their places in the French nobility. Grandson of Honoré III and son of Honoré IV, Honoré V (1778-1841) was therefore too named, after the restoration of 1814, member of the House of Peers by king Louis XVIII. But many were afraid that Monegasque independence would not be or that they would be annexed by the Kingdom of Piedmont-Sardinia. Thanks to the Prince Talleyrand, however, a clause was inserted into the Treaty of Paris to put Monaco back in order. When Napoleon attempted to restore his empire during the 100 days Monaco was occupied by British troops and so the Grimaldis played no part in the affair.\n\nHonoré IV was unable to return to Monaco because of his poor health and so appointed his brother Joseph to rule on his behalf. But Honoré-Gabriel didn’t like that idea and he protested fiercely this and after some struggle he was himself appointed to govern Monaco.\n\nOn his way to Monaco he met with his old commander Napoleon as he was on his way to Paris to seize power at the start of the 100 days. Napoleon asked where he was going and Honoré-Gabriel said he was going home to Monaco. Napoleon said he was going home to the Tuileries, but as things unfolded he was not to remain there long.\n\nIn 1819, when his father passed away, Honoré-Gabriel became the Sovereign Prince of Monaco as Honoré V and inherited a Principality beset with problems. At once a member of the French Parliament and a Sovereign, he picked up on the project of his grandfather to diversify economic resources and encouraged the installation of factories. The Great Powers of Europe had taken Monaco out of the French sphere of influence and made the Principality a protectorate of Piedmont-Sardinia. The government in Turin closed the tobacco plant that Honoré III had established and enforced a number of other changes that left Monaco impoverished.\n\nHonoré V went to Turin to try to reason with the King but, although he was treated with great honor and respect, none of his grievances were addressed. Honoré V also had to raise taxes considerably which made him increasingly unpopular. His granting of a monopoly on flour caused a bread shortage but no one had the nerve to voice opposition to him. He also pushed opportunities for tourism. However, the lack of a market for local products, the omnipresence of the State and the lack of presence of the Sovereign created tensions, especially in Menton. The sovereign ended up pacifying Menton before going forward with his effort to provide the Principality with amenities. By his own admission he “desired to do good” but “did not manage to”, despite his philanthropic ideals.\n\nWhen liberal movements began to oppose the counter revolutionary tide of post-Napoleonic Europe some in Monaco thought of joining in but Sardinian troops arrived to crush the potential rebellion in its infancy.\n\nHistory has tended to record Prince Honoré V as a very unpopular and autocratic monarch, but, in reality he was quite progressive. He wished to help his people sincerely and had great sympathy for the poor. His reaction to seeing beggars on the streets was to form state-owned industries and put them to work. Some of the industries he set up included a lace factory and a hat factory. He also had them put to work on farm cooperatives as citrus orchards had long been a large part of the Monegasque economy. All of this has led some people to regard Prince Honoré V as a sort of socialist, though he probably would not have seen it that way.\n\nPrince Honore V died, unpopular and unappreciated on October 2, 1841 in Paris. As he was not married and had no children the Monegasque throne passed to his poet-actor brother who became Prince Florestan I of Monaco."}, {"url": "https://www.wikinut.com/guides/history/dark-curse-on-house-of-grimaldi/", "page_content": "In 1297 the Grimaldis who had been forced from their castle home, Monaco by their rivals, the Spinola family, later entered into some territorial alliances, that would enable them to take back Monaco forcibly. It was the turn of the Spinola family, to be banished from the City. This is, therefore, where the story of Francesco Grimaldi and his faction, who had conquered the castle of Monaco under the disguise of friars as well as the so-called Grimaldi curse, had originated from.\n\nThe Curse\n\nPrince Ernst August of Hanover, the husband of Princess Caroline of Monaco, was rushed to hospital while her late father, Prince Rainier, who had passed away, was yet to be buried at the time. This had lent credence to the belief in the curse on the dynasty of Prince Ranier Grimaldi.\n\nCaroline’s third husband, 51-year-old, Prince August, was admitted to intensive care at the Princess Grace Hospital in Monaco, he was diagnosed with an acute pancreatic disorder, a condition frequently associated with heavy drinking. The prince whose unruly behavior often landed him in the tabloids and court.\n\nThe prince’s illness revived the strange notion of the curse on Grimaldi that has supposedly hung over the Grimaldi lineage during its seven centuries of rule in Monaco. After the first Grimaldi, Francesco the Spiteful in 1297, who had tricked the principality’s defenders, the Spinola clan, by disguising himself as a monk seeking sanctuary, only to slaughter all of them, the curse decrees that the family would have short, unhappy marriages.\n\nConduct Unbecoming A Royal Prince\n\nPrince Ernst August broke protocol by kissing the Queen at a state banquet in Berlin. He also broke away from the Bild tabloid which published pictures of him, where he was urinating in public, against the Turkish Pavilion in Hanover. A German court, a year later, handed him eight months’ probation and a hefty fine for kicking a photographer in the buttocks and beating a Kenyan hotel owner.\n\nThe late Prince Rainier, whose marriage in 1956 to the Hollywood star Grace Kelly, was seen as a fairytale wedding, but the marriage was also strewn with bad luck.\n\nPrincess Grace died in a car crash in 1982, Caroline’s second husband in 1990, was killed in a motorboat accident. She married Ernst August in 1999 at Monaco’s royal palace and gave birth six months later to a daughter, Alexandra. Between them, they already had five children from previous marriages.\n\nPrincess Stephanie, meanwhile, had two children with her bodyguard Daniel Ducruet, before marrying him. She had a third child after their divorce, by another bodyguard, then she married a circus acrobat, which also ended in divorce.\n\nCharlene Tries To Escape Days Before Wedding\n\nPrince Albert, who had succeeded his father Prince Rainier in 2005, showed no sign of marrying or producing an heir at that time This would have led to Monaco becoming part of France once again. This was of course thwarted, five and a half years later by his glittering wedding, to Charlene Wittstock,33 of South Africa, last Saturday which included a guest list of scores of European royals, heads of state, and several fashion icons, actors, and sports idols.\n\nThe French press cited sources on Sunday, that Charlene had sought refuge in the South African embassy in Paris, in an attempt to get out of the wedding. This had resulted in her passport being confiscated by senior Palace officials and then persuading her to take part in the nuptials on the weekend.” Several sources have even confirmed that an arrangement was reached between the future bride and groom,” said a report in Le Journal du Dimanche (JDD), the French national newspaper, which provided no further details.\n\nIt followed confirmation by palace sources that Albert, 53, was due to undergo DNA tests because of claims by at least one unnamed woman that he has fathered yet another illegitimate child.\n\nSelect a list of Grimaldi’s\n\nGrimaldo, consul of the Republic of Genoa, founder of this House.\n\nHubert Grimaldi, first to bear the Grimaldi patronymic name.\n\nRainier I, lord of Cagnes, admiral of France\n\nCharles I, Lord of Monaco, Cagnes, and Menton\n\nAnthony, lord of Monaco, admiral of Genoa\n\nLuc and Marc Grimaldi of Antibes, lords of Menton, Cagnes, and Antibes\n\nLambert of Antibes and Claudia of Monaco\n\nAugustin, archbishop\n\nNicolas, prince of Salerno\n\nLouis I, Prince of Monaco, ambassador of Louis IV\n\nGiraloma Created a Cardinal in 1527. He married Francisca Cattaneo of Genoese and had five children. After her death, he entered holy orders. He was a Senator of Genoa.\n\nDomenico, Archbishop of Avignon and uncle of Girolamo Grimaldi-Cavalleroni (see below)\n\nGirolamo (1597 – 1683). Cardinal and Archbishop of Aix.\n\nGiraloma (1674-1733). Created a Cardinal 1731\n\nAlexander, doge of Genoa\n\nJohn Baptist, doge of Genoa\n\nPeter Francis, doge of Genoa\n\nHonoré II, Prince of Monaco (1597-1662)\n\nJacques François Leonor Grimaldi – Prince of Monaco and father of Honoré III, Prince of Monaco\n\nNicola ((1645-1717) Created cardinal deacon in the consistory of May 17, 1706\n\nLouise-Hippolyte, Princess of Monaco – mother of Honoré III, Prince of Monaco\n\nHonoré III, Prince of Monaco (1720-1795)\n\nHonoré IV, Prince of Monaco (1758-1819)\n\nHonoré V, Prince of Monaco (1778-1841)\n\nFlorestan I, Prince of Monaco (1785-1856)\n\nCharles III, Prince of Monaco (1818-1889)\n\nAlbert Honoré Charles Grimaldi (1848-1922)\n\nLouis Honoré Charles Antoine Grimaldi (1870-1949)\n\nPrince Pierre de Grimaldi, Count of Polignac (1895-1964)\n\nRainier Louis Henri Maxence Bertrand Grimaldi (1923-2005)\n\nAlbert Alexandre Louis Pierre Grimaldi (born 1958)\n\nStéphanie Marie Elisabeth Grimaldi (born 1965)\n\nPrincess Caroline Louise Marguerite (born 1957)\n\nFootnote :\n\nThe House of Grimaldi is associated with the history of the Republic of Genoa and the Principality of Monaco. The Grimaldi family descends from Grimaldo, a Genovese statesman at the time of the first Crusades. He was the son of Otto Canella, a Consul of Genoa in 1133, and in turn, Grimaldo became a Consul in 1160, 1170, and again in 1184. His numerous grandsons and their children led maritime expeditions throughout the Mediterranean, the Black Sea, and soon the North Sea, and quickly became one of the most powerful families of Genoa."}, {"url": "https://simple.wikipedia.org/wiki/Honor%C3%A9_III,_Prince_of_Monaco", "page_content": "Honoré III, Prince of Monaco (Honoré Camille Léonor; 10 November 1720 – 21 March 1795) was a reigning prince of the small state of Monaco. He succeeded his mother Louise Hippolyte and is to this day still one of the longest reigning European rulers.\n\nBrief biography [ change | change source ]\n\nThe eldest surviving son of Princess Louise Hippolyte of Monaco and her husband Prince Jacques\n\nIn May 1732 he moved to Paris to be with his father till he was officially proclaimed the prince of Monaco. Antoine Grimaldi, the Chevalier de Grimaldi, acted as regent for the prince between 1732 and 1784, when Honoré chose to live in Paris. This situation remained the same for half a century until Antoine's death in 1784,\n\nOn 5 June 1757 he married Maria Caterina Brignole a member of one of the most powerful and wealthy familys in the Republic of Genoa. The had two sons before divorcing in 1770.\n\nPrince Honoré IV of Monaco (17 May 1758 – 16 February 1819) married Louise d'Aumont and had children. Prince Joseph of Monaco (10 September 1763 – 28 June 1816) married Marie Thérèse de Choiseul and had children.\n\nTitles and styles [ change | change source ]\n\n20 February 1731 - 17 May 1758 His Serene Highness The Marquis of Baux.\n\nThe Marquis of Baux. 7 November 1733 – 19 January 1793 His Serene Highness The Prince of Monaco, Duke of Valentinois.\n\nFurther reading [ change | change source ]"}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/seven-centuries-grimaldi-rule-monaco/", "page_content": "The history of the Grimaldi dynasty dates back to January 8, 1297. That’s when Francois Grimaldi, disguised as a Franciscan monk, seized the fortress towering over the Monaco rock with his troops, in the port of Hercule. As of today, the Grimaldis have been ruling over the Principality for more than 700 years.\n\nThe Grimaldi dynasty counts a number of princes who glorified Monaco and wrote some important pages in the Principality’s history. Rainier I was General Admiral of France; Honore II signed one of the most important treaties with France; Louis I was an ambassador to the Holy See during the reign of Louis XIV; Antoine I became famous as a great patron of the arts; Charles III founded Monte-Carlo and laid the foundations for the Principality’s future prosperity; Albert I went down in history as the Sea Prince and father of oceanography; Louis II was called the Prince-Soldier; and Rainier III, the Prince-Builder – it was during his reign that the Principality acquired its modern look and conquered the Fontvieille area from the sea.\n\nPrince Rainier III chose to marry the famous 26-year-old American actress Grace Kelly. They first met when she came to the Cannes Film Festival with the American delegation. This was not a Prince and Cinderella story – Grace Kelly brought in a dowry of $2 million and the wedding was paid for by her family. After her marriage, Princess Grace could no longer pursue her film career. Her movies were also forbidden to be shown in the Principality. In 1982, Princess Grace tragically died in a car accident, leaving behind three children – Princess Caroline, Princess Stephanie and the future Prince of Monaco, Albert II who inherited the throne in 2005.\n\nIn 2011, Prince Albert II married Miss Charlene Wittstock who represented South Africa at the Olympics back when she was a professional athlete.\n\nResidents of Monaco are proud to have a very cultural sovereign, open to any kind of innovation. In 1976, Albert graduated from the Lycée Albert Premier of Monaco and continued his education at Amherst College in Massachusetts, USA. He studied economics, music, English literature and political science. Ever since his childhood, Prince Albert of Monaco was fond of all kinds of sports: football, swimming and martial arts. He took part in Winter Olympic Games as a bobsleigher. In 1985 he became a member of the International Olympic Committee and participated in the Dakar Rally the same year. His Serene Highness is also a big fan of water sports. He chairs the Monaco Yacht Club, promoting its participation in international competitions.\n\nOn December 10, 2014, the Princely couple became parents. The Princely twins were born in the Princess Grace Hospital Centre. Princess Gabriella was born just two minutes before her brother and is second in the line of succession. The Crown Prince is believed to be named in honour of Prince Jacques I who ruled Monaco in the 1830s.\n\nPrince Albert II of Monaco is known as an ardent supporter and one of the main initiators of environmental programs with global reach. Ever since his ascendancy to power in 2005, Prince Albert has made the fight against global warming and environmental protection the main focus of both his local and international policies.\n\nPhotos: HelloMonaco/Palais Princier de Monaco"}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-v-a-brilliant-officer-and-an-unlucky-sovereign/", "page_content": "The eldest son of Prince Honoré IV was so eager for power that he declared himself a ruler against the will of his father. Tough and authoritarian, accustomed to military discipline from his youth, he made important economic decisions alone but failed to make the country prosperous and failed to make its population rich and happy. In fairness, we note that the Prince sincerely did his best.\n\nMilitary service for France\n\nPrince Honoré-Gabriel, the eldest son of Prince Honoré IV of Monaco and Princess Louise Felicite Victoire d’Aumont, was born in Paris on May 14, 1778. He enlisted in a French cavalry regiment when he was 20 years old and worked his way up through the ranks by his own merits until he became an officer on the staff of Marshal Grouchy. He was an exemplary soldier and was cited for his bravery many times. Being wounded in the arm he couldn’t take part in the action at Austerlitz (1805) but did serve with great distinction at the battle of Jena (1806) with Marshal Murat’s cavalry corps. Marshal Grouchy recommended him for the star of the Legion of Honour, relating that the Prince had taken a handful of cavalry and forced the surrender of an entire enemy battalion.\n\nIn April 1814, Napoleon Bonaparte abdicated the throne and was sent into exile on the island of Elba. The restored King Louis XVIII of France himself then also restored the Grimaldis to their places in the French nobility. Therefore, after the restoration of 1814, Honoré-Gabriel was also named member of the House of Peers by King Louis XVIII. But many were afraid that Monegasque independence would not be secure or that the Principality might be annexed by the Kingdom of Piedmont-Sardinia. Thanks to Prince Talleyrand, however, a clause was inserted into the Treaty of Paris to put Monaco securely back in order and independent.\n\nReturn to Monaco and meeting with Napoleon\n\nHonoré IV was unable to return to Monaco because of his poor health and so appointed his brother Joseph to rule on his behalf. But Honoré-Gabriel didn’t like that idea and he protested fiercely about this and after some struggle he was himself appointed to govern Monaco.\n\nIn March, 1815 on his way to Monaco he met with his old commander Napoleon who was on his way to Paris to seize power at the start of the 100 days. “Where are you going?”, Napoleon asked. “Going home, to Monaco”, Honoré-Gabriel answered. “Me too, I’m going home, to the Tuileries,” Napoleon said. When Napoleon attempted to restore his empire during the 100 days Monaco was occupied by British troops and so the Grimaldis played no part in the affair.\n\nDifficult years of reign\n\nIn 1819, when his father passed away, Honoré-Gabriel became the Sovereign Prince of Monaco as Honoré V and inherited a Principality beset with problems. At the same time being both a member of the French Parliament and the Sovereign of Monaco, he picked up on the project of his grandfather to diversify economic resources and encouraged the installation of factories. The Great Powers of Europe had taken Monaco out of the French sphere of influence and made the Principality a protectorate of Piedmont-Sardinia. The government in Turin closed the tobacco plant that Honoré III had established and enforced a number of other changes that had left Monaco impoverished.\n\nHonoré V went to Turin to try to reason with the King of Piedmont-Sardinia but, although he was treated with great honour and respect, none of his grievances were addressed. Honoré V also had to raise taxes considerably which made him increasingly unpopular. His granting of a monopoly on flour caused a bread shortage but no one had the nerve to voice opposition to him. He also pushed opportunities for tourism. However, the lack of a market for local products, the omnipresence of the State and the lack of presence of the Sovereign created tensions, especially in Menton. The Sovereign ended up pacifying Menton before going forward with his effort to provide the Principality with amenities. By his own admission he “desired to do good” but “did not manage to”, despite his philanthropic ideals.\n\nWhen liberal movements began to oppose the counter revolutionary tide of post-Napoleonic Europe some in Monaco thought of joining in but Sardinian troops arrived to crush the potential rebellion in its infancy.\n\nUnjust dislike\n\nHistory has tended to record Prince Honoré V as a very unpopular and autocratic monarch, but, in reality he was quite progressive. He sincerely wished to help his people and had great sympathy for the poor. His reaction to seeing beggars on the streets was to form state-owned industries and put them to work. Some of the industries he set up included a lace factory and a hat factory. He also had them put to work on farm cooperatives as citrus orchards had long been a large part of the Monegasque economy. All of this has led some people to regard Prince Honoré V as a sort of socialist, though he probably would not have seen it that way.\n\nBut all efforts to save the economy did not make Monegasques appreciate their Prince. Honoré V of Monaco died on October 2, 1841 in Paris and remained in the history of the country as an authoritarian ruler who did not trust anyone, including family members, and made decisions alone. As he was not married and had no children the Monegasque throne passed to his poet-actor brother Florestan."}, {"url": "https://www.monaco-tribune.com/en/house-of-grimaldi/", "page_content": "Princely Family\n\nThe Grimaldis: Princes of Monaco for 700 years\n\nFrom François Grimaldi, the first lord of Monaco, to today’s Prince Albert II, the history of the Principality and its sovereign family is long and rich, despite Monaco being one of the smallest states in the world.\n\nEric Mathon / Prince’s Palace\n\nBefore the Monte-Carlo Casino became the talk of the town, there was a palace high above on Monaco’s rock that overlooked the Mediterranean like a balcony overlooking the sea.\n\nAt 60 something meters above sea level, the Palace is the heart and soul of the Principality. Behind its sturdy walls lives the Sovereign family, protected day and night by the Prince’s Carabinieri.\n\nThe Grimaldi have ruled Monaco for 700 years. Reigning first as feudal lords and from the 17th century onwards, as sovereign princes, the Grimaldis are one of Europe’s oldest dynasties.\n\nThe story of the Principality starts at the end of the 13th century with a monk and the capture of a rock. Disguised as a Franciscan friar, Francesco Grimaldi, known as Malizia, or “the cunning one”, captures the rock Monaco from the duchy of Genova, and so begins the story of the Principality of Monaco.\n\n13th and 14th centuries – a family from Genoa\n\nOriginally from Italy, the Grimaldi become one of the most powerful families in the municipality of Genoa thanks to large-scale maritime expeditions on the Mediterranean and on the Black Sea. As head of the Guelph clan, the Grimaldi supported the Pope’s interests against the Ghibellines and the Germanic Roman Emperor. But at the end of the 13th century, there is a twist of fate and the Grimaldi are driven out of Genoa in search of a less hostile place to call home.\n\nWhen in January 1297, Francesco Grimaldi and the Guelphs capture the rock of Monaco, it is a simple Genoese fortress. In the following decades, the Grimaldi lose control of the stronghold before regaining it thanks to Charles Grimaldi. After taking the title of Lord of Monaco in 1342, Charles Grimaldi acquires the nearby towns of Menton and Roquebrune.\n\n15th and 16th centuries – Spanish protection and male heirs\n\nFearing Genoa, who has not given up on reclaiming their previous stronghold, the Grimaldi place themselves under the protection of the kings of France and the counts of Provence. An alliance with the crown of France follows. Lambert Grimaldi, Lord of Monaco from 1458 to 1494, is even made Councillor and Chamberlain to King Charles VIII. French protection lasts until the reign of François I, after which Monaco is granted protection by Charles V and the crown of Spain.\n\nThe 15th century sees the formalisation of the House of Monaco’s rules of succession. In 1454, Giovanni I decrees that the princedom will be given to the male bloodline by order of birthright. In the absence of a male heir, women have inherited the Princedom, however only on the condition that their descendants take the name and arms of the Grimaldi family.\n\nDid you know? The Grimaldi House Coat of Arms is a tribute to the cunning founder of the dynasty. The Coat of Arms is a silver shield decorated with red diamonds, the cross of the Order of Saint Charles beneath it. Next to the shield stand two Franciscan friars raising a sword.\n\n17th and 18th century – the first “Prince of Monaco”\n\nSpanish protection lasts until 1641 when the Treaty of Péronne officially puts the Principality back under French protectorate. Honoré II becomes the first Grimaldi to take the official title of Prince of Monaco. Raised in the gold and refinement of the court of Milan, he turns the old Monegasque fortress into an Italian palace worthy of his rank.\n\nUnder Honoré II, Monaco prospers thanks to maritime trade and land-derived income. The 17th century is also a period of legislative development: In December 1678, the grandson of Honoré II, Louis I, approves the Principality’s first legal code, also known as the “Louis Code”. Known for his wisdom, Louis I imposes a toll on commercial ships sailing off from Monaco.\n\nDuring the French Revolution, the Principality is invaded by France and is renamed “Fort Hercule”. The French Revolution is the beginning of a difficult period for the Grimaldi, who see their prosperity plunder.\n\nIf following the restoration the family recovers their titles and estates, the council of Vienna does not give Monaco independence. Instead, the Principality is placed under the authority of the King of Sardinia. As the city-state experiences a period of political and financial turmoil, the Princely family is forced to flee to Paris.\n\nIn 1948, the towns of Menton and Roquebrune-Cap-Martin, previously under Monegasque rule declare themselves “free towns”. When a few years later Nice and the Côte d’Azur become part of France following the Italian war of independence, Menton and Roquebrune-Cap-Martin vote in favour of being annexed by France, eventually becoming French in 1861.\n\nAfter Italy cedes the Côte d’Azur to France, Emperor Napoleon III grants Monaco independence. France also gives Monaco four million francs in compensation for the loss of Menton and Roquebrune.\n\nDid you know? In the early 18th century, Louise-Hippolyte, daughter of Prince Antoine I, was the sole heir to the Monegasque throne. To keep the house of Grimaldi going, Princess Louise-Hippolyte can get married on one condition: her future husband has to give up his name and adopt the coat of arms of the Princely family. Jacques de Goyon de Matignon, a Norman aristocrat, agrees to the deal. After the death of Antoine I, Princess Louise-Hippolyte, and her husband rule the Principality together.\n\nTheir story unfortunately does not happy ending. The princess dies unexpectedly only eleven months into her reign. After her death, her husband Jacques became Prince Jacques I of Monaco.\n\n19th century: Monaco becomes a gambling paradise\n\nThe Franco-Monegasque treaty of 1861 marks a new beginning for the Principality and the Grimaldi family. It is the first time in the Principality’s tumultuous history that the city-state is fully independent. And with its newfound independence, Monaco takes off.\n\nUnder the rule of Charles III (1856-1889) that Monaco becomes the economic haven that it is today. In need of money following the loss of Menton and Roquebrune-Cap-Martin, the sovereign decides to build a casino as well as a spa, both of which have become a favourite pastime of the Europe’s beau monde.\n\nCharles II bets everything on the casino. He enlists Fançois Blanc in the project, a businessman from Provence who made his fortune by running a casino in Bad-Homburg. In 1863, Blanc creates the Société des Bains de Mer (SBM) to manage the Monte-Carlo Casino. Gambling is banned in neighbouring countries, such as France and Italy, and the Casino becomes a unique attraction on the Riviera.\n\nAs the Casino de Monte-Carlo brings some of the richest and most illustrious Europeans to Monaco, the SBM expands and builds several luxury hotels around Monte-Carlo. The Speluges rock is no longer bare and soon, the new district takes the name of the sovereign that built it: Monte-Carlo, after Charles III.\n\nFor a very long time, the SBM’s revenues, and particularly the casino revenue, are Monaco’s biggest guaranteed cash flow. With time, the SBM also takes care of the provision of public services, including the establishment of the Nice-Menton train line.\n\nToday, the SBM manages Monaco leading institutions, including the Monte-Carlo Casino, the Hotel de Paris and the Hotel Hermitage. It is Monaco’s biggest employer\n\nThe Navigator Prince\n\nFollowing the death of Charles III, Albert I of Monaco (1889-1922) succeeds to the throne. Nicknamed “the navigator prince” or “the learned prince”, he devotes much of his life to oceanography, exploration, and science. In 1902, he founds the Museum of Anthropology and Prehistory of Monaco, and in 1910 the now world-renowned Oceanographic Museum. He is also responsible for Monaco’s first constitution.\n\nHe is succeeded to the throne by his son, Prince Louis II, during whose reign, the Principality becomes a member of the World Health Organisation.\n\n>> READ ALSO: Albert I of Monaco, Prince of the Seas\n\nRainier III transforms the Principality\n\nWhen Rainier III ascends to the throne in 1949, he inherits a country in full expansion. Rainier III builds upon an already prosperous country and his reign will give way to one of Monaco’s biggest transformations.\n\nRainier III made Monaco the city-state it is today. Amongst the notable events of his reign are the introduction of a new constitution, the Fontvieille sea expansion, large-scale real estate development, and the admission of Principality to the United Nations Organisation and the Council of Europe. Despite his perhaps austere appearance, it is worth remembering that Rainier made the small city-state a capital of glamour, thanks to his marriage to American actress Grace Kelly.\n\nGrace Kelly (Photo : Archives of Prince’s Palace)\n\nMonaco and the Wedding of the Century\n\nOn 19 April 1956, Prince Rainier III marries Grace Kelly, a 27-year-old American actress at the peak of her career. Broadcast live, the event is watched by nearly 30 million around the world. In Monaco, an estimated 100,000 visitors come to the Principality during the week of the marriage. To accommodate the 1,800 journalists that have traveled to Monaco to cover the event, authorities have to install 40 telephone booths. The wedding’s tremendous media coverage gives Monaco a long-awaited opportunity to glamourise its image and increase the country’s appeal to foreigners.\n\nLeaving the Cathedral of Monaco on 19th April 1956. Photo: Prince’s Palace\n\n>> READ ALSO: Photos: Prince Rainier III and Princess Grace’s wedding anniversary\n\nGrace Kelly, now Princess Grace of Monaco, fully invests herself in the life of the Principality. Even if she has given up her career as an actress for her marriage, it is unthinkable for her to be just an extra at her husband’s side.\n\nIn 1963, she agrees to be the face of a Monaco advertising spot aimed at attracting American tourists. The same year, she founds the World Association of Children’s Friends (AMADE) and then, in 1964, the Princess Grace of Monaco Foundation, an international charity dedicated to the promotion of the arts. President of the Monegasque Red Cross until her untimely death, Grace Kelly is remembered in Monaco for her generosity and her dedication to charity and the arts.\n\n>> READ ALSO: Princess Grace Kelly: how the Grimaldi women keep her spirit alive\n\nDid you know? As patron of AS Monaco, Princess Grace designed a brand new jersey more in tune with Monegasque identity for the team. The jerseys bring the team luck: the same year she redesigns them, AS Monaco wins the French Premier League.\n\nThe Reign of Prince Albert II of Monaco, the Green Prince\n\nAlbert Alexandre Louis Pierre Grimaldi becomes the 14th Prince of Monaco on 6 April 2005. Like his father before him, Prince Albert II is invested in the development of the Principality, boosting the country’s tourism, industry, and real estate.\n\nAnother issue which the Prince cares deeply about is environmental protection, which has earned him the nickname of the Green Prince. In 2006, he founds the Prince Albert II of Monaco Foundation, dedicated to protecting nature and promoting sustainable development on a global scale.\n\n>> READ ALSO: Prince Albert II and his passion for the seas\n\nThe Foundation supports projects in three main geographical zones: the Mediterranean basin, arctic regions, and the world’s least developed countries, such as the countries in Sahelian Africa, which are severely impacted by the effects of climate change, the loss of biodiversity, and water shortage. The Prince Albert II Foundation has three main missions:\n\nTo limit the effects of climate change and promote renewable energies\n\nTo safeguard biodiversity\n\nTo manage water resources and combat desertification\n\nPrince Albert married former South African Olympic swimmer Charlène Wittstock in 2011. On 10 December 2014, Princess Charlène gave birth to twins, Princess Gabriella and the hereditary Prince Jacques, ensuring the future of the Grimaldi Dynasty."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/hercule-i-doctor-of-law-and-father-of-the-first-prince-of-monaco-en/", "page_content": "The Grimaldi Princes have historically distinguished themselves in the arts and also in culture, sports and science. As a lover of the arts Prince Honoré II built the great collections of the Palace in the seventeenth century. Prince Albert I was a world-renowned eminent marine scientist and our reigning Prince Albert II participated in five Olympics. There is also a less heralded Lord among those of the Grimaldi dynasty who also demonstrated a fine intellect: Hercule Grimaldi born on September 24, 1562, the youngest son of four of Lord Honoré I of Monaco and his wife Isabella. In the Archives of the Palace there is a beautifully framed Diploma granting him a doctorate from the University of Padua at 22 years old — a Doctorate in Civil Law and Canon Law which would have been the culmination of four years of study, the first two years being the equivalent of a Bachelor’s degree. At the time Hercule, being the youngest son, would have been preparing himself for other than the role of Lord (Seigneur), perhaps even for an ecclesiastical role. But fate had other plans…\n\nTroubled Times\n\nHercule’s eldest brother was Charles II who succeeded his father as Seigneur of Monaco in 1581. His other two brothers, François and Horace, both died young. So when 33-years-old Charles II after just 8 years into his reign died unmarried and childless, Hercule succeeded him as Seigneur on May 17, 1589 at the age of 27. It was not an easy mantle to inherit as it was to be one of the most troubled times in Monaco’s history. The Spanish garrison on the Rock were progressively loathed by the Monegasque population. And Monaco with its strategic harbour was the target of many a conspiracy by surrounding feudal lords including Provence and Savoy, not to mention the lords in the great centres, in what is modern-day Italy. Savoy tried their hand at claiming Monaco via a notary called Boccone with the intention of driving out the Spanish and overthrowing the Grimaldis. Again though, success escaped them.\n\nIn 1595 Hercule married Maria Landi. They had three children: two daughters and a son, the future Honoré II, the first Lord of Monaco to bear the title Prince of Monaco.\n\nMysterious Assassination\n\nIt was a dangerous time to wander the streets and Hercule’s life was cut short one evening as he ventured out. On November 29, 1604 after leaving the house of the Governor Gastaldi (now 15, Rue de Comte Félix Gastaldi) the Lord of Monaco was stabbed to death… The Monaco Parish Registry records that, «The most noble and worthy seigneur Hercule Grimaldi, seigneur of Monaco, Marquis of Campagna, called to a better life at the age of about 42. Attacked by a force of 5 or 6 in the Grand-Rue, in front of the house of the «podestà master», Bartholomies Dadino, he at once delivered up his soul to God».\n\nWe don’t know exactly why this cruel act had happened… But it’s obvious that in order to avoid the sad destiny of their father, Hercule’s children were immediately hidden — till the moment when their uncle Feredico Landi, the 4th Prince of Val di Taro, arrived to rule as regent and ensure the Grimaldi dynasty would be preserved.\n\nDamnation of a Glorious Name\n\nHeracles (known as Hercules by the Romans) is one of the most respected heroes in Greek mythology, a symbol of strength, power and bravery. Sadly, bearing this revered name neither protected Hercule I from his fate and neither did it provide immunity from disaster to his progeny.\n\nThe next princely Hercule was the son and heir of Honoré II, proudly named after his grandfather, and father of the Prince who would ultimately reign in his stead, Louis I. The young Hercule, would-be heir with his new title Marquis de Baux, was also to meet an untimely end. It happened, on August 1, 1651 when he and his wife, Aurelia Spinola, and their children were making an expedition to the convent of Carnoles in Menton. After the sojourn was over the young Marquis Hercule took a walk in some gardens that were close by, target shooting with some soldiers of the guard with a relatively new rifle called an arquebuse. Suddenly, Hercule ordered one of the soldiers to shoot at a target to see how proficient he was. The soldier, eager to obey, turned rapidly and, while doing, caught the arquebuse in his belt. The weapon fired, and by accident, struck two others nearby and wounded Hereditary Prince Hercule in the spine. It was a mortal wound and he died the next day. On his deathbed he asked again and again that his involuntary murderer not be punished who, however, was placed in prison and there tried to commit suicide. The last will of the dying Hercule was respected, nevertheless: the soldier left the prison and then Monaco forever.\n\nHercule’s Progeny\n\nHercule I himself, Lord of Monaco and Doctor of Law, was buried in the St Sebastian chapel of St Nicholas Cathedral and would have been terribly saddened to learn his grandson and namesake had like himself been struck down in the prime of life. Though he also could not know it, he would have been proud that his 6-year-old son and heir would became Lord Honoré II, Seigneur of Monaco and subsequently first to carry the formal title Prince of Monaco. Neither could Hercule I know that his early achievement of earning a Doctorate in Law would over 400 years later be one of the treasures of the Archives of the Prince’s Palace.\n\nHelloMonaco magazine thanks the audio-visual archives of Monaco for the illustrations."}, {"url": "https://monacodc.org/monhistory.html", "page_content": "HISTORY\n\n\n\nSince ancient times, Monaco has always been at the crossroads of history. Initially the Ligurians, the ancient people who first settled Monaco, were concerned with the strategic location of the Rock of Monaco. Evidence of the Ligurian occupation of Monaco was found in a cave in the Saint Martin’s Gardens. Originally a mountain-dwelling people, they were known for their hard work and their frugality, two traits by which Monegasque citizens are known for today. Founded by the Phocaeans of Massalia during the 6th century, the colony of Monoikos became an important port of the Mediterranean coast. Monoikos, from Greek roughly translates to \"single house,\" enforcing the ideas of sovereignty, self-sufficiency and self-reliance. Ancient myths venerate Hercules as having passed through this area.. To this day there is evidence of an admiration of Hercules: the largest port is named Port Hercule. Julius Caesar stopped in Monoecus after the Gallic Wars on his way to campaign in Greece. After the collapse of the Western Roman Empire in 476, Monaco was ravaged by Saracens and barbarian tribes. After the Saracens were expelled in 975, the depopulated area was reclaimed by the Ligurians. In 1215, construction began on a fortress atop the Rock of Monaco by a detachment of Genoese Ghibellines. With the intention of turning the Rock of Monaco into a military stronghold, the Ghibellines created a settlement around the base of the Rock to support the garrison. To draw in residents from Genoa and other surrounding cities, the Ghibellines offered land grants and tax exemptions to newcomers. Civil strife in Genoa between the Guelph and Ghibelline families resulted in many taking refuge in Monaco, among them the Guelph family. Son of Otto Canella, Consul of Genoa in 1133, Grimaldo began the House of Grimaldi, the future ruling family of Monaco. In 1297, François Grimaldi (\"Malizia\", translated from Italian as \"The Cunning\") disguised as a Franciscan monk alongside his cousin Rainier I and his men captured the fortress atop the Rock of Monaco. At his death in 1309, François Grimaldi was succeeded by his cousin, Rainier I. His son, Charles Grimaldi, who would come to be known as Charles I, is considered by historians to be the real founder of the Principality. He added the areas of Menton and Roquebrune, increasing the size of the Principality. Charles I had an important role in the court of the King of France. Rainier II never entered Monaco, and divided the land between his three sons, Ambrose, Antoine, and Jean. Jean I, who died in 1454, was succeeded by a son, Catalan. Catalan’s daughter, Claudine, married a Grimaldi of the Antibes branch, Lambert. It was under his rule that Monaco was recognized as independent by King Charles VIII of France in 1489. Almost two centuries after François Grimaldi first captured the fortress atop the Rock of Monaco, the Grimaldi's had achieved indisputable sovereignty over the Principality. Repeated attempts by the Genoese to recapture the fortress proved unrewarding. Louis XII confirmed Monaco's independence, establishing an alliance between the Princes of Monaco and the King of France. Then, disputes with the French authorities ended in Monaco being placed under the protection of Spain. This resulted in many financial burdens for the Principality, including shouldering the costs of a garrison Spain placed in the fortress from 1524 for more than a century. Lambert Grimaldi d’Antibes had three sons, Jean, Lucien, and Augustin. Lucien’s son, Honoré I had two sons, Charles II and Hercule, and enjoyed a peaceful reign towards the end of his lifetime. However, both of his sons ruled one after the other, neither for very long. Prior to this point, the ruler of Monaco was referred to as “Lord of Monaco”. In 1612, Hercule’s son Honoré II, was first given the title of \"Prince of Monaco\", which became the official title of the ruler of Monaco and would be passed on to his successors. Honoré II led Monaco through a brilliant period; his chief contribution was re-establishing Monaco's alliance with France, which was only realized after more than ten years of negotiations. In 1641, a treaty was signed granting Monaco the protection of France, and furthermore confirmed the sovereignty of Monaco its independence, rights and privileges. Honoré II was given a French garrison to command, which he used to expel the occupying Spanish garrison that was still in the fortress. The Prince was received at the French Court and was awarded many honors and privileges. Honoré II made additions to the Prince's Palace, as well as decorated the Palace with many paintings, tapestries, and valuable ornaments. Many visitors during this time marveled at the vast collection he had accrued. Despite a lack of resources, the people of Monaco lived rather well, enjoying extensive maritime commerce and profiting from the taxes imposed on ships on their way to Italy. However, the suppression of feudal rights, as was voted by the French Constituent Assembly seized all of the Prince's monetary possessions in 1789, placing the royal family in a grave financial predicament. In 1793, French Revolutionary forces captured Monaco, further exacerbating the situation of the royal family. The vast art collections and all of the possessions of the royal family were sold at auctions. The Palace was converted into a hospital and then into a home for the poor. The Prince's family was imprisoned, freed, and then several members of his family had to enter the French army in desperation. After Napoleon abdicated the throne in 1814, Monaco was returned to its previous state under the new rule of Honoré IV. However, the Principality was re-established as a protectorate of the Kingdom of Sardinia by the Congress of Vienna in 1815. Monaco remained a protectorate until 1860 when, by the Treaty of Turin at the time of Italy’s unification, Monaco was ceded to France. With unrest in Menton and Roquebrune, the Prince gave up his claim to the two towns (which made up 95% of the Principality at the time) in return for four million francs. Both the transfer of these two cities and Monaco's sovereignty were recognized by the Franco-Monegasque Treaty of 1861. In spite of the four million franc indemnity, Monaco's reduced size and loss of the income it would have gained from Roquebrune and Menton prevented the Principality from escaping its difficult financial predicament. In 1856, Charles III of Monaco (Honore IV grandson) granted a concession to Napoleon Langlois and Albert Aubert to establish a sea-bathing facility for the treatment of various diseases, and to build a German-style casino in Monaco. The initial casino was opened in La Condamine in 1862, but was not a success; its present location in the area called \"Les Spelugues\" (The Caves) of Monte Carlo, came only after several relocations in the years that followed. The success of the casino grew slowly, largely due to the area's inaccessibility from much of Europe. The Societé des Bains de Mer (SBM) opened the famous Monte Carlo Casino in 1863. With an ideal location, Monaco provided an enchanting setting for hotels, the theater, and a casino. Even though it was difficult at the time to reach the Principality, the Casino proved to be a tremendous boon to their economy. The Hôtel de Paris was established in 1864 by Charles III of Monaco adjacent to the casino. It is a hotel in the heart of Monte Carlo. It belongs to the Société des bains de mer de Monaco, and is the first elite palace in Monaco. The hotel has 106 rooms divided into four groups based on type of view, decoration and luxury.[5] The Exclusive City View offers 20 rooms, the Superior Courtyard has 29 large rooms, the Exclusive Sea View 59 and the Exclusive Casino has six. Economic development was further spurred in 1868 with a railway link to France, resulting in remarkable numbers of visitors to the Principality. The Opéra de Monte-Carlo or Salle Garnier was built by the architect Charles Garnier as an exact replica in miniature of the Paris Opera House. The auditorium of the opera house is decorated in red and gold and has frescoes and sculptures all around the auditorium. It was inaugurated on January 25, 1879 with a performance by Sarah Bernhardt dressed as a nymph. The first opera performed there was Robert Planquette's Le Chevalier Gaston on 8 February 1879, and that was followed by three more in the first season. Albert I, previously devoted to scientific research in the fields of oceanography and paleontology, assumed the role of Prince of Monaco in 1889. With an outstanding reputation, a seat in the Academy of Sciences, and various discoveries which are too numerous to discuss, he established the Oceanographic Museum, which is one of the top centers for oceanography to this day. Jacques-Yves Cousteau was the Director of the Oceanographic Museum from 1957 to 1988. In 1911, Prince Albert I adopted the first Constitution of the Principality, separating the 3 forms of power: executive, legislature and judiciary originally held by the Prince.\n\nThe Prince exercises his sovereign authority in accordance with the provisions of the Constitution and laws. The Prince represents the Principality in its dealings with foreign powers. The total or partial revision of the Constitution is subject to mutual agreement of the Prince and the National Council.\n\n- Legislative power is shared between the Head of State who has the legislative initiative and the National Council which votes on them.\n\n- The executive branch is under the authority of the Prince, the Government is exercised by a Minister of State who represents the Prince assisted by a Council of Government. The Minister of State and Government Counsellors are responsible to the Prince for the administration of the Principality.\n\n- In law, the judiciary is for the Prince. Present Constitution states that He delegates its full exercise to the courts, which administer justice in His name. From this principle flows the independence of the judiciary by the executive Part of the Treaty of Versailles in July 1918 provided for limited French protection over Monaco. This established that the Principality's international policy would be aligned with French political, military, and economic interests. Attempting to remain neutral during World War II, Prince Louis II’s sympathies were strongly pro-French. Nevertheless, the Italian army invaded and occupied Monaco. After Mussolini's collapse in Italy, Monaco was also occupied by Nazi Germany. Prince Louis used the Monaco police to warn Jewish inhabitants of Monaco that they were marked to be arrested by the Gestapo, allowing them time to escape. Many Jewish people who lived in Monaco at the time were able to escape due to the assistance of Louis II and the Monegasque police. With the German army retreating from Monaco due to the Allied advance, an American contingent liberated the Principality. Following the death of his grandfather in 1949, Prince Rainier III succeeded the throne as the Sovereign Prince of Monaco. On April 19, 1956, Prince Rainier married the American Actress Grace Kelly. This event focused the world's attention on Monaco, as well as established permanent bonds linking the United States of America with Monaco. They had three children, H.S.H. Princess Caroline, H.S.H. Prince Albert II, and H.S.H. Princess Stephanie. Proclaimed in 1962, a new constitution provided for women's suffrage, abolished capital punishment, and established a Supreme Court of Monaco, guaranteeing fundamental liberties. Prince Rainier had an outstanding reign, turning Monaco into a thriving center of international finance and business, as well as maintaining its status as a premier luxury tourist destination. He oversaw the addition of the Fontvieille district; a district completely recovered from the sea which increased the Principality's surface area by 25%. He pioneered many innovative infrastructure improvements, as well as major projects such the Port Hercule transformation, which allows for more ships to dock there as well as large cruise ships, and the Grimaldi Forum Monaco, a futuristic conference and cultural center. The economy of the Principality increased dramatically as a result. Prince Rainier III established the Principality's status in the international community as well. In 1993, the Principality of Monaco became the 183rd member of the United Nations in 1993 with full voting rights. In 2002 a new treaty between France and Monaco established that if there were no heirs to carry on the Grimaldi dynasty, the Principality would remain an independent nation. In 2004 Monaco was admitted to the Council of Europe. In addition, Prince Rainier III offered His patronage and financial support to various social and humanitarian causes throughout the world. He staunchly supported the work of scientists in resolving environmental issues, and was a foremost supporter of various conservation practices. On April 6, 2005, Prince Rainer III died after a reign of 56 years. H.S.H Prince Albert II acceded to the Throne.\n\n"}]}