{"Honoré IV was the first of the Grimaldi to be born in France.": [{"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iv-prisoner-of-the-french-revolution-2/", "page_content": "Prince Honoré IV was born on May 17, 1758 in Paris, to his parents Prince Honoré III and Princess Maria-Caterina de Brignole-Sale. This prince, perhaps, experienced more challenges in life than any other Grimaldi. Most of his hardships were caused by the French Revolution, and the last hours of his life are still shrouded in mystery …\n\nThe victims of the Great Terror\n\nPrince Honoré IV was unlucky enough to be living in Paris when the Reign of Terror broke out in France. As a nobleman and prince he was soon arrested and thrown into prison. The prince’s former wife, Duchess of Mazarin, was also taken into custody. Assisted by their family doctor, however, she managed to escape and hide with her youngest son Florestan.\n\nThe revolution did not spare the family of Prince’s Honore IV’s youngest brother, Joseph. His wife, Marie Thérèse de Choiseul, was arrested on suspicion of espionage and executed by guillotine. She was only 27, leaving behind three little daughters.\n\nAs for Prince Honoré, he was imprisoned for one and a half years. This time in prison greatly undermined his health, and he never fully recovered from it afterwards. On March 21, 1795 his father died and Honoré IV ascended the throne of Monaco. At that time the monarchy had just been banned and Monaco was once again annexed to the French Republic under the name of Port Hercule.\n\nEven after Prince Honoré was released from prison, it took another seven years of negotiations before the French regime restored some of Honoré IV’s and his brother Prince Joseph’s income. The future started to look brighter for the Grimaldi’s once the radical revolutionary regime was followed by the French consulate and, finally, by the First French Empire of Napoleon Bonaparte.\n\nReturn to the throne\n\nWhen the Napoleonic Wars finally came to an end, the status of Monaco was restored by the Congress of Vienna (1814–1815) thanks to the efforts of Prince Talleyrand. On May 30, 1814 Honoré IV was officially named the Principality’s ruler. However, he was too ill to take control of his country. So it was his brother Prince Joseph who became regent.\n\nThe Prince’s eldest son, 36-year-old Honoré Gabriel, however, was not happy about this decision. A brilliant soldier, he entered the cavalry service at the age of 20 and prospered in the army of the Empire Marshal, Emmanuel de Grouchy. Since Prince Joseph was not particularly eager to deal with the Principality’s affairs, preferring his life in the capital, he easily facilitated handing over the reins to his nephew, Honoré Gabriel, who ruled Monaco up until the death of Honoré IV (later becoming Prince Honoré V). As for Honoré IV, he lived in Paris until his very death which remains mysterious to this day…\n\nAccident or murder ..?\n\nOn a winter’s day of February 16, 1819, Honoré IV drowned in the Seine river. The death of the Monaco prince looked like a typical accident. That’s what the investigation concluded as an official version. It must not be forgotten, however, that Honoré IV was not a very healthy person, to say the least. This is the reason why he was not only unwilling, but was also physically unfit to rule the country. Imprisonment and numerous personal tragedies had taken their toll on the Prince, making him, for all intents and purposes, disabled. This is what the scanty preserved data suggests. A legitimate question arises: how could a 60-year-old monarch, in deplorable physical state, manage to cover such a considerable distance away from home (Avenue Denfert-Rochereau) to the Seine river bank..?\n\nWas it really an accident? Or rather a premeditated murder? Or could it be that the Prince decided to put an end to his own unhappy life? Being a depressed person, did he step into the Seine himself..? The answer remains a mystery.\n\nThe main legacy of Prince Honore IV\n\nAs Prince of Monaco, Honoré IV suffered three arrests and never actually ruled Monaco. He spent part of his life in a prison cell and the rest, trying to improve his health. Needless to say, there are very few mentions of the Prince, even in the archives of Monaco. His most important contribution to the history of Monaco was the birth of his two sons — the future princes, Honoré V and Florestan I, who consistently ruled the Principality and left their mark on the state’s history."}, {"url": "https://www.monaco-tribune.com/en/house-of-grimaldi/", "page_content": "Princely Family\n\nThe Grimaldis: Princes of Monaco for 700 years\n\nFrom François Grimaldi, the first lord of Monaco, to today’s Prince Albert II, the history of the Principality and its sovereign family is long and rich, despite Monaco being one of the smallest states in the world.\n\nEric Mathon / Prince’s Palace\n\nBefore the Monte-Carlo Casino became the talk of the town, there was a palace high above on Monaco’s rock that overlooked the Mediterranean like a balcony overlooking the sea.\n\nAt 60 something meters above sea level, the Palace is the heart and soul of the Principality. Behind its sturdy walls lives the Sovereign family, protected day and night by the Prince’s Carabinieri.\n\nThe Grimaldi have ruled Monaco for 700 years. Reigning first as feudal lords and from the 17th century onwards, as sovereign princes, the Grimaldis are one of Europe’s oldest dynasties.\n\nThe story of the Principality starts at the end of the 13th century with a monk and the capture of a rock. Disguised as a Franciscan friar, Francesco Grimaldi, known as Malizia, or “the cunning one”, captures the rock Monaco from the duchy of Genova, and so begins the story of the Principality of Monaco.\n\n13th and 14th centuries – a family from Genoa\n\nOriginally from Italy, the Grimaldi become one of the most powerful families in the municipality of Genoa thanks to large-scale maritime expeditions on the Mediterranean and on the Black Sea. As head of the Guelph clan, the Grimaldi supported the Pope’s interests against the Ghibellines and the Germanic Roman Emperor. But at the end of the 13th century, there is a twist of fate and the Grimaldi are driven out of Genoa in search of a less hostile place to call home.\n\nWhen in January 1297, Francesco Grimaldi and the Guelphs capture the rock of Monaco, it is a simple Genoese fortress. In the following decades, the Grimaldi lose control of the stronghold before regaining it thanks to Charles Grimaldi. After taking the title of Lord of Monaco in 1342, Charles Grimaldi acquires the nearby towns of Menton and Roquebrune.\n\n15th and 16th centuries – Spanish protection and male heirs\n\nFearing Genoa, who has not given up on reclaiming their previous stronghold, the Grimaldi place themselves under the protection of the kings of France and the counts of Provence. An alliance with the crown of France follows. Lambert Grimaldi, Lord of Monaco from 1458 to 1494, is even made Councillor and Chamberlain to King Charles VIII. French protection lasts until the reign of François I, after which Monaco is granted protection by Charles V and the crown of Spain.\n\nThe 15th century sees the formalisation of the House of Monaco’s rules of succession. In 1454, Giovanni I decrees that the princedom will be given to the male bloodline by order of birthright. In the absence of a male heir, women have inherited the Princedom, however only on the condition that their descendants take the name and arms of the Grimaldi family.\n\nDid you know? The Grimaldi House Coat of Arms is a tribute to the cunning founder of the dynasty. The Coat of Arms is a silver shield decorated with red diamonds, the cross of the Order of Saint Charles beneath it. Next to the shield stand two Franciscan friars raising a sword.\n\n17th and 18th century – the first “Prince of Monaco”\n\nSpanish protection lasts until 1641 when the Treaty of Péronne officially puts the Principality back under French protectorate. Honoré II becomes the first Grimaldi to take the official title of Prince of Monaco. Raised in the gold and refinement of the court of Milan, he turns the old Monegasque fortress into an Italian palace worthy of his rank.\n\nUnder Honoré II, Monaco prospers thanks to maritime trade and land-derived income. The 17th century is also a period of legislative development: In December 1678, the grandson of Honoré II, Louis I, approves the Principality’s first legal code, also known as the “Louis Code”. Known for his wisdom, Louis I imposes a toll on commercial ships sailing off from Monaco.\n\nDuring the French Revolution, the Principality is invaded by France and is renamed “Fort Hercule”. The French Revolution is the beginning of a difficult period for the Grimaldi, who see their prosperity plunder.\n\nIf following the restoration the family recovers their titles and estates, the council of Vienna does not give Monaco independence. Instead, the Principality is placed under the authority of the King of Sardinia. As the city-state experiences a period of political and financial turmoil, the Princely family is forced to flee to Paris.\n\nIn 1948, the towns of Menton and Roquebrune-Cap-Martin, previously under Monegasque rule declare themselves “free towns”. When a few years later Nice and the Côte d’Azur become part of France following the Italian war of independence, Menton and Roquebrune-Cap-Martin vote in favour of being annexed by France, eventually becoming French in 1861.\n\nAfter Italy cedes the Côte d’Azur to France, Emperor Napoleon III grants Monaco independence. France also gives Monaco four million francs in compensation for the loss of Menton and Roquebrune.\n\nDid you know? In the early 18th century, Louise-Hippolyte, daughter of Prince Antoine I, was the sole heir to the Monegasque throne. To keep the house of Grimaldi going, Princess Louise-Hippolyte can get married on one condition: her future husband has to give up his name and adopt the coat of arms of the Princely family. Jacques de Goyon de Matignon, a Norman aristocrat, agrees to the deal. After the death of Antoine I, Princess Louise-Hippolyte, and her husband rule the Principality together.\n\nTheir story unfortunately does not happy ending. The princess dies unexpectedly only eleven months into her reign. After her death, her husband Jacques became Prince Jacques I of Monaco.\n\n19th century: Monaco becomes a gambling paradise\n\nThe Franco-Monegasque treaty of 1861 marks a new beginning for the Principality and the Grimaldi family. It is the first time in the Principality’s tumultuous history that the city-state is fully independent. And with its newfound independence, Monaco takes off.\n\nUnder the rule of Charles III (1856-1889) that Monaco becomes the economic haven that it is today. In need of money following the loss of Menton and Roquebrune-Cap-Martin, the sovereign decides to build a casino as well as a spa, both of which have become a favourite pastime of the Europe’s beau monde.\n\nCharles II bets everything on the casino. He enlists Fançois Blanc in the project, a businessman from Provence who made his fortune by running a casino in Bad-Homburg. In 1863, Blanc creates the Société des Bains de Mer (SBM) to manage the Monte-Carlo Casino. Gambling is banned in neighbouring countries, such as France and Italy, and the Casino becomes a unique attraction on the Riviera.\n\nAs the Casino de Monte-Carlo brings some of the richest and most illustrious Europeans to Monaco, the SBM expands and builds several luxury hotels around Monte-Carlo. The Speluges rock is no longer bare and soon, the new district takes the name of the sovereign that built it: Monte-Carlo, after Charles III.\n\nFor a very long time, the SBM’s revenues, and particularly the casino revenue, are Monaco’s biggest guaranteed cash flow. With time, the SBM also takes care of the provision of public services, including the establishment of the Nice-Menton train line.\n\nToday, the SBM manages Monaco leading institutions, including the Monte-Carlo Casino, the Hotel de Paris and the Hotel Hermitage. It is Monaco’s biggest employer\n\nThe Navigator Prince\n\nFollowing the death of Charles III, Albert I of Monaco (1889-1922) succeeds to the throne. Nicknamed “the navigator prince” or “the learned prince”, he devotes much of his life to oceanography, exploration, and science. In 1902, he founds the Museum of Anthropology and Prehistory of Monaco, and in 1910 the now world-renowned Oceanographic Museum. He is also responsible for Monaco’s first constitution.\n\nHe is succeeded to the throne by his son, Prince Louis II, during whose reign, the Principality becomes a member of the World Health Organisation.\n\n>> READ ALSO: Albert I of Monaco, Prince of the Seas\n\nRainier III transforms the Principality\n\nWhen Rainier III ascends to the throne in 1949, he inherits a country in full expansion. Rainier III builds upon an already prosperous country and his reign will give way to one of Monaco’s biggest transformations.\n\nRainier III made Monaco the city-state it is today. Amongst the notable events of his reign are the introduction of a new constitution, the Fontvieille sea expansion, large-scale real estate development, and the admission of Principality to the United Nations Organisation and the Council of Europe. Despite his perhaps austere appearance, it is worth remembering that Rainier made the small city-state a capital of glamour, thanks to his marriage to American actress Grace Kelly.\n\nGrace Kelly (Photo : Archives of Prince’s Palace)\n\nMonaco and the Wedding of the Century\n\nOn 19 April 1956, Prince Rainier III marries Grace Kelly, a 27-year-old American actress at the peak of her career. Broadcast live, the event is watched by nearly 30 million around the world. In Monaco, an estimated 100,000 visitors come to the Principality during the week of the marriage. To accommodate the 1,800 journalists that have traveled to Monaco to cover the event, authorities have to install 40 telephone booths. The wedding’s tremendous media coverage gives Monaco a long-awaited opportunity to glamourise its image and increase the country’s appeal to foreigners.\n\nLeaving the Cathedral of Monaco on 19th April 1956. Photo: Prince’s Palace\n\n>> READ ALSO: Photos: Prince Rainier III and Princess Grace’s wedding anniversary\n\nGrace Kelly, now Princess Grace of Monaco, fully invests herself in the life of the Principality. Even if she has given up her career as an actress for her marriage, it is unthinkable for her to be just an extra at her husband’s side.\n\nIn 1963, she agrees to be the face of a Monaco advertising spot aimed at attracting American tourists. The same year, she founds the World Association of Children’s Friends (AMADE) and then, in 1964, the Princess Grace of Monaco Foundation, an international charity dedicated to the promotion of the arts. President of the Monegasque Red Cross until her untimely death, Grace Kelly is remembered in Monaco for her generosity and her dedication to charity and the arts.\n\n>> READ ALSO: Princess Grace Kelly: how the Grimaldi women keep her spirit alive\n\nDid you know? As patron of AS Monaco, Princess Grace designed a brand new jersey more in tune with Monegasque identity for the team. The jerseys bring the team luck: the same year she redesigns them, AS Monaco wins the French Premier League.\n\nThe Reign of Prince Albert II of Monaco, the Green Prince\n\nAlbert Alexandre Louis Pierre Grimaldi becomes the 14th Prince of Monaco on 6 April 2005. Like his father before him, Prince Albert II is invested in the development of the Principality, boosting the country’s tourism, industry, and real estate.\n\nAnother issue which the Prince cares deeply about is environmental protection, which has earned him the nickname of the Green Prince. In 2006, he founds the Prince Albert II of Monaco Foundation, dedicated to protecting nature and promoting sustainable development on a global scale.\n\n>> READ ALSO: Prince Albert II and his passion for the seas\n\nThe Foundation supports projects in three main geographical zones: the Mediterranean basin, arctic regions, and the world’s least developed countries, such as the countries in Sahelian Africa, which are severely impacted by the effects of climate change, the loss of biodiversity, and water shortage. The Prince Albert II Foundation has three main missions:\n\nTo limit the effects of climate change and promote renewable energies\n\nTo safeguard biodiversity\n\nTo manage water resources and combat desertification\n\nPrince Albert married former South African Olympic swimmer Charlène Wittstock in 2011. On 10 December 2014, Princess Charlène gave birth to twins, Princess Gabriella and the hereditary Prince Jacques, ensuring the future of the Grimaldi Dynasty."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/grimaldi-family-the-legacy-of-prince-honore-v/", "page_content": "Prince Honoré-Gabriel was born in Paris on May 14, 1778, the eldest son of Prince Honoré IV of Monaco and Princess Louise Felicite Victoire d’Aumont, Duchesse de Mazarin et de La Meilleraye.\n\nHe enlisted in a French cavalry regiment when he was 20 years old and worked his way up through the ranks by his own merits until he became an officer on the staff of Marshal Grouchy. He was an exemplary soldier and was cited for his bravery many times. He was wounded in the arm at the great Napoleonic victory in the battle of Hohenlinden which prevented him from seeing action at Austerlitz.\n\nHe did serve with great distinction at the battles of Jena with Marshal Murat’s cavalry corps. Marshal Grouchy recommended him for the star of the Legion of Honor, relating that the Prince had taken a handful of cavalry and forced the surrender of an entire enemy battalion.\n\nWhen Napoleon was sent into exile the restored King Louis XVIII of France restored the Grimaldis to their places in the French nobility. Grandson of Honoré III and son of Honoré IV, Honoré V (1778-1841) was therefore too named, after the restoration of 1814, member of the House of Peers by king Louis XVIII. But many were afraid that Monegasque independence would not be or that they would be annexed by the Kingdom of Piedmont-Sardinia. Thanks to the Prince Talleyrand, however, a clause was inserted into the Treaty of Paris to put Monaco back in order. When Napoleon attempted to restore his empire during the 100 days Monaco was occupied by British troops and so the Grimaldis played no part in the affair.\n\nHonoré IV was unable to return to Monaco because of his poor health and so appointed his brother Joseph to rule on his behalf. But Honoré-Gabriel didn’t like that idea and he protested fiercely this and after some struggle he was himself appointed to govern Monaco.\n\nOn his way to Monaco he met with his old commander Napoleon as he was on his way to Paris to seize power at the start of the 100 days. Napoleon asked where he was going and Honoré-Gabriel said he was going home to Monaco. Napoleon said he was going home to the Tuileries, but as things unfolded he was not to remain there long.\n\nIn 1819, when his father passed away, Honoré-Gabriel became the Sovereign Prince of Monaco as Honoré V and inherited a Principality beset with problems. At once a member of the French Parliament and a Sovereign, he picked up on the project of his grandfather to diversify economic resources and encouraged the installation of factories. The Great Powers of Europe had taken Monaco out of the French sphere of influence and made the Principality a protectorate of Piedmont-Sardinia. The government in Turin closed the tobacco plant that Honoré III had established and enforced a number of other changes that left Monaco impoverished.\n\nHonoré V went to Turin to try to reason with the King but, although he was treated with great honor and respect, none of his grievances were addressed. Honoré V also had to raise taxes considerably which made him increasingly unpopular. His granting of a monopoly on flour caused a bread shortage but no one had the nerve to voice opposition to him. He also pushed opportunities for tourism. However, the lack of a market for local products, the omnipresence of the State and the lack of presence of the Sovereign created tensions, especially in Menton. The sovereign ended up pacifying Menton before going forward with his effort to provide the Principality with amenities. By his own admission he “desired to do good” but “did not manage to”, despite his philanthropic ideals.\n\nWhen liberal movements began to oppose the counter revolutionary tide of post-Napoleonic Europe some in Monaco thought of joining in but Sardinian troops arrived to crush the potential rebellion in its infancy.\n\nHistory has tended to record Prince Honoré V as a very unpopular and autocratic monarch, but, in reality he was quite progressive. He wished to help his people sincerely and had great sympathy for the poor. His reaction to seeing beggars on the streets was to form state-owned industries and put them to work. Some of the industries he set up included a lace factory and a hat factory. He also had them put to work on farm cooperatives as citrus orchards had long been a large part of the Monegasque economy. All of this has led some people to regard Prince Honoré V as a sort of socialist, though he probably would not have seen it that way.\n\nPrince Honore V died, unpopular and unappreciated on October 2, 1841 in Paris. As he was not married and had no children the Monegasque throne passed to his poet-actor brother who became Prince Florestan I of Monaco."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-louis-i-of-monaco/", "page_content": "We continue to share with you the historical chronicle of the Principality of Monaco, revealing the most interesting stories and fate of the rulers of the Principality. In the previous winter issue of HelloMonaco, we covered Honoré II, Monaco’s first ruler formally titled «sovereign prince». His grandson Prince Louis I of Monaco continued the politics of Honoré II and strengthened relations between his little country and its mighty neighbour — France.\n\nThe second Prince of Monaco\n\nThe key figures in the life of Prince Louis I of Monaco were his grandfather Prince Honoré II, his wife Catherine-Charlotte de Gramont, and most definitely the Sun King of France, Louis XIV.\n\nWhen Louis was born in 1642 to then Hereditary Prince Hercule (son of Honoré II), King Louis XIV of France had stood as his godfather and the little prince, also titled Duc de Valentinois, was named in his honour. Hercule Grimaldi suddenly died in 1651, so Louis who was just 10 years old became new successor to Honoré II.\n\nIt was Honoré II, the first Prince of Monaco, who had wisely and with great patience and skill switched liaisons from Spain to France, then under Louis XIII, expelling the Spanish from the Rock in a precision military operation in 1641. In the seventeenth century to survive and thrive as an independent state Monaco had to secure an alliance with one of the great powers and the choice of France as its protecting power proved to be strategically pivotal, a decision that has lasted to this day.\n\nIn 1662 Honoré II had died. The Duc de Valentinois succeeded his grandfather as Prince of Monaco, Louis I. And it fell to Louis I to foster the relationship at the Court of Versailles and above all create strong relations with the Sun King, the Grand Monarch of France.\n\nWedding Catherine-Charlotte de Gramont in 1660 was to prove decisive in courting the favour of Louis XIV. She was the daughter of a key personality in the King’s entourage, Marshal of France Antoine de Gramont who himself favoured the union. Her mother was Marguerite Duplessis de Chivré, a niece of Cardinal Richelieu. Catherine herself was larger than life and a beauty that had caught the eye of a number of aristocrats in Louis XIV’s circle, but especially with the King himself. She was exceptionally beautiful, an absolute star in Versailles and her dalliances with the King smoothed the way for her husband, who was complicit in her role as one of the King’s mistresses, which undoubtedly maintained him in Louis Fourteenth’s good graces.\n\nNot only that but in the seventeenth century, under the Sun King, Versailles was the centre of the civilized world and Catherine-Charlotte was at the pinnacle of etiquette and possessed the sophistication necessary to be successful at this magical and arguably the most glamorous Court in the world. Louis Grimaldi needed a guide to steer his way through the nuances of etiquette. Regarded as somewhat «provincial» due to his dress by the snobbery of the King’s sycophants, Catherine-Charlotte played an important role in maintaining his stature and access.\n\nAt the Service of the French King\n\nCourt machinations aside, Monaco was a key military ally of France and Louis I acquitted himself with great credit in France’s military campaigns including battling the English in tandem with the Dutch at The Four Days’ Battle in 1666, one of the longest naval battles in military history.\n\nMonaco’s Princes had to have two key talents to thrive, military prowess and diplomatic skill — and it was to Louis’ I diplomatic skills that the Sun King would eventually turn for help in the most strategic foreign policy and diplomatic initiative of the time for France — positioning for the Spanish Succession. The Spanish Emperor Charles II of the Habsburg dynasty was childless and Louis XIV eyed bringing the Spanish Empire under French control by securing the Spanish throne for his own Bourbon family. This so threatened the balance of power in Europe that it would eventually lead to the War of the Spanish Succession among European powers. Austria and the British in particular feared the power of a union under one monarch of France and Spain. Late on in Louis’ reign as Prince of Monaco, the Sun King selected him for the much heralded high profile prestigious and key role of negotiating with the Pope on this «Succession» issue.\n\nThere is no doubt that Honoré II would have admired how his grandson Louis I had forged strongly ahead with cementing such close relations with France and the Sun King. It was all he could have hoped for, and more, for Monaco’s strategic positioning in Europe. On 5 July 1668 Louis I of Monaco took the oath to King Louis XIV of France in Parliament on account of being Duke of Valentinois and a Peer of France. Later, he was made a knight of the French royal orders on 31 December 1688.\n\nThere was one goal however that for a time eluded Prince Louis of Monaco — and that was the official designation in the Court of France of the title «Prince Étranger» reserved for a select few princes. No doubt it was for the prestige but any extra pillar signifying Monaco’s independence as a Princely power in its own right was strategically important.\n\nFamily Difficulties\n\nIn 1662, when Louis became a new Prince, his family returned to Monaco. Princess Catherine-Charlotte was bored there, she was missing the brilliant life in Versailles. Thankfully, from her perspective, after four years’ time the Grimaldis had to return to Paris where Catherine-Charlotte de Gramont sometimes played her role as mistress at the Versailles Court a little too close for comfort. Favoured by the King she was also wooed by other suitors, in particular by her cousin the Duke of Lauzun, much to the King’s annoyance — and sufficient to have the Duke sent to the famous Bastille prison for six months. It also caused the King to discontinue pursuing Prince Louis’ wife — and pause for years, due to his anger, from conferring extra titles on Prince Louis. Catherine-Charlotte always enjoyed the sophistication and grandeur of the Versailles Court over Monaco; Louis I was less at ease there and it impacted their personal relationship which deteriorated.\n\nThe family returned to Monaco where Catherine-Charlotte had a quiet life. Later Catherine-Charlotte and Louis I would separate, she leaving Monaco for Paris in 1672. Destiny would have it that six years later Catherine would die relatively young, aged 39, of chronic tuberculosis. With Louis I she had six children including the future Antonio I.\n\nDiplomatic Career and Cherished Title\n\nFrom 1699 onwards Prince Louis threw himself into his role in Rome as ambassador and go-between for Louis XIV with two Popes, Innocent XII and later Clement XI, with whom he had a more difficult relationship. The Spanish Succession was the thorniest issue of the times and would wear out the most skilled diplomat. It took its toll on Prince Louis I who did his utmost to woo and influence the Roman aristocracy and clergy that he all but bankrupted Monaco in the process. And it was in no small part due to Prince Louis I’s efforts that King Louis XIV won his case at the Vatican which saw his grandson Philip Bourbon, Duke of Anjou ascend the Spanish throne as King Philip V after the death of King Charles II of Spain. So, from November 1700 Spain was ruled by one of the French Bourbons.\n\nPrince Louis, after two years of these exhausting negotiations would die in the first days of 1701 in Rome at the age of 58 after being dramatically despatched again by a relentless Louis XIV for yet more intense discussions with Pope Clement XI. But he would die with yet another strategic goal achieved for the Principality, in addition to advancing its legal code. He would secure Monaco’s alliance with France and keep in the good graces of Louis XIV by pledging his son and heir Antoine Duc de Valentinois, to marry Marie of the Imperial House of Lorraine in 1688, a match King Louis XIV himself arranged.\n\nAnd he would die also with his goal achieved of receiving the rare title «Prince Étranger» to the Court of Versailles from his powerful friend King Louis XIV of France who would go on to outlive him by another 14 years."}, {"url": "https://mathshistory.st-andrews.ac.uk/Biographies/Grimaldi/", "page_content": "1589\n\n1614\n\n(\n\n)\n\n(\n\n)\n\n18\n\n1632\n\n1632\n\n34\n\n1634\n\n20\n\n1571\n\n1635\n\n30\n\n1600\n\n1636\n\n37\n\n1637\n\n38\n\n1638\n\n1642\n\n1635\n\n1636\n\n1640\n\n24\n\n(\n\n)\n\n3\n\nAs everyone had expected, Galileo was disproved. The lead ball always hit the ground before the wooden one when they fell from the same height. The discrepancy between the experiment and Galileo's claim that they reached the bottom simultaneously was so great that Grimaldi supposed that Galileo must have known about it, but suppressed his knowledge in order to secure a proposition dearer to him than truth.\n\n1642\n\n1645\n\n1647\n\n... Grimaldi was well prepared to teach all branches of mathematics: geometry, optics, gnomonics, statics, geography, astronomy and celestial mechanics.\n\n1\n\n1651\n\nⓉ ( A new 'Almagest' )\n\n40\n\nThe argument against the Diurnal and Annual Motion of the Earth devised by Father Francisco Maria Grimaldi based on a cannon ball fired into the North, and into the East and West.\n\nⓉ ( A new 'Almagest' )\n\nP Francisco Maria Grimaldi and I have developed a method for reliably measuring the apparent diameters of the stars by means of a telescope.\n\nⓉ ( A new 'Almagest' )\n\n(\n\n)\n\nAn especially noteworthy contribution was his selenograph of the moon, a composite from telescopic observations of many phases, accurate and correct enough so that he must have used crossed hairs and a micrometer with his eyepiece.\n\n(1601\n\n1672)\n\n1650\n\n1655\n\nⓉ ( Geography and dydrography reformed )\n\n(1661)\n\nⓉ ( Astronomy reformed )\n\n(1665)\n\n45\n\n1665\n\n1\n\nThat a body actually enlightened may become obscure by adding new light to that which it has already received.\n\nGrimaldi's experiments and ideas were disseminated by others, not least by the Lyon Jesuit Honoré Fabri (1607 - 88) , a man whose writings, especially those on pure mathematics, were well known. Isaac Newton, by his own affirmation, learnt of the diffraction effect from the first dialogue in Fabri's 'Dialogi physici' (1669) .\n\nⓉ ( Six dialogues on physics: the first is on Light )\n\n96\n\n(1787\n\n1826)\n\n19\n\nth\n\nwas born into a well-off family. His father, Paride Grimaldi, was a silk merchant of noble birth who had moved to Bologna in. He married in Bologna, but the couple were childless when his wife died. In about, Paride Grimaldi married his second wife, Anna Cattani, who owned a chemist shop which she had inherited from her grandfather. Francesco was the fourth of his parents six sons, five of whom survived. He had two older brothersone child having died, the one that he was closest to being Vincenzo Maria Grimaldi who was almost exactly one year older. When Francesco was still quite young, his father died and, at that time, his mother took over running the family chemist shop. Francesco and his brother Vincenzo both joined the Society of Jesusthe JesuitsonMarchWe do not know all the places where Grimaldi studied, in particular we are unsure where he spent the two yearsalthough it was most likely in Novellara. We know for certain that inhe was in Novellara, aboutkm north of Reggio dell'Emilia, where he lived in the house which had been set up infor training Jesuit novices. Inhe went to Parma, just overkm to the west of Novellara, where he began his study of philosophy. The Jesuits ran three educational establishments in Parma, the university, a college for educating the sons of the nobility, and a Jesuit College, established around, which Grimaldi attended. In addition to advanced courses in philosophy and theology, the College provided lower level courses in grammar and rhetoric. However, he was in Parma for less than a year before he was transferred to Bologna to complete his first year of study of philosophy. His second year studying philosophy,, was spent at Ferrara before he returned to Bologna to finish the three year course in session. Having completed the three year philosophy course, he taught rhetoric and humanities in the College of Santa Lucia at Bologna for four years fromto. Grimaldi was taught by Giovanni Battista Riccioli in Parma inand both had moved to Bologna at the same time in. However, it was when Grimaldi returned to Bologna and was teaching there inthat he began assisting Riccioli with experiments. Grimaldi, working under instruction from Riccioli , dropped weights from the Asinelli tower and timed their fall using a pendulum. Riccioli was hoping that the experiments conducted by Grimaldi would refute Galileo 's theories, which in some sense they did. Let us look in a little more detail at the experiment.First, Grimaldi and Riccioli calibrated a pendulum by getting it to swing forhoursmeasured by the star Arcturus crossing the meridian line. They used thisfoot pendulum to calibrate a shorter pendulum to use in timing. Then Grimaldi dropped balls of wood and of lead from various heights from the Asinelli tower. A nice addition to the accuracy was obtained by getting a group of musical monks to chant in time with the swinging pendulum to aid with the timing. The experiment did not confirm Galileo 's result for, as one might expect, the lead balls reached the ground before the wood ones in all the experiments using different heights on the tower:-Over the next few years Grimaldi continued studying but also worked, particularly on astronomical investigations, with Riccioli . He studied theology betweenandgoing on to undertake further research on philosophy which led to him being awarded a doctorate in. He then began to teach philosophy but, after less than a year, he had changed topics and began to teach mathematics. It is not entirely clear what prompted the change. Many historians suggest that the change of topic was a result of health problems, and he found teaching mathematics less demanding than teaching philosophy. However, this seems somewhat unlikely and it would appear that he may have been eased out of teaching philosophy due to his views being too \"modern\". Remember that he was still within the Jesuit educational system. Certainly Riccioli , who wrote an obituary of Grimaldi, states clearly that:-Grimaldi was ordained a priest onMay. In the same year Riccioli published Almagestum novumin which he credited Grimaldi with being the source of overdifferent experiments. For example, the experiment of dropping weights from the Asinelli tower is described, and an experiment firing a cannon ball in different directions. This last experiment is quoted as follows:-As another example, we quote again from Almagestum novum:-Of course, this \"reliable method\" is no more than a property of the telescope and is measuring the brightness rather than the diameter of the stars. Believing that they were measuring diameters caused them, and others at this time, to have completely incorrect idea of the actual sizes of the stars. Grimaldi and Riccioli 's astronomical observations had been made in an observatory set up at the College of Santa Lucia in Bologna. In the Almagestum novum Riccioli thanks the \"diligent, prudent, and faithful\" Grimaldi. He says that he was too old to conduct the required late-night observations himself, so he had to rely on his young collaborator Grimaldi. Another important chapter in Almagestum novumpresented maps of the moon's surface made by Grimaldi and containing names for the major features on the surface, named after famous scientistsparticularly astronomers, which have been adopted today:-Another project on which Grimaldi worked was a survey, using triangulation, to determine a meridian line for Bologna. Again he collaborated on this with Riccioli but, in addition, he was assisted by Ovidio Montalbini, a professor at Bologna University and the custodian of its science museum, and Giovanni Domenico Cassini , who had been appointed as professor of mathematics at the University of Bologna infollowing the death of Bonaventura Cavalieri . The project was completed byand the results published, again by Riccioli , in Geographiae Hydrographiae Reformatae. Grimaldi did a considerable amount of observing and the data from his observations of stars was published in Riccioli 's Astronomia ReformataNow although we have given quite a lot of information about Grimaldi's work, everything we have mentioned so far was published in works by Riccioli . In fact Grimaldi has no works published under his own name during his lifetime. He died of a sudden illness at the age ofbut he had spent the last ten years of his life undertaking remarkable research on the properties of light. His work on light was so novel that it had a much smaller impact than one might have expected. He completed writing Physico-Mathesis de Lumine shortly before his death and it was published in. The work is an attempt by Grimaldi to determine whether light is a substance or whether it is a quality of another substance. He does this in a rather unusual way. The treatise consists of two books, the first puts forward arguments that light is a substance, although it does sometimes put the opposing view, while the second book argues that light is a quality of another substance. Grimaldi makes it clear that his own view is that light is not a substance and he believes that the arguments in the second book make it probable that light is a quality. Both books, however, have a common feature; they both argue against a corpuscular theory of light.Bookbegins with a description of Grimaldi's most famous discovery, namely the diffraction of light. He created a pinhole through which he allowed light from the sun to enter a darkened room and fall on a screen. The screen was at an angle so that the light produced a elliptical image on the screen. He placed a thin rod in the path of the light and measured the size of the shadow on the screen. He discovered that the shadow was larger than it should have been given conical nature of the beam. From this he argued that this effect was impossible if light consisted of corpuscles so light must have a fluid form which bent round the object. He also noticed coloured bands near to the shadow of the rod. Each band had three components, a white broad central part with a narrow violet band on the side nearest the shadow with a narrow red band on its side furthest from the shadow. He then described what effect was produced by placing obstacles of a different shape from the rod in the path of the cone of light. The name diffraction was chosen by Grimaldi because the effect reminded him of how a flowing fluid splits apart when a thin stick is placed in its path - the Latin diffractio means to \"break apart\". After treating diffraction, he looked at interference by allowing the light to enter the darkened room through two pinholes and observing where the images overlapped on the screen. He announced with the following proposition:-Next Grimaldi treated reflection, refraction, and the propagation of light. What we have so far described takes up about one half of the first book. The second half of this book is concerned with colours and the rainbow.Perhaps surprisingly, Grimaldi's treatise was little read but his important results on diffraction were made widely known by others. A Rupert Hall writes:- Honoré Fabri 's Dialogi physici sex quorum primum est de Luminehas as its first dialoguepages containing the description of Grimaldi's experiments. Fabri , however, did not believe Grimaldi's \"explanation\" of the results obtained and attempted to give his own interpretation. The importance of Grimaldi's experiments in influencing the work of Newton is discussed by Roger Stuewer in. It is worth noting that Grimaldi's attempt to explain diffraction was incorrect, as was the attempt of every scientist until Joseph von Fraunhoferin thecentury."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/rainier-i-the-first-lord-of-monaco/", "page_content": "In the first issue of HelloMonaco magazine, we introduced you to the founders of the Principality of Monaco, Otto Canella (Consul of the Republic of Genoa) and his youngest son, Grimaldo Canella. The story continues…\n\nThanks to their status, the family became known as Grimaldi, bringing forth the legendary Francesco Grimaldi. He learned the nickname «The Sly» after deceivingly conquering the fortress, the mainstay of the Monaco princely family. Sadly, Francesco turned out to be childless.\n\nAfter his death, his first cousin, and step-son, Rainier I, became the first ruler of Monaco. This is where we continue the story…\n\nNot many people today know what a legendary character Rainier I of Monaco used to be. He brought glory to the Grimaldi family thanks to his courageous sea and land campaigns. During the Fifth Crusade, Rainier I was the commander of the fleet that brought the Kings of Jerusalem and Hungary to Egypt.\n\nFrom the commander to the lord of Monaco\n\nRainier Grimaldi was born in 1267. He was the oldest son of a French priest, Lanfranco Grimaldi, and grandson of the Genoa Consul, Grimaldo. After the death of his father, his mother married Francesco Grimaldi. Rainier later became a top naval commander at the service of\n\nKing Charles II of Anjou. The glory of Rainier’s fleet was phenomenal. His courage brought him fame all across the Mediterranean.\n\nIn 1297, as the legend goes, Rainier agreed to help his stepfather, Francesco Grimaldi, take the fortress on the rock from the Genoese. Their victory marked the start of the Grimaldi reign in Monaco. To this day, Monaco’s Coat of Arms features two monks with swords, commemorating the legend of Grimaldi’s warriors taking «The Rock» disguised as monks, hiding swords under their long robes. Rainier became the first lord of Monaco, Rainier I.\n\nAt the service of the French King\n\nAt the time, King Philip IV of France launched a massive and ambitious campaign against a long-time enemy, England. Many believe that the continental blockade was Napoleon’s idea, but it was actually devised by Philip IV. The monarch made alliances all across the continent – from the Baltics to Sicily – to boycott English goods and leave the English island economically isolated. Although his policy worked, English King Edward I found a «gap» in the French plan. It turned out that Flanders was a weak link, isolated by the policy along with England. Edward I thus made an alliance with the count of Flanders to monopolize trade between England and the continent. This quickly compromised many ports, especially along the French coast, which began to incur some serious losses.\n\nThe wealthy merchants became a potential threat to the ruling nobility in Flanders. French King, Philip IV, supported the lords, while Edward I was standing with the merchants. In 1302, it all resulted in a military clash and the defeat of the aristocrats led by Philip IV. The French monarch was forced to seek help. Remembering the services offered to Charles of Anjou, Philip IV turned to Rainier Grimaldi.\n\nThe Battle of Zierikzee\n\nRainier brought 16 armed galleys to the French coast and Philip IV engaged 20 of his own ships. Rainier was in charge of training the French soldiers for the battle with the English, whose fleet was considerably inferior to the French. The Dutch and Flemish allies of England, however, had an excellent naval flotilla and reputation.\n\nThe battle took place in August, 1304 at Zierikzee. Despite the superior enemy, the French fleet under Rainier’s leadership won the battle, and captured the Flemish Admiral, Guy de Dampier. In gratitude, King Philip IV granted Rainier the title of Admiral General of France and presented him with the French city of Villeneuve, in Normandy.\n\nThe Rainier I family\n\nIn 1309, Rainier built a fortress known today as the Chateau Grimaldi in Cagnessur-Mer. He was then given the title of lord of Cagnes.\n\nThe Lord of Monaco was married twice. His first marriage was with Salvatica del Carretto, daughter of Giacomo del Carretto, Margrave of Finale (in Liguria). Salvatica gave Rainier four sons: Charles, Vinci Guerra, Salvaggia, and Luca, the future lord of Villefranche. Rainier’s second wife was Andriola Grillo, but they had no children. Admiral Rainier died in 1314, and his son Charles I became the next Grimaldi ruler."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iii-one-of-the-longest-reigns-in-european-history-en/", "page_content": "Everybody knows that the reign of French King Louis XIV, ‘Le Roi Soleil’, was the longest in European history. Two British Queens — Elizabeth II who will celebrate 70 years on the throne in 2022 and her great-great-grandmother Victoria (who reigned for 63 years) also had lengthy reigns. But few know that the fifth prince of Monaco is also on the list of the longest-reigning European monarchs: after coming to the Monegasque throne in 1733 he reigned for nearly 60 years and so passed his ancestor Honoré, Lord of Monaco, who ruled for 58 years in the XVI century.\n\nAscension to the Throne at the age of 13\n\nHonoré Camille Léonor Grimaldi was born on November 10, 1720. He was the son of Louise-Hyppolite, and the grandson of Prince Antoine I, who both died in 1731. Honoré came to the throne just after turning 13 when his father, Prince Jacques I, abdicated. Prince Honoré III spent much of his time away on campaign with the Royal French Army fighting the English in the War of the Austrian Succession. Honoré III was wounded fighting in the French victory at Rocoux. Later, he earned the Cross of St Louis for his conduct and after the Peace of Aix-la-Chapelle in 1748 he was given the rank of Marshal of France.\n\nWhat is interesting is that despite the heroic service of Honoré III in the wars, the Principality of Monaco was neutral in the conflict and, administered by the Chevalier de Grimaldi, assisted both French and English ships in need of help. The Austrians and Sardinians did blockade the Monegasque coast for a time and much of the countryside was pillaged by Croat soldiers of the Austrian army but French forces later cleared the region of all invaders in 1748.\n\nThe Royal Marriage\n\nIn 1757 Honoré III married Maria Caterina di Brignole-Sale who was descended from the Doges of Genoa and called “the most beautiful woman in France”. They were a very proud family and the arrival of the bride-to-be in Monaco turned into a disaster as many of the bridal attendants were seasick and the future mother-in-law insisted that Honoré III come onboard to greet his fiancé and escort her ashore. However, as a monarch in his own right, Honoré III refused as it was considered a breach of protocol for a prince to go to meet someone rather than them being brought to meet him. A stand-off ensued and eventually the Genoese fleet sailed away and stopped farther up the coast before a compromise was negotiated by which the couple would meet in the middle of a bridge extended between ship and shore. Nonetheless, the two were married and in 1758 the future Prince Honoré IV was born followed by Prince Joseph some years later. In 1770, though, Honoré III and Princess Maria Caterina divorced, and she later married the Prince de Condé in 1798.\n\nIn 1767 the British Duke of York was sailing from Marseilles to Genoa when he was suddenly taken ill and had to put in at Monaco. Prince Honoré III quickly offered all the help he could and put his palace at the disposal of the Prince who died after 11 days in what has forever after been known as the York Room of the Princely Palace.\n\nIn the meantime Prince Honoré III did what he could to guide his little principality along, improving trade and the economy which was heavily dependent on growing citrus fruits such as lemons in those days. His reign also saw the establishment of the first printing press in Monaco and the first newspaper the ‘Courrier de Monaco’. Prince Honoré III did take the initiative in pushing for some reforms, the most major of which was the repeal of the law that the Sovereign Prince would receive the inheritance of anyone who died on his property. On August 18, 1770 Honoré saw the practice, which he viewed as barbaric, abolished.\n\nThe French Revolution, Arrest and Imprisonment\n\nAs France slipped increasingly rapidly towards revolution things in Monaco remained calm and peaceful until the fateful day of July 14, 1789; the date of the storming of the Bastille. The shock spread to Monaco where crowds embraced the Declaration of the Rights of Man, influenced by the rise of republicanism in France as well as some newly introduced nostalgia for the Genoese Republic. Honoré III was concerned with the loss of his noble titles in France at the hands of the French National Constituent Assembly which was intent on abolishing all aristocratic privileges and soon he rushed to Paris to try to defend his titles there before the Constituent Assembly.\n\nHonoré III was extremely convincing when dealing with the French revolutionaries. His estates were, he insisted, not the gift of the King of France alone but payment for services rendered in the cause of French national glory. He struck just the right cord and the Assembly voted a generous pension for the Prince of Monaco in reparation for his confiscated properties.\n\nUnfortunately, before the order could be carried out, Danton came to power and the republic was declared. In all the turmoil France lost interest in Monaco and ultimately all Honoré was able to gain was recognition from the republican government of Monegasque neutrality. Unfortunately, that was a promise that would never be respected.\n\nThe French Republic declared their expansionist policy at the end of 1792. Monaco quickly fell victim to this policy and on January 13, 1793 Prince Honoré III was officially declared deposed by the Monegasque National Convention. Members of the Convention immediately filed a petition for accession to France. Some people in France however did protest on the grounds that Honoré III had always been a loyal friend and ally of the French, but republican hatred of monarchy prevailed and Monaco was absorbed into the French Republic and renamed Fort Hercules.\n\nAt the height of the Reign of Terror Honoré III was arrested as was his son, Honoré IV, who had been in Paris at the time and who would remain imprisoned for 15 months. Honoré III had suffered greatly from his own imprisonment and after his release had to stay in his house on the rue de Varennes as the Princely Palace in Monaco had been confiscated by the revolution though, thankfully, there was no ‘Reign of Terror’ or mass arrests and bloodshed in Monaco. Overcome with sadness, suffering, a number of ailments and the ravages of old age Prince Honoré III of Monaco died on March 21, 1795.\n\nIn 2020, the Principality paid a tribute to Prince Honoré III by having issued a 2€ commemorative coin celebrating the 300th anniversary of his birth. At the time of writing, the price of the coin, which was issued in 15,000 copies, has reached in the region of €300."}, {"url": "http://chiefacoins.com/Database/Countries/Monaco.htm", "page_content": "Monaco Principality of Monaco (French: Principauté de Monaco; Monégasque: Principatu de Múnegu; Italian: Principato di Monaco; Occitan: Principat de Mónegue), is a sovereign city-state, located on the French Riviera in Western Europe. Bordered by France on three sides, one side borders the Mediterranean Sea. It is nine miles from Nice . It has an area of 2.02 km2 (0.78 sq mi), making Monaco the second smallest, and the most densely populated country in the world. Monaco has a land border of only 4.4 km (2.7 mi), a coastline of 4.1 km (2.5 mi), and a width that varies between 1,700 and 349 m (5,600 and 1,145 ft). The highest point in the country is a narrow pathway named Chemin des Révoires on the slopes of Mont Agel, in the Les Révoires district, which is 161 metres (528 feet) above sea level. Monaco's most populous Quartier is Monte Carlo, and the most populous Ward is Larvotto/Bas Moulins. Monaco is known for its land reclamation, which has increased its size by an estimated 20%. Monaco is a principality governed under a form of constitutional monarchy, with Prince Albert II as head of state. Even though Prince Albert II is a constitutional monarch, he still has immense political power. The House of Grimaldi have ruled Monaco, with brief interruptions, since 1297. The official language is French, but Monégasque, Italian, and English are widely spoken and understood. The state's sovereignty was officially recognized by the Franco-Monegasque Treaty of 1861, with Monaco becoming a full United Nations voting member in 1993. Despite Monaco's independence and separate foreign policy, its defence is the responsibility of France. However, Monaco does maintain two small military units. Capital: Monaco. Motto: \"Deo Juvante\" (Latin) [Translation: With God's Help].\n\nGovernment: Unitary constitutional principality. The economy is based on tourism and the manufacture of cosmetics, gourmet foods and highly specialized electronics. Monaco also derives its revenue from a tobacco monopoly and the sale of postage stamps for philatelic purpose. Gambling in Monte Carlo accounts for only a small fraction of the country's revenue. Monaco derives its name from Monoikos', the Greek surname for Hercules, the mythological strong man who, according to legend, formed the Monacan headland during one of his twelve labors. Monaco has been ruled by the Grimaldi dynasty since\n\n1297 - Prince Albert II, the present and 32nd monarch of Monaco, is still of that line - except for a period during the French Revolution until Napoleon's downfall when the Principality was annexed to France. Since 1865, Monaco has maintained a customs union with France which guarantees its privileged position as long as the royal line remains intact. Under the new constitution proclaimed on December 17, 1962, the Prince shares his power with an 18-\n\nmember unicameral National Council. Grimaldi dynasty titles: 20 Sep 1331 - 14 Sep 1641: Signori di Monaco, (from 1346) Mentone (from 1355) e Roccabruna (\"Lord of Monaco, [from 1346] Menton [from 1355] and Roquebrunne\");\n\n14 Sep 1641 - 13 Jan 1793: Principe Sovrano di Monaco, Signore Sovrano di Mentone e Roccabruna (\"Sovereign Prince of Monaco, Sovereign Lord of Menton and Roquebrunne\");\n\nfrom 30 May 1814: Par la grâce de Dieu, Prince Souverain de Monaco (\"by the grace of God, Sovereign Prince of Monaco\"). The dynastic name has been preserved through several changes in patrilineage: all males marrying female heirs to the principality (as i.e. the father of Rainier III) have changed their family name to Grimaldi. All princes since Jacques I carried the additional title of duc de Valentinois, together with a very long list of other (actually extinct) titles (duc de Estouteville, duc de Mazarin et de Mayenne, prince de Château-Porcien, marquis des Baux, Chilly et Guiscard, comte de Carladès, Longjumeau, Thann, Belfort, Rosemont, Ferrette et de Thorigny, baron de Calvinet, Buis-les-Baronnies, Hambie, Massy, Altkirch, Saint-Lô et de la Luthumière, seigneur de Saint Rémy de Provence et Issenheim et sire di Matignon). 06 Aug 1174 Sold to Genoa by Raimond VI Count of Toulouse\n\n(claimant to county of Provence).\n\n30 May 1191 Holy Roman Emperor Heinrich VI grants suzerainty over the\n\narea to the Genoa (effective 2 Jul 1191, confirmed 4 Oct\n\n1220).\n\n10 Jun 1215 First stone of the fortress is laid.\n\n22 Jul 1262 Genoese possession confirmed by count of Provence.\n\n08 Jan 1297 Francesco and Raniero Grimaldi seize the fortress.\n\n04 May 1301 - 20 Sep 1331 Genoese rule.\n\n19 Nov 1346 Grimaldi acquire Lordship of Mentone (Menton).\n\n02 Jan 1355 Grimaldi acquire Roccabruna (Roquebrune) castle.\n\n15 Aug 1357 - 11 May 1397 Genoese rule.\n\n19 Dec 1395 Failed attempt to regain Monaco by Boglio (Beuil)\n\nbranch of the Grimaldi dynasty.\n\n05 Nov 1402 - 1419 Genoese rule.\n\n13 Nov 1428 Submission to Milan for Mentone by homage.\n\n06 Oct 1428 - 18 Mar 1436 Duchy of Milan rule.\n\n19 Dec 1448 Mentone and Roccabruna made a fief of Savoia.\n\n14 Jan 1498 - 07 Jun 1524 Protectorate of France (confirmed 11 Jun 1507).\n\n10 Dec 1506 - 22 Mar 1507 Under siege by Genoa.\n\n20 Feb 1512 France recognizes sovereignty of Monaco, French\n\nprotectorate remains.\n\n07 Jun 1524 - 17 Nov 1641 Protectorate of Spain (ratified 5 Nov 1524; definitive from\n\n10 Apr 1525).\n\n14 Sep 1641 Principality of Monaco (sovereign 8 Jun 1688); protectorate\n\nof France by Treaty of Péronne.\n\n31 Dec 1688 Monaco recognized as prince étranger by France.\n\n19 Jan 1793 National Convention declares the Grimaldi dynasty deposed;\n\nRépublique de Monaco.\n\n14 Feb 1793 - 30 May 1814 Annexed to France including Mentone and Roccabruna; from\n\n24 Feb 1793 part of département Alpes-Maritimes (under\n\nItalian states).\n\n22 Sep 1793 Monaco renamed Fort-Hercule.\n\n12 May 1800 - 31 May 1800 Austro-Sardinian occupation.\n\n17 Apr 1814 Provisional government established by revolt.\n\n17 May 1814 - 17 Jun 1814 Austrian occupation.\n\n30 May 1814 Principality of Monaco (restored) (effective on 17 Jun 1814).\n\n13 Mar 1815 - 20 Nov 1815 Anglo-Sardinian occupation.\n\n20 Nov 1815 - 18 Jul 1860 Protectorate of Piedmont-Sardinia.\n\n04 Nov 1847 - 25 Nov 1847 Public unrest in Menton (put down by requested Piedmont-\n\nSardinia intervention).\n\n22 Feb 1848 Menton asks Piedmont-Sardinia for protection.\n\n02 Mar 1848 Provisional government established in Menton.\n\n21 Mar 1848 Menton and Roquebrune proclaim themselves free cities\n\n(Città Libere di Mentone e Roccabruna/Villes Libres de Menton\n\net Roquebrune) under Sardinian protection and Grimaldi\n\ndynasty is deposed and then banned on 28 May 1848.\n\n03 Apr 1848 Menton occupied by Piedmont-Sardinia.\n\n18 Sep 1848 Piedmont - Sardinia decrees that the cities Menton and\n\nRoquebrune temporarily are to be governed according to\n\nSardinian law.\n\n01 May 1849 Sardinia places Menton and Roquebrune administratively under\n\nthe intending general of Nice.\n\n10 Nov 1849 Menton and Roquebrune annexed by Piedmont-Sardinia (which\n\nconsisted of 80% of Monaco).\n\n24 Mar 1860 County of Nice (including Menton and Roquebrune) ceded to\n\nFrance by Piedmont-Sardinia (effective 14 Jun 1860).\n\n18 Jul 1860 - 24 Oct 2002 Protectorate of France (confirmed 17 Jul 1918).\n\n02 Feb 1861 Monaco cedes all rights to Menton and Roquebrune to France\n\n(effective 12 Feb 1861).\n\n16 Nov 1942 - 09 Sep 1943 Occupied by Italy.\n\n09 Sep 1943 - 03 Sep 1944 Occupied by Germany. This tiny principality began as the base of operations for an exiled Genovese family, the Grimaldi, conducting piracy and raiding operations against the pro-Ghibelline Genoan state. They held a haphazard and intermittent connection with the locality thereafter, although permanent control over the city was not achieved until 1419. The Principality was established in 1659. Though fully independent, a 1918 treaty with France specifies that should the reigning dynasty become extinct, the Principality will revert to the status of an autonomous district within France.\n\nThe Ligurians................................................. ? - c. 500 BCE\n\nGreek colony of Monoikos (founded by Massalia/Marseilles).c. 500 - 47\n\nMassalia and her dependencies remained locally autonomous, albeit under Roman protectorate status, from the time of the First Punic War until Massalia picked the wrong side in the Civil War.\n\nRoman Republic..........................................(237-)49 - 27\n\nRoman Empire..............................................27 BCE - 395 CE\n\nWestern Roman Empire.........................................395 - 476\n\nKingdom of Odoacer...........................................476 - 493\n\nOstrogothic Kingdom..........................................493 - 553\n\nByzantine Empire.............................................553 - 568\n\nLombards.....................................................568 - 774 opposed by...\n\nCarolingian Empire.........................................760's - 843\n\nThe conflict and continuous cross-border raids by the Franks and Lombards left the town virtually depopulated.\n\nLotharingia..................................................843 - 870\n\nKingdom of Italy.............................................870 - 900\n\nIntermittently occupied by Saracen corsairs..................900 - 975\n\nKingdom of Burgundy..........................................975 - 1032\n\nHoly Roman Empire...........................................1032 - 1191\n\nGenoa.......................................................1191 - 1297 Fulco del Cassello.....................................1215 - 1220's\n\nGRIMALDI\n\nGrimaldo Canella (d. c. 1184) was the youngest son of Otto Canella and Consul of Genoa in 1162, 1170, and 1184. He is an ancestor and the namesake of the House of Grimaldi, the ruling family of Monaco. A century later, in 1270, the Guelph families of Grimaldi and Fieschi were forced into exile from Genoa. The Grimaldis ended up in the Guelph towns around Nice. They made their first attempt to seize the Ghibelline fortress of Monaco in 1297, although they did not control it permanently until 1419. Thus the family became Princes of Monaco.\n\nFrancis S/o Guglielmo..............................08 Jan 1297 - 10 Apr 1301 d. 1309\n\nFrancesco Grimaldi (François, in French) called il Malizia (\"the Cunning\"), was the Genoese leader of the Guelphs who captured the Rock of Monaco on the night of 8 January 1297. He was the son of Guglielmo Grimaldi by his wife Giacobina or Giacoba Aganetti, from counts of San Genuario, descendants of Odo, Count of Penthièvre. Dressed as a Franciscan monk, Francesco was greeted at the gates of Monaco's castle, only then to seize the castle with his cousin Rainier I, Lord of Cagnes, and a group of men behind him. The event is commemorated on the Monegasque coat of arms, on which the supporters are two monks armed with swords. He held the citadel of Monaco for four years before being chased out by the Genoese. The battle over \"the rock\" was taken over by his kinsmen. Francesco thus failed to establish Grimaldi's rule over Monaco, but was the first to attempt to do so.\n\nHe was married in 1295 to Aurelia del Carretto; the marriage was childless. The modern Grimaldis are therefore not descendants of Francesco. After his death, in 1309, he was succeeded by his cousin (and stepson), Rainier I, Lord of Cagnes.\n\nGenoa............................................10 Apr 1301 - 12 Sep 1331\n\nRainier I S/o Lanfranco ( at Cagnes ).....................1309 - 1314\n\nRainier I of Monaco (1267–1314) was the first sovereign Grimaldi ruler of the area now known as Monaco. He also held the title of Lord of Cagnes. Cagnes was the town where in 1309 he established a stronghold, today known as the Château Grimaldi. The eldest of the three sons of Lanfranco Grimaldi, French Vicar of Provence, by his wife, Aurelia del Carretto (who later was remarried to her late husband's nephew, François Grimaldi), Rainier joined his stepfather and a group of men to take the castle on the Rock of Monaco; the event is commemorated on the Monegasque coat of arms, where the supporters are two monks armed with swords (because François dressed as monk and opened the gates of Monaco's castle). Rainier held the citadel of Monaco for four years before departing on April 10, 1301. In 1304 he was appointed Admiral of France after winning the Battle of Zierikzee.\n\nCharles I S/o Rainier I.........................12 Sep 1331 - 15 Aug 1357 with...\n\nThe oldest son of Rainier I by his first wife, Salvatica del Carretto, Charles was forced to flee into exile following the Rock of Monaco falling into Genoese control on April 10, 1301. After thirty years of Genoese rule, Charles retook the Rock on September 12, 1331, and ruled to his death, when the Rock was again conquered by the Genoese army. In 1346 he took the Lordship of Menton and, in 1355, he conquered the Lordship of Roquebrune. On June 29, 1352, Charles designed a co-rulership of Monaco between his uncle Antonio (his father's youngest brother), and his own sons, Rainier II and Gabriele. Charles I married Lucchina Spinola, a daughter of Girardo Spinola, Lord of Dertonne. They had eight children.\n\nAntonio S/o Lanfranco............................29 Jun 1352 - 27 May 1357 d. 1357\n\nRainier II S/o Charles I.........................29 Jun 1352 - 15 Aug 1357 d. 1407\n\nGabriele S/o Charles I...........................29 Jun 1352 - 15 Aug 1357\n\nGenoa............................................15 Aug 1357 - 11 May 1397\n\nFailed attempt to regain Monaco by Boglio (Beuil), a branch of the Grimaldi dynasty on 19 Dec 1395.\n\nJean.............................................11 May 1397 - 05 Nov 1402 with...\n\nLouis............................................11 May 1397 - 05 Nov 1402\n\nGenoa............................................05 Nov 1397 - 1419\n\nJean I S/o Rainier II ( 1st time )........................1419 - 06 Oct 1428 with...\n\nAmbroise S/o Rainier II.................................1419 - 13 May 1427 d. 1433\n\nAntonie S/o Rainier II..................................1419 - 13 May 1427 d. 1435\n\nMilan............................................06 Oct 1428 - 18 Mar 1436\n\nJean I S/o Rainier II ( 2nd time ).................18 Mar 1436 - 08 May 1454\n\nCatalan S/o Jean I...............................08 May 1454 - 01 Jul 1457\n\nClaudine ( female ) D/o Catalan....................01 Jul 1457 - 16 Mar 1458\n\nShe was Lady regnant of Monaco 1457-1458, and then Lady consort of Monaco as spouse of Lord Lambert of Monaco. Claudine was the only child of her father, Catalan Grimaldi. At his death, her father stated in his will that she should marry her cousin to ensure that the Grimaldi family should keep the throne of Monaco. She became Lady of Monaco at her father's death in 1457, under the regency of her paternal grandmother, Pomelline Fregoso (d. 1462). After only one year of reign, she abdicated (1458) in favour of her cousin Lambert, her future spouse. In 1465, seven years after her abdication, she married Lambert and became Lady of Monaco as his spouse. Upon Lambert's death in 1494, their son Jean became Lord of Monaco as Jean II. Claudine outlived Jean, who was murdered in 1505 by his brother Lucien, the subsequent lord. Claudine died in 1515 during Lucien's reign. Pomelline Fregoso ( regent )..................01 Jul 1457 - 16 Mar 1458\n\nLambert de Antibes S/o Nicolas...................16 Mar 1458 - 15 Mar 1494\n\nHe was the son of Nicolas Grimaldi di Antibes and Cesarina Doria d’Oneglia.\n\nJean II S/o Lambert .......................... ....15 Mar 1494 - 11 Oct 1505\n\nDuring his 11-year reign, he pursued the politics of his father. He was made Lieutenant of the Riviera by King Charles VIII of France. Jean married Antonia of Savoy, illegitimate daughter of the Duke of Savoy and his mistress Libera Portoneri, in 1486. The marriage was childless. He was murdered by his brother Lucien, who then became Lord of Monaco.\n\nLucien S/o Lambert...............................11 Oct 1505 - 22 Aug 1523\n\nA year after Lucien's reign began, Genoa broke free of France, and many of its people fled to Monaco for refuge. In December 1506, 14,000 Genoese troops besieged Monaco and its castle. The blockade lasted for five months, until Lucien was able to rout the Genoese in March 1507. Monaco, and by extension Lucien, was now in a tight spot, being subjects of France but caught in a diplomatic tight spot between France and Spain, trying to preserve its fragile independence. In 1515, Lucien bought the feudal rights over the city of Mentone, retained by the family of Anne de Lascaris, Countess of Villars, thus bringing the city, as a whole, under Monaco's sovereignty until the French Revolution. Lucien was responsible for extensive repairs and additions to the Prince's Palace of Monaco, resulting from damage received during the Geneose siege. Pope Adrian VI visited Monaco during Lucien's reign, in 1522. On 22 August 1523, Lucien was assassinated by his nephew, Bartholomew Doria of Dolceaqua, son of Lucien's sister Francoise Doria, at the Prince's Palace of Monaco. His body was dragged down the steps of the palace by Doria's men, to be shown to the disbelieving masses, thus inciting a riot wherein the people of Monaco chased Doria and his men out of the country.\n\nAugustine S/o Lambert............................22 Aug 1523 - 14 Apr 1532\n\nHe was Regent of Monaco, Bishop of Grasse, Abbot of Lérins and founder of the village of Valbonne. Upon the assassination of his brother Lucien on 22 August 1523, Augustine was appointed Regent to Lucien's son Honoré, who was not yet a year old. He held this position for over 8 years, until his death at the age of 50 in 1532. In 1524, to better avenge himself on his brother's murderers, Bartholomew Doria and Andrea Doria, Augustine deserted Francis I of France, with whom the Doria's were allied. He then swore allegiance to Charles V, Holy Roman Emperor and King of Spain, by the signing of the Treaties of Burgos and Tordesillas. This brought Monaco under Spanish protection, and Augustine was placed at the head of the government in Monaco. The alliance lasted from 1525 to 1641. This alliance weighed heavily on the financial situation of Monaco, and shortly before his death on 14 April 1932, Augustine admitted to regret for his actions in this regard. During his Regency, Holy Roman Emperor Charles V paid a visit to Monaco in 1529.\n\nHonoré I S/o Lucien.............................14 Apr 1532 - 07 Oct 1581\n\nHe was born on 16 December 1522 and died on 07 October 1581. Honoré was the youngest child of Lucien Grimaldi (1487–1523) and Jeanne de Pontevès-Cabanes. He was of 9 months, when his father was assassinated. Nicholas Grimaldi ( regent ).................14 Apr 1532 - 23 Apr 1532 Étienne (Stephen) Grimaldi ( regent )........23 Apr 1532 - 16 Dec 1540\n\nÉtienne (Stephen) Grimaldi (died 1561) was from Genoa and known as “the Governor”. Etienne remained regent until 16 December 1540, when Honoré reached his majority and was responsible for restorations made to the Church of St. Nicholas. The reign of Honoré I was relatively calm and peaceful, and Honoré was remarkable for his bravery, wisdom and valour. In 1545 he married Isabella Grimaldi (died 1583). The couple had four sons.\n\nCharles II S/o Honoré I..........................07 Oct 1581 - 17 May 1589\n\nHe was born on 26 January 1555 and died on 17 May 1589. Protected by Spain, due to the Treaties of 1524, Charles was the first Lord of Monaco to refuse to pay homage to the Dukes of Savoy for Mentone and Roccabruna. In 1583 he was declared, after a trial, to have forfeited those two cities. Charles ruled for only 8 years before dying at the age of 33. He left no issue and so his youngest brother Hercule became Lord of Monaco.\n\nHercule S/o Honoré I.............................17 May 1589 - 21 Nov 1604\n\nHercule (Ercole) was born on 24 September 1562 and died on 21 November 1604. He was the youngest of four sons of Honoré I (1522–1581) and Isabella Grimaldi. He married Maria Landi on 15 December 1595 and the marriage produced three children; two daughters and one son.\n\nHonoré II S/o Hercule............................21 Nov 1604 - 10 Jan 1662\n\nHe was born on 24 December 1597 and the first to be called Prince, but started his reign as Lord of Monaco. He was the son of Hercule and Maria Landi. His father was murdered when he was six, and he succeeded under the regency of his uncle, Frederico Landi, 4th Prince of Val di Taro. Landi was a loyal ally and friend of Spain and allowed the country to be occupied by Spanish troops in 1605. The inhabitants of Monaco were prohibited to carry arms and the Prince and his two sisters were moved to Milan. The Council of Monaco tried to limit Spanish power but the occupation lasted until 1614, and a strong Spanish influence remained until 1633, when it recognized Honoré as a sovereign prince. From adulthood, Honoré started to criticize Spain and turned to France for support. Louis XIII gave him the support he needed and this resulted in the Treaty of Péronne. This ended Spanish rule and put Monaco under French protection, recognizing and guaranteeing Monegasque sovereignty. As a consequence Honoré lost his Spanish and Italian possessions, but was compensated by King Louis XIII of France with the marquisate Les Baux and the title of Duke of Valentinois. During his reign he did much to extend, rebuild and transform the Genoese fortress that was the Grimaldi's stronghold into what is today Monaco's Royal Palace. He was killed in a battle on 10 Jan 1662. On 13 February 1616 he married Ippolita Trivulzio (d. 1638). The couple had one son. Hercule (Ercole) Grimaldi, Marquis of Baux (1623 – 02 August 1651). Ercole Grimaldi, Marquis of Baux married on 04 July 1641 to Maria Aurelia Spinola (d. 29 September 1670) and had one son and three daughters. Federico, principe Landi di Valditaro ( regent )..21 Nov 1604 - c. Feb 1616\n\nLouis I S/o Hercule, Marquis of Baux............10 Jan 1662 - 03 Jan 1701\n\nLouis Grimaldi was born on 25 July 1642 and was the elder son of Prince Hercule of Monaco and Maria Aurelia Spinola. Louis married 30 March 1660 in Pau Catherine Charlotte de Gramont (1639 – Paris 4 June 1678), daughter of Marshal Antoine III de Gramont and had six children. In 1662 Louis succeeded his grandfather Honoré II as Prince of Monaco. In 1666 he distinguished himself at the Four Days' Battle between the English and Dutch fleets. On 5 July 1668 he took the oath to King Louis XIV of France in the Parlement on account of being Duke of Valentinois and a Peer of France. He was made a knight of the French royal orders on 31 December 1688. In 1699 Louis XIV sent Louis to Rome as ambassador extraordinary. There on 19 December he presented the insignia of the Order of the Holy Spirit to James Louis and Alexander Benedict Sobieski, the two sons of King John III of Poland. Louis remained in Rome, where he died 03 January 1701. His remains were transported back to Monaco.\n\nAntoine S/o Louis I..............................03 Jan 1701 - 20 Feb 1731\n\nHe was born on 25 Jan 1661 and was the elder son of Louis I, Prince of Monaco and Catherine Charlotte de Gramont. In 1683 Antonio was named lieutenant in the Régiment du Roi Infanterie. In 1684 he was named colonel of the regiment of Soissonois. During the Nine Years War he was present at the Battle of Philippsburg (1688), the Battle of Fleurus (1690), the Siege of Mons (1691), and the Siege of Namur (1692). On 21 August 1702 Antonio took the oath to King Louis XIV of France in the Parlement on account of being Duke of Valentinois and a Peer of France. He was made a knight of the French royal orders in 1724. Antonio married 13 June 1688 Marie de Lorraine-Armagnac (12 August 1674 – 30 October 1724), daughter of Louis de Lorraine-Guse, Count d'Armagnac. They had six daughters of whom only three survived infancy. Antonio also had also three known illegitimate children including Chevalier de Grimaldi (Antoine accepted him in 1715).\n\nLouise-Hippolyte ( female ) D/o Antoine............21 Feb 1731 - 29 Dec 1731 with...\n\nShe (born: 10 November 1697; died: 29 December 1731) was the second daughter of Antonio I of Monaco and Marie de Lorraine-Armagnac. Because she had no brothers, Louise Hippolyte became the heiress to the throne of Monaco. Her father decided, with the permission of Louis XIV, that her future husband should assume the surname of Grimaldi and rule Monaco jointly with her. On 20 October 1715, at the age of eighteen, she married Jacques François Goyon, Count de Matignon after his family had proposed him as a candidate. At the end of 1731, Louise Hippolyte died of smallpox. Her husband neglected the affairs of Monaco and had to leave the country in May 1732. He abdicated in favor of their son, Honoré, the next year.\n\nGoyon de Matignon\n\nJacques François Léonor..........................21 Feb 1731 - 07 Nov 1733 d. 1751\n\nHe (born: 21 November 1689; died: 23 April 1751) was count of Thorigny, Prince of Monaco as Jacques I and the fourth Duke of Valentinois from 1731 until 1733. Jacques came from an ancient Norman family. \"Thorigny\" is now called Torigni-sur-Vire, where the Mairie, or town hall, is the former family chateau. His uncle was Marshal of France Charles-Auguste de Goyon-Matignon. He was son of Jacques Goyon de Matignon, jure uxoris Count of Thorigny, and Charlotte Goyon de Matignon, Countess of Thorigny. When Antonio I of Monaco and his wife Marie de Lorraine was looking for a wedding partner for his daughter and heir Louise Hippolyte of Monaco, the family proposed him as a candidate. The prospect of his own Principality was very attractive and his candidacy was supported by King Louis XIV of France, who wanted to consolidate the French influence in Monaco. Jacques and Louise Hippolyte married on 20 October 1715 and had eight children. The wedding ceremony was the first official act that the five year old King Louis XV carried out during the Regency of the Duke of Orléans. The marriage wasn't very happy. Jacques preferred to stay more in Versailles than in Monaco, where he had several mistresses. After the death of Antonio I of Monaco, Louise Hippolyte traveled from Paris to Monaco on 04 April 1731 and received an enthusiast reception by the population. When Jacques joined her few times later, the reception was much colder.\n\nAt the end of 1731, Louise Hippolyte died of smallpox. Jacques I neglected the affairs of state and, under pressure from the population, had to leave the country in May 1732. He abdicated in favor of his son Honoré the next year. He spent the last years of his life in Versailles and Paris. It was at Versailles that Mademoiselle du Maine, a grand daughter of Louis XIV and Madame de Montespan was proposed as a wife for the widowed Prince; despite having a large dowry, (she was the daughter of the duc du Maine and his wife, the formidable Anne Louise Bénédicte de Bourbon) the marriage never materialised and the Prince never married again.\n\nHis Paris residence was named after him Hôtel Matignon and is today the official residence of the Prime Minister of France. Prior to his death, he was a frequent visitor to Versailles with his son.\n\nHonoré III Camille Léonor S/o Jacques............07 Nov 1733 - 19 Jan 1793 d. 1795\n\nHonoré III (born: 10 November 1720; died: 21 March 1795) ruled as Prince of Monaco and was Duke of Valentinois for almost sixty years from 1733 to 1793. Honoré was the son of Jacques I, Prince of Monaco and his wife, Louise Hippolyte, Princess of Monaco. In 20 May 1732, he moved to Hôtel Matignon in Paris with his father and remained there, even after the proclamation in 1733 of him as Prince of Monaco. Antoine Grimaldi, le Chevalier de Grimaldi, acted as regent for the prince between 1732 and 1784, when Honoré chose to reside in Paris. This situation remained the same for half a century until Antoine's death in 1784, when Honoré III was already 64 years old. Although he was open to the revolutionary ideas of the time, he was imprisoned on 20 September 1793. At his liberation a year later, he was ruined, and his property under seal.\n\nPresident of the National Convention\n\nJoseph Barriera aîné.............................19 Jan 1793 - 24 Feb 1793\n\nFrance...........................................14 Feb 1793 - 30 May 1814\n\nFrench Commandant\n\nArmand Louis de Gontaut, duc de Lauzun...........24 Feb 1793 - 01 Mar 1793 d. 1793\n\nCommissioners of the French National Convention\n\nBaptiste Henri Grégoire........................................01 Mar 1793 d. 1831\n\nGrégoire Marie Jagot...........................................01 Mar 1793 d. 1838\n\nAustrian Commandant\n\nCavaliere Fulchieri ( commander )..................12 May 1800 - 31 May 1800\n\nHungher ( commissioner )...........................12 May 1800 - 31 May 1800\n\nPresident of the Provisional Government\n\nLouis de Millo-Terrazzani........................17 Apr 1814 - 17 Jun 1814\n\nGRIMALDI\n\nHonoré IV S/o Honoré III.........................30 May 1814 - 16 Feb 1819\n\nHonoré IV (born: 17 May 1758; died: 16 February 1819) was Prince of Monaco and Duke of Valentinois from 12 March 1795 to 16 February 1819. He was the son of Prince Honoré III by his wife, Maria Caterina Brignole, a Genoese noblewoman. After the fall of Napoleon I, he regained control of the principality thanks to a clause added by Charles Maurice de Talleyrand-Périgord at the Congress of Vienna stating that, \"the Prince of Monaco should return to his estates\", and passed on his titles to his eldest son, Honoré V, Prince of Monaco. Honoré IV married Louise Félicité Victoire d'Aumont, Duchess of Aumont, Duchess Mazarin and of La Meilleraye on 15 July 1777 in Paris. They divorced in 1798. They had two sons: Honoré V (1778–1841) and Florestan I (1785–1856). Joseph Marie Jerôme Honoré ( regent ).........30 May 1814 - 23 Jun 1814 d. 1816 Honoré V Gabriel ( regent )...................03 Mar 1815 - 16 Feb 1819 d. 1841\n\nBritish Commander\n\nFrancis Burke....................................13 Mar 1815 - Jun 1815\n\nGRIMALDI\n\nHonoré V Gabriel S/o Honoré IV...................16 Feb 1819 - 02 Oct 1841\n\nHonoré V (born: 13 May/14 May 1778, in Paris; died: 02 October 1841, in Paris) was Prince of Monaco and Duke of Valentinois. He was born Honoré Gabriel Grimaldi, the first son of Honoré IV of Monaco and Louise d'Aumont. He died unmarried and his younger brother, Prince Florestan, succeeded him. Honoré V had a natural and legitimized son Louis Gabriel Oscar Grimaldi, marquis des Baux (born in Paris on 09 June 1814 and died in Saint-Germain-en-Laye on 15 July 1894), with Félicité Madeleine Honorée Gabrielle de Rouault de Gamaches, daughter of Joachim Valéry Thérèse Louis, marquis de Gamaches, grand d'Espagne and Marie Catherine Hyacinthe de Choiseul-Beaupré. Louis-Gabriel-Oscar Grimaldi also died unmarried.\n\nTancrède Florestan Roger Louis S/o Honoré IV.....02 Oct 1841 - 20 Jun 1856\n\nFlorestan (born: 10 October 1785, in Paris; died: 20 June 1856) was never prepared to assume the role of prince. He had been an actor in the Théâtre de l'Ambigu-Comique and the real power during his reign lay in the hands of his wife, also an actress, Maria Caroline Gibert de Lametz, whom he married in Commercy on 27 November 1816. For some time, she was able to alleviate the difficult economic situation stemming from Monaco's new position as a protectorate of the Kingdom of Sardinia, then a regional power, rather than of France. The princely couple also attempted to meet local demands for greater democracy and offered two constitutions to the local population, but these were rejected, particularly by the people of Menton. When they saw that their efforts were doomed to failure, they handed over power to their son Charles (later Prince Charles III). This was, however, too little, too late. Encouraged by the events of 1848, the towns of Menton and Roquebrune revolted, and declared themselves independent. They had hoped to be annexed by Sardinia, but this did not occur, and the towns remained in a state of political limbo until they were finally ceded to France in 1861, under Charles III. Menton and Roquebrune President of the Commission Menton & Roquebrune Capital: Menton Statut Fondamental (30 Apr 1848). Charles Trenca..............................02 Mar 1848 - 30 Apr 1848 d. 1853 Menton and Roquebrune President of the Government Charles Trenca ( continued )..................30 Apr 1848 - 18 Sep 1848 Sardinian Commander for Menton and Roquebrune Claudio Gonnet..............................03 Apr 1848 - 1849 d. 1866\n\nCharles III Honoré S/o Florestan.................20 Jun 1856 - 10 Sep 1889\n\nHe (born: 08 December 1818; died: 10 September 1889) was the founder of the famous casino in Monte Carlo (It stands for the \"Mount Charles\" in Italian), as his title in Monegasque and Italian was Carlo III. He was born in Paris Charles Honoré Grimaldi, the only son of Florestan I of Monaco and Maria Caroline Gibert de Lametz.\n\nCharles was married on 28 September 1846 in Brussels to Countess Antoinette de Mérode-Westerloo. He was succeeded by his son Albert I of Monaco. During his reign, the towns of Menton and Roquebrune, constituting some 80 percent of Monegasque territory, were formally ceded to France, paving the way for formal French recognition of Monaco's independence. Under Charles III, the Principality of Monaco increased its diplomatic activities; for example, in 1864, Charles III concluded a Treaty of Friendship with the Bey of Tunis, Muhammad III as-Sadiq, which also regulated trade and maritime issues. He was the 182nd Grand Cross of the Order of the Tower and Sword. In his middle years his sight greatly weakened, and by the last decade of his life he had become almost totally blind. He died at Château de Marchais.\n\nAlbert I Honoré Charles S/o Charles III..........10 Sep 1889 - 26 Jun 1922\n\nAlbert I (13 November 1848 – 26 June 1922) was Prince of Monaco and Duke of Valentinois from 10 September 1889 until his death. He devoted much of his life to the science of oceanography. Alongside his expeditions, On March 1910, there were mass protests against his rule. The Monegasque demanded a constitution and a parliament to rein in the absolute monarch or else they would overthrow him and establish a republic. They were dissatisfied about French domination of the principality's politics and economy. Albert I set about making reforms on political, economic and social levels, bestowing a constitution on the Principality in 1911. Also in 1911, Albert I created the Monte Carlo Rally, an automobile race designed to draw tourists to Monaco and the Casino. He was the son of Prince Charles III (1818–1889), and Countess Antoinette de Mérode-Westerloo (1828–1864), a Belgian noblewoman, maternal aunt of Donna Maria Vittoria dal Pozzo, Princess della Cisterna, Duchess consort of Aosta and Queen consort of Spain.\n\nAs a young man, Prince Albert served in the Spanish Navy, but during the Franco-Prussian War, he joined the French Navy where he was awarded the Legion of Honor. In addition to his interest in oceanographic studies, Albert had a keen interest in the origins of man and in Paris, he founded the \"Institute for Human Paleontology\" that was responsible for a number of archeological digs. The \"Grimaldi Man\" found in the Baousse-Rousse cave was named in his honour. Albert's intellectual achievements gained him worldwide recognition and in 1909, the British Academy of Science made him a member. Albert I constituted a collection of postage stamps that was later continued by Louis II and finally remain part of the postal museum Rainier III created in 1950. He was honored by \"Knight of the Black Eagle\" by German Empire.\n\nLouis II Honoré Charles Antoine S/o Albert I.....26 Jun 1922 - 09 May 1949\n\nBorn Louis Honoré Charles Antoine Grimaldi (born: 12 July 1870; died: 09 May 1949) in Baden-Baden, Germany, he was the only child of Prince Albert I of Monaco (1848–1922), and Lady Mary Victoria Hamilton (11 December 1850 – 14 May 1922). His mother was a daughter of William Alexander Anthony Archibald Hamilton, 11th Duke of Hamilton, and his wife, Princess Marie Amélie Elizabeth Caroline of Baden.\n\nWithin a year of his parents' marriage Louis was born, but his mother, a strong-willed 19-year-old, disliked Monaco and was unhappy with her husband. Shortly thereafter, she left the country permanently, and the princely couple's marriage was annulled in 1880. Louis was raised in Germany by his mother and stepfather, Count and later Prince Tassilo Festetics von Tolna, along with his eldest half-sister, Maria-Mathilde (later grandmother of Ira von Fürstenberg), and did not see his father until age 11 when he was obliged to return to Monaco to be trained for his future royal duties. While stationed in Algeria, he met Marie Juliette Louvet (1867–1930), a cabaret singer. (Juliette was already the mother of two children, Georges and Marguerite, by her former husband, French \"girlie\" photographer Achille Delmaet.). Their illegitimate daughter, Charlotte Louise Juliette, was born on 30 September 1898 in Constantine, Algeria. For ten years, Louis served in the military with distinction, being awarded the Cross of the Legion of Honor. In 1908 he returned home, leaving behind his mistress and daughter. At the outbreak of World War I, he re-enlisted in the French Army, proving to be one of the Fifth Army's most outstanding soldiers. He was made a Grand Officer of the Legion of Honor and eventually became a Brigadier General. While many of his Grimaldi ancestors had served in the military, none had ever acquitted themselves with more distinction than Louis.\n\nA political crisis loomed 1911-1918, for the Prince because without any other heir, the throne of Monaco would pass to his first cousin Wilhelm, the duke of Urach, a German nobleman who was a son of Prince Albert's aunt, Princess Florestine of Monaco. To ensure this did not happen, in 1911 a law was passed recognizing his illegitimate daughter, Charlotte, as Louis's acknowledged heir, and making her part of the sovereign family. This law was later held to be invalid under the 1882 statutes. Thus another law was passed in 1918 modifying the statutes to allow the adoption of an heir, with succession rights. Charlotte was formally adopted by Louis in 1919, and became Charlotte Louise Juliette Grimaldi, Princess of Monaco, and Duchess of Valentinois.\n\nWilhelm, 2nd Duke of Urach, thus placed further back in the line of succession to the throne of Monaco, as he was chosen as King of Lithuania for a few months in 1918, being known as Mindaugas II.\n\nOn 27 June 1922, Prince Albert I died in Paris. Louis Grimaldi ascended to the throne as Louis II, Prince of Monaco. While his reign never achieved the grandeur of his father, Louis II left an indelible imprint on the tiny principality. In 1924 the Monaco Football Club was formed and in 1929, the first Grand Prix of Monaco automobile race was held, won by Charles Grover (aka \"Williams\") driving a Bugatti painted in what would become the famous British racing green color. He collected artefacts belonging to Napoleon I which are now assembled and displayed in the Napoleon Museum attached to the Royal Palace in Monte Carlo.\n\nParticularly in the earlier years of Prince Louis' reign, he acquired the reputation for administrative probity: he obtained the departure of Camille Blanc who had long managed Monte Carlo Casino, about whom there were increasing questions as to his administration of the Casino's affairs.\n\nIn 1931, the prestige of Monaco's cultural life received a boost when René Blum was hired to form the \"Ballet de l'Opéra à Monte-Carlo.\" Just before the outbreak of World War II in 1939, a modern large football stadium had been built where the World University Games were staged at the newly named \"Stade Prince Louis II.\"\n\nWhile Prince Louis' sympathies were strongly pro-French, he tried to keep Monaco neutral during World War II but supported the Vichy France government of his old army colleague, Marshal Pétain. Nonetheless, his tiny principality was tormented by domestic conflict partly as a result of Louis' indecisiveness and also because the majority of the population was of Italian descent and they supported the fascist regime of Italy's Benito Mussolini. In 1943, the Italian Army invaded and occupied Monaco, setting up a Fascist government administration. Shortly thereafter, following Mussolini's collapse in Italy, the German army occupied Monaco and began the deportation of the Jewish population. Among them was René Blum, founder of the Opera, who died in Auschwitz, a Nazi concentration camp. Under Prince Louis' secret orders, the Monaco police, often at great risk to themselves, warned people in advance that the Gestapo was about to arrest them. However, throughout the War, Prince Louis' vacillation caused an enormous rift with his grandson Rainier, the heir to the throne, who strongly supported the Allies against the Nazis. For a number of months in 1944, communists participated in the Liberation administration of Monaco and it is a moot point to debate how strong a position Louis II was in, in 1944, to resist any attempts to abolish the monarchy in Monaco. Following the liberation of Monaco by the Allied forces, the 75-year-old Prince Louis did little for his principality and it began to fall into severe neglect. By 1946, he was spending most of his time in Paris and on 24–27 July of that year, he married in Monaco for the first time. His wife was Ghislaine Dommanget (1900–91), a French film actress and former wife of actor André Brulé. Absent from Monaco during most of the final years of his reign, he and his wife lived at Marchais, the family estate near Paris.\n\nPrince Louis died in 1949 in the Prince's Palace and is buried at the Saint Nicholas Cathedral in Monte Carlo, Monaco. His widow, Ghislaine, Dowager Princess of Monaco, died on 30 April 1991 in Paris, where she was interred in the Passy Cemetery. Hereditary Princess Charlotte ceded her succession rights to her son, Rainier, in 1944, at which time he became Hereditary Prince. When Louis died five years later, he was succeeded by his grandson, Prince Rainier III. Prince Louis was the 298th Grand Cross of the Order of the Tower and Sword. Honoré V coinage: 1837 - 1838 Currency: 10 Centimes = 1 Decime; 10 Decimes = 1 Franc. KM#95.2a 5 centimes (Cinq) . Year: 1837. Weight: 8.92g [9.00g]. Metal: Copper. Diameter: 28.50 mm. Edge: Oblique milling (Grained right). Alignment: Coin. Mint: Monte Carlo Mint. Obverse: \"CINQ CENTIMES\" with date, Mint mark and Mint director marks in the center surrounded by wreath all around. Reverse: Honoré V portrait in the center facing left. \"MONORE V PRINCE\" written on left side clockwise and \"DE MONACO\" written right side clockwise. \" BORREL F. \" designer's name written at the bottom. Mintage: N/A. Minted Years: 1837 and 1838. Note: This coin has smaller head of Honore V. This coin is slightly off-flan (off-centered) from both sides. Engraver: Borrel F. Mint Director during 1837-1838: Francois Cabinas (symbols are \"C\" and clasped hands). Louis II coinage: 1924, 1926, 1943 and 1945-1947 Currency: 1 Franc = 10 Decimes = 100 Centimes. KM#110 50 centimes . Year: 1924. Weight: 1.99g [2.00g]. Metal: Aluminum-Bronze. Diameter: 18.00 mm. Edge: Plain. Alignment: Coin. Mint: Paris. Obverse: \"HERCUL·MONOEC·\" (HERCULE MONACO) written at the right side clockwise. Hercules shooting bow on his one knee in the center right. Crown is on Louis II reign mark and \" DEO JVVANTE\" (GOD HELP) written in Latin below it at the left side. Engraver name is at the bottom left side \"Edmond-Emile Lindauer\". Reverse: \"CREDIT·FONCIER·DE·MONACO\" (Land Credit of Monaco) written in French at the top in the outer circle. \"REMB.JUSQU'AU 31XBRE 1926\" (Valid till 31st December 1926) written at the top in inner circle. Value \"50 CMES\" (50 centimes) divided by a sword facing upwards in the center and Shield below it. Mint marks on both sides of the shield. Thunderbolt mintmark of Poissy at left of shield. \"BON P. CINQUANTE CMES\" (Good for fifty centimes) written at the bottom in the outer circle. Mintage: 150,000. Minted Years: One year type. KM#120 1 Franc . Year: ND (1943). Weight: 1.29g [1.30g]. Metal: Aluminum. Diameter: 22.90 mm. Thickness: 1.5 mm. Edge: Plain. Alignment: Coin. Mint: Paris. Obverse: Crowned mantled arms flanked by value below. Reverse: Louis II portrait in the center with eye glasses facing left. \"LOUIS II PRINCE DE MONACO\" written around him. Engraver \"L. MAUBERT\" written at the bottom. Mintage: 2,500,000. Minted Years: One year type. KM#120a 1 Franc . Year: ND (1945). Weight: 3.99g [4.00g]. Metal: Aluminum-Bronze. Diameter: 22.90 mm. Edge: Plain. Alignment: Coin. Mint: Paris. Obverse: Crowned mantled arms flanked by value below. Reverse: Louis II portrait in the center with eye glasses facing left. \"LOUIS II PRINCE DE MONACO\" written around him. Engraver \"L. MAUBERT\" written at the bottom. Mintage: 1,509,00. Minted Years: One year type. KM#121 2 Francs . Year: ND (1943). Weight: 2.23g [2.20g]. Metal: Aluminum. Diameter: 27.00 mm. Thickness: 2.0 mm. Edge: Plain. Alignment: Coin. Mint: Paris. Obverse: Crowned mantled arms flanked by value below. Reverse: Louis II portrait in the center with eye glasses facing left. \"LOUIS II PRINCE DE MONACO\" written around him. Engraver \"L. MAUBERT\" written at the bottom. Mintage: 1,250,000. Minted Years: One year type. KM#121a 2 Francs . Year: ND (1945). Weight: 8.02g [8.00g]. Metal: Aluminum-Bronze. Diameter: 27.00 mm. Edge: Plain. Alignment: Coin. Mint: Paris. Obverse: Crowned mantled arms flanked by value below. Reverse: Louis II portrait in the center with eye glasses facing left. \"LOUIS II PRINCE DE MONACO\" written around him. Engraver \"L. MAUBERT\" written at the bottom. Mintage: 1,080,000. Minted Years: One year type. KM#122 5 Francs . Year: 1945. Weight: 3.76g [3.70g]. Metal: Aluminum. Diameter: 31.00 mm. Thickness: 2.4 mm. Edge: Plain. Alignment: Coin. Mint: Paris. Obverse: Crowned mantled arms flanked by value below. Date at the bottom. Reverse: Louis II portrait in the center with eye glasses facing left. \"LOUIS II PRINCE DE MONACO\" written around him. Engraver \"L. MAUBERT\" written at the bottom. Mintage: 1,000,000. Minted Years: One year type. KM#123 10 Francs . Year: 1946. Weight: 6.99g [7.00g]. Metal: Copper-Nickel. Diameter: 26.00 mm. Thickness: 1.8 mm. Edge: Reeded. Alignment: Coin. Mint: Paris. Obverse: Crowned mantled arms flanked by value below. Date at the bottom. Reverse: Louis II portrait in the center with eye glasses facing left. \"LOUIS II PRINCE\" written on the left side clockwise and \"DE MONACO\" written on the right side clockwise. Engraver \"P. TURIN\" (Pierre Turin) written at the tie knot. Mintage: 1,000,000. Minted Years: One year type. KM#124 20 Francs . Year: 1947. Weight: 10.10g [10.00g]. Metal: Copper-Nickel. Diameter: 30.00 mm. Thickness: 2.0 mm. Edge: Reeded. Alignment: Coin. Mint: Paris. Obverse: Crowned mantled arms flanked by value below. Date at the bottom. Reverse: Louis II portrait in the center with eye glasses facing left. \"LOUIS II PRINCE\" written on the left side clockwise and \"DE MONACO\" written on the right side clockwise. Engraver \"P. TURIN\" (Pierre Turin) written at the tie knot. Mintage: 1,000,000. Minted Years: One year type. Italian Consuls\n\nAntonio San Felice......................................1940 - 1941\n\nStanislao, marchese Lepri...............................1941 - 1943 d. 1980\n\nCommander of the Italian forces (58th Infantry Division Legnano)\n\nVincenzo Cesare Dapino..............................Nov 1942 - 09 Sep 1943 d. 1957\n\nGerman Consul General\n\nWalter Hellenthal................................05 Apr 1943 - 03 Sep 1944 d. 1967\n\nCommanders of German forces\n\nOtto Kohlermann..................................09 Sep 1943 - Oct 1943 d. 1984\n\nHe was the commander of 60th Panzergrenadier division Feldherrnhalle.\n\nCommanders of German forces - 715th infantry\n\nKurt Hoffmann....................................09 Sep 1943 - 05 Jan 1944 d. 1981\n\nHans-Georg Hildebrandt...........................05 Jan 1944 - Feb 1944 d. 1967\n\nCommanders of German forces - 148th reserve division\n\nOtto Fretter-Pico...................................Feb 1944 - 20 Mar 1944 d. 1966\n\nOtto Schönherr...................................20 Mar 1944 - 03 Sep 1944 d. 1954\n\nGRIMALDI - Polignac\n\nRainier III S/o Pierre...........................09 May 1949 - 06 Apr 2005\n\nRainier III (Rainier Louis Henri Maxence Bertrand Grimaldi; 31 May 1923 – 06 April 2005) ruled the Principality of Monaco for almost 56 years, making him one of the longest ruling monarchs of the 20th century. Rainier was born in Monaco, the only son of Prince Pierre of Monaco, Duke of Valentinois (né Count Pierre de Polignac) and his wife, Hereditary Princess Charlotte, Duchess of Valentinois. Born in Algeria, his mother was the only child of Prince Louis II and Marie Juliette Louvet; she was later legitimized through formal adoption and subsequently named heiress-presumptive to the throne of Monaco. His father was a half-French, half-Mexican nobleman from Brittany who adopted his wife's surname, Grimaldi, upon marriage and was made a prince of Monaco by his father-in-law. Rainier was best known outside of Europe for having married American actress Grace Kelly, he was also responsible for reforms to Monaco's constitution and for expanding the principality's economy beyond its traditional gambling base. Gambling accounts for only approximately three percent of the nation's annual revenue today; when Rainier ascended the throne in 1949, it accounted for more than 95 percent. Albert II ( regent )..........................31 Mar 2005 - 06 Apr 2005\n\nAlbert II........................................06 Apr 2005 - date\n\nAlbert II (Albert Alexandre Louis Pierre Grimaldi; born 14 March 1958) is the reigning monarch of the Principality of Monaco, and head of the Princely House of Grimaldi. He is the son of Rainier III, Prince of Monaco, and the American actress Grace Kelly. His sisters are Caroline, Princess of Hanover, heiress presumptive to the Crown, and Princess Stéphanie. In July 2011, Prince Albert married Charlene Wittstock. Prince Albert is one of the wealthiest royals in the world, with assets valued at more than $1 billion, which includes vast amounts of land in both Monaco and France. While his real estate does not include the Prince's Palace, it does include holdings in the Société des bains de mer de Monaco. Rainier III coinage: 1950 - 1956 Currency: 1 Franc = 100 Centimes. KM#130 10 Francs . Year: 1950. Weight: 3.03g [3.00g]. Metal: Aluminum-Bronze. Diameter: 23.50 mm. Thickness: 1.6 mm. Edge: Plain. Alignment: Coin. Mint: Paris. Obverse: Rainier III portrait in the center facing left with a circle of dots in his front and back. \"RAINIER III PRINCE DE MONACO\" written around him. Date at the bottom. Engraver \"P. TURIN\" (Pierre Turin) written above the date. Reverse: Crowned shield flanked by divided value, \"10\" on the left side and \"FRS\" on the right side. Six dots on each side below the mint marks. \"DEO JUVANTE\" (GOD HELP) written in Latin below the dotted circular curve. Mintage: 500,000. Minted Years: 1950 and 1951. Same as above coin KM#130, but... Year: 1951. Weight: 2.99g. Mintage: 500,000. KM#131 20 Francs . Year: 1950. Weight: 3.84g [4.00g]. Metal: Aluminum-Bronze. Diameter: 23.50 mm. Thickness: 1.6 mm. Edge: Plain. Alignment: Coin. Mint: Paris. Obverse: Rainier III portrait in the center facing left with a circle of dots in his front and back. \"RAINIER III PRINCE DE MONACO\" written around him. Date at the bottom. Engraver \"P. TURIN\" (Pierre Turin) written above the date. Reverse: Crowned shield flanked by divided value, \"20\" on the left side and \"FRS\" on the right side. Six dots on each side below the mint marks. \"DEO JUVANTE\" (GOD HELP) written in Latin below the dotted circular curve. Mintage: 500,000. Minted Years: 1950 and 1951. Same as above coin KM#131, but... Year: 1951. Weight: 4.02g. Mintage: 500,000. KM#132 50 Francs . Year: 1950. Weight: 7.95g [8.00g]. Metal: Aluminum-Bronze. Diameter: 27.00 mm. Thickness: 2.0 mm. Edge: Plain. Alignment: Coin. Mint: Paris. Obverse: Rainier III portrait in the center facing left with a circle of dots in his front and back. \"RAINIER III PRINCE DE MONACO\" written around him. Date at the bottom. Engraver \"P. TURIN\" (Pierre Turin) written above the date. Reverse: \"DEO JUVANTE\" (GOD HELP) written in Latin at the top. Armored equestrian in the center divides circular dotted pattern four times. Value \"50 FRANCS\" written at the bottom. Mintage: 500,000. Minted Years: One year type. KM#133 100 Francs . Year: 1950. Weight: 12.22g [12.00g]. Metal: Copper-Nickel. Diameter: 30.00 mm. Thickness: 2.0 mm. Edge: Plain. Alignment: Coin. Mint: Paris. Obverse: Rainier III portrait in the center facing left with a circle of dots in his front and back. \"RAINIER III PRINCE DE MONACO\" written around him. Date at the bottom. Engraver \"P. TURIN\" (Pierre Turin) written above the date. Reverse: \"DEO JUVANTE\" (GOD HELP) written in Latin at the top. Armored equestrian in the center divides circular dotted pattern four times. Value \"100 FRANCS\" written at the bottom. Mintage: 500,000. Minted Years: One year type. KM#134 100 Francs . Year: 1956. Weight: 5.93g [6.00g]. Metal: Copper-Nickel. Diameter: 24.00 mm. Edge: Reeded. Alignment: Coin. Mint: Paris. Obverse: Rainier III portrait in the center facing left. \"RAINIER III PRINCE DE MONACO\" written around him. Date at the lower right side. Engraver \" LAGRIFFOUL \" ( Henri Lagriffoul ) written above the date. Reverse: \"DEO JUVANTE\" (GOD HELP) written in Latin at the top divided by the crown. Crowned shield in the center. Value \"100 FRANCS\" written at the bottom. Mintage: 500,000. Minted Years: One year type. Rainier III coinage: 1960 - 2000 Currency: 1 Franc = 100 Centimes = 100 Old Francs (used from 1960 to 17 Feb 2002). KM#142 10 centimes . Year: 1962. Weight: 3.02g [3.00g]. Metal: Aluminum-Bronze. Diameter: 20.00 mm. Edge: Plain. Alignment: Coin. Mint: Paris. Obverse: Rainier III portrait in the center facing right. \"RAINIER III PRINCE DE MONACO\" written around him. Date at the bottom. Engraver \"SIMON\" (G. Simon) written at the back of the neck. Reverse: Figure with his right hand on shield and holding sword in his left hand, Crown above his right arm. \"DEO\" written above his right hand and \"JUVANTE\" written in Latin below his right foot. Value \"10 CENTIMES\" on the right side. Mint mark at his right foot. Mintage: 750,000. Minted Years: 1962, 1974-1979, 1982 and 1995 (1995 only in sets). Same as above coin KM#142, but... Year: 1974. Weight: 3.00g. Mintage: 172,000 . Same as above coin KM#142, but... Year: 1975. Weight: 2.98g. Mintage: 172,000 . Same as above coin KM#142, but... Year: 1976. Weight: 2.98g. Mintage: 172,000 . KM#145 Half Franc . Year: 1968. Weight: 4.52g [4.50g]. Metal: Nickel. Diameter: 19.50 mm. Edge: Reeded. Alignment: Coin. Mint: Paris. Obverse: Rainier III portrait in the center facing right. \"RAINIER III PRINCE DE MONACO\" written around him. Date at the bottom. Engraver \"R. COCHET\" ( Robert Cochet ) written at the back of the neck. Reverse: Crown on the top right side overlapping the shield in the center. Value \" ½ FR\" at lower left side with mint marks. \"DEO JUVANTE\" (GOD HELP) written in Latin on the right side clockwise. Mintage: 125,000. Minted Years: 1962, 1968, 1974-1979, 1982, 1989 and 1995 (1995 only in sets). Same as above coin KM#145, but... Year: 1982. Weight: 4.39g. Mintage: 460,000. KM#140 Franc . Year: 1968. Weight: 5.92g [6.00g]. Metal: Nickel. Diameter: 24.00 mm. Edge: Reeded. Alignment: Coin. Mint: Paris. Obverse: Rainier III portrait in the center facing right. \"RAINIER III PRINCE DE MONACO\" written around him. Date at the bottom. Engraver \"R. COCHET\" ( Robert Cochet ) written at the back of the neck. Reverse: Crown on the top right side overlapping the shield in the center. Value \" 1 FR\" at lower left side with mint marks. \"DEO JUVANTE\" (GOD HELP) written in Latin on the right side clockwise. Mintage: 250,000. Minted Years: 1960, 1966, 1968, 1974-1979, 1982, 1986, 1989 and 1995 (1995 only in sets). Same as above coin KM#140, but... Year: 1975. Weight: 6.01g. Mintage: 195,000. Same as above coin KM#140, but... Year: 1977. Weight: 5.96g. Mintage: 188,000. Same as above coin KM#140, but... Year: 1978. Weight: 6.03g. Mintage: 280,000. KM#157 2 Francs . Year: 1979. Weight: 7.47g [7.50g]. Metal: Nickel. Diameter: 26.50 mm. Edge: Reeded. Alignment: Coin. Mint: Paris. Obverse: \"2 FRANCS\" written at the top. Rainier III Monogram within crowned shield in the center. Date and mint marks at the bottom. Reverse: Rainier III portrait in the center facing right. \"RAINIER · III · PRINCE · DE · MONACO\" written around him. Engraver \"G. SIMON\" written at the back of the neck. Mintage: 162,000. Minted Years: 1979, 1981 and 1982. KM#154 10 Francs . Year: 1982. Weight: 10.00g [10.00g]. Metal: Copper-Nickel-Aluminum. Diameter: 26.00 mm. Edge: Reeded. Alignment: Coin. Mint: Paris. Obverse: \"10 FRANCS\" written at the top. Rainier III Monogram within crowned shield in the center. Date and mint marks at the bottom. Reverse: Rainier III portrait in the center facing left. \"RAINIER · III · PRINCE · DE · MONACO\" written around him. Engraver \"G. SIMON\" written at the back of the neck. Mintage: 230,000. Minted Years: 1975-1979 and 1981-1982. KM#163 10 Francs . Year: 2000. Weight: 6.51g [6.50g]. Metal: Bi-Metallic; Nickel in center and Aluminium-bronze in ring. Diameter: 23.00 mm. Edge: Plain and Reeded; 5 section each. Alignment: Coin. Mint: Paris. Obverse: Value \"10F\" and Rainier III monogram within center circle. \" PRINCIPAUTÉ DE MONACO \" written in outer circle. Mint mark and Date at the bottom. Reverse: Armored knight riding right with engraver \"R.B. BARON\" (Roger B. Baron) written below at left side, all within circle. \"DEO JUVANTE\" (GOD HELP) written in Latin in outer circle with dot at the bottom. Mintage: 250,000. Minted Years: 1989, 1991-1998 and 2000. Same as above coin KM#163, but... Year: 2000. Weight: 6.54g . Mintage: 240,000. Rainier III coinage: 2001 - 2005 Currency: 1 Euro = 100 euro cents. KM#173 1 Euro . Year: 2001. Weight: 7.52g [7.50g]. Metal: Bi-Metallic; Copper-nickel plated Nickel in center and Nickel-brass in ring. Diameter: 23.25 mm. Thickness: 2.33 mm . Edge: Plain and Reeded; 3 section each. Alignment: Medal. Mint: Paris. Obverse: \"MONACO\" written at the top. Six stars on each side. Mint mark and Date at the bottom. Portrait of Prince Rainier III in the left, imposed on Prince Albert portrait in the right; both facing right within center circle. Reverse: Map of Europe with the denomination \"1 EURO\" shown in Latin characters . Mintage: 994,634 + 3,500 in Proof + 20,000 in sets. Minted Years: 2001-2004. Engravers: Gérard Buquoy (obverse; mark description: horseshoe) and Luc Luycx (reverse). KM#174 2 Euros . Year: 2001. Weight: 8.45g [8.50g]. Metal: Bi-Metallic; Nickel-brass plated in Nickel center and Copper-nickel in ring. Diameter: 25.75 mm. Thickness: 2.20 mm . Edge: Reeded and lettering; The sequence \"2 * *\" repeated six times alternately upright and inverted. Alignment: Medal. Mint: Paris. Obverse: \"MONACO\" written at the top. Six stars on each side. Mint mark and Date at the bottom. Portrait of Prince Rainier III facing right within center circle. Reverse: Map of Europe with the denomination \"2 EURO\" shown in Latin characters . Mintage: 923,476 + 3,500 in Proof + 20,000 in sets. Minted Years: 2001-2004. Engravers: Gérard Buquoy (obverse; mark description: horseshoe) and Luc Luycx (reverse). Albert II coinage: 2006 - date Currency: 1 Euro = 100 euro cents. KM#195 2 Euros . Year: 2012. Weight: 8.44g [8.50g]. Metal: Bi-Metallic; Nickel-brass plated in Nickel center and Copper-nickel in ring. Diameter: 25.75 mm. Thickness: 2.20 mm . Edge: Reeded and lettering; The sequence \"2 * *\" repeated six times alternately upright and inverted. Alignment: Medal. Mint: Paris. Obverse: \"MONACO\" written at the top, Portrait of Prince Albert II facing right and Mint mark and Date at the bottom; all within center circle. 12 stars in outer circle. Reverse: Map of Europe with the denomination \"2 EURO\" shown in Latin characters . Mintage: 1,082,373 . Minted Years: 2009-2016. Engravers: Yves Sampo (obverse; mark description: pentagon with letters AG, MP and YS) and Luc Luycx (reverse). Same as above coin KM#195, but... Year: 2015. Weight: 8.50g . Mintage: 1,306,782. Countries / Territories Chiefa Coins"}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/hercule-i-doctor-of-law-and-father-of-the-first-prince-of-monaco-en/", "page_content": "The Grimaldi Princes have historically distinguished themselves in the arts and also in culture, sports and science. As a lover of the arts Prince Honoré II built the great collections of the Palace in the seventeenth century. Prince Albert I was a world-renowned eminent marine scientist and our reigning Prince Albert II participated in five Olympics. There is also a less heralded Lord among those of the Grimaldi dynasty who also demonstrated a fine intellect: Hercule Grimaldi born on September 24, 1562, the youngest son of four of Lord Honoré I of Monaco and his wife Isabella. In the Archives of the Palace there is a beautifully framed Diploma granting him a doctorate from the University of Padua at 22 years old — a Doctorate in Civil Law and Canon Law which would have been the culmination of four years of study, the first two years being the equivalent of a Bachelor’s degree. At the time Hercule, being the youngest son, would have been preparing himself for other than the role of Lord (Seigneur), perhaps even for an ecclesiastical role. But fate had other plans…\n\nTroubled Times\n\nHercule’s eldest brother was Charles II who succeeded his father as Seigneur of Monaco in 1581. His other two brothers, François and Horace, both died young. So when 33-years-old Charles II after just 8 years into his reign died unmarried and childless, Hercule succeeded him as Seigneur on May 17, 1589 at the age of 27. It was not an easy mantle to inherit as it was to be one of the most troubled times in Monaco’s history. The Spanish garrison on the Rock were progressively loathed by the Monegasque population. And Monaco with its strategic harbour was the target of many a conspiracy by surrounding feudal lords including Provence and Savoy, not to mention the lords in the great centres, in what is modern-day Italy. Savoy tried their hand at claiming Monaco via a notary called Boccone with the intention of driving out the Spanish and overthrowing the Grimaldis. Again though, success escaped them.\n\nIn 1595 Hercule married Maria Landi. They had three children: two daughters and a son, the future Honoré II, the first Lord of Monaco to bear the title Prince of Monaco.\n\nMysterious Assassination\n\nIt was a dangerous time to wander the streets and Hercule’s life was cut short one evening as he ventured out. On November 29, 1604 after leaving the house of the Governor Gastaldi (now 15, Rue de Comte Félix Gastaldi) the Lord of Monaco was stabbed to death… The Monaco Parish Registry records that, «The most noble and worthy seigneur Hercule Grimaldi, seigneur of Monaco, Marquis of Campagna, called to a better life at the age of about 42. Attacked by a force of 5 or 6 in the Grand-Rue, in front of the house of the «podestà master», Bartholomies Dadino, he at once delivered up his soul to God».\n\nWe don’t know exactly why this cruel act had happened… But it’s obvious that in order to avoid the sad destiny of their father, Hercule’s children were immediately hidden — till the moment when their uncle Feredico Landi, the 4th Prince of Val di Taro, arrived to rule as regent and ensure the Grimaldi dynasty would be preserved.\n\nDamnation of a Glorious Name\n\nHeracles (known as Hercules by the Romans) is one of the most respected heroes in Greek mythology, a symbol of strength, power and bravery. Sadly, bearing this revered name neither protected Hercule I from his fate and neither did it provide immunity from disaster to his progeny.\n\nThe next princely Hercule was the son and heir of Honoré II, proudly named after his grandfather, and father of the Prince who would ultimately reign in his stead, Louis I. The young Hercule, would-be heir with his new title Marquis de Baux, was also to meet an untimely end. It happened, on August 1, 1651 when he and his wife, Aurelia Spinola, and their children were making an expedition to the convent of Carnoles in Menton. After the sojourn was over the young Marquis Hercule took a walk in some gardens that were close by, target shooting with some soldiers of the guard with a relatively new rifle called an arquebuse. Suddenly, Hercule ordered one of the soldiers to shoot at a target to see how proficient he was. The soldier, eager to obey, turned rapidly and, while doing, caught the arquebuse in his belt. The weapon fired, and by accident, struck two others nearby and wounded Hereditary Prince Hercule in the spine. It was a mortal wound and he died the next day. On his deathbed he asked again and again that his involuntary murderer not be punished who, however, was placed in prison and there tried to commit suicide. The last will of the dying Hercule was respected, nevertheless: the soldier left the prison and then Monaco forever.\n\nHercule’s Progeny\n\nHercule I himself, Lord of Monaco and Doctor of Law, was buried in the St Sebastian chapel of St Nicholas Cathedral and would have been terribly saddened to learn his grandson and namesake had like himself been struck down in the prime of life. Though he also could not know it, he would have been proud that his 6-year-old son and heir would became Lord Honoré II, Seigneur of Monaco and subsequently first to carry the formal title Prince of Monaco. Neither could Hercule I know that his early achievement of earning a Doctorate in Law would over 400 years later be one of the treasures of the Archives of the Prince’s Palace.\n\nHelloMonaco magazine thanks the audio-visual archives of Monaco for the illustrations."}, {"url": "https://www.wikinut.com/guides/history/dark-curse-on-house-of-grimaldi/", "page_content": "In 1297 the Grimaldis who had been forced from their castle home, Monaco by their rivals, the Spinola family, later entered into some territorial alliances, that would enable them to take back Monaco forcibly. It was the turn of the Spinola family, to be banished from the City. This is, therefore, where the story of Francesco Grimaldi and his faction, who had conquered the castle of Monaco under the disguise of friars as well as the so-called Grimaldi curse, had originated from.\n\nThe Curse\n\nPrince Ernst August of Hanover, the husband of Princess Caroline of Monaco, was rushed to hospital while her late father, Prince Rainier, who had passed away, was yet to be buried at the time. This had lent credence to the belief in the curse on the dynasty of Prince Ranier Grimaldi.\n\nCaroline’s third husband, 51-year-old, Prince August, was admitted to intensive care at the Princess Grace Hospital in Monaco, he was diagnosed with an acute pancreatic disorder, a condition frequently associated with heavy drinking. The prince whose unruly behavior often landed him in the tabloids and court.\n\nThe prince’s illness revived the strange notion of the curse on Grimaldi that has supposedly hung over the Grimaldi lineage during its seven centuries of rule in Monaco. After the first Grimaldi, Francesco the Spiteful in 1297, who had tricked the principality’s defenders, the Spinola clan, by disguising himself as a monk seeking sanctuary, only to slaughter all of them, the curse decrees that the family would have short, unhappy marriages.\n\nConduct Unbecoming A Royal Prince\n\nPrince Ernst August broke protocol by kissing the Queen at a state banquet in Berlin. He also broke away from the Bild tabloid which published pictures of him, where he was urinating in public, against the Turkish Pavilion in Hanover. A German court, a year later, handed him eight months’ probation and a hefty fine for kicking a photographer in the buttocks and beating a Kenyan hotel owner.\n\nThe late Prince Rainier, whose marriage in 1956 to the Hollywood star Grace Kelly, was seen as a fairytale wedding, but the marriage was also strewn with bad luck.\n\nPrincess Grace died in a car crash in 1982, Caroline’s second husband in 1990, was killed in a motorboat accident. She married Ernst August in 1999 at Monaco’s royal palace and gave birth six months later to a daughter, Alexandra. Between them, they already had five children from previous marriages.\n\nPrincess Stephanie, meanwhile, had two children with her bodyguard Daniel Ducruet, before marrying him. She had a third child after their divorce, by another bodyguard, then she married a circus acrobat, which also ended in divorce.\n\nCharlene Tries To Escape Days Before Wedding\n\nPrince Albert, who had succeeded his father Prince Rainier in 2005, showed no sign of marrying or producing an heir at that time This would have led to Monaco becoming part of France once again. This was of course thwarted, five and a half years later by his glittering wedding, to Charlene Wittstock,33 of South Africa, last Saturday which included a guest list of scores of European royals, heads of state, and several fashion icons, actors, and sports idols.\n\nThe French press cited sources on Sunday, that Charlene had sought refuge in the South African embassy in Paris, in an attempt to get out of the wedding. This had resulted in her passport being confiscated by senior Palace officials and then persuading her to take part in the nuptials on the weekend.” Several sources have even confirmed that an arrangement was reached between the future bride and groom,” said a report in Le Journal du Dimanche (JDD), the French national newspaper, which provided no further details.\n\nIt followed confirmation by palace sources that Albert, 53, was due to undergo DNA tests because of claims by at least one unnamed woman that he has fathered yet another illegitimate child.\n\nSelect a list of Grimaldi’s\n\nGrimaldo, consul of the Republic of Genoa, founder of this House.\n\nHubert Grimaldi, first to bear the Grimaldi patronymic name.\n\nRainier I, lord of Cagnes, admiral of France\n\nCharles I, Lord of Monaco, Cagnes, and Menton\n\nAnthony, lord of Monaco, admiral of Genoa\n\nLuc and Marc Grimaldi of Antibes, lords of Menton, Cagnes, and Antibes\n\nLambert of Antibes and Claudia of Monaco\n\nAugustin, archbishop\n\nNicolas, prince of Salerno\n\nLouis I, Prince of Monaco, ambassador of Louis IV\n\nGiraloma Created a Cardinal in 1527. He married Francisca Cattaneo of Genoese and had five children. After her death, he entered holy orders. He was a Senator of Genoa.\n\nDomenico, Archbishop of Avignon and uncle of Girolamo Grimaldi-Cavalleroni (see below)\n\nGirolamo (1597 – 1683). Cardinal and Archbishop of Aix.\n\nGiraloma (1674-1733). Created a Cardinal 1731\n\nAlexander, doge of Genoa\n\nJohn Baptist, doge of Genoa\n\nPeter Francis, doge of Genoa\n\nHonoré II, Prince of Monaco (1597-1662)\n\nJacques François Leonor Grimaldi – Prince of Monaco and father of Honoré III, Prince of Monaco\n\nNicola ((1645-1717) Created cardinal deacon in the consistory of May 17, 1706\n\nLouise-Hippolyte, Princess of Monaco – mother of Honoré III, Prince of Monaco\n\nHonoré III, Prince of Monaco (1720-1795)\n\nHonoré IV, Prince of Monaco (1758-1819)\n\nHonoré V, Prince of Monaco (1778-1841)\n\nFlorestan I, Prince of Monaco (1785-1856)\n\nCharles III, Prince of Monaco (1818-1889)\n\nAlbert Honoré Charles Grimaldi (1848-1922)\n\nLouis Honoré Charles Antoine Grimaldi (1870-1949)\n\nPrince Pierre de Grimaldi, Count of Polignac (1895-1964)\n\nRainier Louis Henri Maxence Bertrand Grimaldi (1923-2005)\n\nAlbert Alexandre Louis Pierre Grimaldi (born 1958)\n\nStéphanie Marie Elisabeth Grimaldi (born 1965)\n\nPrincess Caroline Louise Marguerite (born 1957)\n\nFootnote :\n\nThe House of Grimaldi is associated with the history of the Republic of Genoa and the Principality of Monaco. The Grimaldi family descends from Grimaldo, a Genovese statesman at the time of the first Crusades. He was the son of Otto Canella, a Consul of Genoa in 1133, and in turn, Grimaldo became a Consul in 1160, 1170, and again in 1184. His numerous grandsons and their children led maritime expeditions throughout the Mediterranean, the Black Sea, and soon the North Sea, and quickly became one of the most powerful families of Genoa."}]}