{"Honoré IV modernized Monaco and expanded its influence.": [{"url": "https://en.gouv.mc/Government-Institutions/History-and-Heritage/Periods/Times-of-trouble-1793-1861/Honore-IV", "page_content": "This content will be available in English soon\n\nHonoré IV Type de bulle :\n\n\n\n\n\nOrdre précédent/suivant :\n\n0\n\n\n\nCouronne ? :\n\nYes\n\n\n\n"}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iv-prisoner-of-the-french-revolution-2/", "page_content": "Prince Honoré IV was born on May 17, 1758 in Paris, to his parents Prince Honoré III and Princess Maria-Caterina de Brignole-Sale. This prince, perhaps, experienced more challenges in life than any other Grimaldi. Most of his hardships were caused by the French Revolution, and the last hours of his life are still shrouded in mystery …\n\nThe victims of the Great Terror\n\nPrince Honoré IV was unlucky enough to be living in Paris when the Reign of Terror broke out in France. As a nobleman and prince he was soon arrested and thrown into prison. The prince’s former wife, Duchess of Mazarin, was also taken into custody. Assisted by their family doctor, however, she managed to escape and hide with her youngest son Florestan.\n\nThe revolution did not spare the family of Prince’s Honore IV’s youngest brother, Joseph. His wife, Marie Thérèse de Choiseul, was arrested on suspicion of espionage and executed by guillotine. She was only 27, leaving behind three little daughters.\n\nAs for Prince Honoré, he was imprisoned for one and a half years. This time in prison greatly undermined his health, and he never fully recovered from it afterwards. On March 21, 1795 his father died and Honoré IV ascended the throne of Monaco. At that time the monarchy had just been banned and Monaco was once again annexed to the French Republic under the name of Port Hercule.\n\nEven after Prince Honoré was released from prison, it took another seven years of negotiations before the French regime restored some of Honoré IV’s and his brother Prince Joseph’s income. The future started to look brighter for the Grimaldi’s once the radical revolutionary regime was followed by the French consulate and, finally, by the First French Empire of Napoleon Bonaparte.\n\nReturn to the throne\n\nWhen the Napoleonic Wars finally came to an end, the status of Monaco was restored by the Congress of Vienna (1814–1815) thanks to the efforts of Prince Talleyrand. On May 30, 1814 Honoré IV was officially named the Principality’s ruler. However, he was too ill to take control of his country. So it was his brother Prince Joseph who became regent.\n\nThe Prince’s eldest son, 36-year-old Honoré Gabriel, however, was not happy about this decision. A brilliant soldier, he entered the cavalry service at the age of 20 and prospered in the army of the Empire Marshal, Emmanuel de Grouchy. Since Prince Joseph was not particularly eager to deal with the Principality’s affairs, preferring his life in the capital, he easily facilitated handing over the reins to his nephew, Honoré Gabriel, who ruled Monaco up until the death of Honoré IV (later becoming Prince Honoré V). As for Honoré IV, he lived in Paris until his very death which remains mysterious to this day…\n\nAccident or murder ..?\n\nOn a winter’s day of February 16, 1819, Honoré IV drowned in the Seine river. The death of the Monaco prince looked like a typical accident. That’s what the investigation concluded as an official version. It must not be forgotten, however, that Honoré IV was not a very healthy person, to say the least. This is the reason why he was not only unwilling, but was also physically unfit to rule the country. Imprisonment and numerous personal tragedies had taken their toll on the Prince, making him, for all intents and purposes, disabled. This is what the scanty preserved data suggests. A legitimate question arises: how could a 60-year-old monarch, in deplorable physical state, manage to cover such a considerable distance away from home (Avenue Denfert-Rochereau) to the Seine river bank..?\n\nWas it really an accident? Or rather a premeditated murder? Or could it be that the Prince decided to put an end to his own unhappy life? Being a depressed person, did he step into the Seine himself..? The answer remains a mystery.\n\nThe main legacy of Prince Honore IV\n\nAs Prince of Monaco, Honoré IV suffered three arrests and never actually ruled Monaco. He spent part of his life in a prison cell and the rest, trying to improve his health. Needless to say, there are very few mentions of the Prince, even in the archives of Monaco. His most important contribution to the history of Monaco was the birth of his two sons — the future princes, Honoré V and Florestan I, who consistently ruled the Principality and left their mark on the state’s history."}, {"url": "https://dbpedia.org/page/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "أونوريه الرابع هو سياسي فرنسي، ولد في 17 مايو 1758 في باريس في فرنسا، وتوفي بنفس المكان في 16 فبراير 1819. انتخب Pair of France ‏. (ar)\n\nHonoré IV. von Monaco (* 17. Mai 1758; † 16. Februar 1819) war von 1814 bis zu seinem Tod regierender Fürst von Monaco. Honoré war der ältere Sohn des Fürsten Honoré III. und dessen Gemahlin Marie Catherine de Brignole Sale. Er war seit 1777 verheiratet mit Louise d’Aumont Mazarin, Herzogin von Mazarin (1759–1829) und hatte mit dieser zwei Söhne, die nacheinander regierenden Fürsten Honoré V. und Florestan I. Nach dem französischen Annexionsbeschluss 1793 war er teils unter harten materiellen Bedingungen in einem Kerker in Paris inhaftiert, ehe er mit der Restauration 1814 gesundheitlich angeschlagen die Gelegenheit bekam, als Erbe seines Vaters die Herrschaft über Monaco anzutreten. (de)\n\nΟ Ονώριος Δ΄ (γαλλικά: Honoré IV) ήταν ο Πρίγκιπας του Μονακό από τις 30 Μαΐου 1814 ως τις 16 Φεβρουαρίου 1819. Γονείς του ήταν ο Πρίγκιπας Ονώριος Γ΄ και η Γενοβέζα αριστοκράτισσα . Ο Ονώριος Δ΄ παντρεύτηκε την στις 15 Ιουλίου 1777 στο Παρίσι. Χώρισαν το 1798, αφού προηγουμένως είχαν αποκτήσει δύο γιους: 1. * τον Ονώριο (1778–1841) 2. * τον Φλορεστάνο (1785–1856) Ανέλαβε τα ηνία του Πριγκιπάτου του Μονακό στις 30 Μαΐου 1814, μετά τη λήξη της περιόδου της γαλλικής κατοχής (1793-1814). Κατά τη διάρκεια της γαλλικής κατοχής του Μονακό ο Πρίγκιπας Ονώριος είχε φυλακιστεί για πολλά χρόνια. Εξαιτίας αυτού ασθένησε και στα τελευταία του χρόνια κατέστη ανίκανος να κυβερνήσει. Έτσι, από το 1815 παραχώρησε τα καθήκοντά του στον αδελφό του και έπειτα στο γιο του Ονώριο Ε΄. (el)\n\nHonoré IV (Honoré Charles Anne Grimaldi; 17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 1814 to 16 February 1819. Because of his health, the state of affairs was managed by a regency of his brother Joseph Grimaldi, and his son Prince Honoré V. (en)\n\nHonorato IV, Príncipe de Mónaco (París, 17 de mayo de 1758 – París, 16 de febrero de 1819) fue Príncipe Soberano de Mónaco entre 1814 y 1819, luego de la Ocupación Francesa (1793 - 1814). Hijo de Honorato III y de su esposa, María Catalina Brignole Sale. Fue sucedido por su hijo mayor, el Príncipe Honorato. Recuperó el control del principado con ayuda exterior y pasó sus títulos a su hijo mayor, Honorato V. Se casó el 15 de julio de 1771 con , , de la cual se divorció en 1798. Tuvieron dos hijos, que reinaron a su vez: * Honorato V (1778-1841). * Florestán I (1785-1856). En materia de política exterior fue capaz de ganar el favor de Génova, secular opositor del dominio independiente del Principado de Mónaco, esto se logró con su madre, María Catalina Brignole Sale, proveniente de una poderosa familia que tenía entre sus miembros varios Dux de Génova. (es)\n\nHonoré IV, né le 17 mai 1758 à Paris et mort le 16 février 1819 dans la même ville, est prince souverain de Monaco du 30 mai 1814 au 16 février 1819, après la période d'occupation française (1793-1814). (fr)\n\nOnorato IV di Monaco (Parigi, 17 maggio 1758 – Monaco, 16 febbraio 1819) è stato Principe sovrano di Monaco dal 1814 fino al 1819. (it)\n\nオノレ4世（Honoré IV, 1758年5月17日 - 1819年2月16日）は、モナコ公（在位：1814年 - 1819年）。 (ja)\n\nHonorato IV, Príncipe de Mônaco (17 de Maio de 1758 - 16 de Fevereiro de 1819) foi o sexto príncipe soberano de Mônaco, tendo reinado entre 1795 até sua morte. Também havia sido o sexto . Honorato IV era filho de Honorato III, Príncipe de Mônaco e de Maria Catarina de Brignole. Em 1777, desposou Luísa Felícia Vitória de Aumont, Duquesa de Mazarino, com quem teve dois filhos: * Honorato V, Príncipe de Mônaco * Florestan I, Príncipe de Mônaco (pt)\n\nHonorius IV Karel Anna Maria Maurits Grimaldi (Monaco, 17 mei 1758 – Parijs, 16 februari 1819) was van 1814 tot 1819 vorst van Monaco. Hij was de zoon van prins Honorius III, die in de Franse Revolutie werd onteigend (1793) en in 1795 in gevangenschap stierf. Na de val van Napoleon in 1814 werd de onafhankelijkheid van Monaco door het Verdrag van Parijs hersteld. Honorius wilde vanwege zijn slechte gezondheid de macht overdragen aan zijn broer . Na protesten van zijn zoon Honorius Gabriël aanvaardde hij toch zelf de regering, hoewel het bestuur in feite door regenten werd gevoerd. Na de terugkeer van Napoleon werd Honorius IV gevangengenomen en voor de keizer gevoerd. Na 's keizers uiteindelijke val werd op het Congres van Wenen de soevereiniteit van Monaco opnieuw hersteld, nu echter als protectoraat van het Koninkrijk Sardinië. Honorius werd na zijn dood in 1819 opgevolgd door zijn zoon Honorius V. Uit zijn huwelijk met , hertogin de Mazarin et de la Meilleraye, werden twee kinderen geboren: * Honorius Gabriël (1778-1841), de latere vorst Honorius V; * Tancred Florestan Rogier Lodewijk (1785-1856), de latere vorst Florestan. (nl)\n\nHonore Grimaldi, książę Monako, książę Valentinois (ur. 17 maja 1758, zm. 16 lutego 1819 w Paryżu) – 7. książę Monako od 30 maja 1814 do 16 lutego 1819, syn księcia Honoriusza III Grimaldi i księżnej Marii de Brignole. (pl)\n\nHonoré IV av Monaco, född 17 maj 1758, död 16 februari 1819, var en monark (furste) av Monaco. Han var son till Honoré III av Monaco och Maria Caterina Brignole Sale. Han satt fängslad under franska revolutionen, men undgick avrättning. Monaco anslöts till Frankrike i mars 1793, och han blev därför inte furste vid sin fars död 1795. Efter Napoleons fall 1814 återupprättades furstendömet Monaco och han placerades på dess tron i enlighet med legitimitetsprincipen. Eftersom han var för sjuk för att kunna resa till Monaco och tillträda regeringen, insattes regenter i hans ställe; först hans bror Josef av Monaco, och från 1815 hans son Honoré V. (sv)\n\n奧諾雷四世（德語：Honoré IV，1758年5月17日－1819年2月16日），摩納哥親王，1814年至1819年在位。 (zh)\n\nОноре IV (фр. Honoré IV, 17 мая 1758, Париж — 16 февраля 1819, Париж) — шестой князь Монако, правивший в 1814—1819 годах. (ru)\n\nОноре IV (фр. Honoré IV; 17 травня 1758 — 16 лютого 1819) — шостий князь Монако, що правив в 1814—1819 роках. (uk)"}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/grimaldi-family-the-legacy-of-prince-honore-v/", "page_content": "Prince Honoré-Gabriel was born in Paris on May 14, 1778, the eldest son of Prince Honoré IV of Monaco and Princess Louise Felicite Victoire d’Aumont, Duchesse de Mazarin et de La Meilleraye.\n\nHe enlisted in a French cavalry regiment when he was 20 years old and worked his way up through the ranks by his own merits until he became an officer on the staff of Marshal Grouchy. He was an exemplary soldier and was cited for his bravery many times. He was wounded in the arm at the great Napoleonic victory in the battle of Hohenlinden which prevented him from seeing action at Austerlitz.\n\nHe did serve with great distinction at the battles of Jena with Marshal Murat’s cavalry corps. Marshal Grouchy recommended him for the star of the Legion of Honor, relating that the Prince had taken a handful of cavalry and forced the surrender of an entire enemy battalion.\n\nWhen Napoleon was sent into exile the restored King Louis XVIII of France restored the Grimaldis to their places in the French nobility. Grandson of Honoré III and son of Honoré IV, Honoré V (1778-1841) was therefore too named, after the restoration of 1814, member of the House of Peers by king Louis XVIII. But many were afraid that Monegasque independence would not be or that they would be annexed by the Kingdom of Piedmont-Sardinia. Thanks to the Prince Talleyrand, however, a clause was inserted into the Treaty of Paris to put Monaco back in order. When Napoleon attempted to restore his empire during the 100 days Monaco was occupied by British troops and so the Grimaldis played no part in the affair.\n\nHonoré IV was unable to return to Monaco because of his poor health and so appointed his brother Joseph to rule on his behalf. But Honoré-Gabriel didn’t like that idea and he protested fiercely this and after some struggle he was himself appointed to govern Monaco.\n\nOn his way to Monaco he met with his old commander Napoleon as he was on his way to Paris to seize power at the start of the 100 days. Napoleon asked where he was going and Honoré-Gabriel said he was going home to Monaco. Napoleon said he was going home to the Tuileries, but as things unfolded he was not to remain there long.\n\nIn 1819, when his father passed away, Honoré-Gabriel became the Sovereign Prince of Monaco as Honoré V and inherited a Principality beset with problems. At once a member of the French Parliament and a Sovereign, he picked up on the project of his grandfather to diversify economic resources and encouraged the installation of factories. The Great Powers of Europe had taken Monaco out of the French sphere of influence and made the Principality a protectorate of Piedmont-Sardinia. The government in Turin closed the tobacco plant that Honoré III had established and enforced a number of other changes that left Monaco impoverished.\n\nHonoré V went to Turin to try to reason with the King but, although he was treated with great honor and respect, none of his grievances were addressed. Honoré V also had to raise taxes considerably which made him increasingly unpopular. His granting of a monopoly on flour caused a bread shortage but no one had the nerve to voice opposition to him. He also pushed opportunities for tourism. However, the lack of a market for local products, the omnipresence of the State and the lack of presence of the Sovereign created tensions, especially in Menton. The sovereign ended up pacifying Menton before going forward with his effort to provide the Principality with amenities. By his own admission he “desired to do good” but “did not manage to”, despite his philanthropic ideals.\n\nWhen liberal movements began to oppose the counter revolutionary tide of post-Napoleonic Europe some in Monaco thought of joining in but Sardinian troops arrived to crush the potential rebellion in its infancy.\n\nHistory has tended to record Prince Honoré V as a very unpopular and autocratic monarch, but, in reality he was quite progressive. He wished to help his people sincerely and had great sympathy for the poor. His reaction to seeing beggars on the streets was to form state-owned industries and put them to work. Some of the industries he set up included a lace factory and a hat factory. He also had them put to work on farm cooperatives as citrus orchards had long been a large part of the Monegasque economy. All of this has led some people to regard Prince Honoré V as a sort of socialist, though he probably would not have seen it that way.\n\nPrince Honore V died, unpopular and unappreciated on October 2, 1841 in Paris. As he was not married and had no children the Monegasque throne passed to his poet-actor brother who became Prince Florestan I of Monaco."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iii-one-of-the-longest-reigns-in-european-history-en/", "page_content": "Everybody knows that the reign of French King Louis XIV, ‘Le Roi Soleil’, was the longest in European history. Two British Queens — Elizabeth II who will celebrate 70 years on the throne in 2022 and her great-great-grandmother Victoria (who reigned for 63 years) also had lengthy reigns. But few know that the fifth prince of Monaco is also on the list of the longest-reigning European monarchs: after coming to the Monegasque throne in 1733 he reigned for nearly 60 years and so passed his ancestor Honoré, Lord of Monaco, who ruled for 58 years in the XVI century.\n\nAscension to the Throne at the age of 13\n\nHonoré Camille Léonor Grimaldi was born on November 10, 1720. He was the son of Louise-Hyppolite, and the grandson of Prince Antoine I, who both died in 1731. Honoré came to the throne just after turning 13 when his father, Prince Jacques I, abdicated. Prince Honoré III spent much of his time away on campaign with the Royal French Army fighting the English in the War of the Austrian Succession. Honoré III was wounded fighting in the French victory at Rocoux. Later, he earned the Cross of St Louis for his conduct and after the Peace of Aix-la-Chapelle in 1748 he was given the rank of Marshal of France.\n\nWhat is interesting is that despite the heroic service of Honoré III in the wars, the Principality of Monaco was neutral in the conflict and, administered by the Chevalier de Grimaldi, assisted both French and English ships in need of help. The Austrians and Sardinians did blockade the Monegasque coast for a time and much of the countryside was pillaged by Croat soldiers of the Austrian army but French forces later cleared the region of all invaders in 1748.\n\nThe Royal Marriage\n\nIn 1757 Honoré III married Maria Caterina di Brignole-Sale who was descended from the Doges of Genoa and called “the most beautiful woman in France”. They were a very proud family and the arrival of the bride-to-be in Monaco turned into a disaster as many of the bridal attendants were seasick and the future mother-in-law insisted that Honoré III come onboard to greet his fiancé and escort her ashore. However, as a monarch in his own right, Honoré III refused as it was considered a breach of protocol for a prince to go to meet someone rather than them being brought to meet him. A stand-off ensued and eventually the Genoese fleet sailed away and stopped farther up the coast before a compromise was negotiated by which the couple would meet in the middle of a bridge extended between ship and shore. Nonetheless, the two were married and in 1758 the future Prince Honoré IV was born followed by Prince Joseph some years later. In 1770, though, Honoré III and Princess Maria Caterina divorced, and she later married the Prince de Condé in 1798.\n\nIn 1767 the British Duke of York was sailing from Marseilles to Genoa when he was suddenly taken ill and had to put in at Monaco. Prince Honoré III quickly offered all the help he could and put his palace at the disposal of the Prince who died after 11 days in what has forever after been known as the York Room of the Princely Palace.\n\nIn the meantime Prince Honoré III did what he could to guide his little principality along, improving trade and the economy which was heavily dependent on growing citrus fruits such as lemons in those days. His reign also saw the establishment of the first printing press in Monaco and the first newspaper the ‘Courrier de Monaco’. Prince Honoré III did take the initiative in pushing for some reforms, the most major of which was the repeal of the law that the Sovereign Prince would receive the inheritance of anyone who died on his property. On August 18, 1770 Honoré saw the practice, which he viewed as barbaric, abolished.\n\nThe French Revolution, Arrest and Imprisonment\n\nAs France slipped increasingly rapidly towards revolution things in Monaco remained calm and peaceful until the fateful day of July 14, 1789; the date of the storming of the Bastille. The shock spread to Monaco where crowds embraced the Declaration of the Rights of Man, influenced by the rise of republicanism in France as well as some newly introduced nostalgia for the Genoese Republic. Honoré III was concerned with the loss of his noble titles in France at the hands of the French National Constituent Assembly which was intent on abolishing all aristocratic privileges and soon he rushed to Paris to try to defend his titles there before the Constituent Assembly.\n\nHonoré III was extremely convincing when dealing with the French revolutionaries. His estates were, he insisted, not the gift of the King of France alone but payment for services rendered in the cause of French national glory. He struck just the right cord and the Assembly voted a generous pension for the Prince of Monaco in reparation for his confiscated properties.\n\nUnfortunately, before the order could be carried out, Danton came to power and the republic was declared. In all the turmoil France lost interest in Monaco and ultimately all Honoré was able to gain was recognition from the republican government of Monegasque neutrality. Unfortunately, that was a promise that would never be respected.\n\nThe French Republic declared their expansionist policy at the end of 1792. Monaco quickly fell victim to this policy and on January 13, 1793 Prince Honoré III was officially declared deposed by the Monegasque National Convention. Members of the Convention immediately filed a petition for accession to France. Some people in France however did protest on the grounds that Honoré III had always been a loyal friend and ally of the French, but republican hatred of monarchy prevailed and Monaco was absorbed into the French Republic and renamed Fort Hercules.\n\nAt the height of the Reign of Terror Honoré III was arrested as was his son, Honoré IV, who had been in Paris at the time and who would remain imprisoned for 15 months. Honoré III had suffered greatly from his own imprisonment and after his release had to stay in his house on the rue de Varennes as the Princely Palace in Monaco had been confiscated by the revolution though, thankfully, there was no ‘Reign of Terror’ or mass arrests and bloodshed in Monaco. Overcome with sadness, suffering, a number of ailments and the ravages of old age Prince Honoré III of Monaco died on March 21, 1795.\n\nIn 2020, the Principality paid a tribute to Prince Honoré III by having issued a 2€ commemorative coin celebrating the 300th anniversary of his birth. At the time of writing, the price of the coin, which was issued in 15,000 copies, has reached in the region of €300."}, {"url": "https://www.unofficialroyalty.com/honore-iv-prince-of-monaco/", "page_content": "by Susan Flantzer\n\n© Unofficial Royalty 2022\n\nHonoré Charles Anne Grimaldi was born in Paris, France on May 17, 1758. He was the elder of the two sons of Honoré III, Prince of Monaco and Maria Caterina Brignole who came from a Republic of Genoa (now in Italy) noble family. Honoré’s paternal grandparents were Louise-Hippolyte, Sovereign Princess of Monaco for ten months before her death from smallpox, and Jacques I, briefly the Sovereign Prince of Monaco, born Jacques François Leonor Goyon de Matignon. His maternal grandparents were Giuseppe Brignole, Marquis di Groppoli, the Ambassador to France from the Republic of Genoa, now in Italy, and Maria Anna Balbi.\n\nHonoré IV had one younger brother:\n\nPrince Joseph of Monaco, Regent of Monaco (1763 – 1816), married (1) Marie Thérèse de Choiseul, had three children, Marie Thérèse was guillotined during the French Revolution (2) Frances Margaret Powell, no children\n\nHonoré IV’s parents had issues with their marriage. Honoré III and Maria Caterina initially lived in Monaco but by 1760, Honoré III was dissatisfied with his life there, and returned to France without his wife, spending time with his mistresses at his French homes. Eventually, Maria Caterina was allowed to come to France. However, Honoré III continued his affairs and Maria Caterina began an affair, that would become long-term, with Louis Joseph de Bourbon, Prince of Condé. In 1770, Louis Joseph used his influence to obtain a legal separation for Maria Caterina from Honoré III and the right to manage her own finances. Honoré III finally realized his relationship with Maria Caterina was over and eventually accepted Maria Caterina’s relationship with Louis Joseph de Bourbon, Prince of Condé. Three years after Honoré III’s death in 1798, Maria Caterina and Louis Joseph were married but their marriage was kept secret for ten years.\n\nHonoré IV and his brother Joseph grew up mostly in France, living in homes inherited from their paternal grandfather Jacques III Goyon de Matignon, Count of Thorigny: a Paris mansion, the Hôtel de Matignon, now the official residence of the Prime Minister of France, and the Château des Matignon (link in French) in Torigni-sur-Vire in Normandy, France. In 1641, during the reign of Honoré II, Monaco had become a French protectorate, and the Princes of Monaco became vassals of the Kings of France while remaining sovereign princes. Many successive Princes of Monaco and their families spent most of their lives in France and intermarried with French and Italian noble families.\n\nHonoré III arranged a marriage for his son Honoré (IV) to Louise d’Aumont, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the only child of Louis Marie Guy d’Aumont de Rochebaron, Duke of Aumont (1732 – 1799) and Louise-Jeanne de Durfort, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye (1735 – 1781). Through her mother, Louise was the great-great-great-granddaughter of Hortense Mancini, Duchess of Mazarin, Duchess of Mayenne, Duchess of Meilleraye, the mistress of King Charles II of England, and one of the two heirs of her uncle Cardinal Jules Mazarin, the First Minister of King Louis XIV of France. Louise was the heir of Hortense Mancini’s titles and the Mazarin family wealth. Therefore, a marriage to Louise came with a large dowry and the prospect of a fortune. Honoré (IV) and Louise married on July 15, 1777.\n\nThe marriage did produce two sons, both Sovereign Princes of Monaco:\n\nThe French Revolution had dire consequences for the Grimaldi family. In January 1793, Honoré III, Prince of Monaco was officially declared deposed and the Principality of Monaco was annexed by France. The members of the former ruling Grimaldi dynasty lost all aristocratic privileges in France, were dispossessed of their French property, and became French citizens. During the Reign of Terror, in September 1793, Honoré (IV), his wife Louise, their son Florestan, and Honoré (IV)’s father Honoré III were arrested and imprisoned in Paris as enemies of the people. Louise and her son Florestan were rescued by a family doctor who forged release papers and then hid them in his home until the Reign of Terror was over. The wife of Honoré IV’s brother Joseph was not as lucky. Joseph spent most of his time abroad negotiating foreign loans which made him a suspect of counter-revolutionary activities. When Joseph did become involved in a counter-revolution, his wife Marie Thérèse was arrested in the absence of her husband, condemned to death, and guillotined in 1794, one of the last victims before the end of the Reign of Terror.\n\nIn October 1794, Honoré III and Honoré (IV) were released from prison. Honoré III never recovered from his imprisonment and died in Paris on March 21, 1795, at the age of 74, but his burial place is unknown. Honoré IV, whose chronic ill health had been worsened by imprisonment, would have become Prince of Monaco but Monaco was no longer a sovereign monarchy. However, Honoré IV’s family properties in France were returned to him but they were in poor condition and all of the contents were gone.\n\nIn 1794, while Honoré IV was still in prison, Louise had given birth to an illegitimate daughter Amélie Céleste Erodore d’Aumont. The father of the child is believed to have been Antoine de Montazet, Archbishop of Lyon. After Honoré IV’s release from prison, Louise and Honoré IV’s marriage became unhappy and the couple separated. In 1798, Louise divorced Honoré IV, giving Louise sole access to her fortune.\n\nIn 1804, Napoleon crowned himself Emperor of the French. Honoré IV could not adapt to the new French society and for the most part, remained an outsider. Because of a lack of funds, he needed to sell his family’s Paris and Normandy homes. Surprisingly, Honoré IV’s health improved and he joined the French Army. He was wounded during Napoleon’s Russian Campaign, lost the use of one arm, and was sent back to Paris.\n\nAfter Napoleon’s defeat in 1814 and the Bourbon Restoration which saw Louis XVIII, a younger brother of the beheaded King Louis XVI, become King of France, Florestan’s uncle Joseph petitioned King Louis XVIII to restore the Principality of Monaco to the Grimaldi family. Florestan’s father Honoré IV finally became Sovereign Prince of Monaco in 1814. The independence of Monaco lasted for only one year. In 1815, the Congress of Vienna, an international diplomatic conference that reconstituted the European political order after the downfall of Napoleon I, declared that Monaco would be a protectorate of the Kingdom of Sardinia.\n\nBy the time Honoré IV became the Sovereign Prince of Monaco, his physical condition had worsened and he was now paralyzed on one side of his body. Because of his condition, a regency was established to rule in his name. Honoré IV’s brother Joseph was regent from 1814 -1815 and then Florestan’s brother Honoré V served as regent until his father’s death in 1819 when he succeeded him as Honoré V, Prince of Monaco.\n\nHonoré IV, Prince of Monaco died in Paris, France on February 16, 1819, aged 60. He was buried at the Church of Saint Nicholas in Monaco. During the late 19th century, a new and larger church, the Cathedral of Monaco, was built on the site of the Church of Saint Nicholas. The original church was demolished in 1874 but the current cathedral was built over the areas of the previous church and the old burial site so that the sovereign princes and consorts originally buried at the Church of Saint Nicholas are now buried in the Cathedral of Monaco.\n\nThis article is the intellectual property of Unofficial Royalty and is NOT TO BE COPIED, EDITED, OR POSTED IN ANY FORM ON ANOTHER WEBSITE under any circumstances. It is permissible to use a link that directs to Unofficial Royalty.\n\nWorks Cited\n\nEdwards, Anne, 2017. The Grimaldis of Monaco . Blue Ridge Summit: Lyons Press.\n\n. Blue Ridge Summit: Lyons Press. En.wikipedia.org. 2022. Honoré IV, Prince of Monaco – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Honor%C3%A9_IV,_Prince_of_Monaco> [Accessed 22 March 2022]. En.wikipedia.org. 2022. Louise d’Aumont – Wikipedia . [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022].\n\n. [online] Available at: <https://en.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Honoré III, Prince of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/honore-iii-prince-of-monaco/> [Accessed 22 March 2022]. Flantzer, Susan, 2022. Maria Caterina Brignole, Princess of Monaco . [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022].\n\n. [online] Unofficial Royalty. Available at: <https://www.unofficialroyalty.com/maria-caterina-brignole-princess-of-monaco/> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Honoré IV (prince de Monaco) — Wikipédia . [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022].\n\n. [online] Available at: <https://fr.wikipedia.org/wiki/Honor%C3%A9_IV_(prince_de_Monaco)> [Accessed 22 March 2022]. Fr.wikipedia.org. 2022. Louise d’Aumont — Wikipédia. [online] Available at: <https://fr.wikipedia.org/wiki/Louise_d%27Aumont> [Accessed 22 March 2022]."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-v-a-brilliant-officer-and-an-unlucky-sovereign/", "page_content": "The eldest son of Prince Honoré IV was so eager for power that he declared himself a ruler against the will of his father. Tough and authoritarian, accustomed to military discipline from his youth, he made important economic decisions alone but failed to make the country prosperous and failed to make its population rich and happy. In fairness, we note that the Prince sincerely did his best.\n\nMilitary service for France\n\nPrince Honoré-Gabriel, the eldest son of Prince Honoré IV of Monaco and Princess Louise Felicite Victoire d’Aumont, was born in Paris on May 14, 1778. He enlisted in a French cavalry regiment when he was 20 years old and worked his way up through the ranks by his own merits until he became an officer on the staff of Marshal Grouchy. He was an exemplary soldier and was cited for his bravery many times. Being wounded in the arm he couldn’t take part in the action at Austerlitz (1805) but did serve with great distinction at the battle of Jena (1806) with Marshal Murat’s cavalry corps. Marshal Grouchy recommended him for the star of the Legion of Honour, relating that the Prince had taken a handful of cavalry and forced the surrender of an entire enemy battalion.\n\nIn April 1814, Napoleon Bonaparte abdicated the throne and was sent into exile on the island of Elba. The restored King Louis XVIII of France himself then also restored the Grimaldis to their places in the French nobility. Therefore, after the restoration of 1814, Honoré-Gabriel was also named member of the House of Peers by King Louis XVIII. But many were afraid that Monegasque independence would not be secure or that the Principality might be annexed by the Kingdom of Piedmont-Sardinia. Thanks to Prince Talleyrand, however, a clause was inserted into the Treaty of Paris to put Monaco securely back in order and independent.\n\nReturn to Monaco and meeting with Napoleon\n\nHonoré IV was unable to return to Monaco because of his poor health and so appointed his brother Joseph to rule on his behalf. But Honoré-Gabriel didn’t like that idea and he protested fiercely about this and after some struggle he was himself appointed to govern Monaco.\n\nIn March, 1815 on his way to Monaco he met with his old commander Napoleon who was on his way to Paris to seize power at the start of the 100 days. “Where are you going?”, Napoleon asked. “Going home, to Monaco”, Honoré-Gabriel answered. “Me too, I’m going home, to the Tuileries,” Napoleon said. When Napoleon attempted to restore his empire during the 100 days Monaco was occupied by British troops and so the Grimaldis played no part in the affair.\n\nDifficult years of reign\n\nIn 1819, when his father passed away, Honoré-Gabriel became the Sovereign Prince of Monaco as Honoré V and inherited a Principality beset with problems. At the same time being both a member of the French Parliament and the Sovereign of Monaco, he picked up on the project of his grandfather to diversify economic resources and encouraged the installation of factories. The Great Powers of Europe had taken Monaco out of the French sphere of influence and made the Principality a protectorate of Piedmont-Sardinia. The government in Turin closed the tobacco plant that Honoré III had established and enforced a number of other changes that had left Monaco impoverished.\n\nHonoré V went to Turin to try to reason with the King of Piedmont-Sardinia but, although he was treated with great honour and respect, none of his grievances were addressed. Honoré V also had to raise taxes considerably which made him increasingly unpopular. His granting of a monopoly on flour caused a bread shortage but no one had the nerve to voice opposition to him. He also pushed opportunities for tourism. However, the lack of a market for local products, the omnipresence of the State and the lack of presence of the Sovereign created tensions, especially in Menton. The Sovereign ended up pacifying Menton before going forward with his effort to provide the Principality with amenities. By his own admission he “desired to do good” but “did not manage to”, despite his philanthropic ideals.\n\nWhen liberal movements began to oppose the counter revolutionary tide of post-Napoleonic Europe some in Monaco thought of joining in but Sardinian troops arrived to crush the potential rebellion in its infancy.\n\nUnjust dislike\n\nHistory has tended to record Prince Honoré V as a very unpopular and autocratic monarch, but, in reality he was quite progressive. He sincerely wished to help his people and had great sympathy for the poor. His reaction to seeing beggars on the streets was to form state-owned industries and put them to work. Some of the industries he set up included a lace factory and a hat factory. He also had them put to work on farm cooperatives as citrus orchards had long been a large part of the Monegasque economy. All of this has led some people to regard Prince Honoré V as a sort of socialist, though he probably would not have seen it that way.\n\nBut all efforts to save the economy did not make Monegasques appreciate their Prince. Honoré V of Monaco died on October 2, 1841 in Paris and remained in the history of the country as an authoritarian ruler who did not trust anyone, including family members, and made decisions alone. As he was not married and had no children the Monegasque throne passed to his poet-actor brother Florestan."}, {"url": "http://www.worldheritage.org/articles/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://www.findagrave.com/memorial/7832651/honor%C3%A9_iv-of_monaco", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/honore-ii-monacos-first-ruler-formally-titled-sovereign-prince/", "page_content": "The history of Monaco has always been one of crafting an independent path while great power rivalries swirled around it. Between the reigns of Honoré I in 1523 and Honoré II just over one hundred years later it was the great rivalries between Spain and France through which Monaco had to ingeniously steer a course.\n\nThe reign of Honoré II (1604–1662) in many ways could be considered a miracle against the turbulence of the age. Not only did he protect Monaco’s independence, he secured additional formal recognition of it in the diplomatic arena with clarity on the title Prince (rather than Lord or Seigneur) and had the right to mint his own coinage since 1640.\n\nHonoré II lulled his Spanish host-occupiers into believing their strategy of limiting his powers was working. They were happy to see him immerse himself in a role devoted to cultural pursuits and entertainment of foreign guests. Meanwhile the Spanish kept a tight rein on governance, protected by their occupying garrison on the Rock. They also limited the role of the Monaco Ruling Council much to the resentment of the Monegasque population. In the meantime Honoré turned his custodianship in the cultural domain into a strategic victory for the Principality. Monaco became a magnet for poets, artists, sculptors and musicians. The Princely Palace joined Paris and Florence as a European centre of great culture and learning. Indeed, the quality of the art collection of Prince Honoré became a topic of conversation across Europe.\n\nAnd another transformation took place out of what had been originally more a feature of the military fortifications on the Rock. The apartments for the Prince, previously enlarged and renovated by Honoré I, became even more regal and palatial. And similarly with the Church of Saint Nicholas.\n\nWhile all the time lulling the Spanish occupiers into a false sense of security Honoré was quietly planning his crowning achievement — to rid Monaco of the oppressive Spanish to whom it had become partially victim.\n\nTreaty of Péronne\n\nWorking discreetly, Prince Honoré II negotiated with Cardinal Richelieu of France, who represented King Louis XIII. Out of that came the Treaty of Péronne (1641) which stipulated that Monaco become a French protectorate. However, most importantly the independent status of the Prince was guaranteed. Monaco was also granted lands in France to compensate for inevitable losses that the break from Spain would entail.\n\nFrench troops were envisaged as garrisoning Monaco with their officers being directly answerable to the Prince of Monaco rather than to the French State. And just as importantly Monegasque independence was to be maintained.\n\nExpulsion of the Spanish\n\nOn November 17, 1641 Honoré II put his plan to expel the Spanish garrison into effect. He quickly imprisoned those individuals known to be sympathetic to Spanish rule. Then that same evening he threw a sumptuous banquet for the Spanish troops and their commanders. The soldiers were given generous amounts of alcohol to subdue them and then, at a prearranged signal of a canon shot numerous Monegasques sprang on the Spanish. French troops came rushing out of hiding to finish them off and force them to surrender. Records report only 5 killed and 10 wounded before the Spanish garrison yielded. Monaco then officially expelled them and Honoré relinquished his Spanish honorary title of Order of the Golden Fleece. As expected the Spanish confiscated all of the Prince’s property in Spain and Monaco’s Spanish-linked possessions in Italy.\n\nDuke of Valentinois\n\nThe French compensated Honoré for the losses of land and titles. Louis XIII made Honoré II the Duke of Valentinois, Count of Carladès, Baron of Buis and Calvinet as well as granting him the lands and title of St-Rémy. The monarchs of France and Monaco became very close. Thus when Honoré was approached by English Royalists to harbour a fleet in Monaco with the intention of wrestling power from Cromwell, Honoré consulted with France’s Cardinal Mazarin who was looking to ally with Cromwell against Spain. On Mazarin’s advice he very diplomatically resisted.\n\nAn Enviable Legacy\n\nPrince Honoré II died on January 10, 1662 at the age of 64 deservedly very popular and with a legacy of numerous achievements. He had removed Monaco from being under the yolk of Spain. He created a new alliance with the increasingly powerful French while maintaining Monaco’s independence. It also fell to him to help his subjects survive through a plague. Thanks to advice from monks in Nice on cleanliness and sanitation the plague abated. His cultural achievements flowed from a natural passion and the prestige he gained from them led him to be referred to as the «Louis XIV of Monaco». And the Sun King Louis XIV would stand as godfather to Honoré II’s grandson who was also named Louis, cementing relations with France that last to this very day."}]}