{"Honoré IV founded the Monaco Observatory and the Oceanographic Museum of Monaco.": [{"url": "https://www.hellomonaco.com/sightseeing/grimaldi-family/prince-honore-iv-prisoner-of-the-french-revolution-2/", "page_content": "Prince Honoré IV was born on May 17, 1758 in Paris, to his parents Prince Honoré III and Princess Maria-Caterina de Brignole-Sale. This prince, perhaps, experienced more challenges in life than any other Grimaldi. Most of his hardships were caused by the French Revolution, and the last hours of his life are still shrouded in mystery …\n\nThe victims of the Great Terror\n\nPrince Honoré IV was unlucky enough to be living in Paris when the Reign of Terror broke out in France. As a nobleman and prince he was soon arrested and thrown into prison. The prince’s former wife, Duchess of Mazarin, was also taken into custody. Assisted by their family doctor, however, she managed to escape and hide with her youngest son Florestan.\n\nThe revolution did not spare the family of Prince’s Honore IV’s youngest brother, Joseph. His wife, Marie Thérèse de Choiseul, was arrested on suspicion of espionage and executed by guillotine. She was only 27, leaving behind three little daughters.\n\nAs for Prince Honoré, he was imprisoned for one and a half years. This time in prison greatly undermined his health, and he never fully recovered from it afterwards. On March 21, 1795 his father died and Honoré IV ascended the throne of Monaco. At that time the monarchy had just been banned and Monaco was once again annexed to the French Republic under the name of Port Hercule.\n\nEven after Prince Honoré was released from prison, it took another seven years of negotiations before the French regime restored some of Honoré IV’s and his brother Prince Joseph’s income. The future started to look brighter for the Grimaldi’s once the radical revolutionary regime was followed by the French consulate and, finally, by the First French Empire of Napoleon Bonaparte.\n\nReturn to the throne\n\nWhen the Napoleonic Wars finally came to an end, the status of Monaco was restored by the Congress of Vienna (1814–1815) thanks to the efforts of Prince Talleyrand. On May 30, 1814 Honoré IV was officially named the Principality’s ruler. However, he was too ill to take control of his country. So it was his brother Prince Joseph who became regent.\n\nThe Prince’s eldest son, 36-year-old Honoré Gabriel, however, was not happy about this decision. A brilliant soldier, he entered the cavalry service at the age of 20 and prospered in the army of the Empire Marshal, Emmanuel de Grouchy. Since Prince Joseph was not particularly eager to deal with the Principality’s affairs, preferring his life in the capital, he easily facilitated handing over the reins to his nephew, Honoré Gabriel, who ruled Monaco up until the death of Honoré IV (later becoming Prince Honoré V). As for Honoré IV, he lived in Paris until his very death which remains mysterious to this day…\n\nAccident or murder ..?\n\nOn a winter’s day of February 16, 1819, Honoré IV drowned in the Seine river. The death of the Monaco prince looked like a typical accident. That’s what the investigation concluded as an official version. It must not be forgotten, however, that Honoré IV was not a very healthy person, to say the least. This is the reason why he was not only unwilling, but was also physically unfit to rule the country. Imprisonment and numerous personal tragedies had taken their toll on the Prince, making him, for all intents and purposes, disabled. This is what the scanty preserved data suggests. A legitimate question arises: how could a 60-year-old monarch, in deplorable physical state, manage to cover such a considerable distance away from home (Avenue Denfert-Rochereau) to the Seine river bank..?\n\nWas it really an accident? Or rather a premeditated murder? Or could it be that the Prince decided to put an end to his own unhappy life? Being a depressed person, did he step into the Seine himself..? The answer remains a mystery.\n\nThe main legacy of Prince Honore IV\n\nAs Prince of Monaco, Honoré IV suffered three arrests and never actually ruled Monaco. He spent part of his life in a prison cell and the rest, trying to improve his health. Needless to say, there are very few mentions of the Prince, even in the archives of Monaco. His most important contribution to the history of Monaco was the birth of his two sons — the future princes, Honoré V and Florestan I, who consistently ruled the Principality and left their mark on the state’s history."}, {"url": "https://www.nationalgeographic.com/environment/article/how-tiny-monaco-became-a-giant-in-ocean-conservation", "page_content": "\n\n\n\nThe Principality of Monaco, a Mediterranean enclave surrounded by France, is the second smallest country in the world, after the Vatican. You could circumnavigate it on your morning walk; it is smaller than Central Park. “When I first came to this country,” says Maguy Maccario-Doyle, Monaco’s ambassador to the United States, “I thought, all of us Monegasques could fit in the New York City Hilton, because it had 3,000 rooms.” There are only about 9,000 citizens of Monaco, although the population, mostly affluent, is three times larger.\n\nA hundred years ago last month, on April 25, 1921, to be precise, the ruler of Monaco, Prince Albert I, came to Washington, D.C. to attend a meeting of the National Academy of Sciences and to receive a medal. It’s as good a point as any to begin a story about how his tiny country came to play an outsize role in marine conservation—a tale of inheritance passed across four generations from one Albert to another.\n\nPrince Albert I arrived first in New York on his royal yacht, the Hirondelle II, which was a fully equipped oceanographic research vessel: This prince was an explorer, with 28 scientific expeditions under his belt. Beginning in the 1880s he had roamed the Mediterranean and the Atlantic, ranging from the Cape Verde Islands off West Africa to Spitsbergen in the Arctic. He had charted the currents of the North Atlantic and pulled all manner of strange creatures from the abyss. For that, the Academy had awarded him the Agassiz Medal in 1918. The Spanish flu pandemic had delayed his coming to get it.\n\nPlease be respectful of copyright. Unauthorized use is prohibited. Please be respectful of copyright. Unauthorized use is prohibited. Left: Over more than three decades, Prince Albert I explored the seas on four progressively larger ships. Here he's seen on the last, the Hirondelle II, around 1913. Photograph by Library of Congress\n\nAlbert Einstein was at the meeting in 1921, explaining his theory of relativity. But there were also talks “On the problem of steering an automobile around a corner” and on “The skin temperature of pachyderms.” (“I’ve just developed a theory of eternity,” Einstein is said to have muttered dryly, as time slowed in the lecture hall.) Prince Albert Grimaldi’s contribution, “Studies of the Ocean,” fell somewhere in the middle on the spectrum of scientific importance.\n\nAnd yet one thing about that speech still resonates powerfully today: Albert’s prescient awareness, highly unusual for the time, that even the ocean had limits. Long before the rise of factory ships, before the decline of fish stocks and coral reefs worldwide, at a time when the human population was a quarter of what it is now and few people were talking about the environment, let alone the global environment, the prince warned of the destructive effects of trawling the seas with “more and more powerful” ships that “work farther and farther, deeper and deeper.” He advocated the enforcement of “the reserved district principle”—what we would call marine protected areas.\n\nA century later, the National Geographic Society promotes the establishment of such protected areas through its Pristine Seas program. The chairman of that program’s advisory board (though not a funder) is Prince Albert II, the great-great-grandson of Albert I. The current Prince Albert is not an oceanographer, but he has traveled more widely than Albert I and seen the damage to the ocean that his ancestor could only dimly foresee. As a head of state, even the second tiniest state, Prince Albert II has occasion to talk with others of that rank—and to open doors on behalf of the ocean.\n\n“He’s been a key partner in the creation of some of these marine reserves,” says Enric Sala, the marine ecologist and National Geographic Explorer in Residence who founded Pristine Seas. “He works so hard for this.”\n\nMany people do that, of course. But not many have such a backstory.\n\nA chance meeting in Paris with a gulper eel\n\nThe year Prince Albert I was born, 1848, was the year Monaco was reduced to its present size, losing its agricultural hinterlands, which ultimately became part of France. For Monaco and the Grimaldis, who had ruled the place since 1297, times were tough. Before Albert came of age, however, his father and canny grandmother had found a way out: They opened the Monte Carlo Casino. That move would later enable Albert’s ocean-combing life—but cast a shadow on it too.\n\nIn the early 1880s, after stints in the French and Spanish navies and a brief, catastrophic first marriage, Albert was living a life of undefined purpose in Paris, courting an American widow of whom his father disapproved. Then, in early 1884, he walked into an exhibit at the Museum of Natural History.\n\nTwo French ships had just completed a series of expeditions in the Atlantic, and the exhibit was full of the deep-sea creatures they had collected. Tables were packed with jars of preserved specimens: a gulper eel with gaping jaws like a pelican’s; an assortment of odd crabs, worms, and mollusks; the first deep-sea microbes, analyzed in the lab of Louis Pasteur. The walls were tiled with drawings of the creatures. Nets used to collect them hung from the ceilings. Men in top hats and women in floor-length dresses crowded around the tables.\n\nThe exhibit was a smash hit—and a turning point for Albert. Already fond of cruising on his yacht, he resolved now to do science with it, “despite,” as he later recalled, “a complete lack of encouragement from my immediate entourage.” Oceanography was not a typical occupation of princes. But Albert had the resources, thanks to the casino, and he was convinced he could do it better than anyone.\n\n“That sense of will, maybe because he’s a sovereign, comes across in his writings,” says Antony Adler, a Carleton College historian, whose book Neptune’s Laboratory includes an extensive account of Prince Albert. “He’s not a person who expresses uncertainty.”\n\nBy 1889 he had enough specimens to mount his own first exhibit. At the Paris Universal Exposition, where the Eiffel Tower made its debut, Albert filled half the Monaco pavilion at the foot of the tower with ocean specimens and paraphernalia. 1889 was a big year for him: In September his father died, and Albert succeeded him as the ruler of Monaco. A few weeks later he married the American widow, who became Princess Alice.\n\nSoon she had a new yacht named after her, aboard which Albert would spend much of his time away from her at sea. So it went for the next quarter century, until World War I. His ships got progressively larger and better equipped.\n\n“That the head of state would spend so much time on exploration—these expeditions were epic,” says Sala, who has led quite a few himself. “He was so ahead of his time.”\n\nPlease be respectful of copyright. Unauthorized use is prohibited.\n\nThe oceanographer as rock star\n\nAlbert was a pioneering popularizer too. If you can believe a 1913 article in the San Francisco Chronicle, which Adler pointed out to me, Prince Albert’s public lectures in Paris were free but sold out and so popular that people scalped tickets for high prices. “At Peril of Life, Monaco Potentate Wrests Treasures from Great Depths,” read a headline on that article.\n\nJournalists weren’t always so kind. Prince Albert’s wealth came from Monte Carlo at a time when gambling was widely considered immoral or even illegal. All his life he endured withering commentary about that from journalists on both sides of the Atlantic.\n\n“There was a whole collection of satirical cartoons that appeared in France and other European countries and the U.S.,” says his descendant, Prince Albert II. “That upset him a lot.”\n\nBut it may have strengthened his motivation to do good with his money.\n\nIn Paris Albert I established institutes of peace and of paleontology, as well as oceanography. “For him all of these things were connected,” Adler says, by the idea that science could be the engine of human progress and international understanding.\n\nAlbert’s greatest institutional creation, no doubt, was the Oceanographic Museum that he planted right in the Rock of Monaco, flush with the cliff that plunges to the Mediterranean. It was a kind of monumental counterweight to the casino at Monte Carlo, on the other side of the harbor, and he stuffed it with his own specimens and equipment—such as the trihedral trap he had used to snare a new kind of deep-sea fish, Grimaldichthys profondissimus, from a depth of almost 20,000 feet off the Cape Verde Islands.\n\nSala, who grew up north of Barcelona, Spain, near the Costa Brava, remembers vividly his first visit to that “temple of the sea.”\n\n“When I turned 19 and got my driving license and got my first used car, one of the first trips I made was to drive from my house to Monaco,” he says. “I left at night and got there in the morning when they opened the museum.” Sleep-deprived but elated, Sala wandered through a magical world—“like an architectural version of 20,000 Leagues Under the Sea, like if Jules Verne had been an architect.”\n\nWhen that museum opened for the very first time, in 1910, Albert’s only son, Louis, was not there for the ceremony. The two were estranged. The boy’s mother, Albert’s first wife, had fled the palace in Monaco only a few months into their marriage, while she was still pregnant; Albert had not met Louis until the boy was 10. During his long absences at sea, his second wife, Alice, had taken up with a composer. One evening in 1902, seeing the two lovers exchange whispers at the opera house in Monaco, Albert became enraged and slapped her publicly. She fled too.\n\n“The voices of the stormy sea and the tempest winds are less cruel than a single mean word from the mouth of those one has loved,” Albert wrote in his memoir, The Career of a Navigator.\n\nFor a time it seemed his failure as a family man would cripple his legacy as an explorer. Louis took not the slightest interest in the sea. After the great man’s death in 1922, the Hirondelle II was sold off. It finished its own career as a coal ship on the Panama Canal.\n\nGenerations passed.\n\nIn 1957, Jacques Cousteau took over as director of the Oceanographic Museum; he had just made The Silent World, a film that introduced a new generation to the wonders of the deep.\n\nA photo taken at the museum in 1960 shows a beaming Cousteau looking on as Prince Rainier III and his wife, the famous actress Grace Kelly, examine a life-size photo of Prince Albert I, leaning against the rail of one of his boats. Rainier is holding up his two-year-old son and heir, Albert, so that the little boy is face to face with his ancestor. Young Albert looks alarmed but also absolutely riveted.\n\nPlease be respectful of copyright. Unauthorized use is prohibited. Please be respectful of copyright. Unauthorized use is prohibited. Left: The Oceanographic Museum of Monaco, seen here not long after it opened in 1910. Photograph by De Agostini, Getty Images\n\nPicking up the torch\n\nOne passage in Prince Albert’s 1921 speech brought me up short when I first read it:\n\n\"Finding himself in the presence of wealth, one might say, man loses completely the idea of providence. He seems then to suffer from a vertigo which drags him to the radical destruction of things, for there is no gift of nature that can survive the ill-considered enterprises of human industry.\"\n\nWhen I spoke to Prince Albert II not long ago, I asked him about that passage. He was sitting in his office on the third floor of the east tower of the palace in Monaco, the office that had been his mother’s. It has windows on three sides, looking out over the harbor, the palace square, and the mountains. The Prince was in a reflective mood.\n\nWorld War I had left his ancestor distraught, Prince Albert said, and the speech to the National Academy still carried the tinge of that disappointment. “He saw that humanity could easily destroy itself,” Albert II said. “The idea that it could destroy the planet came much later, but I think it was in the back of his mind.”\n\nYet Albert I retained to the end his optimistic belief in the power of science to guide us, said Albert II. And to the end, “he did not appreciate idle people.”\n\nThe current Prince’s own turning point came in 1992, when he accompanied his father, Prince Rainier, to the Earth Summit in Rio de Janeiro. There he realized that “aside from great speeches, very little is being done” to address global environmental problems. He resolved that Monaco would do more when his time came. The foundation he established 15 years ago has given more than a hundred million dollars to various causes, including marine conservation. The Monaco Blue Initiative promotes high-level global dialogue on the subject. The casino these days accounts for less than 4 percent of his country’s revenues, the Prince added.\n\n“I hope people come to the realization that the time to act is now,” he said. “And I hope that my great-great-grandfather’s words still find an echo and can inspire them, the way he inspired me.”"}, {"url": "https://cvb.visitmonaco.com/en/place/monuments-musees-museums/76/oceanographic-museum-of-monaco", "page_content": "Built on the side of Monaco’s legendary Rocher, the Oceanographic Museum founded by H.S.H. Prince Albert II of Monaco’s great-great-grandfather Prince Albert I has been watching over the oceans for more than a century. The Museum is renowned throughout the world for its expertise and has more than 6,000 specimens on display.\n\nFrom the flourishes on the façades to the décor in the halls, every aspect of the Museum’s architecture evokes the marine world. Since it was opened on 29 March 1910, this Temple of the Sea, 6,500 square metres of which are open to the public, has been an international benchmark for loving, protecting and raising awareness of the oceans.\n\nTHE AQUARIUMS\n\nA journey through the tropics: the tropical zone reveals the hectic life of a coral reef and the species which inhabit it, featuring enchanting shapes and colours. Come face to face with sharks and piranhas, observe the clownfish and the awe-inspiring stonefish with its lethal spines, and admire the captivating boxfish or bizarre sea horses.\n\nDive into the Mediterranean Sea: discover more than 200 species of invertebrate in the pools representing the Mediterranean, a sea which is home to hidden treasures. Come and meet our clever octopus, tremble before our sinister moray eels, or admire the soothing ballet of the jellyfish.\n\nTHE MUSEUM\n\nWhale Room and Prince Albert I Room: a voyage of oceanographic discovery, with many mounted specimens, photographs and archive documents, models, marine mammal skeletons, etc.\n\nOceanomania: the largest ever cabinet of marine world curiosities, created by artist Mark Dion. More than 1,000 objects from the Oceanographic Museum’s collections are displayed in a 180-square-metre space: fossils, chimaeras, diving gear, valuable books etc.\n\nEVENTS\n\nWednesdays: Touch tank, feeding the animals in the touch tank, and light and sound show in the Whale Room.\n\nWeekends: touch tank, ImmerSEAve 360°, and light and sound show in the Whale Room.\n\nHead over to www.oceano.mc/activities to check out the school holiday event schedule!\n\nA little history\n\nA sailor and pioneer in the field of oceanography, attracted to travel and science from a very young age, Prince Albert I led 28 scientific campaigns, dedicating a large part of his life to studying the oceans. To promote the growth and development of oceanography, a science which was still in its infancy in the early twentieth century, he decided to set up a special foundation, the Institute of Oceanography. Established in 1906, this renowned foundation operating in the public interest has two aspects: the Oceanographic Museum of Monaco and the Maison des Océans in Paris. On board ever more advanced vessels (Hirondelle, Princesse Alice, Princesse Alice II and Hirondelle II), this visionary Prince travelled the Mediterranean, visited the Azores, then embarked on an Arctic adventure to Spitsbergen.\n\nArt and science\n\nTrue to its founder’s determination to “bring crashing together the two driving forces of civilisation: art and science”, the Oceanographic Museum also opens its doors to contemporary art and hosts major exhibitions such as those created with the artists Damien Hirst, Huang Yong Ping, Mark Dion, Marc Quinn and most recently Philippe Pasqua.\n\nPractical information:\n\nOpening hours:\n\nOpen every day (except 25 December and the Formula 1 Grand Prix weekend):\n\n- January, February, March: 10 am to 6 pm\n\n- April, May, June: 10 am to 7 pm\n\n- July, August: 9.30 am to 8 pm\n\n- September: 10 am to 7 pm\n\n- October, December: 10 am to 6 pm\n\nAdmission:\n\nAdults (19 and over): €11 (low season), €14 (standard season), €16 (peak season)\n\nYoung people (aged 13–18 inclusive) / Students (with valid card) : €7 (low season), €10 (standard season), €12 (peak season)\n\nChildren (aged 4–12 inclusive): €5 (low season), €7 (standard season), €8 (peak season)\n\nPeople with disabilities: €7\n\nLow season: 7 January to 9 February, 12–30 March, 5 November to 21 December.\n\nStandard season: 1–6 January, 10 February to 11 March, 31 March to 30 June, 1 September to 4 November, 22–31 December.\n\nHigh season: 1 July to 31 August\n\nRestaurant:\n\nThere is a restaurant on the roof terrace of the Oceanographic Museum. Enjoy a break and something to eat 85 metres above the Mediterranean Sea."}, {"url": "https://www.oceano.org/en/organization/the-great-figures/prince-albert-i/", "page_content": "As early as 1885, Prince Albert I of Monaco planned to create a marine biology laboratory in the Principality. At the Universal Exhibition in Paris in 1889, his scientific collections, presented in the Monaco Pavilion, aroused immense interest.\n\nThe Prince then developed his final project, that of an oceanographic museum. The foundation stone was laid on 25 April 1899. The inauguration, celebrated with exceptional pomp, took place on March 29, 1910.\n\nInvited to speak at the United States Academy of Sciences in Washington on April 25, 1921, he delivered his speech on the Ocean, which has remained famous for the relevance of its visionary analysis…"}, {"url": "https://www.centrescientifique.mc/en/article/monaco-scientific-center/prince-albert-1st-a-pioneer-of-marine-sciences", "page_content": "Prince Albert 1st, a pioneer of Marine Sciences\n\nThe first years\n\nAlbert Honoré Charles Grimaldi was born in Paris on November 13, 1848. He began to travel at an early age with his parents, Prince Charles III and Princess Antoinette-Ghislaine, or with his tutor. In addition to traveling between Paris and Monaco, he has visited various regions of France and neighboring countries: Belgium, Germany, Switzerland, Spain, Italy. The family castle of Marchais, in the department of Aisne, is surrounded by vast wooded areas or dotted with ponds: the young Prince travels them relentlessly and thus, acquires the habit of physical exercise, walking and horseback riding. Through fishing and hunting, he developed his gifts as a born observer of Nature; he learned to distinguish between plant and animal species and to recognize the relationship between the living world and the environment.\n\nPrince Albert also shows, from adolescence, a passionate attraction for the sea, perhaps aroused by his outings with Monegasque sailors and fishermen or by reading about his travels and polar expeditions.\n\nAfter his secondary school studies, at Collège Stanislas in Paris and then at La Chapelle Saint-Mesmin, near Orléans, he obtained his father's agreement to become a naval officer. His initial training was entrusted to an officer of the French Imperial Navy, Lieutenant Florent Anthouard, in 1865-1866 in Lorient. The following spring, Queen Isabelle II welcomed him as an ensign in the Spanish Navy where he will spend two years. After a few months on the Iberian coasts of the Atlantic, he sailed and stayed in Cuba and Puerto Rico. Before returning to Europe, he undertook a long journey to the United States. Back in Monaco, he bought a small cutter, the Isabella II, with which he sailed not only around the Principality but from the coast of Tuscany to the Catalan coast.\n\nOn 21 September 1869, Prince Albert married Lady Mary Victoria Douglas-Hamilton. From this union was born his only son and successor, Prince Louis II.\n\nThe Prince and oceanography\n\nWhen the Franco-Prussian war broke out, the Prince put himself at the disposal of the French Navy. Thus, Napoleon III conferred him the rank of lieutenant. At the fall of the Empire, he returned to Monaco so he resumed his land voyages and his navigations on board the Isabelle II, replaced in the autumn of 1873 by a schooner, built eleven years earlier in Gosport by the Camper & Nicholson shipyards. He renamed Hirondelle this magnificent sailing ship of 32 meters in length and a displacement of 200 tons. She sailed the western Mediterranean (1876 and 1877), the Atlantic to the Canary Islands, Madeira and the Azores (1879) and the waters of the British Isles and Iceland (1882). These travels permitted him to perfect his experience as a naval officer, as he felt that his situation as Hereditary Prince did not exempt him from acquiring a trade.\n\nIn the interval of the cruises, Prince Albert traverses the majority of the European countries. His notes testify to his attention and his discernment: they are not limited to the picturesque landscapes and the interest of the monuments. They abound in remarks on economic, ethnographic and geopolitical data. The Prince's linguistic knowledge continues to grow. His literary publications, in particular his autobiographical work, “La carrière d'un navigateur”, attest to his perfect mastery of the French language.\n\nThe scientific beginnings\n\nThe Prince also uses his travels to visit museums, to meet academics and members of learned societies. When he resides in Paris, he frequents scientific circles: Sorbonne, Faculty of Medicine, Museum of Natural History, where he has been introduced by his childhood friend, Dr Paul Regnard. Charles Darwin's publications, Claude Bernard's work, and Louis Pasteur's discoveries not only maintain passionate discussions among specialists, but also raise hopes for attentive and enlightened minds. Scientific and technical progress cannot fail to bring more justice and well-being to humanity. They should also give, if not \"the\" answer, at least answers to the primordial question of the origin of Life. All these debates, all these researches have a deep resonance in Prince Albert's mind.\n\nDuring four summers, an \"underwater dredging commission\" undertook work on board French Navy vessels: the Travailleur, in 1880, 1881 and 1882, then the Talisman, in 1883, as far as the Sargasso Sea. Shortly after the last campaign, an exhibition organized at the Museum to present the results was a huge success. The interest that Prince Albert takes in this exhibition, the encouragements that Professor Alphonse Milne-Edwards, head of these missions, gives him, lead to his decision. He will devote himself to oceanography, driven by his experience as a sailor and his attraction for science.\n\nOceanographic campaigns\n\nFrom summer 1884, he decided to harvest on the surface during the journey from Lorient to the Baltic Sea. The shipwreck of the Hirondelle that occurred between Denmark and Sweden caused the loss of some of the samples. Therefore, the campaign was only as a “prelude” to the oceanographic campaigns that will be lead, the following year.\n\nThe operations carried out on board the Hirondelle aimed at studying the movement of surface water masses in the North Atlantic by the launching of nearly 1,700 floats between 1885 and 1887. In addition, diversified and perfected devices allowed the harvesting of animals from the surface to depths close to 3000 meters, particularly in the Azores region.\n\nL'Hirondelle's scientific activities ended in 1888. Its dimensions became insufficient for a growing number of machines. The absence of an auxiliary engine limited the number and depth of operations desired, regardless of the dedication and robustness of the fifteen or so sailors on board. In addition, Prince Albert wanted to participate actively in the Universal Exhibition of 1889, as well as in several of the many congresses organized in Paris, on this occasion. Half of the Monaco Pavilion was reserved for the presentation of the animals collected, the material used, the photographs, models and maps. Thanks to that, the Monaco Pavilion was the high point of the exhibition, both for scientists and the general public.\n\nOn September 10, 1889, Prince Charles III passed over so, his only son became Prince Albert I. From then on, he had to reconcile his responsibilities as Sovereign Prince with his scientific work, to which he remained as attached as ever. He ordered from the Green shipyards of Blackwall near London, a three-masted ship specially designed for oceanographic operations. With a length of 53 meters and a displacement of 650 tons, she is equipped with an auxiliary engine with a power of 350 horsepower. In accordance with his customary approach, the Prince insisted that the most recent advances in technology be applied to it: electric lighting, seawater distiller, cold rooms, steam-powered sounding machine. The three laboratories were equipped with roll tables, lighting tables and have a distribution of distilled water and seawater. The ship named “Princess Alice”, in honour of Prince Albert’s second wife, was launched on February 12, 1891. Seven campaigns were carried out with this yacht from 1891 to 1897, in the Mediterranean but especially in the temperate Atlantic near the Azores.\n\nTo carry out increasingly diversified research at ever-greater depths, Prince Albert ordered a new yacht from the Laird shipyards in Birkenhead near Liverpool. With a length of 73 meters and a displacement of 1400 tons, her 1000 horsepower engine allows her to reach a speed of 13 knots. Launched on November 27, 1897, she received the same name as the previous yacht: Princess Alice. Construction, layout and equipment are successful in all respects and allow twelve extremely successful campaigns, between 1898 and 1910. Four of them take place as far as Spitsbergen. During the summer of 1901, the most southern operations carried out by the Prince took place, halfway between the Cape Verde Islands and Ecuador. The deepest station is carried out at a depth of 6035 meters and allows the capture of a Fish and several Invertebrates. Among the scientists on board were two French physiologists, Charles Richet and Paul Portier. This allowed them to began the experiments that would lead them to the discovery of the phenomenon of anaphylaxis, the key to allergic reactions.\n\nThe distant and sometimes difficult navigations of the second Princess Alice forced the Prince, to order a new yacht from the Forges et chantiers de la Méditerranée, in La Seyne near Toulon. Even bigger (82 meters in length and 1600 tons of displacement), even more powerful (two 2200 horsepower engines), the ship is equipped with two propellers and wireless telegraphy. Launched on February 6, 1911, she receives the name of the small schooner of the beginnings: Hirondelle. The First World War put an end to its scientific activities, after only five campaigns.\n\nCampaign results\n\nIn total, twenty-eight oceanographic campaigns that Prince Albert I organized and directed, between 1885 and 1915. Undertaken during the summer period, their duration varied from seven to fourteen weeks, depending on the year. In addition, from 1894 onwards, the Prince took advantage of his stay in Monaco during the winter and spring to carry out a number of operations between the continent and Corsica. It is then, that new machines are experimented and new methods are developed.\n\nDuring the campaigns, the Prince assumes command of the yacht. For navigation, on board the Hirondelle he was assisted by a boatswain, Jean-Auguste Le Gréné. On the other three ships, he was assisted by a second in command: a British, Captain Henry Charlwood Carr, then a Frenchman, Commander Georges d'Arodes de Peyriague. From 1902, a young French officer, Ensign Charles Sauerwein, replaced in 1906 by Lieutenant Henry Bourée, completed the maritime staff.\n\nFor scientific questions, the Prince decides himself on the place and program of research. Marine meteorology was the subject of many operations from 1904 to 1907, under the responsibility of Hugo Hergesell. Sometimes, the choice of the Prince is guided by a current problem. For instance, in 1903 when, in an attempt to remedy the sardine crisis affecting the French Atlantic coast, the Prince and his collaborators carried out a detailed study of the biological and physico-chemical factors of the Bay of Biscay.\n\nHowever, the work on board is mainly of two types of operations. First of all, the animals are harvested, to depths sometimes exceeding 6,000 meters, with particular attention paid to the existence and abundance of fauna living in open water, in the intermediate levels between the surface and the bottom. This bathypelagic fauna is indeed the subject of lively discussion at the time. Biological sampling is complemented by the study of the characteristics of the environment where these organisms live: temperature, salinity, circulation of water masses.\n\nBaron Jules de Guerne, then Dr. Jules Richard, took part in all the campaigns starting from 1887. Some scientists were invited to take part in the work (Charles Richet and Paul Portier, the biochemist Gabriel Bertrand, the oceanographer Julien Thoulet, the zoologists Louis Joubin and Louis-Eugène Bouvier, the algologist Louis Gain, the German planktonologist Karl Brandt, two Scots, the physicist John Young Buchanan and the polar explorer William Speirs Bruce, the German meteorologist Hugo Hergesell). From 1888, an artist was on board, whose main task was to note the color of organisms as soon as they came out of the water, before the original shades faded.\n\nA total of 3698 stations will be operated under the direction and permanent control of Prince Albert. A station includes a series of more or less numerous and complex operations. After having established with precision the geographical position of the vessel, the depth is determined thanks to a sounder that goes up with a sample of the substrate that can be analysed then. Water intakes for analysis and temperature measurements are generally made at the surface and at various depths. A device is then immersed which, depending on the research planned, is a planktonic net, dredge, trawl, trap, longline, trammel or tiller.\n\nThe animals collected are subject to a first sorting as soon as they are harvested. Once the campaign is over, they are classified according to zoological groups and then entrusted to the best specialists, both French and foreign, for a final examination. Indeed, unlike his friend King D. Carlos of Portugal, another \"sovereign oceanographer\", Prince Albert believes he has neither the time nor the competence required to identify animals, among which are often new species or even new genera. However, he shows a sustained interest in this work, which is the subject of preliminary notes in specialized journals. For summary monographs, he created a series under the explicit title of Results of scientific campaigns, carried out on his yacht by Albert I, Sovereign Prince of Monaco. The first of the one hundred and ten fascicles appeared in 1889. The text is composed and printed in Monaco, on laid paper with the Prince's coat of arms and monogram. For the plates, the drawings of the scholars are associated with the colour notes of the artists on board; the printing is entrusted to the best lithographers of the time. The care taken at all stages of the publication under the constant supervision of the Prince allows to bring together scientific rigor and aesthetic quality in this series and to establish its lasting reputation.\n\nScientific inventions\n\nPrince Albert contributed to the progress of oceanography in very specific fields: the reliability and abundance of samples and data depend on the quality of the instruments used. From the beginning of its campaigns, it has attached the greatest importance to this question. Fascinated by inventions such as the cinematograph, color photography and aeronautics, he is keen to apply new processes and new materials to oceanographic instrumentation, without neglecting proven techniques that have been used for a long time. He invented or perfected numerous devices: floats launched by the Swallow, surface trawl, rudder net, curtain net, keyed depth sounder, sounding machine, trihedral and hexagonal pots. Its employees are just as inventive. Jules Richard creates a water sampling bottle, a small net for harvesting plankton while the ship is underway, a wide-opening net for vertical fishing of bathypelagic fauna. The \"dredge sounder\" is designed by engineer Maurice Léger.\n\nOcean mapping\n\nMapping is the second area that has benefited from Prince Albert's initiatives. For the Universal Exhibition in Paris in 1889, he had a huge map made where the routes followed during the four campaigns of the Hirondelle are traced as well as the displacement of the water masses of the Atlantic as established from the course of the recovered floats. Three years later, this diagram of ocean circulation was the subject of a detailed map, presented at the Academy of Sciences in Paris and at the annual congress of the British Association for the Advancement of Science in Edinburgh.\n\nThe four campaigns in Spitsbergen gave rise to the publication of a whole series of maps: Hydrography of Red Bay following the surveys of Lieutenant (Navy) Guissez; Topography of the northwestern part of the main island as well as Prince Charles Foreland, explored by the Norwegian mission of Gunnar Isachsen and the Scottish mission of William Bruce.\n\nThe major contribution of the Prince is, without a doubt, the General Bathymetric Chart of the Oceans. Following a decision taken at the International Congress of Geography, in Berlin in 1899, a meeting of experts was held in Wiesbaden four years later. Professor Julien Thoulet's proposals for the main features of this map: scale, projection, bathymetry, were discussed and adopted. The twenty-four sheets came off the presses in the spring of 1905, with all the drawing and printing costs borne by Prince Albert, who continued to sponsor and finance the second edition, published from 1912 onwards.\n\nRaising Public Awareness: The Oceanographic Museum\n\nPrince's oceanographic companies have been of particular importance in a third area: contributing to a better knowledge, therefore a better understanding, of the role played by the marine environment in a large number of human activities. Presenting the results of its campaigns and the means used to obtain them, was one of the solutions adopted by Prince to this end. Even before the Universal Exhibition in Paris in 1889, he had taken part in the Antwerp Exhibition in 1885. Subsequently, he took part in the Universal or thematic (maritime, fishing) Expositions in Brussels (1897 and 1910), Paris (1900), St. Petersburg (1902), St. Louis (1904), Marseille and Milan (1906), Bordeaux (1907), Bergen (1910) and Vercelli (1913).\n\nIt is to both conserve and present his collections of specimens and instruments and to raise awareness among the wide public that the Prince decided to create the Oceanographic Museum in Monaco. The construction of the building began as soon as the works were awarded in 1898. The ceremonies of laying the \"foundation stone\" the following year and the inauguration in 1910.\n\nThe results of the campaigns were presented to the scientific community through presentations to learned societies, in particular the Paris Academy of Sciences, as well as to national and international congresses, but the Prince also wishes to inform wider audiences. During his first campaign, he gave a lecture for the Geographical Society of Paris. This type of society was then in its golden age and it was most often to their members that the Prince spoke: in London (1898), Laon (1899), Marseille (1904), Edinburgh, Glasgow and Munich (1907), Rome and Brussels (1910), Madrid and Vienna (1912), New York (1913) and Washington (1913 and 1921). While the sovereigns and heads of state honoured these conferences with their presence, the Prince was also keen to show his interest in the \"People's Universities\". On three occasions, he came to speak to members of the Cooperation of Ideas, at the Faubourg Saint-Antoine in Paris. When he decided to create an Oceanographic Institute, intended to extend and structure the courses and conferences he organized in Paris from 1903 onwards, he stipulated that the new establishment, inaugurated in 1911, should provide education at two levels: university and \"popular\".\n\nStill hoping to increase the scope of oceanographic studies and to encourage international cooperation, Prince Albert accepted the presidency of two commissions created at the Geography Congress of Geneva (1908). The Atlantic Commission did not survive the First World War. The Mediterranean Commission was definitively organized in Madrid in 1919 and did not cease to pursue its activities, with the help of Monaco and its Princes.\n\nThe results obtained prove clearly that Prince Albert did not care to be a patron or a yachtsman practicing as an amateur a \"leisure oceanography\". His contemporaries are perfectly aware of this: Academies and learned societies have called him to sit among their members and have awarded him their most prestigious distinctions, both in Europe and America. In Washington, in the spring of 1921, he took stock of his scientific work in his Discourse on the Ocean, before receiving the Agassiz Medal, awarded by the National Academy of Sciences.\n\nAnthropology\n\nOceanography is not the only scientific field in which Prince Albert was interested. Like his grandfather, Prince Florestan, he carried out some excavations in the caves of Baoussé-Roussé, a short distance from the French-Italian border, near the hamlet of Grimaldi. The work continued by specialists, whose discoveries justify the creation of a Museum of Prehistoric Anthropology in Monaco. The study of caves in northwestern Spain, particularly in Altamira, also benefits from the patronage of the Prince. The questions raised by the origin of life, the evolution of organized beings, natural selection, the struggle for existence, fascinate the Prince. To promote research related to these questions, he founded the Institute of Human Paleontology in Paris.\n\nThe Sovereign\n\nPrince Albert's scientific activities do not divert him from his responsibilities as Sovereign. Administering such a cramped territory may seem an easy task, but great vigilance is required to ensure that a population where nationals are fifteen times less numerous than foreigners, of very diverse origins and cultures, lives in harmony. Monaco's development must continue and be modernized. Therefore, a first Constitution is promulgated, in 1911: codes and laws are revised. New schools, a high school and a public library are created. An hospital, equipped with the latest improvements, replaces the old Hôtel-Dieu. A waste incineration plant and a sewerage system are put into operation. The drinking water supply is improved; electric lighting and a telephone network are installed. To diversify the economy, a few industries are set up and the port benefits from considerable work. A palace of fine arts is built and it hosts an annual exhibition of paintings, sculptures and engravings, as well as theatrical performances and conferences. Under the impetus of Raoul Gunsbourg, the Opera acquired a worldwide reputation.\n\nPrince Albert's concern for justice is reflected in the social field by the support he gives to the mutual insurance company, which he considers to be the guarantor of social security and promotion for workers. Equal respect for human dignity leads him to intervene energetically in favour of Captain Alfred Dreyfus.\n\nA man of peace\n\nAs a tireless apostle of peace between individuals and nations, he advocates the settlement of conflicts through arbitration. After hosting the 11th Universal Peace Congress, he created in Monaco an International Institute for Peace, a prefiguration of the League of Nations. Eight members of which have received or will receive the Nobel Peace Prize. He tirelessly strives to achieve, if not reconciliation, at least a rapprochement between France and Germany. The unfolding of the First World War inspired him to write his book “The German War and the Universal Conscience”. Although he had placed so much hope in scientific progress to establish social justice and international understanding, the conflict was a trial he did not survive for long. He died in Paris on June 26, 1922.\n\nJacqueline Carpine-Lancre - January 2004"}, {"url": "https://en.gouv.mc/Government-Institutions/History-and-Heritage", "page_content": "Altkirch (barony of) The Barony of Altkirch is a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honoré IV) to Lo... Know more Altkirch (barony of)\n\nAumont (duchy of) Like many other fiefdoms held by the Grimaldi family of Monaco, the Dukedom of Aumont was established through the marriage of Honoré Charles Anne M... Know more Aumont (duchy of)\n\nBaux (Marquisate of ) According to the terms of the 1641 Treaty of Péronne, the marquisate of Baux (Bouches-du-Rhône) was given by Louis XIII to Prince Honoré II, for th... Know more Baux (Marquisate of )\n\nBelfort (earldom of) The earldom of Belfort is a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honoré IV) to Lo... Know more Belfort (earldom of)\n\nCampagna (marquisate of) The Marquisate of Campagna was granted to Honoré I by Charles Quint in 1532, then seized from Honoré II in 1641. Know more Campagna (marquisate of)\n\nCanosa (lordship of) The lordship of Canosa was granted to Honoré I by Charles Quint in 1532, then seized from Honoré II in 1641. Know more Canosa (lordship of)\n\nChâteau-Porcien (Principality of) ThePrincipality of Château-Porcienis a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honor... Know more Château-Porcien (Principality of)\n\nChilly (marquisate of) The Marquisate of Chilly is a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honoré IV) to... Know more Chilly (marquisate of)\n\nCompiano Campiano is the fiefdom of the Landi de Valditaro family, allied with the Grimaldi family in 1595 through the marriage of Marie Landi to Hercule I. Know more Compiano\n\nDolceaqua Dolceacqua is the fiefdom of the Doria family, allied with the Grimaldi family in 1491 by the marriage of Françoise Grimaldi, sister of Jean II, Lu... Know more Dolceaqua\n\nFerrette (earldom of) The earldom of Ferrette is a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honoré IV) to L... Know more Ferrette (earldom of)\n\nGaragnone (lordship of) The Marquisate of Campagna was granted to Honoré I by Charles Quint in 1532, then seized from Honoré II in 1641. Know more Garagnone (lordship of)\n\nGuiscard (marquisate of) The Marquisate of Guiscard is a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honoré IV) t... Know more Guiscard (marquisate of)\n\nHambye (barony of) The Barony of Hambye came into the possession of the House of Grimaldi through the succession of Jacques I, son of Jacques III of Matignon and husb... Know more Hambye (barony of)\n\nHann and Rosemont (earldom of) The earldom of Hann and Rosemont is a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honoré... Know more Hann and Rosemont (earldom of)\n\nIssenheim (lordship of) The lordship of Issenheim is a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honoré IV) to... Know more Issenheim (lordship of)\n\nLa Luthumière (barony of) The Barony of La Luthumière came into the possession of the House of Grimaldi through the succession of Jacques I, son of Jacques III of Matignon a... Know more La Luthumière (barony of)\n\nLa Milleraye (duchy of) Like many other fiefdoms held by the Grimaldi family of Monaco, the Duchy of La Milleraye was established through the marriage of Honoré Charles An... Know more La Milleraye (duchy of)\n\nLongjumeau (earldom of) The earldom of Longjumeau is a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honoré IV) to... Know more Longjumeau (earldom of)\n\nMassy (barony of) The barony of Massy is a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honoré IV) to Louis... Know more Massy (barony of)\n\nMatignon (lordship of) The lordship of Matignon came into the possession of the House of Grimaldi through the succession of Jacques I, son of Jacques III of Matignon and... Know more Matignon (lordship of)\n\nMayenne (earldom of) The earldom of Mayenne is a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honoré IV) to Lo... Know more Mayenne (earldom of)\n\nMonaco - Monte-Carlo Prince Charles III took the initiative of converting Monaco into a seaside resort. He also thought that gambling could attract, as in Germany, a we... Know more Monaco - Monte-Carlo\n\nMonaco - Observatory Cave Located at the heart of the Exotic Garden, the Observatory Cave plunges vertically down for around one hundred metres until it reaches sea level. T... Know more Monaco - Observatory Cave\n\nMonaco - Prince's Palace Begun in 1215, work to build the ramparts of the Monegasque Rocher produced a fortress made out of four imposing towers connected to one another by... Know more Monaco - Prince's Palace\n\nMonterverde (lordship of) The lordship of Monteverde was granted to Honoré I by Charles Quint in 1532, then seized from Honoré II in 1641. Know more Monterverde (lordship of)\n\nParthenay (barony of) Like many other fiefdoms held by the Grimaldi family of Monaco, the barony Parthenay was established through the marriage of Honoré Charles Anne Ma... Know more Parthenay (barony of)\n\nRethel-Mazarin (duchy of) The dukedom of Rethel-Mazarin is a fiefdom that was established as a result of the marriage of the Duke of Valentinois (the future Prince Honoré IV... Know more Rethel-Mazarin (duchy of)\n\nRipacandida (lordship of) The lordship of Ripacandida was granted to Honoré I by Charles Quint in 1532, then seized from Honoré II in 1641. Know more Ripacandida (lordship of)\n\nSaint-Lô (barony of) The Barony of Saint-Lôcame into the possession of the House of Grimaldi through the succession of Jacques I, son of Jacques III of Matignon and hus... Know more Saint-Lô (barony of)\n\nSaint-Rémy de Provence Saint-Rémy-de-Provence is a French municipality in the department of Bouches-du-Rhône. Attributed to the sovereign prince of Monaco under the Treat... Know more Saint-Rémy de Provence\n\nSan Demetrio (barony of) The Barony of San Demetrio was held by Rainier I from the beginning of the 14th century. Know more San Demetrio (barony of)\n\nSecondigny (ealrdom of) Like many other fiefdoms held by the Grimaldi family of Monaco, the earldom of Secondignywas established through the marriage of Honoré Charles Ann... Know more Secondigny (ealrdom of)\n\nTerlizzi (lordship of) The Marquisate of Campagna was granted to Honoré I by Charles Quint in 1532, then seized from Honoré II in 1641. Know more Terlizzi (lordship of)\n\nTorigni (earldom of) The earldom of Torigni came into the possession of the House of Grimaldi through the succession of Jacques I, son of Jacques III of Matignon and hu... Know more Torigni (earldom of)\n\nTurbie (La) - Church It was during the period of Roman antiquity that the first traces of the close links which unite La Turbie and Monaco began to appear.From this per... Know more Turbie (La) - Church\n\nValentinois (duchy of) - Grane The Duchy of Valentinois was formed through the temporal powers of the Bishops of Valence, who for centuries passed down the title from uncle to ne... Know more Valentinois (duchy of) - Grane\n\nValentinois (duchy of) - Sauzet The Duchy of Valentinois was formed through the temporal powers of the Bishops of Valence, who for centuries passed down the title from uncle to ne... Know more Valentinois (duchy of) - Sauzet\n\nValentinois (duchy of) - Savasse The Duchy of Valentinois was formed through the temporal powers of the Bishops of Valence, who for centuries passed down the title from uncle to ne... Know more Valentinois (duchy of) - Savasse\n\nValmont (lordship of) The lordship of Valmont came into the possession of the House of Grimaldi through the succession of Jacques I, son of Jacques III of Matignon and h... Know more Valmont (lordship of)\n\nVentimiglia Charles I Grimaldi ruled the town of Ventimiglia in the name of Queen Joanna of Naples in 1354. Know more Ventimiglia\n\n10111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455"}, {"url": "https://en.gouv.mc/Government-Institutions/History-and-Heritage/Places/Monaco-Observatory-Cave", "page_content": "Located at the heart of the Exotic Garden, the Observatory Cave plunges vertically down for around one hundred metres until it reaches sea level. The “underground cathedral” has, over time, provided shelter for three human species: the ante Neanderthals at -200, 000 years, the Neanderthal man at -60, 000 years and modern man around -37, 000 years. Thanks to the tools which were found in this cave, different human cultures have also been identified. Limestone bifaces, touched up splinters of stone and flint blades were among these tools.\n\nBiface found in the Observatory Cave. - MAPM Coll.\n\nAnimal specimens, which were remarkably well preserved, were also found in this cave. Among these specimens, some of the most notable finds were ones which are now extinct, such as the Merk’s rhinoceros and the cave bear or species which have migrated, like the arctic fox or the panther. Other animals, which to our eyes are less exotic, were also identified, such as ibexes, dear or horses.\n\nThese relics are kept in the Museum of Prehistoric Anthropology. This museum was founded in 1902 by Prince Albert I, who was enamoured with scientific truth and wanted to spread knowledge to the masses."}, {"url": "https://www.amuraworld.com/en/topics/history-art-and-culture/articles/6120-the-oceanographic-museum-of-monaco", "page_content": "“The Temple of the Sea”\n\nThere is a palace that exists to consecrate the sea. It was built on the edge of a cliff above the Mediterranean over a century ago, in the sovereign city-state of Monaco, aiming to promote the vital significance of preserving the treasures in the marine ecosystem.\n\nPrince Albert I of Monaco (1858-1922), from his early youth, developed a strong bond with the sea. As a navigator and precursor of Oceanographic Science, he undertook an impressive series of 28 scientific explorations in order to delve into ocean studies, and then to promote and share with humankind his discoveries.\n\nHis voyages across the Atlantic Ocean and the Mediterranean Sea have been considered as pioneering. He used advanced oceanographic ships at the time, where he traveled always accompanied by a team of scientists: biologists, zoologists, botanists, geographers, among other specialists. Between 1898 and 1899 he went on one of his most challenging journeys, which aimed to reach the North Pole aboard his scientific yacht, Princess Alice II.\n\nThe Oceanographic Museum of Monaco, one of the main focal points of Monaco, a place entirely dedicated to the sea.\n\nPrince Albert I of Monaco was a navigator and precursor of Oceanographic Science.\n\nUnder the prince’s command, the first maps of the world’s ocean depths were drawn; they were valid until 1944. He used to write about the results of his expeditions, and were published with the title The Navigator’s Path. On September 10, 1889, he became the monarch of the Principality, having to focus on the responsibilities inherent to his position thereafter.\n\nThe XL Catlin Seaview Survey exploring the sea around the Museum.\n\n“…The land of Monaco has raised up a proud and inviolable temple to the new divinity which reigns over intelligences!\n\nThe Oceanographic Museum\n\nPrince Albert I created the Oceanographic Museum of Monaco with the purpose of promoting the study of the collections and discoveries acquired in the various expeditions that he carried out. Under the motto of its founder, “to know, love and protect the oceans,” the museum encompasses 6,500 m² that remain open to the public and currently exceeds 700,000 visitors annually.\n\nThe palace that houses the Monaco Oceanographic Museum is a masterpiece of monumental architecture. It was built in French neoclassical style between 1899 and 1910 by the architect Paul Delefortrie. For its construction, 100,000 tons of La Turbie region stone were needed. The imposing building descends along the cliff for 85m, almost touching the Mediterranean Sea.\n\nSharks, sensorial exposition that allows visitors to interact with them.\n\nAquariums\n\nIn the aquariums of the Monaco Oceanographic Museum there are 6,000 specimens of Mediterranean and tropical fish living in environments that faithfully reproduce their natural habitat, in addition to 200 varieties of invertebrates and around 100 types of coral. The museum has an ecological identity, and it uses sea water to fill the aquariums, allowing visitors to feel as though they really are immersed in the immensities of the underwater world.\n\nTurtle Island in the Museum.\n\nTurtle Island\n\nIt is an area of environmental mediation for this species that has been present in the planet’s seas and coasts for 150 million years. There is a health center, based on the museum’s experience, that rescues, cares for and releases sea turtles; it also serves as a network connecting several associations that specialize in safeguarding turtles.\n\nSeveral species live in the Shark Lagoon, a giant aquarium with a unique coral ecosystem.\n\nShark Lagoon\n\nIn a giant, six-meter deep fish tank, containing 450,000L of sea water, live several shark species, visible from four different points of view. In the same space, the Djibouti reef grows, one of the first ecosystems of its kind to be created with human intervention in 1989. This place is dedicated to the importance of sharks and reefs to preserve the good health of the seas.\n\nAquariums give visitors the feeling of being at the\n\nAquariums give visitors the feeling of being at the\n\nOther Attractions in the Museum\n\nThe history of underwater exploration, marine mammals, and natural history, are some of the themes in several of its exhibition halls. It is also possible to visit Commander Jacques-Yves Cousteau’s underwater exploration gadgetry—he was the museum’s director for more than 30 years—or visit Prince Albert Ist Room, which is dedicated to the life and work of Prince Albert I, who also founded the Institute of Oceanography in Paris.\n\nArtist Mark Dion’s exposition is quite extraordinary; he created a monumental cabinet to house a world of curiosities of the museum that ranges from libraries, skeletons, fossils, texts, maps and diverse objects; among them, Karl Heinrich Klingert’s diving suit, which was developed in 1797, and with which its inventor remained several minutes underwater,12m deep.O\n\nBorderline exposition, “The Wheel Of Time.\n\nArtist Philippe Pasqua created twelve monumental works for the preservation of nature and the oceans, exhibited in different areas of the Museum under the name of Borderline.\n\nArtist Philippe Pasqua created twelve monumental works for the preservation of nature and the oceans, exhibited in different areas of the Museum under the name of Borderline.\n\nSharks, Megalodon’s mega smile\n\nArtist Philippe Pasqua created twelve monumental works for the preservation of nature and the oceans, exhibited in different areas of the Museum under the name of Borderline."}, {"url": "https://musee.oceano.org/en", "page_content": "Monaco\n\nGet involved with us for the sea turtles\n\nThe temporary exhibition The Sea Turtle Odyssey allows visitors who are aware of the situation to get involved in their favour thanks to an innovative interactive device: even if you can't come to the Museum, discover how your commitment can still count to help the Oceanographic Institute to act in..."}, {"url": "https://pantheon.world/profile/person/Honor%C3%A9_IV,_Prince_of_Monaco", "page_content": "Honoré IV, Prince of Monaco\n\nHonoré IV (Honoré Charles Anne Grimaldi; 17 May 1758 – 16 February 1819) was Prince of Monaco and Duke of Valentinois from 1814 to 16 February 1819 . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Honoré IV, Prince of Monaco has received more than 162,372 page views. His biography is available in 23 different languages on Wikipedia (up from 20 in 2019) . Honoré IV, Prince of Monaco is the 5,788th most popular politician (down from 4,580th in 2019), the 1,731st most popular biography from France (down from 1,446th in 2019) and the 429th most popular French Politician."}]}