{"Tristan Rogers was born on 3 June 1946.": [{"url": "https://factsbuddy.com/tristan-rogers/", "page_content": "Tristan Rogers Bio | Wiki\n\nTristan Rogers is an Australian-American voiceover artist and actor known for his role on the ABC soap opera, General Hospital as Robert Scorpio. He has also been a cast member of The Rescuers Down Under (1990) and Studio City (2019).\n\nTristan Rogers Age\n\nHe was born in Melbourne, Victoria, in Australia on June 3, 1946. Rogers is 76 years old.\n\nTristan Rogers Height\n\nHe is a man of above-average stature. Rogers’ height is 6 ft 1 in ( approx. 1.85m ).\n\nTristan Rogers Family\n\nHe is a local of Melbourne, Victoria, in Australia. Rogers was raised by his parents in Australia. However, he relocated to the USA after purchasing a house in Palm Springs, California in 1997. Furthermore, his mother passed on in April 2017. However, Rogers has not shared much about his family with the public domain including the identity of his parents or whether he has any siblings.\n\nTristan Rogers Wife | Married\n\nHe got married to his wife Teresa Parkerson on May 21, 1995. Rogers and his wife are proud parents of two children, Sara Jane born in August 1992, and a son by the name of Cale born in August 1996. However, this is not the first time that Rogers has been in a marriage union. He was previously married to his first wife, Barbara Meale between 1974 to 1984. Furthermore, his ex-wife is a well-renowned actress known for her role in Out of Love (1974) and Homicide (1964).\n\nTristan Rogers Education\n\nDespite being a well-renowned veteran actor, Rogers has withheld his academic qualifications from the public eye due to his secretive character.\n\nTristan Rogers Emma Samms\n\nBoth Rogers and Emma Samms have been the cast members of the General Hospital television series on ABC. Emma is an English actress and TV host who is known for her role in the Dynasty soap opera as Fallon Carrington Colby. After Rogers divorced his first wife Barbara Meale in 1984, he got into a brief relationship with Emma. However, the relationship ended shortly after Emma made her exit from General Hospital.\n\nTristan Rogers General Hospital\n\nHe plays the role of Robert Scorpio in the General Hospital Tv series on ABC. Apart from casting a role in the General hospital, Rogers has also been a cast member of The Young and the Restless, Four Dimensions of Greta (1972), Sex Farm (1973), Soulmates (1992), A Piece of Eden (2000), Jack Rio (2008), The Los Angeles Ripper (2011) Raven (2010), Delgo (2008), The Flesh and Blood Show (1972), Night Eyes 3 (1993), Delgo (2008), The Rescuers Down Under (1990), etc.\n\nTristan Rogers Health\n\nHe has been a professional actor for at least four decades. During his career as an actor, Rogers has not shared any details concerning his health or whether he has any health-related issues. However, in November 2016, he flew to Canada to check on the health of his mother. Unfortunately, Rogers’ mother passed on in April 2017. Additionally, he shared the news of his mother’s demise through a tweet.\n\nTristan Rogers Net Worth\n\nRogers’ net worth is $8 million. He has been an actor who has landed lucrative deals in the acting industry for more than four decades. Therefore, it goes undisputed that Rogers has been able to accumulate a decent fortune over the years.\n\nHow Old Is Tristan Rogers\n\nHe is 76 years old. Rogers was born in Melbourne, Victoria, Australia on June 3, 1946.\n\nIs Tristan Rogers Married\n\nYes, he has been married to his beautiful wife Teresa Parkerson since May 1995. Furthermore, Rogers and his wife share two all-grown-up children, Cale and Sara Jane. However, Rogers was previously married to actress Barbara Maele between 1974 to 1984.\n\nWho Is Tristan Rogers\n\nHe is an Australian-American actor known for his role in the Young and Restless as well as General Hospital. Rogers has also been a cast member of Studio City (2019) and he Rescuers Down Under (1990)."}, {"url": "https://www.encyclopedia.com/education/news-wires-white-papers-and-books/rogers-tristan-1946", "page_content": "ROGERS, Tristan 1946–\n\nPERSONAL\n\nBorn June 3, 1946, in Melbourne, Victoria, Australia; naturalized U.S. citizen; son of Ron and Margo Rogers; married Barbara Meale (an actress) June 7, 1974 (divorced, 1984); married Teresa Parkerson, May 21, 1995; children: Sara Jane, one son. Avocational Interests: Charity work, including Project Cuddle and race car driving.\n\nAddresses: Agent—Don Buchwald & Associates, 6500 Wilshire Blvd., Suite 2200, Los Angeles, CA 90048; Cunningham/Escott/Dipene & Associates, 10635 Santa Monica Blvd., Suite 140, Los Angeles, CA 90025.\n\nCareer: Actor. Previously member of pop band, Sounds of the Present. Also worked as a disc jockey in a disco.\n\nAwards, Honors: Soapy Award, most exciting new actor, Soap Opera Digest Award nomination, outstanding actor in a leading role on a daytime serial, 1986, both for General Hospital.\n\nCREDITS\n\nFilm Appearances:\n\nHans Weimer, Four Dimensions of Greta (also known as The Four Dimensions of Greta and Three Dimensions of Greta), Dimension Films, 1972.\n\nRobert Waitman, Sex Farm (also known as Frustrated Wives), Cineworld, 1973.\n\nTony Weller, The Flesh and Blood Show (also known as Asylum of the Insane), Entertainment Ventures Inc., 1974.\n\nVoice of Jake: The Outback Kangaroo Mouse, The Rescuers Down Under (animated), Buena Vista, 1990.\n\nRichard Wayborn, Soulmates (also known as Blood Love and Evil Lives), A–Pix Entertainment, 1992.\n\nJim Stanton, Night Eyes Three (also known as Night Eyes III: On Guard), Turner Home Entertainment, 1993.\n\nVictor Hardwick, A Piece of Eden, GS Entertainment, 2000.\n\nTelevision Appearances; Series:\n\nBellbird, Australian Broadcasting Corporation, 1967.\n\nDetective Constable Ray Gamble, The Link Men, 1970.\n\nThe Box, Ten Network, 1974.\n\nCain Carmichael, Number 96, NBC, 1974.\n\nRobert Scorpio, General Hospital, ABC, 1980–92, 1995.\n\nVoice of \"Spider\" Reilly, Sky Commanders, syndicated, 1987.\n\nVoice of Caucasian patrol member, Captain Planet and the Planeteers (animated; also known as The New Adventures of Captain Planet), TBS and syndicated, 1990.\n\nHarry, Fast Track, HBO, 1997.\n\nHunter Jones, The Bold and the Beautiful (also known as Belleza y poder), CBS, 1997.\n\nTelevision Appearances; Miniseries:\n\nPeter Monton, Power without Glory, Australian Broadcasting Corporation, 1976.\n\nTelevision Appearances; Movies:\n\nDuke Albert, A Perry Mason Mystery: The Case of the Lethal Lifestyle, NBC, 1994.\n\nTelevision Appearances; Specials:\n\nHimself, Intimate Portrait: Finola Hughes (documentary), Lifetime, 2002.\n\nTelevision Appearances; Episodic:\n\nPeter Spencer, \"The Initiators,\" Delta, Australian Broadcasting Corporation, 1969.\n\nRobin Tullough, \"Cue Murder!,\" Paul Temple, BBC, 1971.\n\nRod, \"The Pirates,\" Barrier Reef, Network 10, 1971.\n\n\"The Audition/The Groupies/Doc's Nephew,\" The Love Boat, ABC, 1982.\n\nEric Ducane, \"Death in Vogue,\" Cover Up, CBS, 1984.\n\nAlan Gray, \"Opening Moves,\" Hotel, ABC, 1986.\n\nGrant, \"Betrayal,\" Mancuso, FBI, NBC, 1989.\n\nBennett Herd, \"A Hundred Share,\" Super Force, syndicated, 1991.\n\nEvian, \"Spoiled,\" Tales from the Crypt, HBO, 1991.\n\nDr. Manly Biggs, \"The Viral Staircase: Parts 1 & 2,\" Super Force, syndicated, 1992.\n\nNash, \"She'll Do to Ride the River With,\" Walker, Texas Ranger, CBS, 1993.\n\nMalcolm Biggs, \"The War Prayer,\" Babylon 5, 1994.\n\nJon Hardy, \"Code Name: Deep Six,\" Acapulco H.E.A.T., syndicated, 1994.\n\nBrock, \"Manpower,\" One West Waikiki, syndicated, 1995.\n\nVoice of Hawkins, \"Ndoovu's Last Journey,\" The Real Adventures of Jonny Quest (animated), syndicated, 1996.\n\nHarry Murdock, \"Escape from Val–catraz,\" V.I.P., syndicated, 1999.\n\nVoice of Simon Harper, \"Knights of the Lost Cosmos\" (also known as \"Sentries of the Last Cosmos\"), Batman Beyond (animated), The WB, 2000.\n\nVoice of Sam Gibson, \"New Territory,\" The Wild Thornberrys (animated), 2001.\n\nDr. Eddward Crystal, \"Separation,\" Family Law, CBS, 2001.\n\nDr. Edward Crystal, \"The Quality of Mercy,\" Family Law, CBS, 2001.\n\nRECORDINGS\n\nVideo Games:\n\nVoices of Duke, Koala worker, and Keith, Ty the Tasmanian Tiger 2, 2004."}, {"url": "https://famousstardom.com/tristan-rogers", "page_content": "Tristan Rogers is an Australian-American actor, best-known for his role as Robert Scorpio on ABC soap opera General Hospital. He is also popular for voicing Jake in The Rescuers Down Under. Rogers' film credits include Four Dimensions of Greta, Delgo, and Jack Rio among others.\n\nEarly Life And Early Career Of Tristan Rogers\n\nTristan Rogers was born on 3rd June 1946 in Melbourne, Australia. Information about his parents and early childhood is not known to the date. He spent his time in his hometown Melbourne before he moved to the USA to pursue an acting career.\n\nHe was interested in acting from an early age and worked in some minor roles on Australian television and soap operas that include Bellbird, Number 96 and The Box. Later, he was cast regular in the police drama series The Link Men that only lasted for 13 episodes in the '70s.\n\nTristan Rogers' Professional Career\n\nTristan Rogers moved to the USA in the late 70s and got his career breakthrough there in 1980 when he was cast on General Hospital. He worked on the soap opera for 11 long years until February 1992.\n\nHe played the role of Robert Scorpio in the show whose 1981 wedding gained 30 million viewers setting the records for the highest-rated hour in American soap opera history.\n\nIn December 2010, Rogers made his comeback in the daytime television joining the cast of The Young and the Restless as Colin Atkinson. His role in the show ended in October 2011, though he signed the contract until February 2011.\n\nOn March 1, 2012, Rogers returned to General Hospital as Robert Scorpio after the character Anna Devane called him to tell him that their daughter Robin Scorpio-Drake was killed in a lab accident. He left the show after eight episodes.\n\nTristan Rogers' Net Worth\n\nAustralian born American actor Tristan Rogers has been active in the acting industry for over four decades and in this period, he has worked in a number of big hit movies and television series. As of 2019, his net worth is under review, however, considering his success and fame in the industry, his net worth can be estimated to range from $100k-$1 million.\n\nHe primarily earned from his time in the soap opera where he gave the most of his career time. Moreover, he also amassed a lucrative sum of money from sponsors and endorsements.\n\nTristan Rogers' Personal Life, Marriage, And Children\n\nTalking about Tristan Rogers' personal life, the 73-year-old actor is a happily married man; has been married to Teresa Parkerson since 21st May 1995. The couple is blessed with two children; daughter Sara Jane whom they welcomed on 25th August 1992, and son Cale Rogers (born: August 1996).\n\nPrior to marrying Teresa Parkerson, he was married to his first wife Barbara Meale whom he divorced in 1984 after a decade long married life.\n\nTristan Rogers' Height, Weight, And Other Body Stats\n\nHeight: Tristan Rogers stands 6 ft. 1 inch or 185 cm tall.\n\nTristan Rogers stands 6 ft. 1 inch or 185 cm tall. Age: Actor Tristan Rogers is 73 years old as of 2019.\n\nActor Tristan Rogers is 73 years old as of 2019. Nationality: Rogers is a naturalized American citizen.\n\nRogers is a naturalized American citizen. Ethnicity: He is white as per his ethnicity.\n\nFor more updates, stay tuned to FrostSnow."}, {"url": "https://www.howold.co/person/tristan-rogers", "page_content": "Tristan Rogers Australian actor\n\nTristan Rogers is a 77 years old Australian actor from Melbourne, Victoria. He was born on June 03, 1946 in Melbourne, Victoria.\n\nAbout\n\nBiography\n\nTristan Rogers is an Australian American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney's The Rescuers Down Under. Early acting roles were on Australian television and he completed short stints in soap operas Bellbird Number 96 and The Box.\n\nRead full biography\n\nYes, Tristan Rogers is still alive Last check: 2 years ago\n\nWorks\n\nTristan Rogers Movies (7)\n\nThere are 7 movies of Tristan Rogers.\n\nHis first feature film was The Rescuers Down Under (1990, as Jake (voice)). He was 44 when he starred in this movie. Since 1990, he has appeared in 7 feature films. The last one is Soulmates (1992). In this movie, we watched him in the Richard Wayborn character .\n\nTristan Rogers movie characters\n\nView all Tristan Rogers movies\n\nThe names of the characters/jobs in the films he starred in are as follows:\n\nTristan Rogers TV Shows (13)\n\nHis first TV Show was The Link Men (1970).\n\nView all Tristan Rogers TV shows\n\nTristan Rogers zodiac sign is gemini.\n\nWhen is Rogers's next birthday?\n\nTristan Rogers was born on the 3rd of June 1946 , which was a Monday. He will be turning 78 in only 360 days from today (09 June, 2023).\n\nOther facts about Tristan Rogers"}, {"url": "https://www.celebsagewiki.com/tristan-rogers", "page_content": "Age, Biography and Wiki\n\nTristan Rogers was born on 3 June, 1946 in Melbourne, Victoria, Australia, is an Actor, Writer. Discover Tristan Rogers's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 75 years old?\n\nPopular As N/A Occupation actor,writer Age 77 years old Zodiac Sign Gemini Born 3 June 1946 Birthday 3 June Birthplace Melbourne, Victoria, Australia Nationality Australia\n\nWe recommend you to check the complete list of Famous People born on 3 June. He is a member of famous Actor with the age 77 years old group.\n\nTristan Rogers Height, Weight & Measurements\n\nAt 77 years old, Tristan Rogers height is 6' 1\" (1.85 m) .\n\nPhysical Status Height 6' 1\" (1.85 m) Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Tristan Rogers's Wife?\n\nHis wife is Teresa Parkerson (21 May 1995 - present) ( 2 children), Barbara Meale (7 June 1974 - 1984) ( divorced)\n\nFamily Parents Not Available Wife Teresa Parkerson (21 May 1995 - present) ( 2 children), Barbara Meale (7 June 1974 - 1984) ( divorced) Sibling Not Available Children Not Available\n\nTristan Rogers Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Tristan Rogers worth at the age of 77 years old? Tristan Rogers’s income source is mostly from being a successful Actor. He is from Australia. We have estimated Tristan Rogers's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nTristan Rogers Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.celebsages.com/tristan-rogers/", "page_content": "Birth Name: Tristan Rogers Occupation: Soap Opera Actor Born In: Melbourne, Australia Birthdate: June 3, 1946 Age: 77 years old (as of 2023) Ethnicity: White Nationality: Australian Sexuality: Straight\n\nTristan Rogers was born on the 3rd of June, 1946. He is known for being a Soap Opera Actor. He worked alongside John Candy and Bob Newhart for the 1990 Disney animated film The Rescuers Down Under. Tristan Rogers’s age is 77. Known for his portrayal of the American soap opera characters Robert Scorpio on General Hospital and Colin Atkinson on The Young and the Restless. He also appeared as the voice of Jake in the 1990 Disney animated film The Rescuers Down Under. The 77-year-old soap opera actor was born in Melbourne, Australia. He began his acting career in 1974 by appearing across Australian TV. This lasted until 1980 when he was originally cast on General Hospital in the US. In 2010, he began starring on the web soap opera series The Bay as Lex Martin. In 2015, he lent his voice to the Mad Max video game release.\n\nCountdown to Tristan’s next birthday.\n\nTristan Rogers is a Gemini and his 78th birthday is in .\n\nJUMP TO: Tristan Rogers’s biography , facts , family , personal life , zodiac , videos , net worth , and popularity .\n\nChildhood\n\nTristan Rogers was born in 1940s. The early 1940s were dominated by World War II. Following the end of the war, it was the start of the Baby Boomer years and technology advancements such as the jet engine, nuclear fusion, radar, rocket technology and others later became the starting points for Space Exploration and Improved Air Travel. The 40s also brought us the Slinky, Velcro, Jeep, Tupperware and Frisbee. Discover what happened on this day.\n\nTristan Rogers is part of the Baby boomers generation. Also known as \"boomers\", are the result of the end of World War II, when birth rates across the world spiked. They are associated with a rejection of traditional values. These hippie kids protested against the Vietnam War and participated in the civil rights movement.\n\nYou can also find out who is Tristan Rogers dating now and celebrity dating histories at CelebsCouples.\n\nWhile we don't know Tristan Rogers birth time, but we do know his mother gave birth to his on a Monday. People born on a Monday tend to be a bit sensitive and emotional. They have imagination and don't like planning things in advance. They're flexible and good at improvising.\n\n[fetch instagram=”” display=”posts” ]\n\nThe 77-year-old Australian was born in the Baby Boomers Generation and the Year of the Dog\n\nEducation\n\nThe education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nTristan Rogers’s mother’s name is unknown at this time and his father’s name is under review. We will continue to update information on Tristan Rogers’s parents.\n\nPersonal Life\n\nLike many famous people and celebrities, Tristan Rogers keeps his personal life private. Once more details are available on who he is dating, we will update this section.\n\nFast Facts\n\nREAL NAME: Tristan Rogers NICKNAME: Tristan\n\nMARTIAL STATUS: Pending RELIGION: Unknown TATTOOS: N/A AGE GENERATION: Baby Boomers Generation BIRTH SIGN: Gemini BIRTH DAY: Monday DAYS SINCE BIRTH:\n\nNet Worth\n\nThe 77-year-old Australian soap opera actor has done well thus far. Majority of Tristan’s money comes from being a soap opera actor. CelebsMoney has recently updated Tristan Rogers’s net worth .\n\nVideos\n\nHoroscope\n\nZodiac Sign: Tristan Rogers is a Gemini. People of this zodiac sign like music, books, magazines, chatting, short trips and dislike being alone, repetition and routine. The strengths of this sign are being gentle, affectionate, curious, adaptable, able to learn quickly, while weaknesses can be nervous, inconsistent and indecisive. The greatest overall compatibility with Gemini is Sagittarius and Aquarius.\n\nChinese Zodiac: Tristan Rogers was born in the Year of the Rabbit. People born under this sign are fiercely loyal and can always keep a secret. They're not afraid of the hardships in life, but they also tend to worry too much sometimes.\n\n\n\n\n\nRuling Planet: Tristan Rogers has a ruling planet of Mercury and has a ruling planet of Mercury and by astrological associations Wednesday is ruled by Mercury. In Astrology, Mercury is the planet that rules our mindset. People who are born with Mercury as the ruling planet have communication skills, intellect and cleverness.\n\n[fetch instagram=”” display=”posts” show=”2″ ]\n\nTristan Rogers’s birth sign is Gemini and he has a ruling planet of Mercury.\n\nDon’t miss\n\n– Who’s the richest Soap Opera Actor in the world?\n\n– Tristan Rogers Net Worth Stats\n\n– When is Tristan Rogers’s birthday?\n\nAssociated with\n\nFans also viewed"}, {"url": "https://www.famousdetails.com/tristan-rogers/", "page_content": "Tristan Rogers (Soap Opera Actor) was born on the 3rd of June, 1946. He was born in 1940s, in Baby Boomers Generation. His birth sign is Gemini and his life path number is 11. Tristan’s birth flower is Rose and birthstone is Pearl, Moonstone and Alexandrite. What does this all mean? Let’s find out!\n\nDiscover all the facts that no one tells you about Tristan Rogers below ↓\n\nNAME: Tristan Rogers REAL NAME: Tristan Rogers NICKNAME: Tristan PROFESSION: Soap Opera Actor GENDER: Male BIRTHPLACE: Melbourne, Australia ETHNICITY: White NATIONALITY: Australian RELIGION: Unknown SEXUALITY: Straight\n\n1. Bio\n\nTristan Rogers, best known for being a Soap Opera Actor, was born in Melbourne, Australia on Monday, June 3, 1946. Known for his portrayal of the American soap opera characters Robert Scorpio on General Hospital and Colin Atkinson on The Young and the Restless. He also appeared as the voice of Jake in the 1990 Disney animated film The Rescuers Down Under.\n\nFamily: He was born and raised in Melbourne, Australia. Tristan Rogers father’s name is under review and mother unknown at this time. We will continue to update details on Tristan Rogers’s family.\n\nFATHER: MOTHER: unknown at this time BROTHER(S): Not available SISTER(S): Not available\n\nEducation: The education details are not available at this time. Please check back soon for updates.\n\nDating: According to CelebsCouples, Tristan Rogers is married Teresa Parkerson.\n\nNet Worth: Online estimates of Tristan Rogers’s net worth vary. It’s easy to predict his income, but it’s much harder to know how much he has spent over the years. CelebsMoney and NetWorthStatus does a good job of breaking most of it down.\n\n2. Tristan Rogers’s zodiac sign is Gemini\n\nTristan Rogers zodiac sign is a Gemini. Dates of Gemini are May 21 - June 20. Those born under the Gemini zodiac sign enjoy socializing and love surrounding themselves with people. They enjoy chit-chat and tend to have expression and communication very high on their list of priorities. They are intelligent, adaptable, agile, communicative, informative, and connected. Although, they can be too talkative, exaggerating, deceptive, cunning, superficial, and inconsistent.\n\nZODIAC: Gemini BORN IN THE YEAR OF THE: Dog RULING PLANET: Mercury\n\n3. He is currently 77 years old\n\nThe Australian soap opera actor has been alive for 28,130 days or 675,126 hours. There were precisely 954 full moons after his birth to this day.\n\nBORN: June 3, 1946 AGE: 77 years old BORN ON: Monday GENERATION: Baby Boomers Generation DECADE: 1940s\n\nTristan Rogers was born on a Monday. People born on Mondays are motherly, sensitive, adaptive, and kind.\n\nCountdown to Tristan Rogers’s next birthday.\n\nTristan Rogers will be turning 78.\n\n4. On Tristan Rogers’s birthday\n\nThe world’s population was and there were an estimated year babies born throughout the world in 1946, Harry S. Truman (Democratic) was the president of the United States, and the number one song on Billboard 100 was [Not available]. No song matches found..\n\nOn this day in history:\n\n5. Tristan Rogers’s height and weight\n\nWe’re currently in process of confirming all details such as Tristan Rogers’s height, weight, and other stats. If there is any information missing, we will be updating this page soon. If you any have tips or corrections, please send them our way.\n\nHeight\n\nHEIGHT (FEET): N/A HEIGHT (METERS): N/A HEIGHT (INCHES) N/A HEIGHT (CM): N/A\n\nWeight\n\nBUILD Average WEIGHT (LBS): Under review WEIGHT (KG) Under review\n\nMisc\n\nEYE COLOR: Blue HAIR COLOR: Dark Brown\n\n6. The Year of the Dog\n\nTristan Rogers was born in the Year of the Dog. People with Chinese zodiac Dog are usually independent, sincere, loyal and decisive according to Chinese zodiac analysis. They are not afraid of difficulties in daily life. Their strengths are being valiant, loyal, responsible, clever, and courageous. But they can also be overly sensitive, conservative, stubborn, emotional. Their lucky numbers are 3, 4, 9 and lucky colors are green, red, purple.\n\n\n\n\n\n7. Tristan Rogers’s life path number is 11\n\n8. Baby Boomers Generation\n\nTristan Rogers was born in the middle of Baby Boomers Generation.\n\n9. Tristan Rogers’s birthstone is Pearl, Moonstone and Alexandrite\n\n10. Tristan Rogers’s birth flower is Rose\n\nIf you found this page interesting or useful, please share it. We will continue to update this page, so bookmark it and come back often to see new updates."}, {"url": "https://www.idolbirthdays.net/tristan-rogers", "page_content": "Does Tristan Rogers Dead or Alive?\n\nAs per our current Database, Tristan Rogers is still alive (as per Wikipedia, Last update: May 10, 2020).\n\n🎂 Tristan Rogers - Age, Bio, Faces and Birthday\n\nCurrently, Tristan Rogers is 77 years, 0 months and 6 days old. Tristan Rogers will celebrate 78rd birthday on a Monday 3rd of June 2024. Below we countdown to Tristan Rogers upcoming birthday.\n\nDays Hours Minutes Seconds\n\nPopular As Tristan Rogers Occupation Soap Opera Actor Age 77 years old Zodiac Sign Gemini Born June 3, 1946 (Melbourne, Australia) Birthday June 3 Town/City Melbourne, Australia Nationality Australia\n\n🌙 Zodiac\n\nTristan Rogers’s zodiac sign is Gemini. According to astrologers, Gemini is expressive and quick-witted, it represents two different personalities in one and you will never be sure which one you will face. They are sociable, communicative and ready for fun, with a tendency to suddenly get serious, thoughtful and restless. They are fascinated with the world itself, extremely curious, with a constant feeling that there is not enough time to experience everything they want to see.\n\n🌙 Chinese Zodiac Signs\n\nTristan Rogers was born in the Year of the Dog. Those born under the Chinese Zodiac sign of the Dog are loyal, faithful, honest, distrustful, often guilty of telling white lies, temperamental, prone to mood swings, dogmatic, and sensitive. Dogs excel in business but have trouble finding mates. Compatible with Tiger or Horse.\n\nSome Tristan Rogers images\n\nAbout\n\nKnown for his portrayal of the American soap opera characters Robert Scorpio on General Hospital and Colin Atkinson on The Young and the Restless. He also appeared as the voice of Jake in the 1990 Disney animated film The Rescuers Down Under.\n\nBefore Fame\n\nHe began his acting career in 1974 by appearing across Australian TV. This lasted until 1980 when he was originally cast on General Hospital in the US.\n\nTrivia\n\nIn 2010, he began starring on the web soap opera series The Bay as Lex Martin. In 2015, he lent his voice to the Mad Max video game release.\n\nFamily Life\n\nHe was born and raised in Melbourne, Australia.\n\nAssociated With\n\nHe worked alongside John Candy and Bob Newhart for the 1990 Disney animated film The Rescuers Down Under.\n\nTristan Rogers trend"}, {"url": "https://happyhappybirthday.net/en/age/tristan-rogers-person_exegfxf", "page_content": "Tristan Rogers\n\nAustralian actor – Tristan Rogers was born in Melbourne (capital city of Victoria, Australia) on June 3rd, 1946 and is 77 years old today.\n\nAge How old is Tristan Rogers? 77 Tristan Rogers is 77 years old.\n\nBiographical data\n\nTristan Rogers\n\nBirthday When was Tristan Rogers born? Tristan Rogers was born on June 3rd, 1946.\n\nPlace of Birth Where was Tristan Rogers born? Melbourne (capital city of Victoria, Australia).\n\n♊ ♊ Zodiac What is the zodiac sign of Tristan Rogers? Tristan Rogers was born in the zodiac sign Gemini (The Twins)."}, {"url": "https://infofamouspeople.com/famous/tristan-rogers.htm", "page_content": "Tristan Rogers's About ✎]\n\nTristan Rogers was born on June 3, 1946 (age 77) in Melbourne, Australia. According to numerology, Tristan Rogers's Life Path Number is 2. He is a celebrity soap opera actor. Known for his portrayal of the American soap opera characters Robert Scorpio on General Hospital and Colin Atkinson on The Young and the Restless. He also appeared as the voice of Jake in the 1990 Disney animated film The Rescuers Down Under. He had 2 children Sara Jane Rogers, Cale Rogers. His spouse is Teresa Parkerson (21 May 1995 – present; 2 children) Barbara Meale (7 June 1974–1984; divorced). His height is 6ft 1 (185cm). You can find His website below: http://tristanrogers.com/. More information on Tristan Rogers can be found here. This article will clarify Tristan Rogers's Bio, Wikipedia, Age, Birthday, Height, and other information.\n\nLet's explore Your Tarot online (love,wellness,fortune)\n\nIf you are a fan of Tristan Rogers, tell us more about Him\n\nAdvertisement\n\nFamily, Spouse, Dating, and Relationships of Tristan Rogers ✎]\n\nHe was born and raised in Melbourne, Australia.\n\nTristan Rogers Before Fame ✎]\n\nOn 6-3-1946, Tristan Rogers was born. It indicates that He is on life path 2. His personal year number in 2023 is 7. He began his acting career in 1974 by appearing across Australian TV. This lasted until 1980 when he was originally cast on General Hospital in the US.\n\nThe Numerology of Tristan Rogers ✎]\n\nTristan Rogers's Life Path Number is 2 as per numerology, it means he is motivated by community, harmony, and relationships. Life path 2s are peacekeepers who aim to achieve balance, specifically when it comes to their relationships. They're sensitive empaths, so they can pick up the emotions of others, and they're generally reserved and kindhearted.\n\nAdvertisement\n\nTristan Rogers's personal year in numerology ✎]\n\nTristan Rogers was born in 1946, that means in 2023, Tristan Rogers has personal year number 7. This is the second bottoming phase, there will be many challenges and difficulties for Tristan Rogers in this year, especially in His career. He should prepare everything for the 8th year.\n\nSuccess of Tristan Rogers ✎]\n\nIn 2010, he began starring on the web soap opera series The Bay as Lex Martin. In 2015, he lent his voice to the Mad Max video game release.\n\nAssociated with ✎]\n\nHe worked alongside John Candy and Bob Newhart for the 1990 Disney animated film The Rescuers Down Under. Karrueche Tran, and James Reynolds were also His acquaintances.\n\nTristan Rogers Net Worth ✎]\n\nInformation about His net worth in 2023 is being updated as soon as possible by infofamouspeople.com, You can also click edit to tell us what the Net Worth of the Tristan Rogers is\n\nTristan Rogers Height Weight ✎]\n\nAt the age of 77, Tristan Rogers height is 6ft 1 (185cm).\n\n\n\nHouses & Cars & Luxury Brands ✎]\n\nTristan Rogers's house, cars and luxury brand in 2023 will be updated as soon as possible, you can also click edit to let us know about this information."}], "Tristan Rogers is Australian.": [{"url": "https://www.tvinsider.com/people/tristan-rogers/", "page_content": "Actor\n\nBirth Date: June 3, 1946\n\nAge: 77 years old\n\nBirth Place: Melbourne, Victoria, Australia\n\nIn 1980, Australian actor Tristan Rogers landed a small role on what was then the most popular soap opera in the world, \"General Hospital,\" (ABC, 1963- ), having no idea he would become the first of many hunky Australian exports to set American hearts aflutter. Playing Robert Scorpio, a sophisticated and savvy operative for the World Security Bureau, Rogers was teamed up with the most famous couple in the world at that time -\"GH\" lovers Luke and Laura - to help save the world from being frozen solid. He went on to become one of the soap world's most iconic actors, even long after he had left the show and moved on to other endeavors."}, {"url": "https://factsbuddy.com/tristan-rogers/", "page_content": "Tristan Rogers Bio | Wiki\n\nTristan Rogers is an Australian-American voiceover artist and actor known for his role on the ABC soap opera, General Hospital as Robert Scorpio. He has also been a cast member of The Rescuers Down Under (1990) and Studio City (2019).\n\nTristan Rogers Age\n\nHe was born in Melbourne, Victoria, in Australia on June 3, 1946. Rogers is 76 years old.\n\nTristan Rogers Height\n\nHe is a man of above-average stature. Rogers’ height is 6 ft 1 in ( approx. 1.85m ).\n\nTristan Rogers Family\n\nHe is a local of Melbourne, Victoria, in Australia. Rogers was raised by his parents in Australia. However, he relocated to the USA after purchasing a house in Palm Springs, California in 1997. Furthermore, his mother passed on in April 2017. However, Rogers has not shared much about his family with the public domain including the identity of his parents or whether he has any siblings.\n\nTristan Rogers Wife | Married\n\nHe got married to his wife Teresa Parkerson on May 21, 1995. Rogers and his wife are proud parents of two children, Sara Jane born in August 1992, and a son by the name of Cale born in August 1996. However, this is not the first time that Rogers has been in a marriage union. He was previously married to his first wife, Barbara Meale between 1974 to 1984. Furthermore, his ex-wife is a well-renowned actress known for her role in Out of Love (1974) and Homicide (1964).\n\nTristan Rogers Education\n\nDespite being a well-renowned veteran actor, Rogers has withheld his academic qualifications from the public eye due to his secretive character.\n\nTristan Rogers Emma Samms\n\nBoth Rogers and Emma Samms have been the cast members of the General Hospital television series on ABC. Emma is an English actress and TV host who is known for her role in the Dynasty soap opera as Fallon Carrington Colby. After Rogers divorced his first wife Barbara Meale in 1984, he got into a brief relationship with Emma. However, the relationship ended shortly after Emma made her exit from General Hospital.\n\nTristan Rogers General Hospital\n\nHe plays the role of Robert Scorpio in the General Hospital Tv series on ABC. Apart from casting a role in the General hospital, Rogers has also been a cast member of The Young and the Restless, Four Dimensions of Greta (1972), Sex Farm (1973), Soulmates (1992), A Piece of Eden (2000), Jack Rio (2008), The Los Angeles Ripper (2011) Raven (2010), Delgo (2008), The Flesh and Blood Show (1972), Night Eyes 3 (1993), Delgo (2008), The Rescuers Down Under (1990), etc.\n\nTristan Rogers Health\n\nHe has been a professional actor for at least four decades. During his career as an actor, Rogers has not shared any details concerning his health or whether he has any health-related issues. However, in November 2016, he flew to Canada to check on the health of his mother. Unfortunately, Rogers’ mother passed on in April 2017. Additionally, he shared the news of his mother’s demise through a tweet.\n\nTristan Rogers Net Worth\n\nRogers’ net worth is $8 million. He has been an actor who has landed lucrative deals in the acting industry for more than four decades. Therefore, it goes undisputed that Rogers has been able to accumulate a decent fortune over the years.\n\nHow Old Is Tristan Rogers\n\nHe is 76 years old. Rogers was born in Melbourne, Victoria, Australia on June 3, 1946.\n\nIs Tristan Rogers Married\n\nYes, he has been married to his beautiful wife Teresa Parkerson since May 1995. Furthermore, Rogers and his wife share two all-grown-up children, Cale and Sara Jane. However, Rogers was previously married to actress Barbara Maele between 1974 to 1984.\n\nWho Is Tristan Rogers\n\nHe is an Australian-American actor known for his role in the Young and Restless as well as General Hospital. Rogers has also been a cast member of Studio City (2019) and he Rescuers Down Under (1990)."}, {"url": "https://www.famousbirthdays.com/people/tristan-rogers.html", "page_content": "About\n\nKnown for his portrayal of the American soap opera characters Robert Scorpio on General Hospital and Colin Atkinson on The Young and the Restless. He also appeared as the voice of Jake in the 1990 Disney animated film The Rescuers Down Under.\n\nBefore Fame\n\nHe began his acting career in 1974 by appearing across Australian TV. This lasted until 1980 when he was originally cast on General Hospital in the US.\n\nTrivia\n\nIn 2010, he began starring on the web soap opera series The Bay as Lex Martin. In 2015, he lent his voice to the Mad Max video game release.\n\nFamily Life\n\nHe was born and raised in Melbourne, Australia.\n\nAssociated With\n\nHe worked alongside John Candy and Bob Newhart for the 1990 Disney animated film The Rescuers Down Under."}, {"url": "https://famousstardom.com/tristan-rogers", "page_content": "Tristan Rogers is an Australian-American actor, best-known for his role as Robert Scorpio on ABC soap opera General Hospital. He is also popular for voicing Jake in The Rescuers Down Under. Rogers' film credits include Four Dimensions of Greta, Delgo, and Jack Rio among others.\n\nEarly Life And Early Career Of Tristan Rogers\n\nTristan Rogers was born on 3rd June 1946 in Melbourne, Australia. Information about his parents and early childhood is not known to the date. He spent his time in his hometown Melbourne before he moved to the USA to pursue an acting career.\n\nHe was interested in acting from an early age and worked in some minor roles on Australian television and soap operas that include Bellbird, Number 96 and The Box. Later, he was cast regular in the police drama series The Link Men that only lasted for 13 episodes in the '70s.\n\nTristan Rogers' Professional Career\n\nTristan Rogers moved to the USA in the late 70s and got his career breakthrough there in 1980 when he was cast on General Hospital. He worked on the soap opera for 11 long years until February 1992.\n\nHe played the role of Robert Scorpio in the show whose 1981 wedding gained 30 million viewers setting the records for the highest-rated hour in American soap opera history.\n\nIn December 2010, Rogers made his comeback in the daytime television joining the cast of The Young and the Restless as Colin Atkinson. His role in the show ended in October 2011, though he signed the contract until February 2011.\n\nOn March 1, 2012, Rogers returned to General Hospital as Robert Scorpio after the character Anna Devane called him to tell him that their daughter Robin Scorpio-Drake was killed in a lab accident. He left the show after eight episodes.\n\nTristan Rogers' Net Worth\n\nAustralian born American actor Tristan Rogers has been active in the acting industry for over four decades and in this period, he has worked in a number of big hit movies and television series. As of 2019, his net worth is under review, however, considering his success and fame in the industry, his net worth can be estimated to range from $100k-$1 million.\n\nHe primarily earned from his time in the soap opera where he gave the most of his career time. Moreover, he also amassed a lucrative sum of money from sponsors and endorsements.\n\nTristan Rogers' Personal Life, Marriage, And Children\n\nTalking about Tristan Rogers' personal life, the 73-year-old actor is a happily married man; has been married to Teresa Parkerson since 21st May 1995. The couple is blessed with two children; daughter Sara Jane whom they welcomed on 25th August 1992, and son Cale Rogers (born: August 1996).\n\nPrior to marrying Teresa Parkerson, he was married to his first wife Barbara Meale whom he divorced in 1984 after a decade long married life.\n\nTristan Rogers' Height, Weight, And Other Body Stats\n\nHeight: Tristan Rogers stands 6 ft. 1 inch or 185 cm tall.\n\nTristan Rogers stands 6 ft. 1 inch or 185 cm tall. Age: Actor Tristan Rogers is 73 years old as of 2019.\n\nActor Tristan Rogers is 73 years old as of 2019. Nationality: Rogers is a naturalized American citizen.\n\nRogers is a naturalized American citizen. Ethnicity: He is white as per his ethnicity.\n\nFor more updates, stay tuned to FrostSnow."}, {"url": "https://www.famousdetails.com/tristan-rogers/", "page_content": "Tristan Rogers (Soap Opera Actor) was born on the 3rd of June, 1946. He was born in 1940s, in Baby Boomers Generation. His birth sign is Gemini and his life path number is 11. Tristan’s birth flower is Rose and birthstone is Pearl, Moonstone and Alexandrite. What does this all mean? Let’s find out!\n\nDiscover all the facts that no one tells you about Tristan Rogers below ↓\n\nNAME: Tristan Rogers REAL NAME: Tristan Rogers NICKNAME: Tristan PROFESSION: Soap Opera Actor GENDER: Male BIRTHPLACE: Melbourne, Australia ETHNICITY: White NATIONALITY: Australian RELIGION: Unknown SEXUALITY: Straight\n\n1. Bio\n\nTristan Rogers, best known for being a Soap Opera Actor, was born in Melbourne, Australia on Monday, June 3, 1946. Known for his portrayal of the American soap opera characters Robert Scorpio on General Hospital and Colin Atkinson on The Young and the Restless. He also appeared as the voice of Jake in the 1990 Disney animated film The Rescuers Down Under.\n\nFamily: He was born and raised in Melbourne, Australia. Tristan Rogers father’s name is under review and mother unknown at this time. We will continue to update details on Tristan Rogers’s family.\n\nFATHER: MOTHER: unknown at this time BROTHER(S): Not available SISTER(S): Not available\n\nEducation: The education details are not available at this time. Please check back soon for updates.\n\nDating: According to CelebsCouples, Tristan Rogers is married Teresa Parkerson.\n\nNet Worth: Online estimates of Tristan Rogers’s net worth vary. It’s easy to predict his income, but it’s much harder to know how much he has spent over the years. CelebsMoney and NetWorthStatus does a good job of breaking most of it down.\n\n2. Tristan Rogers’s zodiac sign is Gemini\n\nTristan Rogers zodiac sign is a Gemini. Dates of Gemini are May 21 - June 20. Those born under the Gemini zodiac sign enjoy socializing and love surrounding themselves with people. They enjoy chit-chat and tend to have expression and communication very high on their list of priorities. They are intelligent, adaptable, agile, communicative, informative, and connected. Although, they can be too talkative, exaggerating, deceptive, cunning, superficial, and inconsistent.\n\nZODIAC: Gemini BORN IN THE YEAR OF THE: Dog RULING PLANET: Mercury\n\n3. He is currently 77 years old\n\nThe Australian soap opera actor has been alive for 28,130 days or 675,126 hours. There were precisely 954 full moons after his birth to this day.\n\nBORN: June 3, 1946 AGE: 77 years old BORN ON: Monday GENERATION: Baby Boomers Generation DECADE: 1940s\n\nTristan Rogers was born on a Monday. People born on Mondays are motherly, sensitive, adaptive, and kind.\n\nCountdown to Tristan Rogers’s next birthday.\n\nTristan Rogers will be turning 78.\n\n4. On Tristan Rogers’s birthday\n\nThe world’s population was and there were an estimated year babies born throughout the world in 1946, Harry S. Truman (Democratic) was the president of the United States, and the number one song on Billboard 100 was [Not available]. No song matches found..\n\nOn this day in history:\n\n5. Tristan Rogers’s height and weight\n\nWe’re currently in process of confirming all details such as Tristan Rogers’s height, weight, and other stats. If there is any information missing, we will be updating this page soon. If you any have tips or corrections, please send them our way.\n\nHeight\n\nHEIGHT (FEET): N/A HEIGHT (METERS): N/A HEIGHT (INCHES) N/A HEIGHT (CM): N/A\n\nWeight\n\nBUILD Average WEIGHT (LBS): Under review WEIGHT (KG) Under review\n\nMisc\n\nEYE COLOR: Blue HAIR COLOR: Dark Brown\n\n6. The Year of the Dog\n\nTristan Rogers was born in the Year of the Dog. People with Chinese zodiac Dog are usually independent, sincere, loyal and decisive according to Chinese zodiac analysis. They are not afraid of difficulties in daily life. Their strengths are being valiant, loyal, responsible, clever, and courageous. But they can also be overly sensitive, conservative, stubborn, emotional. Their lucky numbers are 3, 4, 9 and lucky colors are green, red, purple.\n\n\n\n\n\n7. Tristan Rogers’s life path number is 11\n\n8. Baby Boomers Generation\n\nTristan Rogers was born in the middle of Baby Boomers Generation.\n\n9. Tristan Rogers’s birthstone is Pearl, Moonstone and Alexandrite\n\n10. Tristan Rogers’s birth flower is Rose\n\nIf you found this page interesting or useful, please share it. We will continue to update this page, so bookmark it and come back often to see new updates."}, {"url": "https://articlebio.com/tristan-rogers", "page_content": "Born and raised in Australia Tristan Rogers is an Australian-American actor who is best known as Robert Scorpio, his character on ABC soap opera General Hospital. Rogers is also known as a voice actor who voiced Jake in The Rescuers Down Under. Besides, he also worked in the films that included Four Dimensions of Greta, Jack Rio, Delgo among others.\n\nTristan Rogers' Early Life, Bio, And Early Career\n\nActor Tristan Rogers was born in Melbourne, Australia on 3rd June 1946. Details about his parents and siblings are not known. Tristan Rogers spent his childhood and teenage in his hometown Melbourne where he also started his early career in acting.\n\nHe worked in some minor roles on Australian television and soap opera before he relocated to the United States to flourish his acting career. His work in Australia included Number 96, Bellbird, and The Box. He also worked as a regular cast in the police drama series The Link Men that was shortlived for 13 episodes.\n\nTristan Rogers' Professional Career\n\nTristan Rogers emigrated to the United States in the late 70s and tried his luck in some minor roles before he got the break in the future superhit General Hospital. He worked as the Robert Scorpio on the soap opera until February 1992.\n\nThe 1981 episode of the show in which featured his character Scorpio's wedding ama s sed 30 million viewers which is the highest-rated hour in American soap opera history. He shared the screen with the actors like Anthony Geary, Jane Elliot, Finola Hughes, Maurice Benard, and Sean Kanan in General Hospital.\n\nCAPTION: Australian-American actor Tristan Rogers SOURCE: General Hospital Wikia - Fandom\n\nRogers remained out of the daytime television shows before making his comeback as Colin Atkinson in The Young and the Restless. He worked in the show until October 2011; though his contract with the show expired in February that year.\n\nRogers returned as Roberts Scorpio in General Hospital after Anna Devane, his wife in the show, called him to tell that their daughter Robin Scorpio-Drake was killed in a lab accident. He worked in the series for eight episodes.\n\nTristan Rogers' Net Worth\n\nThe famous Australian-American actor Tristan Rogers has earned a handsome sum of money from his acting career, which is the main source of his income and net worth. In his over 4-decade-long career, he has worked in multiple hit series and movies from which we can say he ama s sed a good amount of money.\n\nHis exact net worth is not revealed, however, it might range from $100k-$1 million as of 2019.\n\nTristan Rogers' Personal Life, Wife, And Children\n\nActor Rogers is 73 years old as of 2019, and he is a married man. He has been in a happily married life with wife Teresa Parkerson with whom he tied the knot on 21st May 1995. The lovebirds are blessed with two children; daughter Sara Jane; born 25th August 1992, and son Cale Rogers; born August 1996.\n\nBefore marrying Parkerson, Rogers was in a marital relationship with his first wife, Barbara Meale. The couple got married in 1974 and got divorced in 1984 without having any children.\n\nTristan Rogers' Height, Weight, And Body Stat\n\nHeight: Tristan Rogers' height is 6ft and 1 inch or 185 cm.\n\nTristan Rogers' height is 6ft and 1 inch or 185 cm. Age: Actor Tristan Rogers is 73 years old.\n\nFor more updates, stay tuned to ArticleBio."}, {"url": "https://www.celebsages.com/tristan-rogers/", "page_content": "Birth Name: Tristan Rogers Occupation: Soap Opera Actor Born In: Melbourne, Australia Birthdate: June 3, 1946 Age: 77 years old (as of 2023) Ethnicity: White Nationality: Australian Sexuality: Straight\n\nTristan Rogers was born on the 3rd of June, 1946. He is known for being a Soap Opera Actor. He worked alongside John Candy and Bob Newhart for the 1990 Disney animated film The Rescuers Down Under. Tristan Rogers’s age is 77. Known for his portrayal of the American soap opera characters Robert Scorpio on General Hospital and Colin Atkinson on The Young and the Restless. He also appeared as the voice of Jake in the 1990 Disney animated film The Rescuers Down Under. The 77-year-old soap opera actor was born in Melbourne, Australia. He began his acting career in 1974 by appearing across Australian TV. This lasted until 1980 when he was originally cast on General Hospital in the US. In 2010, he began starring on the web soap opera series The Bay as Lex Martin. In 2015, he lent his voice to the Mad Max video game release.\n\nCountdown to Tristan’s next birthday.\n\nTristan Rogers is a Gemini and his 78th birthday is in .\n\nJUMP TO: Tristan Rogers’s biography , facts , family , personal life , zodiac , videos , net worth , and popularity .\n\nChildhood\n\nTristan Rogers was born in 1940s. The early 1940s were dominated by World War II. Following the end of the war, it was the start of the Baby Boomer years and technology advancements such as the jet engine, nuclear fusion, radar, rocket technology and others later became the starting points for Space Exploration and Improved Air Travel. The 40s also brought us the Slinky, Velcro, Jeep, Tupperware and Frisbee. Discover what happened on this day.\n\nTristan Rogers is part of the Baby boomers generation. Also known as \"boomers\", are the result of the end of World War II, when birth rates across the world spiked. They are associated with a rejection of traditional values. These hippie kids protested against the Vietnam War and participated in the civil rights movement.\n\nYou can also find out who is Tristan Rogers dating now and celebrity dating histories at CelebsCouples.\n\nWhile we don't know Tristan Rogers birth time, but we do know his mother gave birth to his on a Monday. People born on a Monday tend to be a bit sensitive and emotional. They have imagination and don't like planning things in advance. They're flexible and good at improvising.\n\n[fetch instagram=”” display=”posts” ]\n\nThe 77-year-old Australian was born in the Baby Boomers Generation and the Year of the Dog\n\nEducation\n\nThe education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nTristan Rogers’s mother’s name is unknown at this time and his father’s name is under review. We will continue to update information on Tristan Rogers’s parents.\n\nPersonal Life\n\nLike many famous people and celebrities, Tristan Rogers keeps his personal life private. Once more details are available on who he is dating, we will update this section.\n\nFast Facts\n\nREAL NAME: Tristan Rogers NICKNAME: Tristan\n\nMARTIAL STATUS: Pending RELIGION: Unknown TATTOOS: N/A AGE GENERATION: Baby Boomers Generation BIRTH SIGN: Gemini BIRTH DAY: Monday DAYS SINCE BIRTH:\n\nNet Worth\n\nThe 77-year-old Australian soap opera actor has done well thus far. Majority of Tristan’s money comes from being a soap opera actor. CelebsMoney has recently updated Tristan Rogers’s net worth .\n\nVideos\n\nHoroscope\n\nZodiac Sign: Tristan Rogers is a Gemini. People of this zodiac sign like music, books, magazines, chatting, short trips and dislike being alone, repetition and routine. The strengths of this sign are being gentle, affectionate, curious, adaptable, able to learn quickly, while weaknesses can be nervous, inconsistent and indecisive. The greatest overall compatibility with Gemini is Sagittarius and Aquarius.\n\nChinese Zodiac: Tristan Rogers was born in the Year of the Rabbit. People born under this sign are fiercely loyal and can always keep a secret. They're not afraid of the hardships in life, but they also tend to worry too much sometimes.\n\n\n\n\n\nRuling Planet: Tristan Rogers has a ruling planet of Mercury and has a ruling planet of Mercury and by astrological associations Wednesday is ruled by Mercury. In Astrology, Mercury is the planet that rules our mindset. People who are born with Mercury as the ruling planet have communication skills, intellect and cleverness.\n\n[fetch instagram=”” display=”posts” show=”2″ ]\n\nTristan Rogers’s birth sign is Gemini and he has a ruling planet of Mercury.\n\nDon’t miss\n\n– Who’s the richest Soap Opera Actor in the world?\n\n– Tristan Rogers Net Worth Stats\n\n– When is Tristan Rogers’s birthday?\n\nAssociated with\n\nFans also viewed"}, {"url": "https://celebritymanual.com/19213/", "page_content": "Tristan Rogers is a very famous star. He was born in Melbourne, Victoria, Australia. He is 76 years old(Gemini), 6′ 1″ (1.85 m) tall. Tristan Rogers’s profession is: Writer、Actor. He has many lovers. their names are: Barbara Meale (7 June 1974- 1984) (divorced)、Teresa Parkerson(21 May 1995- present) (2 children). Tristan Rogers first acted in a movie Delta. If you want to follow the latest news about Tristan Rogers, you can go to Blackwaterentertainment、Myspace to follow him. Here, let’s get to know the basic information about Tristan Rogers!\n\nTristan Rogers Personal Details\n\nName Tristan Rogers Nickname Not Known Profession Writer、Actor Height 6′ 1″ (1.85 m) Born June 3,1946in Melbourne, Victoria, Australia Born Address Melbourne, Victoria, Australia Spouse Barbara Meale (7 June 1974- 1984) (divorced)、Teresa Parkerson(21 May 1995- present) (2 children) Children Not Known Relatives Not Known Parents Not Known Star Sign Gemini\n\nTristan Rogers Biography\n\nTristan Rogers was born on June 3, 1946 in Melbourne, Victoria, Australia. He is an actor and writer, known for General Hospital (1963), The Rescuers Down Under (1990) and Studio City (2019). He has been married to Teresa Parkerson since May 21, 1995. They have two children. He was previously married to Barbara Meale.\n\nTristan Rogers Trivia\n\nHas done voice-over work representing the Outback Steakhouse restaurant chain, Foster’s Lager, Reebok, Epson and others.\n\nWas the first Australian actor to gain popularity using his native Australian accent. Tristan’s rapid rise in popularity is considered the genesis of American fascination with all things Australia.\n\nChildren: Sara Jane (August 15, 1992) Cale (August 1996).\n\nHe was arrested and convicted for impaired driving in 1993. He received 3 years probation. It was his second conviction.\n\nIs a naturalized US citizen.\n\nTristan Rogers Social Media Profile(s)"}, {"url": "https://www.howold.co/person/tristan-rogers", "page_content": "Tristan Rogers Australian actor\n\nTristan Rogers is a 77 years old Australian actor from Melbourne, Victoria. He was born on June 03, 1946 in Melbourne, Victoria.\n\nAbout\n\nBiography\n\nTristan Rogers is an Australian American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney's The Rescuers Down Under. Early acting roles were on Australian television and he completed short stints in soap operas Bellbird Number 96 and The Box.\n\nRead full biography\n\nYes, Tristan Rogers is still alive Last check: 2 years ago\n\nWorks\n\nTristan Rogers Movies (7)\n\nThere are 7 movies of Tristan Rogers.\n\nHis first feature film was The Rescuers Down Under (1990, as Jake (voice)). He was 44 when he starred in this movie. Since 1990, he has appeared in 7 feature films. The last one is Soulmates (1992). In this movie, we watched him in the Richard Wayborn character .\n\nTristan Rogers movie characters\n\nView all Tristan Rogers movies\n\nThe names of the characters/jobs in the films he starred in are as follows:\n\nTristan Rogers TV Shows (13)\n\nHis first TV Show was The Link Men (1970).\n\nView all Tristan Rogers TV shows\n\nTristan Rogers zodiac sign is gemini.\n\nWhen is Rogers's next birthday?\n\nTristan Rogers was born on the 3rd of June 1946 , which was a Monday. He will be turning 78 in only 360 days from today (09 June, 2023).\n\nOther facts about Tristan Rogers"}, {"url": "https://www.wikiwand.com/en/Tristan_Rogers", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Tristan Rogers?\n\nSummarize this article for a 10 years old"}], "Tristan Rogers is an actor.": [{"url": "https://factsbuddy.com/tristan-rogers/", "page_content": "Tristan Rogers Bio | Wiki\n\nTristan Rogers is an Australian-American voiceover artist and actor known for his role on the ABC soap opera, General Hospital as Robert Scorpio. He has also been a cast member of The Rescuers Down Under (1990) and Studio City (2019).\n\nTristan Rogers Age\n\nHe was born in Melbourne, Victoria, in Australia on June 3, 1946. Rogers is 76 years old.\n\nTristan Rogers Height\n\nHe is a man of above-average stature. Rogers’ height is 6 ft 1 in ( approx. 1.85m ).\n\nTristan Rogers Family\n\nHe is a local of Melbourne, Victoria, in Australia. Rogers was raised by his parents in Australia. However, he relocated to the USA after purchasing a house in Palm Springs, California in 1997. Furthermore, his mother passed on in April 2017. However, Rogers has not shared much about his family with the public domain including the identity of his parents or whether he has any siblings.\n\nTristan Rogers Wife | Married\n\nHe got married to his wife Teresa Parkerson on May 21, 1995. Rogers and his wife are proud parents of two children, Sara Jane born in August 1992, and a son by the name of Cale born in August 1996. However, this is not the first time that Rogers has been in a marriage union. He was previously married to his first wife, Barbara Meale between 1974 to 1984. Furthermore, his ex-wife is a well-renowned actress known for her role in Out of Love (1974) and Homicide (1964).\n\nTristan Rogers Education\n\nDespite being a well-renowned veteran actor, Rogers has withheld his academic qualifications from the public eye due to his secretive character.\n\nTristan Rogers Emma Samms\n\nBoth Rogers and Emma Samms have been the cast members of the General Hospital television series on ABC. Emma is an English actress and TV host who is known for her role in the Dynasty soap opera as Fallon Carrington Colby. After Rogers divorced his first wife Barbara Meale in 1984, he got into a brief relationship with Emma. However, the relationship ended shortly after Emma made her exit from General Hospital.\n\nTristan Rogers General Hospital\n\nHe plays the role of Robert Scorpio in the General Hospital Tv series on ABC. Apart from casting a role in the General hospital, Rogers has also been a cast member of The Young and the Restless, Four Dimensions of Greta (1972), Sex Farm (1973), Soulmates (1992), A Piece of Eden (2000), Jack Rio (2008), The Los Angeles Ripper (2011) Raven (2010), Delgo (2008), The Flesh and Blood Show (1972), Night Eyes 3 (1993), Delgo (2008), The Rescuers Down Under (1990), etc.\n\nTristan Rogers Health\n\nHe has been a professional actor for at least four decades. During his career as an actor, Rogers has not shared any details concerning his health or whether he has any health-related issues. However, in November 2016, he flew to Canada to check on the health of his mother. Unfortunately, Rogers’ mother passed on in April 2017. Additionally, he shared the news of his mother’s demise through a tweet.\n\nTristan Rogers Net Worth\n\nRogers’ net worth is $8 million. He has been an actor who has landed lucrative deals in the acting industry for more than four decades. Therefore, it goes undisputed that Rogers has been able to accumulate a decent fortune over the years.\n\nHow Old Is Tristan Rogers\n\nHe is 76 years old. Rogers was born in Melbourne, Victoria, Australia on June 3, 1946.\n\nIs Tristan Rogers Married\n\nYes, he has been married to his beautiful wife Teresa Parkerson since May 1995. Furthermore, Rogers and his wife share two all-grown-up children, Cale and Sara Jane. However, Rogers was previously married to actress Barbara Maele between 1974 to 1984.\n\nWho Is Tristan Rogers\n\nHe is an Australian-American actor known for his role in the Young and Restless as well as General Hospital. Rogers has also been a cast member of Studio City (2019) and he Rescuers Down Under (1990)."}, {"url": "https://www.tvinsider.com/people/tristan-rogers/", "page_content": "Actor\n\nBirth Date: June 3, 1946\n\nAge: 77 years old\n\nBirth Place: Melbourne, Victoria, Australia\n\nIn 1980, Australian actor Tristan Rogers landed a small role on what was then the most popular soap opera in the world, \"General Hospital,\" (ABC, 1963- ), having no idea he would become the first of many hunky Australian exports to set American hearts aflutter. Playing Robert Scorpio, a sophisticated and savvy operative for the World Security Bureau, Rogers was teamed up with the most famous couple in the world at that time -\"GH\" lovers Luke and Laura - to help save the world from being frozen solid. He went on to become one of the soap world's most iconic actors, even long after he had left the show and moved on to other endeavors."}, {"url": "https://articlebio.com/tristan-rogers", "page_content": "Born and raised in Australia Tristan Rogers is an Australian-American actor who is best known as Robert Scorpio, his character on ABC soap opera General Hospital. Rogers is also known as a voice actor who voiced Jake in The Rescuers Down Under. Besides, he also worked in the films that included Four Dimensions of Greta, Jack Rio, Delgo among others.\n\nTristan Rogers' Early Life, Bio, And Early Career\n\nActor Tristan Rogers was born in Melbourne, Australia on 3rd June 1946. Details about his parents and siblings are not known. Tristan Rogers spent his childhood and teenage in his hometown Melbourne where he also started his early career in acting.\n\nHe worked in some minor roles on Australian television and soap opera before he relocated to the United States to flourish his acting career. His work in Australia included Number 96, Bellbird, and The Box. He also worked as a regular cast in the police drama series The Link Men that was shortlived for 13 episodes.\n\nTristan Rogers' Professional Career\n\nTristan Rogers emigrated to the United States in the late 70s and tried his luck in some minor roles before he got the break in the future superhit General Hospital. He worked as the Robert Scorpio on the soap opera until February 1992.\n\nThe 1981 episode of the show in which featured his character Scorpio's wedding ama s sed 30 million viewers which is the highest-rated hour in American soap opera history. He shared the screen with the actors like Anthony Geary, Jane Elliot, Finola Hughes, Maurice Benard, and Sean Kanan in General Hospital.\n\nCAPTION: Australian-American actor Tristan Rogers SOURCE: General Hospital Wikia - Fandom\n\nRogers remained out of the daytime television shows before making his comeback as Colin Atkinson in The Young and the Restless. He worked in the show until October 2011; though his contract with the show expired in February that year.\n\nRogers returned as Roberts Scorpio in General Hospital after Anna Devane, his wife in the show, called him to tell that their daughter Robin Scorpio-Drake was killed in a lab accident. He worked in the series for eight episodes.\n\nTristan Rogers' Net Worth\n\nThe famous Australian-American actor Tristan Rogers has earned a handsome sum of money from his acting career, which is the main source of his income and net worth. In his over 4-decade-long career, he has worked in multiple hit series and movies from which we can say he ama s sed a good amount of money.\n\nHis exact net worth is not revealed, however, it might range from $100k-$1 million as of 2019.\n\nTristan Rogers' Personal Life, Wife, And Children\n\nActor Rogers is 73 years old as of 2019, and he is a married man. He has been in a happily married life with wife Teresa Parkerson with whom he tied the knot on 21st May 1995. The lovebirds are blessed with two children; daughter Sara Jane; born 25th August 1992, and son Cale Rogers; born August 1996.\n\nBefore marrying Parkerson, Rogers was in a marital relationship with his first wife, Barbara Meale. The couple got married in 1974 and got divorced in 1984 without having any children.\n\nTristan Rogers' Height, Weight, And Body Stat\n\nHeight: Tristan Rogers' height is 6ft and 1 inch or 185 cm.\n\nTristan Rogers' height is 6ft and 1 inch or 185 cm. Age: Actor Tristan Rogers is 73 years old.\n\nFor more updates, stay tuned to ArticleBio."}, {"url": "https://famousstardom.com/tristan-rogers", "page_content": "Tristan Rogers is an Australian-American actor, best-known for his role as Robert Scorpio on ABC soap opera General Hospital. He is also popular for voicing Jake in The Rescuers Down Under. Rogers' film credits include Four Dimensions of Greta, Delgo, and Jack Rio among others.\n\nEarly Life And Early Career Of Tristan Rogers\n\nTristan Rogers was born on 3rd June 1946 in Melbourne, Australia. Information about his parents and early childhood is not known to the date. He spent his time in his hometown Melbourne before he moved to the USA to pursue an acting career.\n\nHe was interested in acting from an early age and worked in some minor roles on Australian television and soap operas that include Bellbird, Number 96 and The Box. Later, he was cast regular in the police drama series The Link Men that only lasted for 13 episodes in the '70s.\n\nTristan Rogers' Professional Career\n\nTristan Rogers moved to the USA in the late 70s and got his career breakthrough there in 1980 when he was cast on General Hospital. He worked on the soap opera for 11 long years until February 1992.\n\nHe played the role of Robert Scorpio in the show whose 1981 wedding gained 30 million viewers setting the records for the highest-rated hour in American soap opera history.\n\nIn December 2010, Rogers made his comeback in the daytime television joining the cast of The Young and the Restless as Colin Atkinson. His role in the show ended in October 2011, though he signed the contract until February 2011.\n\nOn March 1, 2012, Rogers returned to General Hospital as Robert Scorpio after the character Anna Devane called him to tell him that their daughter Robin Scorpio-Drake was killed in a lab accident. He left the show after eight episodes.\n\nTristan Rogers' Net Worth\n\nAustralian born American actor Tristan Rogers has been active in the acting industry for over four decades and in this period, he has worked in a number of big hit movies and television series. As of 2019, his net worth is under review, however, considering his success and fame in the industry, his net worth can be estimated to range from $100k-$1 million.\n\nHe primarily earned from his time in the soap opera where he gave the most of his career time. Moreover, he also amassed a lucrative sum of money from sponsors and endorsements.\n\nTristan Rogers' Personal Life, Marriage, And Children\n\nTalking about Tristan Rogers' personal life, the 73-year-old actor is a happily married man; has been married to Teresa Parkerson since 21st May 1995. The couple is blessed with two children; daughter Sara Jane whom they welcomed on 25th August 1992, and son Cale Rogers (born: August 1996).\n\nPrior to marrying Teresa Parkerson, he was married to his first wife Barbara Meale whom he divorced in 1984 after a decade long married life.\n\nTristan Rogers' Height, Weight, And Other Body Stats\n\nHeight: Tristan Rogers stands 6 ft. 1 inch or 185 cm tall.\n\nTristan Rogers stands 6 ft. 1 inch or 185 cm tall. Age: Actor Tristan Rogers is 73 years old as of 2019.\n\nActor Tristan Rogers is 73 years old as of 2019. Nationality: Rogers is a naturalized American citizen.\n\nRogers is a naturalized American citizen. Ethnicity: He is white as per his ethnicity.\n\nFor more updates, stay tuned to FrostSnow."}, {"url": "https://www.celebsagewiki.com/tristan-rogers", "page_content": "Age, Biography and Wiki\n\nTristan Rogers was born on 3 June, 1946 in Melbourne, Victoria, Australia, is an Actor, Writer. Discover Tristan Rogers's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 75 years old?\n\nPopular As N/A Occupation actor,writer Age 77 years old Zodiac Sign Gemini Born 3 June 1946 Birthday 3 June Birthplace Melbourne, Victoria, Australia Nationality Australia\n\nWe recommend you to check the complete list of Famous People born on 3 June. He is a member of famous Actor with the age 77 years old group.\n\nTristan Rogers Height, Weight & Measurements\n\nAt 77 years old, Tristan Rogers height is 6' 1\" (1.85 m) .\n\nPhysical Status Height 6' 1\" (1.85 m) Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Tristan Rogers's Wife?\n\nHis wife is Teresa Parkerson (21 May 1995 - present) ( 2 children), Barbara Meale (7 June 1974 - 1984) ( divorced)\n\nFamily Parents Not Available Wife Teresa Parkerson (21 May 1995 - present) ( 2 children), Barbara Meale (7 June 1974 - 1984) ( divorced) Sibling Not Available Children Not Available\n\nTristan Rogers Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Tristan Rogers worth at the age of 77 years old? Tristan Rogers’s income source is mostly from being a successful Actor. He is from Australia. We have estimated Tristan Rogers's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nTristan Rogers Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.thegaltonagency.com/client/tristan-rogers/", "page_content": "Tristan is an actor, writer and comedian.\n\nAs an actor he most recently appeared in Ant and Dec’s Men in Brown, alongside Hugh Bonneville and Richard Ayoade. Tristan has also appeared in numerous recent commercials.\n\nTristan started writing and performing comedy as a member of sketch group The Jest. With The Jest, Tristan has featured on BBC Radio 4’s Sketchorama and Sketchorama Extra, and won the Leicester Square Theatre ‘Sketch Off’ Competition in 2016.\n\nHe has also worked professionally as a voiceover artist for the past six years lending his vocal talents to numerous campaigns, including Lexus, Google and Deloitte.\n\nAs a writer, Tristan collaborated with Bryony Twydle to co-write her character comedy show Flamingo, which was performed at Underbelly at the 2018 Edinburgh Fringe. Flamingo received a host of four-star reviews and went on to tour nationwide.\n\nTristan also co-wrote and performed in the two-hand short play Glass, which was performed at the Royal Court Theatre in 2019 as part of Angry Bear Scratches, and in 2020 he co-created the award-winning Detective Society series of games, serving as lead writer for three seasons.\n\nTristan trained at East 15 Drama School."}, {"url": "https://www.famousbirthdays.com/people/tristan-rogers.html", "page_content": "About\n\nKnown for his portrayal of the American soap opera characters Robert Scorpio on General Hospital and Colin Atkinson on The Young and the Restless. He also appeared as the voice of Jake in the 1990 Disney animated film The Rescuers Down Under.\n\nBefore Fame\n\nHe began his acting career in 1974 by appearing across Australian TV. This lasted until 1980 when he was originally cast on General Hospital in the US.\n\nTrivia\n\nIn 2010, he began starring on the web soap opera series The Bay as Lex Martin. In 2015, he lent his voice to the Mad Max video game release.\n\nFamily Life\n\nHe was born and raised in Melbourne, Australia.\n\nAssociated With\n\nHe worked alongside John Candy and Bob Newhart for the 1990 Disney animated film The Rescuers Down Under."}, {"url": "https://www.rottentomatoes.com/celebrity/tristan_rogers", "page_content": "Highest Rated: 71% The Rescuers Down Under (1990)\n\nLowest Rated: 71% The Rescuers Down Under (1990)\n\nBirthday: Jun 3, 1946\n\nBirthplace: Melbourne, Victoria, Australia\n\nIn 1980, Australian actor Tristan Rogers landed a small role on what was then the most popular soap opera in the world, \"General Hospital,\" (ABC, 1963- ), having no idea he would become the first of many hunky Australian exports to set American hearts aflutter. Playing Robert Scorpio, a sophisticated and savvy operative for the World Security Bureau, Rogers was teamed up with the most famous couple in the world at that time -\"GH\" lovers Luke and Laura - to help save the world from being frozen solid. He went on to become one of the soap world's most iconic actors, even long after he had left the show and moved on to other endeavors."}, {"url": "https://www.wikiwand.com/en/Tristan_Rogers", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Tristan Rogers?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.howold.co/person/tristan-rogers", "page_content": "Tristan Rogers Australian actor\n\nTristan Rogers is a 77 years old Australian actor from Melbourne, Victoria. He was born on June 03, 1946 in Melbourne, Victoria.\n\nAbout\n\nBiography\n\nTristan Rogers is an Australian American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney's The Rescuers Down Under. Early acting roles were on Australian television and he completed short stints in soap operas Bellbird Number 96 and The Box.\n\nRead full biography\n\nYes, Tristan Rogers is still alive Last check: 2 years ago\n\nWorks\n\nTristan Rogers Movies (7)\n\nThere are 7 movies of Tristan Rogers.\n\nHis first feature film was The Rescuers Down Under (1990, as Jake (voice)). He was 44 when he starred in this movie. Since 1990, he has appeared in 7 feature films. The last one is Soulmates (1992). In this movie, we watched him in the Richard Wayborn character .\n\nTristan Rogers movie characters\n\nView all Tristan Rogers movies\n\nThe names of the characters/jobs in the films he starred in are as follows:\n\nTristan Rogers TV Shows (13)\n\nHis first TV Show was The Link Men (1970).\n\nView all Tristan Rogers TV shows\n\nTristan Rogers zodiac sign is gemini.\n\nWhen is Rogers's next birthday?\n\nTristan Rogers was born on the 3rd of June 1946 , which was a Monday. He will be turning 78 in only 360 days from today (09 June, 2023).\n\nOther facts about Tristan Rogers"}]}