{"Tristan Rogers appeared in the Australian television series Homicide.": [{"url": "https://www.nfsa.gov.au/latest/homicide-turns-50", "page_content": "Fifty years ago, Melbourne television screens tuned in to the first episode of a new locally made production, Australia’s first police drama series.\n\nhttps://www.nfsa.gov.au/sites/default/files/uploads/2014/10/10/Homicide_turns_50.jpg Homicide celebrates its fifth birthday in 1969\n\nHomicide , first telecast by HSV7 Melbourne on 20 October 1964, profiled murder cases handled by the fictional detectives of Victoria Police Headquarters’ homicide squad."}, {"url": "https://www.nfsa.gov.au/latest/ten-things-you-didnt-know-about-homicide", "page_content": "https://www.nfsa.gov.au/sites/default/files/02-2017/john_stanton_1253511_0012_001_700_dpi.jpg John Stanton as Senior Detective Pat Kelly. From episode 390, Thommo (1973). NFSA title: 1253511\n\n3. Nearly all the actors cast as featured detectives in later series had appeared in earlier Homicide episodes, usually in non-police roles unrelated to their future characters. For example, John Stanton (left) appeared in six earlier episodes playing separate characters before his debut as Sen. Det. Pat Kelly in episode 384, The Kooranda Killing .\n\n4. Rugged Geelong defender in the Victorian Football League (VFL), and later coach of the Cats, John Devine guest appeared as himself in episode 53, Holiday Affair .\n\n5. Australian music identity Ian 'Molly’ Meldrum has a non-speaking role as a party guest who ejects an unruly invitee in episode 66, Flashback , filmed in 1966. Many local singers made guest acting appearances including Bobby Bright, Buddy England, Tony Shepp, Mike Brady and Jon English.\n\n6. By 1970, nearly three million people nationally were watching each week.\n\nThe show was also sold abroad to the United Kingdom, Canada and parts of Africa (including Kenya, Zambia and, unbeknownst to Crawfords, Rhodesia!)."}, {"url": "https://factsbuddy.com/tristan-rogers/", "page_content": "Tristan Rogers Bio | Wiki\n\nTristan Rogers is an Australian-American voiceover artist and actor known for his role on the ABC soap opera, General Hospital as Robert Scorpio. He has also been a cast member of The Rescuers Down Under (1990) and Studio City (2019).\n\nTristan Rogers Age\n\nHe was born in Melbourne, Victoria, in Australia on June 3, 1946. Rogers is 76 years old.\n\nTristan Rogers Height\n\nHe is a man of above-average stature. Rogers’ height is 6 ft 1 in ( approx. 1.85m ).\n\nTristan Rogers Family\n\nHe is a local of Melbourne, Victoria, in Australia. Rogers was raised by his parents in Australia. However, he relocated to the USA after purchasing a house in Palm Springs, California in 1997. Furthermore, his mother passed on in April 2017. However, Rogers has not shared much about his family with the public domain including the identity of his parents or whether he has any siblings.\n\nTristan Rogers Wife | Married\n\nHe got married to his wife Teresa Parkerson on May 21, 1995. Rogers and his wife are proud parents of two children, Sara Jane born in August 1992, and a son by the name of Cale born in August 1996. However, this is not the first time that Rogers has been in a marriage union. He was previously married to his first wife, Barbara Meale between 1974 to 1984. Furthermore, his ex-wife is a well-renowned actress known for her role in Out of Love (1974) and Homicide (1964).\n\nTristan Rogers Education\n\nDespite being a well-renowned veteran actor, Rogers has withheld his academic qualifications from the public eye due to his secretive character.\n\nTristan Rogers Emma Samms\n\nBoth Rogers and Emma Samms have been the cast members of the General Hospital television series on ABC. Emma is an English actress and TV host who is known for her role in the Dynasty soap opera as Fallon Carrington Colby. After Rogers divorced his first wife Barbara Meale in 1984, he got into a brief relationship with Emma. However, the relationship ended shortly after Emma made her exit from General Hospital.\n\nTristan Rogers General Hospital\n\nHe plays the role of Robert Scorpio in the General Hospital Tv series on ABC. Apart from casting a role in the General hospital, Rogers has also been a cast member of The Young and the Restless, Four Dimensions of Greta (1972), Sex Farm (1973), Soulmates (1992), A Piece of Eden (2000), Jack Rio (2008), The Los Angeles Ripper (2011) Raven (2010), Delgo (2008), The Flesh and Blood Show (1972), Night Eyes 3 (1993), Delgo (2008), The Rescuers Down Under (1990), etc.\n\nTristan Rogers Health\n\nHe has been a professional actor for at least four decades. During his career as an actor, Rogers has not shared any details concerning his health or whether he has any health-related issues. However, in November 2016, he flew to Canada to check on the health of his mother. Unfortunately, Rogers’ mother passed on in April 2017. Additionally, he shared the news of his mother’s demise through a tweet.\n\nTristan Rogers Net Worth\n\nRogers’ net worth is $8 million. He has been an actor who has landed lucrative deals in the acting industry for more than four decades. Therefore, it goes undisputed that Rogers has been able to accumulate a decent fortune over the years.\n\nHow Old Is Tristan Rogers\n\nHe is 76 years old. Rogers was born in Melbourne, Victoria, Australia on June 3, 1946.\n\nIs Tristan Rogers Married\n\nYes, he has been married to his beautiful wife Teresa Parkerson since May 1995. Furthermore, Rogers and his wife share two all-grown-up children, Cale and Sara Jane. However, Rogers was previously married to actress Barbara Maele between 1974 to 1984.\n\nWho Is Tristan Rogers\n\nHe is an Australian-American actor known for his role in the Young and Restless as well as General Hospital. Rogers has also been a cast member of Studio City (2019) and he Rescuers Down Under (1990)."}, {"url": "https://nostalgiacentral.com/television/tv-by-decade/tv-shows-1960s/homicide/", "page_content": "1 9 6 4 – 1 9 7 5 (Australia)\n\n509 x 60 minute episodes\n\nHomicide was launched on the Australian Seven network on 20 October 1964.\n\nA series about the homicide squad of the Victorian police force – based at Melbourne’s Russell Street police headquarters – and their various cases, Homicide became the most successful drama series produced for Australian television.\n\nThe series ran for eleven years and sixteen different actors played members of the homicide squad at different times. Homicide also ushered in a new look for Australian television.\n\nIt presented audiences with a different, more factual view of Australia than anything previously released.\n\n“The recipe for success was, there must be a body, two or more suspects and plenty of clues,” said Monte Miller – one of many scriptwriters who worked on the show.\n\nThe proof was in the pudding. The hatted heroes of Homicide were arresting enough (sorry) to make this the first locally made drama to rate in the Australian TV Top Ten.\n\nCrawfords (who produced this show and a number of other Australian police dramas) had developed a close relationship with the Victoria Police while producing radio serials, and this relationship continued with Homicide.\n\nReal policemen were, in fact, seconded to the production company as technical consultants, and Victoria Police sponsored the programme for the first year as a public relations exercise.\n\nThe original cast included Jack Fegan as Inspector Connolly, Terry McDermott as Detective Sergeant Bronson, and Lex Mitchell as Detective Fraser.\n\nLater, when the show was at its peak, the top cops were Alwyn Kurts as Inspector Fox, Leonard Teale as Detective Sergeant Mackay, Norman Yemm as Senior Constable Patterson and George Mallaby as Detective Barnes.\n\nHeading up the final Homicide team was Charles ‘Bud’ Tingwell, Gary Day, Don Barker and Dennis Grosvenor.\n\nWith limited budgets (compared to the American cop shows they were up against) many of the actors performed most of their own stunts.\n\nTerry McDermott – who played Detective Sergeant Frank Bronson from 1964 to 1966 – recalled some instances while filming around Melbourne: “Once we were filming around the old Nylex sign on the corner of Punt Road and the freeway, and we had to climb right out on the scaffolding to bring back a boy who was threatening to commit suicide. It looked dangerous – that’s because it was dangerous!”\n\nThe location shooting made the series very good to look at, though, typically with small-time crooks being pursued by the boys in blue, down grotty back streets and alleyways with the griminess of the setting echoing the griminess of the crime.\n\nMcDermott again: “We once did a boat chasing sequence and, of course, we didn’t have a boat. We were lucky enough to come across some people who were water skiing and they let us borrow their boat. We used it for most of the day, and they were really good sports”.\n\nThe evolution of Homicide’s production values over its 12 years reflects the development of Australian television. It went from black-and-white to colour and limited sound to full sound.\n\nAlthough, in a move that wasn’t typical of all series at the time, Homicide shifted to an all-film production when it changed to colour, apparently due to a delay in Seven’s colour video facilities being ready.\n\nDetective Fraser\n\nLex Mitchell\n\nDS Frank Bronson\n\nTerry McDermott\n\nInspector Connolly\n\nJack Fegan\n\nSnr Detective Mackay\n\nLeonard Teale\n\nDetective Hudson\n\nLes Dayman\n\nInspector Colin Fox\n\nAlwyn Kurts\n\nSnr Detective Barnes\n\nGeorge Mallaby\n\nDetective Patterson\n\nNorman Yemm\n\nDetective Radford\n\nGary Day\n\nInspector Lawson\n\nCharles Tingwell\n\nSgt White\n\nDon Barker"}, {"url": "https://666how.com/how-old-is-tristan-rogers/", "page_content": "Tristan Rogers is an actor best known for his role as Robert Scorpio on the ABC soap opera General Hospital. He was born on June 4, 1946 in Melbourne, Australia. Rogers began his acting career in 1968 with a role in the Australian television series Homicide. He later appeared in other Australian shows such as Division 4, The Sullivans, and Skyways. In 1981, Rogers moved to the United States to pursue his acting career. He landed a role on the NBC soap opera Texas and later joined the cast of General Hospital. He has been playing the role of Robert Scorpio since 1985. In addition to his work on General Hospital, Rogers has also appeared in episodes of Magnum P.I., The Love Boat, Murder, She Wrote, and Charmed.\n\nRogers has been married three times. His first marriage was to Vera Zorina from 1968-1975. He was married to Michele Lee from 1976-1983. His current wife is Jill St. John, whom he married in 1987. Rogers has three children: two sons named Dylan and Ryan and a daughter named Samantha.\n\nIn his spare time, Rogers enjoys golfing and skiing.\n\nHow old is Tristan Rogers\n\nTristan Rogers is an actor who is best known for his roles on the soap operas General Hospital and The Young and the Restless. He was born on June 4, 1946 in Melbourne, Australia. Tristan is currently 74 years old.\n\nTristan Rogers began his acting career in the early 1970s. He appeared in various Australian television series and movies. In 1975, he moved to the United States to pursue his acting career. Tristan has appeared in many American television series and movies over the past four decades.\n\nSome of Tristan Rogers’ most famous roles have been on the soap operas General Hospital and The Young and the Restless. He has played the role of Robert Scorpio on General Hospital since 1980. Tristan also played the role of Colin Atkinson on The Young and the Restless from 1991-1993.\n\nIn addition to his work on soap operas, Tristan Rogers has also had roles on primetime television shows such as Magnum P.I., The Love Boat, and Murder, She Wrote. He has also appeared in movies such as Star Trek: The Motion Picture and Batman Forever.\n\nTristan Rogers is a veteran actor with a long and successful career. He is currently 74 years old and still going strong.\n\nWhen was Tristan Rogers born\n\nTristan Rogers was born on October 16, 1946 in Melbourne, Australia. He is an Australian actor best known for his roles on the soap operas General Hospital and The Young and the Restless. Rogers has appeared in numerous television shows and films throughout his career.\n\nWhat is Tristan Rogers’ birth date\n\nTristan Rogers was born on October 3, 1946. He is an Australian actor. He is best known for his roles in the soap operas General Hospital and The Young and the Restless.\n\nWhere was Tristan Rogers born\n\nTristan Rogers was born in Australia.\n\nWho are Tristan Rogers’ parents\n\nTristan Rogers’ parents are Jean and Tony Rogers. They divorced when he was young, and he was raised by his mother in Australia. His father is a British actor who is best known for his roles in the television series “Allo ‘Allo!” and “The Bill.”\n\nWhat is Tristan Rogers’ ethnicity\n\nTristan Rogers is an Australian actor who is best known for his roles in Home and Away and Neighbours. He was born in 1966 in Sydney, Australia to English parents. His father was an actor and his mother was a model. He has two sisters, one of whom is also an actor. Tristan Rogers’ ethnicity is English.\n\nWhat is Tristan Rogers’ nationality\n\nTristan Rogers is an Australian actor who is best known for his role as Robert Scorpio on the ABC soap opera General Hospital. Rogers was born in Melbourne, Australia and raised in Sydney. He began his acting career in the 1970s with roles on Australian television shows such as The Sullivans and Number 96. In 1981, Rogers moved to the United States to pursue his acting career. He has appeared in numerous American television shows, including Cheers, Magnum P.I., and The Young and the Restless. In addition to his work on television, Rogers has also appeared in several films, including The Man from Snowy River and Crocodile Dundee II.\n\nWhat languages does Tristan Rogers speak\n\nTristan Rogers speaks several languages fluently, including English, Spanish, French, Italian, and Portuguese. He also has some knowledge of German, Russian, and Chinese. In addition to his native language of Australian English, Rogers is also a proficient speaker of American English.\n\nHow tall is Tristan Rogers\n\nThere is no definitive answer to this question, as Tristan Rogers’ height can vary depending on a number of factors, such as his shoes, whether or not he is standing on something, etc. However, based on various estimates, it is believed that Tristan Rogers is approximately 6’0″ tall.\n\nWhat is Tristan Rogers’ eye color\n\nTristan Rogers is an actor with blue eyes."}, {"url": "http://www.australiantelevision.net/homicide.html", "page_content": "Home Produced by Crawford Productions and Seven Network\n\n\n\nCreated by: Hector and Dorothy Crawford\n\nProducers: Ian Crawford, Paul Eddy, Paul Karo, Nigel Lovell, David Stevens, Igor Auzins & Don Battye\n\n\n\nAired: October 1964–June 1976\n\n\n\n\"Homicide was one of the first drama series produced in Australia, and one of its most historically significant and successful. First broadcast in 1964, Homicide ran for 509 episodes until production ceased in 1975, establishing the police drama as a staple of Australian-made TV in the 1960s and 1970s, and revealing an enthusiasm among Australian TV viewers for local programming, of which there had been very little prior to the success of Homicide.\" - Terry Flew Produced by Crawford Productions and Seven NetworkHector and Dorothy CrawfordIan Crawford, Paul Eddy, Paul Karo, Nigel Lovell, David Stevens, Igor Auzins & Don BattyeOctober 1964–June 1976\"Homicide was one of the first drama series produced in Australia, and one of its most historically significant and successful. First broadcast in 1964, Homicide ran for 509 episodes until production ceased in 1975, establishing the police drama as a staple of Australian-made TV in the 1960s and 1970s, and revealing an enthusiasm among Australian TV viewers for local programming, of which there had been very little prior to the success of Homicide.\" - Terry Flew Starring as appeared in Lex Mitchell Detective Rex Fraser eps 1-27 John Fegan Inspector Jack Connolly eps 1-204 Terry McDermott Detective Sergeant Frank Bronson eps 1-58 Leonard Teale Detective Sergeant David MacKay eps 27-383, 509 Leslie Dayman Detective Bill Hudson eps 58-161 George Mallaby Detective Peter Barnes eps 131-395 Lionel Long Detective Bert Costello eps 162-210 Alwyn Kurts Inspector Colin Fox eps 180, 201-383 Norman Yemm Detective Jim Patterson eps 211-375 Mike Preston Detective Bob Delaney eps 334-375 Gary Day Detective Phil Radford eps 376-509 Charles Tingwell Inspector Reg Lawson eps 384-509 John Stanton Detective Pat Kelly eps 384-432 Don Barker Detective Harry White eps 396-509 Dennis Grosvenor Detective Mike Deagan eps 433-509 Other Sites: Crawfords Australia\n\nHomicide: 50 years on\n\n50 years of Homicide\n\n10 things you didn't know about Homicide"}, {"url": "https://peoplepill.com/people/tristan-rogers/", "page_content": "Tristan Rogers (born 3 June 1946) is an Australian-American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney Pictures' The Rescuers Down Under. He is currently starring as Robert Scorpio on General Hospital.\n\nRogers was born in Melbourne. His early acting roles were on Australian television and he completed short stints in soap operas Bellbird, Number 96 (in 1974) and The Box (in 1975). He was a regular in the police drama series The Link Men (1970) which lasted for 13 episodes, and had guest roles in programs including Barrier Reef, Division 4 and the 1976 miniseries Power Without Glory. He also appeared in a few British films in the early 1970s, notably Four Dimensions of Greta (1972), The Flesh and Blood Show (1972) and Sex Farm (1973).\n\nUnited States roles\n\nGeneral Hospital\n\nHe originally appeared on General Hospital from December 1980 until February 1992. The popularity and longevity of the character Robert Scorpio in General Hospital came as a result of his involvement with the monumentally popular \"supercouple\" Luke and Laura, whose 1981 wedding brought in 30 million viewers and remains the highest-rated hour in American soap opera history.\n\nWhile Rogers' Scorpio had been \"killed with no body found\" when he left the series in 1992, Rogers returned briefly in 1995 as Scorpio's spirit to comfort the character's daughter Robin Scorpio (Kimberly McCullough), who is dealing with the loss of her boyfriend to an AIDS-related illness and is herself HIV-positive. He returned again in January 2006 for six weeks, this time with Scorpio being very much alive. Rogers reappeared in April 2006 and left again that November.\n\nRogers has taken the lead recently in the soap industry, calling for an evolution of the medium in light of its dwindling audience. An active proponent of the entertainment industry's expansion onto the internet, Tristan is producing his own web-based talk show.\n\nFrom 5 August 2008 through 21 October 2008, Rogers reprised the role of Robert Scorpio on the second season of SOAPnet's General Hospital: Night Shift, a prime time spin-off of General Hospital which stars Scorpio's daughter Robin. He was featured in 12 of the season's 14 episodes, and Soap Opera Digest named the appearance their \"Best Return\" of 2008. Rogers later reappeared on General Hospital for four episodes starting 22 December 2008 as Scorpio attends Robin's wedding.\n\nRogers returned to General Hospital as Robert Scorpio on 29 February 2012 after Anna Devane (Finola Hughes) called him back to Port Charles to tell him that their daughter Robin Scorpio-Drake had been killed in a lab accident. After seven episodes, he left again on 8 March 2012. Rogers expressed disappointment. He later returned to the series on 15 November 2012 but later departed on 18 December 2012 as his character was drugged into a coma. Rogers reprised the role on 4 October 2013 as part of his on-screen daughter's return. However, on 14 November 2013 it was announced that he would be departing the series to return to The Young and the Restless as Colin Atkinson. He made his last appearance on 30 January 2014.\n\nRogers returned to the series as Robert Scorpio on 17 December 2015 but he was also portraying Colin on Y&R at the same time. He later left the series on 2 February 2016, although he briefly returned from 26 August to 9 September in the same year.\n\nRogers returned to General Hospital in April 2018 for a story arc in which he aids Anna Devane who is trying to locate her long lost son Henrik Faison. Henrik is the unknown child that she bore in secret with the late Caesar Faison. After leaving the show on 1 June 2018, he later returned yet again from 27 July to 12 September in the same year for another story arc where Anna and Finn go missing. In 2019, he returned to the show again on 25 January and has remained on the show since then on a recurring basis.\n\nThe Young and the Restless\n\nRogers returned to daytime television on 8 December 2010 when he joined the cast of The Young and the Restless as Colin Atkinson. He was placed on contract with the show in February 2011. However, Rogers' character was written out of the series in October 2011.\n\nOn 29 March 2012 – only weeks after his short return to General Hospital – it was announced that Rogers will bring back Colin to The Young and the Restless.\n\nOther roles\n\nRogers starred in the CINE award-winning short Opportunity Knocks, portraying Death himself. Co-produced by Aaron Wells and Suzanne Niedland, there are plans to develop the short into a feature-length film.\n\nIn 1994 Rogers guest-starred in season one, episode \"The War Prayer\", of the science fiction TV series Babylon 5. He has done voice-over work representing restaurant chain Outback Steakhouse, Foster's Lager, Reebok, Epson and others.\n\nHe voiced Jake the kangaroo mouse in The Rescuers Down Under, and gave his voice to the 2015 video game, Mad Max.\n\nFrom 1997 to 1998, Rogers played bar owner Harry in Fast Track, a series about stock car racing which was filmed in Canada.\n\nSince 2010, Rogers has starred on the soap opera web series The Bay as Lex Martin.\n\nIn 2019 he played Doc in the Amazon series, Studio City. In 2020 that role garnered him an Emmy for Outstanding Performance by a Supporting Actor in a Digital Drama Series at the 47th Annual Daytime Emmy Awards.\n\nPersonal life\n\nRogers has been married to Teresa Parkerson since 21 May 1995. They have two children: daughter Sara Jane (born 25 August 1992) and son Cale (August, 1996). He bought a home in Palm Springs, California, in 1997. He was formerly married to Barbara Meale from 7 June 1974 until 1984 when they divorced.\n\nFilmography"}, {"url": "https://www.famousbirthdays.com/people/tristan-rogers.html", "page_content": "About\n\nKnown for his portrayal of the American soap opera characters Robert Scorpio on General Hospital and Colin Atkinson on The Young and the Restless. He also appeared as the voice of Jake in the 1990 Disney animated film The Rescuers Down Under.\n\nBefore Fame\n\nHe began his acting career in 1974 by appearing across Australian TV. This lasted until 1980 when he was originally cast on General Hospital in the US.\n\nTrivia\n\nIn 2010, he began starring on the web soap opera series The Bay as Lex Martin. In 2015, he lent his voice to the Mad Max video game release.\n\nFamily Life\n\nHe was born and raised in Melbourne, Australia.\n\nAssociated With\n\nHe worked alongside John Candy and Bob Newhart for the 1990 Disney animated film The Rescuers Down Under."}, {"url": "https://famousstardom.com/tristan-rogers", "page_content": "Tristan Rogers is an Australian-American actor, best-known for his role as Robert Scorpio on ABC soap opera General Hospital. He is also popular for voicing Jake in The Rescuers Down Under. Rogers' film credits include Four Dimensions of Greta, Delgo, and Jack Rio among others.\n\nEarly Life And Early Career Of Tristan Rogers\n\nTristan Rogers was born on 3rd June 1946 in Melbourne, Australia. Information about his parents and early childhood is not known to the date. He spent his time in his hometown Melbourne before he moved to the USA to pursue an acting career.\n\nHe was interested in acting from an early age and worked in some minor roles on Australian television and soap operas that include Bellbird, Number 96 and The Box. Later, he was cast regular in the police drama series The Link Men that only lasted for 13 episodes in the '70s.\n\nTristan Rogers' Professional Career\n\nTristan Rogers moved to the USA in the late 70s and got his career breakthrough there in 1980 when he was cast on General Hospital. He worked on the soap opera for 11 long years until February 1992.\n\nHe played the role of Robert Scorpio in the show whose 1981 wedding gained 30 million viewers setting the records for the highest-rated hour in American soap opera history.\n\nIn December 2010, Rogers made his comeback in the daytime television joining the cast of The Young and the Restless as Colin Atkinson. His role in the show ended in October 2011, though he signed the contract until February 2011.\n\nOn March 1, 2012, Rogers returned to General Hospital as Robert Scorpio after the character Anna Devane called him to tell him that their daughter Robin Scorpio-Drake was killed in a lab accident. He left the show after eight episodes.\n\nTristan Rogers' Net Worth\n\nAustralian born American actor Tristan Rogers has been active in the acting industry for over four decades and in this period, he has worked in a number of big hit movies and television series. As of 2019, his net worth is under review, however, considering his success and fame in the industry, his net worth can be estimated to range from $100k-$1 million.\n\nHe primarily earned from his time in the soap opera where he gave the most of his career time. Moreover, he also amassed a lucrative sum of money from sponsors and endorsements.\n\nTristan Rogers' Personal Life, Marriage, And Children\n\nTalking about Tristan Rogers' personal life, the 73-year-old actor is a happily married man; has been married to Teresa Parkerson since 21st May 1995. The couple is blessed with two children; daughter Sara Jane whom they welcomed on 25th August 1992, and son Cale Rogers (born: August 1996).\n\nPrior to marrying Teresa Parkerson, he was married to his first wife Barbara Meale whom he divorced in 1984 after a decade long married life.\n\nTristan Rogers' Height, Weight, And Other Body Stats\n\nHeight: Tristan Rogers stands 6 ft. 1 inch or 185 cm tall.\n\nTristan Rogers stands 6 ft. 1 inch or 185 cm tall. Age: Actor Tristan Rogers is 73 years old as of 2019.\n\nActor Tristan Rogers is 73 years old as of 2019. Nationality: Rogers is a naturalized American citizen.\n\nRogers is a naturalized American citizen. Ethnicity: He is white as per his ethnicity.\n\nFor more updates, stay tuned to FrostSnow."}, {"url": "https://prod-www.tcm.com/tcmdb/person/164239%7C0/Tristan-Rogers", "page_content": "Biography\n\nIn 1980, Australian actor Tristan Rogers landed a small role on what was then the most popular soap opera in the world, \"General Hospital,\" (ABC, 1963- ), having no idea he would become the first of many hunky Australian exports to set American hearts aflutter. Playing Robert Scorpio, a sophisticated and savvy operative for the World Security Bureau, Rogers was teamed up with the most famous couple in the world at that time -\"GH\" lovers Luke and Laura - to help save the world from being frozen solid. He went on to become one of the soap world's most iconic actors, even long after he had left the show and moved on to other endeavors.\n\nBorn June 3, 1946 in Melbourne, Australia, the young Rogers never seriously considered acting as a career. After starting a rock group with some friends in 1964, he learned to love the good life so much that a regular desk job was not for him. His music career evolved into acting, more out of laziness than ambition. After landing acting gigs on Australian television series such as \"Bellbird\" (1967-1977) and \"The Link Men\" (1970), Rogers made the big leap across the pond to Hollywood. Back in the pre-Aussie invasion days, actors from down under were told to lose their accent or never work. Rogers promptly worked on losing the accent. When he booked \"GH,\" however, he was told to keep it, making him the first foreigner to hit it big on a U.S. soap using his native accent.\n\nFew actors met with immediate success the way Rogers did when he joined \"GH\" as agent Robert Scorpio. His participation, along with Luke (Anthony Geary) and Laura (Genie Francis), in possibly the show's most famous storyline - the Ice Princess caper - sealed the deal with fans who were not used to such a unique accent nor such take-charge masculinity in their soap idols. Rogers became so popular, that when couple du jour Geary and Francis left the show in 1983, the Aussie assumed the full mantel of the show's premiere leading man. First, he romanced Luke's left-behind love, Holly Sutton (Emma Samms) to the delight of fans. Even more popular was his teaming with ex-wife Anna Devane (Finola Hughes). The two actors remained in the forefront of the show's storytelling canvas until 1992 when Scorpio and Anna were presumed killed in a boat explosion. In 1995, Rogers briefly reprised Scorpio in a series of dream sequences experienced by the character's daughter Robin and his old pal Luke. But as far as Rogers was concerned, his days of Robert Scorpio were behind him forever.\n\nFree from the daily grind and stifling fame of \"GH,\" Rogers worked steadily in prime time television. He made appearances on the series \"Walker, Texas Ranger\" in 1993, \"Babylon 5\" in 1994 and \"V.I.P\" in 1999. Rogers lent his distinctive accent for the animated TV series \"The Real Adventures of Jonny Quest\" in 1996 and \"Batman Beyond\" in 2000. He had also performed voice over for the feature film, \"The Rescuers Down Under\" (1990).\n\nIn 1997, Rogers appeared in and produced the Showtime series \"Fast Track,\" which delved into the world of race car drivers. Rogers enjoyed producing, but continued to act, too, appearing on \"The Quality of Mercy,\" and \"Family Law.\" \"GH\" was not the star's only soap opera - he was cast as private eye Hunter Jones on \"The Bold and the Beautiful\" in 1997.\n\nIn January 2006, the star created headlines for the first time in years when ABC announced that he would be reprising his role as Scorpio for a six-week sweeps arc on \"General Hospital.\" Viewers learned that Scorpio indeed had survived the boat explosion and was recruited by former employer, the WSB, to become a hired assassin. Rogers was reunited with Geary and Samms during his brief return. It was so successful that ABC announced the Australian actor would return for more episodes in May, as would Hughes and Samms, so as to mix it up love-triangle style."}], "Tristan Rogers appeared in the Australian television series Division 4.": [{"url": "https://www.betaseries.com/en/person/100275-tristan-rogers", "page_content": "Tristan Rogers\n\nFrom Wikipedia, the free encyclopedia.\n\n\n\nTristan Rogers (born 3 June 1946 in Melbourne) is an Australian–American actor.\n\n\n\nHe is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney Pictures' The Rescuers Down Under. Early acting roles were on Australian television and he completed short stints in soap operas Bellbird, Number 96 (in 1974) and The Box (in 1975). He was a regular in police drama series The Link Men (1970) which lasted 13 episodes, and had guest roles in programs including Barrier Reef, Division 4. He also had a role in 1976 miniseries Power Without Glory.\n\n\n\nDescription above from the Wikipedia article Tristan Rogers, licensed under CC-BY-SA, full list of contributors on Wikipedia."}, {"url": "https://infogalactic.com/info/Tristan_Rogers", "page_content": "From Infogalactic: the planetary knowledge core\n\nTristan Rogers (born 3 June 1946, Melbourne) is an Australian American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney's The Rescuers Down Under. He is currently starring as Colin Atkinson on the CBS soap opera The Young and the Restless.\n\nRogers' early acting roles were on Australian television and he completed short stints in soap operas Bellbird, Number 96 (in 1974) and The Box (in 1975). He was a regular in the police drama series The Link Men (1970) which lasted for 13 episodes, and had guest roles in programs including Barrier Reef, Division 4 and the 1976 miniseries Power Without Glory. He also appeared in a few British films in the early 1970s, notably Four Dimensions of Greta (1972), The Flesh and Blood Show (1972) and Sex Farm (1973).\n\nUnited States roles\n\nGeneral Hospital\n\nHe originally appeared on General Hospital from December 1980 until February 1992. The popularity and longevity of the character Robert Scorpio in General Hospital came as a result of his involvement with the monumentally popular \"supercouple\" Luke and Laura, whose 1981 wedding brought in 30 million viewers and remains the highest-rated hour in American soap opera history.[1][2]\n\nWhile Rogers' Scorpio had been \"killed with no body found\" when he left the series in 1992, Rogers returned briefly in 1995 as Scorpio's spirit to comfort the character's daughter Robin Scorpio (Kimberly McCullough), who is dealing with the loss of her boyfriend to an AIDS-related illness and is herself HIV-positive.[3] He returned again in January 2006 for six weeks, this time with Scorpio being very much alive. Rogers reappeared in April 2006 and left again that November.\n\nRogers has taken the lead recently in the soap industry, calling for an evolution of the medium in light of its dwindling audience. An active proponent of the entertainment industry's expansion onto the internet, Tristan is producing his own web-based talk show.[citation needed]\n\nFrom 5 August 2008 through 21 October 2008, Rogers reprised the role of Robert Scorpio on the second season of SOAPnet's General Hospital: Night Shift, a prime time spin-off of General Hospital which stars Scorpio's daughter Robin.[4][5] He was featured in 12 of the season's 14 episodes, and Soap Opera Digest named the appearance their \"Best Return\" of 2008.[6] Rogers later reappeared on General Hospital for four episodes starting 22 December 2008 as Scorpio attends Robin's wedding.[7][8]\n\nRogers returned to General Hospital as Robert Scorpio on 1 March 2012 after Anna Devane (Finola Hughes) called him back to Port Charles to tell him that their daughter Robin Scorpio-Drake had been killed in a lab accident. After seven episodes, he left again on 8 March 2012. Rogers expressed disappointment.[9]\n\nThe Young and the Restless\n\nRogers returned to daytime television on 8 December 2010 when he joined the cast of The Young and the Restless as Colin Atkinson.[10] He was placed on contract with the show in February 2011. However, Rogers' character was written out of the series in October 2011.\n\nOn 29 March 2012 - only weeks after his short return to General Hospital - it was announced that Rogers will bring back Colin to The Young and the Restless.[11]\n\nOther roles\n\nRogers starred in the CINE award-winning short Opportunity Knocks, portraying Death himself. Co-produced by Aaron Wells and Suzanne Niedland, there are plans to develop the short into a feature-length film.[clarification needed]\n\nIn 1994 Rogers guest-starred in season one, episode \"The War Prayer\", of the science fiction TV series Babylon 5. He has done voice-over work representing restaurant chain Outback Steakhouse,[12] Foster's Lager, Reebok, Epson and others.\n\nHe voiced 'Jake the kangaroo mouse\" in The Rescuers Down Under, and gave his voice to the video game Mad Max.[13]\n\nSince 2010, Rogers has starred on the soap opera web series The Bay as Lex Martin.[14]\n\nPersonal life\n\nRogers has been married to Teresa Parkerson since 21 May 1995. They have two children: daughter Sara Jane (born 25 August 1992) and son Cale (August, 1996). He was formerly married to Barbara Meale from 7 June 1974 until 1984 when they divorced.[15]"}, {"url": "https://www.scripts.com/actor/tristan_rogers", "page_content": "Tristan Rogers\n\nTristan Rogers (born 3 June 1946) is an Australian-American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney Pictures' The Rescuers Down Under. He is currently starring as Robert Scorpio on General Hospital. Rogers was born in Melbourne. His early acting roles were on Australian television and he completed short stints in soap operas Bellbird, Number 96 (in 1974) and The Box (in 1975). He was a regular in the police drama series The Link Men (1970) which lasted for 13 episodes, and had guest roles in programs including Barrier Reef, Division 4 and the 1976 miniseries Power Without Glory. He also appeared in a few British films in the early 1970s, notably Four Dimensions of Greta (1972), The Flesh and Blood Show (1972) and Sex Farm (1973).\n\nUpdate this biography »\n\nComplete biography of Tristan Rogers »"}, {"url": "https://www.mymoviepicker.com/personne/tristan-rogers-120695.htm", "page_content": "Origin\n\nGenres\n\nThemes\n\nActors\n\nRoles\n\nRating\n\nAfter having left their own world due to a loss of natural resources, the winged humanoid Nohrin settle on Jhamora with the permission of the ground-dwelling Lokni. But some of the Nohrin, led by would-be conqueror Sedessa, believe in the superiority of their own race and try to take land away from the Lokni. The parents of Delgo, a Lokni, are killed in the resulting conflict. Nohrin King Zahn is horrified by the war and admonishes Sedessa, who then poisons the Queen and almost kills Zahn as well. She is subsequently banished, and her wings are clipped off. Delgo, meanwhile, is raised by Elder Marley, who tries to teach him how to use the power of magical stones. Once Delgo grows up, however, he gives in to his desire for revenge against the Nohrin as a whole. But then he meets Princess Kyla of the Nohrin and develops a tentative friendship with her. When she is kidnapped by Nohrin General Raius, who is actually working for Sedessa, Delgo and his friend Filo are blamed and arrested. In the Nohrin prison, Delgo meets Nohrin General Bogardus, who was forced to illegally gamble with his weapons by Raius, because Bogardus opposed an all out war with the Lokni. Delgo, Filo, and Bogardus escape into some underground caverns and eventually reach Sedessa's stronghold and rescue Kyla. Together they hurry back to try to stop the war from taking place. They are too late, for the war has already begun. Bogardus meanwhile fights and defeats Raius, but is soon after mortally injured.\n\n, 1h34Nohrin Officer43%"}, {"url": "https://peoplepill.com/people/tristan-rogers/", "page_content": "Tristan Rogers (born 3 June 1946) is an Australian-American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney Pictures' The Rescuers Down Under. He is currently starring as Robert Scorpio on General Hospital.\n\nRogers was born in Melbourne. His early acting roles were on Australian television and he completed short stints in soap operas Bellbird, Number 96 (in 1974) and The Box (in 1975). He was a regular in the police drama series The Link Men (1970) which lasted for 13 episodes, and had guest roles in programs including Barrier Reef, Division 4 and the 1976 miniseries Power Without Glory. He also appeared in a few British films in the early 1970s, notably Four Dimensions of Greta (1972), The Flesh and Blood Show (1972) and Sex Farm (1973).\n\nUnited States roles\n\nGeneral Hospital\n\nHe originally appeared on General Hospital from December 1980 until February 1992. The popularity and longevity of the character Robert Scorpio in General Hospital came as a result of his involvement with the monumentally popular \"supercouple\" Luke and Laura, whose 1981 wedding brought in 30 million viewers and remains the highest-rated hour in American soap opera history.\n\nWhile Rogers' Scorpio had been \"killed with no body found\" when he left the series in 1992, Rogers returned briefly in 1995 as Scorpio's spirit to comfort the character's daughter Robin Scorpio (Kimberly McCullough), who is dealing with the loss of her boyfriend to an AIDS-related illness and is herself HIV-positive. He returned again in January 2006 for six weeks, this time with Scorpio being very much alive. Rogers reappeared in April 2006 and left again that November.\n\nRogers has taken the lead recently in the soap industry, calling for an evolution of the medium in light of its dwindling audience. An active proponent of the entertainment industry's expansion onto the internet, Tristan is producing his own web-based talk show.\n\nFrom 5 August 2008 through 21 October 2008, Rogers reprised the role of Robert Scorpio on the second season of SOAPnet's General Hospital: Night Shift, a prime time spin-off of General Hospital which stars Scorpio's daughter Robin. He was featured in 12 of the season's 14 episodes, and Soap Opera Digest named the appearance their \"Best Return\" of 2008. Rogers later reappeared on General Hospital for four episodes starting 22 December 2008 as Scorpio attends Robin's wedding.\n\nRogers returned to General Hospital as Robert Scorpio on 29 February 2012 after Anna Devane (Finola Hughes) called him back to Port Charles to tell him that their daughter Robin Scorpio-Drake had been killed in a lab accident. After seven episodes, he left again on 8 March 2012. Rogers expressed disappointment. He later returned to the series on 15 November 2012 but later departed on 18 December 2012 as his character was drugged into a coma. Rogers reprised the role on 4 October 2013 as part of his on-screen daughter's return. However, on 14 November 2013 it was announced that he would be departing the series to return to The Young and the Restless as Colin Atkinson. He made his last appearance on 30 January 2014.\n\nRogers returned to the series as Robert Scorpio on 17 December 2015 but he was also portraying Colin on Y&R at the same time. He later left the series on 2 February 2016, although he briefly returned from 26 August to 9 September in the same year.\n\nRogers returned to General Hospital in April 2018 for a story arc in which he aids Anna Devane who is trying to locate her long lost son Henrik Faison. Henrik is the unknown child that she bore in secret with the late Caesar Faison. After leaving the show on 1 June 2018, he later returned yet again from 27 July to 12 September in the same year for another story arc where Anna and Finn go missing. In 2019, he returned to the show again on 25 January and has remained on the show since then on a recurring basis.\n\nThe Young and the Restless\n\nRogers returned to daytime television on 8 December 2010 when he joined the cast of The Young and the Restless as Colin Atkinson. He was placed on contract with the show in February 2011. However, Rogers' character was written out of the series in October 2011.\n\nOn 29 March 2012 – only weeks after his short return to General Hospital – it was announced that Rogers will bring back Colin to The Young and the Restless.\n\nOther roles\n\nRogers starred in the CINE award-winning short Opportunity Knocks, portraying Death himself. Co-produced by Aaron Wells and Suzanne Niedland, there are plans to develop the short into a feature-length film.\n\nIn 1994 Rogers guest-starred in season one, episode \"The War Prayer\", of the science fiction TV series Babylon 5. He has done voice-over work representing restaurant chain Outback Steakhouse, Foster's Lager, Reebok, Epson and others.\n\nHe voiced Jake the kangaroo mouse in The Rescuers Down Under, and gave his voice to the 2015 video game, Mad Max.\n\nFrom 1997 to 1998, Rogers played bar owner Harry in Fast Track, a series about stock car racing which was filmed in Canada.\n\nSince 2010, Rogers has starred on the soap opera web series The Bay as Lex Martin.\n\nIn 2019 he played Doc in the Amazon series, Studio City. In 2020 that role garnered him an Emmy for Outstanding Performance by a Supporting Actor in a Digital Drama Series at the 47th Annual Daytime Emmy Awards.\n\nPersonal life\n\nRogers has been married to Teresa Parkerson since 21 May 1995. They have two children: daughter Sara Jane (born 25 August 1992) and son Cale (August, 1996). He bought a home in Palm Springs, California, in 1997. He was formerly married to Barbara Meale from 7 June 1974 until 1984 when they divorced.\n\nFilmography"}, {"url": "https://www.famousbirthdays.com/people/tristan-rogers.html", "page_content": "About\n\nKnown for his portrayal of the American soap opera characters Robert Scorpio on General Hospital and Colin Atkinson on The Young and the Restless. He also appeared as the voice of Jake in the 1990 Disney animated film The Rescuers Down Under.\n\nBefore Fame\n\nHe began his acting career in 1974 by appearing across Australian TV. This lasted until 1980 when he was originally cast on General Hospital in the US.\n\nTrivia\n\nIn 2010, he began starring on the web soap opera series The Bay as Lex Martin. In 2015, he lent his voice to the Mad Max video game release.\n\nFamily Life\n\nHe was born and raised in Melbourne, Australia.\n\nAssociated With\n\nHe worked alongside John Candy and Bob Newhart for the 1990 Disney animated film The Rescuers Down Under."}, {"url": "https://wiki2.org/en/Tristan_Rogers", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAustralian-American actor (born 1946)\n\nTristan Rogers (born 3 June 1946) is an Australian-American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney Pictures' The Rescuers Down Under. He is currently starring as Robert Scorpio on General Hospital.\n\nRogers was born in Melbourne. His early acting roles were on Australian television and he completed short stints in soap operas Bellbird, Number 96 (in 1974) and The Box (in 1975). He was a regular in the police drama series The Link Men (1970) which lasted for 13 episodes, and had guest roles in programs including Barrier Reef, Division 4 and the 1976 miniseries Power Without Glory. He also appeared in a few British films in the early 1970s, notably Four Dimensions of Greta (1972), The Flesh and Blood Show (1972) and Sex Farm (1973).\n\nYouTube Encyclopedic\n\n1 / 1 Views: 1 551\n\nMERV GRIFFIN SHOW - HELEN REDDY, TRISTAN ROGERS, OLIVIA NEWTON-JOHN AND PAT CARROLL Transcription\n\nUnited States roles\n\nGeneral Hospital\n\nHe originally appeared on General Hospital from December 1980 until February 1992. The popularity and longevity of the character Robert Scorpio in General Hospital came as a result of his involvement with the monumentally popular \"supercouple\" Luke and Laura, whose 1981 wedding brought in 30 million viewers and remains the highest-rated hour in American soap opera history.[1][2]\n\nWhile Rogers' Scorpio had been \"killed with no body found\" when he left the series in 1992, Rogers returned briefly in 1995 as Scorpio's spirit to comfort the character's daughter Robin Scorpio (Kimberly McCullough), who is dealing with the loss of her boyfriend to an AIDS-related illness and is herself HIV-positive.[3] He returned again in January 2006 for six weeks, this time with Scorpio being very much alive. Rogers reappeared in April 2006 and left again that November.\n\nFrom 5 August 2008 through 21 October 2008, Rogers reprised the role of Robert Scorpio on the second season of SOAPnet's General Hospital: Night Shift, a prime time spin-off of General Hospital which stars Scorpio's daughter Robin.[4][5] He was featured in 12 of the season's 14 episodes, and Soap Opera Digest named the appearance their \"Best Return\" of 2008.[6] Rogers later reappeared on General Hospital for four episodes starting 22 December 2008 as Scorpio attends Robin's wedding.[7][8]\n\nRogers returned to General Hospital as Robert Scorpio on 29 February 2012 after Anna Devane (Finola Hughes) called him back to Port Charles to tell him that their daughter Robin Scorpio-Drake had been killed in a lab accident. After seven episodes, he left again on 8 March 2012. Rogers expressed disappointment. He later returned to the series on 15 November 2012 but later departed on 18 December 2012 as his character was drugged into a coma. Rogers reprised the role on 4 October 2013 as part of his on-screen daughter's return. However, on 14 November 2013 it was announced that he would be departing the series to return to The Young and the Restless as Colin Atkinson. He made his last appearance on 30 January 2014.\n\nRogers returned to the series as Robert Scorpio on 17 December 2015 but he was also portraying Colin on Y&R at the same time. He later left the series on 2 February 2016, although he briefly returned from 26 August to 9 September in the same year.\n\nRogers returned to General Hospital in April 2018 for a story arc in which he aids Anna Devane who is trying to locate her long lost son Henrik Faison. Henrik is the unknown child that she bore in secret with the late Cesar Faison.[9] After leaving the show on 1 June 2018, he later returned yet again from 27 July to 12 September in the same year for another story arc where Anna and Finn go missing. In 2019, he returned to the show again on 25 January and has remained on the show since then on a recurring basis.\n\nThe Young and the Restless\n\nRogers returned to daytime television on 8 December 2010 when he joined the cast of The Young and the Restless as Colin Atkinson.[10] He was placed on contract with the show in February 2011. However, Rogers' character was written out of the series in October 2011. He returned to the role briefly in 2012. [11]\n\nOther roles\n\nRogers starred in the CINE award-winning short Opportunity Knocks for which there are plans to develop into a feature-length film.[clarification needed]\n\nHe voiced Jake the kangaroo mouse in The Rescuers Down Under, and also gave his voice to the 2015 video game, Mad Max.[12]\n\nFrom 1997 to 1998, Rogers played bar owner Harry in Fast Track, a series about stock car racing which was filmed in Canada. [13] Since 2010, Rogers has starred on the soap opera web series The Bay as Lex Martin.[14] In 2019 he played Doc in the Amazon series, Studio City, a role garnered him an Emmy for Outstanding Performance by a Supporting Actor in a Digital Drama Series at the 47th Annual Daytime Emmy Awards.[15]\n\nHe has done voice-over work representing restaurant chain Outback Steakhouse,[16] Foster's Lager, Reebok, Epson and others.\n\nPersonal life\n\nRogers has been married to Teresa Parkerson since 21 May 1995. They have two children: daughter Sara Jane (born 25 August 1992) and son Cale (August, 1996). He bought a home in Palm Springs, California, in 1997.[17] He was formerly married to Barbara Meale from 7 June 1974 until 1984 when they divorced.[18]\n\nFilmography\n\nFilm\n\nTelevision\n\nVoiceover work\n\nVideo games\n\nMad Max (2015) - Voice\n\nReferences"}, {"url": "https://www.mycast.io/talent/tristan-rogers", "page_content": "Join myCast\n\nDo you love movies? Fan casting? myCast is the place for you!\n\nJoin thousands of other users in fan casting your favorite stories. Take 30 seconds to create a completely free profile, which will allow you to:\n\nAdd your own stories and characters\n\nMake casting suggestions\n\nVote and comment on casting suggestions\n\nAdd and edit talent profiles\n\nPost to the forums\n\nNeed an account?"}, {"url": "https://rivr.app/person/57104/tristan-rogers", "page_content": "Tristan Rogers\n\n0 FOLLOWERS • 7 CREDITS • JUN 3, 1946 • 77\n\nBiography more\n\nFrom Wikipedia, the free encyclopedia. Tristan Rogers (born 3 June 1946 in Melbourne) is an Australian–American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney Pictures' The Rescuers Down Under. Early acting roles were on Australian television and he completed short stints in soap operas Bellbird, Number 96 (in 1974) and The Box (in 1975). He was a regular in police drama series The Link Men (1970) which lasted 13 episodes, and had guest roles in programs including Barrier Reef, Division 4. He also had a role in 1976 miniseries Power Without Glory. Description above from the Wikipedia article Tristan Rogers, licensed under CC-BY-SA, full list of contributors on Wikipedia.\n\nOverview From Wikipedia, the free encyclopedia. Tristan Rogers (born 3 June 1946 in Melbourne) is an Australian–American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney Pictures' The Rescuers Down Under. Early acting roles were on Australian television and he completed short stints in soap operas Bellbird, Number 96 (in 1974) and The Box (in 1975). He was a regular in police drama series The Link Men (1970) which lasted 13 episodes, and had guest roles in programs including Barrier Reef, Division 4. He also had a role in 1976 miniseries Power Without Glory. Description above from the Wikipedia article Tristan Rogers, licensed under CC-BY-SA, full list of contributors on Wikipedia. From Wikipedia, the free encyclopedia. Tristan Rogers (born 3 June 1946 in Melbourne) is an Australian–American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney Pictures' The Rescuers Down Under. Early acting roles were on Australian television and he completed short stints in soap operas Bellbird, Number 96 (in 1974) and The Box (in 1975). He was a regular in police drama series The Link Men (1970) which lasted 13 episodes, and had guest roles in programs including Barrier Reef, Division 4. He also had a role in 1976 miniseries Power Without Glory. Description above from the Wikipedia article Tristan Rogers, licensed under CC-BY-SA, full list of contributors on Wikipedia.\n\nKnown For"}, {"url": "https://www.howold.co/person/tristan-rogers", "page_content": "Tristan Rogers Australian actor\n\nTristan Rogers is a 77 years old Australian actor from Melbourne, Victoria. He was born on June 03, 1946 in Melbourne, Victoria.\n\nAbout\n\nBiography\n\nTristan Rogers is an Australian American actor. He is best known for playing Robert Scorpio on the ABC soap opera General Hospital and for voicing Jake in Walt Disney's The Rescuers Down Under. Early acting roles were on Australian television and he completed short stints in soap operas Bellbird Number 96 and The Box.\n\nRead full biography\n\nYes, Tristan Rogers is still alive Last check: 2 years ago\n\nWorks\n\nTristan Rogers Movies (7)\n\nThere are 7 movies of Tristan Rogers.\n\nHis first feature film was The Rescuers Down Under (1990, as Jake (voice)). He was 44 when he starred in this movie. Since 1990, he has appeared in 7 feature films. The last one is Soulmates (1992). In this movie, we watched him in the Richard Wayborn character .\n\nTristan Rogers movie characters\n\nView all Tristan Rogers movies\n\nThe names of the characters/jobs in the films he starred in are as follows:\n\nTristan Rogers TV Shows (13)\n\nHis first TV Show was The Link Men (1970).\n\nView all Tristan Rogers TV shows\n\nTristan Rogers zodiac sign is gemini.\n\nWhen is Rogers's next birthday?\n\nTristan Rogers was born on the 3rd of June 1946 , which was a Monday. He will be turning 78 in only 360 days from today (09 June, 2023).\n\nOther facts about Tristan Rogers"}]}