{"Tristan Rogers appeared in the American television series The Rockford Files.": [{"url": "https://www.tvguide.com/tvshows/the-rockford-files/cast/1030260610/", "page_content": "Join or Sign In\n\nSign in to customize your TV listings\n\nContinue with Facebook\n\nContinue with email\n\nBy joining TV Guide, you agree to our Terms of Use and acknowledge the data practices in our Privacy Policy."}, {"url": "https://www.imdb.com/title/tt0071042/reviews", "page_content": "10 /10\n\nI'm of the opinion that The Rockford Files did nothing less than save James Garner's career. I yield to no one in my admiration for this man as an actor. I read somewhere that it was said of him he makes every thing he's in just a little bit better by being there.\n\n\n\nBut it was clear that his movie career at the time he was offered The Rockford Files was waning, he was not getting the good parts he once had on the big screen. What to do, but go back to television where Maverick had made him a big star.\n\n\n\nThough Garner's character and personality were certainly an integral part of the show, what I think set The Rockford Files apart was the terrific writing of each and every episode and the creation of some indelible characters. The best of course was Stuart Margolin as Angel Martin who was con man. Margolin did four or five episodes a year with The Rockford Files and he pulled Garner into one of his crazy schemes in every episode and Garner had to be resourceful to get them out.\n\n\n\nGarner was an ex-convict who apparently took a fall for some other people. His prison experience certainly toughened him and he went into the private detective business when paroled.\n\n\n\nNaturally the LAPD as do other police agencies don't like private eyes as a general rule and ex-con PIs really gets their collective backs up. Jim Rockford had a running battle with Lieutenant Chapman played beautifully by James Luisi who was never convinced Garner was on the up and up. Rockford had a good friend in Joe Santos as Sergeant later Lieutenant Dennis Becker who ran interference for him.\n\n\n\nHe also had the support of his dad, Noah Beery, Jr. who was a retired truck driver and who occasionally got roped into some of Garner's cases as well. And he had a pretty lady lawyer Gretchen Corbett and with his relations with the cops, Garner had to have her on speed dial.\n\n\n\nGretchen Corbett got a great career role in Beth Davenport. I'm not sure why she's not mentioned more as a feminist icon, a successful female professional if there ever was one on television.\n\n\n\nAnd other semi-recurring characters were folks like Isaac Hayes as Gandolf Finch another prison buddy, a man of few words and a demeanor that made Mr. T look like a friendly tour guide. Tom Selleck was here also as another private eye, Lance White, who kept getting credit for some of the grunt work Garner put in. This part led him to his own television series Magnum which in fact was patterned a lot on The Rockford Files. The show was rich with characters.\n\n\n\nThe Rockford Files to me is perfect series television, entertaining without condescension to the lowest common denominator. After physical problems forced the cancellation, James Garner came back in the nineties to do several Rockford television films. They were good, but face it Garner was getting old and tending to the gut a bit more.\n\n\n\nWith his recent stroke and the fact he's now 80 years old, I don't think another Rockford Files is in the cards. I wish it weren't so"}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Series/TheRockfordFiles", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Series/TheRockfordFiles\n\nJim's answering machine \"This is Jim Rockford. At the tone, leave your name and message. I'll get back to you. [Beep]\"\n\nPopular crime/action series, co-created by Roy Huggins (Maverick, The Fugitive) and Stephen J. Cannell, that aired on NBC from 1974 to 1980. James Garner played Jim Rockford, an innocent ex-con working as a private detective in the Los Angeles area. Rockford lived in a trailer parked on the Malibu beach, and drove a gold Pontiac Firebird.\n\nIn the earlier episodes, Rockford would only take cases that the police were not actively investigating: cases that they had closed in some way that was unsatisfactory to the client, cold cases, or something that the police were not giving any priority to—cases that the police lieutenant antagonist disparagingly referred to as \"the Rockford files.\"\n\nRockford preferred to outwit his opponents, rather than resorting to violence (though he was very good at it when violence was required.) While Rockford had been cleared of the armed robbery that he had been wrongfully accused of, he had also been a Con Man who had never been caught, and on multiple occasions he used his con artist skills to entrap the guilty party.\n\nIn many ways, the Rockford character was a 20th-century updating of Garner's Bret Maverick character.\n\nThis show provides examples of:"}, {"url": "https://doyouremember.com/156945/the-rockford-files-facts", "page_content": "With a few rings, you knew you were going to get a classy, thrilling hour of solving mysteries and beating up bad guys, or…getting beat up, he took some licks, too. But watching The Rockford Files was a family affair back in the late 1970s. And with two talented creators, one being Stephen Cannell, fresh off creating the short-lived unconventional cop show, Chase, and the other was Roy Huggins, who had worked previously with James Garner on a handful of episodes of Maverick, then creating the wildly popular 1960’s show The Fugitive. With this talented bunch leading the way, why then, was there a sudden break and frankly an unsatisfying finale? And what other “files” or surprises were hidden away? What health scares and personal feuds went on behind the scenes of such a beloved show?\n\nToday we’re investigating the subtle, secret ways The Rockford Files gave us a series worthy of multiple Primetime Emmys and made it into the top 50 of TV Guide’s Greatest Shows of All Time. Now, let’s re-open the Rockford Files!\n\nCrafting a Character\n\nThe Rockford Files is used to being on top—a lot more than its main character. The series has a long stay on Top 100, Top 50, and even Top 10 greatest show lists, and the reasons usually point to critical writing and a strong cast with great chemistry. But the core of what made The Rockford Files so beloved was the refreshing break from genre conventions. No one would compare Jim Rockford to James Bond, except to point out how different they are. One’s a suave lady’s man and the other is hapless, usually broke, and sometimes doesn’t even hurt the bad guy he’s fighting…or simply hurts himself.\n\nRELATED: 10 Classic TV Shows That Would Be Canceled Today\n\nCasting this lovable everyman was no problem. Co-creator Huggins knew Garner from his iconic Maverick, and it was the spirit of that series that inspired Huggins to reshape it into this program. This gave him the perfect set up to keep the same formula. Bret Maverick was a break from the strong, danger-loving cowboy. Maverick was unusually wholesome instead of morally gray, and the guy wasn’t in a rush to get hurt. Sound familiar? Huggins decided to take Maverick, from the 1800s to present day, this time breaking the Private Eye norms. Rockford didn’t carry a gun permit…or a gun. Instead, it lived in a cookie jar covered in coffee beans. Shootouts were too violent for the story they wanted to tell, hence all the car chases, further ingraining this different but exciting series.\n\nAt first, this bumbling character was intended to be utilized in the dramatic crime series Toma, that Huggins wrote 13 episodes for, but the networks read the script and said wait, this is way too funny, so they instructed him to remove the humor. The re-written script was used as the pilot for Toma, but the Rockford energy was still too jarringly funny for NBC. Garner was a perfect match for Rockford, it’s kinda his birthright. His full name is James Scott Garner, and this iconic character was named James Scott Rockford.\n\nFirst impressions\n\nThe Rockford Files intro showed Jim not answering the phone before it was cool, and it created one of the most quoted answering machines ever. There were 122 unique answering machine messages across six seasons! It’s understandable, then, that sometimes the creativity well dried up. So, the writers would ask for ideas from anyone on payroll. They were all meant to have a comedic or absurd feeling, and sometimes referenced past events.\n\nThen came the theme song, high energy, and thrills, just like the show! You could never accuse Rockford Files of cutting corners; they recruited some of the biggest names in the industry.. For several episodes, the writing team had David Chase, who’d go on to be the brain behind The Sopranos. Same goes for music. Mike Post is the composer behind Magnum PI, LA Law, Law and Order, and his colleague Pete Carpenter composed for some of our nostalgic favorites including The Andy Griffith Show, and Gomer Pyle, and oh my stars – Bewitched!\n\nSo it’s no surprise that the Rockford tune became a hit! It peaked at number 10 on the Billboard Hot 100. Any soccer fans, or should I say football fans, out there? The Tranmere Rovers from Britain are big fans of Rockford, and the squad sometimes runs onto the field with the theme song blaring. Gotta have goals. If these bops have you wanting to call up Rockford with a new case, you can – sort of. He has a phone number, of course. It’s (311) 555-2368, but there are a few things wrong here. As far back as the ‘50s, phone companies set 555 aside. That’s why just about every piece of media with a phone number uses 555… the biggest exception being 867-5309. Another blip is that during the series run, nowhere used 311 as an area code. LA was still on 213, and 310 wasn’t even around yet! But dial that number and who you gonna call? Ghostbusters, since they had that phone number, too!\n\nPutting his whole heart – and knees – into it\n\nJames Garner was no stranger to action and dangerous fights. He insisted on doing his own stunts, especially fistfights and car chases. That’s great dedication, but it came at a cost.\n\nHis knees were pummeled over and over, and Garner suffered from ulcers. That’s not even mentioning the back pain. It could be crippling, and he kept taking a beating as the series went on. Of course, doctors told Garner to take it easy, and by season six, he had to bow out from the sheer agony his body was in. Call in the stunt double.\n\nSharp getaway\n\nOne running gag was that Rockford couldn’t remember license plate numbers correctly, which is kind of a big deal when tracking down a perp. But Garner could never forget his character’s plate because it was so tied to his own life. His agent had the idea of 853-OKG. The first three numbers are actually a date: August 1953, when Garner first began acting. OKG stands for his home state of Oklahoma, and his last name.\n\nThat sits on the back of Rockford’s famous “copper mist” Pontiac Firebird Esprit. New year meant new car model, always in that same hue, and they HAD to be able to perform the patented J-turn, Rockford’s favorite evasive maneuver. Even though it was usually to get him out of a sticky situation, driven—pun intended—by fear, this same move is even taught to Secret Service agents!\n\nFinancial fame and folly\n\nJust as powerful as its main cast was, Rockford Files’ slew of supporting characters and guest stars was impressive too. In the past, Universal paid Garner $25,000 per episode. It also hosted MANY big names in the industry, like Bill Mumy of Lost in Space fame, Abe Vigoda from Barney Miller, the Bionic Woman herself Lindsay Wagner, and even Tom Selleck; later on, Magnum characters would reference an episode of Rockford Files, the same one its star appeared in!\n\nAll these big names shone brightly under the balmy clear skies of scenic Malibu, Los Angeles, an actual police station, and sometimes a studio. The fact of the matter is Rockford Files spared no expense recruiting the best and filming on-location with authenticity whenever possible. Jim’s trailer was filmed right along the Pacific Coast Highway—in fact, head on over to 29 Cove Road if you want to go on a Rockford Pilgrimage.\n\nA lot of the stunts were practical too, like when Jim’s car was actually damaged, and that meant always needing repairs or even replacements. Garner once said producers paid $700 to have a wooden crate built, just to break it in a scene on a shipyard…already full of wooden crates! All this dedication had a hefty price tag. Some inside sources say the show lost money into the millions! So, when the series lost its leading man, NBC decided to pull the plug as well, halfway through the season. Yikes.\n\nRockford Reborn\n\nBy the time Garner was done with The Rockford Files—the first round, anyway—he was nominated for an Emmy five straight years, winning in 1977. But that didn’t mean everything was rosy when the cameras stopped.\n\nLike any great series, Rockford Files went into syndication, giving it even more exposure, and of course, more profit potential. Universal had hope for Rockford and thought promoting it would spark enough interest that it could start up again. Problem was, for a while now Garner didn’t think he was getting paid enough. This was a problem for a while. His response: sue Universal for $2.2 million, or 37.5% of the net profits. The ensuing battle lasted years. Finally, Universal did settle with the actor outside of court. No one knows the exact terms, but Thankfully, it was enough to broker some peace so that we could see Garner in that gorgeous Pontiac Firebird again.\n\nReturn of Rockford\n\nWhen the dust settled from those contract disputes, actor and studio agreed to create eight TV movies, this time on CBS. For the most part, it was the cast reunion we always hoped for, except sadly Beery died in ‘94. So, the first in the series has a nice dedication to his memory saying, quote: “We love you and miss you, Pidge,” referencing his nickname.\n\nThe films were released from 1994 to ’99 and took place 15 years after the show’s unexpected, mid-season ending. They stayed true to the charm of the original but didn’t quite have the same energy. That was pretty deliberate though, too, since the whole passage of time was felt. For one thing, SPOILER, Rocky dies, giving us a sobering reminder of the importance of life. They also leaned into Garner’s own aging and physical limitations. Injuries caused him to step down the first time, and aging is practically a plot point in the movies; it doesn’t just go away, after all.\n\nEveryone loves callbacks, and that worked great for the movies; old contacts could reappear and ask for help, and of course, Rockford obliged, but we could see and even hear the toll it took on him sometimes. It also was the show’s chance to tie up loose ends. Viewers finally got some closure. But did it work? Was this the ending you wanted for the team? Please get in the comments and tell us your thoughts below!\n\nThe Rockford Files was the quintessential crime series. A tradition that can keep on through the generations, the character was so finely crafted. And It’s also a testament to the series that it weathered drama that would have decimated other programs, and when it came back, it knew we wanted some closure and it delivered. So, what was your favorite moment from the series? Is this the best Private Eye show of all time? Get in the comments and let me know your top three! We read them all!"}, {"url": "https://mysterytribune.com/the-rockford-files-complete-guide-to-the-tv-show-movies-and-books/", "page_content": "American detective TV show “The Rockford Files” is one of the most beloved classic series. Although the series aired on the NBC network between 1974 and 1980, it has still remained in syndication. In 2002, The Rockford Files was ranked No. 39 on TV Guide’s 50 Greatest TV Shows of All Time.\n\nJames Garner portrays Los Angeles–based private investigator Jim Rockford, with Noah Beery Jr. in the supporting role of his father, Joseph “Rocky” Rockford, a retired truck driver.\n\nRockford’s investigative style is to use his wits and a good measure of deception to get useful information from those he interviews.\n\nJim Rockford is an ex-con: he was falsely convicted of a crime he didn’t commit, but that doesn’t stop him from using his ex-con buddies to help him solve crimes. Nothing comes easy for Rockford, but he works hard and usually gets shot at or beat up at least once per episode.\n\nRockford’s investigative style is to use his wits and a good measure of deception to get useful information from those he interviews. In one episode he is derisively described by a rival private investigator as “the con bull artist”.\n\nIn addition to posing as insurance investigators and government officials, he sometimes invents preposterous characters and scenarios to confuse people, which usually gets them to reveal some valuable information. He has a portable printing press, which he keeps in his car and uses to prepare business cards that lend credibility to his guises. He is adept at using a lockpick, illegal to possess.\n\nIn this guide, we will provide you with an overview of the show, the main character and the spinoff movies based on the series.\n\nHow was the series created?\n\nIn the 1970s, producer Roy Huggins had an idea to remake Maverick, but this time as a modern-day private detective. Producers Roy Huggins and Stephen J. Cannell devised the Rockford character as a rather significant departure from typical television detectives of the time, essentially Bret Maverick as a modern detective.\n\nStarting with the 1974 season, Garner appeared as private investigator Jim Rockford in The Rockford Files. He appeared for six seasons, for which he received an Emmy Award for Best Actor in 1977.\n\nIn the series storyline, Jim Rockford had served time in California’s San Quentin Prison in the 1960s due to a wrongful conviction. After five years, he was pardoned (not paroled, a distinction frequently mentioned in plot points). His infrequent jobs as a private investigator barely allow him to maintain his dilapidated mobile home (which doubles as his office) in a parking lot on a beach in Malibu, California.\n\nIn contrast to most television private eyes, Rockford wears low-budget “off-the-rack” casual clothing and does his best to avoid physical altercations (although he is more than able to hold his own in a fistfight).\n\nThe Rockford Files Theme Song and Intro\n\nThe show’s theme song titled “The Rockford Files” was written by noted theme music composers Mike Post and Pete Carpenter. It appears at the opening and ending of each episode with different arrangements.\n\nThroughout the show’s tenure, the theme song went through numerous evolutions with later versions containing a distinct electric guitar-based bridge section played by session guitarist Dan Ferguson.\n\nWhy was Rockford Files canceled?\n\nThe show went into hiatus late in 1979 when Garner was told by his doctors to take time off because of numerous knee injuries and back trouble, as well as an ulcer.\n\nHe sustained the former conditions largely because of his insistence on performing most of his own stunts, especially those involving fist fights or car chases. Because of his physical pain, Garner eventually opted not to continue with the show some months later, and NBC cancelled the program in mid-season.\n\nIt was alleged that Rockford had become very expensive to produce, mainly due to the location filming and use of high-end actors as guest stars.\n\nWhat is the best episode of the original series?\n\nAccording to critics, The Real Easy Red Dog, is one of the best episodes in the original series. In this episode (7th one in the Season 2), Christine Dusseau, a female private eye, first blindsides Rockford, then joins him in tracking down the murderer in a case the police have dismissed as a suicide.\n\nWhere can I stream The Rockford Files?\n\nYou can watch The Rockford Files on Peacock (the streaming service of NBC). Peacock currently has 6 seasons of The Rockford Files available for streaming. The series is not currently available on the classic subscription to Hulu.\n\nPeacock episodes are free (there is 125 of them) but ad-supported.\n\nTV Movies\n\nAfter years of legal disputes between Garner and Universal, eight Rockford Files reunion TV movies were made from 1994 to 1999, airing on the CBS network.\n\nThe movies picked up nearly 15 years later from where the show ended. In the initial movies, Rocky is referenced as alive, but is off-screen; he dies (within the series continuity) sometime before the third movie.\n\nGarner, Santos, and Margolin appear in every movie. Other Rockford regulars who appear in multiple movies include Luisi, Atkins, Corbett, and Jack Garner (as Capt. McEnroe).\n\nRecurring players from the series who are brought back for a single return appearance include Rita Moreno (as Rita Kapkovic); Kathryn Harrold (as Megan Daugherty); and Pat Finley (as Peggy Becker).\n\nAll TV movies as well as the first original 6 seasons of The Rockford Files have been released as DVD.\n\nMilitary background of the character\n\nDuring the series, it is also revealed that Rockford was wounded in action and awarded a Silver Star while serving in the Korean War with the 24th Infantry Division.\n\nAfter being busted to Private he was promoted to Sergeant after conning the North Koreans to exchange a tank for 400 cases of K rations so his encircled unit could escape; however he was soon busted back to PFC when it was discovered he was running a string of pool halls in Busan and stealing a Major General’s car.\n\nDoes Jim Rockford ever get married?\n\nAt some time between the end of the series proper (1980) and the first of the Rockford Files television-movies, “The Rockford Files: I Still Love L.A.” (filmed in 1994, but set in 1992 and ’93), Jim married attorney Halley “Kit” Kittredge (Joanna Cassidy), who appeared in this TV movie.\n\nIn a conversation about their relationship, Kit alludes to the idea that the marriage ended because both Jim and Kit were very independent and stubborn people. In later TV movies, it is established that they were a couple by 1985 at the latest, and that Kit left the marriage in 1987. However, it is unknown when they were married, or for exactly how long. They had no children.\n\nBooks Featuring Jim Rockford\n\nCrime writer Stuart M. Kaminsky has written two books with Jim Rockford as the main character, entitled The Green Bottle and The Devil on My Doorstep.\n\nThe Green Bottle is a classic Rockford case involves retrieving stolen property, locating a cat for an eccentric, wealthy old lady, thugs out to rearrange Rockford’s anatomy, and a hunt that turns deadly when a beautiful woman in search of Hollywood fame turns up missing.\n\nThe Devil on My Doorstep: The second title in this series returns readers to the 1970s classic television series in which James Garner starred as the likable detective, Jim Rockford. By the Edgar Award-winning author of the Inspector Rostnikov and Toby Peters mysteries. 15,000 first printing.\n\n*****\n\nTo read Mystery Tribune’s Ultimate Guides covering major figures in crime, mystery and thriller world, please visit here."}, {"url": "https://crimereads.com/falling-in-love-with-the-rockford-files-all-over-again/", "page_content": "I don’t remember why I watched the pilot episode that came on one night after dinner in 1974: in those days before our family had a remote it was sometimes a passive decision, simply easier to keep watching in the stuffed chair than cross the room and turn the dial. But great discoveries can come from laziness, and so after seeing an old vagrant ride a city bus to the end of the line and get strangled by a weightlifter under Santa Monica Pier, the story moved to an L.A. bikini shop, where a handsome sideburned man was reluctantly agreeing to investigate the death for the victim’s daughter (Lindsay Wagner) as she dressed a mannequin.\n\nThe first show did not reek of tough-guy promise. First of all, he turned down the job he was hired for not once but twice, and except for his California P.I. license he seemed like just another big affable guy with ordinary problems: an understocked fridge, people hectoring him through his answering machine. His concerns seemed unheroic and, perhaps worst of all, he did not even carry a gun, keeping one only for emergencies in a cookie jar in the kitchen of his house trailer. And when at one point his client asked, a little concerned, “You’re not afraid of him, are you?” he told her the truth, “You’re damn right I am.”\n\nBut what grabbed me from the first episode was one hilarious scene: Jim Rockford, tired of being trailed by the vagrant’s muscular killer (William Smith) in a long red convertible, pulls into the Mayfair Music Hall, a Santa Monica venue of vaudeville-era entertainments. The bow-tied bartender greets Rockford and asks “The usual?” as a young woman performs a slow split atop a wire, meaning Jim either comes here often to lose a tail or he likes novelty acts. After his brawny pursuer enters the bar and growls his drink order, Jim heads to the men’s room to prepare his trap. The Mayfair switches to a troupe of dancing poodles as Rockford’s man stalks to the bathroom, where Jim has drizzled hand soap across the floor and retrieved a roll of nickels from his coat pocket, taunting, “You musclebound guys are always overcompensating.” The charge of latency draws a macho scream and a high kick that slides him back onto the soapy tile, where Jim lands a cheap insurance shot. According to Ed Robertson’s history of The Rockford Files, this scene nearly broke the ASI meter when the pilot was tested, and may have made the show. It did for me. By cheating a little, it seemed a clever man could take down a bully. I was hooked.\n\nTo an eleven-year-old, Jim Rockford had a life I could happily imagine for my future self: He lived alone in a beaten green and white trailer on a promontory over a Malibu beach, where he spent much of his free time surfcasting, often with his dad, a semi-retired longhaul trucker known as Rocky, whose whole existence seemed to revolve around fishing with his adult son; when he worked, Jim Rockford charged clients an impressive-sounding “$200 a day plus expenses” for snooping around and he drove a cool gold Pontiac Firebird Esprit in which he outmaneuvered Mob wheelmen and hot-headed Feds. (The car chase thrived on 1970s TV the way the epic guitar solo dominated ‘70s rock.)\n\nOver five and a half seasons, Jim Rockford would offer a number of life lessons: That you can gain entry to many social functions simply by wearing a blue sport coat or phony glasses; when impersonating salesmen, it’s good to have a variety of drawling accents and bold hats; any business office can be accessed either with a set of quality lock picks or by double-talking the receptionist and showing fake business cards you can print in your car; in a high-speed chase, you can often outsmart goons with a cool reverse J-turn move they somehow never expect; sometimes you’ll work for people you detest, so know how much you’re willing to take; likewise, being a good listener is not only nice manners but also can be professionally useful. And finally, if you want the dream of a home office without paying a secretary, then rent an answering machine (rather new at the time).\n\nThe Rockford Files’ opening sequence did not show the usual action shot, chalk corpse silhouette, or hero swirled in police lights but a pan of Jim’s untidy desk laid with playing cards and a large standing photo of his dad, as the answering machine plays. Jim’s messages famously began every episode, ensuring that fans of the show would be in their seats as it opened: “Hey Jim, this is Louie down at the fish market—you gonna pick up these halibut or what?”\n\nJim’s style may be sardonic, but he can be decent to a fault, rare among world-weary sleuths, perhaps because his father Rocky believes the best of people. Rocky was appealingly played by Noah Beery, with his can-do 1940s cowboy demeanor. (If you have seen Red River he is part of the montage of cowhand faces howling to launch the famous cattle drive). Rocky is always telling his son to drive a rig (it’s safer) or come up to the cabin to hunt and relax from the hazards of the investigator’s life. Writer Stephen Cannell created Rocky thinking of his own father, who was puzzled by his strange choice of profession instead of joining the family business. There is scant evidence in the show that Jim ever had a mother; perhaps it would be too painful to talk about.\n\nRocky hopes Jim will get married and find a less dangerous line of work, but always helps him out when goons come to the trailer, which is often. (Rockford’s trailer may be the most-tossed location in TV history.) After one close call, however, Rocky finally blows up: “I am through talking to you! Look at you, an inch or two to the right and you’d be missing that eye!”\n\n“Yeah,” answers Jim, “but look at it this way, an inch or two to the left and he’d have missed me completely.” Rocky is not amused.\n\nIt is hard now to appreciate the freshness of Jim Rockford’s adventures against its era of old school police dramas and newer crime shows with smirky tag lines.\n\nThe Rockford Files seemed revolutionary in being so funny and still delivering a tense crime plot. It is hard now to appreciate the freshness of Jim Rockford’s adventures against its era of old school police dramas and newer crime shows with smirky tag lines (Kojak’s “Who loves Ya, baby?’ or Baretta’s “And dat’s the name of dat tune”): One of the funnier Rockford episodes, “A Clean Bust with Sequel Rights,” spoofs such shows, when Jim is hired by an insurance company to “babysit” a celebrity cop (Hector Elizondo) whose police exploits have become a bestseller, movie, TV show and kids’ toy line. It pains Jim how his father is thrilled watching the TV detective shout, “Freeze, Turkey!” as he makes the bust. (In fact, Rockford Files began as an unused plot idea for another project of producer Roy Huggins, the short-lived Detective series Toma, which itself then morphed into Robert Blake’s Baretta.)\n\nJim had none of the hard-drinking tough guy detective who needs to be saved from himself and he would not be caught walking around with Baretta’s cockatoo on his shoulder, either. In the second season (“The Big Ripoff,” Ep7) we get as close as we come to a Rockford code: Jill Clayburgh plays a young artist’s model who rescues Jim after he’s been badly beaten up. As he returns to his dangerous work, she asks, “Is there any thing you won’t do for money?” “I won’t kill for it,” Rockford answers, “and I won’t marry for it. Other than that, I’m open to just about anything.” At the time The Rockford Files appeared, the closest thing to it was Harry O, whose private eye worked on his boat when not solving crimes. But Harry retained the gravitas of the police detective he once had been; Rockford’s sense of justice comes from his serving five years for a robbery he didn’t commit, before receiving a pardon and learning to become a PI. Still, I’m sure the ex-cop and ex-con could have gone fishing together in Harry’s boat.\n\nNow, when many TV investigators have a drug habit, a debilitating phobia or a splattery past as a serial killer, it is hard to take seriously the “anti-hero” packaging that accompanied these Rockford episodes. But he was, in the same way as James Garner’s earlier character Bret Maverick stood apart from the stolid lawmen and bold gunfighters of the Westerns that crowded the late 1950s TV schedule. Maverick, its creator maintained, was a show in which the situation was often hopeless but never serious. The Rockford innovation was really a renewal of Bret Maverick’s sly pose in a new setting. Garner, an Oklahoman of part-Cherokee heritage (his production company was Cherokee Productions), had joined the Merchant Marine as a teenager in World War II and later received two Purple Hearts for his service in Korea, yet made a convincing leading man reluctant to go to war, most famously with Julie Andrews in The Americanization of Emily.\n\nThe self-interested hero was charmingly done on Maverick, where Bret toured Western towns and river boat cities in search of poker and brief romance and usually found danger besides. Maverick was a departure from the glut of TV Westerns; he was neither noble nor icy veined, and not disposed to gunplay yet capable if trapped by frontier circumstances. His storylines did not teach a hokey lesson about Americanism; he was mostly concerned for himself, trying to survive on his card skill and wits.\n\nWhen a similar craze for private eye shows overtook the networks almost twenty years after Maverick, James Rockford appeared, with a similar take on life, though considerably less cardplay, as a perfect character for Garner. Like Maverick, Jim Rockford seeks no trouble, freely admits fear and turns down work as too dangerous, but if cornered, he can handle himself. (Others have noted that he unstoically shakes out his hand after using his fist.) Executive Producer Roy Huggins, who had originally created Maverick as well as The Fugitive, now retooled a number of storylines for an updated setting, while writer Stephen Cannell, who had been a great fan of Maverick, had Huggins’s permission to borrow its plots and spirit for Jim Rockford.\n\n* * *\n\nRockford’s being an ex-con allowed the writers a secondary cast of colorful guest spots and returning characters emerging from San Quentin, from Isaac Hayes to Eddie Fontaine to Stuart Margolin. (More on Isaac Hayes—and the spinoff series that should have happened—below.) Rockford never entirely dismisses his criminal acquaintances, even those who beat him up when they served together. He is also (like Garner himself) a Korean vet, which allows Ned Beatty or Ken Swofford to reenter his life citing war buddy favors owed. Even Jim’s one-time parole officer is on the make. Of all the characters, though, from Rob Reiner guesting as a sleazy minor quarterback to Claudette Nevins as an anti-feminist author, it is Rockford’s old cellmate, ‘Angel’ Martin who is the most entertaining, appearing in almost a third of the episodes.\n\nThe Rockford Files is at its funniest whenever the nervous Angel shows up to complicate Jim’s life. (“Jim Buddy-buddy,” one Rockford phone message begins, “You know how they allow you one phone call? Well, this is it. Hello? Hello?”). Angel is your needy grifter friend who always disappoints. (Find out why Angel deserved his own spinoff below.)\n\nThe Rockford Files mostly predates the era of season arcs, except for occasional two-part stories, so there are various methods for choosing where to start watching, if you missed it originally. You can binge straight through its 118 episodes, or begin with those in which ‘Angel’ appears; or watch every one written by co-producer David Chase (later of The Sopranos), who even then steered plots back toward the Jersey mob; or see any episode in which Rockford is comically paired with a rival P.I. such as Tom Selleck (as the impeccable Lance White). Rockford’s frustration with people and events is one of the show’s many pleasures. His crucial friendship with Sgt. Dennis Becker brings Jim regularly into his least favorite setting, the police station house, where he is tolerated at best, and sometimes briefly arrested.\n\nArticle continues after advertisement\n\nFor a 1970s detective, Jim Rockford has impressively few cringey moments with the show’s female guests, a series of vivid and believable women often created by writer-producer Juanita Bartlett. With women, Rockford is a courtly good listener who happens to live in a trailer. We are told that he used to date his lawyer, Beth (Gretchen Corbett) and the writers occasionally break Jim’s heart with a disappearing fiancée or a blind psychologist girlfriend who dumps him. (Rita Moreno won an Emmy portraying a prostitute and police informant whom Jim helps.) Old flames (Susan Strasberg or Valerie Pointer) return mainly when they want him to fix something in their lives or to set him up as the fall guy delivering a briefcase. He loyally complies, and often regrets it.\n\nMany shows have been influenced by The Rockford Files or have sought to strike its balance of elements—but you need the writing and you need James Garner, and nobody has had both. Recently, Republic of Doyle, a CBC show about a father-and-son detective agency in Newfoundland, claimed to be inspired by it, but there isn’t a strong resemblance. There may be something Rockfordesque in some of the manly banter on True Detective, but its overall mission is much darker.\n\nMany shows have been influenced by The Rockford Files or have sought to strike its balance of elements—but you need the writing and you need James Garner.\n\nGuy Pearce’s superb series for Australian TV, Jack Irish, (based on the Peter Temple novels) comes closest to the mark. It has some of the wit and offbeat spirit, especially the splendid character writing, with a grumbling assortment of old bar types and marvelous racing touts. Jack is a compelling stubbled presence with rich side hobbies, and something about a scene when he gets beat up and then peed on by gunless Aussie thugs seemed particularly evocative of The Rockford Files. But Jack does have his morose drinking bouts, another investigator with demons. (His troubled late father, it seems, was no Rocky.)\n\nArticle continues after advertisement\n\nJim Rockford may feel bad or overly responsible about events in his life, but he seldom feels openly sorry for himself; Rocky wouldn’t have it. It’s also easier to clear your head where he lives. Jim recovers from the tragedies in his work with a walk down the beach, or a fast drive along the coast in his Firebird, then he’s back home to find his tackle. So he beats on, casting into the surf until the next stranger pulls up, pauses a skeptical beat before his trailer door, and knocks with a new case. I’m expensive, Jim will explain inside, brushing off a space to sit.\n\n___________________________________\n\nFavorite Episodes\n\n___________________________________\n\nThere are definite worsts, but far too many great episodes to select a simple best list. So I have a sampler of some favorites as well as a strongest season (Season 3). Also, since 1970s L.A. is his scruffy co-star, I am less fond of episodes set out of town (in Hawaii, Denver, Seattle, or Vegas), basically anytime Jim is deprived of his real car.\n\nStings and Counter-stings: Some favorites tend to be plots in which Jim organizes ambitious revenge cons inspired by The Sting: In “There’s One in Every Port,” (Season 3, Ep 12) he pulls off the textbook Big Con against a father-daughter team of maritime scammers. “Counter Gambit” (Season 1, Episode 16) is a wonderful revenge scam in which Jim is first hired by ex-cons allegedly to find a missing girlfriend, but they are secretly just after her pearl necklace, which they intend to steal and blame on Rockford. The one priceless scene comes when Angel is forced to substitute as the terrified appraiser for the criminals’ jewels.\n\nMultiple PIs: The show’s writers loved detectives, but even more when they could contrive detective stories within detective stories, such as “Nice Guys Finish Dead” (Season 6, Ep 7). It begins with a PI convention where Jim is up for an unlikely but well-deserved award, nominated by PI Lance White (Tom Selleck, before his Magnum days). Jim’s moment is spoiled by a murder in the Men’s room, forcing private eyes who can’t stand or trust each other to band together for the solution. White (Selleck) does everything handsomely wrong and still succeeds, to Jim’s increasing annoyance. Similarly, in “Sitcks and Stones May Break Your Bones, but Waterbury will Bury You” (Season 3, Ep 13), a Pinkerton-like big agency is killing off the region’s little PIs (including guest star Cleavon Little) for their turf, and the remaining independents must band together to uncover the plot.\n\n“The House on Willis Avenue” (Season 4, Ep 21), an epic two-parter, starts at the funeral of an old private eye who was Rockford’s mentor learning the business; at the service, Jim meets a much younger detective who shared this same teacher and finds the circumstances of his death curious: the pair uncover a strange criminal network of computers run by still another detective (Jackie Cooper). This story ends with a prescient onscreen warning about the national threat posed by “Secret information centers, building dossiers on individuals…”\n\nHomefront: In “Paradise Cove” (Season 6, Ep 1), Jim has to defend his home on two fronts: enduring the simultaneous challenge of a court-appointed receiver’s inventory of his possessions to pay a lawsuit settlement against him, and a threat from a member of his Paradise Cove Homeowners’ Association, who secretly wants the gold bullion that may or may not be hidden beneath Rockford’s trailer from a long-ago heist. Mariette Hartley, who was already selling Polaroid cameras in a series of charming TV ads with Garner, guests as his court-appointed creditor who becomes gradually interested in the intrigue off the books. (Hartley was asked so often about her apparent TV marriage to him that she had a T-shirt printed, I’m not Mrs. James Garner.) This episode, which opened the final season, has a funny premise: Likable as he is, what homeowners’ group would want Jim Rockford living among them, with his frequent violent visits from goons? It is worth it for Angel’s Treasure of the Sierra Madre speech alone, when he thinks the gold will be theirs.\n\n___________________________________\n\nCity of ‘Angel’\n\n___________________________________\n\nIn a later time of Better Call Saul or Curb Your Enthusiasm, in which character is destiny and comic, self-sabotaging flaws drive the drama, Evelyn ‘Angel’ Martin would have enjoyed his own spinoff series. Unsuccessful as both a squealer and small-time con man, each week Angel could overplay his hand in a different scheme that collapses. (Before taking the Angel role, Stuart Margolin had appeared with Garner on the brief-lived TV Western, Nichols.)\n\nYou can construct your own series—call it City of ‘Angel’—out of the 37 episodes graced by his manic presence. Angel’s escalating lies are sort of the point, and the failure of each con, like the building of a classic comedy gag, is as funny as it is anticipated. (Garner himself later confessed he had no idea why the two characters were still friends, but it amused the rest of us.) “Jimmy, I had to stay alive,” Angel explains some latest betrayal. “You’re alive,” Rockford concedes. “You have plenty of good years left for sniveling and complaining.”\n\nIn one episode, he forges papers to sell someone a horse that “could” be “Secretariat’s long-lost son” (“a grey area,” he concedes to Jim); in another, (“Rattlers Class of ’63”) Angel asks Jim to be his best man an hour before a wedding that turns out to stem from a botched grift. “It’s a variation on the Red Barn con,” he confesses after the ceremony turns into a brawl with the bride’s family. “Then why,” Rockford reasonably asks, “did you marry the mark’s sister?”\n\nIn “Drought at Indian Head River,” (Season 3, Ep 13) Angel is suddenly rolling in money as an unwitting front in a mob real estate scam controlled by Robert Loggia. When Jim visits Angel’s new penthouse to warn him that he is about to be killed, Angel cuts him off: “I go by ‘Angelo’ now. ‘Angel’ is not an important name.” In another story, Angel becomes a material witness needing police protection, insists the cops serve him his meals in his motel bed, and decides the time has come to dictate his memoirs. And in “Dog and Pony Show” (Season 4, Ep 5) Angel again gets Jim arrested along with him, and a judge decides they both need to attend group therapy. In the sessions, Angel spins a long tale about his mythical family and work for the CIA (“I’m just glad the Agency didn’t find out about my gun running days because of all this. I can’t say anything more.”).\n\nIt hit the news this past winter that some websites were advertising murders for hire but keeping the Bitcoin without following through on the killing part. I remembered Angel’s similar (but flawed) scheme of advertising as a hit man and keeping the client’s money after the face-to-face handoff. “Jimmy, you got to help me,” Angel begs when his own life is threatened. The trouble with Angel is he doesn’t stay helped.\n\nA show based on Angel and his imploding cons would find an easy home today.\n\nWhen The Rockford Files staged a brief return in the early ’90s it showed Angel failing as a looter in the L.A. riots (sadly choosing to cover his head with a clear plastic bag that left him recognizable to Police choppers). According to Ed Robertson, the gag was the idea of Stuart Margolin, who had won two Emmys playing Angel and knew him better than anyone.\n\n___________________________________\n\nGabby & Gandy, The Show that Could Have Been\n\n___________________________________\n\nI loved the original Spenser for Hire, but have always wanted to see a crime show where the white guy is the strong-arm sidekick, the Hawk role. In 1977, the makers of The Rockford Files tried to go one better: using a Rockford episode (“Just Another Polish Wedding,” Season 3, Ep 17) as a possible network spinoff about its two guests—black investigators played by Louis Gossett, Jr. and Isaac Hayes, at the height of his post-Shaft cool.\n\nEach character had appeared previously on Rockford, one as Jim’s former parole officer, Marcus Aurelius “Gabby” Hayes (Gossett) who has become a high-end PI who hones his refined image by driving around in a Rolls Royce on an extended test drive; the other is Gandy Fitch (Isaac Hayes), a short-fused ex-con Jim knew to avoid at San Quentin. In a previous episode (“The Hammer of C Block,” Season 3) Rockford helped Gandy clear himself of the crime for which he had served 20 years.\n\nWhen Gandy looks up “Rockfish” again in this spinoff episode, broke, and insists on working as Jim’s muscle, Rockford arranges a lunch and tries to unload him on Marcus Hayes, his old parole officer turned slick investigator, who sticks Jim with the price of the meal, then tries to steal Rockford’s current case, offering to cut Gandy in on the finder’s fee.\n\nThis episode has a lot to recommend it, but is famous for a scene where the pair blunders into a meeting of Neo-Nazis in a Los Angeles bar; polka music plays as members shoot pool and swig beer in full uniform. The cues are swinging soon after the black strangers enter, and Hayes (Gossett) grabs the bartender’s sawed-off shotgun and blows away the framed Hitler portrait. The pair make righteous work of the jackboots, then Hayes delivers a critique worthy of our time: “So, these are the rough, tough right wing National Socialists we keep hearing about.” As police sirens wail louder outside he lectures his bruised audience on the strength and virtue of the American middle class before Gandy can drag him away. “I think that went well,” he gloats, safely in the backseat. “Yeah,” Gandy admits, “you were cookin’.” A partnership is born.\n\nAt a time when black actors on crime dramas often played pimps, streetwalkers, drug dealers, or addict-informants, this attempt at a spinoff series with two black detectives was ambitious. That “Gabby & Gandy” was not picked up is disappointing but not to be blamed on its era alone. No network program like it followed. Isaac Hayes would return (solo) to The Rockford Files as Gandy the following season (in “Second Chance,” Season 4, Ep 4), asking Jim’s help to protect the life of his current girlfriend, played by Dionne Warwick, whose songs Hayes covered so soulfully.\n\n___________________________________\n\nThe Rockford Philes\n\n___________________________________\n\nIt turns out that there are still quite a number of us who, anticipating a situation where we might feel a little imposterish, reach for the dark sports jacket as Jim would do. Here are some ways to celebrate, discuss, and even learn more about The Rockford Files.\n\nWatching: The Rockford Files is distributed by IMDB, for free with ads, on the IMDB site and also streams through Amazon Prime. Its superb progenitor, Maverick is available for purchase through Amazon, YouTube, and ITunes. Rockford Files is also available (with the 1990s TV movies) in a 22-DVD boxed set, The Rockford Files: The Complete Series (Mill Creek Entertainment).\n\nBooks: 30 Years of The Rockford Files by Ed Robertson (ASJA Pr., 2005) or Robertson’s earlier ‘This is Jim Rockford’: The Rockford Files (20th anniversary Tribute, Pomegranate Press, 1995). Robertson did many interviews with the show’s principals, and presents a good history of the program’s evolution as well as synopses of all the episodes. For more stories about the making of Maverick and Rockford see The Garner Files: A Memoir by Jon Winokur and James Garner (S&S, 2012), and an earlier fan’s book, The Rockford Phile: The Unofficial Casebook of the Rockford Files by David Martindale (Pioneer Books, 1991).\n\nPodcasts: Tribute books are nice, but if you really want to disappear down an entertaining rabbit hole filled with pieces of the world of 29 Cove Rd., this podcast can be pretty fun. Run by two young gamers who found the show decades after its network reign, in some ways their project resembles paleontologists studying the lost age when long, high-powered vehicles roamed the Earth in California car chases.\n\nCreators Nathan D. Paoletta and Epidiah Ravachol have appropriately named their forum Two Hundred a Day: A Rockford Files Podcast, and on it they discuss every episode’s plot and craft and the intellectual predilections of its writers, while offering their own accompanying detective-style notes, presented in spreadsheet form: the make of every evocative PGC (Primary Goon Car) is catalogued, from a goonish green and white 1973 Dodge Charger to a red and white 1975 Lincoln Continental, whether involved in an episode car chase or just a sinister visit to the trailer to grab Jim or toss his place. Also, you’ll find running tallies of each of Jim’s beloved taco lunches, those of his expenses left unreiumbursed, and plot points like: “Dennis can’t wash his ham-and-cheese sandwich down because the station coffee is bad.” Classic Brooklyn-curmudgeonly Dennis! Pick your favorite episode under discussion and see if you agree. (Apple Podcasts)"}, {"url": "https://www.nytimes.com/2022/12/13/arts/television/stuart-margolin-dead.html", "page_content": "Stuart Margolin, a character actor best known for playing the sidekick to James Garner’s private detective on the hit series “The Rockford Files,” a role that won Mr. Margolin back-to-back Emmy Awards as best supporting actor in 1979 and 1980, died on Monday in Staunton, Va. He was 82.\n\nHis family said the cause was complications of pancreatic cancer.\n\nMr. Margolin was all over television from the early 1960s into this century, turning up in episodes of dozens of shows as well as in assorted TV movies. He also had a substantial behind-the-scenes career: He wrote several TV movies and directed episodes of “The Rockford Files,” “The Love Boat,” “Touched by an Angel” and numerous other series. In 1987, he and Ted Bessell shared an Emmy nomination for directing for “The Tracey Ullman Show.”\n\nMr. Margolin’s career was tied to that of Mr. Garner, one of Hollywood’s top stars, at several points. Before “The Rockford Files,” which was seen on NBC from 1974 to 1980, he and Mr. Garner were in “Nichols” (1971-72), a short-lived western; Mr. Garner played the title character, a sheriff, and Mr. Margolin played his deputy.\n\nAfter “Rockford,” the two men were in another western, “Bret Maverick” (1981-82), a sequel to “Maverick,” the show that helped make Mr. Garner a star in the 1950s and early ’60s. Mr. Margolin also directed Mr. Garner in several “Rockford Files” TV movies."}, {"url": "https://www.hollywoodreporter.com/news/general-news/james-garner-rockford-files-maverick-dies-442238/#!", "page_content": "James Garner, the charming leading man from Oklahoma who made it look easy on NBC’s The Rockford Files and in films opposite Doris Day, Julie Andrews and Sally Field during more than a half-century in show business, has died. He was 86.\n\nThe actor died at his Brentwood home on Saturday night, Los Angeles police officer Alonzo Iniquez confirmed to The Associated Press. TMZ first reported the news on Saturday.\n\nPHOTOS Hollywood’s Notable Deaths of 2014\n\nThe amiable actor was best known for playing the Los Angeles private eye in Rockford, which ran from 1974 to 1980, before knee and back injuries — many sustained because he did his own stunts — forced him to quit. “I couldn’t take that many beatings anymore,” he once said. “Every hiatus, I had a knee operation for five straight years, and sometimes for both knees.”\n\nGarner was nominated for the Emmy for best actor in a drama series for five consecutive years, winning in 1977. Rockford, produced by Roy Huggins and writer Stephen J. Cannell, racked up three best drama nominations from 1978 to 1980 and took the trophy in 1978.\n\nPHOTOS: Hollywood’s 100 Favorite Films\n\nGarner also toplined the ABC Western-comedy hybrid Maverick (1957 to 1962), also produced by Huggins, in which he starred as a dapper cardsharp who would just as soon slip out the back door than face down a gunman. “Bravery gets you nothing but hurt,” he once said. Both TV series showcased Garner’s sense of humor and expertise in playing the reluctant hero.\n\nThe dark-haired star also appeared in dozens of films, including two light romantic comedies from 1963 with Day, The Thrill of It All and Move Over, Darling; two with Andrews (1964’s The Americanization of Emily and 1982’s Victor Victoria); and one with Field, the 1985 romantic comedy Murphy’s Romance, for which he received his lone Oscar nomination.\n\nWhatever his roles, Garner’s acting appeared effortless. Los Angeles Times critic Charles Champlin wrote in 1986 that “James Garner is to the American character what David Niven was to the English character: a lover in preference to a fighter (but capable of heroics), worldly and charming with elements of the vagabond and the debonair rascal, a sort of innocent rogue with an easy way with urbane dialogue.”\n\nGarner was fastidious about the kind of roles and movies in which he performed.\n\n“I don’t want to do movies with a lot of profanity, and I don’t want to take my clothes off,” he once said. “I don’t do horror pictures, or I would take my clothes off. Seriously, I’m simply not an exhibitionist.”\n\nHis guy-next-door demeanor also vaulted him to stardom in TV commercials. Teamed with Mariette Hartley as a bantering couple, Garner appeared in a series of Polaroid spots in the ’80s that were invariably more entertaining than the shows they sponsored.\n\nAt the time, people would walk into a store and ask for a “James Garner camera.” His pairing with Hartley was so endearing that folks used to regularly ask him, “How’s your wife?” meaning Hartley.\n\nGarner’s real wife, Lois, survives him. They dated for two weeks and were married for 56 years.\n\nJames Scott Bumgarner was born of European and Cherokee ancestry on April 7, 1928, in Norman, Oklahoma. When his mother died, Garner, then 4, and his two brothers went to live with relatives. At 16, he joined the Merchant Marine Academy for a stint that would be shortened because of seasickness, then followed his father to Los Angeles. He briefly attended Hollywood High School but left when he got a job modeling Jantzen bathing suits for ads.\n\n“I wasn’t interested until I heard they were paying $25 an hour,” Garner wrote in his 2011 autobiography The Garner Files. “That was more than the principal made!”\n\nSTORY James Garner’s Actor Brother Dies at 84\n\nGarner was drafted into the Army, served in combat for 14 months during the Korean War and received two Purple Hearts. After his discharge (“first time I ever got kicked out of anything honorably,” he quipped), he returned to Norman and attended the University of Oklahoma on the GI Bill.\n\nThe introverted Garner said he never really wanted to act, nor did he train for it. He came to show business haphazardly: A pal, Paul Gregory, had become an agent-producer and offered him a nonspeaking part as a judge in the 1954 Broadway production of The Caine Mutiny Court-Martial, directed by Charles Laughton and starring Henry Fonda and Lloyd Nolan.\n\n“I learned to listen,” he told the Archive of American Television in a 1999 interview. “The trouble with a lot of actors is they are waiting for their line, waiting for themselves to speak. If you listen, you become involved. … I learned to never anticipate. That helped me a lot as an actor.”\n\nAfter signing with Warner Bros., appearing in several films in 1956 and playing bit parts on ABC’s Cheyenne, Garner got the role of wisecracking ladies man Bret Maverick, starting at $500 a week. The series, airing on Sunday nights, often bested The Ed Sullivan Show in the ratings.\n\nWhen he was laid off as a consequence of a writers strike that shut down production, he sued Warners (his lawyer was future Disney president Frank Wells) and got out of his contract.\n\n(TV’s Maverick, by the way, was a member of the original ownership group of the Dallas Mavericks, the NBA expansion team that began play in 1980.)\n\nPHOTOS 35 of 2014’s Most Anticipated Movies\n\nThe movie business came calling, and Garner soon made such films as the POW classic The Great Escape (1963); the 1964 military comedy-drama The Americanization of Emily (he played what he described as a “downright coward” in what he called his favorite film); Grand Prix (1966), which got him hooked on auto racing; Mister Buddwing (1966), in which he played an amnesiac wandering the streets of New York; Hour of the Gun (1967) as Wyatt Earp; Support Your Local Sheriff! (1969) and a 1971 sequel; Marlowe (1969) as the fabled L.A. gumshoe; and Skin Game (1971), another Western. Some were produced by his company, Cherokee Productions.\n\nAfter starring as a turn-of-the-century sheriff in the series Nichols (1971 to 1972), Garner hit his stride in 1974, when he was signed to star as Jim Rockford, who lived in a trailer in a Malibu beach parking lot after serving a stint in San Quentin for a crime he didn’t commit. Rockford had a penchant for reopening and cracking cold cases, often riling the police. Garner’s insouciant style made the Friday night show from Universal TV a fan favorite.\n\n“I would get beat up at least twice per show,” he once said. “I don’t know about people; they like to see me get whipped. I guess it’s because they know I’m going to come back later and get my licks in.”\n\nGarner said he had to quit the show under doctors’ orders, and Universal sued. He later battled the studio in court over syndication profits, and it took years to resolve that dispute. Because of the conflict, the Rockford character would not reemerge until 1994. Garner then reprised the role in eight 1990s telefilms.\n\nIn Murphy’s Romance, Garner played a freethinking, small-town pharmacist who gallantly offers a struggling young woman (Field) a helping hand and friendly shoulder. Field once said that her onscreen kiss with Garner was the best one she had ever experienced on film.\n\nA year earlier, he earned a Golden Globe nomination for his compelling performance as a terminally ill physician opposite Mary Tyler Moore in the 1984 telefilm Heartsounds.\n\nMemorable credits later in his career include an Emmy for the telefilm Promise (1986), playing a man who takes care of his schizophrenic brother; My Name Is Bill W (1989), a TV drama of the life of the founder of Alcoholics Anonymous; the HBO movie Barbarians at the Gate, based on the book detailing the viciousness of corporate acquisitions and mergers; the sitcom 8 Simple Rules, which he joined following the death of John Ritter; and Space Cowboys (2000) opposite Clint Eastwood.\n\nHe also had a role in the 1994 movie Maverick, starring Mel Gibson and Jodie Foster. And in 2004, Garner played the older version of Ryan Gosling in the Nicholas Sparks-adapted The Notebook opposite Gena Rowlands.\n\nIn addition to Lois, survivors include a daughter and stepdaughter. One of his older brothers, Jack, also an actor, died in September 2011.\n\nDuring the Archive of American Television interview, Garner was asked about becoming a star. “It’s not something I wanted to achieve, being famous,” he said. “I was just trying to make a living.”\n\nTwitter: @mikebarnes4"}, {"url": "https://tubitv.com/series/300008153/the-rockford-files", "page_content": "We're Sorry.\n\nTubi is the largest free movie and TV streaming service in the US. Unfortunately, we're not currently available in your area.\n\nWatch this webpage to see when Tubi is available in your area."}], "Tristan Rogers appeared in the American television series Charlie's Angels.": [{"url": "https://www.closerweekly.com/posts/charlies-angels-cast-heres-what-happened-to-each-of-them/", "page_content": "Before Charlie’s Angels was a franchise, it was a phenomenally successful TV show of the 1970s (currently airing on the MeTV network) that turned its three leading ladies — Kate Jackson, Farrah Fawcett and Jaclyn Smith — into genuine pop culture superstars, whose lives have gone in varied directions since. Over the years, the franchise has enjoyed some highs (the 2003 film starring Drew Barrymore, Cameron Diaz and Lucy Liu), a definite low (the 2011 TV series reboot with Annie Ilonzeh, Rachael Taylor and Minka Kelly) and a less-than-critically embraced new attempt at big screen success from director/producer/writer Elizabeth Banks starring Kristen Stewart, Naomi Scott and Ella Balinska. But no matter what happens with the title, it’s the original version that remains the most prominent, its stars the ones people remain most curious about.\n\n“As with everything else, you look at a show differently when you’re in your 20s and 30s, or even your 50s, than you did when you were 12-years-old,” observes author Ed Robertson, who also serves as host of the TV Confidential podcast. “When you’re 12, with Charlie’s Angels you just looked forward to the scene where Jaclyn Smith would be in her bikini and that’s it. But what I discovered later, which I’d forgotten, is that not only in the pilot but also in the first 10 or 12 shows they produced before it went on the air, they were much different in scheme and approach to the Charlie’s Angels we know today.\n\nMoviestore/Shutterstock\n\n“Those episodes,” he continues, “were about a trio of detectives who were very, very good at what they did. The fact that they were women was really ancillary, because they were not only good detectives, they would pull off cons as part of their undercover operation. The scripts weren’t Shakespeare, but they were able to go a little more into depth. The pilot is very good and I’m not surprised that it sold, because it moved quickly, was smart and well cast.”\n\n“On television at the time, there was Wonder Woman and The Bionic Woman, though Stephanie Powers really kind of kicked things into high gear in the ‘60s with The Girl from U.N.C.L.E. as far as the superhero type of female goes,” says Herbie J Pilato, author of Glamour, Gidgets, and the Girl Next Door as well as host of Amazon and Shout TV’s Classic TV talk show, Then Again with Herbie J Pilato. “But Charlie’s Angels took it to the next level. It had Farrah Fawcett, who had done a lot of commercials and was the Wella Balsam girl; Kate Jackson had done The Rookies and, early on, Dark Shadows; and Jaclyn Smith was kind of a newcomer. So they had built their audiences separately and for the audience it just seemed to be the right time for three women working together.”\n\nMPI; Viacom Enterprises\n\nAs Jack Condon, co-author of The Charlie’s Angels Casebook with David Hofstede, explains it, the show went through several different phases on its way to the series audiences know. “Initially,” he explains, “producers Aaron Spelling and Leonard Goldberg were looking for something to cast Kate Jackson in, because she had been in the series The Rookies from 1972 to 1974. When she was on that show, it was an all male cast except for her, but she received more fan mail than any of the other regulars, so they knew they wanted to put Kate in some sort of vehicle. But there were different phases.”\n\nThe roots of the show came from Leonard Goldberg’s penchant for the British TV series The Avengers, which featured Diana Rigg as Emma Peel; while Aaron Spelling had done Honey West with Anne Francis in the ‘60s. For this reason, both of them liked the idea of doing some sort of series focused on women.\n\nStudio Canal/Shutterstock\n\nSays Jack, “Originally the show was going to be called The Alley Cats, which was kind of an acronym for the three women, Allie, Lee and Katherine. At that time, they were going to be Emma Peel-like characters where they’d be karate-chopping, leather-clad women fighting crime. Interestingly enough, when they started to do the first concept, they actually asked Ernest Tidyman, who wrote The French Connection, to write the script. But whatever he developed wasn’t really what Spelling and Goldberg wanted, so they went to Ivan Goff and Ben Roberts, who’d just finished a run doing Mannix with Mike Connors. They penned the script and met with Kate Jackson.\n\nPoints out Mike Pingel, author of Angelic Heaven: A Fan’s Guide to Charlie’s Angels and Channel Surfing: Charlie’s Angels, and webmaster at Charliesangels.com, “I would say that Kate was the backbone of the Angels team of 1976. Her character, Sabrina Duncan, was tagged as the smart Angel. In truth, Kate Jackson herself as an actress is one of the reasons that the show came to life, because it was originally her vehicle.”\n\n“It was not so much the time for Charlie’s Angels and the female empowerment that show brought, it was Kate’s time,” notes Herbie. “It just so happened that she was onscreen with these other two charismatic women. But it was supposed to be her show. It was built around her, so she was the essential glue of it that initially brought people in.”\n\nFor much more on Charlie’s Angels, please scroll down.\n\nBe sure to check out and subscribe to our Classic TV & Film Podcast for interviews with your favorite stars!"}, {"url": "https://screencrush.com/charlies-angels-then-and-now/", "page_content": "In 2000, former commercials director McG resurrected classic '70s television series 'Charlie's Angels' for a flashy, exciting and totally modern big screen adaptation. Featuring the trio of Drew Barrymore, Cameron Diaz and Lucy Liu, the action comedy followed three ass-kicking heroines and private investigators who work for an unseen millionaire named Charlie. With the help of go-between Bosley (Bill Murray), the Angels must work to uncover the secret behind a kidnapped software genius. Thirteen years later, we revisit the cast of this fun flick and see what they're up to now.\n\nCameron Diaz, Natalie Cook\n\nColumbia/Getty Images Columbia/Getty Images loading...\n\nThen: Cameron Diaz played Natalie Cook, the goofy and klutzy Angel. She eventually meets and develops a crush on a guy named Peter while working undercover. Jenny McCarthy also auditioned for the role of Natalie.\n\nNow: Diaz recently appeared in 'The Counselor,' in which she had a very memorable scene with a car. Next she'll play Miss Hannigan in the big screen version of 'Annie' and appears alongside Leslie Mann and Kate Upton in the women's revenge comedy 'The Other Woman.'\n\nDrew Barrymore, Dylan Sanders\n\nColumbia/Getty Images Columbia/Getty Images loading...\n\nThen: Former child star Drew Barrymore played Dylan Sanders, the rowdy tomboy of the Angels. Barrymore co-produced and cast herself in the film.\n\nNow: Barrymore garnered acclaim for her role as Little Edie Beale in the HBO feature film version of 'Grey Gardens' a few years back, and made her directorial debut with 'Whip It.' She recently appeared in 'Big Miracle,' and can be seen next reuniting with her 'Wedding Singer' and '50 First Dates' co-star Adam Sandler in the rom-com 'Blended.'\n\nLucy Liu, Alex Munday\n\nColumbia/Getty Images Columbia/Getty Images loading...\n\nThen: The role of tech-savvy and clever Alex Munday was incredibly tough to cast, and Lucy Liu really nailed the part. Before she got it, Angelina Jolie was approached but bowed out when she admitted she didn't like the original series, and Thandie Newton was locked in until freak weather conditions delayed her on the set of 'Mission: Impossible II.' Dozens of other actresses were considered before Liu took the role, including Salma Hayek, Liv Tyler, Penelope Cruz, Ashley Judd, Gwyneth Paltrow, Kate Winslet and Reese Witherspoon ... and that's not even half of them.\n\nNow: Liu played O-Ren Ishii in Quentin Tarantino's 'Kill Bill' films and voiced Master Viper in the 'Kung Fu Panda' films. She recently appeared in 'The Man with the Iron Fists' and currently plays Joan Watson on 'Elementary,' CBS's Sherlock Holmes show.\n\nBill Murray, John Bosley\n\nColumbia/Getty Images Columbia/Getty Images loading...\n\nThen: The star of comedy classics like 'Ghostbusters' and 'Groundhog Day' played John Bosley, the assistant to the mysterious Charlie, who helps the Angels connect with their unseen boss for assignments.\n\nNow: Murray declined to appear in the sequel, and these days he's very selective about the roles he takes. He's appeared in several Wes Anderson films, including 'Rushmore' and 'The Royal Tenenbaums,' the recent 'Moonrise Kingdom,' and the upcoming 'The Grand Budapest Hotel.'\n\nSam Rockwell, Eric Knox\n\nColumbia/Getty Images Columbia/Getty Images loading...\n\nThen: Sam Rockwell played software genius Eric Knox, who is kidnapped and needs the Angels' help -- but things aren't always what they seem. Rockwell previously appeared in the films 'The Green Mile' and 'Galaxy Quest.'\n\nNow: He reunited with Barrymore two years later for 'Confessions of a Dangerous Mind,' and has appeared in the films 'Moon,' 'Seven Psychopaths' and 'The Way, Way Back.' He can be seen in the upcoming 'Poltergeist' remake.\n\nKelly Lynch, Vivian Wood\n\nColumbia/Getty Images Columbia/Getty Images loading...\n\nThen: Kelly Lynch played Eric Knox's partner, Vivian Wood. You may recognize her from previous roles in 'Cocktail' and 'Virtuosity.'\n\nNow: Lynch reunited with Bill Murray for the critically panned indie 'Passion Play' in 2011 and starred on the Starz series 'Magic City.'\n\nCrispin Glover, Thin Man\n\nColumbia/Getty Images Columbia/Getty Images loading...\n\nThen: 'Back to the Future' star Crispin Glover played Thin Man, a mysterious criminal who had something to do with the kidnapping of Eric Knox. The character originally had lines, but Glover didn't like them and asked them to be removed to give his character more mystery. Thin Man's other quirks, like ripping out and smelling women's hair, were also Glover's idea.\n\nNow: Glover reprised the role of Thin Man for the sequel, and has since appeared in Tim Burton's 'Alice in Wonderland' and had a small role in 'Hot Tub Time Machine.' He recently had a cameo in 'Seven Psychopaths' with 'Charlie's Angels' star Sam Rockwell.\n\nTim Curry, Roger Corwin\n\nColumbia/Getty Images Columbia/Getty Images loading...\n\nThen: Tim Curry played Roger Corwin, the man believed to be responsible for kidnapping Eric Knox. Curry was known best for roles in 'The Rocky Horror Picture Show,' 'Clue' and 'Home Alone 2.'\n\nNow: He mostly does voice work these days, and has lent his voice to 'Star Wars: The Clone Wars' as Palpatine, a role he will reprise for the upcoming 'Star Wars Rebels' animated TV series.\n\nMatt LeBlanc, Jason Gibbons\n\nColumbia/Getty Images Columbia/Getty Images loading...\n\nThen: Matt LeBlanc played Jason Gibbons, an actor and love interest for Alex -- but you probably know him best for playing another actor: Joey Tribbiani on TV's 'Friends.'\n\nNow: LeBlanc has made a career out of playing actors, actually, and won a Golden Globe for playing a fictional version of himself on the series 'Episodes.'\n\nLuke Wilson, Peter Kominsky\n\nColumbia/Getty Images Columbia/Getty Images loading...\n\nThen: Luke Wilson played Peter Kominsky, a waiter whom Natalie meets at a party while working undercover; the two fall for each other, of course. Wilson previously appeared in 'Home Fries' with Drew Barrymore.\n\nNow: Wilson reprised his role for the sequel, and has starred in films like 'The Royal Tenenbaums,' 'Idiocracy' and 'Death at a Funeral.' He recently reprised the role of anchorman Frank Ritchard in 'Anchorman 2: The Legend Continues.'\n\nMelissa McCarthy, Doris\n\nColumbia/Getty Images Columbia/Getty Images loading...\n\nThen: Back when she had just started appearing on 'Gilmore Girls' and had only a couple of small acting credits to her name, a then-unknown Melissa McCarthy had a tiny role in 'Charlie's Angels' as a secretary."}, {"url": "https://www.looper.com/950309/the-only-charlies-angels-actress-who-stayed-through-the-whole-series/", "page_content": "The Only Charlie's Angels Actress Who Stayed Through The Whole Series\n\nCommon social media parlance often suggests that the only period of television history that really matters is the last 25 or so years. On some level, that recency bias can be reasonably accounted for; it was the 21st century that saw the rise of \"Peak TV,\" with its increasingly high production values, standards of writerly and directorial quality on par with any award-winning movie you could name, and relaxed, de-stigmatized boundaries between the realms of big- and small-screen-bound production. But the hype around \"Peak TV\" often leads us to overlook the importance that older, less agreeably prestigious TV shows hold as building blocks of our current media landscape — as is the case of the original \"Charlie's Angels.\"\n\nWhat we now know as a huge media franchise — complete with two different star-studded cinematic iterations — started out, after all, as a popular yet critically belittled spy drama show on ABC in the mid-'70s. Originally starring Kate Jackson, Farrah Fawcett, and Jaclyn Smith as the titular crime-fighting private investigators at the Charles Townsend Agency, the Ivan Goff and Ben Roberts-created series quickly became an audience sensation and went on to cast a long shadow over American pop culture. But, like any hit TV show, \"Charlie's Angels\" also faced some growing pains — as exemplified by the fact that only one of its original Angels stayed with the show to the very end of its five-season, 115-episode run. Keep on reading to find out who that was, and why she was the only one."}, {"url": "https://ultimateclassicrock.com/charlies-angels-last-episode/", "page_content": "It had been a pop-culture phenomenon, a ratings juggernaut that spawned massive merchandising and pinup posters across the globe. Still, when Charlie’s Angels aired its final episode on June 24, 1981, the show looked much different than when it began.\n\nGone was Farrah Fawcett, the blonde bombshell who helped the series take flight, yet departed after just one season (though she did make several guest appearances after leaving the cast). Fellow founding Angel Kate Jackson left following the third season, upset with what she deemed to be poor script quality. With ratings sagging, Shelley Hack - who appeared on the show only in season four - was replaced for what would be the final season with Tanya Roberts, who played a street-smart former model named Julie Rogers.\n\nDespite - or, perhaps, because of - all these changes, Charlie’s Angels was unable to maintain the sensational momentum it had established in its first two seasons. Early on, the show was the hottest thing on TV, spawning board games, dolls, lunch boxes, trading cards, a makeup line and just about any other merchandise tie-in you could imagine. But by 1981 the writing was on the wall. ABC pulled the plug on the program, but not before the series finale took a trip down memory lane.\n\nIn the final episode, Kelly, played by Jaclyn Smith and the only Angel to appear in every episode, was shot point blank by a suspect she was tailing. This established the plot’s framework, as other main characters gathered at the hospital and reminisced while awaiting news on their wounded colleague. Flashbacks featured clips from earlier seasons, allowing fans to relive big moments one last time.\n\nStill, every finale needs a climactic reveal, and Charlie’s Angels delivered … kind of. From day one, the identity of the titular Charlie was never disclosed. Viewers were given occasional glimpses of his arm or the back of his head, and bits and pieces of information were disclosed - such as his work for the Office of Strategic Services during World War II - but his complete background remained a mystery. Most notably, the character’s face was never shown.\n\nWatch the Final Scene of the 'Charlie's Angels' Series Finale\n\nIn the final episode, Charlie visited Kelly in the hospital and aided in the doctor's life-saving surgery. Still, the injured Angel heard only his voice, and though the character's face was finally shown onscreen, it was shrouded by a hospital mask - preserving the mystery.\n\nThe real-life story behind Charlie was less secret. The character was voiced by actor John Forsythe, who agreed to the gig as a last-minute favor to the show’s producer, Aaron Spelling. Forsythe recorded all of his lines separately, didn’t receive a credit for his work and never set foot onto the Charlie’s Angels set. A body double was used for any instances in which part of Charlie was shown, including the finale's hospital scene. \"I thought the mystique would help it,\" Forsythe recalled years later during an interview with the Television Academy. \"It was an unusual thing when you just had a voice as the commanding figure.\"\n\nThough the original Charlie’s Angels signed off on June 24, 1981, it didn’t take long for producers to start pondering reunions and reboots.\n\nIn 1988, four women, including Tea Leoni, were cast for a spin-off appropriately titled Angels '88. Production delays ultimately crushed the project's momentum, and the show never made it to air.\n\nIn 1991, Spelling relayed the premise for a potential Charlie’s Angels reunion to Entertainment Weekly: ”All the girls have gone off on their own lives,” the producer explained, “and they come back after all these years because someone has murdered Charlie.” Again, the project would fail to come to fruition.\n\nThough these efforts to revitalize the franchise on television (including a short-lived 2011 reboot) failed, Charlie’s Angels has enjoyed success on the silver screen. Charlie's Angels (2000) and Charlie's Angels: Full Throttle (2003) starred Cameron Diaz, Drew Barrymore and Lucy Liu. Both pictures were box-office successes, combining to take in more than $500 million. The 2019 movie Charlie’s Angels - starring Kristen Stewart, Naomi Scott and Ella Balinska - was a more modest success, taking in approximately $73 million."}, {"url": "https://www.looper.com/169415/charlies-angels-reboot-release-date-cast-plot-and-trailer/", "page_content": "Of course, the biggest question going into the Charlie's Angels reboot is about the Angels themselves. The core three stars of the film will either make or break its success, so naturally, the trio has to complement each other perfectly — and looking at these Angels, it looks like a mix of established stars and relative newcomers that could prove to be pretty successful.\n\nAs the most recognizable name among the Angels, Kristen Stewart is leading the charge as Sabina Wilson. You probably know her best from the Twilight film series, but you might have also seen her in blockbuster fare like Snow White and the Huntsman, Oscar winners like Still Alice, and arthouse films like Clouds of Sils Maria, for which she became the first American actress to win France's Oscar equivalent, the Cesar Award.\n\nNaomi Scott, who plays Elena Houghlin, is no stranger to reboots; she's best known for her starring role as Princess Jasmine in the 2019 live-action version of Aladdin and also appeared in 2017's Power Rangers movie as the Pink Ranger. Finally, the trio is completed by Ella Balinska as Jane Kano, a fledgling British performer with no other high-profile projects to make her a household name stateside; but with Scott and Stewart by her side, she'll surely be a star in no time."}, {"url": "https://www.wonderwall.com/entertainment/where-are-they-now/charlies-angels-stars-actresses-where-are-they-now-3021531.gallery", "page_content": "It's been 45 years since the hit crime-drama series \"Charlie's Angels\" first graced our television screens! To mark the milestone on Sept. 22, 2021, Wonderwall.com is taking a look back at the actresses who've played Angels — whether on television or on the silver screen — to see how they've changed over the years. Keep reading to find out where they are now… RELATED: Bridget Jones and more of the most relatable pop culture heroines\n\nJaclyn Smith starred as Angel Kelly Garrett on every season of the original \"Charlie's Angel\" television series from 1976 to 1981. RELATED: \"Alias\" cast: Where are they now?\n\nOnce \"Charlie's Angels\" came to the end of its run, Jaclyn Smith started appearing in various TV movies and miniseries. Among them? \"The Night They Saved Christmas\" in 1984, \"Florence Nightingale\" in 1985 and many Danielle Steel novel adaptations like \"Kaleidoscope\" in 1990 and \"Family Album\" in 1994. She was the only Angel to reprise her former character when she appeared as Kelly Garrett in the 2003 movie \"Charlie's Angels: Full Throttle,\" the second installment in the film franchise. Jaclyn took a break from acting from 2005 to 2010 then returned with a guest role on \"Law & Order: Special Victims Unit.\" In 2019, she appeared in the Lifetime holiday movie \"Random Acts of Christmas\" and made a cameo in the 2019 \"Charlie's Angels\" reboot. In 2021, she appeared on an episode of \"All American.\" She's been married to fourth husband Brad Allen since 1997 and has two children, Gaston and Spencer, with former husband Tony Richmond. RELATED: The biggest box office bombs\n\nOne of the most famous Angels in history is Farrah Fawcett, who played Jill Munroe on the first season of the original television show from 1976 to 1977.\n\n\"Charlie's Angels\" launched Farrah Fawcett's career. She continued to work on the small screen after leaving the show though she also popped up as a guest star every now and then. She picked up some Emmy and Golden Globe nominations in the '80s for her work in the TV movies \"The Burning Bed\" and \"Small Sacrifices.\" She appeared on shows like \"Spin City\" and \"The Guardian\" while also conquering the big screen in movies like \"The Apostle,\" \"Logan's Run\" and \"The Cannonball Run.\" Farrah was diagnosed with cancer in 2006 and died in 2009 at 62. She was involved with an old flame, former University of Texas football star Greg Lott, whom she'd previously dated in college, when she passed away. She had one son, Redmond O'Neal, with former boyfriend Ryan O'Neal.\n\nKate Jackson brought Angel Sabrina Duncan to life on the first three seasons of the original \"Charlie's Angels\" TV show.\n\nKate Jackson left \"Charlie's Angels\" after the third season and headed straight to the big screen. She starred opposite Harry Hamlin in the 1982 flick \"Making Love\" and followed that up with the television show \"Scarecrow and Mrs. King.\" Like co-star Farrah Fawcett, she also battled cancer, though Kate's breast cancer went into remission in the late '80s. Kate (seen here in 2006) spent the '90s and '00s starring in TV movies like \"Empty Cradle\" and \"Quiet Killer\" and appeared on \"Criminal Minds\" in 2007. She's been married three times — first to Andrew Stevens from 1978 to 1981, then to David Greenwald from 1982 to 1984, and finally to Tom Hart from 1991 to 1993. In 1995, she adopted son Charles.\n\nCheryl Ladd replaced Farrah Fawcett as an Angel on season 2 of the original \"Charlie's Angels\" television series, on which she portrayed newbie Kris Munroe.\n\nAfter the show ended, Cheryl Ladd continued to work on television — mainly in TV movies. She also made the leap to the big screen in 1984's \"Purple Hearts,\" 1992's \"Poison Ivy\" and 1998's \"Permanent Midnight,\" to name a few. She popped up on other popular shows as a guest star, like \"Charmed,\" \"Hope and Faith\" and \"CSI: Miami.\" She had a recurring role on \"Las Vegas\" from 2003 to 2008 and more recently was in Christmas flicks like 2018's \"The Christmas Contract,\" 2019's \"Grounded for Christmas\" and 2020's \"Christmas Unwrapped.\" She'll next appear in the film \"A Cowgirl's Song.\" Aside from acting, Cheryl has written a children's book and an autobiography. She's married to Brian Russell and shares one child, daughter Jordan, with former husband David Ladd.\n\nShelley Hack popped up on season 4 of the original \"Charlie's Angels\" TV series, stepping in after Kate Jackson left the show. She played Tiffany Welles.\n\nShelley Hack landed a lot of smaller roles after her \"Charlie's Angels\" run, including in projects like Martin Scorsese's \"The King of Comedy\" in 1983. She also had recurring roles on two TV shows in the '80s: \"Cutter to Houston\" and \"Jack and Mike.\" She retired from acting in the '90s and changed courses completely, shifting over to politics! She started producing presidential debates overseas, transitioning into work behind the scenes in television, mainly in Eastern Europe. She married Harry Winer in 1990. They have a daughter, Devon.\n\nSeason 5 of the original \"Charlie's Angels\" TV show introduced a new Angel: Julie Rogers. She was played by Tanya Roberts.\n\nAfter Tanya Roberts starred on the final season of \"Charlie's Angels,\" she appeared in a few films including \"The Beastmaster\" and an Italian-made flick, \"Hearts and Armour.\" She picked up a few Razzie Award nominations in her day — first for her work in 1984's \"Sheena: Queen of the Jungle\" and again for her performance in the James Bond flick \"A View to a Kill.\" Later, she was known for her recurring role as Midge on \"That '70s Show\" from 1998 to 2004. She was married to Barry Roberts from 1974 until his passing in 2006. In January 2021, Tanya died at 65 from a blood infection sparked by a urinary tract infection that was complicated by her history with hepatitis C.\n\nCameron Diaz starred as good girl Natalie Cook in the first two two movies in the franchise: 2000's \"Charlie's Angels\" and 2003's \"Charlie's Angels: Full Throttle.\"\n\nBetween the first two installments in the \"Charlie's Angels\" film franchise, Cameron Diaz signed on to voice Princess Fiona in the \"Shrek\" movie series. She also picked up a Golden Globe nomination for her work in \"Gangs of New York\" in 2003 and starred in the drama \"In Her Shoes\" in 2005 and the Christmas film \"The Holiday\" in 2006. In 2014, after starring in the \"Annie\" reboot, Cameron revealed she was retiring from acting altogether. She's released two books in the last decade: \"The Body Book\" in 2013 and \"The Longevity Book\" in 2016. She's been married to Good Charlotte rocker Benji Madden since 2015. They welcomed a daughter, Raddix, in December 2019.\n\nLucy Liu starred as former rich kid Alex Munday in the first two movies, 2000's \"Charlie's Angels\" and in 2003's \"Charlie's Angels: Full Throttle.\"\n\nAfter playing Alex Munday, Lucy Liu continued to have a successful film career. She starred in \"Kill Bill: Vol. 1\" and \"Kill Bill: Vol. 2\" in 2003 and 2004, \"Lucky Number Slevin\" in 2006 and \"Set It Up\" in 2018. She also made a name for herself on the small screen, starring on series like \"Cashmere Mafia,\" \"Southland,\" \"Elementary\" and, more recently, \"Why Women Kill.\" Lucy's also lent her voice to many children's films like the \"Kung Fu Panda\" franchise and \"Mulan II.\" In 2023, she'll portray Kalypso in \"Shazam! Fury of the Gods.\" She welcomed a child as a single mom in 2015, adding son Rockwell to her family.\n\nDrew Barrymore starred as rebellious Dylan Sanders in 2000's \"Charlie's Angels\" and in 2003's \"Charlie's Angels: Full Throttle.\"\n\nAfter 2003's \"Charlie's Angels: Full Throttle,\" Drew Barrymore starred in a slew of popular films including \"50 First Dates\" in 2004 and \"Fever Pitch\" in 2005. She also had a role in the ensemble flick \"He's Just Not That Into You\" in 2009. More recently, she starred on the Netflix series \"Santa Clarita Diet.\" She also became a successful producer with her Flower Films company (she even worked on the short-lived 2011 \"Charlie's Angels\" TV show reboot). Since playing an Angel, Drew has divorced second husband Tom Green (who appeared in the first \"Charlie's Angels\" film), dated the Strokes drummer Fabrizio Moretti and actor Justin Long, and married and divorced art consultant Will Kopelman, with whom she shares daughters Olive and Frankie. She launched her eponymous CBS talk show in September 2020 (and welcomed \"Charlie's Angels\" co-stars Cameron Diaz and Lucy Liu as her very first guests!).\n\nMinka Kelly starred as Eve French on the short-lived 2011 TV reboot of \"Charlie's Angels,\" which former movie-Angel Drew Barrymore produced. ABC canceled the series after just a few months, with only seven episodes making it on the air.\n\nMinka Kelly had already made a name for herself on \"Friday Night Lights\" and \"Parenthood\" before she joined the \"Charlie's Angels\" TV reboot cast. After the series was canceled, she most notably starred on the series \"Almost Human\" and had roles on shows like \"The Path\" and \"Jane the Virgin\" before landing the role of Dawn Granger on \"Titans.\" In 2021, she'll appear in the film \"Lansky.\" Minka's long made headlines for her personal life: She dated baseball player Derek Jeter from 2008 to 2011 and \"Grey's Anatomy\" actor Jesse Williams in 2017 and 2018. She and comedian Trevor Noah debuted their romance in the summer of 2020.\n\nAnnie Ilonzeh played Kate Prince, another Angel on the 2001 ABC TV reboot of \"Charlie's Angels.\"\n\nSince her brief run as an Angel, Annie Ilonzeh has been busy on the small screen. She's had roles on shows like \"Arrow,\" \"Empire\" and \"Drop Dead Diva\" and more recently landed a gig on \"Chicago Fire\" from 2018 to 2020. In 2021, she appeared on the TV series \"The Lower Bottoms.\" She made headlines in early 2019 when she briefly dated retired basketball star Shaquille O'Neal.\n\nRachael Taylor portrayed Abigail Simpson on ABC's 2011 \"Charlie's Angels\" reboot."}, {"url": "https://www.ranker.com/list/full-cast-of-charlie_s-angels-cast-list-for-the-show-charlie_s-angels/reference", "page_content": "Charlie's Angels cast list, including photos of the actors when available. This list includes all of the Charlie's Angels main actors and actresses, so if they are an integral part of the show you'll find them below. You can various bits of trivia about these Charlie's Angels stars, such as where the actor was born and what their year of birth is. This cast list of actors from Charlie's Angels focuses primarily on the main characters, but there may be a few actors who played smaller roles on Charlie's Angels that are on here as well.\n\nItems include everything from Minka Kelly to Kurt Russell\n\nIf you are wondering, \"Who are the actors from Charlie's Angels?\" or \"Who starred on Charlie's Angels?\" then this list will help you answer those questions.\n\nIn most cases you can click on the names of these popular Charlie's Angels actors and actresses to find out more information about them. If you're looking for a particular Charlie's Angels actor or actress, then type their name into the \"search\" bar to find them directly."}, {"url": "https://cinemascholars.com/scholars-spotlight-charlies-angels/", "page_content": "In this Spotlight feature, we will feature biographies of all 6 ladies that starred on the ABC television show Charlie’s Angels from 1976-1981. This will be done in the order that the actresses were cast on the series.\n\nThis isn’t just a series of biographies. Within the biographies are details pertaining to the creation of the show. As well as behind-the-scenes events of Charlie’s Angels via the biographical entry that the information applies to.\n\nYou’ll also learn that Jaclyn Smith had connections to both Farrah Fawcett and Kate Jackson. Either through modeling or by being the spouse of a cast member on a hit daytime television show. This was prior to the conception of Charlie’s Angels.\n\nKate Jackson\n\nLucy Kate Jackson was born on October 29, 1948, in Birmingham, Alabama. Jackson attended college at the University of Mississippi as well as Birmingham Southern College. However, she failed to graduate from either school.\n\nJackson was bitten by the acting bug early on, and after an apprenticeship at the Stowe Playhouse in Stowe, Vermont, the aspiring actress headed to New York City to study acting at the American Academy of Dramatic Arts.\n\nWhile going to school she worked at NBC as a page and tour guide. She routinely auditioned for roles around town. Her big break came in 1970, when she was cast as Daphne Harridge on the ABC soap opera Dark Shadows. A role that lasted 71 episodes. The following year she played Tracy Collins in the movie Night of Dark Shadows.\n\n“I left my mark on ‘Dark Shadows.’ One day I was doing my lines perfectly from Act 3. Everyone else was doing Act 2.” – Kate Jackson\n\nIn 1972, Jackson was cast as Nurse Jill Danko on the ABC police show The Rookie, which ran for 4 seasons. This show was a Spelling/Goldberg production. In her contract, she was obligated to star in another television series for Spelling/Goldberg Productions upon that show’s cancellation.\n\nThe show they pitched was called The Alley Cats and it was about 3 women that would fight crime in back alleys with whips and chains. Goldberg and Spelling wanted Jackson for the lead. The actress wasn’t crazy about the name, as well as some of the series’ outlandish concepts.\n\nShe suggested the title “Angels” after noticing a picture of three angels hanging in Aaron Spelling’s office. That soon switched to Harry’s Angels and the concept was updated to include a millionaire boss who owned a detective agency and often aided them in their assignments.\n\nABC decided to move ahead with the pilot solely based on these changes. However, they wanted the name changed to Charlie’s Angels so as to not confuse the audience with another show in production, Harry O.\n\nLeonard Goldberg wanted her to play Kelly Garret, who was the pilot episode’s main character. However, after reading the script, Jackson requested to play another Angel, Sabrina Duncan. Her request was granted.\n\nIn 1979, after 3 years of involvement with the show, things began to get rocky with the producers of Charlie’s Angels and Jackson. Jackson was already having on-set problems with Cheryl Ladd, who had replaced Farrah Fawcett on the series two years earlier.\n\nJackson was offered the role of Joanna Kramer in Kramer vs. Kramer. But Aaron Spelling would not accommodate changes to the shooting schedule in order to give her time off to do the film. This role which would of course go to Meryl Streep, who would win her first of several Oscars in the role.\n\nKate Jackson was starting to become extremely vocal and displeased about the poor quality scripts that she was receiving during the shows third season season. The actress would later state publicly:\n\n“The scripts are so light it would take a week to get to the floor if you dropped it from the ceiling.”\n\nThe combination of the perceived poor script quality as well as losing out on the Kramer vs. Kramer role caused Jackson to become nasty and belligerent on the set. She was fired by Spelling at the end of the 3rd Season.\n\nIn 1983, Jackson returned to television with Scarecrow and Mrs. King, which was developed by her production company Shoot The Moon Productions. This was co-owned by her then-husband, David Greenwald. The couple divorced the following year, after two years of marriage.\n\nJackson had previously been married to Stella Stevens’ son, Andrew. However, that marriage fell apart quickly when Jackson accused Stevens of being less than frugal with her Charlie’s Angel’s paychecks.\n\nDuring the filming of the final season of Scarecrow and Mrs. King in 1987, Jackson was diagnosed with breast cancer. She kept the news a secret from everybody but the show’s producer. She would film her scenes while taking painkillers and radiation treatment. Jackson would battle breast cancer, and win, a second time in 1989.\n\n“All women should understand that a mammogram is nothing to be afraid of. It’s not an enemy but a friend. Early detection is the key to the cure.” – Kate Jackson\n\nWhile recovering from Cancer, Jackson met Tom Hart. Hart was the owner of a Utah ski lodge. The pair married in 1991, and would be divorced 2 years later. Jackson has not appeared in a film or television show since 2009.\n\nFarrah Fawcett\n\nSpelled “Ferrah” on her birth certificate, Farrah Fawcett was born in Corpus Christi, Texas on February 2, 1947. Her mother made up the name Farrah because she felt that it went well with Fawcett.\n\nIn High School, Fawcett was voted “most beautiful” in each of her 4 years of attendance. In 1965 she attended the University of Texas, where she was voted one of the “10 most beautiful coeds on campus.”\n\nA Hollywood agent named David Mirisch saw Fawcett’s pictures and began to contact her about moving to Los Angeles to pursue a career in modeling. After two years of being pestered by Mirisch, Fawcett agreed. She moved to Hollywood in the summer of 1968.\n\nOnce Fawcett arrived in Hollywood, Screen Gems signed her to a $350 per week contract. She got her start by appearing in commercials for such products as Noxzema, Max Factor, Mercury cars, and Beautyrest mattresses.\n\n“Looking a certain way is a blessing and a curse.” – Farrah Fawcett\n\nFawcett’s earliest roles on television were guest appearances on shows such as The Flying Nun and I Dream of Jeannie. During this period the actress began to date the popular actor Lee Majors.\n\nFawcett also appeared on Getting Together, Owen Marshall: Counselor at Law, Mayberry R.F.D., The Dating Game (featuring a strange, staged fistfight), S.W.A.T., and The Partridge Family.\n\nFawcett’s early film roles were the 1969 French romantic drama Love Is a Funny Thing as well as the sex-change comedy Myra Breckenridge the following year. In 1973 she married Majors. She would go on to appear on his show The Six Million Dollar Man a total of four times.\n\nFawcett would also have a recurring role on Harry O. On it she played Sue Ingram, a stewardess that lived next door to the titular character. The show was canceled soon after she began to appear, and she was only in three episodes.\n\nIn 1976, shortly after the cancellation of Harry O, Pro Arts Inc. pitched the idea of a poster of Fawcett to her agent, which she agreed to. A photo-shoot was set up with photographer Bruce McBroom. For the photo-shoot, Fawcett styled her own hair and did her makeup, allegedly without the aid of a mirror.\n\n“I don’t think an actor ever wants to establish an image. That certainly hurt me, and yet that is also what made me successful and eventually able to do more challenging roles.” – Farrah Fawcett\n\nFawcett selected her 6 favorite pictures from 40 rolls of film. The choice was eventually narrowed to the one that became the most iconic and bestselling poster of all time. Because of the popularity of that poster, Fawcett scored a role in Michael Anderson’s science-fiction movie Logan’s Run (1976).\n\nFawcett and Majors often played tennis with producer Aaron Spelling. This connection helped Fawcett land the role of Jill Munroe in Spelling’s upcoming made-for-TV movie/series pilot, Charlie’s Angels. This was a movie of the week that aired on March 21, 1976, on ABC.\n\nThe Charlie’s Angels series proper was formally debuted on September 22, 1976. Each of the three actresses was launched into super-stardom. But it was Fawcett who was by far the most popular. That year she won the People’s Choice Award for Favorite Performer in a New TV Program.\n\n“When the show was number three, I thought it was our acting. When we got to be number one, I decided it could only be because none of us wears a bra.” – Farrah Fawcett\n\nDespite the huge success of the show, Fawcett earned far more in royalties from poster sales than from her salary for appearing in Charlie’s Angels. In the spring of 1977, Fawcett left Charlie’s Angels after only one season.\n\nthe actress had never officially signed her series contract with Spelling. This was due to protracted negotiations over royalties from the use of her image in peripheral products. This would lead to a messy and expensive lawsuit filed by Spelling and his company when she quit the show.\n\nAs a result of leaving her contract four years early, Fawcett signed a new contract with ABC, stating that she would make six guest appearances on Charlie’s Angels over a two year period. Fawcett and Majors split up in 1979 when she got involved with actor Ryan O’Neal. They wouldn’t divorce until 1982.\n\nFawcett made a few flops after leaving Charlie’s Angels, including Saturn 3 (1980), Sunburn (1979) and Somebody Killed Her Husband (1978). Her biggest success came in the movie and play versions of Extremities. Her performance received critical acclaim, including a Golden Globe Nomination for the 1986 movie version.\n\nThree years later, Fawcett would receive another Golden Globe nomination for The Burning Bed. In total, the accomplished actress would be nominated six times for this award during her lifetime.\n\n“I thought Marilyn Monroe was the most beautiful woman in the world and Elizabeth Taylor breathtaking. But when I see myself on the screen I say: ‘Oh shoot! What are they talking about?'” – Farrah Fawcett\n\nIn 1997, Fawcett would pose for Playboy at the age of fifty. In 2006, the actress would be diagnosed with anal cancer. She would succumb to the disease on June 25, 2009, at the too young age of 62.\n\nJaclyn Smith\n\nJacquelyn Ellen Smith was born in Houston, Texas on October 26, 1945. She attended Trinity University in San Antonio in 1964, but dropped out after a year to study ballet at the Balanchine School of American Ballet in New York City.\n\nSmith transitioned to acting while in New York City, and was offered the role of Victoria Winters on Dark Shadows in 1968, which she reportedly turned down. Although she didn’t end up on the series, she was married to Roger Davis, who was a regular on the series for the better part of a decade.\n\nBy the early 1970s, Smith had become a spokesmodel for both Breck and Wella Balsam shampoos. Her co-star on Charlie’s Angels, Fawcett, had also done some modeling for the latter shampoo brand.\n\n“Angels are like diamonds. They can’t be made, you have to find them. Each one is unique.” – Jaclyn Smith\n\nBy 1976, Smith had relocated to Los Angeles, and was mistakenly (and fortunately), given the opportunity to audition for Charlie’s Angels. Spelling and Goldberg were intent on casting a blonde, a brunette, and a redhead for the series.\n\nSince Jackson and Fawcett were already on board, the role of Kelly Garrett had to be filled by a redhead. Several hundred actresses auditioned for the role, The only non-redhead was Smith, who ended up with the coveted role due to her charisma and chemistry with Jackson and Fawcett.\n\nAlthough Smith was the last Angel to be cast, she was the only original one to remain on the show for its entire duration. After Charlie’s Angels ended in 1981, Smith appeared in many television movies including George Washington (1984), The Night They Saved Christmas (1984), and The Bourne Identity (1988).\n\nIn 1985 Smith became an entrepreneur by launching a fashion line sold at K-Mart. She cultivated this business into several others. The latest being the STYLE by Jaclyn Smith wig collection for Paula Young Wigs, in 2008. Smith was diagnosed with breast cancer in 2003 and like Jackson, she beat it.\n\n“I was the first actress who branded her own line at a time when everyone just lent their name to a product. Everyone said I shouldn’t do it, but it was probably the best thing I’ve ever done.” – Jaclyn Smith\n\n“Chemotherapy isn’t easy. I felt very fortunate I wouldn’t have to go through that.” – Jaclyn Smith\n\nSmith has been married to her fourth husband, Brad Allen, a cardiothoracic surgeon, since 1997. Prior to this she was married to actor Dennis Cole. Cole had appeared in a few episodes of Charlie’s Angels. She was also married to cinematographer Anthony Richmond (Legally Blonde), for eight years.\n\nCheryl Ladd\n\nCheryl Jean Stoppelmoor was born in Huron, South Dakota on July 12, 1951. After nineteen uneventful years, Stopprlmoor headed west, with ambitious dreams of becoming a professional singer.\n\n“My mother, grandmother and older sister all cooked, so it was hard to get into the kitchen. So I have no talent for cooking. I was always out in the garage with my dad. I have a tool belt. I’m a repair chick.” – Cheryl Ladd\n\nIn 1970 Stopprlmoor moved to Hollywood. She dropped her last name adopting “Moor” in its place. Early gigs hadf included the singing voice of Melody on Hanna Barbara’s Josie and the Pussycats.\n\n“I drew a line for myself…never dated anyone that could hire me when I was first in Hollywood, and I think that kept me focused on what I was there to do and how I wanted to go about it. I took it a step at a time.” – Cheryl Ladd\n\nMoor had once again changed her last name, this time to “Ladd,” when she got married to David Ladd in 1973. Ladd began to be cast in commercials and single-episode bit parts on television shows such as The Rookies, The Partridge Family, Police Woman, and Happy Days.\n\nHer big break in acting came when Farrah Fawcett quit the mega-hit series Charlie’s Angels in 1977, after only one season. Producers had noticed Ladd, and pursued her for a screen test, but she was not interested. Eventually, she relented and was cast. Ladd portrayed Kris Munroe, the sister of Fawcett’s character Jill.\n\nDuring this time she utilized her fame to land a guest spot on Carol Burnett, release some music that sold fairly well, and sing at the Super Bowl. She remained on Charlie’s Angels until it ended in 1981. Her first marriage ended around this time, and she married music producer Brian Russell soon after.\n\nThroughout the next several decades Ladd has kept busy in her career. During the 1980’s the actress and singer was a fixture in made for television movies. She would star in over thirty of them.\n\nLadd has also been in her fair share of movies (Millennium and Poison Ivy) on TV with recurring roles in Las Vegas and The People v. O.J. Simpson: American Crime Story, as well as many guest appearances on various shows. On Broadway, Ladd starred in the titular role of a revival of Irving Berlin’s Annie Get Your Gun.\n\nShe published a children’s book in 1996 titled The Adventures of Little Nettie Windship. An avid golfer, Ladd also published Token Chick: A Woman’s Guide to Golfing With the Boys, an autobiographical book that focused on her love of golf in 2005. Ladd is also a celebrity ambassador for the child abuse prevention and treatment non-profit Childhelp.\n\n“There hadn’t been a show like this on the air [with] three powerful women who had the latest hairdos, wore the coolest clothes and could walk around in a bikini. We were very inspirational to a lot of young women. Young women would write us and say, ‘I want to be like you. I want to be a cop when I grow up and taking chances to be something else other than the acceptable school teacher or secretary’.” – Cheryl Ladd\n\nShelly Hack\n\nShelley Marie Hack was born in Greenwich, Connecticut on July 6, 1947. Her mother was a model, and by the time Shelley was a teenager, she had decided to enter that field as well, following in her mothers footsteps.\n\nHer big modeling break came in the mid-1970s when Hack was cast as “The Charlie Girl” for Revlon’s “Charlie” perfume ads. Her first movie role came in 1977, with a 30-second appearance in Annie Hall.\n\n“It was a time when women were changing. Women looked at (the ads) and said ‘I want to be like that.'” – Shelly Hack\n\nWhen Kate Jackson was fired from Charlie’s Angels, Hack won the coveted role of Tiffany Wells. She beat out Barbara Bach, Connie Sellecca, Shari Belafonte, and Michelle Pfeiffer in the casting process. Spelling loved the gimmick of casting “The Charlie Girl” as one of Charlie’s Angels.\n\nAfter an initial spike, the casting choice of Hack had delivered a blow to the ratings of the series. Although it was still a top 20 show, Charlie’s Angels was a far cry from being consistently in the top 10 anymore. In February 1980, Hack was released from the show.\n\n“They can say I didn’t work out, but it isn’t true. What happened was a network war. A business decision was made. Change the timeslot or bring on some new publicity. How to get publicity? A new Angel hunt. Who is the obvious person to replace? I am—the new kid on the block.” – Shelly Hack\n\nAfter leaving the series Hack appeared in The King of Comedy (1983), Troll (1986), and The Stepfather (1987). Hack married director Harry Winer (Spacecamp) in 1990. The couple owns the production company, Smash Media.\n\nTanya Roberts\n\nVictoria Leigh Blum was born in New York City on October 15, 1955. Blum’s grandfather, Theodor Blum, had been one of the first dentists to use X-Ray’s and local anesthesia in the field of dentistry.\n\nWhile pursuing an acting career in New York in 1974, she met Barry Roberts while in line for a movie. They married soon after and remained together until his death in 2006. Throughout the late 1970s, Roberts appeared in commercials for Excedrin and Clairol, as well as movies including Fingers (1978) and Tourist Trap (1979).\n\n“What I really want is a commercial hit. If you’re in a hit, you’re suddenly a star, whether you acted well or not.” – Tanya Roberts\n\nIn the Summer of 1980, Roberts was cast as Julie Rogers, the latest Angel, beating out over 2,000 other hopefuls for the role. Ratings plummeted and the show was canceled with Nielsen ratings falling from 12 to 59. Roberts appeared in Beastmaster (1982) as well as Sheena (1985) and A View To a Kill (1985). She passed away on January 21, 2021.\n\nIf You Enjoyed This Article We Recommend:\n\nScholars’ Spotlight: Sharon Tate (Click Here)\n\nScholars’ Spotlight: Brigitte Bardot (Click Here)\n\nScholars’ Spotlight: Steve McQueen (Click Here)\n\nIf You Don’t Want To Miss Any Of Our Content In The Future Like Us On Facebook and Follow Us On Twitter\n\nShare this: Twitter\n\nFacebook\n\n\n\nLike this: Like Loading..."}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Series/CharliesAngels", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Series/CharliesAngels\n\nOnce upon a time, there were three little girls who went to the Police Academy; and they were each assigned \"very hazardous\" duties.\n\nBut I took them away from all that, and now they work for me. My name is Charlie.\n\nA 1976–81 ABC TV series produced by Aaron Spelling about three female private eyes, who would receive their briefings from The Voice, \"Charlie\". It was later remade as a short-lived 2011 series with the same theme (there was also an aborted attempt at a remake in the early 1990s, but sans Charlie).\n\nThree women, the Angels (originally Kate Jackson, the late Farrah Fawcett-Majors, and Jaclyn Smith), graduated from the Los Angeles police academy only to be assigned such duties as handling switchboards, writing parking tickets and directing traffic. They quit and were hired to work for the Charles Townsend Agency as private investigators. Their boss, Charlie (voiced by John Forsythe), is never seen full face (in some episodes the viewer gets to see the back of his head and his arms, talking through a phone while surrounded by beautiful women) assigning cases to the Angels and his liaison, Bosley (played by David Doyle), via a speaker phone.\n\nCharlie's Angels is episodic in nature, as opposed to serial, thus each episode shows the Angels finding themselves in new situations in which they would go undercover to investigate. The undercover aspect of the show creates much of the plot interest and tension. In the early seasons of the show, the Angels, under their assumed identities, use a combination of sexual wiles and knowledge learned for the situation in which they are being placed, but by the third and fourth seasons, the writing has a tendency to stray from the sex appeal and focus more on the case at hand. The fact that those women changed so often is purely irrelevant.\n\nThe series is remembered today both for being one of the first action series with strong female heroines, and for the prominent fanservice. On this wiki, it's the Trope Namer for the Angels Pose.\n\nA shortlived revival of the television show starring Minka Kelly, Annie Ilonzeh, and Rachael Taylor aired in 2011. The show also spawned two feature films in the early 2000s that were implied to share some continuity with the original TV series with Cameron Diaz, Lucy Liu and Drew Barrymore (and with Jaclyn Smith from the original series making a cameo in one), and one that premiered in November 2019 starring Naomi Scott, Kristen Stewart, and Ella Balinska as the titular trio, with Elizabeth Banks directing, producing and playing Bosley.\n\nThe original series provides examples of:\n\nBeauty Contest: \"Pretty Angels All in a Row\" has the title characters entering the \"Miss Chrysanthemum\" pageant to find out who's frightening away the contestants.\n\nBerserk Button: The normally calm and docile Bosley completely loses it when he witnesses Kelly being shot in the head in the final episode of the series.\n\nin the final episode of the series. Blonde, Brunette, Redhead: This was what they originally intended; however, Jaclyn Smith was able to change their minds during her audition. They finally got there when Tanya Roberts joined in the last season. The season 1 episode \"Night of the Strangler\" has Smith playing a dual role; the second character is a redhead, so the producers still got what they wanted, sort of.\n\nBomb Disposal: In \"Angels at Sea,\" the Angels have to dispose of three bombs on a cruise ship. They've had little experience with bombs, so a bomb disposal expert from L.A. gives them instructions over the phone.\n\nBrainwashed and Crazy: On the first season episode \"The Seance\", Kelly is hypnotized into believing that Jill is her childhood nemesis and tries to kill her. This happens to Julie in a late fifth season episode \"Attack Angels\" where she becomes stuck under the trance of a hypnotist who specializes in using brainwashed young women as killers.\n\n"}, {"url": "https://www.womansworld.com/gallery/entertainment/charlie-s-angels-cast-135174", "page_content": "From 1976 to 1981, a revolving door of starlets kicked butt on TV screens as the Charlie’s Angels cast. Best remembered for the original trio of Farah Fawcett, Jaclyn Smith, and Kate Jackson, Charlie’s Angels is still a cult classic today, despite being canceled after only five seasons. Taking a look back at the old Charlie’s Angels plot lines, it’s not hard to see why.\n\nThe Original Cast of ‘Charlie’s Angels’\n\nWho were the original Charlie’s Angels? From left to right: Jaclyn Smith, Kate Jackson and Farrah Fawcett. (Photo Credit: Getty Images)\n\nDespite having graduated from police academy, Sabrina Duncan (Jackson), Jill Munroe (Fawcett), and Kelly Garrett (Smith), were forced to do menial police tasks. Frustrated and unhappy, the three joined the Charles Townsend Agency and became private investigators for the man behind the namesake company. While you never actually saw Charles Townsend’s face on the show, renowned actor John Forsyth lent his voice to the memorable part. John Bosley, Townsend’s associate, sent the Angels on their assignments after Townsend’s voice relayed the case over speakerphone. Looking back at the strong message that the cast of ‘Charlie’s Angels’ sent to viewers — that women can be both powerful and beautiful — it’s not surprising how popular the beloved show would become throughout the years.\n\nWho starred in ‘Charlie’s Angels’ after the original cast?\n\nWho were ‘Charlie’s Angels’ biggest stars? The last season’s cast looked pretty different from the first! From left to right: Tanya Roberts, Jaclyn Smith, Cheryl Ladd. (Photo Credit: Getty Images)\n\nWhile Fawcett, Smith, and Jackson are remembered as the groundbreaking original ‘Charlie’s Angels’ cast, we should not forget the host of other talented actresses who joined the set during the show’s five-year run. Cheryl Ladd, Shelley Hack, and Tanya Roberts were all featured on the show, with Ladd enjoying the longest run of the three. Since these actresses were different from the Charlie’s Angels original cast, they each brought their own unique flair and signature good looks to the roles.\n\nIt’s hard to believe that it’s been a whopping 36 years since the show ended. But it’s a perfect excuse to check in and see what the cast got up to in the years following the nationwide phenomenon. Some Charlie’s Angels actresses are totally unrecognizable now, while others haven’t seemed to change a bit. Keep scrolling to see the cast from Charlie’s Angels today."}], "Tristan Rogers appeared in the American television series Fantasy Island.": [{"url": "https://www.cinemablend.com/television/2571763/fantasy-island-cast-where-youve-seen-the-fox-tv-show-stars-before", "page_content": "In 1977, creator Gene Levitt introduced the world to a place called Fantasy Island, on which the mysterious Mr. Roarke (Ricardo Montalban) would magically make his guests’ wildest dreams come true, in a TV show of the same name that lasted seven seasons. The hit quasi-anthology would later be remade twice, first as a short-lived series in the late '90s with Malcolm McDowell, and later as the horror flick often referred to as Blumhouse’s Fantasy Island in 2020.\n\nBut, for the first time since 1984, a new Fox TV show is continuing the story of the original with a new set of characters. However, you may recognize some of the actors from the Fantasy Island cast, such as your host for this vacation unlike any other.\n\nRoselyn Sanchez (Elena Roarke)\n\nAs Elena Roarke, a descendent of Fantasy Island’s Mr. Roarke, we have the Roselyn Sanchez, who debuted in another tropical adventure - the 1992 comedy Captain Ron, starring Kurt Russell - before breaking out on As the World Turns and then appearing on another update of a classic TV series - Fame L.A. in 1997.\n\nThe Puerto Rican actress returned to films with 2001’s Rush Hour 2, then joined the Without a Trace cast in 2005, starred opposite Dwayne Johnson in Disney’s The Game Plan in 2007, and starred on another (primetime) soap opera, Lifetime’s Devious Maids, from 2013-2016. Sanchez’s most recent role as the proprietor of a beach vacation spot was on ABC’s Grand Hotel, and her directorial debut, Diario: Mujer y Café (about four women on a staycation) is in pre-production.\n\nKiara Barnes (Ruby Akuda)\n\nAnother soap opera vet in the new Fantasy Island cast is Kiara Barnes - whose character, Ruby Akuda, could be considered this sequel series’ answer to James Bond movies star Hervé Villechaize’s Tattoo: Mr. Roarke’s assistant, who was famous for his catchphrase, “The plane! The plane!” The Bold and the Beautiful actress has also starred on Stuck on You - an original drama from the streaming service Allblk (formerly known as the Urban Movie Channel) - and a Lifetime movie called The Wrong Wedding Planner, starring Kill Bill’s Vivica A. Fox. In between acting roles, Barnes also appeared on an episode of The Price is Right as a guest model in 2018.\n\nJohn Gabriel Rodriguez (Javier)\n\nThe one flying the plane, the plane - named Javier - is played by John Gabriel Rodriguez, who's also done some soap opera work (an uncredited role on General Hospital in 2007), Lifetime movies (as a border patrol agent in Justice for Natalee Holloway), and various other guest and recurring parts in TV shows like Homeland or with the Vampire Diaries cast or NCIS. His biggest movie role to date was a small part in Allegiant, the third installment of the Divergent movies from 2016, and Fantasy Island marks his first time as a TV series regular.\n\nBellamy Young (Christine)\n\nOn the guest list for Fantasy Island Season 1, we have a news anchor wishing to indulge in her gluttonous appetite without the usual consequences, played by Bellamy Young, who also earned an impressive resume of guest star and recurring roles with The West Wing cast and the Criminal Minds cast, to name a few, before becoming a series regular on Shonda Rhimes’ Scandal and the short-lived psychological thriller Prodigal Son more recently.\n\nShe is also known for movies like 2002’s We Were Soldiers with Mel Gibson, the third of the Mission: Impossible movies from 2006, and director Ava DuVernay’s 2017 A Wrinkle in Time remake. Young has also joined the cast of another upcoming reboot of a classic TV series: The Waltons: Homecoming, which is now in pre-production for The CW.\n\nDave Annable (Zev)\n\nPlaying a man who travels to Fantasy Island hoping to spice up his marriage is Dave Annable, who is best known for playing Justin Walker on Brothers and Sisters, which he followed with ABC’s short-lived 666 Park Avenue - another supernatural drama about wish fulfillment (but with a price). The actor has also been in rom-coms like Little Black Book with the late Brittany Murphy or 2011’s What’s Your Number?, alongside Anna Faris and Marvel movies star Chris Evans, before signing on for a couple medical dramas (Heartland on NBC, and another short-lived ABC original called Red Band Society).\n\nHe would later land a guest spot with the Yellowstone cast, star opposite Oscar winner Renée Zellwegger in the Netflix miniseries What/If (not to be confused with Marvel’s What If…? on Disney+), and more recently appear on This Is Us in 2020.\n\nOdette Annable (Daphne)\n\nPlaying Dave Annable’s wife on Fantasy Island is his real-life spouse, Odette Annable, who met her husband while appearing on Brothers & Sisters - one of her many notable recurring TV show roles (including on Arrowverse series Supergirl, and Banshee on Cinemax). She made her acting debut at age 5 in Kindergarten Cop and would later grow up to become a bit of a scream queen with her starring role in 2008’s Cloverfield and as the lead of The Unborn the following year.\n\nAfter joining the cast of the prematurely cancelled Thirtysomething(else) - another reboot of a classic series - Yustman was luckily promoted to series regular on The CW’s Walker Season 2, opposite Jared Padalecki.\n\nDebbi Morgan (Eileen)\n\nAs a woman burdened by the absence of her children is Debbi Morgan, yet another soap opera veteran (from a plethora of titles, including All My Children) in the Fantasy Island cast, but that is not the peak of her stamp on TV history. After a few uncredited movie appearances (including 1976’s Taxi Driver), the actress appeared on iconic sitcoms Good Times and What's Happening!!, in Roots: The Next Generations (a sequel to the legendary miniseries), the supernatural drama Charmed as The Seer, and the hit Starz original series Power and its sequel, Power Book II: Ghost, more recently. Morgan is also known for movies like The Hurricane with Denzel Washington, Coach Carter with Samuel L. Jackson, and Netflix’s Sextuplets with Marlon Wayans.\n\nLeslie Jordan (TBA)\n\nLeslie Jordan is set to play an artist longing to reunite with his late apprentice for what is sure to be a scene-stealing appearance on Fantasy Island. Such has been the 66-year-old’s specialty for years, like on a few American Horror Story seasons, as Emma Stone’s boss (Mr. Blackly) in The Help, and, of course, his Emmy-winning recurring role in the Will & Grace cast as closeted Republican socialite Beverly Leslie. The openly gay actor more recently had a starring role on the short-lived Fox sitcom The Cool Kids, a guest voice appearance on the animated comedy The Great North, and joined the Call Me Kat cast - led by former The Big Bang Theory cast member Mayim Bialik.\n\nLaura Leighton (TBA)\n\nOne episode of the new Fantasy Island promises a reunion of three actresses from the original Melrose Place cast, including Laura Leighton, who would later join the Beverly Hill, 90210 cast and also reprise her role of Sydney Andrews on the short-lived Melrose Place reboot in 2009. Speaking of popular teen dramas, she later joined the Pretty Little Liars cast, following a long history of guest spots on crime procedurals like CSI: Miami and Law & Order: Special Victims Unit. Most recently, Leighton appeared on another revival of a classic TV series: the new reboot of Dynasty on the CW.\n\nJosie Bissett (TBA)\n\nAfter starting off her acting career in movies like the Italian-produced 1989 slasher Hitcher in the Dark, and in a small role in Oliver Stone’s The Doors biopic, Josie Bissett became best known from Melrose Place as Laura Leighton’s onscreen adoptive sister, Jane Andrews. She would also reprise that part in the reboot, after joining the cast of another popular teen drama, The Secret Life of the American Teenager on Freeform (when it was still ABC Family), in 2008. Many of the actress’ other notable credits in the last several years have been the Hallmark original series When Calls the Heart and also Hallmark movies, such as the six installments of The Wedding March series, which also stars fellow Melrose Place alum Jack Wagner.\n\nDaphne Zuniga (Margot)\n\nLaura Leighton and Josie Bissett will also be joined by their fellow Melrose Place veteran, Daphne Zuniga, who was previously best known for the classic 1987 Star Wars movies parody from writer, director, and star Mel Brooks, Spaceballs, as Princess Vespa - whom she would reprise for the animated series spin-off in 2008.\n\nAfter a diverse variety of TV guest star appearances (such as a voice role on Batman Beyond, Ryan Murphy’s Nip/Tuck, and NBC’s American Dreams), she later landed a long-running recurring role in the One Tree Hill cast before doing doing a few Hallmark movies herself. Zuniga also recently reunited with another Melrose Place alum, Jason Priestly, for the Lifetime original miniseries Heaven, based on the book by Flowers in the Attic author V.C. Andrews.\n\nWith a trio of Melrose Place alumni and a few scream queens, too, the new Fantasy Island cast looks to be quite a magical ensemble. See for yourself when the new series debuts on Fox, Tuesday, August 10, at 9 p.m. EST."}, {"url": "https://outsider.com/entertainment/fantasy-island-final-episode-aired-this-day-1984-abc/", "page_content": "It is said that all good things must come to an end. This was the case for the popular television show “Fantasy Island” during the mid-1980s.\n\nThe series finale of the unique show aired on May 19, 1984. That’s 37 years ago today! The Twitter account @RetroNewsNow also reminded television viewers and the show’s fans of its final episode with a tweet that included footage from the show.\n\n📺The series finale of ‘Fantasy Island’ aired 37 years ago, May 19, 1984, on ABC pic.twitter.com/qMVtTgiQw4 — RetroNewsNow (@RetroNewsNow) May 19, 2021\n\nFor the readers who have never seen an episode of “Fantasy Island,” the show, according to IMDb.com, follows the life of a character known as Mr. Roarke. He operates an unusual resort on an island situated in the Pacific Ocean.\n\nHowever, this isn’t just any resort. On this island oasis, visitors can ask to experience any fantasy. But, there’s a catch – there’s always a catch, after all. Therefore on this island, the visitors’ fantasies don’t play out as they hoped.\n\nPlaying Mr. Roarke was Ricardo Montalban. He was also joined on the show by his loyal companion. That character was named “Tattoo.” He was played by Hervé Villechaize. One of the most memorable aspects of “Fantasy Island” came about thanks to Villechaize. Of course, that is him saying, “Ze plane! Ze plane!”\n\nMontalban and Villechaize were the two main actors on “Fantasy Island.” Montalban appeared in 154 episodes during the show’s run from 1977 to 1984. Villechaize acted in 132 episodes.\n\nIn comparing other actors’ total number of episodes on the show, there is almost no comparison. In fact, based on data shared by IMDb.com, the actor who appeared in the most “Fantasy Island” episodes after Montalban and Villechaize was Christopher Hewett. However, he appeared in only 22 episodes as the character Lawrence.\n\nSeries Finale of ‘Fantasy Island’ Included Popular Spanish American Artist Charo\n\nFans of “Fantasy Island” tuned in for the show’s series finale on May 19, 1984. The final episode was titled “Surrogate Mother/Ideal Woman.” In addition to Ricardo Montalban and Hervé Villechaize, this episode of the show also starred the famous Spanish-American artist Charo.\n\nCharo played Yolanda Morales. It is her character’s plot that was the focus of much of the episode.\n\nAccording to IMDb.com, the plot of the finale episode of “Fantasy Island” was: “Yolanda Morales fears giving up her baby to Michael and Andrea Anderson, for whom she is bearing the child. Ben Saunders wants to reunite with the love of his life Sally Marshall but a cash problem and a beauty contest complicate matters.”"}, {"url": "https://www.tigerstrypes.com/fantasy-island/", "page_content": "\n\nFor this week’s “Things That Bring Back Memories” post, I am going to pick something in the topic of “TELEVISION” and go with Fantasy Island. This was a show that on from 1977 to 1984. It was one that everyone would pretty much yell together – da plane…da plane!! Come on, you know you did it! 🙂 We all wanted to take a vacation on Fantasy Island, to enjoy the beach and all of the amenities. I guess it’s called Sandals now, huh?\n\nFor those of you, who are either too young, or just don’t remember it, here’s a video of the intro to the Fantasy Island show:\n\nSo, did you ever see the show when you were younger? or have you seen it on TV or the internet later in life? Let me know what you thought of it, and if you have any memories of it in your life!\n\nDa Plane! Da Plane! Who remembers the old Fantasy Island show? Find out more at #TigerStrypesBlog Click To Tweet\n\nMore Info on Fantasy Island:\n\nFantasy Island is an American television series that originally aired on the American Broadcasting Company network from 1977 to 1984. The series was created by Gene Levitt. A revival of the series originally aired on the same network during the 1998–99 season.\n\nBefore it became a television series, Fantasy Island was introduced to viewers in 1977 and 1978 through two made-for-television films. Airing from 1978 to 1984, the original series starred Ricardo Montalbán as Mr. Roarke, the enigmatic overseer of a mysterious island somewhere in the Pacific Ocean, where people from all walks of life could come and live out their fantasies, albeit for a price.\n\nRoarke was known for his white suit and cultured demeanor, and was initially accompanied by an energetic sidekick, Tattoo (played by Hervé Villechaize). Tattoo would run up the main bell tower to ring the bell and shout “The plane! The plane!” to announce the arrival of a new set of guests at the beginning of each episode. This line, shown at the beginning of the show’s credits, became an unlikely catchphrase because of Villechaize’s spirited delivery and French accent. In later seasons, he would arrive in his personal go-kart, sized for him, and recklessly drive to join Roarke for the visitor reception while the staff scrambled to get out of his way. From 1980 to 1982, Wendy Schaal joined the cast as a beautiful brown-eyed blonde assistant named Julie. The producers dismissed Villechaize from the series before the 1983–1984 season, which ended up being its last, and Tattoo was replaced by a more sedate butler type named Lawrence (played by Christopher Hewett). Lawrence’s personality was exactly the opposite of Tattoo’s in many ways. For instance, Lawrence was also responsible for the bell ringing, but instead of climbing to the tower he simply pushed a button outside to have the bell ring automatically.\n\nA Grumman Widgeon aircraft was used for the series. As each visitor exited the plane, Roarke would describe to Tattoo (or another assistant) the nature of their fantasy, usually with a cryptic comment suggesting the person’s fantasy will not turn out as they expected. Roarke would then welcome his guests by lifting his glass and saying: “My dear guests, I am Mr. Roarke, your host. Welcome to Fantasy Island.” This toast was usually followed with a warm smile but sometimes (depending on the nature of a guest or their fantasy) his eyes would show concern or worry for a guest’s safety.\n\nVery little is known about the man known as Mr. Roarke and it is not clear if that is his first, last, or only name. Although most guests know him as “Mr.” Roarke, many people close to him, including past lovers, have referred to him only as “Roarke”, which suggests he may not have any other names. He is the sole owner and proprietor of Fantasy Island. Roarke’s actual age is a complete mystery. In the pilot film, he comments how the guests who come to his island are “so mortal” and there are hints throughout the series that suggest Roarke may be immortal. In “Elizabeth”, a woman from Roarke’s past appears, but it is revealed that she died over 300 years ago. Another episode even suggests that he was once intimate with Cleopatra. However old he is, Roarke has come to know many seemingly-immortal beings over his time on Earth, including ghosts (“The Ghost’s Story”), a genie (“A Genie Named Joe”), the mermaid Princess Nyah (“The Mermaid”, “The Mermaid Returns”, “The Mermaid and the Matchmaker”), the goddess Aphrodite (“Aphrodite”), and even Uriel the Angel of Death (“The Angel’s Triangle”). In “The Devil and Mandy Breem” and “The Devil and Mr. Roarke”, Roarke even faces the Devil (played by Roddy McDowall) who has come to the island to challenge him for either a guest’s immortal soul or his. It is mentioned this is not the first time they have confronted each other and Mr. Roarke has always been the winner. In the second story, the Devil himself was one of the island’s guests, claiming he was only there to relax and had no interest in Roarke’s soul at the time. However, this turned out to be yet another ruse.\n\nRoarke had a strong moral code, but he was always merciful. He usually tried to teach his guests important life lessons through the medium of their fantasies, frequently in a manner that exposes the errors of their ways, and on occasions when the island hosted terminally ill guests he would allow them to live out one last wish. Roarke’s fantasies were not without peril, but the greatest danger usually came from the guests themselves. In some cases people were killed due to their own negligence, aggression or arrogance. When necessary, Roarke would directly intervene when the fantasy became dangerous to the guest:\n\nFor instance in one episode when Tattoo was given his own fantasy as a birthday gift, which ended up with him being chased by hostile natives in canoes, Mr. Roarke suddenly appeared in a motorboat, snared Tattoo’s canoe with a grappling hook and towed it away at high speed to help him escape. Another instance was in “The Victim” where a female guest seeking to fall in love with her dream man ends up as one of his sex slaves. When she and her fellow sex-slaves managed to get free, they are saved by Mr. Roarke and Tattoo where have arrived with the police who then arrest the two men responsible. Another instance was in the 1980 episode “With Affection, Jack the Ripper” when a female guest intent on researching Jack the Ripper’s crimes was sent back in time to 1888 London and would have become one of the Ripper’s victims had not Mr. Roarke physically intervened.\n\nWith only a few exceptions, Roarke always made it quite clear that he was powerless to stop a fantasy once it had begun and that guests must play them out to their conclusion.\n\nIn later seasons, there were often supernatural overtones. Roarke also seemed to have his own supernatural powers of some sort (called the “Gift of the McNabs” in “Delphine”), although it was never explained how this came to be. In the episodes “Reprisal” and “The Power” he temporarily gave the guest psychokinetic abilities and in “Terrors of the Mind” the power to see into the future. In one episode, when a guest says “Thank God things worked out well”, Roarke and Tattoo share a very odd look and Roarke says in a cryptic way “Thank God, indeed.” In the same episode, Roarke uses some mysterious powers to help Tattoo with his magic act. Ricardo Montalban would claim in interviews that he had a definite opinion in mind regarding the mystery of Mr. Roarke, and how he accomplished his fantasies, but he would never publicly state what it was. Years after the show was off the air, in an interview with the Academy of Television Arts and Sciences, Montalban finally revealed that his motivation was imagining Roarke as a fallen angel whose sin was pride and that Fantasy Island was purgatory.\n\nEach episode would alternate between two or three independent story lines as the guests experienced their fantasies and interacted with Roarke. When reruns of the show went into syndication, a half-hour version was offered, in which each hour-long original show was split to two separate half-hour shows in which only one guest’s story was told in each half-hour episode. This made it obvious that the original episodes had been planned in such a way that each guest or family got off the plane separately, did not interact with the other guest or family, and was given almost exactly half the time of the original episode.\n\nThe series was filmed primarily in Burbank, California, with the opening scenes of the enchanting island coastline being that of Kauai, Hawaii (both the Na Pali coast as well as Wailua Falls). The house with the bell tower, where Tattoo rings the bell, is the Queen Anne Cottage, located in the Los Angeles County Arboretum and Botanic Garden in Arcadia. The plane, “arriving” with the guests, was filmed in the lagoon behind the Queen Anne Cottage. Sometimes, outdoor scenes were filmed at the Arboretum. Interior sets were filmed on Stages 26 and 17 at Warner Bros. Studios in Burbank, California. At some point the production of exterior scenes moved to the Warner Ranch a short distance away from Warner’s main lot.\n\nAbout the Actors:\n\nRicardo Montalban (Mr. Roarke) was born November 25, 1920, and passed away on January 14, 2009. He was a Mexican actor. His career spanned seven decades, during which he became known for many different roles. During the 1970’s, he was a spokesman in automobile advertisements for Chrysler, including those in which he extolled the “fine Corinthian leather” used for the Cordoba’s interior. From 1977 to 1984, Montalbán played Mr. Roarke on the television series Fantasy Island. He played Khan Noonien Singh on the original Star Trek series and the film Star Trek II: The Wrath of Khan (1982). He won an Emmy Award for his role in the miniseries How the West Was Won (1978), and a Lifetime Achievement Award from the Screen Actors Guild in 1993. In his eighties, he provided voices for animated films and commercials, and appeared as Grandfather Valentin in the Spy Kids franchise. Montalbán appeared in many diverse films including The Naked Gun: From the Files of Police Squad! (1988) as well as two films from both the Planet of the Apes and Spy Kids series. In addition, he appeared in various musicals, such as The Singing Nun (1966), also starring Debbie Reynolds. Over the course of his long career, he played lead roles or guest-starred in dozens of television series. Montalbán also narrated several historical documentaries including the Spanish version of the National Park Service’s history of Pecos Pueblo for Pecos National Historical Park. Prior to his death in January 2009, Montalbán recorded the voice for a guest character in an episode of the animated series American Dad!, in which main character Roger becomes the dictator of a South American country. According to executive producer Mike Barker, it was his last role.\n\nHerve Villechaize (Tattoo) was born in Paris on April 23, 1943. He stopped growing very early and his father (who was a surgeon) tried to find a cure by visiting several doctors and hospitals. But there was none, so Hervé had to live with his small height and also with undersized lungs. He studied at the Beaux-Arts in Paris and made an exhibition of his own paintings, which were well received. At 21, he left France for the USA where he continued to paint and to make photographs. He also started to participate in some movies and was quickly offered several roles for plays and then for cinema. His first big success was The Man with the Golden Gun (1974) where he was a killer associated to the villain Scaramanga (played by Christopher Lee). He inspired the TV-series Fantasy Island (1977) where he took the role of “Tattoo”, the faithful servant of “Mr. Roarke” (Ricardo Montalban). This series was a great success and, thanks to it, Villechaize became famous and rich, mostly because of his enigmatic and charming smile. In 1983, he argued with the producers of the show in order to earn as much money as Montalban but, instead, he was fired; he also lost his model-actress wife. The series continued without him but stopped one year later, when the media response meter decreased because of the lack of Tattoo’s character! Villechaize became alcoholic and depressed, so he missed several roles that he was offered. His health problems also increased (mostly suffering from ulcers and a spastic colon), and he nearly died of pneumonia in 1992. On the afternoon of Saturday September 4th, 1993, after having watched a movie, he wrote a note and made a tape recording before shooting himself in his backyard.\n\nChristopher Hewett (Lawrence) was born April 5, 1921 in Worthing, Sussex, to an army officer father and an Irish mother who was a descendant of Daniel O’Connell. He was educated at Beaumont College, and at age 7, made his acting debut in Dublin stage production of A Midsummer Night’s Dream. At 16, Hewett joined the Royal Air Force, leaving in 1940. Hewett then joined the Oxford Repertory Company and made his West End theater debut in 1943. He later appeared on Broadway in the musicals My Fair Lady, The Unsinkable Molly Brown, Music Is, and Kean and in the plays Sleuth and The Affair, among others, and directed the 1960 Broadway revue From A to Z and the 1967 Off Broadway revival of the Rodgers and Hart musical By Jupiter. Hewett also directed several stage productions including The Marriage-Go-Round and Beyond the Fringe and Camelot. Hewett made his film debut in the 1951 crime drama Pool of London, and later appeared in roles on Robert Montgomery Presents and DuPont Show of the Month. He appeared as the grand theatre director Roger DeBris in Mel Brooks’s 1968 film comedy The Producers. In 1976, Hewett played the generic bureaucrat Federov in the short-lived sitcom Ivan the Terrible. During the 1979-80 season, he played Captain Hook to Sandy Duncan’s Peter Pan on Broadway. From 1983 to 1984, he portrayed Lawrence, Mr. Roarke’s (Ricardo Montalbán) sidekick on the final season of the ABC series Fantasy Island. The following year, Hewett landed his best known role as Lynn Aloysius Belvedere, an English butler who works for a middle class American family in the sitcom Mr. Belvedere. After the series ended its run in 1990, Hewett appeared in a guest spot on an episode of the NBC teen sitcom California Dreams in 1994. His last onscreen role was a cameo appearance on the Fox series Ned & Stacey in 1997.\n\nFantasy Island – Did You Know?\n\n\n\nThe plane that was used on Fantasy Island was up for auction in the 1990’s. This plane was autographed by all the guest stars. Before Fantasy Island, this plane was also owned by Richard D. Bach, author of “Jonathan Livingston Seagull”.\n\nDuring the early part of the series, a jeep CJ-7 was used to get around. In the later episodes, a customized 1976 Plymouth Volare station wagon was used.\n\nThe customized Volare seen throughout the series was part of a product placement deal with Chrysler Corporation, since Ricardo Montalban had been a spokesperson for their television commercials dating back to 1975. He promoted the Chrysler Cordoba and mid-1980s New Yorker sedans. Also, the Volare is the ancestor of the modern-day SUV and crossover although the Chrysler F platform vehicles (Volare, Aspen, and its J and M derivatives – Diplomat, LeBaron, Mirada, Fifth Avenue, Imperial) were rear-wheel drive.\n\nWhen 3-D was revived in the early 1980’s, some thought was given to shooting an entire episode in 3-D. The problem was that Anaglyphic glasses (tinted glasses) could not be used because this required that television sets be correctly color adjusted – something in 1983 with dozens of television makers and in an era without cable or satellite was unthinkable."}, {"url": "https://www.ranker.com/list/full-cast-of-fantasy-island-cast-list-for-the-show-fantasy-island/reference", "page_content": "Fantasy Island cast list, including photos of the actors when available. This list includes all of the Fantasy Island main actors and actresses, so if they are an integral part of the show you'll find them below. You can various bits of trivia about these Fantasy Island stars, such as where the actor was born and what their year of birth is. This cast list of actors from Fantasy Island focuses primarily on the main characters, but there may be a few actors who played smaller roles on Fantasy Island that are on here as well.\n\nThis list contains items like Stella Stevens and Charles Shaughnessy\n\nIf you are wondering, \"Who are the actors from Fantasy Island?\" or \"Who starred on Fantasy Island?\" then this list will help you answer those questions.\n\nIn most cases you can click on the names of these popular Fantasy Island actors and actresses to find out more information about them. If you're looking for a particular Fantasy Island actor or actress, then type their name into the \"search\" bar to find them directly."}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Series/FantasyIsland2021", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Series/FantasyIsland2021\n\nFantasy Island is a Sequel Series to the 1970s Aaron Spelling series Fantasy Island, starring Roselyn Sánchez, Kiara Barnes, and John Gabriel Rodriquez.\n\nThe show delves into the 'what if' questions… that keep us awake at night, and features emotional, provocative stories about people who arrive with dreams and desires and depart enlightened and transformed through the magical realism of Fantasy Island.\n\nThe show's first season comprised 8 episodes and aired until Sept 19th. In November 2021, the show was renewed for a second season. A two-part holiday special also aired on December 23rd 2021.\n\nTropes"}, {"url": "https://www.digitaljournal.com/entertainment/tristan-rogers-talks-about-the-59th-anniversary-of-general-hospital-and-studio-city/article", "page_content": "Tristan Rogers. Photo Credit: Walt Disney Television, Todd Wawrychuk\n\nVeteran actor Tristan Rogers chatted about the 59th anniversary of the hit ABC daytime drama “General Hospital,” and its recent 15,000th episode milestone.\n\nOn this impressive milestone, he said with a sweet laugh, “I feel old. 15,000 episodes hardly ever happen at all.”\n\nAn Emmy Award winner, Rogers shared that some of his favorite storylines over the years on “General Hospital” were the “crazy ones” that happened when he first got on the show back in 1980 and 1981. We had a lot of fun. In the later years, things have been more contained.”\n\nOn Sunday, June 26, Rogers will be a part of a virtual fan event, produced by Coastal Entertainment, titled “Toast with Tristan Rogers to General Hospital’s 59th Year.” “I am looking forward to that,” he said. “I just finished doing a Zoom event with Forbes Riley today, and that was a lot of fun. Forbes is a lovely lady.”\n\nStudio City\n\nIn the Emmy award-winning series “Studio City,” Rogers gave a powerful performance in Season 2 as Doc. “That was great material,” Rogers said. “A lot of those scenes between myself and Sean Kanan were improv. We made them up as we went along.”\n\nIf Rogers were to have any superpower, he revealed that it would be “Xray vision.”\n\nFor Rogers, the word success really means “on with the show.”\n\nMB ‘State of Mind’\n\nRogers enjoyed being a part of Maurice Benard’s MB “State of Mind” podcast on mental health. “That was a trip,” he admitted. “Maurice is a very good interviewer, he lets you know, which is what interviewing is all about. He packed a lot of topics in and I really enjoyed it.”\n\nFor his dedicated fans, Rogers expressed his gratitude. “It means a lot that the fans have stuck around. Beyond that, I come from a different era of ‘General Hospital’ and I always have that to look back on,” he concluded."}, {"url": "https://www.aarp.org/entertainment/television/info-2021/fantasy-island-guest-stars.html", "page_content": "Walt Disney Television via Getty Images Photo Archives/Walt Disney Television via Getty Images\n\nEn español | In TV's ever-expanding passion for nostalgic series reboots, it's high time that Fantasy Island, that iconic late ‘70s/early ‘80s Saturday night series, is making a kitschy comeback. In the brand-new version (premiering Aug. 10, 9 p.m. ET on Fox), Puerto Rican-born Roselyn Sanchez (Without a Trace) is host Elena Roarke (the descendant of Ricardo Montalban's Mr. Roarke), still guiding guests through fantasies that prove you'd better be careful what you wish for.\n\nLike the era's other Saturday night hit The Love Boat, Fantasy Island's storylines relied on a diverse group of guest stars. Some appeared at the apex of fame, while others were yet to make their mark. And of course, others popped up on the downhill side of their careers. It was all part of the who's-on-this-week? fun.\n\nAnd so as the guest-star-making machinery revs back into gear on a new Fantasy Island, let's look back at some of the stars who stepped off the plane, the plane!, back in the day."}, {"url": "https://variety.com/2021/tv/news/fantasy-island-reboot-fox-cast-kiara-barnes-john-gabriel-rodriguez-1234956777/", "page_content": "The upcoming “Fantasy Island” reboot at Fox has added its first two cast members, Variety has learned.\n\nKiara Barnes and John Gabriel Rodriquez will both star in the series, which was ordered straight-to-series at Fox back in December.\n\nThe new series is described as a modern semi-anthology series that delves into the “what if” questions, both big and small, that keep us awake at night. Each episode will tell stories about people who walk in with a desire, but end up reborn to themselves through the magical realism of Fantasy Island.\n\nBarnes will play Ruby Okoro. Described as warm and wise, Ruby is a young woman with an old soul. She arrives on Fantasy Island with a terminal illness, but Roarke and the island give her a new lease on life.\n\nRodriquez will play Javier. Said to be rugged, handsome and charismatic, Javier is Fantasy Island’s head of transport – a pilot, mechanic and jack of all trades. While the island provides Javier refuge, as with everything else it offers, it may come at the price of a reckoning.\n\nBarnes is known for her role on the long-running soap opera “The Bold and the Beautiful.” She is also a singer and model, having worked with brands such as Maybelline, Nike, Sephora, DKNY, and Adidas.\n\nShe is repped by Aperture Talent Agency, Zero Gravity Management, and attorney Melanie Frank.\n\nRodriquez’s past TV credits include “Rosewood,” “The Vampire Diaries,” “Drop Dead Diva,” “The Fosters,” and “If Loving You Is Wrong.” He is repped by Haven Entertainment.\n\nThe rebooted version “Fantasy Island” hails from writers and executive producers Liz Craft and Sarah Fain, with the series being a co-production between Sony Pictures Television, Gemstone Studios, and Fox Entertainment. It is slated to debut in summer 2021.\n\nThe original “Fantasy Island” ran on ABC for seven seasons and 152 episodes from 1978-1984, with two TV movies having been released in early 1977. The show starred Ricardo Montalbán as the island’s proprietor, Mr. Roarke, and Hervé Villechaize as his assistant, Tattoo."}, {"url": "https://www.zimbio.com/Tristan+Rogers", "page_content": "Overview\n\nFind news about Tristan Rogers and check out the latest Tristan Rogers pictures. He also starred as the daughter of the late and prominent writer-director Harold Reynolds in a popular television series for the syndicated radio station WFAAF from 1984 to 1986. Rogers appeared as Major Richard Skinner, the first American male doctor who spent... more Find news about Tristan Rogers and check out the latest Tristan Rogers pictures. He also starred as the daughter of the late and prominent writer-director Harold Reynolds in a popular television series for the syndicated radio station WFAAF from 1984 to 1986.\n\n\n\n\n\nRogers appeared as Major Richard Skinner, the first American male doctor who spent his teenage years in the war zone and... Born: ( 1946-06-03) 3 June 1946 (age 74) Melbourne, Victoria, Australia\n\nOccupation: Actor\n\nYears active: 1974–present\n\nSpouse(s): Teresa Parkerson (21 May 1995 – present; 2 children) Barbara Meale (7 June 1974–1984; divorced) This content is based on data from multiple web sources. If you see any errors, please contact us.\n\nFind news about Tristan Rogers and check out the latest Tristan Rogers pictures. He also starred as the daughter of the late and prominent writer-director Harold Reynolds in a popular television series for the syndicated radio station WFAAF from 1984 to 1986.\n\n\n\n\n\nRogers appeared as Major Richard Skinner, the first American male doctor who spent his teenage years in the war zone and...\n\nBorn: ( 1946-06-03) 3 June 1946 (age 74) Melbourne, Victoria, Australia\n\nOccupation: Actor\n\nYears active: 1974–present\n\nSpouse(s): Teresa Parkerson (21 May 1995 – present; 2 children) Barbara Meale (7 June 1974–1984; divorced)\n\nThis content is based on data from multiple web sources. If you see any errors, please contact us."}]}