{"Tristan Rogers joined the cast of General Hospital in 1980.": [{"url": "https://www.tvinsider.com/people/tristan-rogers/", "page_content": "Actor\n\nBirth Date: June 3, 1946\n\nAge: 77 years old\n\nBirth Place: Melbourne, Victoria, Australia\n\nIn 1980, Australian actor Tristan Rogers landed a small role on what was then the most popular soap opera in the world, \"General Hospital,\" (ABC, 1963- ), having no idea he would become the first of many hunky Australian exports to set American hearts aflutter. Playing Robert Scorpio, a sophisticated and savvy operative for the World Security Bureau, Rogers was teamed up with the most famous couple in the world at that time -\"GH\" lovers Luke and Laura - to help save the world from being frozen solid. He went on to become one of the soap world's most iconic actors, even long after he had left the show and moved on to other endeavors."}, {"url": "https://www.digitaljournal.com/entertainment/tristan-rogers-talks-about-the-59th-anniversary-of-general-hospital-and-studio-city/article", "page_content": "Tristan Rogers. Photo Credit: Walt Disney Television, Todd Wawrychuk\n\nVeteran actor Tristan Rogers chatted about the 59th anniversary of the hit ABC daytime drama “General Hospital,” and its recent 15,000th episode milestone.\n\nOn this impressive milestone, he said with a sweet laugh, “I feel old. 15,000 episodes hardly ever happen at all.”\n\nAn Emmy Award winner, Rogers shared that some of his favorite storylines over the years on “General Hospital” were the “crazy ones” that happened when he first got on the show back in 1980 and 1981. We had a lot of fun. In the later years, things have been more contained.”\n\nOn Sunday, June 26, Rogers will be a part of a virtual fan event, produced by Coastal Entertainment, titled “Toast with Tristan Rogers to General Hospital’s 59th Year.” “I am looking forward to that,” he said. “I just finished doing a Zoom event with Forbes Riley today, and that was a lot of fun. Forbes is a lovely lady.”\n\nStudio City\n\nIn the Emmy award-winning series “Studio City,” Rogers gave a powerful performance in Season 2 as Doc. “That was great material,” Rogers said. “A lot of those scenes between myself and Sean Kanan were improv. We made them up as we went along.”\n\nIf Rogers were to have any superpower, he revealed that it would be “Xray vision.”\n\nFor Rogers, the word success really means “on with the show.”\n\nMB ‘State of Mind’\n\nRogers enjoyed being a part of Maurice Benard’s MB “State of Mind” podcast on mental health. “That was a trip,” he admitted. “Maurice is a very good interviewer, he lets you know, which is what interviewing is all about. He packed a lot of topics in and I really enjoyed it.”\n\nFor his dedicated fans, Rogers expressed his gratitude. “It means a lot that the fans have stuck around. Beyond that, I come from a different era of ‘General Hospital’ and I always have that to look back on,” he concluded."}, {"url": "https://www.soapcentral.com/theactors/rogers_tristan.php", "page_content": "Port Charles Presence\n\nAt A Glance\n\nTristan Rogers' journey through the entertainment industry began in the 1960s in his native Australia. Australian TV was in its infancy when Tristan came onto the scene, working as a walk-on stuntman and doubling as a boom carrier. Ambitious, and eager to learn, Tristan also did sound effects in the parking lot at night and volunteered for any other work which would keep him on the lot and in peoples eyesight. It wasn't long before he landed a series regular role in The Link Men. When the struggling production folded after about 10 episodes, Tristan headed for England.\n\nThe year was 1969 and Tristan thought he'd try being a drummer in a rock band on for size. After three years of \"intense experiences\" in London, and witnessing live some of the greatest music ever to hit planet Earth, Tristan decided to give up the musician's life. What he had learned after years of successful modeling to help make the band's ends meet, was that he really wanted to act.\n\nBack in Australia in 1972, Tristan found himself working in all manner of local productions. For the next seven years it was non-stop work in everything form television to radio. By then, the idea of coming to America had taken hold, so in 1979 it was time to move again. Tristan arrived in California in the summer of 1979 and felt right at home.\n\nIn December of 1980, Tristan landed a job in a show called General Hospital and his life changed forever. An outpouring from fascinated fans of all ages turned then-producer Gloria Monty's head and changed the initial three-week gig into a three-year contract role. General Hospital opened many doors for him with appearances on most of the then prominent '80's and '90's television series.\n\nIn 1992, Tristan made the momentous decision to leave General Hospital and seek other challenges. He had always felt that it is after all show business and that he had only participated in one portion of it. In order to do the other he had to commit to it. His first experience on the production side came about in 1996. Tristan had spent several years researching a show about what is arguably his first love, motor racing. In 1997, Tristan found himself in Canada where he was instrumental in launching a show for the Showtime Network called Fast Track, set in the world of American stock-car racing. The show lasted for 22 episodes and the learning experience was priceless.\n\nIn addition to producing, Tristan continues to appear in major films and television shows, as well as being the spokes voice for several major TV ad campaigns. Always a little ahead of his time, Tristan has also been a key figure in the development of internet-based soaps. An avid and vocal proponent of the development of web-based entertainment, Tristan is also involved in web-based productions.\n\nActing Portfolio: TELEVISION\n\nThe Young and the Restless\n\nColin Atkinson\n\nDecember 8, 2010 to October 25, 2011; May 9, 2012\n\nGeneral Hospital: Night Shift\n\nRobert Scorpio\n\nAugust 5, 2008 to October 21, 2008\n\nThe Bold and the Beautiful\n\nHunter Jones\n\n1997\n\nFast Track\n\nHarry\n\n1997\n\nA Perry Mason Mystery: The Case of the Lethal Lifestyle\n\nDuke Albert\n\n1994\n\nCaptain Planet and the Planeteers\n\nCaucasian Patrol Member (voice)\n\n1990\n\nSky Commanders\n\n'Spider' Reilly\n\n1987\n\nGeneral Hospital\n\nRobert Scorpio\n\nDecember 1980 to February 25, 1992 [contract]; 1995; January 27, 2006 to March 1, 2006; October 20, 2006 to November 16, 2006; December 19, 2008 to December 29, 2008; February 29, 2012 to March 8, 2012; November 15, 2012 to December 18, 2012; October 4, 2013 to present\n\nPower Without Glory\n\nPeter Monton\n\n1976\n\nThe Box\n\nPeter Kendall\n\n1975-1976\n\nNumber 96\n\nCain Carmichael\n\n1974\n\nThe Link Men\n\nDetective Constable Ray Gamble\n\n1970\n\nBellbird\n\n1967\n\nActing Portfolio: FILM\n\nA Piece of Eden\n\nVictor Hardwick\n\n2000\n\nNight Eyes Three\n\nJim Stanton\n\n1993\n\nSoulmates\n\nRichard Wayborn\n\n1992\n\nThe Rescuers Down Under\n\nJake (voice)\n\n1990\n\nSex Farm\n\nRobert Waitman\n\n1973\n\nThe Flesh and Blood Show\n\nTony Weller\n\n1972\n\nFour Dimensions of Greta\n\nHans Wiemer\n\n1972\n\nVital Statistics\n\nPLACE OF BIRTH: Melbourne, Victoria, Australia\n\nDATE OF BIRTH: June 3, 1946\n\nHEIGHT: 6' 1\"\n\nMARITAL STATUS: Married, Teresa Parkerson (May 21, 1995 to Present)\n\nCHILDREN: Two; daughter, Sara Jane (Aug 15, 1992) and son, Cale (Aug 1996)"}, {"url": "https://soaps.sheknows.com/gallery/general-hospital-old-pictures-1960s-1970s-1980s-1990s/", "page_content": "‘JaSam’ I Am?\n\nImage Credit: Chris D/JPI\n\nJason found lasting love with Sonny’s former squeeze, Sam McCall (Kelly Monaco). Then he found it with her again after he was “killed.” Then it turned out that that “he” was his heretofore-unknown twin brother, Drew Cain (Billy Miller). So the real Jason and Sam had to find it yet again after Patient Six was unwrapped and Drew given his own identity."}, {"url": "https://soaps.sheknows.com/general-hospital/news/572964/general-hospital-cast-characters-2020/", "page_content": "1 / 49 <p>Marcus Coloma took over the role of Nikolas Cassadine in October 2019 after the character’s three-year absence from the canvas. Actor Nick Stabile briefly played Nikolas in 2016. Tyler Christopher originated the role in 1996, playing him on and off until June 2016. Coloma previously starred in Point Pleasant, South Beach, and Make It or Break It.</p>\n\n2 / 49 <p>Ashton Arbab first came to General Hospital for a few episodes in March 2019. He returned in June of the same year when Dev Cerci became a recurring character.</p>\n\n3 / 49 <p>Bradford Anderson has been playing Damian Spinelli since 2006. The actor also appeared as Spinelli in the ABC soap opera’s spinoff General Hospital: Night Shift. The actor and his General Hospital co-star Steve Burton interview soap opera actors on their podcast, That’s Awesome, and travel the country performing thei live act at fan events.</p>\n\n4 / 49 <p>Briana Henry began playing Jordan Ashford in September 2019. She took over the role from Vinessa Antoine who last aired in the same month. The University of Southern California alum previously played Esmeralda on The Young and the Restless and Lauren on Undateable.</p>\n\n5 / 49 <p>Carolyn Hennesy has played Sonny Corinthos’ formidable attorney, Diane Miller, since 2007. She has also had memorable recurring roles in Jessie, Revenge, True Blood, and Cougar Town. Hennesy won a Daytime Emmy Award for Outstanding Supporting or Guest Actress in a Digital Drama for The By.</p>\n\n6 / 49 <p>General Hospital recast the role of an adult Michael Corinthos with Chad Duell in 2010. The character was previously played by Drew Garrett and, before him, Dylan Cash, who played a younger version of Carly and Sonny’s son. Duell won a Daytime Emmy Award for Outstanding Supporting actor in 2015.</p>\n\n7 / 49 <p>Port Charles introduced Curtis Ashford, played by Donnell Turner, in 2015. Turner also had short stints as a doctor on Days of our Lives and Dr. Aiden Williams on The Young and the Restless. The actor and motivational speaker previously worked as a double for Eriq LaSalle on ER and Shemar Moore on Criminal Minds.</p>\n\n8 / 49 <p>Since 2015, Eden McCoy has played Carly Corinthos and Jasper Jacks’ daughter Josslyn Jacks. The actress has also appeared in several Disney and Nickelodeon series and is a beach volleyball player.</p>\n\n9 / 49 <p>Emme Rylan stepped into the role of Lesley Lu “LuLu” Spencer in 2013. Lulu was previously played by Daytime Emmy Award-winning actress Julie Marie Berman who played Lulu from 2005 – 2013. The General Hospital star previously played Lizzie Spaulding on Guiding Light and Abby Newman on The Young and the Restless.</p>\n\n10 / 49 <p>Finola Hughes has played General Hospital’s iconic Anna Devane since 1985. Though she’s come and gone over the years, even spending some time on All My Children as both Anna and her twin sister Alex, Hughes brought her alter ego back to Port Charles on a regular basis in 2012. She won a Daytime Emmy Award for her role as Anna in 1991.</p>\n\n11 / 49 <p>Genie Francis has been in and out of Port Charles as the one and only Laura Spencer since 1977. She also enjoyed runs on Days of our Lives, Loving, All My Children, and The Young and the Restless. She won a Supporting Actress Daytime Emmy for her work as Laura in 2007.</p>\n\n12 / 49 <p>Haley Pullos has grown up before viewers’ eyes playing Molly Lansing-Davis. It’s a character she has inhabited since 2009 while also taking recurring roles on The Expanding Universe of Ashley Garcia, Instant Mom, and others.</p>\n\n13 / 49 <p>Ingo Rademacher first came to General Hospital as Jasper “Jax” Jacks in 1996. He left and returned to Port Charles in between stints as a recast Thorne Forrester on The Bold and the Beautiful, Hawaii Five-O, and Titans. Rademacher is also an active lifeguard in Los Angeles.</p>\n\n14 / 49 <p>Jacklyn Zeman has been playing nurse Bobbie Spencer since 1977. She began her career as a dancer, studying at New York University. Before General Hospital, Zeman appeared as Bobbi on The Edge of Night and Lana McClain on One Life to Live.</p>\n\n15 / 49 <p>James Patrick Stuart originated the role of the feared Valentin Cassadine in 2016. He previously portrayed Will Cortlandt on All My Children, and also had recurring characters on Supernatural, 90210, and Emily’s Reasons Why Not. Stuart is a voice-over actor and singer.</p>\n\n16 / 49 <p>Jon Lindstrom first appeared as the evil Ryan Chamberlain on General Hospital in 1992 and then Ryan’s twin brother, Kevin Collins, in 1993. Lindstrom’s other daytime credits include Kevin on Port Charles, Mark McCormick on Santa Barbara, Paul Jarre on Generations, and Craig Montgomery on As the World Turns.</p>\n\n17 / 49 <p>Josh Swickard has been playing Detective Harrison Chase since 2018. BEfore that, he had roles on Liv and Maddie, K.C. Undercover, and School of Rock.</p>\n\n18 / 49 <p>Katelyn MacMullen portrays former cult member Willow Tait on General Hospital. The character, which MacMullen originated on October 18, 2018, is now married to Michael Quartermaine. </p>\n\n19 / 49 <p>Kathleen Gati has been playing the villainous turned sympathetic Liesl Obrecht since 2012. The actress, who had a successful acting career in Hungry, also played Taffy Winslow on All My Children and Aunt Juliette on The Young and the Restless. Her recurring primetime roles include 24, Arrow, and Fear the Walking Dead: Flight 462.</p>\n\n20 / 49 <p>The first trans actor on a soap opera, Cassandra James stepped into the role of Dr. Terry Randolph in 2018. The outspoken activist also had a role in General Hospital alum Vinessa Antoine’s series Diggstown.</p>\n\n21 / 49 <p>Cynthia Watros stepped into Nina Reeves’ shoes on General Hospital in 2019 after Michelle Stafford left the role, earning her a spot in our <a href=\"https://soaps.sheknows.com/wp-admin/_wp_link_placeholder\">best recasts ever list</a>. The soap vet also won a Daytime Emmy for her work as Annie Dutton on Guiding Light, played Kelly Andrews on The Young and the Restless, and filled in as Vicky Hudson on Another World for a couple of episodes. Primetime fans might remember her from House, Lost, and The Drew Carey Show.</p>\n\n22 / 49 <p>Kelly Monaco joined the cast of General Hospital as Sam McCall in 2003. Before that, she played Livvie Locke on Port Charles. The actress awon the first season of Dancing with the Stars and appeared in the single-season reality show Dirty Soap.</p>\n\n23 / 49 <p>The sometimes unethical Scotty Baldwin has been played by Kin Shriner since 1977. The character appeared in both General Hospital and Port Charles. His other soap opera roles include a temporary recast as Jeffrey Bardwell on The Young and the Restless, Keith Morrissey on As the World Turns, Dr. Brian Carey on The Bold and the Beautiful, Mike Gallagher on Rituals, and Jeb Hampton on Texas.</p>\n\n24 / 49 <p>Kirsten Storms began portraying an adult Maxie Jones in 2005 and made appearances on the primetime spinoff General Hospital: Night Shift. Before playing in Port Charles, Storms was well known for her work as Belle Black on Days of our Lives and Zenon Kar in Disney’s Zenon movies.</p>\n\n25 / 49 <p>The fourth actress to play Carly Benson Corinthos, Laura Wright joined General Hospital in 2005. She won a Daytime Emmy Award for Outstanding Lead Actress in 2011. The soap opera vet also played Ally Rescott on Loving and The City, and Cassie Layne on Guiding Light.</p>\n\n26 / 49 <p>Leslie Charleson has been battling Quartermaines and healing Port Charles residents as Monica Quartermaine since 1977. During that time, she crossed over to both Port Charles and Night Shift. The actress also portrayed Alice Whipple on As the World Turns and Iris Donnelly on Love Is a Many Splendored Thing.</p>\n\n27 / 49 <p>Emmy Award winner, Lexi Ainsworth, has been playing Kristina Davis on GH since 2009. She’s been on and off the ABC soap. Ainsworth practically grew up on the show, but before that, she attended many acting camps and began dancing ballet at age six. </p>\n\n28 / 49 <p>Lisa Locicero is remembered for her role on Loving, in 1995 as Jocelyn Roberts Brown. She stayed when the soap was spun off as The City, and once the show ran its course, she moved on to film. Locicero was seen in The Family Man, Rush Hour 2, and in 2008 she began playing Olivia Falconeri on GH. </p>\n\n29 / 49 <p>A household name, Maurice Benard has been portraying Sonny Corinthos since 1993, but this wasn’t his first foray into soaps, having started out as Nico on All My Children in 1987. The actor shares a diagnosis with his character – both having Bipolar disorder. Bernard was diagnosed at 22 and has become a spokesperson for the disorder. He also wrote a book called <a href=\"https://soaps.sheknows.com/general-hospital/news/562867/interview-gh-maurice-benard-talks-memoir-sonny-corinthos/\" target=\"_blank\">Nothing General About It:</a> How Love (and Lithium) Saved Me On and Off General Hospital and chatted recently with Soaps.com about that.</p>\n\n30 / 49 <p>Max Gail is best known for his role as Detective Stan “Wojo” Wojciehowicz from Barney Miller. You can hear the theme song running through your head as you remember watching. He directed many episodes, he was also Harold on D.C. Cab, and he came to General Hospital as Mike Corbin, Sonny’s father in 2018. Gail is Daytime Emmy award winner. </p>\n\n31 / 49 <p>An author, a poet, Michael Easton is a man of many talents. Known for his role as Taner Scofield on Days of our Lives, Easton turned to a fan-fave role as Caleb Morely – a vampire – on Port Charles for two years. Before heading to GH, he was John McBain on One Life to Live (from 2003 to 2012) until the soap went off the air and then he started to appear on General Hospital as McBain until legal issues with Prospect Park that caused him to have to vacate the role. Of course, he returned to portray Dr. Silas Clay shortly thereafter and the rest is history.</p>\n\n32 / 49 <p>For those who weren’t aware, Nancy Lee Grahn played Julia Wainwright Capwell on Santa Barbara from 1985 to 1993 – so well known for that role, fans of the now defunct soap were happy when Grahn turned up on General Hospital to portray Alexis Davis. But it should be noted that she also had a role of a secretary on One Life to Live, before becoming GH’s main lawyer. </p>\n\n33 / 49 <p>Parry Shen hails from Queens New York. He took the role of Brad Cooper on GH in 2013. He’s also been doing some voice work in video games such as Sleeping Dogs, and Mortal Kombat X. Shen has had roles on NCIS, Sabrina the Teenage Witch, and Beverly Hills 90210 to name a few. He’s also a writer!</p>\n\n34 / 49 <p>Paging Nurse Elizabeth Webber! We can hardly recall a time when Rebecca Herbst wasn’t playing one of our fave GH nurses. She’s been doing it since 1986. California native, the actress was a competitive figure skater as a child and teenager. She has three children with her husband, Michael Saucedo (Juan Santiago). </p>\n\n35 / 49 <p>Risa Dorken is Amy Driscoll, GH’s resident nosy nurse! Born in Minnesota, she grew up with dance and vocal lessons and wound up acting. In a bold and brave move, Dorken opened up about her <a href=\"https://soaps.sheknows.com/general-hospital/news/564529/gh-risa-dorken-bipolar-disorder-diagnosis/\" target=\"_blank\">Bipolar Disorder diagnosis</a> recently, helping others struggling to share their experiences and know that they are not alone.</p>\n\n36 / 49 <p>Everyone knows Roger Howarth as One Life to Live’s Todd Manning. He started on OLTL in 1994, even earning himself a Daytime Emmy. But he left that ABC series in 2003 to become Paul Ryan on As the World Turns for a time, before returning to his roots. He was recast as Franco. Some recall he did a stint on Guiding Light as Jory Andros and for many episodes in 1992, he was Kent Winslow on Loving. </p>\n\n37 / 49 <p>This Duke University grad, Ryan Carnes, portrays Lucas Jones on General Hospital. He started in 2004 and left for a short time to portray a recurring role on Desperate Housewives. Remember Justin? Carnes has done a few stints in television shows such as Rizzoli & Isles, and The Closer.</p>\n\n38 / 49 <p>Scarlett Fernandez has been on General Hospital for almost four years. She made her debut in October 2016 and is not like her alter ego, bad girl, Charlotte Cassadine. </p>\n\n39 / 49 <p>Sofia Mattsson, or otherwise known as Sasha Gilmore, was born in Sweden. She moved to USA to model and to act, following her sister, Helena, from American Horror Story. </p>\n\n40 / 49 <p>Sonya Eddy is Epiphany Johnson, a mainstay at General Hospital, the lovable nurse. She had a role on Gilmore Girls, Beverly Hills, 90210, and Married…with Children. She also voice acts. Some may have heard her in Guild Wars 2. She voiced the roles of Lyra Lancetooth and Riel Darkwater.</p>\n\n41 / 49 <p>Who hasn’t heard of Steve Burton? He’s a GH legend who has been playing Jason Morgan on the ABC soap since 1991, with a few breaks. He also portrayed Dylan McAvoy on Young and the Restless, and some may not know that he does voice acting. He’s the voice of Cloud Strife in many Square Enix products such as Final Fantasy VII: Advent Children. Little known fact? He was also Harris Michaels on Days of our Lives in 1988!</p>\n\n42 / 49 <p>Sydney Mikayla portrays Trina Robinson on General Hospital, but she also has a cool role in Netflix’s animated series, Kipo and the Age of Wonderbeasts. She voices the Wolf. Her mother, Sonya is also a Broadway actress and supported Mikayla’s career early on.</p>\n\n43 / 49 <p>Australian-American actor, Tristan Rogers is a General Hospital legend. He originally appeared in 1980 as Robert Scorpio and has come and go a few times, appearing on Young and the Restless, as Colin Atkinson. Recently, Rogers won his first <a href=\"https://soaps.sheknows.com/soaps/news/572525/general-hospital-tristan-rogers-daytime-emmy-win-studio-city/\" target=\"_blank\">Daytime Emmy</a>.</p>\n\n44 / 49 <p>Emmy-award-winning Vernee Watson, from New Jersey, made her way into television and movies starting in 1970. Soap fans may have seen her in Batman Beyond: Return of the Joker, or Christmas With the Kranks as Dox. She has been in countless TV productions and now portrays Stella Henry on General Hospital. She began this role in 2017, where she won two Daytime Emmy awards, one for a Guest Performer and another for Supporting Actress.</p>\n\n45 / 49 <p>Musician, actor, Wally Kurth is known for dividing his time between General Hospital as Ned Quartermaine and Justin Kiriakis on Days of our Lives. Some may remember his days on As The World Turns as Sam Hutchins, while others will recall his band, Kurth and Taylor performing songs for General Hospital and on their own. Here’s a sample, in <a href=\"https://soaps.sheknows.com/days-of-our-lives/news/6057/days-of-our-lives-wally-kurths-band-kurth-taylo/\" target=\"_blank\">the form of a video</a>.</p>\n\n46 / 49 <p>Wes Ramsey became popular playing Sam Spencer on the now defunct soap, Guiding Light. He was also on Charmed, before playing Van in 2010 for four years in Venice: The Series. He has been portraying General Hospital’s Peter August since 2017.</p>\n\n47 / 49 <p>William Lipton plays Cam Webber on General Hospital and has done so since 2014. The actor stated in an interview with <a href=\"https://www.soapsindepth.com/posts/abc/william-lipton-reveals-how-general-hospital-changed-his-life-173456\" target=\"_blank\">Soaps In Depth</a>, “This is the first big, longlasting thing I’ve done, and I’m so happy because it’s such a great community to be a part of.”</p>\n\n48 / 49 <p>William deVry is no stranger to soaps. This Canadian born actor has played Tim Dolan on Port Charlies, before stepping into the role of Michael Cambias on All My Children. He left there and moved to the CBS soap, Bold and the Beautiful, where he portrayed Storm Logan, who died and gave his heart to his sister, Katie. Currently, deVry is Julian Jerome on General Hospital, a role he took on in 2013.</p>"}, {"url": "https://www.soapoperadigest.com/actors/tristan-rogers/", "page_content": "The 411\n\nBorn and raised in Melbourne, Australia, Tristan Rogers originally wanted to go to school for engineering, but his parents sent him to private school instead. After playing drums and singing for a pop band after finishing school, Rogers decided to follow his other passion: acting. He began his acting career in stuntman roles and even took backstage jobs just to stay around the entertainment world. Rogers landed his first starring role in 1969 on an Australian television show called THE LINK MEN, which only lasted 10 episodes. Following the show’s failure, Rogers moved to England, where he found success as a fashion model. He eventually decided to return to acting and moved to the United States, where he auditioned for the role of Robert Scorpio on GENERAL HOSPITAL. Rogers initially tried to use an American accent, but executive producer Gloria Monty told him the only accent he could use was his own! Rogers found fame as Robert Scorpio and stayed on the show until 1992, when he decided to pursue other ventures. He then began to work as a producer and formed Blackwater Entertainment. In 2006, Rogers returned to GENERAL HOSPITAL with several of his co-stars from the 80s in a major storyline involving a hospital epidemic. After making several small appearances on the show, Rogers joined the cast of GENERAL HOSPITAL: NIGHT SHIFT in its second season.\n\nDuring his time on GH, Rogers won the 1981 Soapy Award for Most Exciting New Actor, and was nominated for two Soap Opera Digest Awards.\n\nIn 2010, Rogers joined Y&R as Cane’s father, Colin. His official Web site is www.tristanrogers.com.\n\nShow more"}, {"url": "https://soaps.sheknows.com/general-hospital/news/628385/general-hospital-tristan-rogers-before-he-was-a-soap-star-past/", "page_content": "Credit: Sean Smith/JPI\n\n“Come on, every actor works as a barman, a cabman, drives a cab…”\n\nTristan Rogers (Robert) had taken an interesting journey before landing his first daytime role on General Hospital and shared a few of his detours during an interview on Maurice Benard’s (Sonny) State of Mind. Rogers gave a glimpse into his childhood, which was very good, and reflected on what led him to becoming an actor.\n\nBack then, the area where they lived was considered to be very bad. “Nowadays, that area, you couldn’t get an outhouse for less than $3 million dollars,” Rogers shared. After his parents saved, the family bought a house in a new development, where the actor started a whole new life. He left school in 1964 and “goosed around for about two years and basically pissed [his] parents off” then he and some friends started a rock band. It wasn’t long before, at 21 years old, he realized they couldn’t make any real money so Rogers started doing commercials and some modeling work — and made good money.\n\nMore: Tristan Rogers shares stories from early GH days\n\nWhen he decided he wanted to start acting, without any acting classes under his belt, Rogers had no idea what the ramifications of that would be and about to commitment you had to make. “As far as I was concerned, it was a way to make a bit of money. That’s all.” His first audition was in a lobby, while a janitor mopped, and he started doing under-five roles. When he learned about a new cop series in Sydney, he moved and landed the part as a detective on The Link Men. From there he went to London, reconnected with his former producer and landed his next role on Paul Temple, without an audition, which was a huge success and really was his “start in the industry.”\n\nMore: Why Robert and Laura never became a couple\n\nSo, what came next? In 1972, Rogers worked at a discotech and joked, “Come on, every actor works as a barman, a cabman, drives a cab.” However, when the disc jockey didn’t turn up on New Year’s Eve, Rogers volunteered then froze in front of a full house — until he figured it out and realized, “This is fun.” After buying a guy’s equipment and music, he got hired at a club in London.\n\nWhen that didn’t pan out, Rogers consulted on commercial radio, which led to a memorable moment getting to see Elton John and Kiki Dee headline a show. But then Rogers’ visa ran out and he was forced to leave the country.\n\nMore: Why Luke and Laura’s wedding almost didn’t happen\n\nListen as he explains how it all went down but be aware, Rogers is a tell-it-like-it-is guy, which means a bit of salty language!\n\nNow that we’ve heard Rogers’ story, find out what other actors did before they were stars in our gallery below.\n\nVideo: State of Mind/YouTube"}, {"url": "https://www.soapcentral.com/general-hospital/news/2020/1202-tristan_rogers_marks_40_gh_years.php", "page_content": "Posted Wednesday, December 02, 2020 10:46:17 AM\n\nTime to bust out the Champagne and give a toast to Tristan Rogers, who is celebrating his 40th anniversary of playing Robert Scorpio! The Australian actor took on the role of the heroic WSB agent on December 2, 1980, and says that even he can't believe that four decades have passed since his first day in Port Charles.\n\n\"To look back and think I've been associated with this show for 40 years is pretty incredible, but to try to put that into words is difficult,\" he shares with Soap Opera Digest. \"As someone once said, you can't dwell on the past; you're as good as your next show. As long as I can entertain people, I'm doing the right thing.\"\n\nRogers surmises that one of the reasons that Robert has stuck around for so long (minus sporadic breaks from the soap, which we break down below) is because the character has somehow managed to resonate with a wide spectrum of viewers of all ages.\n\n\"As the years have gone by, I've managed to attract an across-the-board demographic across the audience, which is great,\" he says. \"To think that from the '80s to now, 40 years down the line, people still like what I'm doing, that's really gratifying. You think to yourself, 'Yeah, I did the right thing. I'm not sure what I did, but I did the right thing!' I look back on it with a degree of pride.\"\n\nRogers' 40-year history with GH is one heck of a roller coaster. As longtime fans might recall, his Port Charles journey began with an action-packed 1981 storyline in which Robert was following Luke Spencer (Anthony Geary), who he thought knew the whereabouts of a rare and elusive diamond called the Ice Princess. Robert was posing as a playboy financier who wanted the diamond for financial reasons, and when the two men butted heads, Robert revealed to Luke and his fiancée, Laura Webber (Genie Francis), that he was actually a WSB agent working undercover to find the Ice Princess and retrieve it before it got into the hands of the Cassadine family. Luke agreed to help him get it back and fight the Cassadines before they tried to take over the world, using this diamond to do it -- thus beginning a friendship between Robert and Luke, with Robert even standing up as Luke's best man at his wedding.\n\nCongratulations to the amazing @tristanrogers on an historic 40 years on @GeneralHospital! #GH wouldn't be the show it is today without this legend of daytime television. Happy Anniversary! https://t.co/w1n499sTFy — Frank Valentini (@valentinifrank) December 2, 2020\n\nSome of Robert's other storylines over the past four decades include a loving relationship with his daughter, Robin (Kimberly McCullough); an at-first rocky relationship with his brother, Mac (John York); a battle with a deadly virus that nearly killed everyone in Port Charles; delivering Lorenzo (Ted King) and Skye's (Robin Christopher) baby; catching Faison (Anders Hove) when he was pretending to be \"Duke\"; a couple of serious comas; being presumed dead in a boat explosion; and romances with scores of beautiful women like Jackie Templeton (Demi Moore), Holly Sutton (Emma Samms), Katherine Delafield (Edie Lehmann), and Anna Devane (Finola Hughes).\n\nAt this time, it's unclear if GH is planning a tribute to Rogers for his 40th anniversary or if any special material will air to mark the special occasion. Soap Central will keep you updated if further information becomes available.\n\nAfter joining GH in 1980, Rogers stayed with the ABC soap opera until 1992, when Robert was (wrongly) declared dead in a boat explosion. He returned to the series in 1995 in spirit form to comfort Robin, who had found out she was HIV-positive and was dealing with the death of her boyfriend, Stone (Michael Sutton), from AIDS-related illness. Rogers returned again for two short arcs in 2006, during which Robert was discovered to be very much alive.\n\nRogers once again stepped back into the role of Robert in 2008, for GH's primetime spin-off series General Hospital: Night Shift. He made it back to the original GH in 2012, when Robert believed Robin had died in a lab explosion, and again in 2013, when Robin was revealed to be alive. However, in November of 2013, it was announced that the actor would be departing the series to return to The Young and the Restless, where he'd played the role of Colin Atkinson from 2010 to 2011.\n\nRogers returned as GH's Robert in December of 2015, but he was also portraying Colin on Y&R at the same time, so his return was rather short; he only stayed until February of 2016 and made another brief return from August to September that same year. Rogers returned to GH in April of 2018 for a short story arc in which he aided Anna in trying to locate her long-lost son, Henrik Faison. He returned yet again from July to September that same year for another story arc in which Anna and Finn (Michael Easton) went missing. Fortunately, he reprised the role of GH's Robert once again in January of 2019 and has remained on the soap since on a recurring basis."}, {"url": "https://www.soapcentral.com/general-hospital/news/2013/1114-rogers.php", "page_content": "Posted Thursday, November 14, 2013 12:42:20 PM\n\nLong-time fan favorite Tristan Rogers (Robert Scorpio) is once again leaving his role on General Hospital. The news -- which not only surprised fans, but also the show's head writer -- has a second layer of surprise: he's already lined up another job.\n\n\"Guys, I had no idea @tristanrogers was leaving,\" General Hospital's head writer, Ron Carlivati, shared on Twitter. \"I found out last night. I now have 1 day to write him out of a big [February] Sweeps storyline. Meanwhile, you will see a lot of Robert between now and February! And please respect [Rogers] and his decision.\"\n\nRogers will continue taping at General Hospital for a few more weeks. After wrapping up his stay in Port Charles, Rogers will step back into the role of Colin Atkinson, a role he originated on CBS's The Young and the Restless in December 2010. Rogers' alter ego was last seen on Y&R in May 2012.\n\n\"I'd like to thank Frank [Valentini, GH's executive producer] and Ron for great storyline that kept Scorpio true to himself,\" Rogers posted on Twitter. \"I'm stoked on Colin's return to #YR in 2014 and delighted to once again be a part of the CBS Daytime family.\"\n\nRogers appeared as a contract player on GH from 1980 to 1992. He returned to the ABC soap for guest appearances in 1995, 2006, 2008, 2011, 2012, and 2013. In 1997, the Australian-born actor briefly played Hunter on The Bold and the Beautiful.\n\n\"Join me in welcoming @tristanrogers back to the family,\" Angelica McDaniel, head of CBS Daytime, announced on Twitter.\n\n\"We have an exciting story planned with [Tristan] and Jess Walton [Jill) that will begin in early 2014,\" a Y&R spokesperson said in a statement."}, {"url": "https://www.rottentomatoes.com/celebrity/tristan_rogers", "page_content": "Highest Rated: 71% The Rescuers Down Under (1990)\n\nLowest Rated: 71% The Rescuers Down Under (1990)\n\nBirthday: Jun 3, 1946\n\nBirthplace: Melbourne, Victoria, Australia\n\nIn 1980, Australian actor Tristan Rogers landed a small role on what was then the most popular soap opera in the world, \"General Hospital,\" (ABC, 1963- ), having no idea he would become the first of many hunky Australian exports to set American hearts aflutter. Playing Robert Scorpio, a sophisticated and savvy operative for the World Security Bureau, Rogers was teamed up with the most famous couple in the world at that time -\"GH\" lovers Luke and Laura - to help save the world from being frozen solid. He went on to become one of the soap world's most iconic actors, even long after he had left the show and moved on to other endeavors."}], "Tristan Rogers played the role of Robert Scorpio on General Hospital until 1992.": [{"url": "https://www.soapcentral.com/general-hospital/news/2020/1202-tristan_rogers_marks_40_gh_years.php", "page_content": "Posted Wednesday, December 02, 2020 10:46:17 AM\n\nTime to bust out the Champagne and give a toast to Tristan Rogers, who is celebrating his 40th anniversary of playing Robert Scorpio! The Australian actor took on the role of the heroic WSB agent on December 2, 1980, and says that even he can't believe that four decades have passed since his first day in Port Charles.\n\n\"To look back and think I've been associated with this show for 40 years is pretty incredible, but to try to put that into words is difficult,\" he shares with Soap Opera Digest. \"As someone once said, you can't dwell on the past; you're as good as your next show. As long as I can entertain people, I'm doing the right thing.\"\n\nRogers surmises that one of the reasons that Robert has stuck around for so long (minus sporadic breaks from the soap, which we break down below) is because the character has somehow managed to resonate with a wide spectrum of viewers of all ages.\n\n\"As the years have gone by, I've managed to attract an across-the-board demographic across the audience, which is great,\" he says. \"To think that from the '80s to now, 40 years down the line, people still like what I'm doing, that's really gratifying. You think to yourself, 'Yeah, I did the right thing. I'm not sure what I did, but I did the right thing!' I look back on it with a degree of pride.\"\n\nRogers' 40-year history with GH is one heck of a roller coaster. As longtime fans might recall, his Port Charles journey began with an action-packed 1981 storyline in which Robert was following Luke Spencer (Anthony Geary), who he thought knew the whereabouts of a rare and elusive diamond called the Ice Princess. Robert was posing as a playboy financier who wanted the diamond for financial reasons, and when the two men butted heads, Robert revealed to Luke and his fiancée, Laura Webber (Genie Francis), that he was actually a WSB agent working undercover to find the Ice Princess and retrieve it before it got into the hands of the Cassadine family. Luke agreed to help him get it back and fight the Cassadines before they tried to take over the world, using this diamond to do it -- thus beginning a friendship between Robert and Luke, with Robert even standing up as Luke's best man at his wedding.\n\nCongratulations to the amazing @tristanrogers on an historic 40 years on @GeneralHospital! #GH wouldn't be the show it is today without this legend of daytime television. Happy Anniversary! https://t.co/w1n499sTFy — Frank Valentini (@valentinifrank) December 2, 2020\n\nSome of Robert's other storylines over the past four decades include a loving relationship with his daughter, Robin (Kimberly McCullough); an at-first rocky relationship with his brother, Mac (John York); a battle with a deadly virus that nearly killed everyone in Port Charles; delivering Lorenzo (Ted King) and Skye's (Robin Christopher) baby; catching Faison (Anders Hove) when he was pretending to be \"Duke\"; a couple of serious comas; being presumed dead in a boat explosion; and romances with scores of beautiful women like Jackie Templeton (Demi Moore), Holly Sutton (Emma Samms), Katherine Delafield (Edie Lehmann), and Anna Devane (Finola Hughes).\n\nAt this time, it's unclear if GH is planning a tribute to Rogers for his 40th anniversary or if any special material will air to mark the special occasion. Soap Central will keep you updated if further information becomes available.\n\nAfter joining GH in 1980, Rogers stayed with the ABC soap opera until 1992, when Robert was (wrongly) declared dead in a boat explosion. He returned to the series in 1995 in spirit form to comfort Robin, who had found out she was HIV-positive and was dealing with the death of her boyfriend, Stone (Michael Sutton), from AIDS-related illness. Rogers returned again for two short arcs in 2006, during which Robert was discovered to be very much alive.\n\nRogers once again stepped back into the role of Robert in 2008, for GH's primetime spin-off series General Hospital: Night Shift. He made it back to the original GH in 2012, when Robert believed Robin had died in a lab explosion, and again in 2013, when Robin was revealed to be alive. However, in November of 2013, it was announced that the actor would be departing the series to return to The Young and the Restless, where he'd played the role of Colin Atkinson from 2010 to 2011.\n\nRogers returned as GH's Robert in December of 2015, but he was also portraying Colin on Y&R at the same time, so his return was rather short; he only stayed until February of 2016 and made another brief return from August to September that same year. Rogers returned to GH in April of 2018 for a short story arc in which he aided Anna in trying to locate her long-lost son, Henrik Faison. He returned yet again from July to September that same year for another story arc in which Anna and Finn (Michael Easton) went missing. Fortunately, he reprised the role of GH's Robert once again in January of 2019 and has remained on the soap since on a recurring basis."}, {"url": "https://www.soapsindepth.com/posts/abc/robert-scorpio-general-hospital-tristan-rogers-160311", "page_content": "Longtime fans are always excited when Robert Scorpio is on GENERAL HOSPITAL. Tristan Rogers made his debut in December of 1980 and played the popular character until 1992, making various returns in the years since. Every time this super spy shows up on GH, he brings the action and the drama, and now it looks like he’ll be around for a while!\n\nRobert first appeared in Port Charles tracking Luke Spencer and Alexandra Quartermaine in search of the Ice Princess, which was really a large uncut diamond containing the secret to carbonic snow. Although Luke and Robert initially thought they were enemies, when they realized they were on the same side, they teamed up to stop the Cassadines from freezing the world. Following the adventure, Robert resigned from the World Security Bureau because they disagreed about destroying the Ice Princess and its formula. He briefly dated Tiffany Hill, who he’d met during the caper, but their romance fizzled.\n\nRobert, Laura, and Luke’s trip to Cassadine Island was anything but a vacation! ABC Photo Archives/ABC via Getty Images\n\nNext, Robert found himself drawn to reporter Jackie Templeton, who was searching for her missing sister, Laura, a model who resembled Laura Spencer. Robert was already helping Luke track down his missing wife, and they discovered David Gray had arranged for Laura Spencer’s disappearance. After Luke killed David in a sword fight, they were led to believe Laura had drowned at sea, and Robert consoled his grieving friend.\n\nAfter he and Luke were caught up in an oil scam orchestrated by Holly Sutton’s family, Robert ended up marrying the Brit. See, she was pregnant with Luke’s baby and since he was presumed dead at the time, Robert made her his wife so she wouldn’t be deported. Sadly, she miscarried the child, but Holly and Robert eventually found love.\n\nJackie wasn’t thrilled when Holly’s eyes turned from Luke to Robert in the end. Erik Hein/ABC via Getty Images\n\nWhen Mac Scorpio first came to town, Robert had a rocky relationship with his brother because he blamed him for the death of their parents. Thankfully they were able to bury the hatchet before Robert and his wife, Anna Devane, were presumed dead in 1992, leaving their teenage daughter, Robin, to be raised by Mac.\n\nRobert resurfaced in 2006, five years after Anna, to reveal that he was forced to go into hiding by the WBS and couldn’t tell anyone where he was. He was tracking down a lethal strain of encephalitis from the South Pacific which menaced Port Charles. Later, Robert was diagnosed with colon cancer, and after slipping into a coma, he recovered and went to Europe for further treatment.\n\nLuke talked his friend off the ledge… literally! Rick Rowell/ABC via Getty Images\n\nAfter Robin was presumed dead in an explosion, Robert returned to Port Charles in 2012 and even contemplated taking his own life out of grief over not being able to protect his daughter. Thankfully, Luke was able to talk his friend down. Later, Luke brought Robert back to town to investigate the return of Duke Lavery who they soon discovered to be Cesar Faison in disguise. After locating the real Duke, Robert saw Robin alive but was put into a coma by Dr. Liesl Obrecht to keep him quiet. When he finally awoke, Robert managed to convince Anna their daughter was alive and after an adventure that found them held prisoner temporarily by Jerry Jax, they were reunited with Robin.\n\nRobert helped keep Anna from taking revenge by killing Faison, and later also helped her deal with her rage towards Carlos after he’d killed Duke. In the spring of 2018, the spy appeared in Switzerland to offer Anna help in tracking down her son, Henrik Faison. As he was getting too close to the truth, Valentin Cassadine drugged and imprisoned Robert, but the truth couldn’t be kept hidden for long!\n\n”Do as I say, not as I do, Anna.” XJJohnson/jpistudios.com\n\nRobert reappeared in Port Charles to take Peter/Henrik into custody but he cut a deal to stay out of prison. He also enlisted Finn’s help to find a missing Anna, and when it turned out she was just bait to abduct Finn, Robert had to help them both escape their kidnappers. He then helped Anna track down Alex so she could get to the bottom of the mysterious virus that temporarily took away her eyesight. Of course, the spy was also a thorn in Finn’s side as he prepared to propose to Anna, but nobody’s perfect! Robert also aided Sonny in his search for Dante, journeying with him to Turkey to bring the guy home. Unfortunately, Dante had to leave again to undergo treatment for his PTSD and Robert was forced into retirement by the WSB.\n\nAfter Margaux Dawson resigned, Robert was hired as Port Charles’ newest district attorney, since he apparently attended law school before being recruited by the WSB. This put him at the forefront of keeping Port Charles crime-free, which is a lot of work!\n\nABC\n\nRobert was shaken to hear reports that Holly had died while on WSB business, but remained skeptical, refusing to believe that she was really gone. He brought Olivia Falconeri to the WSB facility in Switzerland to visit her son, Dante, but he refused to see her. Before returning to Port Charles, they attended Holly’s memorial service in England, but Robert was stunned to get a phone call that sounded like Holly begging him to help her! Olivia tagged along as Robert flew to Monte Carlo to investigate and find out what was really going on, and they got some help from Ethan Lovett, who was also after his mom, but they ultimately returned to Port Charles unable to rescue Holly.\n\nAfter their trip, Robert remained friendly with Olivia but kept his distance as it had put a strain on her marriage to Ned. He continued to work to help bring Peter August to justice and was devastated when Anna reported news that their old friend, Sean Donely, had passed away.\n\nRobert teamed up with Anna again to help stop Peter and was stunned to learn that Victor Cassadine was not only alive, but allied with the villain! After returning from Greece, Robert was stunned when a drunk Olivia kissed him and a jealous Ned punched him, but he was able to clear the air and help Olivia repair her marriage. He then traveled with Anna to Cassadine Island where they took Peter into custody.\n\nStay tuned to see what happens next!\n\nLove GH? Be sure to join our We Love General Hospital Facebook group to chat about all the latest storylines and juicy gossip!"}, {"url": "https://soaps.sheknows.com/general-hospital/news/585354/general-hospital-tristan-rogers-anniversary-debut-robert-scorpio/", "page_content": "Credit: John Paschal/JPI, ABC/Courtesy of the Everett Collection (2)\n\nWhat began as a two-day gig turned into the role of a lifetime.\n\nWhen Tristan Rogers first aired on General Hospital on December 2, 1980, he didn’t know that his life had been changed forever, that he’d still be playing the same part more than four decades later, that his name would become synonymous with his on-screen alter ego’s.\n\nThe audience probably could have clued him in, though.\n\nFrom the moment that the Australian actor hit the screen, he was a hit as Port Charles’ answer to James Bond, Robert Scorpio. No way were viewers of the ABC soap going to let him go. And he wouldn’t be all that eager to let go himself, either.\n\n“The role allowed for the creation of a character that was fresh and different for daytime television as a sort of intriguing… mysterious type,” he recalled for That’s Awesome in the fall of 2020. “As [Robert] was involved with the incredibly popular supercouple Luke and Laura, the fans really embraced my character and me.”\n\nSo much so that Rogers couldn’t go anywhere without being more than recognized, mobbed. “Being a part of such a wildly popular show at the time came with sacrificing privacy and made it almost impossible for me to do something as simple as going to a store without security,” he told the website. “Thank goodness it was a time without social media!\n\n“While I would not trade a minute of it,” he hastened to add, “I did not realize that this two-day shoot would turn into a role that would explode the way it [did] and one that I would play for decades.”\n\nOver the years, Rogers has appeared on loads of primetime series and even other soaps, most notably The Young and the Restless, where he imbued Colin Atkinson with an enviably cheeky charm. (That’s him with leading lady Jess Walton as Jill below.) But it’s Robert Scorpio for which he’ll always be best known.\n\nNonetheless, Rogers doesn’t regret his decision to leave General Hospital in 1992. “I kind of had to get away from it,” he explained to Soap Opera Digest in 2019. “I was very unhappy being on the show at that time… I had a real yearning to do something else.”\n\nSo he did a whole lot of “something else,” from Showtime’s NASCAR-racing drama Fast Track to Babylon 5 (pictured below) to voice work on animated shows such as Captain Planet and the Planeteers and Batman Beyond. Finally, after making a few “spectral” returns to General Hospital, Rogers raised Robert from the grave in 2006.\n\nSo today, on the anniversary of our introduction to his iconic character, why not celebrate by looking through the below photo gallery, which reviews his life and many, many loves in Port Charles?"}, {"url": "https://ew.com/article/2015/10/29/tristan-rogers-general-hospital/", "page_content": "He’s back. ABC announced on Wednesday that Tristan Rogers’ superspy Robert Scorpio will return to General Hospital this December.\n\nAfter years of on-and-off appearances, Rogers’ character said goodbye to Port Charles in January 2014 as Rogers returned to his role on The Young and the Restless. But considering Scorpio once came back from the dead, it’s hard to believe anything could keep him away from General Hospital for long. Details are still mum about the circumstances of his return.\n\n“Scorpio is such a beloved legacy character who evokes a sense of nostalgia and I know the fans have been patiently waiting for Tristan’s return,” executive producer Frank Valentini said in a statement. “I share their sentiments and enthusiasm and that of our entire GH team in welcoming him home. It’s been a fantastic week of casting announcements for GH, but it’s not over yet.”\n\nRogers first appeared on General Hospital in December of 1980 and starred until 1992. He has made on-and-off appearances on the soap ever since.\n\n“I am delighted to be visiting my friends in PC. Stand by for some fun stuff,” Rogers wrote on Twitter. “Looking forward to seeing old faces. Let’s have some good times.”"}, {"url": "https://www.thewrap.com/tristan-rogers-robert-scorpio-to-return-to-general-hospital/", "page_content": "Robert Scorpio is returning to Port Charles.\n\nTristan Rogers will reprise his role as the super spy on “General Hospital” this December. He will be joined by Kimberly McCullough, who played Scorpio’s daughter, Robin. The actor, who originated the role in 1980, last appeared on the show in January 2014.\n\n“Scorpio is such a beloved legacy character who evokes a sense of nostalgia and I know the fans have been patiently waiting for Tristan’s return,” said the series’ executive producer Frank Valentini. “I share their sentiments and enthusiasm and that of our entire GH team in welcoming him home. It’s been a fantastic week of casting announcements for GH, but it’s not over yet.”\n\nAlso Read: 'General Hospital' Star Nancy Lee Grahn Rips Viola Davis' Emmy Speech - and Then Apologizes Profusely\n\n“I am delighted to be visiting my GH family once again and look forward to what Robert Scorpio has in store,” said Rogers.\n\nFinola Hughes and Genie Francis also recently announced they will continue star on the ABC daytime soap."}, {"url": "https://www.tvinsider.com/people/tristan-rogers/", "page_content": "Actor\n\nBirth Date: June 3, 1946\n\nAge: 77 years old\n\nBirth Place: Melbourne, Victoria, Australia\n\nIn 1980, Australian actor Tristan Rogers landed a small role on what was then the most popular soap opera in the world, \"General Hospital,\" (ABC, 1963- ), having no idea he would become the first of many hunky Australian exports to set American hearts aflutter. Playing Robert Scorpio, a sophisticated and savvy operative for the World Security Bureau, Rogers was teamed up with the most famous couple in the world at that time -\"GH\" lovers Luke and Laura - to help save the world from being frozen solid. He went on to become one of the soap world's most iconic actors, even long after he had left the show and moved on to other endeavors."}, {"url": "https://www.thelist.com/1260999/meet-actor-general-hospital-new-ethan-lovett/", "page_content": "Considering Holly Sutton (Emma Samms) first came to Port Charles as a con artist on \"General Hospital\" in the 1980s, it's no surprise that her son Ethan Lovett also had a checkered past — including running occasional cons of his own. Actor Nathan Parsons played the role from 2009 to 2012, with occasional returns over the years. The last time Ethan was seen on-screen was in 2020 when Robert Scorpio (Tristan Rogers) and Olivia Falconeri (Lisa Locicero) were trying to track down a missing Holly.\n\nIt turned out that Holly had been kidnapped by the evil Victor Cassadine (Charles Shaughnessy), and he had not only killed her sister Paloma Perez (also Samms) but also kidnapped Ethan to force Holly to do his bidding. With the help of Robert and Felicia Scorpio (Kristina Wagner), Holly's fiery fakeout exit allowed her to get out from under Victor's control, as she pretended she had a catastrophic burn injury and set out to find Ethan. Now, as Victor's reign of terror kicks into high gear, Felicia met up with Holly at a hotel just off the Venezuelan coast to get the former con artist's help. Holly had tracked Ethan to the island, and the two women bribed their way into an auction. They were shocked to find Ethan himself was a captive and was put up for bid — with the winner allowed to kill him!\n\nFans were also in for another shock."}, {"url": "https://soaps.sheknows.com/general-hospital/news/567747/general-hospital-tristan-rogers-birthday/", "page_content": "Credit: Image: Jill Johnson/JPI\n\nTristan Rogers is the spy we’ve always loved.\n\nHappy birthday, Tristan Rogers, who turns 74 on June 3! Since 1980, the dashing Australian actor has wowed fans, primarily with his long-running on-and-off iconic role on General Hospital (Robert Scorpio, 1980 – present), though he’s also appeared on The Young and the Restless (Colin Atkinson), The Bay (Lex Martin), Studio City (Doc) and The Bold and the Beautiful (Hunter Jones). Over the years, fans have followed his adventures through virtually every form of law enforcement – he’s been a private detective, a super spy, a police commissioner and a district attorney – but there’s much more to the actor than first meets the eye, as fans know. Here are 11 tidbits about the wonder from Down Under you might not have heard before…\n\nTristan Rogers’ character has had a long, winding path through General Hospital over the years. A spy with the WSB agency, he shared adventures with Luke and Laura during their heyday, departed in 1992 as “killed with no body found,” returned as a spirit to comfort his daughter Robin 1995 and then popped up, still living in 2006. He’s been on-and-off again ever since – even while appearing on The Young and the Restless.\n\nMore: Exclusive, Days actress reveals upcoming novel\n\nOutside soaps, he’s done voice-over work in movies like The Rescuers Down Under (1990) and in the video game based on Mad Max, plus in ads for Outback Steakhouse, Foster’s Lager, Reebok and Epson.\n\nRogers is a naturalized U.S. citizen, and has lived in Palm Springs, California since 1994.\n\nWhen he was 16 he worked at a friend’s father’s printing shop – but failed terribly. “I could never get that printing press to work,” he shared in a 2014 interview. “About three weeks later we realized that printing was not going to be my profession.” He classed that job as his “worst” ever.\n\nOne of his early film jobs in his career was in a movie originally titled Sex Farm – which was later renamed Frustrated Wives. The movie was about “a pair of frustrated housewives who are bored and neglected by their husbands” who “decide to go to a ‘sex clinic’ in the country.”\n\nWhat’s his favorite General Hospital story of all time? Over the years, Rogers has expressed how much he enjoyed doing the Ice Princess story in 1980, which was a diamond that had been painted black – with untold powers the Cassadines would do anything to obtain. Robert Scorpio showed up for the first time in the story, working with Luke and Laura on the Cassadines’ private island, where they discovered that Mikkos was going to hold the world for ransom using the Ice Princess. (Hey, we said it was powerful.)\n\nMore: GH fan fiction, someone is held at gunpoint\n\nIn the new millennium, Rogers has worked closely with fellow actor Sean Kanan (General Hospital, A.J. Quartermaine; The Bold and the Beautiful/The Young and the Restless, Deacon Sharpe; Sunset Beach, Jude Cavanagh; The Bay, Kenneth Allen; Studio City, Sam Stevens), on multiple projects, including Studio City and the soap-star-studded film Jack Rio (2008), which also featured soap actors Brian Krause (Another World, Matthew Cory), James Patrick Stuart (All My Children, Will Cortlandt; 90210, Charles Clark; General Hospital, Valentin Cassadine), Nadia Bjorlin (Days of our Lives, Chloe Lane; Venice the Series, Lara Miller; Beacon Hill, Sara Preston) and Matthew Borlenghi (All My Children, Brian Bodine; The Bold and the Beautiful, Ziggy Deadmarsh; Days of our Lives, Anthony Marino).\n\nRogers has been married twice: to Barbara Meale (1974 – 1984), and Teresa Parkerson (1995 – present). He and Theresa have two children: Sara Jane, born in 1992, and Cale, born in 1996.\n\nOn General Hospital, Robert fell for Luke’s lady Holly (Laura was out of the picture by then) – and in real life, the two actors dated for over a year. Swoon!\n\nRogers is both athletic and mechanically-minded, and has a slew of hobbies related to both: he’s built model cars, he does his own bicycle maintenance, and loves driving race cars. He’s also a runner and rides his bike in the annual Tour de Palm Springs – and loves to fish and skeet shoot.\n\nHe calls it “hokey” on Twitter, but Rogers has been participating in a web series during quarantine called Six Blocks Apart, where he speaks with his neighbors in Palm Springs via Zoom. According to the YouTube description, “We hope to bring you laughter, positive energy, advice on where to hang out in Palm Springs, learning experiences to pass on, and some living life silliness while sharing some of our intimate moments.”\n\nHappy birthday to Tristan – our hope is this year is filled with blessings.\n\nHey folks I’m doing this hokey show on You Tube called “6 blocks Apart”. It’s about everything and nothing and goes out 3 times a week. Hope you can check it out. — tristanrogers (@tristanrogers) May 6, 2020\n\nSign up for Soaps.com’s newsletter, where you’ll get all the scoops, scandal and story you can handle."}, {"url": "https://www.inquisitr.com/2526848/general-hospital-news-tristan-rogers-returns-to-his-role-as-robert-scorpio", "page_content": "There is yet another General Hospital vet that is making his way back to Port Charles. Tristan Rogers, who plays the lovable Robert Scorpio on the daytime drama, is returning to the role that he originated back in 1980.\n\nIt was posted on the official GH site, and also confirmed by Executive Producer Frank Valentini on his Twitter account, that the longtime actor will be coming back this December. He has been gone for almost two years now, so fans will be thrilled to have him back. Valentini had this to say about Tristan’s anticipated return.\n\n“Scorpio is such a beloved legacy character who evokes a sense of nostalgia and I know the fans have been patiently waiting for Tristan’s return. I share their sentiments and enthusiasm and that of our entire GH team in welcoming him home.”\n\nTristan Rogers is also happy to come back to his stomping grounds on General Hospital. He has been one of the most beloved characters on the soap for many years, and this news will definitely spread quickly. Rogers had this to say about his return.\n\n“I am delighted to be visiting my friends in PC. Stand by for some fun stuff.”\n\nIn addition to Robert Scorpio returning to General Hospital this winter, it was recently announced that daughter Robin Scorpio, played by actress Kimberly McCullough, is also returning. There is no word yet on how long Robin is sticking around Port Charles, but viewers are probably hoping that there will be a Scorpio reunion between these two, and also mom Anna Devane (Finola Hughes). It is always a delight to see these three actors together on screen.\n\nRobert Scorpio is known as the dashing super spy with the adorable Australian accent. He was one of the leading men on General Hospital back in the 80’s as he battled bad guys with Luke Spencer and had noted romances with both Anna Devane and Holly Sutton. After his latest departure from the ABC soap in 2014, Tristan returned to The Young and the Restless in the role of Colin Atkinson, leaving Scorpio behind.\n\nNow that he is coming back to Port Charles, he will get to spend some time with his granddaughter Emma Drake as well. It may be a good thing to have her grandpa’s shoulder to cry on because it looks like her daddy’s new, or soon-to-be wife Sam, may be going back to her not-so-dead husband, Jason Morgan, after she finds out that he is alive and well.\n\nThis Scorpio family reunion is most likely just temporary as Jason Thompson is rumored to be leaving his role as Robert’s ex-son-in-law, Patrick Drake soon. This whole thing may just have to do with him leaving. Robin Scorpio’s on screen time is just temporary and she may be taking Patrick with her. There is no word on just how long Tristan Rogers is sticking around, but it will be great to have him no matter how long he stays.\n\nRobert could also be coming back to help Anna out of her Carlos Rivera dilemma. She is feeling the heat from Paul Hornsby at the moment and may just need the expertise of the former WSB agent to get her out of it.\n\nThis has been quite an exciting week for General Hospital fans who love these beloved soap characters, but there may be even more casting news coming. Frank Valentini teased in his statement that there could be more news for viewers.\n\n“It’s been a fantastic week of casting announcements for GH, but it’s not over yet.”\n\nWhat does he mean by that? Could there be another familiar face coming to Port Charles very soon?\n\nWho would you like to see come back to General Hospital? Comment below on what you think about Tristan Rogers making his way back to the ABC soap.\n\n[Photo by Jason Merritt/Getty Images]"}, {"url": "https://soaps.sheknows.com/gallery/photos-general-hospital-tristan-rogers/", "page_content": "The man is in love\n\nImage Credit: Image: ABC\n\nRobert and Anna have been a popular supercouple years ago on General Hospital though they’re not together now. They met working at Word Security Bureau (WSB) and fell in love. They married in Italy. While Anna has moved on with Finn, Robert confessed she’s the love of his life but he’s happy for her and Finn."}]}