{"Derek King began his career in the NSL with Sydney Olympic in 1989.": [{"url": "https://sydneyolympicfc.com/?page_id=438", "page_content": "1957\n\nPan Hellenic - The Beginnings\n\nEstablished in Sydney by Greek immigrants in 1957, Sydney Olympic Football Club has been and continues to be a major pillar and a leading contributor to football in Australia as well as a nursery to many of its finest talents.\n\nThe founding date of the Club is set as 28 November 1957, as this was the first meeting of Club Founder Christos Giannakoulias with several other influential protagonists at his home. It was decided there, that the newly formed team would be known as Pan-Hellenic."}, {"url": "https://www.theguardian.com/sport/blog/2015/sep/08/forgotten-story-brunswick-juventus-1985-nsl", "page_content": "Strewn across Melbourne’s northern suburbs are the remnants of a once-great football club. Juventus, one of the most successful Victorian sides during the 1950s and 1960s, has gradually been whittled away to nothing. Thirty years ago to the day Juventus lifted their one and only National Soccer League trophy, yet within three seasons the club was relegated from the NSL, and by 1996 they were kicked out; this time for good.\n\nA few years ago, a family tree of the Italian clubs in Victoria was published online. Trying to follow the maze of splinters, mergers and breakaways makes for head-spinning reading. Triestina, for example, became Essendon Royals by virtue of mergers with Fiorentina, Moonee Ponds, East Brunswick Reggina and a host of other clubs.\n\nFormed out of the predecessor club Savoia in 1949, Juventus was supposed to be the great unifier. According to the official history book, Juve! Juve!, the name “Juventus” was chosen for its neutrality, and because black and white striped shirts were “always easy to find in Melbourne”.\n\nPublished in 1990, the club history book – half in English, half in Italian – is out of print, out of date and long forgotten. The little poem on the inside cover – “To the fans of yesteryear, those of today, and to the ones of the future” – is both beautiful and haunting in the current context. These days the trophies, pennants and memorabilia are housed at Whittlesea Ranges; Moreland Zebras have the photos, host the anniversary events and officially trade under the name Juventus International Soccer Club; while Brunswick Zebras play at Juventus’ junior ground at Sumner Park, Northcote. All the clubs claim a link to the original Juventus, based either on colours, history and shared memory.\n\nFabio Incantalupo, 51, was the favourite son of Juventus. His father Greg was the mayor of Brunswick, served on the club committee in the late seventies, and helped Juventus secure a training base. He took Fabio to see Juve play from a young age, and at 10 years old, Fabio started his career with the club. Although he had the chance to trial for Australian rules side Collingwood in his late-teens, he always loved football, and it was from this platform that he represented the national team at youth level, and in 1989 was named Italo-Australian Sports Personality of the Year.\n\n“It got ripped apart,” he says of his childhood club. “They went from Juventus to being the Bulleen Inter Kings, then the Thomastown Zebras, then Whittlesea… everyone claimed a little bit of nostalgia of the club. The ones that play in the black and white are still a little bit connected, but it’s symbolic. It’s sad.”\n\n\n\nIncantalupo in action for Brunswick Juventus, circa 1985. He is described by the official club history as the “product of Italo-Australian soccer par excellence”.\n\nThe solitary success story of Brunswick Juventus in 1985 can only be understood within the context of football in the mid-eighties – the lost years of the NSL. The original, commercially oriented ideals of the competition, which began in 1977, had been forgotten or simply ignored. The league’s main sponsor, Philips Industries, withdrew in 1982, while Channel 10 stopped broadcasting games after just two seasons. No crowds, no money and no exposure forced the league to revert to a ridiculous conference system in order to survive. In 1984 the league expanded from 16 teams to 24, split into a so-called “Australian” or “Northern” Conference and the “National” or “Southern’ Conference”.\n\nThe conference system was a cost-cutter. The idea was that less interstate travel for clubs would save money and more local derbies would draw in the crowds. In reality it was total anarchy. Both conference had sub-sections relating to the city the teams came from, and there were occasional inter-conference challenge rounds. The Australian or Northern conference was basically the teams from NSW, the National or Southern conference was the rest, including Brisbane, who of course were geographically the furthest team in the north.\n\nThe much-vaunted “local derbies” between Blacktown City and Penrith City at Cook Park, for example, drew less than 1,000 people, while the first ACT derby between Canberra City and Inter Monaro in Queanbeyan was played in front of just 2,100 people. There was promotion and relegation, but it didn’t extend to Newcastle, Canberra or Wollongong, who were were granted development status by the NSL. In the latter half of the 1985 season, Fairy Meadow, a tiny club from the sleepy coastal town in the Illawarra, looked to be a real possibility for promotion to the national league.\n\nLooking back, even the names of the teams that entered in 1984 seem to forecast the impending downward spiral: there was the Croatias of Melbourne and Sydney, the most difficult of all the ethnic communities in Australian football; the Maltese teams Sunshine George Cross, Green Gully and Melita Eagles; Blacktown City and Penrith City from Sydney’s outer-western suburbs; and Inter Monaro, who were backed by the Italian Marco Polo Club. And, of course, Brunswick Juventus, the third-placed team from the 1983 Victorian State League season.\n\nThe clubs held sway over the federation, and after Melbourne and Sydney Croatia resolutely refused to change their nationalistic names, the labels Hellas, APIA, Juventus and Makedonia crept back. While Australian rules and rugby league were looking to expand beyond their traditional geographic boundaries, football was doing the reverse.\n\nIn a sense, this was reflective of the times – it was the European migrants and their children that gave Australian football its unique character. SBS, the multicultural television station, began screening the games, while in Melbourne, the premier football newspaper Soccer Action dedicated space every week for foreign-language columns. The author of Juve! Juve!, Egilberto Martin, wrote: “For the European migrant the code of soccer, besides its essentiality as a sport, represents also a piece of that gigantic mosaic which makes up his socio-cultural structure and has retained it in spite of the mockery, the popular derision, and the powerful hold of other football codes, and in Victoria, by Aussie Rules.”\n\nThe former footballer Fabio Incantalupo in his old No.17 Brunswick Juventus jersey. Incantalupo played for Brunswick in the 1980s. Photograph: Joe Gorman/The Guardian\n\nBrunswick Juventus entered the 1985 season led by the well-connected Italian-Australian triumvirate of Tony Schiavello, Sam Manenti and Vince Verducci. The team manager was Joe Caruso, a colourful local identity who owned an espresso bar in Coburg and a travel agency in Sunshine. Rocco Di Zio, a journalist, administrator, volunteer and raconteur was, as usual, omnipresent in the club operations.\n\nThey were coached by the late, great John Margaritis. A former South Melbourne Hellas player, Margaritis had been sacked and re-hired several times by South Melbourne and West Adelaide Hellas in the early years of the NSL, and returned to Juventus in characteristically chaotic circumstances. He led Brunswick Juventus to the National League in 1983, stayed on in 1984, left at the end of the season, but when Tommy Traynor was fired after just three pre-season games, returned in time for the 1985 campaign.\n\nIt was an argument with Incantalupo that sealed Traynor’s fate. He told the team he was under pressure from the press to pick Incantalupo because he was Italian. “It wasn’t like I instigated it,” remembers Incantalupo, “I just think it was supporters who were upset because we weren’t winning. I was sitting on the bench, things started to get a bit heated. They said to me, ‘why aren’t you playing’, you know? I said go and ask him… he’s the coach. It just snowballed from there and he got the sack. The vibes weren’t good from the start.”\n\nAside from the dressing-room dramas, Caruso had signed well in the off-season. At the time, Lou Sticca, the man responsible for bringing Alessandro Del Piero to the A-League in 2012, was a 25-year old fan. “Led by a good committee, [Caruso] was able to build a football structure and team and attracted the right players and coaches,” he remembers. Soccer Action’s Lawrie Schwab wrote that without Caruso, Margaritis “would be like a man with one arm”.\n\nSigning a contact with Caruso was an experience in itself. Incantalupo remembers going to his cafe, hopping in his white, beat-up Mercedes and being taken to the races, the customary cigar always hanging out the side of Caruso’s mouth. “Friday night at Moonee Valley, just to negotiate my contract for the following year,” laughs Incantalupo.\n\nThe big name recruits of Peter Lewis, Paul Wade and Yakka Banovic, complemented the solid core of Brian Brown, Mike Petersen, Joe Sweeney and Eddie Campbell. The young starlets were Reno Minichello, Mehmet Durakovic, Andrew Zinni and Incantalupo. Sticca says the captain, Brown, was “the main reason Juventus had any success at all”, while Incantalupo was the “love child” and the “flagship” of the club. Yet at the beginning of the season, Margaritis told the press: “we are not saying we will win the championship this year”.\n\nJuventus’ first win came over Green Gully at Olympic Park in March, and in April Incantalupo scored his first goal of the season in a 2-2 draw with South Melbourne. Elsewhere, a two-game stint by England international Kevin Keegan at Blacktown City drew large crowds and media attention, and a scintillating 3-1 Juventus victory over South Melbourne drew rave reviews as “the game of the season”.\n\nBut things took a turn for the worse in July. Incantalupo got into a heated argument with team-mate Richard Miranda during a match against Brisbane Lions, and was sent off. Things escalated quickly after the pair started arguing over whether to press high or drop off while defending a throw-in. “It was just one of those things in the heat of the moment,” says Incantalupo now, “I might be the first time a player has been sent off for swearing at his own player!”\n\nA week later in Sydney, the infamous Pratten Park riot saw the referee punched, kicked and spat on by unruly fans in a match between Sydney Olympic and Sydney City. “At long last, soccer has grabbed public attention,” lamented Andrew Dettre in Soccer Action. “True, it needed the prodding of an ugly riot, the mindless savagery of a few dozen or perhaps hundred lunatics – but we’ve made it.”\n\nIndeed the crowds just would not show. By 1985 the clubs barely attracted fans outside the various ethnic groups, and furthermore, they didn’t even have full support from their own communities. Consider the “game of the season” between South Melbourne and Juventus in June – held at the best football stadium, Middle Park, between two of the best Victorian sides who purported to represent the state’s largest and most vibrant ethnic communities. Only 5,000 people turned up.\n\nFernando Spano is illustrative of this dilemma. His father arrived from Calabria in 1956 and became a Juventus fan, his cousin played for the club, but Fernando’s first sporting memories are of watching Australian Rules side Collingwood. Spano followed his father to Australia in 1965, and although he followed Juventus through the Italian newspaper Il Globo, he was instantly attracted to the roar of Australian Rules football at Victoria Park. Without much English, he says Collingwood helped him fit in to a new society, and that the violence and hatred at the football put him off. “You couldn’t go and not be taunted,” he says. “It’s not in the spirit of the sport.”\n\nSticca also had an affection for both football and Australian rules. “I’d go and watch Carlton play in front of 30-35,000 people at Princes Park, and then I’d go and watch Juventus play in front of 2,000 at Olympic Park,” he says. “To me, I loved it. Same same.” Still, by the early nineties, Sticca also realised that football needed drastic reform. “There was only one way I could see soccer progressing in this country, and that was to break away from the little ethnic club model,” he says.\n\nIncantalupo is held aloft in the dressing room at Olympic Park after the second leg of the 1985 NSL final.\n\nThe only thing that remains of Juventus is memory, and the best memory is the 1985 grand final victory. After defeating South Melbourne in the major semi-final and Preston Makedonia in the conference grand final, Juventus faced Sydney City in the national grand final. Sydney City, known by most as Hakoah, were run by current FFA chairman Frank Lowy and were the best team in the NSL, having won four national titles in eight seasons. But Juventus had an extra incentive – Schiavello had promised an all-expenses-paid end of season trip to Italy to play Roma if they players brought the title home.\n\nBrunswick Juventus won 2-0 on aggregate over the two legs, with one goal in Sydney and one in Melbourne. After just two minutes of play in the second leg at Olympic Park, Juventus player Robbie Cullen received a head-knock and was taken to hospital with concussion. In the reshuffle, Incantalupo was moved into the forward-line. When Cullen woke up, he immediately asked: “did we win?” and “who scored?”\n\nThe answer, of course, was Fabio Incantalupo. After missing the entire 1984 season after a knee reconstruction, an argument with the coach in pre-season, an on-field skirmish with his team-mate in round 18 and having scored just three goals all season, it was Incantalupo who scored the winner in both legs. The first, in Sydney, was a shot from outside the box; the second in Melbourne a tap-in from a corner. In the crowd, his father watched on proudly, and his girlfriend cheered for the man she would later marry. “They looked after me,” says Incantalupo, who had his knee operation paid for by the club. “Maybe because of that I had to repay them, and that was the best way I could do it.”\n\nLater this month the 30-year anniversary dinner will be held at the Casa D’Abruzzo Club in Melbourne. The playing group will reminisce about the good old days, the colourful characters like Caruso, as well the hard-working volunteers like Di Zio and Joe Castelli who would fork out their own money to help players settle, or mortgage their family home in order for the club to have financial security. Sticca, who remains one of the most influential figures in the Australian game, still credits Di Zio as a central reason he got involved in the administration of the game. He learned a great deal watching the older guys, “their love of their sport, their community and their love of their club”.\n\nBut apart from the memories, there is little else to hold on to. Incantalupo believes the failure to set down firm roots with a social club and a home ground is the cause for the demise. Juventus’ plans for a $3 million sports complex at Clifton Park never eventuated, and the site is now home to a council-owned synthetic field. “If they had owned a club, a home ground, and a club room,” says Incantalupo, “I think Juventus would still be going.”\n\nOthers, however, believe that the Italians assimilated quicker than the other ethnic groups, and thus no longer needed their club as a social lubricant. In 1990, Victorian Soccer Federation president, John Dimtsis, wrote: “The story of Juventus in Victoria tells us a great deal not only about a successful soccer club; it tells us much about Italian life in Victoria. Juventus was for many years… one of the main foci of Melbourne and Victoria’s Italian community.”\n\nThose days are long gone, for the Italians and increasingly also for the other European migrant groups and their once-mighty football clubs. With the A-League and its non-denominational clubs now firmly entrenched, perhaps Juventus are the canary in the coal mine for the ethnic clubs. “Juventus,” says Sticca, “is a club that lost its community.”"}, {"url": "https://www.hockey-reference.com/players/k/kingde01.html", "page_content": "Frequently Asked Questions\n\nHow old is Derek King?\n\nDerek King is 56 years old.\n\nWhen was Derek King born?\n\nDerek King was born on February 11, 1967.\n\nWhere was Derek King born?\n\nDerek King was born in Hamilton, Canada.\n\nHow tall is Derek King?\n\nDerek King is 6-1 (185 cm) tall.\n\nHow much did Derek King weigh when playing?\n\nDerek King weighed 203 lbs (92 kg) when playing.\n\nIs Derek King in the Hockey Hall of Fame?\n\nDerek King has not been elected into the Hockey Hall of Fame.\n\nHow many goals did Derek King have?\n\nDerek King had 261 goals over his career.\n\nHow many points did Derek King have?\n\nDerek King had 612 points over his career.\n\nHow many Stanley Cups has Derek King won?\n\nDerek King has never won a Stanley Cup as a player.\n\nWhen did Derek King retire?\n\nDerek King last played in 2000."}, {"url": "https://www.theguardian.com/sport/blog/2013/jul/18/forgotten-story-ian-rush-sydney-olympic", "page_content": "At a press conference held at the Melbourne Cricket Ground to promote Liverpool's appearance in Australia later this month, a gaggle of cameramen and journalists surrounded Ian Rush, hanging on the former striker's every word. One of them asked the Welshman what he knew of Australian football. A standard question, perhaps, for visiting football royalty in the antipodes.\n\nWith a smile, Rush informed the journalist that he had, in fact, played for Sydney Olympic. That the question was even asked, and that his response took some by surprise is illustrative of a broad cultural malaise in the Australian game. Where other football cultures feed off tradition and nostalgia, Australians have scant regard for the game's domestic history.\n\nRush may have only played a couple of games for Sydney Olympic in 1999, scoring one goal and missing an away trip to Melbourne before promptly jetting off home but his presence is still recalled fondly by those involved. \"I remember picking him up from the airport, and being in awe of the man,\" explains Tony Rallis, a player agent who worked with Sydney Olympic in the late 1990s. \"I was so nervous that I forgot where I parked the car!\"\n\nThe story begins in 1998, in Australia's now-defunct National Soccer League (NSL). Sydney Olympic, founded by Greek migrants as Pan Hellenic in the 1950s, had started a rapid process of renovation. The club was being privatised, and big business was circling. For a moment, it looked as if legendary stockbroker Rene Rivkin would take control of the club, but at the 11th hour the chairman of NRL's Sydney Roosters, Nick Politis, decided to throw his lot in with a consortium labelled the Friends of Sydney Olympic.\n\nDescribing themselves to the local press as \"five filthy rich Greeks\", the new owners promised big things to club members. Times were changing, and most NSL clubs realised they had to adapt or die. The introduction of the privately owned Perth Glory, Brisbane Strikers and Northern Spirit, who pioneered the broad-based, catch-all model later adopted by the A-League, had shown the way forward for Australian football. With Sydney hosting the Olympic Games in 2000, the game's governing body, Soccer Australia, was quickly trying to get its house in order.\n\nSydney Olympic, like many of the more traditional NSL clubs, could not have been economically and culturally further from this new model. Throughout their history, Olympic had been kept afloat by a small base of loyal fans and volunteers, while their perennial search for a new home ground had earned them the reputation as the nomads of the league.\n\nIn this context, privatisation was supposed to be the catalyst for the club to attract a broader support base, to transition to full-time professionalism for both players and administrators, and to find a place for the club to call home. There were plans to move the club to the modern, all-seater Sydney Football Stadium in the city's inner-eastern suburbs, before the decision was made to settle further west at Belmore Sports Ground.\n\nRallis, a lifelong Olympic fan who was involved in marketing and public relations at the time, worked closely with Politis and the new consortium. The view was taken that for the club to truly branch out beyond its Greek-Australian supporter base, what it needed most was exposure.\n\nHowever, the problem lay in the fact that the mainstream media's attitude to the NSL was indifferent at best, and openly hostile at worst. Sports editors obsessed with AFL, rugby league and cricket were largely uninterested in football, which was viewed as politically and financially unstable. Paradoxically, football from abroad, particularly from the English Premier League, fared much better than the domestic game.\n\nIn this context, Australian clubs tried to leverage the rising popularity of the English Premier League to boost the profile of the NSL and the game in general. In 1996, Perth Glory chased Ian Rush's signature, while in 1998, rumours circulated that Northern Spirit were attempting to lure Eric Cantona out of retirement for a six-match guest stint. Cantona never made it to North Sydney Oval, but Crystal Palace invested a large stake in the club, while Leeds United star Harry Kewell became a poster-boy for the Spirit.\n\nSimilarly, in 1999, Melbourne Knights announced that Peter Beardsley would play three matches for the club, with the stated aim of broadening the Knights' supporter base beyond the Croatian community in Melbourne. The resuscitation of the marquee- or guest-player concept, which in many ways was pioneered in Australia, was seen as a ticket out of the proverbial ethnic ghetto.\n\nAustralian clubs have a long history of signing European stars on short-term contracts. Since the 1950s the marquee player has been seen as a way of driving revenue through new sponsorship deals and gate receipts, and most importantly, as a way of boosting the profile of domestic football.\n\nIn 1958, Sydney Prague signed Austrian playmaker Leo Baumgartner (he would later settle in Australia), while in 1977, Charlie George and Malcolm Macdonald lined up for St George Budapest and South Melbourne Hellas respectively in a five-goal thriller at Middle Park. In the 1980s Kevin Keegan played two matches for Blacktown City, while Graeme Souness, George Best, Dixie Deans, Ossie Ardiles and Eli Ohana all made cameo appearances for clubs around the country.\n\nWhile many of these guest players were largely ineffectual, Sydney Olympic had a decent track record. In 1985, Rallis's father-in-law Jim Petinellis had been instrumental in bringing Celtic star Davie Provan to the club. In terms of on-field performances alone, Provan was pound-for-pound one of the most effective guest signings in the history of Australian football. In just five games he had led his team to an impressive unbeaten streak, scoring five goals in the process.\n\nLittle wonder, then, that Olympic fans like Rallis had faith in the guest player concept. In fact, Rallis had previously tried to sign Rush when he left Liverpool in 1996, but the striker instead moved to Newcastle United. However, by 1999, privatisation had brought new vision and new money to the club. This injection of funds dovetailed nicely with Rush's desire to establish his academy in Australia, and Olympic were finally able to present a realistic offer to the Welshman.\n\nRush's first game in the blue and white was a round eight clash against cross-city rivals Marconi. After Brett Emerton's first half goal was cancelled out by a Christian Care equaliser, Rush showed his class just before half time. Pablo Cardozo fed him with a delightful pass, and after a deft first touch, the ball was duly buried in the back of the net, leaving the home crowd in raptures.\n\n\"It's about time that Olympic had a home win,\" joked the match-winning guest after the match. Rush's humility and good humour had quickly endeared him to the local press and his new team-mates. \"He always made time for everybody,\" recalls the Sydney FC midfielder Nick Carle, who was just breaking into the Sydney Olympic squad as a teenager. \"His personal touch was just brilliant.\"\n\nThe two-match stint finished a fortnight later, as Rush played his final game at Belmore against Adelaide City. While Olympic won 2-0, in many ways the match summed up his short stay at the club. With kick off delayed because of the debris caused by pre-match fireworks, the game was ruined by a pitch that was so sandy it caused one prominent journalist to draw comparisons to Bondi Beach. Furthermore, the match wasn't televised, despite being played at prime time on a Saturday night. In the end, only the few thousand who turned up got a chance to see Rush play.\n\nThe former Sydney Olympic winger, and current Sydney FC utility player, Brett Emerton holds the unique position of having played with both Ian Rush as a young man at Olympic and Alessandro Del Piero as a senior squad member at Sydney FC. \"These days you'd want to keep guest players for at least 12 months in order to give players here the opportunity to learn as much as they can,\" he explained.\n\n\"I find that with a guest player coming in for a few games, it's difficult,\" agrees Carle. \"In saying that, I still thought it [Rush's involvement] was great for the game.\"\n\nFor Rallis, Rush's friendship changed his career immeasurably. \"I rang him a couple of years later, and out of the blue he recommended that I get into player management. I now manage 15 players in Australia, and I thank him all the time for his encouragement and his faith in me.\"\n\nIn his biography, Rush writes fondly of his experience at Olympic. \"The city itself struck me as an energetic, cosmopolitan city with a smalltown, easygoing charm, and the standard of football was decent enough ... I enjoyed my time at the club, and loved the Australian experience.\"\n\nRush's playing stint in Sydney may have been short-lived, but it's become part of Sydney Olympic folklore. Recently, a hybrid Sydney Olympic-Liverpool Ian Rush jersey was auctioned off for $3,000 at a club function. Sadly, the momentum didn't continue. Within a few seasons, the owners handed the club back to members, and as the A-League was born in 2004, Sydney Olympic were relegated to the NSW State League, where they remain today.\n\nIn the end, the structural deficiencies of the NSL meant that guest players were only ever temporary solutions for broader problems. It was akin to fitting a broken down Toyota with a shiny BMW bonnet badge. As Rallis laments: \"we had no media support. We didn't have the marketability of today.\"\n\n\"We were paddling up shit creek... let's not kid ourselves, we were seen as wog boys playing games, and inviting Aussie boys and English boys to play with us.\""}, {"url": "https://forum.insidesport.com.au/1016191/SydneyOlympicplayersintheNSL", "page_content": "Fan\n\n\n\nGroup: Banned Members\n\nPosts: 63, Visits: 0\n\n\n\n\n\nGary Meier, Greg Allan, Bernie Cullerton, Greg Lynch, George Gibson, Paul Luckett, Mike Cross, Don Allan, Chris Thamnidis (Brian Parker 61), Joe Senkalski, Ray Botham\n\nCoach : Bruce Stowell\n\n\n\n\n\nSydney Olympic 1978\n\nGary Meier, Greg Allan, Stuart Markland, Dave McIntosh, Paul Luckett, Mike Cross, Alex Jamieson, Alan Ainslie, Derek Laing, Ken Wilson, Chris Thamnidis\n\n\n\nCoach : Tom Anderson\n\n\n\n\n\nSydney Olympic 1979\n\nGary Meier, Paul Coton, Richie Bell, Ken Wilson, Alan Ainslie, Mike Cross, Peter Raskopoulos, Alex Jamieson, Derek Laing, Clive Eaton, Dave McIntosh\n\nCoach : Joe Marston\n\n\n\nSydney Olympic 1981\n\nGary Meier, Danny Moulis, Greg Ankudinoff, Ken Wilson, Derek Laing, Jim Ziras, Peter Katholos, Hussein Housseini, Mark Koussas, Graham Jennings, David Cork (Mike Cross 75)\n\nCoach : Tommy Docherty\n\n\n\n\n\nSydney Olympic =1982\n\nPeter Wilson, Danny Moulis (Ian Rowden 46), Ken Wilson, Jim Ziras, Andy Scott, Peter Katholos, Peter Raskopoulos, Jim Redfern, Mark Koussas, Tom Gavin, Graham Jennings\n\nCoach : Doug Collins\n\n\n\nSydney Olympic= 1983\n\nPeter Wilson, Martyn Rogers, Ricky Herbert, Tony Dakos, Graham Jennings, Jim Ziras, Peter Raskopoulos, Jim Patikas, Peter Katholos, Gary Phillips, Marshall Soper\n\nCoach : Tommy Docherty\n\n\n\nSydney Olympic- 1984\n\nPeter Wilson, Martyn Rogers, Tony Dakos, Alex Lambropoulos, Graham Jennings, Gary Phillips, Peter Raskopoulos, Jim Patikas, Mark Koussas (Peter Katholos 84), Marshall Soper (Chris Kalantzis 84), Terry Patalis\n\nCoach : Manfred Schaefer\n\n\n\nSydney Olympic- 1985\n\nGary Meier, Graham Jennings, Gary Phillips, Tony Spyridakos, Peter Raskopoulos, Alex Lambropoulos, Peter Katholos, Nick Theodorakopoulos (Terry Patalis 69), Chris Kalantzis (Arthur Svinos 89), Marshall Soper, Stuart Johnston\n\nCoach : Manfred Schaefer\n\n\n\nSydney Olympic- 1986\n\nGary Meier, Martyn Rogers, Mike Coady, Gary Phillips, Tony Spyridakos, Peter Raskopoulos, Vince Estavillo, Chris Kalantzis, Marshall Soper, Stuart Johnston, Stuart Stevenson. Sub: Simon Brandt.\n\n\n\n\n\nSydney Olympic- 1987\n\nGary Meier, David Ratcliffe, George Haniotis, Robert Hooker, Spiro Hantzis, Peter Raskopoulos, Vince Estavillo, Chris Kalantzis, Abbas Saad, Terry Patalis, John Kosmina. Subs: Emil Dragicevic, Stuart Johnston.\n\nCoach Eddie Tomson\n\n\n\nSydney Olympic- 1988\n\nGary Meier, David Barrett, George Haniotis, Robert Hooker, Steve Georgakis, Peter Raskopoulos, Tom Pontidas, Abbas Saad, Marshall Soper, Terry Patalis, John Kosmina. Grant Lee, Jason Polak.\n\nCoach Eddid Tomson\n\n\n\nSydney Olympic 1989\n\nClint Gosling, David Barrett, George Haniotis, Robert Hooker, Steve Georgakis, Grant Lee, Gary Phillips, Robert Ironside, Jason Polak, Alistair Edwards, Abbas Saad.\n\nCoach Mike Hickman\n\n\n\nSydney Olympic 1989/90\n\nClint Gosling, David Barrett, Robert Hooker, Grant Lee, Gary Phillips, Tony Spyridakos, Robert Ironside, Andrew Bernal, Steve Refenes, Alistair Edwards, Abbas Saad.\n\nCoach Mike Hickman\n\n\n\nSydney Olympic- 1990/91\n\nClint Gosling, David Barrett, Robert Hooker, Eric Hristodoulou, Nick Plataniotis, Grant Lee, Tony Spyridakos, Kevin Hagan, Robert Ironside, Steve Refenes, Scott Ollerenshaw. Sub: Jason Bennett.\n\nCoach Mick Hickman\n\n\n\nSydney Olympic 1991/1992\n\nGary Meier, David Barrett, Robert Hooker, Grant Lee, Gary Phillips, Robert Ironside, Andrew Bernal, Steve Refenes, Peter Katholos, Tim Bredbury, Zlatko Nastevski. Sub: Elias Augerinos.\n\nCoach Mick Hickman\n\n\n\nSydney Olympic 1992/93\n\nClint Gosling, Paul Panson, David Barrett, Steve Hickman, Grant Lee, Gary Phillips, Robert Ironside, Branko Milosevic, Walter Ardone, Derek Poimer, David Seal. Subs: Jose Mendes, Pablo Cardozo.\n\nCoach Peter Raskopoulos\n\n\n\nSydney Olympic 1993/94\n\nMike Gibson, Elias Augerinos, George Sorras, Grant Lee, Tony Spyridakos, Robert Ironside, Joe Caleta, Peter Tsekenis, Branko Milosevic, Ivan Kelic, Kris Trajanovski\n\nCoach Berti Mariani\n\n\n\nSydney Olympic 1994-95\n\nGibson, Juric, Barrett, Sorras, Augerinos (Treherne , Milosevic,\n\nMeredith, Nikas, Mendes (Bacak , Tome, Poimer\n\n\n\nSydney UTS Olympic 1995/1996\n\nMike Gibson, Dave Barrett, Adam Ciantar, Nick Orlic, George Sorras, Kimon Taliadoros, Peter Tsekenis, Norman Tome, Kris Trajanovski, Elias Augerinos, Milan Blagojevic\n\n\n\n\n\nSydney UTS Olympic 1996/97\n\nGeorge Bouhoutsos, David Barrett (Adam Ciantar , Scott Baillie, Ivan Zelic, Walter Ardone, Brett Emerton, Kris Trajanovski, Raphael Bove, Elias Augerinos (Steve Refenes 46), Derek Poimer(Norman Tome , David Mitchell\n\n\n\nSydney UTS Olympic 1997/1998\n\nBob Catlin, Adam Ciantar, Eric Hristodoulou, Norman Tome, Peter Tsekenis, Derek Poimer, Brett Emerton, Chris Kalantzis Nick Carle Jean-Paul deMarigny, Danny Barbalace, Hussein Jomaa\n\n\n\nSydney Olympic 1998/99\n\nJim Kourtis, Adam Ciantar, Peter Tsekenis, Kimon Taliadoros, Mark Brennan, Adem Poric , Scott Thomas (Ante Juric 89), Chris Kalantzis, Brett Emerton (Nick Carle 80), Norman Tome Jason Culina , Pablo Cardozo\n\n\n\nSydney Olympic - 1999/2000\n\nGeorge Bouhoutsos, Scott Thomas , Peter Tsekenis, Scott Baillie, Ante Juric, Pablo Cardozo, Brett Emerton, Chris Kalantzis (Zlatko Arambasic 57), Gabriel Mendez Nick Carle Lindsay Wilson, Peter Zorbas (Adrian Cervinski\n\n\n\n\n\nSydney Olympic - 2000/2001\n\nClint Bolton, Sebastian Sinozic, Lindsay Wilson, Paul Kohler, Scott Baillie, Ante Juric, Kresimir Marusic (Anthony Doumanis Ante Moric, Troy Halpin, Greg Owens (Dylan Macallister , Nick Carle\n\n\n\nSydney Olympic Sharks - 2001/2002\n\nClint Bolton, Paul Kohler, Lindsay Wilson, Tom Pondeljak, Dylan Macallister (Elias Demourtzidis Troy Halpin, Jade North (Greg Owens Jeromy Harris, Nick Carle, Andrew Packer, Andrew Durante Sebastian Sinozic\n\n\n\nSydney Olympic Sharks- 2002/2003\n\nClint Bolton, Paul Kohler (sent off 69), Mark Byrnes, Ante Juric, Tom Pondeljak, Ante Milicic, Jade North, Greg Owens, Jeromy Harris, Andrew Durante, Hiroyuki Ishida George Souris\n\n\n\nSydney Olympic 2003-2004\n\nBrett Hughes, Paul Kohler, Ante Juric, Joseph Schirripa, Iain Fyfe, Pablo Cardozo (Jim Bakis 72), Troy Halpin, Elias Augerinos Jim Nikas George Goutzioulis, Hiroyuki Ishida, Zenon Caravella\n\n\n\nRead more:\n\n\n\nJust reading through the Olympic Ultras forum and found this, gold info!\n\n\n\nThese boys do love the club, and there growing in numbers everyday\n\nSydney Olympic 1977Gary Meier, Greg Allan, Bernie Cullerton, Greg Lynch, George Gibson, Paul Luckett, Mike Cross, Don Allan, Chris Thamnidis (Brian Parker 61), Joe Senkalski, Ray BothamCoach : Bruce StowellSydney Olympic 1978Gary Meier, Greg Allan, Stuart Markland, Dave McIntosh, Paul Luckett, Mike Cross, Alex Jamieson, Alan Ainslie, Derek Laing, Ken Wilson, Chris ThamnidisCoach : Tom AndersonSydney Olympic 1979Gary Meier, Paul Coton, Richie Bell, Ken Wilson, Alan Ainslie, Mike Cross, Peter Raskopoulos, Alex Jamieson, Derek Laing, Clive Eaton, Dave McIntoshCoach : Joe MarstonSydney Olympic 1981Gary Meier, Danny Moulis, Greg Ankudinoff, Ken Wilson, Derek Laing, Jim Ziras, Peter Katholos, Hussein Housseini, Mark Koussas, Graham Jennings, David Cork (Mike Cross 75)Coach : Tommy DochertySydney Olympic =1982Peter Wilson, Danny Moulis (Ian Rowden 46), Ken Wilson, Jim Ziras, Andy Scott, Peter Katholos, Peter Raskopoulos, Jim Redfern, Mark Koussas, Tom Gavin, Graham JenningsCoach : Doug CollinsSydney Olympic= 1983Peter Wilson, Martyn Rogers, Ricky Herbert, Tony Dakos, Graham Jennings, Jim Ziras, Peter Raskopoulos, Jim Patikas, Peter Katholos, Gary Phillips, Marshall SoperCoach : Tommy DochertySydney Olympic- 1984Peter Wilson, Martyn Rogers, Tony Dakos, Alex Lambropoulos, Graham Jennings, Gary Phillips, Peter Raskopoulos, Jim Patikas, Mark Koussas (Peter Katholos 84), Marshall Soper (Chris Kalantzis 84), Terry PatalisCoach : Manfred SchaeferSydney Olympic- 1985Gary Meier, Graham Jennings, Gary Phillips, Tony Spyridakos, Peter Raskopoulos, Alex Lambropoulos, Peter Katholos, Nick Theodorakopoulos (Terry Patalis 69), Chris Kalantzis (Arthur Svinos 89), Marshall Soper, Stuart JohnstonCoach : Manfred SchaeferSydney Olympic- 1986Gary Meier, Martyn Rogers, Mike Coady, Gary Phillips, Tony Spyridakos, Peter Raskopoulos, Vince Estavillo, Chris Kalantzis, Marshall Soper, Stuart Johnston, Stuart Stevenson. Sub: Simon Brandt.Sydney Olympic- 1987Gary Meier, David Ratcliffe, George Haniotis, Robert Hooker, Spiro Hantzis, Peter Raskopoulos, Vince Estavillo, Chris Kalantzis, Abbas Saad, Terry Patalis, John Kosmina. Subs: Emil Dragicevic, Stuart Johnston.Coach Eddie TomsonSydney Olympic- 1988Gary Meier, David Barrett, George Haniotis, Robert Hooker, Steve Georgakis, Peter Raskopoulos, Tom Pontidas, Abbas Saad, Marshall Soper, Terry Patalis, John Kosmina. Grant Lee, Jason Polak.Coach Eddid TomsonSydney Olympic 1989Clint Gosling, David Barrett, George Haniotis, Robert Hooker, Steve Georgakis, Grant Lee, Gary Phillips, Robert Ironside, Jason Polak, Alistair Edwards, Abbas Saad.Coach Mike HickmanSydney Olympic 1989/90Clint Gosling, David Barrett, Robert Hooker, Grant Lee, Gary Phillips, Tony Spyridakos, Robert Ironside, Andrew Bernal, Steve Refenes, Alistair Edwards, Abbas Saad.Coach Mike HickmanSydney Olympic- 1990/91Clint Gosling, David Barrett, Robert Hooker, Eric Hristodoulou, Nick Plataniotis, Grant Lee, Tony Spyridakos, Kevin Hagan, Robert Ironside, Steve Refenes, Scott Ollerenshaw. Sub: Jason Bennett.Coach Mick HickmanSydney Olympic 1991/1992Gary Meier, David Barrett, Robert Hooker, Grant Lee, Gary Phillips, Robert Ironside, Andrew Bernal, Steve Refenes, Peter Katholos, Tim Bredbury, Zlatko Nastevski. Sub: Elias Augerinos.Coach Mick HickmanSydney Olympic 1992/93Clint Gosling, Paul Panson, David Barrett, Steve Hickman, Grant Lee, Gary Phillips, Robert Ironside, Branko Milosevic, Walter Ardone, Derek Poimer, David Seal. Subs: Jose Mendes, Pablo Cardozo.Coach Peter RaskopoulosSydney Olympic 1993/94Mike Gibson, Elias Augerinos, George Sorras, Grant Lee, Tony Spyridakos, Robert Ironside, Joe Caleta, Peter Tsekenis, Branko Milosevic, Ivan Kelic, Kris TrajanovskiCoach Berti MarianiSydney Olympic 1994-95Gibson, Juric, Barrett, Sorras, Augerinos (Treherne , Milosevic,Meredith, Nikas, Mendes (Bacak , Tome, PoimerSydney UTS Olympic 1995/1996Mike Gibson, Dave Barrett, Adam Ciantar, Nick Orlic, George Sorras, Kimon Taliadoros, Peter Tsekenis, Norman Tome, Kris Trajanovski, Elias Augerinos, Milan BlagojevicSydney UTS Olympic 1996/97George Bouhoutsos, David Barrett (Adam Ciantar , Scott Baillie, Ivan Zelic, Walter Ardone, Brett Emerton, Kris Trajanovski, Raphael Bove, Elias Augerinos (Steve Refenes 46), Derek Poimer(Norman Tome , David MitchellSydney UTS Olympic 1997/1998Bob Catlin, Adam Ciantar, Eric Hristodoulou, Norman Tome, Peter Tsekenis, Derek Poimer, Brett Emerton, Chris Kalantzis Nick Carle Jean-Paul deMarigny, Danny Barbalace, Hussein JomaaSydney Olympic 1998/99Jim Kourtis, Adam Ciantar, Peter Tsekenis, Kimon Taliadoros, Mark Brennan, Adem Poric , Scott Thomas (Ante Juric 89), Chris Kalantzis, Brett Emerton (Nick Carle 80), Norman Tome Jason Culina , Pablo CardozoSydney Olympic - 1999/2000George Bouhoutsos, Scott Thomas , Peter Tsekenis, Scott Baillie, Ante Juric, Pablo Cardozo, Brett Emerton, Chris Kalantzis (Zlatko Arambasic 57), Gabriel Mendez Nick Carle Lindsay Wilson, Peter Zorbas (Adrian CervinskiSydney Olympic - 2000/2001Clint Bolton, Sebastian Sinozic, Lindsay Wilson, Paul Kohler, Scott Baillie, Ante Juric, Kresimir Marusic (Anthony Doumanis Ante Moric, Troy Halpin, Greg Owens (Dylan Macallister , Nick CarleSydney Olympic Sharks - 2001/2002Clint Bolton, Paul Kohler, Lindsay Wilson, Tom Pondeljak, Dylan Macallister (Elias Demourtzidis Troy Halpin, Jade North (Greg Owens Jeromy Harris, Nick Carle, Andrew Packer, Andrew Durante Sebastian SinozicSydney Olympic Sharks- 2002/2003Clint Bolton, Paul Kohler (sent off 69), Mark Byrnes, Ante Juric, Tom Pondeljak, Ante Milicic, Jade North, Greg Owens, Jeromy Harris, Andrew Durante, Hiroyuki Ishida George SourisSydney Olympic 2003-2004Brett Hughes, Paul Kohler, Ante Juric, Joseph Schirripa, Iain Fyfe, Pablo Cardozo (Jim Bakis 72), Troy Halpin, Elias Augerinos Jim Nikas George Goutzioulis, Hiroyuki Ishida, Zenon CaravellaRead more: http://www.olympicultras.proboards.com/\n\n\n\nJust reading through the Olympic Ultras forum and found this, gold info! Just reading through the Olympic Ultras forum and found this, gold info!\n\n\n\nThese boys do love the club, and there growing in numbers everyday These boys do love the club, and there growing in numbers everyday\n\nReply GDeathe GDeathe\n\n#1016192 Pro\n\n\n\nGroup: Forum Members\n\nPosts: 2.1K, Visits: 0\n\nSTOP SPAMMING, YOU USELESS PIECE OF SHIT\n\nReply SydneyOlympic1957 SydneyOlympic1957\n\n#1016193 Fan\n\n\n\nGroup: Banned Members\n\nPosts: 63, Visits: 0\n\nGDeathe wrote: STOP SPAMMING, YOU USELESS PIECE OF SHIT\n\n\n\ngo fuckurself u limp fuck\n\nReply anothermp anothermp\n\n#1016194 Super Fan\n\n\n\nGroup: Forum Members\n\nPosts: 123, Visits: 0\n\npound for pound we shit on Sydney FC anyway\n\n\n\ntroy halpin or steve corica fuckofffff\n\n\n\ncardozo or brosque fuckofffff\n\n\n\nmcflynn or emerton fuckofffff\n\n\n\nkalantzis or cazarine fuckofffff\n\nReply GO\n\n\n\n\n\nPost Quoted Reply Narrow your search by forum\n\nInside Sport Login Register Search Narrow your search by forum\n\nFlat Ascending\n\nFlat Descending\n\nThreaded Subscribe to topic\n\nPrint This Topic\n\nGoto Topics Forum Jump To Page Jump To Page"}, {"url": "https://www.britannica.com/event/Sydney-2000-Olympic-Games", "page_content": "Sydney 2000 Olympic Games, athletic festival held in Sydney that took place September 15–October 1, 2000. The Sydney Games were the 24th occurrence of the modern Olympic Games.\n\nSydney was narrowly chosen over Beijing as host city of the 2000 Olympics. The International Olympic Committee (IOC) was attracted to the city’s long history of enthusiasm for sports, its promise to use recovered toxic wastelands as sites for sporting venues, and its plan to involve the smaller countries of Oceania in hosting activities. Despite some cost overruns and a ticket scandal, the preparations and the Games themselves went smoothly. The opening ceremonies celebrated the history of Australia, especially the unique cultures and contributions of the Aboriginal peoples of the continent. The high point of the opening ceremonies came when Aboriginal runner Cathy Freeman lit the Olympic flame. She later won the gold medal in the 400-metre event. The accomplishments and recognition of Freeman were an important milestone for Australian Aboriginal peoples, who were still struggling for their place in Australian society (see Sidebar: Cathy Freeman: The Heart of a Nation).\n\nBritannica Quiz The Olympic Games\n\nNearly 11,000 athletes representing 199 IOC member countries (including 3 athletes from the United Nations dependency of East Timor) participated in the Games, which featured a record 928 medals awarded in 300 events. Several events were contested at the Olympics for the first time in 2000, including men’s and women’s tae kwon do, trampoline, triathlon, and synchronized diving. Other new women’s events included weightlifting, modern pentathlon, and pole vault. The track-and-field competition starred American sprinter Marion Jones, who won three gold and two bronze medals. Australian swimmer Ian Thorpe, nicknamed the “Thorpedo,” collected three gold medals and a silver, and Dutch swimmers Pieter van den Hoogeband and Inge de Bruijn each won two gold medals. British rower Steven Redgrave won his fifth consecutive gold medal, an unmatched feat in his sport. Heavyweight boxer Felix Savon of Cuba equaled the feat of his countryman Teófilo Stevenson by winning his third consecutive gold medal."}, {"url": "https://sydneyolympicfc.com/?page_id=125", "page_content": "Club Overview\n\nSydney Olympic Football Club is an Australian semi professional soccer club, based in Belmore, Sydney, New South Wales, that plays in the National Premier Leagues NSW. The Club was founded as Pan-Hellenic Soccer Club in 1957 by Greek immigrants. In 1977, the Club changed its name to Sydney Olympic and became a founding member of the Phillips Soccer League, later named the National Soccer League (NSL), the inaugural national football league of Australia, remaining a member of the competition until its demise in 2004.\n\nSydney Olympic have won many trophies in Australian football, including two NSL Championships, two NSL Cups, the NSL Minor Premiership and three NSW Premier League Championships. The club has also won the Johnny Warren Cup, the Brett Emerton Cup, the National Youth League Championship, the National Youth League Minor Premiership and the NSW Premier League Club Championship."}, {"url": "https://prabook.com/web/derek.king/2384657", "page_content": "Derek King\n\nAugust 15, 1929 (age 73) London Borough of Hackney, Greater London, United Kingdom\n\nAfter leaving school aged 14 he trained as a tie maker and played his early football for Alexander Palace football club in 1945. King joined Tottenham Hotspur as a junior in the season of 1945-1946. After completing two years National Service serving with the Grenadier Guards he returned to Tottenham and in 1950 he became a full-time player. The central defender made 19 appearances for the Spurs before transferring to Swansea City in August 1956. A resolute player he featured in five matches with the Vetch Field club in 1956 before a recurring knee injury ended his senior career in December 1956. King attempted a come back at Ted Ditchburn\"s Romford in 1959. After retiring from football King used his skills as a tie maker when he was employed by Spurs legend Dave Mackay at his tie business. He later worked as a school caretaker. At one time he lived adjacent to White Hart Lane at Paxton Road and maintained a close interest in football up to his death at a Huntingdon nursing home in 2003."}, {"url": "https://www.chicagotribune.com/sports/blackhawks/ct-cb-chicago-blackhawks-derek-king-interim-coach-style-20211107-u6frfnrzbzfknclzgngtrogx2e-story.html", "page_content": "Thank you for supporting our journalism. This article is available exclusively for our subscribers, who help fund our work at the Chicago Tribune.\n\nBlackhawks interim coach Derek King stands behind the bench before the third period against the Predators at the United Center on Nov. 7, 2021. (Armando L. Sanchez / Chicago Tribune)\n\nDerek King wore a winter hat on the ice as he surveyed his first morning skate as interim coach of the Chicago Blackhawks from the blue line, and the 54-year-old struck a jarring difference from the 36-year-old Jeremy Colliton scooting around the ice.\n\nKing has a rough act to follow.\n\nAdvertisement\n\nThe Hawks’ 1-9-2 start to Colliton’s fourth season was marked by sometimes listless play, defensive breakdowns and offensive struggles in five-on-five situations.\n\nIn his first news conference with Chicago media Sunday, King didn’t presume that he can suddenly become the savior for a floundering team, but he did share a few points about philosophy and personality.\n\nAdvertisement\n\n“I’ve had people ask me about my style,” King said. “I don’t think I have a style. I just get a feel for the game, feel for the players and I just go with that.”\n\nHere are three things we learned about King on Sunday.\n\n[ Blackhawks interim GM says the search for permanent coach will take place ‘after the season’ ]\n\n1. The conversation with interim general manager Kyle Davidson came out of the blue.\n\nDavidson talked to Hawks CEO Danny Wirtz and Chairman Rocky Wirtz about firing Colliton on Saturday, then called King in Rockford, where the IceHogs were set to host the Grand Rapids Griffins.\n\n“I was in shock,” King said. “I was talking with Kyle and just like, ‘Wow, sure, I’ll do it. Why not, right?’\n\n“I mean, I was in shock. Had a chat with (interim GM) Kyle (Davidson). And I was just like, ‘Wow, OK. Yeah, sure, I’ll do it. Why not?’”—Derek King on being asked to be the Blackhawks interim head coach.\n\n\n\n“But, yeah, I’m nervous, I’m little scared, I’m anxious, I’m excited.” pic.twitter.com/HECrF8MPXj — Phillip Thompson (@_phil_thompson) November 7, 2021\n\n“But, yeah, I’m nervous. I’m a little scared. I’m anxious. I’m excited. There’s a lot of emotions going right now. It was good to get on the ice with the guys this morning, just to get that out of the way.\n\n“We had a couple of meetings, we’ll have another meeting tonight. I’ll be nervous.”\n\n[ Column: The Blackhawks — after firing coach Jeremy Colliton — are in the midst of changes. Now the new leadership team is in the eye of the storm. ]\n\n2. He isn’t ready to make major schematic changes —yet.\n\nThe Hawks have been severely deficient in defensive execution, but King said he’ll need a couple of games to get a handle on their problems.\n\nThrough 12 games, the Hawks were giving up the second-most goals per game at 3.92. Last season they allowed the eighth-most at 3.29.\n\nAdvertisement\n\nKing said he would observe how the defensive zone coverage looks Sunday night against the Nashville Predators.\n\nNew Blackhawks interim head coach Derek King: “The biggest thing for me is the accountability. Go out there work hard, play the game right, don’t cheat it, and we’ll be fine. And if you don’t do that the accountability’s going to kick in. You’re going to hear from me.” pic.twitter.com/vxFSeEQbAW — Phillip Thompson (@_phil_thompson) November 7, 2021\n\nChicago Tribune Sports Weekdays A daily sports newsletter delivered to your inbox for your morning commute. By submitting your email to receive this newsletter, you agree to our Subscriber Terms & Conditions and Privacy Policy >\n\n“I’ve sat up top and watched the games, and it’s easy to pick a game apart up there,” he said. “But when you’re on the bench, talking with these guys, you’ll get a feel for what they’re thinking and see the struggles, if there are any struggles tonight.”\n\nHe said he’ll go over possible solutions with assistant coach Marc Crawford, but “for now, we’re not changing anything.”\n\n“The biggest thing for me is the accountability,” King said. “Go out there, work hard, play the game right, don’t cheat it and we’ll be fine. If you don’t do that, then the accountability is going to kick in — you’re going to hear from me.”\n\n[ Jeremy Colliton is fired as Blackhawks coach after a 1-9-2 start to his 4th season: ‘Our play and competitiveness must improve’ ]\n\n3. He comes off as laid-back — at a time when the Hawks perhaps need it.\n\nColliton was quietly affable once you got to know him, but he could come off as a bit serious at times. He looked like was born in a tailored suit.\n\nKing gives off the tone of a fun uncle — not the crazy fun uncle who sets off fireworks in your backyard but the kind who tells your parents to ease up on you a bit.\n\nAdvertisement\n\n“I try to keep things light,” King said. “I don’t take it too serious. Even as a player, I tried not to get myself worked up too much. Maybe that was a bad thing once in a while, but I want these guys to feel relaxed.\n\n“They’re tight. My personality is going to come in and let them just take a deep breath and get your shoulders dropped and go have some fun and get back to the game we love to play.”"}, {"url": "https://calbears.com/sports/mens-basketball/roster/derek-king/10224", "page_content": "As a Senior (2017-18): Saw time in three games…Capped off his Cal career with a personal-best 5-point performance in 2 minutes against Stanford at the Pac-12 Tournament, going 2-3 from the floor, including 1-2 from downtown; Also added a rebound…Saw action at home against Washington on Senior Day, tallying his first career rebound…Made his season debut against CSUN…Also played in the exhibition over Providence\n\n\n\nAs a Junior (2016-17): Saw time in one game, debuting on Feb. 24 against Oregon State, tallying one minute of action with one three-point attempt\n\nPrior to Cal: Began college at San Diego Christian College, where he redshirted…Transferred to Foothill Junior College under head coach Matt Stanley and Jimmy Herrera…Led Foothill to an upset No. 1 seed Fresno City College in the playoffs after hitting a last-minute three to seal the game on Foothill’s run to the state’s Elite 8….Scored a season-high 27 points against Skyline College…Averaged 10.0 ppg, 2.7 rpg and 1.7 apg in his last season at Foothill, starting all 27 contests…Earned the Scholar-Athlete Award with a 3.7 GPA\n\nHigh School/Club: Graduated from Santa Teresa High School in 2012…Averaged 16.0 ppg and won CCS against Serra High School…First Team All-League selection…Played his freshman season at SMIC Private School in Shanghai, China, where he was named Team MVP and First Team All-SISAC (Shanghai International Schools Activities Conference)\n\nPersonal: Parents are William and Lea King…Has one younger sister, Emily, who attends Stanford\n\nMajor: Following graduation, would like to play basketball professionally in China or Taiwan"}]}