{"Sydney Olympic won the NSL Cup in 2000.": [{"url": "https://www.britannica.com/event/Sydney-2000-Olympic-Games", "page_content": "Sydney 2000 Olympic Games, athletic festival held in Sydney that took place September 15–October 1, 2000. The Sydney Games were the 24th occurrence of the modern Olympic Games.\n\nSydney was narrowly chosen over Beijing as host city of the 2000 Olympics. The International Olympic Committee (IOC) was attracted to the city’s long history of enthusiasm for sports, its promise to use recovered toxic wastelands as sites for sporting venues, and its plan to involve the smaller countries of Oceania in hosting activities. Despite some cost overruns and a ticket scandal, the preparations and the Games themselves went smoothly. The opening ceremonies celebrated the history of Australia, especially the unique cultures and contributions of the Aboriginal peoples of the continent. The high point of the opening ceremonies came when Aboriginal runner Cathy Freeman lit the Olympic flame. She later won the gold medal in the 400-metre event. The accomplishments and recognition of Freeman were an important milestone for Australian Aboriginal peoples, who were still struggling for their place in Australian society (see Sidebar: Cathy Freeman: The Heart of a Nation).\n\nBritannica Quiz The Olympic Games\n\nNearly 11,000 athletes representing 199 IOC member countries (including 3 athletes from the United Nations dependency of East Timor) participated in the Games, which featured a record 928 medals awarded in 300 events. Several events were contested at the Olympics for the first time in 2000, including men’s and women’s tae kwon do, trampoline, triathlon, and synchronized diving. Other new women’s events included weightlifting, modern pentathlon, and pole vault. The track-and-field competition starred American sprinter Marion Jones, who won three gold and two bronze medals. Australian swimmer Ian Thorpe, nicknamed the “Thorpedo,” collected three gold medals and a silver, and Dutch swimmers Pieter van den Hoogeband and Inge de Bruijn each won two gold medals. British rower Steven Redgrave won his fifth consecutive gold medal, an unmatched feat in his sport. Heavyweight boxer Felix Savon of Cuba equaled the feat of his countryman Teófilo Stevenson by winning his third consecutive gold medal."}, {"url": "https://olympics.com/en/olympic-games/sydney-2000", "page_content": "New Firsts\n\nTriathlon and taekwondo were two new additions to the Olympic programme. Susanthika Jayasinghe became the first Sri Lankan woman to win a medal, claiming bronze in the 200m, whilst Birgit Fischer earned two gold medals in kayaking to become the first woman in any sport to win medals 20 years apart. Women also took part in weightlifting and the modern pentathlon for the very first time.\n\nComeback Kings\n\nThere were some wonderful comebacks in Sydney, but none more so than the U.S. softball team. After losing three games in a row, they regrouped and won gold in stirring fashion by beating each of the teams they had previously lost to.\n\nSyndey 2000 Olympic Games Legacy\n\nDiscover the lasting legacy that this edition of the Olympic Games created for its hosts.\n\nMemorable Champions\n\nRyoko Tamura had lost in the judo 48kg final in both Barcelona and Atlanta, but came back to win the gold medal in Sydney. Steven Redgrave gained sporting immortality by becoming the first rower to win gold medals at five consecutive Olympic Games. In the 400m freestyle, 17-year-old Australian swimmer Ian Thorpe won gold by breaking his own world record in front of a jubilant home crowd."}, {"url": "https://historyandheritage.cityofparramatta.nsw.gov.au/research-topics/events/sydney-olympics-2000", "page_content": "by Neera Sahni\n\nAustralia was the host nation for the 2000 Summer Olympics in Sydney.\n\nThe Sydney 2000 Olympics, officially known as the Games of the XXVII Olympiad. It is also known as 2000 Olympics or the Millennium Olympic Games or Games of the New Millennium. Sydney 2000 Olympics was an international multi-sport event held between 15 September and 1 October 2000 in Sydney, New South Wales, Australia. It was the second time, the Summer Olympics were held in Australia, and the Southern Hemisphere. The first being in Melbourne, Victoria, in 1956.\n\nThere were 10,651 (4,069 women, 6,582 men) athletes from 199 countries and participated in 300 events. Australian athletes have competed in every Sydney 2000 Olympic Games. There were 628 competitors - 341 men and 276 women. They took part in 270 events in 34 sports.\n\nOn 24 September 1993, Sydney won the right to host the Games, after four rounds of voting, selected over Beijing, Berlin, Istanbul and Manchester during the 101st International Olympic Committee Session in Monte Carlo, Monaco.\n\n2000 Summer Olympics bidding results\n\n\n\nCity Nation Round 1 Round 2 Round 3 Round 4 Sydney Australia 30 30 37 45 Beijing China 32 37 40 43 Manchester Great Britain 11 13 11 - Berlin Germany 9 9 - - Istanbul Turkey 7 - - -\n\nCost: In 2000, the Auditor-General of New South Wales reported that the Sydney Games cost A$6.6 billion, with a net cost to the public between A$1.7 and A$2.4 billion. Many venues were constructed in the Sydney Olympic Park. In the years leading up to the games, funds were shifted from education and health programs to cover Olympic expenses.\n\nPhases of the Olympic project:\n\nThe staging of the Sydney Olympics were treated as a massive project on a vast scale. The project broken into several broad phases:\n\n• 1993 to 1996 – positioning\n\n• 1997 – going operational\n\n• 1998 – procurement/visualisation\n\n• 1999 – testing/refinement\n\n• 2000 – implementation\n\n• 2001 – post implementation and wind-down\n\nVolunteer program:\n\nIn early 1992, before the bid, volunteer program for Sydney 2000 games was established. A group of Sydney citizens, interested in the prospect of hosting the 2000 Olympic and Paralympic Games, gathered for a meeting at Sports House, at Wentworth Park in Sydney on 17 December 1992. After winning the bid in 1993, the small group of volunteers grew from approximately 42 to around 500. These volunteers became known as Pioneer Volunteers.\n\nThe Pioneer Volunteer program was managed by the Sydney Organising Committee for the Olympic Games (SOCOG) Volunteer Services Department in consultation with prominent peak groups like The Centre for Volunteering and TAFE.\n\nDuring the Olympic 46,967volunteers, helped everywhere at the Olympic venues, transportation hubs and elsewhere in the city.\n\nThe official logo:\n\nThe bid logo, designed by architect and designer Michael Bryce, featured a colourful, stylised image of the Sydney Opera House.\n\nThe official logo – also referred to as the \"Millennium Man\" – took the image of the bid logo and combined it with a stylised image of a runner to form a torchbearer in motion; formed by two small yellow boomerangs for arms and a larger red boomerang for legs. The Olympic torch is represented through a blue smoke trail, which draws the iconic peaks of the Sydney Opera House.\n\nSydney Olympics 2000 Logo (Image Source: https://www.olympic.org)\n\nThe design process of the official logo, as well as all other aspects of the Olympic Games' visual design identity, was awarded to Melbourne design studio FHA Image Design.The Sydney Olympics brand identity project officially commenced in 1993.\n\nThe Mascots:\n\nThe mascots chosen for the 2000 Summer Olympics were:\n\n• Syd the platypus\n\n• Millie the echidna,\n\n• Olly the kookaburra\n\n• Fatso the Fat-Arsed Wombat - an unofficial mascot\n\nOlympic Torch:\n\nSydney Olympics 2000 Torch (Image Source: https://www.olympic.org)\n\nSydney Olympics 2000 torch travelled across Greece, Guam, Palau, Federal States of Micronesia, Salomon Islands, Papua New Samoa, American Samoa, Cook Islands, Tonga, New Zealand and Australia. Total distance covered by the torch is over 45,693 km and 436 nautical miles – 1,693 km and 436 nautical mile in Greece, around 17,000 in Oceania and 27,000 in Australia. There were 23,400 torchbearers - around 900 in Greece, 1,500 in Oceania and 11,000 in Australia.\n\nCathy Freeman lit the Olympic flame to open the Sydney 2000 Games (Image Source: The Age)\n\nOpening Ceremony: Cathy Freeman, the Australian athlete, had the honour of lighting the Olympic torch at the Opening Ceremony. This emotional moment helped symbolise the desire to reconcile with the Aboriginal populations of Australia.\n\nNeera Sahni, Research Services Leader, Parramatta Heritage Centre, City of Parramatta, 2020\n\nReferences:\n\nhttps://www.olympic.org/sydney-2000\n\nhttps://en.wikipedia.org/wiki/2000_Summer_Olympics\n\nhttps://en.wikipedia.org/wiki/Australia_at_the_2000_Summer_Olympics"}, {"url": "https://www.theroar.com.au/2011/04/19/a-brief-history-of-the-nsl-part-iv/", "page_content": "The Australian National Soccer League (NSL) kicked off in 1977 and by 1998 the league had gone through a 21-year roller coaster of football highs and lows.\n\nThe league itself had been a success in finally establishing a national football competition that raised the profile of the sport.\n\nFootball was also attracting interest from business, sponsors and major benefactors. Participation rates amongst junior players was steadily climbing to seriously start rivalling the other major sporting codes for the first time.\n\nFacebook Twitter Whatsapp Reddit Email Share\n\nBut apart from major league matches, such as playoff games, grand finals and championship deciders, the crowds over the length of the journey had not risen to the levels that gave it any sustained profitability.\n\nOver the twenty one years various changes were introduced to the NSL including creating two separate conferences, introducing a play-off series and switching to a summer league, but the financial breakthrough was still not achieved.\n\nDuring the nineties there was also a growing opinion from sponsors and benefactors and the new board of Soccer Australia, that the NSL would not become a mainstream competition because of the overt ethnic flavour of many of the clubs and the league itself.\n\nSome of the NSL clubs were seen as introverted, self concerned with their own ethnicity and not welcoming to the general follower of Australian sports.\n\nEthnic flags and logos were banned and clubs were even asked to change their name to be more like American baseball or football clubs and forget their countries of origin.\n\nAdvertisement\n\nThe NSL’s cause was also being seriously wounded by a wolf pack of local newspapers who savaged the game at every opportunity with back page headlines and stories of “Ethnic Soccer Hooligan Violence”. So much so that mothers started to fear for their children’s safety if they went anywhere near a football match.\n\nFootball fans themselves started to wonder if these “sports reporters” had even attended the same NSL game, so dramatic were the newspaper reports of serious trouble.\n\nSo around that time we saw the gradual reformation of the NSL into a homogenised and sanitised non-ethnic NSL, with only fair dinkum Australian football clubs.\n\nThe NSL Club attendance roll started to look like this: South Melbourne Lakers, Carlton Blues, Football Kingz, Adelaide City Zebras, Sydney United Pumas, Marconi Stallions, Wollongong Wolves, Melbourne Knights, Perth Glory, UTS Olympic, Gippsland Falcons, Brisbane Strikers, Newcastle Breakers, Canberra Cosmos, Collingwood Warriors, Northern Spirit, Parramatta Power and the West Adelaide Sharks.\n\nAnother major change around this time was that clubs like Canberra Cosmos and Perth Glory moved to being full time professional football clubs with full time employees and professional players, as opposed to a lot of NSL clubs and players who were only semi-professional or even amateur in some ways, up to that time.\n\nThe 1997-98 season saw the South Melbourne Lakers top the league table with big spending newcomers Carlton Blues runners up at their first attempt. Carlton and South Melbourne met in the grand final at a packed Olympic Park in an all Melbourne NSL decider.\n\nAnge Postecoglou’s side won their third NSL title 2-1 and first as a manager for Ange. The Carlton Blues team contained a young Marc Bresciano and Simon Colosimo.\n\nAdvertisement\n\nNorthern Spirit joined the league in 1998-99 and were an immediate hit with the fans of northern Sydney playing to packed stands and a record average attendance in their first season.\n\nSydney City Pumas topped the league table that year ahead of the South Melbourne Lakers, but newcomers Perth Glory and Northern Spirit made the top five and the NSL playoffs.\n\nPerth Glory also attracted big crowds with 28,000 attending their Semi Final win over Marconi. However, Glory lost in the preliminary final to Sydney City. South Melbourne picked up their fourth NSL title with the Lakers 3-2 win in a great grand final at Olympic Park in front of a big crowd.\n\nWollongong Wolves won their first NSL title in 1999-2000 beating a gallant Perth Glory. The match was hailed as the greatest ever NSL grand final after a 3-3 finish in regular time and a penalty shootout win only after eighteen penalty kicks were taken. It was also a memorable game for the record NSL crowd of 43,242 in attendance.\n\nWollongong repeated their title victory in 2000-01, their second NSL crown in a row. This time beating South Melbourne at Parramatta Stadium in front of relatively disappointing crowd of 13,400 fans, given the Perth Glory semi final was watched by 31,710.\n\nThe Sydney Olympic Sharks surprised everyone in 2001-02 winning their second NSL title by beating runaway league leaders Perth Glory one nil in front of 42,735 fans.\n\nGlory finally won the NSL title they richly deserved in 2002-03 extracting their revenge on the Olympic sharks in from of 38,211 fans. Jamie Harnwell and Damien Mori put two goals past Clint Bolton to win two nil.\n\nAdvertisement\n\nGlory repeated that effort in 2003-04 beating Parramatta Power 1-0 on the 4/4/2004 in front of 9,700 football fans. That was it, the last game of the NSL and the end of the competition.\n\nSo why did the NSL fail?\n\n1. Apart from the high profile games, the NSL and its clubs were never able to attract the large enough fan base to the games to produce enough return on their investment. Large investors, benefactors and sponsors finally ran out of patience and ended their involvement to cut their losses.\n\n2. High profile Australian players started to leave the NSL in larger numbers, due the ever growing overseas football markets and to take up more enticing offers from overseas leagues. Up to 200 of Australia’s best footballers had left the NSL to go overseas to seek their football fortune.\n\n3. Soccer Australia was judged to have been poor administrators of the NSL. The lack of direction and leadership at times did not help the competition, particularly in its declining years.\n\n4. There were a number of controversies and indecisions and finally when Soccer Australia decided to abandon the ethnic flavour of the NSL, it tended to alienate some of the larger and more traditional ethnic clubs, who started pulling in opposite directions.\n\n5. The Australian press were not totally supportive of the NSL and probably sold more papers when they ran negative stories about the NSL, particularly the ethnic soccer violence angle.\n\nAdvertisement\n\n6. There was not a proper process to assess the clubs’ financial and structural viability when they applied to join the NSL and so there was a high turnover of NSL clubs.\n\n7. Australia is a very complex and very competitive sporting market with limited fan bases and financial returns. The other competitions were well entrenched and financially more stable.\n\n8. The Australasian competition with teams from Perth to New Zealand had very large operating and travel expenses and required large ticket and merchandising sales to remain profitable in the long run.\n\nThe National Soccer League (NSL) kicked off in 1977 with so much promise, thirty four years ago this month. Despite all its misgivings, problems and financial woes it ran for twenty eight years, creating a historical and lasting legacy for the many football fans of this country.\n\nHow will you remeber the NSL?"}, {"url": "https://sydneyolympicfc.com/?page_id=125", "page_content": "Club Overview\n\nSydney Olympic Football Club is an Australian semi professional soccer club, based in Belmore, Sydney, New South Wales, that plays in the National Premier Leagues NSW. The Club was founded as Pan-Hellenic Soccer Club in 1957 by Greek immigrants. In 1977, the Club changed its name to Sydney Olympic and became a founding member of the Phillips Soccer League, later named the National Soccer League (NSL), the inaugural national football league of Australia, remaining a member of the competition until its demise in 2004.\n\nSydney Olympic have won many trophies in Australian football, including two NSL Championships, two NSL Cups, the NSL Minor Premiership and three NSW Premier League Championships. The club has also won the Johnny Warren Cup, the Brett Emerton Cup, the National Youth League Championship, the National Youth League Minor Premiership and the NSW Premier League Club Championship."}, {"url": "https://olympicstimes.com/2000-results-medal-table/", "page_content": "The Millennium Olympic Games 2000, was started with the opening ceremony on 15th September in 2000 and ended-up closing ceremony on 1st October in Australia.\n\nAmong the 5 nation’s cities (Sydney, Beijing, Manchester, Berlin, and Istanbul) the Sydney won the bidding on that process.\n\nWith 10,651 athletes from 199 nations – Sydney 2000 Olympic Game was held in Australia. Apparently, 300 events in 28 sports were held on this season.\n\nRead: Melbourne 1956 Summer Olympics Results\n\nSydney 2000 Summer Olympics – Results – Medalist – Medal Table\n\nIf you look at Sydney 2000 Summer Olympic Games, then you may see – the United States was the #1 on the medal ranking position with 37 gold medals, 24 silver medals, and 32 bronze medals.\n\nOn the other hand, Russia, China, Australia were the 2nd, 3rd & 4th positions on that table. This ranking is based on the International Olympic Committee (IOC).\n\nRead: 2004 Summer Olympics Results\n\nRank Nations Gold Medals Silver Medals Bronze Medals Total 1 United States 37 24 32 93 2 Russia 32 28 29 89 3 China 28 16 14 58 4 Australia 16 25 17 58 5 Germany 13 17 26 56 6 France 13 14 11 38 7 Italy 13 8 13 34 8 Netherlands 12 9 4 25 9 Cuba 11 11 7 29 10 Great Britain 11 10 7 28 11 Romania 11 6 9 26 12 South Korea 8 10 10 28 13 Hungary 8 6 3 17 14 Poland 6 5 3 14 15 Japan 5 8 5 18 16 Bulgaria 5 6 2 13 17 Greece 4 6 3 13 18 Sweden 4 5 3 12 19 Norway 4 3 3 10 20 Ethiopia 4 1 3 8 21 Ukraine 3 10 10 23 22 Kazakhstan 3 4 0 7 23 Belarus 3 3 11 17 24 Canada 3 3 8 14 25 Spain 3 3 5 11 26 Turkey 3 0 2 5 27 Iran 3 0 1 4 28 Czech Republic 2 3 3 8 29 Kenya 2 3 2 7 30 Denmark 2 3 1 6 31 Finland 2 1 1 4 32 Austria 2 1 0 3 33 Lithuania 2 0 3 5 34 Azerbaijan 2 0 1 3 35 Bahamas 2 0 1 3 36 Slovenia 2 0 0 2 37 Switzerland 1 6 2 9 38 Indonesia 1 3 2 6 39 Slovakia 1 3 1 5 40 Mexico 1 2 3 6 41 Nigeria 1 2 0 3 42 Algeria 1 1 3 5 43 Uzbekistan 1 1 2 4 44 Latvia 1 1 1 3 45 Yugoslavia 1 1 1 3 46 New Zealand 1 0 3 4 47 Estonia 1 0 2 3 48 Thailand 1 0 2 3 49 Croatia 1 0 1 2 50 Cameroon 1 0 0 1 51 Colombia 1 0 0 1 52 Mozambique 1 0 0 1 53 Brazil 0 6 6 12 54 Jamaica 0 6 3 9 55 Belgium 0 2 3 5 56 South Africa 0 2 3 5 57 Argentina 0 2 2 4 58 Chinese Taipei 0 1 4 5 59 Morocco 0 1 4 5 60 North Korea 0 1 3 4 61 Moldova 0 1 1 2 62 Saudi Arabia 0 1 1 2 63 Trinidad and Tobago 0 1 1 2 64 Ireland 0 1 0 1 65 Sri Lanka 0 1 0 1 66 Uruguay 0 1 0 1 67 Vietnam 0 1 0 1 68 Georgia 0 0 6 6 69 Costa Rica 0 0 2 2 70 Portugal 0 0 2 2 71 Armenia 0 0 1 1 72 Barbados 0 0 1 1 73 Chile 0 0 1 1 74 Iceland 0 0 1 1 75 India 0 0 1 1 76 Israel 0 0 1 1 77 Kuwait 0 0 1 1 78 Kyrgyzstan 0 0 1 1 79 Macedonia 0 0 1 1 80 Qatar 0 0 1 1\n\nTeam Sports Result at the Sydney 2000 Olympic Games\n\nIn the Football events of the Sydney 2000 Olympic Games – Cameroon was the champion of the men’s events. On the contrary, Norway was the champion of women’s events.\n\nThe 2nd most popular sports event on the Sydney 2000 Olympic Games is the Basketball. The USA was the champion of the defeated over Cuba.\n\nHere we created a table of the team sports result at the Sydney 2000 Olympic Games.\n\nRead: Atlanta 1996 Summer Olympics Results"}, {"url": "https://www.wikiwand.com/en/Sydney%20Olympic%20Football%20Club", "page_content": "Sydney Olympic Football Club is an Australian semi-professional soccer club, based in Belmore, Sydney, New South Wales, that plays in the National Premier Leagues NSW. The Club was founded as Pan-Hellenic Soccer Club in 1957 by Greek immigrants. In 1977, the Club changed its name to Sydney Olympic and became a founding member of the Phillips Soccer League, later named the National Soccer League (NSL), the inaugural national football league of Australia, remaining a member of the competition until its demise in 2004.\n\nFootball club\n\nQuick facts: Full name, Nickname(s), Founded, Ground, Capa... ▼\n\nSydney Olympic have won many trophies in Australian football, including two NSL Championships, two NSL Cups, the NSL Minor Premiership and three NSW Premier League Championships. The club has also won the Johnny Warren Cup, the Brett Emerton Cup, the National Youth League Championship, the National Youth League Minor Premiership and the NSW Premier League Club Championship.\n\nSydney Olympic has traditionally been one of the most well supported football teams in Australia, setting numerous domestic crowd attendances. A crowd of 18,985 attended Sydney Olympic's victory over Northern Spirit in 1998 at North Sydney Oval, a record crowd attendance between two clubs during the regular season of the NSL, defeating the previous record of 18,367 set when Newcastle KB United played Sydney Olympic in 1979 at Marathon Stadium. The greatest crowd attendance for a Grand Final was recorded during the 2001/02 season when 42,735 people were present at Subiaco Oval to see Sydney Olympic defeat Perth Glory."}, {"url": "https://www.olympics.com.au/games/sydney-2000/", "page_content": "In September, 2000, residents of the harbour city and the people of Australia set the benchmark of how future Olympics would be measured by staging what IOC President Juan Antonio Samaranch ultimately described as “the best Olympic Games ever.”\n\nThe Opening Ceremony on September 15 began with a lone horseman galloping his mount to the centre of the Olympic Stadium in front of 110,000 spectators.\n\nThe entire production was a celebration of the Australian continent.\n\nDuring the Parade of Nations, North and South Korea marched together under the same flag, and four athletes from East Timor received a tremendous cheer as they paraded behind the IOC flag.\n\nThe last team to appear in the stadium was Australia, with five-time Olympian and basketball captain Andrew Gaze proudly waving the flag at the front of Australia’s largest-ever team of 632 athletes.\n\nSydney 2000 marked a century of women’s participation in the Olympics.\n\nTo recognise this, some of Australia’s finest female athletes carried the torch inside the stadium.\n\nBetty Cuthbert, the Golden Girl of the Melbourne Olympics, was pushed in a wheelchair by Raelene Boyle (Cuthbert’s movement was impaired by multiple sclerosis).\n\nNext, legends Dawn Fraser, Shirley Strickland, Shane Gould and Debbie Flintoff-King all ran with the torch.\n\nFlintoff-King, the last Australian track gold medallist, then passed the torch to Cathy Freeman.\n\nAustralia at these Games\n\nSince Sydney had been elected to host the Games in 1993, expectations had been high that the team chosen to represent Australia would be one of the most impressive ever.\n\nIn front of always-vocal home fans, the Australian team lived up to this billing, achieving outstanding results across the spectrum of sports. Australia won 58 medals – 16 gold, 25 silver and 17 bronze – to finish fourth on the medal table behind the United States, Russia and China.\n\nA team of 632 athletes, 349 men and 283 women, competed in the Games. Australia had representatives in each of the 28 sports on the program.\n\nBasketballer Andrew Gaze, at his fifth Olympics, carried the flag in the Opening Ceremony.\n\nThe Olympic Oath was read on behalf of all athletes by hockey’s Rechelle Hawkes, who would end her career in Sydney as a triple Olympic champion.\n\nThe honour of carrying the Australian flag in the Closing Ceremony was given to one of the team’s youngest members, 17-year-old Ian Thorpe.\n\nHe was, of course, also one of the true stars of the Games, winning five medals – three gold and two silver.\n\nThorpe’s two gold medals on the opening night of competition, breaking a world record in the 400m freestyle and then coming from behind in the anchor leg to beat the dominant Americans in the 4x100m freestyle relay, ignited the Games. His other gold was in the 4x200m freestyle.\n\nBesides Cathy Freeman, he was the most celebrated champion of the Games.\n\nAustralia’s other gold medallists in the pool were all worthy champions, including a strong squad of men’s relay swimmers.\n\nThe other individual gold medallists were Susie O’Neill, winner of the 200m freestyle and three silver medals; and 1500m freestyle champion Grant Hackett, with defending champion Kieren Perkins placing second.\n\nThe swimmers weren’t the only water babies to enjoy success. Australia scored a heart-stopping win in the first women’s water polo final, beating favourites the United States 4-3 after a last-second goal from Yvette Higgins.\n\nSailing provided two gold medals, both in the 470 dinghy class, with Tom King and Mark Turnbull winning the men’s event and Jenny Armstrong and Belinda Stowell the women’s gold.\n\nAt the main stadium, Freeman’s 400m gold medal shone brighter than any other trophy awarded at the Games.\n\nThere was also success in less publicised sports. Simon Fairweather gave Australia its first archery medal when he won gold in the men’s individual event.\n\nShotgun shooter Michael Diamond won his second consecutive gold medal in men’s trap. Lauren Burns won the 49kg taekwondo crown, while beach volleyballers Kerri-Ann Pottharst and Natalie Cook set BondiBeach ablaze by winning gold.\n\nAustralia also celebrated in three sports in which it is traditionally strong.\n\nCyclists Brett Aitken and Scott McGrory teamed up to win the Madison event at the 'Dunc' Gray Velodrome.\n\nThe Hockeyroos, Australia’s celebrated women’s hockey team, won its third gold medal from the past four Games, defeating Argentina 3-1 in the final which more than 10 million Australians watched on TV.\n\nAnother popular victory occurred when the three-day eventing team of Phillip Dutton, Andrew Hoy, Matt Ryan and Stuart Tinney won Australia its third consecutive gold medal in the glamour equestrian event.\n\nThe success of the Australian team was not just in the medals; it was in the spirit and camaraderie shown within the team and externally with spectators, volunteers, officials and international competitors.\n\nThe athletes were the star performers of one of the happiest moments in Australian history, which will long remain a golden Games for Australia."}, {"url": "https://db0nus869y26v.cloudfront.net/en/NSL_Cup", "page_content": "The NSL Cup also known officially as National Soccer League Cup was an annual knockout football competition in men's domestic Australian soccer organised by the Australian Soccer Federation between 1977 and 1997.\n\nHistory\n\nThe NSL Cup was organised to run in conjunction with the teams participating in the National Soccer League (NSL) between 1977 and 1997. It was the second nationwide club tournament held in Australia, the first being the Australia Cup during the 1960s.[2] It was held initially in 1977 immediately after the end of the NSL's regular home and away season, as there was no final series. The 1978 edition expanded to include teams from various state leagues in Australia, including Annerley (Queensland), West Woden Juventus (ACT), Essendon Croatia (Victoria), Sydney Croatia (NSW) and Ascot (WA).[3]\n\nFor the 1993–94 season the Cup was played in the preseason, before being played as a mid-season break for the 1995–96 season and then returning to the preseason for the 1996–97 season.[4] The 1996-97 Cup was the final cup to be playing during the NSL years and saw a brand new club, Collingwood Warriors, defeat Marconi in the final.[5] A replacement national knock-out cup was not instigated until the FFA Cup in 2014.[3]\n\nUpsets\n\nState League side Sydney Croatia upset NSL club Marconi in the first round of the 1978 Cup. Other upsets over the years where state league teams defeated NSL teams, including Parramatta Melita Eagles defeating Marconi in 1979, Mt Gravatt defeating Brisbane City in 1980, and Croydon City defeating South Melbourne in 1986.[3]"}, {"url": "https://sydneyolympicfc.com/?page_id=471", "page_content": "Sydney Olympic Football Club is an Australian semi-professional soccer club, based in Belmore, Sydney, New South Wales, that plays in the National Premier Leagues NSW. The Club was founded as Pan-Hellenic Soccer Club in 1957 by Greek immigrants. In 1977, the Club changed its name to Sydney Olympic and became a founding member of the Phillips Soccer League, later named the National Soccer League (NSL), the inaugural national football league of Australia, remaining a member of the competition until its demise in 2004.\n\nSydney Olympic have won many trophies in Australian football, including two NSL Championships, two NSL Cups, the NSL Minor Premiership and three NSW Premier League Championships. The club has also won the Johnny Warren Cup, the Brett Emerton Cup, the National Youth League Championship, the National Youth League Minor Premiership and the NSW Premier League Club Championship.\n\nSydney Olympic has traditionally been one of the most well supported football teams in Australia, setting numerous domestic crowd attendances. A crowd of 18,985 attended Sydney Olympic’s victory over Northern Spirit in 1998 at North Sydney Oval, a record crowd attendance between two clubs during the regular season of the NSL, defeating the previous record of 18,367 set when Newcastle KB United played Sydney Olympic in 1979 at Marathon Stadium.\n\nThe greatest crowd attendance for a Grand Final was recorded during the 2001/02 season when 42,735 people were present at Subiaco Oval to see Sydney Olympic defeat Perth Glory."}]}