{"Derek King was a regular starter for the club, making over 200 appearances in the NSL.": [{"url": "https://www.tottenhamhotspur.com/news-archive-1/obituary-derek-king/", "page_content": "Tottenham Hotspur (Spurs) Football Club is located in North London. The club is also known as Spurs. Tottenham's home ground is White Hart Lane. The club motto is Audere est Facere (To dare is to do).\n\nWe were sorry to learn of the passing of our former defender Derek King, aged 73. He made 19 first division appearances for us between 1951 and 1954 during his six year stint as a professional.\n\nAssociated with the club for 11 years during the immediate post war era, initially as a junior and then on our professional staff, Derek featured in approximately 200 competitive matches in our colours, mainly at centre half, until joining Swansea Town in 1956.\n\nBorn at Hackney on August 15, 1929, Derek Albert King attended Glynn Road School, Hackney and trained in the tie and neckwear industry on leaving at the age of 14. He played for Alexandra Palace FC during 1945. A member of Tottenham Juniors he featured at full back when our reserve team reappeared for the 1945-46 season.\n\nHis two year spell of National Service from November, 1947 was spent with the 3rd Battalion Grenadier Guards based at Windsor Castle.\n\nOn joining our full time staff during August, 1950 his first season was spent chiefly with our 'A' team playing in the Eastern Counties League. He made his Football League debut in a 1-0 home win over Fulham on August 20, 1951 but it was not until March, 1953 that he had a sustained run in our senior side.\n\nDerek made his final league outing for us against Charlton Athletic during October, 1954 going on to gain winners medals in the Sudbury & Suffolk Charity Cup of 1954-55 and the 1955-56 Football Combination before joining former team mate Ron Burgess at Swansea. His one season there yielded five league appearances.\n\nAfter his playing career he returned to work in the tie/neckwear business. Derek was associated with Tottenham based firm Dave Mackay Club Ties for a number of years and later worked as a school caretaker until retiring through ill health. He lived at Hoddesdon for many years having previously resided at Enfield and adjacent to our ground on Paxton Road, maintaining his love of football throughout.\n\nDerek had followed his uncle Eddie in wearing our colours. He was a son of Eddie's eldest brother Bert. Eddie's three year spell at Tottenham was ended by injury in 1936. He made one Football League appearance for the club in 1934.\n\nDerek King passed away at a Huntingdon nursing home on June 16. The funeral takes place at City of London Crematorium, South Chapel, at 13.15 on June 30.\n\nHe is survived by his mother Doris, aged 97, three sisters June, Doreen and Valerie, three daughters, Lesley, Toni and Christine, plus grand children.\n\nOur thoughts are with his family and friends at this sad time.\n\n"}, {"url": "https://prabook.com/web/derek.king/2384657", "page_content": "Derek King\n\nAugust 15, 1929 (age 73) London Borough of Hackney, Greater London, United Kingdom\n\nAfter leaving school aged 14 he trained as a tie maker and played his early football for Alexander Palace football club in 1945. King joined Tottenham Hotspur as a junior in the season of 1945-1946. After completing two years National Service serving with the Grenadier Guards he returned to Tottenham and in 1950 he became a full-time player. The central defender made 19 appearances for the Spurs before transferring to Swansea City in August 1956. A resolute player he featured in five matches with the Vetch Field club in 1956 before a recurring knee injury ended his senior career in December 1956. King attempted a come back at Ted Ditchburn\"s Romford in 1959. After retiring from football King used his skills as a tie maker when he was employed by Spurs legend Dave Mackay at his tie business. He later worked as a school caretaker. At one time he lived adjacent to White Hart Lane at Paxton Road and maintained a close interest in football up to his death at a Huntingdon nursing home in 2003."}, {"url": "https://pantagraph.com/sports/hockey/3-things-we-learned-about-derek-king-the-chicago-blackhawks-interim-coach/article_e5605698-eedf-5ef6-bbdf-941faf3f744c.html", "page_content": "Derek King wore a winter hat on the ice as he surveyed his first morning skate as interim coach of the Chicago Blackhawks from the blue line, and the 54-year-old struck a jarring difference from the 36-year-old Jeremy Colliton scooting around the ice.\n\nKing has a rough act to follow.\n\nThe Hawks’ 1-9-2 start to Colliton’s fourth season was marked by sometimes listless play, defensive breakdowns and offensive struggles in five-on-five situations.\n\nIn his first news conference with Chicago media Sunday, King didn’t presume that he can suddenly become the savior for a floundering team, but he did share a few points about philosophy and personality.\n\n“I’ve had people ask me about my style,” King said. “I don’t think I have a style. I just get a feel for the game, feel for the players and I just go with that.”\n\nHere are three things we learned about King on Sunday.\n\n1. The conversation with interim general manager Kyle Davidson came out of the blue.\n\nDavidson talked to Hawks CEO Danny Wirtz and Chairman Rocky Wirtz about firing Colliton on Saturday, then called King in Rockford, where the IceHogs were set to host the Grand Rapids Griffins.\n\n“I was in shock,” King said. “I was talking with Kyle and just like, ‘Wow, sure, I’ll do it. Why not, right?’\n\n“But, yeah, I’m nervous. I’m a little scared. I’m anxious. I’m excited. There’s a lot of emotions going right now. It was good to get on the ice with the guys this morning, just to get that out of the way.\n\n“We had a couple of meetings, we’ll have another meeting tonight. I’ll be nervous.”\n\n2. He isn’t ready to make major schematic changes —yet.\n\nThe Hawks have been severely deficient in defensive execution, but King said he’ll need a couple of games to get a handle on their problems.\n\nThrough 12 games, the Hawks were giving up the second-most goals per game at 3.92. Last season they allowed the eighth-most at 3.29.\n\nKing said he would observe how the defensive zone coverage looks Sunday night against the Nashville Predators.\n\n“I’ve sat up top and watched the games, and it’s easy to pick a game apart up there,” he said. “But when you’re on the bench, talking with these guys, you’ll get a feel for what they’re thinking and see the struggles, if there are any struggles tonight.”\n\nHe said he’ll go over possible solutions with assistant coach Marc Crawford, but “for now, we’re not changing anything.”\n\n“The biggest thing for me is the accountability,” King said. “Go out there, work hard, play the game right, don’t cheat it and we’ll be fine. If you don’t do that, then the accountability is going to kick in — you’re going to hear from me.”\n\n3. He comes off as laid-back — at a time when the Hawks perhaps need it.\n\nColliton was quietly affable once you got to know him, but he could come off as a bit serious at times. He looked like was born in a tailored suit.\n\nKing gives off the tone of a fun uncle — not the crazy fun uncle who sets off fireworks in your backyard but the kind who tells your parents to ease up on you a bit.\n\n“I try to keep things light,” King said. “I don’t take it too serious. Even as a player, I tried not to get myself worked up too much. Maybe that was a bad thing once in a while, but I want these guys to feel relaxed.\n\n“They’re tight. My personality is going to come in and let them just take a deep breath and get your shoulders dropped and go have some fun and get back to the game we love to play.”\n\n9 photos: Illinois defeats Minnesota 14-6 Illinois Minnesota Football Illinois Minnesota Football Illinois Minnesota Football Illinois Minnesota Football Illinois Minnesota Football Illinois Minnesota Football Illinois Minnesota Football Illinois Minnesota Football Illinois Minnesota Football"}, {"url": "https://www.nbcsports.com/chicago/blackhawks/blackhawks-begin-derek-king-era-it-sucks-when-someone-gets-fired", "page_content": "The Blackhawks wiped out their coaching staff on Saturday, relieving head coach Jeremy Colliton and assistant coaches Sheldon Brookbank and Tomas Mitell of their duties after a 1-9-2 start to the season. It was a move that probably wasn't surprising, given how badly the team struggled out of the gates.\n\nThe next order of business was trying to figure out who would take over as the interim.\n\nBlackhawks interim GM Kyle Davidson called Rockford IceHogs head coach Derek King to offer him the job because he was looking for an \"outside voice\" and you could only imagine the reaction from King.\n\n\"When I got the call, I almost fell out of my chair,\" King told NBC Sports Chicago in an exclusive interview.\n\nKing has developed a close friendship over the years with Colliton. The two of them were on staff together in Rockford and communicated frequently as the bench bosses of the AHL and NHL clubs. King didn't want to get the job like this. But that's how this business works.\n\n'You never want to see this,\" King said of Colliton losing his job. \"He's a friend. If anything, it's not we coached with each other, he was the head there and I was the head in Rockford, it was just we were friends. And we had a good relationship, so I feel [for him]. He understands, though. I had a good conversation with him yesterday. It's part of the business, we all get that. This is what we signed up for.\"\n\nKing's message to the team on Sunday morning was simple. Go out there and play loose and have fun. Don't be so tight. And that's exactly what the Blackhawks did.\n\nThe Blackhawks allowed a season-low 21 shots on goal and Alex DeBrincat scored the overtime winner against the Nashville Predators to give King his first NHL win as a head coach. He immediately picked up the puck and, after the game, gave it to King, who will surely remember this day for a long time.\n\n\"It's fun to win games,\" DeBrincat said. \"It's been tough this first month of the season, but the guys battled hard today, got the win. That's what matters right now, getting wins and having fun. Good for Kinger to get his first win and wanted to make sure he got that [puck].\"\n\nStill, it was a bittersweet moment for the Blackhawks. Three coaches lost their jobs on Saturday, and nobody feels good about that.\n\n\"It's always tough to hear,\" Patrick Kane said. \"As players, you always feel like you could have done more to make that situation not happen. But came in today and I thought Marc Crawford and Kinger did a good job of getting the message across that we wanted to play free, we wanted to play on our instincts and also play with a lot of energy. … It's definitely always, I guess, sad when something like that happens.\"\n\nThe Blackhawks made a coaching change not because they were losing, but because of how they were losing. The message didn't appear to be getting across, and the leadership group is accepting responsibility for the role they played in that.\n\n\"I don't know if it wasn’t the message that wasn't getting across as much as – I mean let's face it, there's been a lot going on this year and it's been hard for a lot of the players who have kind of inherited this situation in our organization,\" Jonathan Toews said. \"It was just every little thing seemed to go wrong and we’d all seize up and make mistakes and wouldn’t support each other well. It sucks when someone gets fired over it and loses their job.\n\n\"As much as guys like Brooksie and Jeremy and Tomas put into helping this team win, it's very disappointing for them, but I think for us as players we feel responsible as well.\"\n\nThe Blackhawks needed a win more than anything on Sunday to help lift the weight off everyone's shoulders. It's been a whirlwind of a season so far, both on and off the ice.\n\nThe Blackhawks can only hope Sunday's win can be a launching point for the rest of the season as they enter the King era.\n\n\"I made it clear that this wasn’t about me,\" King said. \"I love the fact, it’s your first game and you get a win, obviously you’re pumped about it. But this is not about me. This is about those guys. I told them, you guys should be proud of each other because you stuck together and you fought through it and you got a win out of it.\"\n\nClick here to follow the Blackhawks Talk Podcast."}, {"url": "https://www.hockey-reference.com/players/k/kingde01.html", "page_content": "Frequently Asked Questions\n\nHow old is Derek King?\n\nDerek King is 56 years old.\n\nWhen was Derek King born?\n\nDerek King was born on February 11, 1967.\n\nWhere was Derek King born?\n\nDerek King was born in Hamilton, Canada.\n\nHow tall is Derek King?\n\nDerek King is 6-1 (185 cm) tall.\n\nHow much did Derek King weigh when playing?\n\nDerek King weighed 203 lbs (92 kg) when playing.\n\nIs Derek King in the Hockey Hall of Fame?\n\nDerek King has not been elected into the Hockey Hall of Fame.\n\nHow many goals did Derek King have?\n\nDerek King had 261 goals over his career.\n\nHow many points did Derek King have?\n\nDerek King had 612 points over his career.\n\nHow many Stanley Cups has Derek King won?\n\nDerek King has never won a Stanley Cup as a player.\n\nWhen did Derek King retire?\n\nDerek King last played in 2000."}, {"url": "https://www.eliteprospects.com/player/31677/derek-king", "page_content": "Edit Mode\n\nGo Premium to enter Edit Mode\n\nTake control of your EliteProspects profile! Sign up for EP Premium and verify your profile to access these benefits.\n\n- Ability to add additional data to your career profile: Videos, Images, Social Media, Referrals, Fitness Testing Results and much more!\n\n- Improve your search rank\n\n- Connect directly with players, coaches, teams, scouts and agents (optional)\n\n- Premium Design on your profile page (optional)\n\n- EP Contact Book listing of your profile (optional)\n\n- Verification Badge on your profile\n\nSign up for premium"}, {"url": "https://www.chicagotribune.com/sports/blackhawks/ct-cb-chicago-blackhawks-derek-king-interim-coach-style-20211107-u6frfnrzbzfknclzgngtrogx2e-story.html", "page_content": "Thank you for supporting our journalism. This article is available exclusively for our subscribers, who help fund our work at the Chicago Tribune.\n\nBlackhawks interim coach Derek King stands behind the bench before the third period against the Predators at the United Center on Nov. 7, 2021. (Armando L. Sanchez / Chicago Tribune)\n\nDerek King wore a winter hat on the ice as he surveyed his first morning skate as interim coach of the Chicago Blackhawks from the blue line, and the 54-year-old struck a jarring difference from the 36-year-old Jeremy Colliton scooting around the ice.\n\nKing has a rough act to follow.\n\nAdvertisement\n\nThe Hawks’ 1-9-2 start to Colliton’s fourth season was marked by sometimes listless play, defensive breakdowns and offensive struggles in five-on-five situations.\n\nIn his first news conference with Chicago media Sunday, King didn’t presume that he can suddenly become the savior for a floundering team, but he did share a few points about philosophy and personality.\n\nAdvertisement\n\n“I’ve had people ask me about my style,” King said. “I don’t think I have a style. I just get a feel for the game, feel for the players and I just go with that.”\n\nHere are three things we learned about King on Sunday.\n\n[ Blackhawks interim GM says the search for permanent coach will take place ‘after the season’ ]\n\n1. The conversation with interim general manager Kyle Davidson came out of the blue.\n\nDavidson talked to Hawks CEO Danny Wirtz and Chairman Rocky Wirtz about firing Colliton on Saturday, then called King in Rockford, where the IceHogs were set to host the Grand Rapids Griffins.\n\n“I was in shock,” King said. “I was talking with Kyle and just like, ‘Wow, sure, I’ll do it. Why not, right?’\n\n“I mean, I was in shock. Had a chat with (interim GM) Kyle (Davidson). And I was just like, ‘Wow, OK. Yeah, sure, I’ll do it. Why not?’”—Derek King on being asked to be the Blackhawks interim head coach.\n\n\n\n“But, yeah, I’m nervous, I’m little scared, I’m anxious, I’m excited.” pic.twitter.com/HECrF8MPXj — Phillip Thompson (@_phil_thompson) November 7, 2021\n\n“But, yeah, I’m nervous. I’m a little scared. I’m anxious. I’m excited. There’s a lot of emotions going right now. It was good to get on the ice with the guys this morning, just to get that out of the way.\n\n“We had a couple of meetings, we’ll have another meeting tonight. I’ll be nervous.”\n\n[ Column: The Blackhawks — after firing coach Jeremy Colliton — are in the midst of changes. Now the new leadership team is in the eye of the storm. ]\n\n2. He isn’t ready to make major schematic changes —yet.\n\nThe Hawks have been severely deficient in defensive execution, but King said he’ll need a couple of games to get a handle on their problems.\n\nThrough 12 games, the Hawks were giving up the second-most goals per game at 3.92. Last season they allowed the eighth-most at 3.29.\n\nAdvertisement\n\nKing said he would observe how the defensive zone coverage looks Sunday night against the Nashville Predators.\n\nNew Blackhawks interim head coach Derek King: “The biggest thing for me is the accountability. Go out there work hard, play the game right, don’t cheat it, and we’ll be fine. And if you don’t do that the accountability’s going to kick in. You’re going to hear from me.” pic.twitter.com/vxFSeEQbAW — Phillip Thompson (@_phil_thompson) November 7, 2021\n\nChicago Tribune Sports Weekdays A daily sports newsletter delivered to your inbox for your morning commute. By submitting your email to receive this newsletter, you agree to our Subscriber Terms & Conditions and Privacy Policy >\n\n“I’ve sat up top and watched the games, and it’s easy to pick a game apart up there,” he said. “But when you’re on the bench, talking with these guys, you’ll get a feel for what they’re thinking and see the struggles, if there are any struggles tonight.”\n\nHe said he’ll go over possible solutions with assistant coach Marc Crawford, but “for now, we’re not changing anything.”\n\n“The biggest thing for me is the accountability,” King said. “Go out there, work hard, play the game right, don’t cheat it and we’ll be fine. If you don’t do that, then the accountability is going to kick in — you’re going to hear from me.”\n\n[ Jeremy Colliton is fired as Blackhawks coach after a 1-9-2 start to his 4th season: ‘Our play and competitiveness must improve’ ]\n\n3. He comes off as laid-back — at a time when the Hawks perhaps need it.\n\nColliton was quietly affable once you got to know him, but he could come off as a bit serious at times. He looked like was born in a tailored suit.\n\nKing gives off the tone of a fun uncle — not the crazy fun uncle who sets off fireworks in your backyard but the kind who tells your parents to ease up on you a bit.\n\nAdvertisement\n\n“I try to keep things light,” King said. “I don’t take it too serious. Even as a player, I tried not to get myself worked up too much. Maybe that was a bad thing once in a while, but I want these guys to feel relaxed.\n\n“They’re tight. My personality is going to come in and let them just take a deep breath and get your shoulders dropped and go have some fun and get back to the game we love to play.”"}, {"url": "https://wiki2.org/en/Derek_King", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nCanadian ice hockey player and coach\n\nFor other people named Derek King, see Derek King (disambiguation)\n\nIce hockey player\n\nDerek King (born February 11, 1967) is a Canadian former professional ice hockey left winger who currently serves as an assistant coach for the Chicago Blackhawks of the National Hockey League. King played 14 seasons in the National Hockey League from 1986–87 until 1999–2000.\n\nYouTube Encyclopedic\n\n1 / 5 Views: 3 752 1 829 308 10 507 1 125\n\nBlackhawks' interim head coach Derek King trying to make hockey fun again | NBC Sports Chicago\n\nDerek King 35th goal 1992-93 @NYR\n\nDerek King Named Rockford IceHogs Head Coach\n\nEnrico Ciccone vs Mick Vukota & Ciccone goes after Derek King\n\nBlackhawks beat Predators in Derek King's debut | NBC Sports Chicago Transcription\n\nPlaying career\n\nKing was drafted 13th overall by the New York Islanders in the 1985 NHL Entry Draft. He played 830 career NHL games, scoring 261 goals and 351 assists for 612 points. He was a three-time 30-goal scorer, including one 40-goal season. He scored the last Maple Leafs goal in Maple Leaf Gardens in 1999.[2]\n\nCoaching career\n\nOn August 21, 2009, King was named the assistant coach of the Toronto Maple Leafs AHL affiliate the Toronto Marlies. In 2014, he was promoted to associate coach.[3]\n\nOn July 28, 2015, King was named assistant coach of the Owen Sound Attack of the Ontario Hockey League.[4] However, he left the Attack on October 28, 2015.[5]\n\nOn July 7, 2016, King was named an assistant coach with the Rockford IceHogs of the American Hockey League, the minor league affiliate of the Chicago Blackhawks.[6] On November 6, 2018, King was named the interim head coach of the IceHogs when head coach Jeremy Colliton was promoted to the Blackhawks.[7] King was named the permanent head coach of the IceHogs at the end of the 2018–19 season.[8]\n\nOn November 6, 2021, King was named interim head coach of the Chicago Blackhawks of the National Hockey League to replace the dismissed Colliton, who led the team to a 1–9–2 start to the 2021–22 season.[9]\n\nOn November 7, 2021 King earned his first win as an NHL head coach as the Chicago Blackhawks defeated the Nashville Predators by a score of 2–1 in overtime in his head coaching debut.[10]\n\nOn June 27, 2022, King was replaced as head coach of the Blackhawks by former Montreal Canadiens assistant and longtime NHL defenseman Luke Richardson, but rehired 14 days later as an assistant coach.\n\nCareer statistics\n\nRegular season and playoffs\n\nInternational\n\nYear Team Event GP G A Pts PIM 1992 Canada WC 6 1 1 2 6\n\nNHL head coaching record\n\nTeam Year Regular season Postseason G W L OTL Pts Finish W L Win% Result CHI 2021–22 70 27 33 10 (64) 7th in Central — — — Missed playoffs\n\nReferences"}, {"url": "https://www.sportskeeda.com/football/9-players-featured-manchester-city-aston-villa-premier-league-schmeichel-walker-grealish-delph", "page_content": "Manchester City take on an ever-improving Aston Villa side under Steven Gerrard on Wednesday evening. The Cityzens will look to maintain their hot pursuit of league leaders Chelsea.\n\nCity boast an impressive record versus Villa in recent times, having been unbeaten against them in the league since 2013. However, with a new manager at the helm, Villa’s results already seem to have turned a corner. They have had back-to-back wins against Crystal Palace & Brighton & Hove Albion.\n\nStatCity.co.uk @StatCity\n\n\n\n@ManCity | #ManCity | #AVLMCI 289 - Man City have scored more goals against Aston Villa in all competitions (289) than against any other opponent that they have faced. Bonanza. 289 - Man City have scored more goals against Aston Villa in all competitions (289) than against any other opponent that they have faced. Bonanza.@ManCity | #ManCity | #AVLMCI https://t.co/IisdhIZ3uY\n\nManchester City and Aston Villa have witnessed contrasting fortunes in the past few years. City are a footballing superpower, both at domestic level as well as in Europe. Meanwhile Villa remain focused on re-establishing themselves as a top-half Premier League club.\n\nA similar pattern has emerged in the club’s transfer activities over the past few years, especially since Sheikh Mansour took over Manchester City. Villa have more often than not tended to be a feeder club, selling their prized assets for astronomical fees. One example is the recent sale of Jack Grealish to City for around £100 million.\n\nManchester City @ManCity\n\n\n\nWe are delighted to announce the signing of\n\n\n\nWelcome to City, Jack! 💙\n\n\n\n🔷 #ManCity | mancity.com HE'S HERE!We are delighted to announce the signing of @JackGrealish on a six-year deal.Welcome to City, Jack! 💙 HE'S HERE! We are delighted to announce the signing of @JackGrealish on a six-year deal. Welcome to City, Jack! 💙🔷 #ManCity | mancity.com https://t.co/5Y3gMREmKL\n\nManchester City, on the other hand, tend to sign some of the most talented players in the world.\n\nIn this article, we take a look at some of the players who have represented both clubs in the Premier League era:\n\n#1 Jack Grealish\n\nGrealish became the most expensive signing ever in the Premier League\n\nAston Villa – 2013-2021\n\nManchester City – 2021-Present\n\nJack Grealish is the latest and by far the most expensive entrant on this list to have played for both Manchester City & Aston Villa. Grealish came through the youth academy at Villa Park, having joined the club at the age of six.\n\nHaving been earmarked for success at an early age, Grealish’s Premier League experience got off to a horrific start. In the 2015-16 season, the young Irishman held the ignominy of being a part of a record 16 successive Premier League defeats. It was a campaign which ultimately ended with relegation for Aston Villa.\n\nThe Championship proved to be a blessing in disguise for him. Grealish matured and turned into a leader, leading the club back to the Premier League in 2019. The England international adapted to the rigors of the Premier League like a duck to water. He scored 14 times and set up another 15 goals for his teammates in just two seasons.\n\nHis impressive showing certainly caught the attention of Pep Guardiola, who was convinced to spend £100 million on the Villa winger. He has so far scored one goal and made two assists in the league. Despite an underwhelming start to his City career, Grealish's influence is expected to grow within this current Man City side.\n\n#2 Kyle Walker\n\nWalker spent half a season on loan at Villa in 2011\n\nAston Villa – 2011\n\nManchester City – 2017- Present\n\nManchester City’s current right-back spent six months of his formative professional career on loan at Villa Park. Back in the 2010-11 campaign, Kyle Walker joined the club on loan from Tottenham Hotspur with a view to establishing himself in the league.\n\nThe right-back played 15 times, scoring once and assisting another three. His impressive showing at Villa Park made him a regular starter for Tottenham since the 2011-12 season.\n\nSix years on, Walker’s explosive pace and power convinced Manchester City to shell out £50 million for the right-back in 2017. The Englishman has been a consistent performer for the Blues, racking up close to 200 appearances in a little over four years.\n\nHe has played crucial roles in three Premier League titles, one FA Cup, four League Cups and two Community Shields. He has certainly vindicated the Cityzens' faith in the right back.\n\n#3 Fabian Delph\n\nDelph was a 2-time league winner at Manchester City\n\nAston Villa – 2009-2015\n\nManchester City – 2015-2019\n\nA versatile player, Fabian Delph came to prominence during his time at Villa Park. A combative midfielder and ball carrier, Delph played 134 games, scoring eight goals in front in six seasons at Aston Villa.\n\nSolid performances in the middle of the park earned him an England call-up as well as caught Manchester City’s attentions. He was subjected to an £8 million transfer to the Etihad Stadium at the start of the 2015-16 campaign.\n\nRegular injuries and City’s riches in the middle of the park meant little playing time for Delph in his first two seasons. However, during the 2017-18 season, his versatility came to the fore. He established himself as the first-choice left-back following an injury to Benjamin Mendy. He played an important role in Manchester City’s 100-point Premier League-winning campaign. He played 22 times in the league.\n\nThe midfield currently plies his trade for Everton after leaving the Cityzens in 2019 in search of regular game time.\n\n#4 James Milner\n\nMilner spent 5 successful seasons in Manchester\n\nAston Villa – 2008-2010\n\nManchester City – 2010-2015\n\nOne of the greats & ever-presents of the Premier League era, James Milner continues to go strong at Liverpool, his 5th Premier League club overall.\n\nHe first established himself at Leeds United & Newcastle United. Then a 22-year old Milner made his way to Villa Park for £12 million in the summer of 2008. He played a crucial role in Villa's back-to-back 6th places finishes under Martin O’Neill. He capped the 2009-10 season with the PFA Young Player of the Year Award as well as a place in the PFA Team of the Year.\n\nSuch performances certainly made the Manchester City board take notice. At the start of the 2010-11 season, Milner completed a £26 million move to the Etihad. He joined the likes of David Silva, Yaya Toure & Edin Dzeko in a bid to mount a Premier League title challenge.\n\nAt City, Milner found himself playing mostly on the wings, but his versatility & reliability made him a cult hero in Manchester.\n\nThe five-year stint saw him pick up a fair few trophies. He won the Premier League twice alongside a League Cup & a Community Shield.\n\n#5 Gareth Barry\n\nLike Milner, Barry was a reliable pick for City\n\nAston Villa – 1998-2009\n\nManchester City – 2009-2014\n\nGareth Barry is another Villa player whose impressive form in the middle of the park earned him a move to Manchester City. A defensive midfielder by trait, Gareth Barry spent 12 seasons at Villa Park. He accumulated 441 appearances and scored 52 goals in the process.\n\nAfter a failed move to Liverpool in 2008, Barry joined the Manchester City revolution the following season for a fee of £12 million. The Englishman was a regular presence at the heart of Man City’s midfield. He clocked more than 30 Premier League appearances in all four seasons at the club.\n\nBarry won his first major piece of silverware at the Etihad – the 2011 FA Cup which was followed by the 2011-12 Premier League triumph.\n\nThe midfielder made further appearances for Everton & West Brom before hanging up his boots in 2020. He thereby finished top of the all-time Premier League appearance maker’s list (653).\n\n#6 Joleon Lescott\n\nLescott formed a solid partnership with Vincent Kompany at City\n\nManchester City – 2009-2014\n\nAston Villa – 2015-2016\n\nJoleon Lescott started his career with Wolverhampton Wanderers in the lower divisions of English football. He then gained prominence with Everton in the Premier League.\n\nAs a result, the defender completed a £22 million move to Manchester City in 2009. His no-nonsense style of defending & knack for scoring goals suited City’s ambition as they looked to challenge for silverware.\n\nHe formed a rock-solid partnership at the back with club captain Vincent Kompany. Together they helped Manchester City to their first league title in 44 years, conceding the least number of goals along the way.\n\nThe England international won the FA Cup in 2011 as well as a domestic League & Cup double in 2013-14. That season was also Lescott’s last at the Etihad, falling behind in the pecking order to the likes of Martin Demichelis & Matija Nastasic.\n\nLescott spent one season at West Bromwich Albion before moving to Aston Villa in 2015, the club he supported as a boy. His tenure in the West Midlands turned sour as Villa were relegated from the Premier League for the first time in their history. He played in a side that won just two out of 30 games, conceding 61 goals in the process.\n\n#7 Micah Richards\n\nInjuries cut Richards' career short\n\nManchester City – 2005-2015\n\nAston Villa – 2015-2019\n\nMicah Richards was a hugely promising player whose career got cut short by serious injuries. He came through the Manchester City academy and continued to thrive even after the 2009 takeover.\n\nRichards won the Premier League title with his boyhood club in 2011-12. By then he had already clocked 226 appearances at just 23 years of age. To put this into perspective, the right-back was able to play only 69 more matches in the following seven seasons.\n\nRichards was an integral part of the 2011-12 Premier League-winning campaign. He played 29 times and kept the experienced Pablo Zabaleta out of the team.\n\nAfter spending the 2014-15 season on loan at Fiorentina, the right-back returned to the Premier League, joining a struggling Aston Villa side in 2015. Like compatriot Joleon Lescott, Richards suffered the ignominy of relegation that season.\n\nKnee injuries and a lack of fitness meant Richards could only feature three more times for the West Midlands club. He announced his retirement in 2019, aged just 31. Richards currently features as a pundit for Sky Sports.\n\n#8 Richard Dunne\n\nDunne got voted into the PFA Team of the year in the 2009-10 season\n\nManchester City – 2000-2009\n\nAston Villa – 2009-2013\n\nRichard Dunne was a key figure & a sturdy centre-back who captained Manchester City in the pre-takeover era. The Irishman joined the Cityzens back in 2000 from Everton for £3.5 million.\n\nDunne’s tenure in Manchester got off to a rocky start as the club were relegated in his first season. Fitness issues & disciplinary problems plagued Dunne’s early career in Manchester. However, putting all of that aside, the Irishman became a reliable figure at the back. This was evident as he won Manchester City’s player of the Year for four consecutive seasons from 2005 to 2008.\n\nAfter the arrivals of Kolo Toure & Joleon Lescott in the summer of 2009 following the takeover, Dunne switched to Aston Villa for £5 million. 2009-10 was Dunne’s best season, both from an individual & club standpoint. Villa finished 6th in the league, just three points behind his former club. He kept 15 clean sheets (4th in the league) which led to his selection for the PFA Team of the Year.\n\nAfter three seasons at Aston Villa, Dunne retired in 2015 following a couple of years with QPR.\n\n#9 Peter Schmeichel\n\nPeter Schmeichel ended his glorious career at Man City\n\nAston Villa – 2001-2002\n\nManchester City – 2002-2003\n\nManchester United legend & perhaps their greatest goalkeeper ever, Peter Schmeichel made a swift return to the Premier League in 2001 with Aston Villa.\n\nDespite his advancing years, the 37-year old was the first-choice keeper at Villa. He played 29 times and kept seven clean sheets in the process. In what turned out to be a rare occurrence, the Danish legend scored from a corner against Everton, the 1st Premier League keeper to do so.\n\nAfter a solitary season in the West Midlands, Schmeichel made the switch to the blue half of Manchester. It was his last season of playing professional football.\n\nThe United legend played 29 games for City, keeping another nine clean sheets. Amazingly, he maintained his record of not losing a Manchester derby. The Cityzens beat their bitter rivals 3-1 at Maine Road, followed by a 1-1 draw at Old Trafford in February.\n\nPoll : 0 votes"}, {"url": "https://www.sportszion.com/top-10-defenders-in-barcelona-history/", "page_content": "It is a well-known fact that Barcelona ranks very high when it comes to rating the clubs who have presented us most of the finest footballers to ever step on the pitch. The Camp Nou holds the reputation as the home of the greatest attackers and midfielders in the history of the sport.\n\nHowever, what a lot of people did not know about the Catalan club is that they have a long list of formidable defenders, who, just like their counterparts upfront, can also boast of their contributions to the club’s records.\n\nHere is presenting to you the top 10 defenders that have donned the famous red and blue of Barcelona over time and have been able to achieve a lot of fame and trophies. Moreso, they have incredible performances to back up their claim to be one of the greatest defenders in world football.\n\n#10. Joan Segarra\n\nThis is a player who had made the fifth-most appearances for the Blaugrana. He played a whopping 528 games for Barca. Popularly called “The Great Captain”, Joan was one of the most charming players in Barcelona history.\n\nHe played for Barca between 1949 to 1964 and he was part of the Barca setup that was referred to as Barca of the five cups in the 50s. Even though he played at the back, his shooting was impressive. He scored a couple of goals and was a solid presence at the back.\n\nIt was unfortunate that Barca missed him much in the Shambolic European Cup Final in Berne in 1961 because of an eye injury. After he retired, he still stayed on as Barcelona youth team coach and served as assistant first-team coach in 1979–1980 to Helenio Herrera.\n\n#9. Sigfrid Gracia\n\nThis player spent his entire career that spanned 17 years at the Camp Nou. He played in about 526 competitive matches for the Blaugrana. One of his outstanding qualities is that he was a consistent player for all his coaches. The Barca official website is even quoted as saying that he never played anything less than 50 games per season during his entire stay at the club.\n\nAlthough it was said that he spent his entire career at Barcelona, he had loan spells, but only in a club, neighboring SD Espana Industrial, where he spent about 3 seasons on loan and some parts of two seasons.\n\nOut of his 11 major titles, he won 6 with Barca and scored about 21 goals for the club. Most of the time, he played at left-back, although he did play as center-back once in a while. He retired in 1966 at the age of 34 and died on 23 May 2005, at the age of 73\n\n#8. Antoni Torres\n\nThis player is the one with the eleventh most competitive matches in Barcelona’s history. He played about 497 matches at the Camp Nou. Although he played mainly at the heart of the defense, he sometimes played at right-back.\n\nBefore signing for the Blaugrana, he played for Hercules De Alicante, where he established himself as a central defender. He went on to win 7 major titles at Barca and scored 7 goals. After three years at Barcelona, he got called up to the national team, where he had around five caps between 1968 and 1969.\n\nAfter he retired, he took up coaching. He coached at Barcelona B, Castellon and Hercules. In 1984, he founded a youth football school in Barcelona, TARR Escuella, which is named with the initials of the four founders, all played for Barcelona previously: Torres, Asensi, Rexach, and Rife.\n\n#7. Miguel Bernardo Bianquetti\n\nThe player, nicknamed Tarzan is the record holder for most appearances made for Barcelona. He played an amazing 668 matches for the Catalan club, scoring 30 goals along the way. He also spent almost 20 years with the Blaugrana.\n\nKnown for his immense physical strength, he started his playing with Cadiz in the Spanish Segunda Division between 1970 and 1973, before he was transferred to Barcelona, where he established himself as a regular starter, just after one league game.\n\nIn the final of the European Cup Winners’ Cup in 1979, he played parts of the match with a broken collarbone. In the 1986/87 season, Miguel still managed 41 appearances, even though he was over 30 then. He retired the following season, but not before he added another domestic cup to his trophy cabinet.\n\nAfter retiring, he stayed on as part of the coaching staff under the Joan Gaspart presidency. He was eventually chosen on 17 September 2010, by the chairman, Sandro Rosell, as Sporting Director, alongside Josep Maria Fuste and Carles Rexach.\n\n#6. Michael Reiziger\n\nThe inclusion of Reiziger might come as a surprise to most people because he was not a regular starter, but he was consistent enough to spend seven seasons at the Camp Nou.\n\nHe started his career at AFC Ajax and made his first-team debut at 17 years. During this time, he spent loan spells with FC Volendam and FC Groningen. At Groningen, he scored his career-best goal tally of six goals.\n\nAfter he returned to Ajax, he became a strong defensive machine, before he moved to AC Milan in 1996. He would spend a season at Milan before being shipped to Barcelona, where he had a successful career spanning seven seasons. At Barca, he amassed over 200 appearances, winning back to back La Liga titles between 1998 and 99, Copa Del Rey in 98, and the UEFA Super Cup in 97.\n\nIn 2004, he moved to Middlesbrough, where he only stayed one season or two, before he moved back to PSV Eindhoven, where he ended his playing career, but not before he added another Eredivisie trophy. He is currently the assistant manager at Ajax.\n\n#5. Rafael Marquez\n\nNicknamed El Kaiser, he played as a central defender or defensive midfielder. He is known to be the best Mexican defender and one of the best players in Mexican football history. Before joining Barca, he had plied his trade at Atlas in the Mexican league and at Monaco in the French Ligue 1.\n\nFor the records, he was the first Mexican to ever play for the Catalan giants and he played over 200 games with Barcelona. He became the first Mexican in the UEFA Champions League final and the very first to win the trophy in 2006. He won 12 trophies with Barcelona which included 2 Champions League trophies. He won the UEFA Super Cup and the FIFA Club World Cup also with Barcelona.\n\nAfter he left Baca, he played for New York Red Bulls, Leon, Hellas Verona, before finally returning to his boyhood club, Atlas, where he retired in 2018. Upon his retirement, he was introduced as Atlas’ new sporting president.\n\n#4. Dani Alves\n\nThis is the most decorated player in the history of football with over 40 trophies. He is also the second most decorated defender in European competitions. He has nine European medals, bringing him up equal to Paulo Maldini on the all-time list.\n\nHe plays exclusively as a right-back. Before he joined Barca, he played for Esporte Clube Bahia in the Campeonato Brasileiro Serie A and Sevilla, where he won two UEFA Europa Leagues and a Copa Del Rey.\n\nAt Barca though, being the third most expensive defender of all time, he won the treble of the La Liga, Copa Del Rey, and the Champions League in his first year and in the following season, he won the Supercopa de Espana, UEFA Super Cup, and the FIFA Club World Cup.\n\nHe played over 250 games for the Catalan giants and won 20 trophies with them, which includes six La Liga titles (with three consecutive titles in 2008/09, 09/10, 10/11) and three UEFA Champions League trophies. After leaving Barca, he played for Juventus and Paris Saint Germaine before signing for Brazilian club, Sao Paulo FC as a free agent on 1 August 2019.\n\n#3. Ronald Koeman\n\nWho can believe that a defender can score up to 200 goals? Well, that is what the brilliant Ronald “Tintin” Koeman did. He scored 225 league goals in 647 official league games. Do you really think such a player does not deserve a place as one of the finest defenders for Barcelona?\n\nAt Barca, he scored 106 goals during the six years he spent at the club. He was a specialist when it comes to free-kicks and he was also held in high esteem for his pinpoint long balls, which could assist a goal or start-up an attacking move.\n\nHe rose through the ranks at FC Groningen, before he went on to play for Ajax and PSV, before his ability and defensive prowess brought him to Barca. At the Nou Camp, he went on to win four La Liga titles in a row, from 1991 – 1994. In 1992, he scored the only goal in the European Champions Cup triumph against Sampdoria, gifting Barca her first-ever European success.\n\n#2. Carles Puyol\n\nAffectionately nicknamed “Captain Catalunya”, Puyol spent his entire career at Barcelona, spanning about 15 years. He is the most decorated club captain at Barca. Puyol surpassed Miguel on the Barcelona all-time league appearances, behind only Xavi, on March 2, 2014.\n\nHis successful career at Barca saw him win 21 trophies, with 3 consecutive La Liga titles from 2009 to 2011, 3 Champions League and 2 FIFA Club World Cup, amongst others. He also won some individual awards, like UEFA Club best defender (2006), BBVA Fair Play Award (2012), Golden Foot (2016), and One Club Man award (2018).\n\nHe retired from football on 15 May 2014 and was immediately appointed Assistant Director of Football, which he resigned from in January 2015.\n\n#1. Gerard Pique\n\nPique started his football career at FC Barcelona’s youth system, playing as a defensive midfielder before he joined Manchester United. On 27 May 2008, Pique returned to Barcelona in a £5m deal.\n\nAt Barca, he’s appeared in over 500 games for the Catalunya club and won 28 trophies with the club, which includes three Champions League trophies and eight La Liga titles (including 3 consecutive titles in 2008/09, 09/10, 10/11). He is also a member of the team that won the historic treble of domestic league and cup, and the European cup in 2009 and repeating the feat again in 2015.\n\nHe is a good passer of the ball with good technique and strength. With his height, he is very good in the air. Technically, he is versatile, as he can play in a number of roles, which includes defensive midfield, center-back and as a sweeper too. He has also being called “Piquenbauer” because of his similarity in attributes to the German legend, Franz Beckenbauer."}]}