{"John Burnham was educated at Repton School and at Trinity College, Cambridge.": [{"url": "https://www.historians.org/research-and-publications/perspectives-on-history/october-2017/john-c-burnham-(1929%E2%80%932017)", "page_content": "Historian of American Psychology and Psychiatry\n\nJohn Chynoweth Burnham, professor of history at Ohio State University (OSU) from 1963 to 2002, died on May 12, 2017. Best known for his work in the history of science and medicine and described as “the dean” of his fields by historian Dorothy Ross, John had a reach that far exceeded his fields of scholarly expertise.\n\nJohn was born on July 14, 1929, in Boulder, Colorado. After graduating from West Seattle High School in Washington state (he was proud of his excellent urban public-school education), he accepted a scholarship to Stanford University, where he took his bachelor’s degree. He went “east,” as he put it, to the University of Wisconsin for his master’s degree, after which he returned to Stanford for his PhD (1958). John always talked more about his teachers than his schools. After he informed his seminar students that the course descended directly from Frederick Jackson Turner, he went through the lineage of his teachers and theirs. He taught students never to stop asking questions and searching for answers, and he expected deep research, concise writing, and historiographical significance.\n\nJohn’s own work regularly disrupted traditional historiography, and altogether, he created and enjoyed an enviable career that extended far beyond his retirement. He spent most of his academic career at OSU, but he also taught and held prestigious research fellowships at the universities of Sydney, Cambridge, Chicago, and Melbourne; Stanford and Johns Hopkins universities; Bowdoin College; and numerous other institutions. He was president of the American Association for the History of Medicine (AAHM) from 1990 to 1992 and edited the Journal of the History of the Behavioral Sciences from 1997 to 2000. He lectured internationally, and scholars have published anthologies and held special conferences to celebrate the significance of his pioneering work to their fields. John published 10 monographs and nearly a hundred articles over the course of his career. His last book, Health Care in America (2015), is a masterful history of medical practice in the United States that stands as a fitting culmination of his scholarship.\n\nJohn was deadly serious about his work and historical scholarship generally. He did not suffer fools gladly, and he had a tough, often unreadable shell. He was also kind, generous, and concerned about other people’s happiness. Susan Reverby described him as “an early supporter of young scholars within the AAHM and wherever we turned up to give papers if he was at the same meetings.” James Gilliam, who studied Chinese history at OSU, was John’s teaching assistant during the early 1980s and said that John was “as much or more responsible for my earning my PhD as anyone on my committee.” John and his wife of 59 years, Marjorie Spencer Burnham, always hosted newcomers to the history department soon after their arrival. In 2001, Marjorie founded a history of medicine lecture series for the OSU Medical Heritage Center and the history department. They were also instrumental in the funding of an endowed lectureship in the medical school. When two colleagues died, John located their manuscripts and found people to finish them; both books won prizes.\n\nAs serious as John was about scholarship, he had a wicked and deadpan sense of humor. He could appreciate being the subject of the joke himself. After he told me about the fabulous prize his book After Freud Left (2012) had just won, I asked, “Which prize?” He answered that it was for the cover. (The designer really was brilliant.) Although it might not have been a joke (one could not always tell with John), when it came time to talk with one of his children about sex, John presented him with a two-volume work on sex education and insisted that he would answer any questions his son had once he finished reading it.\n\nJohn will long be remembered not only for his contributions to the history of medicine, psychology, psychiatry, science, technology, and culture, but also for all the ways he supported his university, his profession, and countless individuals in and outside the profession.\n\nStephanie J. Shaw\n\nOhio State University\n\n\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License. Attribution must provide author name, article title, Perspectives on History, date of publication, and a link to this page. This license applies only to the article, not to text or images used here by permission.\n\nThe American Historical Association welcomes comments in the discussion area below, at AHA Communities, and in letters to the editor. Please read our commenting and letters policy before submitting."}, {"url": "https://www.trin.cam.ac.uk/about/historical-overview/", "page_content": "Buildings\n\nThe oldest parts of the College date from the time of King’s Hall, including the range behind the Clock Tower, which are medieval, and the Great Gate, which was built at the beginning of the 16th century. The clock strikes the hour twice, first on a low note and then on a much higher one. The tower once stood about 20 yards from where it is now and was moved to its present site when Great Court was laid out.\n\nMany of the buildings that we see today were built through the efforts of Thomas Nevile, who became Master of Trinity in 1593, including the main features of Great Court and a large part of the beautiful, cloistered court on the side of the Hall that faces the river. Nevile’s Court was completed in the late 17th century when the library designed by Sir Christopher Wren was built. The Wren Library contains many treasures, the oldest of which is an 8th century copy of the Epistles of St Paul. New Court and courts on the other side of Trinity Street opposite the Great Gate were erected in the 19th century. In more recent times, much new building has been completed, including Blue Boar Court and Burrell’s Field.\n\nThe College grew rapidly in importance during the century after its foundation and by 1564 it accounted for about a quarter of the total number of resident members of the University."}, {"url": "https://www.trin.cam.ac.uk/about/historical-overview/in-brief/", "page_content": "Many of the University’s customs and unusual terminology can be traced back to the early years of its long history. To better understand the history of Trinity College it is recommended that you refer to the history of the University of Cambridge for some background information.\n\nKing Henry VIII founded the College in 1546 as one of the very last acts of his life. His interest was in establishing an institution that would produce the future leaders of the reformed church and formed Trinity through the amalgamation of two existing Colleges – King’s Hall and Michaelhouse. King’s Hall had received its charter in 1337 and occupied buildings that are now the northern parts of Trinity’s Great Court. Michaelhouse, founded in 1324 by Hervey de Standon, Chancellor of the Exchequer to Edward II, occupied buildings to the southern parts of Great Court.\n\nFrom the outset Trinity was a much richer society than King’s Hall and Michaelhouse put together. Their joint endowments amounted to less than a quarter of those of Trinity. Most of this endowment was derived from land and endowments that had belonged to dissolved monasteries, but also included small private estates purchased by the King.One of the most notable gifts made by Henry VIII toTrinity was the convent of the Franciscans or Grey Friars, occupying what is now the site of Sidney Sussex College. The stones of the friary were used in the construction of new buildings of Trinity.\n\nSince then, Trinity has received further benefactions from many members and friends wishing to assist its work in education, learning and research, or to help with the preservation and extension of its buildings. It is now the largest college in the University."}, {"url": "https://www.roll-of-honour.com/Cambridgeshire/CambridgeUniversityTinityCollegeWW1.html", "page_content": "CAMBRIDGE UNIVERSITY, TRINITY COLLEGE WORLD WAR 1 WAR MEMORIAL World War 1 - Roll of Honour with detailed information\n\nCompiled and copyright © Gill Cannell & Andrew Dishman 2009 The Cambridge University, Trinity College World War 1 memorial is in the form of Trinity College Chapel at the east end of which, either side of the altar, there are oak panels are engraved with the 619 names of those who died in the First World War. The memorial dedication and inscription is carved on the floor of the pavement, in front of the high altar. [date] indicates date of matriculation.\n\n(1914) indicates those who were admitted for the Michaelmas Term of 1914, but who never actually matriculated.\n\nA date marked with an asterisk denotes that the person to whom the entry refers joined the College in that year by some procedure other than matriculation, e.g. by migration from another College or the non-collegiate body. The extra details here are taken from `The War List of the University of Cambridge, 1914 – 1918’ by G.V. Carey. (Cambridge University Press, 1921.) M denotes those mentioned in despatches.\n\nm denotes mentioned in the Secretary of State’s list for valuable services in connection with the war\n\nMC denotes Military Cross Photographs copyright © Gill Cannell & Andrew Dishman 2009 IUXTA FIDEM DEFUNCTI SUNT OMNES ISTI NON ACCEPTIS REPROMISSIONIBUS\n\nSED A LONGE ASPICIENTES ET SALUTANTES\n\nET CONFITENTES QUIA PEREGRINI ET HOSPITES SUNT SUPER TERRAM. All of these died in faith without having received the promises,\n\nbut from a distance they saw and greeted them.\n\nThey confessed that they were strangers and foreigners on the earth.\n\n(Hebrews 11: 13) In memory of the men of this College who gave their lives in war MCMXIV – MCMXVIII ADAMSON William [1904] Captain, Loyal N. Lancashire Regiment. Killed in action 24 April 1916 ADDY J Carleton [1910] Captain, E. Yorks. Rgt. M.C. Killed in action 3 May 1917 ALBRIGHT Martin C [1905] Major, Worcestershire Yeo. Died 8 Nov. 1917 of wounds received in action ALDERSEY Hugh [1907] Captain, Cheshire Yeo. Killed in action 10 March 1918 ALLEN John E R [1909] Lieutenant, 16th Lancers. M2. Died 8 April 1918 of wounds received in aciion ALLEN Melville R H A [1910] Lieutenant (A.), R.F.C. Killed in flying accident 21 March 1917 ALLOM Charles C G [1914] Captain, Royal Field Artillery. Died 20 Oct. 1917 of wounds received in action 9 Oct. 1917 ANDREWES Charles N [1895] Lieutenant, Labour Corps. Died 29 Nov. 1918 of influenza contracted on active service ANSELL Arthur George [1912] 2nd Lieutenant, Royal Engineers (1st Field Survey Coy.). Died 25 April 1918 of gas poisoning. aged 23. Son of A. J. and E. Ansell, of \"Liscard,\" New Rd., Solihull, Birmingham. Bachelor of Science, Trinity College, Cambridge. Buried in BOULOGNE EASTERN CEMETERY, Pas de Calais, France. Plot VII. Row B. Grave 41. APPERLY Basil L M [1911] 2nd Lieutenant, Queen\u0092s Own (R.W. Kent Regiment.). Died 19 April 1917 of wounds received in action ARMSTRONG Michael Richard Leader [1908] 2nd Lieutenant, Royal Field Artillery and 150th Field Company, Royal Engineers. Killed in action 22 April 1916. Aged 27. Son of Henry Bruce Armstrong and Margaret Armstrong, of Deans Hill, Armagh. B.A. (Mechanical Science Tripos Trinity College, Cambridge). Buried in AUTHUILE MILITARY CEMETERY, AUTHUILLE, Somme, France. Row D. Grave 69. ARNOLD-WALLINGER Geoffrey Seldon Lance Corporal 8778, Inns of Court Officer Training Corps. Died 24 September 1916. Aged 27. Son of Robert Nasmyth Arnold-Wallinger, and Maud Arnold-Wallinger, of Kitts Croft, Writtle. B.A. Trinity College (Cambs); Clerk in Holy Orders. Buried in WRITTLE (ALL SAINTS) CHURCHYARD, Essex. AUSTEN-CARTMELL Arthur James [1912] Lieutenant, 1st Battalion, King\u0092 Royal Rifle Corps. Killed in action 1 June 1916. Aged 23. Son of James Austen-Cartmell (Barrister-at-Law), of 27, Campden House Court, Kensington, London, and the late Mary Aflleck Austen-Cartmell. Educated at Eton and Trinity College, Cambridge. Buried in CABARET-ROUGE BRITISH CEMETERY, SOUCHEZ, Pas de Calais, France. Plot XV. Row M. Grave 12. BACKHOUSE Hubert E [1901] Captain, Sherwood Foresters (Notts. and Derby Regiment.). Killed in action 15 Oct. 1916 1916 BACKUS Arthur R [1913] Captain, Rifle Brigade. M.C. Accidentally killed near Neuve Eglise 22 Sept. 1917 BAINBRIGGE Philip G [1909] 2nd Lieutenant, Lancashire Fusiliers.; attd. Welsh Regiment. Killed in action 18 Sept. 1918 BALFOUR John [1913] Captain, Scots Guards.; attd. Royal Engineers. (Signals). M.C. M. Killed in action 21 March 1918 BALLAMY Harold W [1912] Lieutenant, Royal Field Artillery. (T.F.). Killed in action 15 Aug. 1917 BALLANCE Leslie A [1907] 2nd Lieutenant, London Regiment. (Civil Service Rifles); Captain, King\u0092s Royal Rifle Corps. Killed in action 28 Sept. 1916 BARBER-STARKEY William Henry J [1898] Captain, Royal Field Artillery. Died in German hands 10 Sept. 1914 of wounds received in action at Le Cateau 26 Aug. 1914 BARCLAY Thomas H [1902] Major, Surrey Yeo. Silver Medal for gallantry in saving life at sea. Drowned on H.M. transport Transylvania 4 May 1917 BARKBY Hartley No further information currently BARNSLEY T Kenneth [1911] Captain, R. Warwickshire Regiment. and Coldstream Guards. Killed in action 31 July 1917 BARTHROPP Sidney A N S [1910] 2nd Lieutenant, R. Sussex Regiment. Killed in action at Cuinchy 29 Jan. 1915 BATLEY Ralph C [1881] T.D. Major, Dorset Yeo. Died 23 Oct. 1917 BEALEY Adam C [1892] Captain, Somerset L.I. M.C. M. Died 22 Nov. 1917 of wounds received in action in Palestine BEAUMONT-NESBITT Wilfrid Henry [1913] Captain Grenadier Guards. M.C. Killed in action at Bourlon Wood 27 Nov. 1917 BECHER Maurice A N [1903] Captain, King\u0092s Own Scottish Borderers. Killed in action in Gallipoli 26 April 1915 BEDELL-SIVEWRIGHT David Revell [1899] Surgeon, R.N. Died in Gallipoli 5 Sept. 1915 BEER Arthur H [1913] Lieutenant, Royal Field Artillery. (T.F.). M.C. M. Died 21 Aprl 1918 of wounds received in action at Bethune 19 April 1918 BELL Edward V No further information currently BELL Gawain M [1896] Major, Hampshire Regiment. D.S.O. M. Killed in action in the Third Battle of Ypres 31 July 1917 BELL John James [1891] Major, Ayrshire Yeo. Died 2 March 1915 BELL William H D [1902] Captain, N. Zealand Force and K. Edward\u0092s Horse. M. Killed in action 31 July 1917 BELLEW Richard C No further information currently BENTINCK Henry D A [1899] Major, Coldstream Guards. Brevrt Major. M. Died 2 Oct. 1916 of wounds received in action 15 Sept. 1916 BETHELL Christopher [1904] Captain King\u0092s Own (Yorkshire Light Infantry. Killed in action 20 February 1916. Aged 31. Son of Col. E. H. Bethell, of 18, Hyde Park Square, London, W.2., and the late Mrs. Bethell. Barrister-at-Law of the Inner Temple. Mentioned in Despatches. Buried at CITE BONJEAN MILITARY CEMETERY, ARMENTIERES, Nord, France. Plot IX. Row F. Grave 81. Extracted information, sources: Truth, 1 March 1916 p.340, Yorkshire Post and Leeds Intelligencer, 16, 28 February 1916, 2 March 1916. Researched by Jonathan Vernon: Born 27 Dec 1884 Kirkee, Poonah, Bombay, India second son of Edward Hugh Bethell DSO, retired Colonel R.E. and mother Gertrude and grandson of the late Mr William Froggatt Betheel, or Rise Park, and Watton Abbey, Yorkshire. Of 18 Hyde Park Square, Middlesex Educated at St. Andrews College, Grahamstown, South Africa where he had a distinguished academic career graduating with honours and from 25 June 1905, Trinity College, Cambridege being President of the Cambridge Union and graduated with honours. Lawyer 1908. After leaving the university he was called to the Bar but never practiced, as he gave up his time to philanthropic work at Cambridge House, Camberwell. When war broke out he enlisted in the Coldstream Guards, and after three month’s training accepted a commission in the 10th King’s Own Yorkshire Light Infantry (KOYLI). He was promoted to Captai in August 1915. Mentioned in despatches. He was was serving with the corps in Flanders when he was killed on 20 February aged 31. Colonel Bethell’s remaining sons were both serving on active service in France. Major Hugh Keppel Bethell, 7th Hussars, commandings the 1st Northamptons (survived the war, rose to the rank of Colonel, died 3 March 1947 on his farm in Kenya), and Lieut. David Bethell in the Scots Guards. Colonel Bethel, then commanding Royal Engineers at Plymouth was about to take up an appointment in France. Extract from Driffield Times - Saturday 4 March 1916, page 2: RISE Capt. Christopher Bethell, 10th K.O.Y.L.I, is announced to have been killed in Flanders February 20tb. Aged 31 years, he was the second son of Colonel E. H. Bethell, D.S.O. R.E. and grandson of the late Mr. William Froggart Bethell, of Rise Park, and Watton Abbey. Yorkshire. He was educated at Malvern College, Grahamstown, South Africa, and Trinity College, Cambridge, where be was president of the Union and graduated with honours. Although he was called to the Bar, he for some years devoted his time and energies to philanthropic work at Cambridge House, Camberwell. When the war commenced he enlisted in the Coldstream Guards, and three months later accepted a commission id n the K.O.Y.L.I., being promoted Captain in August last. Capt. Bethell's Colonel writes. “His loss is irreparable, and he was the most self-sacrificing and bravest of men.” Colonel's Bethell’s remaining sons are both on active service in France. Extract from Yorkshire Post and Leeds Intelligencer - Saturday 26 February 1916, page 6 and Beverley and East Riding Recorder - Saturday 4 March 1916, page 5: CHRISTOPHER BETHELL, 10th K.0.Y.L.I. , is announced to have been killed in Flanders February 20. Aged 31 years, he was the second son of Colonel E. H. Betbell, D.5.O.. R.E., and grandson of the late Mr. William Froggatt Bethell, of Rise Park, and Walton Abbey, Yorkshire. He was educated at Malvern College, Grahamstown, South Africa, and Trinity College, Cambridge, where he was president of the Union and graduated with honours. Although lie was called to the Bar, he for some years devoted his time and energies to philanthropic work at Cambridge House. Camberwell. When the war commenced he enlisted in the Coldstream Guards, and three months later accepted a commission in the K.O.Y.L.I. being promoted to captain August last. Capt. Bethell’s Colonel writes: '\"His loss is irreparable, and he was the most self-sacrificing and bravest of men.\" Colonel Bethell's remaining sons are both on active service in France. Major Keppel Bethell, 7th Hussars, commands the 1st Northamptons, and Lieut. David Bethell is in the Scots Guards. Colonel Bethell, now commanding Royal Engineers at Plymouth, is about to take up an appointment in France. BINNING Lord George [[1876] C.B., M.V.O. Lieutenant-Col., Lothian and Border Horse; Brig.-Gen. Died 12 Jan. 1917 of pneumonia BION Rupert Euston [1910] Lieutenant, 20th Hussars; Lieutenant (A.), Royal Air Force. Killed in action 9 April 1918 BIRKBECK George [1913] Lieutenant, Norfolk Yeo. Died 19 Feb. 1916 BIRKBECK Gervase W [1905] Captain, Norfolk Regiment. (T.F.). M. Killed in action 19 April 1917 BLACK Donald C [1916] 2nd Lieutenant (A.), F.A.F. Killed in flying accident 23 April 1918 BLAKE George P [1898] Captain, R. Welsh Fusiliers. Killed in action 20 July 1916 BODENHAM Henry Edward C H [1914] 2nd Lieutenant, Black Watch; Lieutenant, M.G.C. Killed in action on the Somme 7 Sept. 1916 BOLITHO Geoffrey R [1911] 2nd Lieutenant, Devon Regiment. and R.F.C. Died 25 Oct. 1916 of wounds received in action BOLTON William S [1904] Sergt., R. Fusiliers (Sportsman\u0092s Bn.). Died 7 Feb. 1919 of pneumonia contracted on active service BOND Charles Gordon [1900] Captain, 2nd Battalion, Duke of Edinburgh's (Wiltshire Regiment). Killed in action 25th November 1915. Aged 34. Born 18th July 1881 in Savernake, Wilthsire. Son of the Rev. Gordon Bond, of Savernake, Wiltshire; husband of Dorothy Melian Bond, of Thistledown, Bude, Cornwall. Educated at Sherborne Collge and Cambridge University. Entered Military Service from University 1903. Height 5 feet 10½ inches. Buried in GUARDS CEMETERY, WINDY CORNER, CUINCHY, Pas de Calais, France. Plot II. Row G. Grave 6. See also Lords MCC World War 1 BONHAM-CARTER Arthur Thomas [1887] S. African Defence Force; Captain, Hampshire Regiment. m. Killed in action 1 July 1916 BONVALOT Edward St L [1910] 2nd Lieutenant, Coldstream Guards. Killed in action 9 Oct. 1915` BOSCAWEN Hon Vere D [1909] 2nd Lieutenant, Coldstream Guards. Killed in action near Ypres 29 Oct. 1914 BOWEN-COLTHURST Robert Macgregor [1902] Captain, Leinster Regiment. Killed in action 15 March 1915 BOWES-LYON Gavin P (1914) Lieutenant, Grenadier Guards. Killed in action 27 Nov. 1917 BOYD Harold A [1913] 2nd Lieutenant, R. Inniskilling Fusiliers. Killed in action 7 Sept. 1914 BRADSHAW Percival C [1914] 2nd Lieutenant, King\u0092s Own Scottish Borderers. Killed in action 1 May 1916 BRADSHAW Richard Edward K [1914] Lieutenant, London Regiment. (Rangers). Killed in action 1 July 1916 BRADSHAW W Douglas [1915] 2nd Lieutenant, Royal Field Artillery. Killed in action 31 Oct. 1916 BRAGG Robert C [1912] 2nd Lieutenant, Royal Field Artillery. Died 2 Sept. 1915 of wounds received in action in Gallipoli 1 Sept. 1915 BREESE William L [1902] 2nd Lieutenant, R. Horse Guards. Killed in action 14 March 1915 BREUL Oswald G F J (1914) Lieutenant, Royal Engineers. (Signals). M.C. Died on active service 16 Oct. 1917 BROADBENT Cecil H [1900] 2nd Lieutenant, King\u0092s Own (Yorkshire L.I., T.F.). Died 1 March 1916 of injuries received in bombing accident BRODIE Ewen James [1896] Captain, Cameron Hdrs. Killed in action 11 Nov. 1914 BROWNE Charles P [1905] Captain, Corps of Guides, Indian Army. Killed in action 11 April 1915 BROWNE Montague B [1894] 2nd Lieutenant, Sherwood Foresters (Notts. and Derby ;Regiment., T.F.). Died 30 April 1916 of wounds received in the Irish Rebellion BRUDENELL-BRUCE James Ernest J [1897] Lieutenant, Northamptonshire Yeo. Died 11 April 1917 of wounds received in action BRUNTON Edward H P [1907] Lieutenant, R.A.M.C. Killed in action 8 Oct. 1915 BUCHANAN Arthur N [1903] Lieutenant (T.), Royal Air Force.Died 14 Oct. 1918 of pneumonia BUCKLAND Thomas A [1911] Lieutenant, Norfolk Regiment. M. Died 18 Oct. 1915 of wounds received in action 13 Oct. 1915 BUDENBERG Donald H [1915] Captain, Manchester Regiment. Killed in action near Voormezeele 25 April 1918 BULLIVANT Ritchie P [1902] Captain, London Yeo. (Middlesex Hussars). M.C. Killed in action 24 Sept. 1918 BURNABY Geoffrey [193] Lieutenant, London Regiment. (R. Fusiliers.). Died 23 Oct. 1916 of wounds received in action BURNAND Cyril F [1910] 2nd Lieutenant Grenadier Guards. Killed in action 11 March 1915 BURRELL Raymond F T [1908] 2nd Lieutenant, Queen\u0092s Own (R.W. Kent Regiment.) Killed in action 26 Sept. 1915 BUTCHER W Guy D [1910] Captain, London Regiment. (L.R.B.). Killed in action at Glencorse Wood 16 Aug. 1917 BUTLER Gordon Kerr Montagu [1910] Lieutenant, 2nd Scottish Horse [Territorial] attached Machine Gun Corps. Died on service in Egypt 17 July 1916. Aged 23. Baptised 12 December 1891 at Cambridge, All Saints, son of Henry Montagu and Agnata Frances Butler, of Trinity Lodge, Trinity College, Cambridge. Son of H. Montagu Butler and Agnata F. Butler, of Trinity Lodge, Cambridge. Educated 1905-1910 Harrow School, Harrow, Middlesex, son of Dr H M Butler. Buried in KANTARA WAR MEMORIAL CEMETERY, Egypt. Plot C. Grave 18. See also Cambridge, St Faith's School and also Cambridge Guildhall Extract from England & Wales Government Probate Death Index 1917: BUTLER Gordon Kerr Montagu of Trinity Lodge Cambridge lieutenant in Scottish Horse died 17 July 1916 in Egypt Administration Peterborough 15 January to the reverend Henry Montagu Butler trinity college master.\n\nEffects £390 13s. 11d. BUTLER J Ormonde No further information currently BUTLER William Martin [1901] Major, 1st Siege Company Royal Monmouthshire, Royal Engineers. (T.F.). Died 5 March 1919. Aged 36. Son of Arthur John and Mary Caroline Butler, of Woodend, Weybridge, Surrey, husband of Enid Butler. Educated at Eton and Trinity College, Cambridge. A civil engineer. Buried in VALENCIENNES (ST. ROCH) COMMUNAL CEMETERY, Nord, France. Plot II. Row C. Grave 20. BUTLIN Sir H Guy T , Bart [1911] Captain, Cambridgeshire Regiment. M. Killed in action 16 Sept. 1916 BUXTON Andrew R [1898] Captain, Rifle Brigade. Killed in action 7 June 1917 BUXTON Jocelyn Murray Victor Second Lieutenant, 6th Battalion, Rifle Brigade attached 25th Company, Machine Gun Corps (Infantry). Died 1 July 1916. Aged 20. Son of the late Sir T. F. Victor Buxton, 4th Bart., and of Lady Buxton, of \"Warlies\", Waltham Abbey, Essex. Educated at Broadstairs and Marlborough. Gained a History Exhibition at Trinity College, Cambridge. No known grave. Commemorated at THIEPVAL MEMORIAL, Somme, France. Pier and Face 16 B and 16 C. CAMPBELL Islay M (1914) Lieutenant, Sussex Yeo.; attd. R. Sussex Regiment. Died 4 April 1918 of wounds received in action CAMPBELL John A [1897] Lieutenant, 6th (Inniskilling) Dragoons. Died in Germany 2 Dec. 1917 of wounds received in action CAMPBELL-JOHNSTON Patrick Seymour C [1913] Leiut., Royal Field Artillery.; A.D.C. M.C. Belgian Croix de Guerre. Died 30 Aug. 1919 of wounds received in action 21 May 1918 CARLESS Hugh D No further information currently CARLILE E H Hanbury [1899] Captain Hertfordshire Yeo.; attd Hertfordshire Regiment. Killed in action 22 March 1918 CARVER Oswald Armitage [1905] Captain, 1st/2nd (East Lancashire), Royal Engineers. Died of wounds 8 June 1915. Aged 28. Son of Oswald William and Kate Carver, of Holmes Chapel, Cheshire; husband of Elizabeth A. N. (nee Hobart) Carver, of West Runton House, West Runton, Norfolk, married 1911 in Tonbridge, Kent; brother of Basil (below). Educated Charterhouse, Surrey. Employed by The Hollins Mill Co. Ltd. of 5, Portland Street, Manchester, appears on their Roll of Honour. In the 1891 census he was aged 4, born Cheshire, resident with his parents at Rose Hill House, Stockport Road, Marple, Stockport, Cheshire. In the 1901 census he was aged 14, born Marple, Cheshire, a boarder at Charterhouse School, resident Hindhead Road, Godalming, Surrey. Buried in LANCASHIRE LANDING CEMETERY, Turkey (including Gallipoli). Section A. Grave 7. See also Horton School, Northill and Charterhouse School, Surrey Extract from The Times (London, England), Tuesday, August 29, 1916; pg. 4; Issue 41258 : SECOND LIEUTENANT BASIL ARMITAGE CARVER, Dragoons, youngest son of W.O. and Mrs. Carver, Cranage Hall, Holmes Chapel, Cheshire, died of mine gas poisoning on August 21, being overcome while endeavouring to rescue some engineers in a tunnel. He was at Horton Preparatory School, Charterhouse, and for a short time at Sandhurst when war broke out, and he obtained his commission a few weeks before his 18th birthday. Extract from Nantwich Guardian - Friday 18 June 1915, page 5: CAPTAIN O. A. CARVER\n\nMEMBER OF WELL-KNOWN\n\nCHESHIRE FAMILY KILLED Captain Oswald Artmitage Carver East Lancashire Royal Engineers (Territorial Force), who death in action in the Dardenelles was recorded on Tuesday, was born in 1887. He was the second son of Mr. W.O O. Carver and Mrs. Carver of Cranage Hall, Holmes Chapel. He was educated at Tanllwyfan, Colwyn, Horton School, Charterhouse, and Trinity College, Cambridge. He rowed for Cambridge in the inter-Univeristy race of 1908, and also for the 'Varsity in the Olynmpic Games the samke year. He married Elizabeth Adah Noel Hobart, daughter of Mr. Robert Hobart, of Tunbridge Wells, whom he leaves a widow and two children. Captain Carver lived at Marple, and was a director of the Hollins Mill Company, Limited, Manchester. Much sympathy is felt with Mr. and Rms. W. O. Carver and family in their sad bereavement. CASTLE Tudor R [1901] Private, R. Fusiliers (P.S. Bn.; 2nd Lieutenant, The Queen\u0092s (Royal West Surrey Regiment.). Killed in action 31 Aug. 1916 CAVENDISH Lord John Spencer [1893] D.S.O. Major, 1st Life Guards. Killed in action 20 Oct. 1914 CAY Albert Jaffray [1898] Lieutenant, Worcestershire Yeo. Killed in action 23 April 1916 CAZALET Edward [1913] 2nd Lieutenant, The Buffs (E. Kent Regiment.) and Welsh Guards. Killed in action 10 Sept. 1916 CHADWICK James H [1907] Private, R. Fusiliers (P.S. Bn.); Lieutenant-Col., Manchester Regiment. D.S.O. Killed in action 4 May 1917 CHAMBERLAIN Eric D [1912] 2nd Lieutenant, Loyal N. Lancashire Rgt. Killed in action 30 Nov. 1917 CHANCE Edward Seton [1900] Captain (Brevet Major), 2nd Dragoon Guards (Queen's Bays) attached as Commanding Officer, 6th Battalion, Leicestershire Regiment. Killed in action 29 May 1918. Aged 36. Born 23 June 1881 in Carlisle. Son of Frederick William (now Sir Frederick Chance, K.B.E.) and Mary Seton Chance, of Morton, Carlisle. Member of Charterhouse Football Eleven 1899-1900. Height 6 feet 1½ inches. Unmarried. In the 1901 census he was aged 19, born Carlisle, Cumberland, an Undergraduate at Trinity College, Cambridge, visiting The Knoll, Barnards Green, Malvern Common, Guarlford, Upton on Severn, Worcestershire. No known grave. Commemorated on SOISSONS MEMORIAL, Aisne, France. See also Charterhouse School, Surrey From the Charterhouse Register, Oration Quarter 1895: Chance , Edward Seton. b. 23 June, 1.881. (Verites); Football XI, 1899-1900; Left C.Q., 1900. Trin. Coll., Camb.-Joined R. Welsh Fusiliers, 1903. E. S. Chance, Esq., Morton, Carlisle CHANCE Eustace George St Clair No further information currently CHAPMAN Wilfrid H [1898] Captain, Yorkshire Regiment. Killed in action in Gallipoli 7 Aug. 1915 CHARLES J Arthur M [1908] 2nd Lieutenant, King\u0092s (Shropshire L.I.). Died 10 Feb. 1915 of wounds received in action 23 Oct. 1914 CHICHESTER William George Cubitt [1911] Lieutenant, London Regiment. (R. Fusiliers.). Killed in action 15 Sept. 1916 CHURCHILL W Maurice [1901] Major, 12th Cavalry, Indian Army. M. Order of St Anne, 3rd Class (Russia). Died 4 Nov. 1918 of pneumonia CLARK Eric Foster (1914) Lieutenant, The Buffs (E. Kent Regiment.); attd. R.F.C. Killed in action 1 Jan. 1917 CLARK-KENNEDY Alexander K [1902] Captain, King\u0092s Own Scottish Borderers (T.F.). Killed in action 19 April 1917 CLIFTON Hubert E [1910] 2nd Lieutenant Devon Regiment. M.C. Died 4 Oct. 1916 of wounds received in action 23 Sept. 1916 CLISSOLD Harry [1889] Major, Royal Engineers. (T.F.). D.S.O. M2. Killed in action 28 Sept. 1917 CLOSE-BROOKS Arthur Brooks [1903] Captain, Manchester Regiment. M.C. M. Died 10 Jan. 1917 of wounds received in action CLOSE-BROOKS John C [1895] Lieutenant, Life Guards. Killed in action 30 Oct. 1914 CLOUGH Alan (1914) Captain, W. Yorks Regiment. Killed in action 1 July 1916 COCKERELL Samuel Pepys [1898]Old Etonian. Lieutenant (Pilot), Egypt Detachment, Royal Flying Corps. Died of smallpox at Ismailia 20th March 1915. Aged 34. Son of the late William Acland Cockerell and Sidney Ada Cockerell. Left Eton College in 1898. Member of the Cambridge University Boat Race Team of 1900. Former Commercial Attache to Spain and Portugal. In the 1911 census he was aged 31, born 20 Gloucetser Place, London, a Financier, resident Chesham Mans Pont Street, Borough of Chelsea, Chelsea, London & Middlesex. Buried in ISMAILIA WAR MEMORIAL CEMETERY, Egypt. Section A. Grave 117. See also the Stock Exchange memorial and Lords MCC World War 1 COCKS Willard F [1911] Lieutenant, Lincolnshire Regiment. Died 9 April 1917 of wounds received in action COOK Frank R [1915] Lieutenant, E. Yorks. Regiment. and R.F.C. Killed in flying accident 22 Feb. 1918 CORNISH Charles L [1905] Lieutenant, Highland L.I. Killed in action 13 Nov. 1914 CORRY Frederick H L [1908] Lieutenant, Royal Field Artillery. Died 30 Sept. 1915 of wounds received in action 25 Sept. 1915 COWPER Geoffrey M [1908] Captain, R.A.M.C. M. Died 3 Oct. 1918 of wounds received in action COX Derek Percy (1914) 2nd Lieutenant, R.FC. Killed in action 21 Aug. 1917 CRAWLEY Eustace [1886] Major, 12th (Prince of Wales's Royal) Lancers. Killed in action 2nd November 1914. Aged 46. Born 19th April 1868, Highgate, Middlesex. Son of the late Baden Crawley; husband of Lady Violet Crawley (nee Finch), of 5, Lancaster Gate Terrace, London, W. Played cricket for Cambridge University 1887-1889. No known grave. Commemorated on YPRES (MENIN GATE) MEMORIAL, Ieper, West-Vlaanderen, Belgium. Panel 5. See also Lords MCC WW1 Extract from Du Ruvigny's Roll of Honour: CRAWLEY, EUSTACE, Major, 12th (Prince of Wales's Royal) Lancers, 3rd s. of the late Baden Crawley; b. 16 April, 1868; educ. Harrow; gazetted 2nd Lieut. 12th Lancers, from the Militia, 7 Aug. 1889; promoted Lieut. 7 Jan. 1891, Capt. 17 Nov. 1897, Brevet Major 29 Nov. 1900, and Major 29 July, 1905; was A.D.C. (extra) to the Lord Lieutenant, Ireland, from 19 Feb. 1894, to 8 July, 1895; took part in the operations in Sierra Leone 1898-99 (Medal with clasp); served in West Africa 1898, where he was in command of the Expedition to Bula; in the South African War 1899-1902, as Special Service Officer, being afterwards employed on the Staff; took part in the advance on Kimberley, including action at Magersfontein and the Relief of Kimberley; operations in Orange Free State Feb. to May, 1900, including actions at Paardeberg, Poplar Grove, Dreifontein, Houtnek (Thoba Mountain) and Zand River; operations in the Transvaal May and June, 1900, including actions near Johannesburg and Diamond Hill; operations in the Transvaal, west of Pretoria, July to 29 Nov. 1900; operations in the Orange River Colony May to 29 Nov. 1900, Including actions at Lindley, Bethlehem and Wittebergen, and those in Cape Colony Aug. 1901, to 31 May, 1902 (mentioned in Despatches [London Gazette, 10 Sept. 1901]; brevet of Major; Queen's Medal with four clasps and King's Medal with two clasps); served in West Africa (Northern Nigeria) 1903; took part in the Kano-Sokoto Campaign (Medal with clasp), and in the operations in the district to the east of Zaria, being in command; was D.A.A.G. India, from 17 April, 1909, to 16 April, 1913; served with the Expeditionary Force in France and Flanders, and was killed in action near Ypres 2 Nov. 1914. He in. 14 Dec. 1904, Violet Ella, elder dan. of Charles Wightwick Finch, 8th Earl of Aylesford. Extract from The Bond of Sacrifice Volume 1: MAJOR EUSTACE CRAWLEY, 12th (PRINCE OF WALES'S ROYAL) LANCERS , who was killed near Ypres on the 2nd November, 1914, was born on the 16th April, 1868, third son of the late Baden Crawley. He was educated at Harrow, and joined the 12th Lancers from the Militia becoming Lieutenant in 1891, and Captain in November, 1897. Major Crawley saw much active service. In 1898-99 he took part in operations at Sierra Leone, West Coast of Africa, for which he received the medal and clasp. Again, in 1899 he was in command of the Bula Expedition in Nigeria, being mentioned in Despatches by General Wilcox, in December, 1899. He commanded the Nigeria Company Constabulary from the latter date. In 1900-02 he was appointed a Special Service Officer in the South African War; was D.A.A.G. Ridley's Corps of Mounted Infantry from April to December, 1900; took part in General Ian Hamilton's march, being present at the actions of Diamond Hill, Johannesburg, and Wittebergen; and also at operations in Cape Colony under General French; he was Intelligence Officer to Capper's Column at the end of 1901, and Staff Officer to Doran's Column from December, 1901, to May, 1902. For his services he was mentioned in Despatches by Lord Roberts, 4th September, 1901, given the Brevet rank of Major from November, 1900, and received the Queen's medal with four clasps, and the King's medal with two clasps. From May to November, 1902, he was D.A.A.G. on the staff of Colonel Hickman, commanding the troops at Middelburg, Cape Colony. In 1902-03 he again saw service in Nigeria, being in command of a column in the Kano Expedition, for which he received the medal and clasp. In 1903 he commanded Mounted In-fantry, in India, and obtained the substantive rank of Major in July, 1905. In 1906-07 he was officiating Brigade-Major of the Amballa Cavalry Brigade and to the Inspector-General of Cavalry in India. Major Crawley married, in December, 1904, Lady Violet Ella Finch, elder daughter of the eighth Earl of Aylesford. His profile from Cricinfo CREWDSON Theodore Wright [1914] Captain, Manchester Regiment.; A.D.C. Died 6 Nov. 1916 of wounds received in action 28 Oct. 1916 CRISPIN Hugh T [1887] Lieutenant-Col., Northumberland Fusiliers. and R. Sussex Regiment. M. Killed in action 30 Oct. 1914 CROFT John Arthur Christopher Second Lieutenant, 4th Battalion, Royal Warwickshire Regiment attached to 2nd Battalion, Duke of Wellington's (West Riding Regiment). Killed in action 18 April 1915. Aged 27. Born 15 April 1888. Son of Henry Herbert Stephen and Emma Croft, of Sussex Square, Brighton. No known grave. Commemorated on YPRES (MENIN GATE) MEMORIAL, West-Vlaanderen, Belgium. Panel 8. See also Charterhouse School, Godalming, Surrey Extract from Bond of Sacrifice: Officers Died in the Great War 1914-1916, volume 2, page 110-111: 2nd LIEUTENANT JOHN ARTHUR CHRISTOPHER CROFT, 4th BATTN. (EXTRA RESERVE) ROYAL WARWICSHIRE REGIMENT, attd. 2nd BATTN. THE DUKE OF WELLINGTON (WEST RIDING REGIMENT), was the youngest son of Henry Herbert Stephen Croft, barrister-at-law, Recorder of Tenterden, and was born at 28, Royal Crescent, London, on the 15th April, 1888. He was educated at Charterhouse and Trinity College, Cambridge. He was an international hockey player, Blackheath Club, champion of the Thames Punting Club, 1912, and a member of the New University Club, St. James's Street, London. He was gazetted to the Royal Warwickshire Regiment, in August, 1914, and trained with it in the Isle of Wight. In November, 1914, he was attached to the West Riding Regiment, and served with it in the trenches in France till April, 1915. He was killed on the 18th of the latter month in the first attack on Hill 60, near Ypres, \"while \"—in the words of his Commanding Officer— \"leading his men with the greatest bravery in the successful charge on Hill 60 on Sunday last. We have lost a most capable and gallant officer and charming friend whose place it will be hard to fill.\" CROPPER John [1883] Captain. Born 17th September 1864, 2nd son of Edward and Theodosia Cropper, of Fearnhead, Great Crosby; husband of Anne Ellen Cropper, of Mount Ballan, Chepstow, Mon. He was at Charterhouse [H] 1878 - 1883. He went up to Trinity College, Cambridge. He qualified in medicine and worked for a time at a medical mission in Acre. In the Great War he was commissioned into the R.A.M.C. He was drowned in the sinking of the Britannic on 21st November 1916. The wreck is now designated an official war grave. He is commemorated on the Mikra Memorial, outside Salonica. See also Charterhouse School, Godalming, Surrey Note: Britannic, built by Harland and Wolff in Belfast for the White Star Line and launched in 1914, was a sister ship to the Titanic. During the Great War she served as a hospital ship. She sank in 55 minutes after hitting a mine 4 miles off the Greek island of Kea, on her way back to Lemnos from Southampton via Gibraltar and fortunately empty of passengers. 30 lives were lost, many of these when two lifeboats, prematurely launched, drifted into the still-turning propellers, 1,036 were saved. From the Charterhouse School Register, Oration Quarter 1878 : Cropper, John. b. 17 Sept., 1864. (Hodgsonites); Left C.Q., 1881. Trin. Coll., Camb.; M.A.; St. Bartholomew's Hospital; M.D.; B.C.-C.M.S., Medical Mission, Acre, Palestine, 1895-1901. J. Cropper, Esq., M. D., Mount Ballan, Chepstow. Extract from Kington Times - Saturday 2 December 1916, page 5 : LOST IN THE BRITTANIC. Captain Cropper, who lost his life in the sinking of the Britannic, was a brother of Mrs. Probyn, wife of the Rev. H. E. H. Probyn, Vicar of Kington. CROSSE Edward A W No further information currently CROSSLEY Brian [1904] Lieutenant, Highland L.I. M. Killed in action 18 May 1915 CROWE Hugh Barby [1912] Lieutenant, R. Fusiliers. Drowned on H.M. transport off Gallipoli 28 Oct. 1915 CUNNINGHAM James Michael [1897] Captain, Suffolk Regiment. Died 28 March 1918 of wounds received in action CLARKE William ???? No further information currently CUNNINGHAM James S [1904] Sergt., R. Highlanders, Canadian Force. Killed in action 31 Oct. 1916 CURRIE Richard F I [1899] Lce.-Corpl., R. Fusiliers. Killed in action 15 July 1916 DAFFARN Maurice [1906] 2nd Lieutenant, N. Rhodesian Police. Killed in action in Rhodesia 24 April 1915 DART Hugh [1900] Private, Middlesex Regiment. (P.S. Bn.); Captain and Adjt., York and Lancaster Regiment. Died 2 July 1916 of wounds received in action DARWIN Erasmus [1901] Second Lieutenant 4th Battalion, Yorkshire Regiment who was killed in action on Saturday, 24th April 1915. Aged 33. Son of Horace and Ida Darwin, of The Orchard, Cambridge. Employed Cambridge Scientific Instrument Coy Ltd. Commemorated on the YPRES (MENIN GATE) MEMORIAL, Ieper, West-Vlaanderen, Belgium. Panel 33 Also listed on family gravestone in churchyard. See also Cambridge Guildhall and Cambridge St Giles From Andy Pay's research into the Marquis de Ruvigny's Roll of Honour the following: Volume 1, Part 1, Page 106 DARWIN, Erasmus, 2nd Lieut 4th battalion, Aleaxandra, Princess of Wales Own Yorkshire Regiment (T.F) Only son of Horace Darwin, F.R.S. Chairman of Cambridge Scientific Instrument Co, by his wife, the Hon Emma Cecilla (Ida) nee Farrer, only daughter of Thomas Henry, 1st Lord Farrer and grandson of Charles Darwin. Born Cambridge 7-12-1881, educated at Horris Hill and Marlborough (Cotton House) and gained an exhibition for Mathematics at Trinity College,Cambridge. He went up to Trinity in October 1901 and took the mathematical Tripos in his second year being placed among the senior Optimes. Afterwards he took the mechanical sciences Tripos and was placed in the second class in 1905. On leaving Cambridge he went through the shops at Messrs Mather and Platts at Manchester. After this he worked for some little while with the Cambridge Scientific Instrument Co., of which he was a director, and then became assistant secretary of Bocklow Vaughan and Co Ltd at Middlesborough. Here he stayed for seven years and at the outbreak of war occupied the postion of secretary to the company. As soon as war broke out he decided to join the army and on 12-9-14 was gazetted 2nd Lieut in the 4th (Territorial) battalion of the Yorkshires, which after training at Darlington and Newcastle crossed to France, as part of the Northumbria division on 17-4-15 and was within a week called upon to take part in the second battle of Ypres. Here these Territorial troops fresh from home and tried at the very outset almost as highly as men could be tried, behaved with a steadiness and coolness which gained for them the congratulations of the generals commanding their division and their army corps. Early on the morning of the 24-4-15 the battalion was ordered to attack the village of Fortuin, close to St Julien where the Germans had broken through. This attack they successfully carried out in the face of terrific shellfire, being ordered to retire at dusk. By driving the enemy back a mile or more they had attained their object which was to prevent a breach in the line, and they hade made good their front with the Canadians and Royal Irish on their right. It was during this advance that Darwin fell, killed instantaneously. His Commanding Officer, Colonel Bell wrote of him \"Loyalty, Courage and Devotion to duty - he had them all .... He died in an attack which gained many compliments to the battalion. He was right in front. It was a mans death\". Corporal Wearmouth, who was in his platoon wrote \"I am a section leader in his platoon and when we got the order to advance he proved himself a hero. He nursed us men, in fact the comment was, you would say we were on a field day. We had got to within twenty yards of our halting place when he turned to our platoon to say something. As he turned he fell, and I am sure he never spoke. As soon as I could I went to him but he was beyond human aid. Our platoon sadly miss him, as he could not do enough for us, and we are all extremely sorry for you, in your great loss\". Private Wood wrote to a friend in Middlesborough \"I would expect you would know poor Mr. Darwin .... I was in his platoon and I can tell you he died a hero. He led us absolutely regardless of the bullets from the German Maxim guns and snipers that whistled all around him\". Just before he left England, when his battalion was under orders for the front, he was summoned to the war office and offered a staff appointment at home in connection with munitions of war. This would have given great scope to his capabilities. \"It would have been interesting and important work\" he wrote \"but of course there are plenty of older men who can do it just as well as I can\". He felt that at the moment his place should be with his Regiment and made, in the words of one present at the interview, a fine appeal to be allowed to go with his men. It was granted and he went gladly with no looking back. The Times (30-4-15) said of him \"Erasmus Darwin would, if he had lived, have added fresh distinction to the name of his familyin a walk of life in which it has never before figured. Between Cambridge and a great iron works in the north there is something of a gulf fixed and one who knew Darwin only in his Cambridge home cannot say anything more than that all that met him in business conceived a very high opinion of his grasp of the subject, his acuteness and administrative ability. It was indeed impossibe to know him without realising that he combined with intellectual ability a calm, sound and practical judgement, and a general capacity for doing things well and thoroughly. He had, too, what must have been invaluable to him in his work, a most genuine sympathy with and affection for working men, and this quality, which, amongst so many other things, had made him love his work at Middlesborough, gave him intense pleasure when soldiering came to him as a wholly new and unlooked for esperience. He delighted in the men, and especially in long expeditions across the moors with his scouts. There is one more quality as to which all his friends would agree, namely a conscientiousness that was eminently sane and wide minded and completely unswerving. No one in the world was more certain what to do what he believd to be right. DAVIDSON Norman R [1897] Lieutenant-Col., R.H.A.; G.S.O. D.S.O. and Bar. Brevet Lieutenant-Colonel. M3. Died 5 Oct. 1917 of wounds received in action DAVIES Arthur C [1896] Captain, R. Welsh Fusiliers. Killed in action 10 Aug. 1915 DAVIES George LLewelyn [1912] 2nd Lieutenant, 6th Battalion, King\u0092s Royal Rifle Corps attached to 5th Battalion, Rifle Brigade. Killed in action 15 March 1915. Aged 21. Son of Arthur and Sylvia Llewelyn Davies. Step-son of Sir J.M. Barrie, Bart, Model for Barrie's 'Peter Pan'. Educated at Eton and Trinity College, Cambridge. Buried in VOORMEZEELE ENCLOSURE NO. 3, West-Vlaanderen, Belgium. Plot II. Row E. Grave 2. DAVIES Roland A Llewelyn [1911] Lieutenant, R. Fusiliers. Serbian Distinguised Service Medal. Killed in action 4 Oct. 1918 DAY Maurice C [1910] Lieutenant, 13th Rajputs, Idian Army. Killed in action in E. Africa 4 Nov. 1914 DE CANDOLLE Alec C V [1883] Major-Gen., Director-General of Transportation, Mesopotamia. C.B. M. Grand Officer, Order of the Crown of Roumania DEIGHTON John [1906] Captain, R.A.M.C. Died 20 Sept. 1916 of wounds received in action DENMAN Richard C [1914] Private, H.A.C.; Lieutenant, Grenadier Guards. Killed in action 1 Dec. 1917 DENNISTOUN John R [1913] Lieutenant, Fort Garry Horse, Canadian Force; attd. R.F.C. M. Killed in action 4 May 1916 DE ROTHSCHILD Evelyn Achille [1904] Major, Buckinghamshire Yeo. M. Died 17 Nov. 1917 of wounds received in action DEWHURST George C L [1910] Lieutenant, Rifle Brigade. Killed in action 1 July 1916 DICKINSON Raymond S [191] Captain, London Regiment. (Queen\u0092s Westminster Rifles). Killed in action 2 Oct. 1915 DIXON J Evelyn B [1913] Captain, R. Warwickshire Regt (T.F.). Killed in action 1 July 1916 DOBBS William Cary [1889] Captain, \"D\" Company, 2nd Battalion, Middlesex Regiment.; attd. R. Fusiliers. Killed in action 31 July 1917. Aged 46. Son of Robert Conway Dobbs, J.P., and Edith Juliana Dobbs, of Camphire, Cappoquin, Co. Waterford. Twice previously wounded. Educated at Winchester College and Trinity College Cambridge. No known grave. Commemorated at YPRES (MENIN GATE) MEMORIAL, West-Vlaanderen, Belgium. Panel 49 and 51. DODGSHON Angus J C (1914) Lieutenant, Gloucestershire Regiment. (T.F.). Killed in action 10 Nov. 1917 DODGSON Francis [1908] Captain, 8th Battalion, Yorkshire Regiment. Killed in action 10 July 1916. Aged 27. Son of Henley F. Dodgson, of Bovingdon, Herts. Educated at Marlborough College and Trinity College, Cambridge. Buried in SERRE ROAD CEMETERY No. 2, Somme, France. Plot XXVIII. Row K. Grave 8. DON Archibald William Robertson [1909] Lieutenant, 10th Battalion, Black Watch (Royal Highlanders). Died in Macedonia 11 Sept. 1916 of dysentery. Aged 25. Son of the late Robert Bogle Don and of Lucy Flora Don, of Warren House, Farnham Common, Bucks. Educated at Winchester and Trinity College, Cambridge (Scholar of Trinity). Student of Medicine at St. Bartholomew's Hospital Served in France, 1914-15, Salonika, 1916. Born at Broughty Ferry, Forfarshire. His brother Robert Macpherson Don also fell. Buried in SALONIKA (LEMBET ROAD) MILITARY CEMETERY, Greece. Row O. Grave 12. DONALDSON Sir Hay F , K C B [1877] Brig.-Gen., empld. Ministry of Munitions. Drowned on H.M.S. Hampshire 6 June 1916 DONALDSON Norman [1897] Lieutenant, 45th Brigade, Royal Field Artillery. Killed in action 10 March 1915. Aged 36. Born 19 January 1879 in Chiswick, Middlesex. Baptised 20 February 1879 in Chiswick St. Nicholas, son of John and Frances Sarah Donaldson, resident Chiswick, Middlesex. Son of Mrs. F. S. Donaldson, of 2, Melbury Rd., Kensington, London, and the late John Donaldson; husband of Dorothea Joan Donaldson, of Lower Franklands, Pangbourne, Berks. Mentioned in Despatches (MiD). No known grave. Commemorated on LE TOURET MEMORIAL, Pas de Calais, France. Panel 1. See also Charterhouse School, Godalming, Surrey Extract from Bond of Sacrifice: Officers Died in the Great War 1914-1916, volume 2, page 132: LIEUTENANT NORMAN DONALDSON, 5th BATTERY, ROYAL FIELD ARTILLERY (RESERVE OF OFFICERS), who was born on the 19th January, 1879, was the second son of the late John Donaldson, of Chiswick, and Mrs. Donaldson, of Kensington and The Crofts, Pangbourne. He was educated at Charterhouse and Trinity College, Cambridge, where he took his degree in Science in 1900. At Cambridge he rowed head of the river, was in the trial eights, also fenced for his University against Oxford. He joined the Royal Artillery in May, 1900, and served in both Horse and Field Batteries, retiring in 1909, and, voluntarily joining the Reserve of Officers in August, 1914, in the following month was gazetted to the Special Reserve, Royal Field Artillery, as Lieutenant. His Commanding Officer wrote as follows : \"Lieutenant Donaldson was shot through the head and killed instantaneously in the Battle of Neuve Chapelle on the 10th March, 1915, and was buried near the trench in which he fell. At the time of his death he was observing Officer for the battery in the trenches. There was no more gallant, unselfish, indefatigable officer in the Army, and he was loved by all the officers and men who served with him. The battery could not have suffered a greater loss. In order better to follow and report on the progress of the attack, he had shown himself above the parapet, with the regardlessness of personal danger that characterised him, though he was never unnecessarily reckless In this respect. The last messages from him were to say that we had gained the German trenches, and that the fire of our battery was effective.\" He was mentioned in Sir John French's Despatch of 31st May, 1915, and his battery's share in the success of the bombardment was fully recognised in all the orders. Hie married, in 1912, Dorothea, daughter of Mr. J. Freeman, of Shepperton. Extract from England & Wales Government Probate Death Index 1915: DONALDSON Norman of Lower Franklands Pangbourne Berkshire lieutenant R.F.A. died 10 March 1915 in France having been killed in action Probate London 28 April to Dorothea Jane Donaldson widow.\n\nEffects £1928 3s.10d. DOWLING Geoffrey Charles Walter [1910] Captain, King\u0092s Royal Rifle Corps. Killed in action at Hooge 30 July 1915 DREWE Adrian [1910] Captain, Royal Garrison Artillery M. Killed in action 12 July 1917 DRYSDALE Donald R [1913] Lieutenant, Dorset Regiment. Died 25 Sept. 1916 of wounds received in action DUFF Beauchamp P [1911] 2nd Lieutenant, Cameron Hdrs. Killed in action 25 Sept. 1915 DUNCAN David Alan Flight Sub-Lieutenant (Pilot), Killingholme Naval Air Station, Royal Naval Air Service. Killed while flying in a Sopwith Schneider 3800, drowned, 2 June 1917. Aged 22. Son of Mr. George H. P. Duncan and Mrs. H. R. Duncan, of 12, Kensington Court, London.In the 1911 census he was aged 15, born Valparalso, Chile, a school boarder, resident Charterhouse, Goldaming, Godalming Rural Detached, Surrey. Educated Trinity College, Cambridge. Buried in KENSAL GREEN (ALL SOULS') CEMETERY, London. Grave reference 173. 44875. See also Charterhouse School, Godalming, Surrey DUNVILLE John S (1914) 2nd Lieutenant, 1st Dragoons. V.E. Died 26 June 1917 of wounds received in action 25 June 19171 EADE Aylmer [1910] 2nd Lieutenant, Yorkshire Regiment. Killed in action 9 Oct. 1917 DE PEDDISON Richard No further information currently EDWARDES Thomas No further information currently EGERTON Philip de M W Lieutenant Philip De Malpes Waynes Egerton\n\n© IWM (HU 121674) [1913] Old Etonian. Captain, 19th (Queen Alexandra's Own Royal) Hussars. Killed in action 8th October 1918. Aged 23. Son of Sir Philip Henry Brian Grey Egerton, 12th Bart., of Oulton Park, Cheshire, and Mary Carolyn Campbell Grey Egerton, his wife (now Mrs. Richard McCreery). His twin brother, Roland le Belward Egerton also served. In the 1901 census he was aged 15, born London, a student, boarding at Eton College, Eton, Buckinghamshire & Berkshire. Educatd at Eton College and Trinity College, Cambridge. Buried in BUSIGNY COMMUNAL CEMETERY EXTENSION, Nord, France. Plot IV. Row B. Grave 29. See also Lords MCC World War 1 memorial Extract from England & Wales Government Probate Death Index 1919: EGERTON Philip de Malpas Wayne of Oulton Park Cheshire lieutenant 19th Royal Hussars died 8 October 1918 in France killed in action Administration London 20 February to sir Philip Henry Brian Grey Egerton baronet.\n\nEffects £1989 4s. 6d. Extract from Chester Chronicle - Saturday 19 October 1918, page 3: KILLED IN ACTION EGERTON.—On 8th inst., at Brancourt, France, Lieut. Philip de Malpas Wayne Egerton, only surviving son of Sir Philip H. B. Grey Egerton, Bart., Oulton Park, Cheshire.\n\ncp128 EILOART Horace A [1908] Major, London Regiment. (R. Fusiliers.) D.S.O. M.C. and Bar. M 3. Died June 1920 from the effects of wounds received in action 28 May 1918 ELLICOTT Frederick Arthur John [1911] 2nd Lieutenant, King\u0092s Own Scottish Borderers. Killed in action 8 July 1916 ELLIOT Hon Gavin W E (1914) Lieutenant, Scots Guards. Died 6 Aug. 1917 of wounds received in action ELLIOT Wilfrid E [1912] 2nd Lieutenant, Dorset Regiment. Killed in action 26 Sept. 1916 EVANS Bernard [1906] Lieutenant, Middlesex Regiment and 55th Squadron, Royal Flying Corps. M - Mentioned in Despatches. Died 8 April 1917. Aged 29. Son of Edwin Evans, of 9, Ashley Gardens, Victoria, London; husband of Bessie H. Evans (nee Murray), of 86, Emmanuel Rd., Streatham Hill, London. Solicitor, B.A., LL.B. Marlborough College and Trinity College, Cambridge. Buried in ONTARIO CEMETERY, SAINS-LES-MARQUION, Pas de Calais, France. Plot IV. Row A. Grave 28. EVANS Rupert Ancrum [1909] Sergt., H.A.C.; Second Lieutenant, 3rd Battalion, Prince Of Wales's Own (West Yorkshire Regiment). Accidentally killed 25 January 1916. Born 6 November 1891. In the 1901 census he was aged 9, born Kennington, Surrey, son of patrick T and Alice E Evans, resident 54, Longridge Road, Kensington, London & Middlesex. In the 1911 census he was aged 19, born Kensington, London, a studdent visiting at Parkhurst, Haslemere, Lurgashall, Sussex. Buried North-West of Church in HARPLEY (ST. BARTHOLOMEW) CHURCHYARD, Worcestershire. See also Charterhouse School, Godalming, Surrey and also Upton St Leonards, Gloucestershire Extract from England & Wales Government Probate Death Index 1916: EVANS Rupert Ancrum of 54 Longridge-road Earl's Court Middlesex second-lieutenant 3rd West Yorkshire (Prince of Wales' Own) regiment died 25 January 1916 at Whitley Bay Northumberland Administration London 8 August Alice Emily Evans widow. Effects £8829 5s. 2d\n\nResworn £8809. 7s. 0d. Further spent 29 January 1937. EWING Arthur H (1914) Captain, E. Yorks. Regiment. M.C. and Bar. M. Died 8 Sept. 1918 of wounds received in action EZRA David [1902] Lieutenant, Royal Garrison Artillery Killed in action 6 Aug. 1918 FARMER Henry C M [1911] 2nd Lieutenant, King\u0092s Royal Rifle Corps. Killed in action 10 May 1915 FARQUHAR Hobart B [1892] Captain, London Regiment. (Civil Service Rifles). Killed in action near Vimy Ridge 21 May 1916 FEILDING Hon Henry S [1912] Lieutenant, K. Edward\u0092s Horse; A.D.C.; Captain, Coldstream Guards. Died 9 Oct 1917 of wounds received in action FENWICK Anthony L [1913] Captain, Lincolnshire Regiment. M. Killed in action 16 Feb. 1918 FERGUSON Hugh M [1910] Captain, S. Staffs. Regiment. Killed in action 11 June 1917 FINCH Henry Alfred Ingle [1897] Private, 2nd Battalion, Canadian Infantry attached to Trench Mortar Battery. Died 28 April 1916 of wounds received in action. Aged 37. Son of George Ingle Finch and Bessie Finch, of Little Shelford, Cambridge. Born at Hammersmith, London, England. Educated at St. Paul's School, and B.A. of Trinity College, Cambridge. Previous to enlisting at London, Ontario, in Jan; 1915, was farming in the United States of America. Buried in LIJSSENTHOEK MILITARY CEMETERY, West-Vlaanderen, Belgium. Plot VI. Row B. Grave 23A. FIRTH Arnold [1901] 2nd Lieutenant, Royal Field Artillery. (T.F.). Killed in action 15 April 1917 FIRTH Richard C D [1897] Lieutenant, S. Lancashire Regiment. Died 21 Dec. 1914 FISHER John Wilfred [1910] Captain, 10th Battalion, Sherwood Foresters (Notts. and Derby Regiment.) Awarded the Distinguiged Service Order (D.S.O.) M - Mentioned in Despatches. Died 8 July 1916 of wounds received in action. Aged 23. Son of Horace Arthur and S. Kate Fisher, of Arno Vale, Notts. Three times previously wounded, the last fatally. Educated Malvern and Trinity College, Cambridge. Buried in HEILLY STATION CEMETERY, MERICOURT-L'ABBE, Somme, France. Plot I. Row A. Grave 15. FISKE Charles H [1914] 2nd Lieutenant, 111th Regiment. United States Army. Killed in action near Fismes (Aisne) 12 Aug. 1918 FORREST John W [1912] 2nd Lieutenant, Seaforth Hdrs. Killed in action 27 Sept. 1915 FORSTER Frederic A [1898] Captain, R. Fusiliers. Died 23 Sept. 1914 of wounds received in action at Mons FORSTER William [1910] Private, R. Fusiliers. Killed in action 7 Oct. 1916 FOSTER Bernard La T [1912] Lieutenant, Manchester Regiment. Killed in action 24 July 1916 FOWLER David D [1915] 2nd Lieutenant (A.), R.F.C. Killed in action 16 March 1917 FOWLER J Dudley [1910] Lieutenant, 5th (R. Irish) Lancers. Killed in action 30 Nov. 1914 FOYSTER Philip Tillard [1906] Captain, 86th Field Company, Royal Engineers. Died 11 December 1916 of wounds received in action 6 December 1916. Aged 28. Son of the late Rev. George Alfred Foyster and Adelaide Julia Foyster. Educated at Marlborough College and Trinity College, Cambridge. Born at Hastings. Buried in ETAPLES MILITARY CEMETERY, Pas de Calais, France. Plot I. Row B. Grave 76. FREEMAN-MITFORD Hon Clement Bertram O F [1896] Major, 10th Hussars. D.S.O. Killed in action 13 May 1915 FRENCH Hon Ernest A [1913] Captain, S. Wales Borderers. Died 16 Aug. 1917 of wounds received in action FREND William R [1893] Captain, Sherwood Foresters (Notts. and Derby Regiment.) Killed in action 20 Sept. 1914 FROST Edmund L [1909] Lieutenant, S. Lancashire Regiment. (T.F.). Killed in action 16 June 1915 GADDUM Russell C S [1899] 2nd Lieutenant, R. Fusiliers. Killed in action 10 Sept. 1916 GALBRAITH Alexander Norman [1896] Captain, Ceylon Rifles. Accidentally killed in Egypt (20 Feb. 1916) GARFIT Thomas N C [1910] Lieutenant, Durham L.I. Killed in action in Gallipoli 30 April 1915 GARNETT Kenneth Gordon [1911] Seaman, R.N.R.; Lieutenant, Royal Field Artillery. Awarded the Military Cross (M.C.) and the French Croix de Guerre with palm. Died 22 August 1917 of wounds received in action 21 August 1916. Aged 25. Son of William and Rebecca Garnett, of I, The Chestnuts, Branch Hill, Hampstead, London. Educated at Trinity College (B.A.). Rowing Blue No. 5 in Cambridge Eight in 1914. Buried in PUTNEY VALE CEMETERY AND CREMATORIUM, London. Plot/Row/Section I. Grave 672. GARNETT-BOTFIELD Alfred Clulow F [1912] 2nd Lieutenant,Rifle Brigade; Lieutenant, S. Wales Borderers. Killed in action 9 May 1915 GARNETT W H Stuart [1900] Lieutenant-Cdr., R.N.R.; Lieutenant, R.F.C. Killed in flying accident 21 Sept. 1916 GARRETT Stephen [1897] Captain, Suffolk Regiment. (T.F.). Killed in action 12 March 1915 GEDGE Cecil Bertie [1885] Old Etonian. Second Lieutenant, 3rd (City of London) Battalion (Royal Fusiliers), London Regiment. Killed in action 25th September 1915. No known grave. Commemorated on LOOS MEMORIAL, Pas de Calais, France. Panel 130. See also Lords MCC WW1 Extract from Du Ruvigny's Roll of Honour: GEDGE, CECIL BERTIE, 2nd Lieut., 3rd Battn. (Royal Fusiliers) The London Regt. (T.F.), attd. Grenadier Coy., Garhwal Brigade. I.A., only surv. child of Sydney Gedge, of Mitcham Hall, co. Surrey, Solicitor, by his wife, Augusta, dau. of Robert Herring ; b. Mitcham Hall aforesaid, 20 Feb. 1866 ; educ. Eton and Trinity College, Cambridge, where he graduated B.A.; was a Barrister, being called to the Bar (Inner Temple) in 1891, and afterwards practised on the South-Eastern Circuit and at the Essex and Herts Sessions ; joined the Sportsman's Battn. 9 Oct. 1914 ; was gazetted 2nd Lieut. 3rd London Regt. 1 April, 1915 ; went to France in June. when he was attached to the Grenadier Coy., Garhwal Brigade, and was killed in action at the Battle of Loos 25 Sept. following. His Colonel wrote : \"He was wounded early in the advance and came back and had his wounds dressed, and then went out again to lead his men, and he has not been seen since. He was a brave English gentleman, and we are glad to think he was one of us. . . . I am very sorry to say I have had strict orders not to send forward for 'Mention' any officer who has been killed. If it were not for this very strict rule I should have sent forward your husband's name,\" and a brother officer : \"There is one thing that may console you, and that is, your husband showed the greatest courage. He was wounded by shrapnel early in the morning, but refused to go back. He just had his men bind him up, and when the order came to go over the parapet, he led his men over like a hero.\" He was a good sportsman, being well known in Switzerland as a curler ; was also a keen scholar, and had edited various publications, including \"Granta\" in 1890, \"Huts,\" 1902-3, and was sub-editor of Lord Halsbury's \"Laws of Ayland.\" He m. at St. Margaret's, Westminster, 6 Aug. 1892, Jessie Bickley (Brackondale, Strawberry Hill, Twickenham), 3rd dau. of Bery Bickley Rogers, and had a dau., Sydney, Jessie, b. 12 Sept. 1893. GEE Robert F McL (1914) 2nd Leut., Wiltshire Regiment. Died 27 Oct. 1914 of wounds received in action GELDERD-SOMERVELL Roger Frederic C [1904] 2nd Lieutenant, Grenadier Guards. Died 13 March 1915 of wounds received in action GETHING Hugh B [1902] 2nd Lieutenant, Gloucestershire Yeo. Killed in action in Gallipoli 21 Aug. 1915 GIBBONS Edwyn I [1911] Private, R. Fusiliers; Lieutenant, Lancashire Fusiliers. Killed in action 29 April 1917 GIBSON-CRAIG Sir Archibald Charles, Bart [1902] Lieutenant, Highland L.I. M. Killed in action 13 \u0096 17 Sept 1914 GILLILAND Valentine K [1907] Captain, R. Irish Rifles. Killed in action 8 May 1915 GILMOUR Alastair S [[1906] 2nd Lieutenant, Argyll and Sutherland Hdrs. Killed in action 15 Sept. 1916 GILSON Robert Quilter [1912] Lieutenant, 11th Battalion, Suffolk Regiment. Killed in action 1 July 1916. Aged 22. Son of Robert Cary Gilson and Emily Annie Gilson, of Canterbury House, Marston Green, near Birmingham. Born at Harrow-on-the-Hill. Classical Exhibitioner of Trinity College, Cambridge. Buried in BECOURT MILITARY CEMETERY, BECORDEL-BECOURT, Somme, France. Plot I. Row R. Grave 28. GJERS Lawrence [1912] Captain, Seaforth Hdrs. Killed in action 4 Oct. 1917 GODDARD Archibald Spencer [1905] Captain, 5th Battalion, Canadian Infantry. Killed in action, during an attack near Courcelette he was badly wounded just before the First Objective had been reached and succumbed to his wounds soon after being carried back to the old front line 26 September 1916. Aged 30. Born 14 October 1886 in Folkestone, Kent. School teacher by trade. Son of Mary Monica Goddard, of Folkestone, and the late William Day Goddard. On the staff of King Edward School, Edmonton, Alberta. Graduate of Trinity College, Cambridge. Religious denomination Church of England. Attested 4 November 1915 at Calgary. No known grave. Commemorated on VIMY MEMORIAL, Pas de Calais, France. National Archives of Canada Accession Reference: RG 150, Accession 1992-93/166, Box 3596 - 24 GODDARD-JACKSON Nicholas Wlliam [1914] 2nd Lieutenant, Northamptonshire Regiment. Killed in action at High Wood 9 Sept. 1916 GOLD Philip No further information currently GOODWIN Harold D [1908] Lieutenant, Middlesex Regiment. Killed in action 1 July 1916 GOOLDEN Alexander W [1908] Lieutenant, E. Surrey Rgt.; empld. O.C.B. Killed in action in Afghanistan after the Armistice GORE-BROWNE Harold Thomas T [1904] Private, Canadian Mtd. Rifles; 2nd Lieutenant, King\u0092s Royal Rifle Corps. Died 23 Aug. 1916 of wounds received in action 19 Aug. 1916 GRACEY Horace C [1911] Captain, Rifle Brigade. Killed in action at Le Transloy 18 Oct. 1916 GRANT Alan F M [1911] 2nd Lieutenant, The Queen\u0092s (Royal West Surrey Regiment.). Died 18 June 1916 of gas poisoning GRANT Alexander No further information currently GRANTHAM Edward Rodney Hasluck [1914] 2nd Lieutenant, 1st Battalion, Northumberland Fusiliers. Died 31 March 1917 of wounds received in action. Aged 20. Second son of Richard Fuge Grantham and Adela Grantham, of 19, Daleham Gardens, Hampstead, London. Educated at Rugby and Trinity College, Cambridge. Buried in FAUBOURG D'AMIENS CEMETERY, ARRAS, Pas de Calais, France. Plot II. Row M. Grave 22. GRANTHAM Frederic W [1889] Captain, R. Munster Fusiliers. Killed in action 9 May 1915 GRATTAN-BELLEW William Arthur [1913] 2nd Lieutenant, Connaught Rangers; Major, R.F.C. M. Died 24 March 1917 of wound received in action GRAY Edward J No further information currently GRAY Maurice [1908] Lieutenant, 2nd Dragoon Guards. (Queen\u0092s Bays); Captain, M.G.C. Killed in action 8 Aug. 1918 GREEN Horace S [1902] Major, London Regiment. M. Killed in action 20 Sept. 1917 GREGORY John S [1908] Captain, Royal Army Service Corps. and R.F.C. M. Killed in action 19 Feb. 1918 GRIBBLE Charles H [1907] Lieutenant, The Buffs (E. Kent Regiment., T.F.). Killed in action 30 Nov. 1017 GRIFFITH Geoffrey F [1910] Captain, London Regiment. (Q.V.R.). M. Killed in action 26 Sept. 1917 GRIFFITHS Richard E [1907] Private, Australian Force. Killed in action in Gallipoli 1915 GWYNNE Roderick T S [1912] 2nd Lieutenant, King\u0092s Own (Yorkshire L.I., T.F.). Died 23 May 1915 of wounds received in action HABERSHON Leonard O [1912] Captain, E. Yorks. Regiment. Killed in action 13 Nov. 1916 HADEN Frederic H No further information currently HALL Frederick G [1909] Captain, Cheshire Regiment. Killed in action 7 July 1916 HALLAM Horace George Searle (1914) Lieutenant, Royal Army Service Corps. (T.F.) attached to Egyptian Camel Corps. Killed in action near Jaffa 1 December 1917. Aged 22. Son of George Hanley Hallam and Georgiana Louisa Hallam, of \"Ortygia,\" Lower Rd., Harrow, and S. Antonio, Tivoli, Rome. Old Harrovian, entered at Trinity College, Cambridge. Buried in RAMLEH WAR CEMETERY, Israel and Palestine (including Gaza). Section B. Grave 23. HALLIDAY John Alexander aka Alec Captain, 11th (Prince Albert's Own) Hussars. Died, in the Duchess of Westminster's Hospital at Le Touquet, of wounds received in action at Messines 13th November 1914. Aged 39. Son of John and Maria Halliday, of Chichlade House, Salsibury, Wiltshire. Buried in north-west part of ALL SAINTS CHURCHYARD, CHICKLADE, Wiltshire. See also Lords MCC WW1 Extract from De Ruvigny's Roll Of Honour 1914-1918, volume 1, page 169: HALLIDAY, JOHN ALEXANDER, Capt., 11th Hussars, eldest s. of the late John Halliday, of Chicklade House, co. Wilts (d. 13 Feb. 1915), by his wife, Maria (d. 25 Feb. 1916), dau. of Richard Brown, of Ebbw Vale, Monmouth; b. 10 April, 1875; educ. Harrow and Trinity College, Cambridge; was gazetted 2nd Lieut. from Militia to the 11th Hussars, then in India, 5 Jan. 1898, and promoted Lieut. 3 March, 1900, and Capt. 18 March, 1905; served in the South African War on the Staff as Special Service Officer, 25 July to 22 Aug. 1901, and as Signalling Officer, 23 Aug. 1901 to 14 June, 1902 (Queen's Medal with five clasps); was Adjutant 11th Hussars, and afterwards of the Leicestershire Yeomanry; went to France with the Expeditionary Force, 15 Aug. 1914; served through the retreat from Mons, the Battle of the Marne. the 1st Battle of Ypres, &c., and died in the Duchess of Westminster's Hospital at Le Touquet, 13 Nov. 1914, of wounds received in action at Messines, 31 Oct. previously; unm. Capt. Halliday was a good all-round athlete. and was in both cricket and football elevens at Harrow; capt. of the Gymnasium eight; champion heavy weight boxer for the Public Schools Competition at Aldershot, 1894, and threw the hammer for Cambridge in the University Sports, 1896-7. He was well known in the hunting-field in Ireland and South Wiltshire. Extract from The Bond of Sacrifice Volume 1, page 166: CAPTAIN JOHN ALEXANDER HALLIDAY, 11th HUSSARS, son of the late John Halliday, of Chicklade House, Salisbury, was born in London on the 10th April, 1875. He was educated at Harrow, where, in 1893, he was in the School Cricket XI, in 189.2- 93 in the Football XI, won the second prize for heavy- weight boxing in the Public Schools' Competition in 1893, and the first prize for the same in 1894. He then went to Trinity College, Cambridge; where he won the hammer-throwing prize at the Inter-'Varsity Sports in 1897. Captain Halliday joined the 11th Hussars in March, 1898, becoming Lieutenant in March, 1900, and obtaining his troop in March, 1903. He took part in the South African War in 1901 on special service, and afterwards on the Staff, as signalling officer. He was present at operations in the Transvaal, Orange River and Cape Colonies, receiving the Queen's medal with five clasps. From April, 1908, to February, 1911, he was Adjutant of his Regiment, and from March, 1911, to February, 1914, Adjutant of the Leicestershire Yeomanry. In the Great War he was with his Regiment during the retirement from Mons, and was fatally wounded at Messines on the 31st October. dying from the effects in the Duchess of Westminster's Hospital at Le Touquet on the 13th November, 1914. Captain Halliday, who was a member of the Cavalry Club and of the M.C.C. and I Zingari, was well known in the hunting field in Ireland, where he hunted for twelve consecutive seasons. Extract from Wiltshire Times and Trowbridge Advertiser - Saturday 21 November 1914, page 4: Capt. Halliday Dies of Wounds. Captain John Alexander Halliday (Alec). 11th Hussars, who died in the Duchess of Westminster's Hospital, Touquet, on November 18th. from wounds received in action at Messines on October 31st, was the eldest son of Mr. John Halliday, of Chicklade House, Wilts. Born on April 10th, 1875, and educated at Harrow and Trinity College, Cambridge, he was good all-round athlete. He was in both cricket and football elevens at school, champion heavy-weight boxer at the Public Schools competition, Aldershot, 1894, and threw the hammer for Cambridge in the University sports, 1896-97. He joined the 11th Hussars in 1898, served in India, and on special service in the South African War (medal). He obtained his captaincy in 1905, and was adjutant to the Leicestershire Yeomanry for three years. He went out with the Expeditionary Force at the beginning of the war, and fought all through the retreat from Mons. He was well known in the hunting field in Ireland and South Wilts. Extract from Broad Arrow - Friday 20 November 1914, page 29: Capt. John Alexander Halliday, 11th Hussars, who died in the Duchess of Westminster's Hospital, Le Touquet, on the 13th inst., from wounds received in action at Messines on the 31st ult., was the eldest son of Mr. John Halliday, of Cricklade House, Wilts. Born in 1875, and educated at Harrow and Trinity College, Cambridge, he joined the Line from the Militia in 1898, and was promoted captain in 1905. He was engaged on special service during the South African War of 1899-1902. HAMILTON Herbert Otho [1911] Lieutenant. 12th Battalion Northumberland Fusiliers. Killed in action on 25 September 1915. No known grave. Commemorated on Loos Memorial, Pas de Calais, France. Panel 20 to 22. See also Cromer War Memorial Extract from Yorkshire Post and Leeds Intelligencer - Wednesday 8 December 1915, page 6: LIEUT. HERBERT OTHO HAMILTON, 12th Northumberland Fusiliers, previously reported missing is now believed to have hve been killed on September 26 at Loos. He was the only son of the Rev. W. F. T. Hamilton, vicar of Cromer, and in January last he married Muriel, daughterof Mrs. Wakley, of Lassmade, Barnstaple. He was educated at Repton School and at Trinity College, Cambridge, where he took his degree in June, 1914. Extract from Exeter and Plymouth Gazette - Wednesday 8 December 1915, page 3: Lieut. Herbert Otho Hamilton, 12th Northumberland Fusiliers, reported missing, now believed killed September 26th at Loos, was educated Repton School and Trinity College, Cambridge, where he took his degree in June, 1914. He joined the Army in September, and received his commission in the 12th Northumberand Fusiliers. He was the only son the Rev. W. F. T. Hamilton, Vicar of Cromer (and formerly of Christchurch Church, Woking), and in January last he married Miss Muriel Wakley, daughter of Mrs. Wakley, of Lasswade, Barnstaple. The major commanding his Company wrote: \"We had to attack at 9 a.m. My Company was leading, and of the Company Herberh s platoon had the honour of leading. He fell right forward in the fining line at the head of his men. He was a very gallant officer, and greatly beloved by all.\" In his last letter to his father, Lieut. Hamilton wrote:—\" Just a line while the beginning of the great battle is going on. It is wonderful how peaceful one feels amid it all. Any moment one may be put out of action, but one does not worry. That quiet time alone with at the Holy Communion was very nice and solemn and most comforting.\" HAMILTON Kenneth [1905] Lieutenant, W. African Frontier Force. Died in Nigeria 15 Nov. 1918 of influenza contracted on active service HANDFORD Everard Francis Sale (1914) 2nd Lieutenant, Sherwood Foresters (Notts. and Derby Regiment., T.F.). Killed in action 15 Oct. 1915 HANDFORD H Basil S [1912] Captain, Sherwood Foresters (Notts. and Derby Rgt., T.F.). Killed in action 15 Oct. 1915 HANSON Oswald H [1891] Lieutenant-Cdr., R.N.V.R. Killed while prisoner in German hands 5 Nov. 1914 HARKER E Keith No further information currently HARMSWORTH Hon Vere S T (1914) Lieutenant, R.N.V.R. (R.N.D.). Killed in action 13 Nov. 1916 HARRIS Roland J No further information currently HARRISON Everard [1901] Captain, R.A.M.C. (T.F.). Killed in action 18 April 1917 HARROWING John Stanley [1907] Captain, Royal Army Service Corps. and R. Warwickshire Regiment. M.C. Chevalier, Legion of Honour(France). Killed in action at Bullecourt 4 May 1917 HARTLEY Charles F No further information currently HARTLEY William E [1896] Instructor, R.N. Accidentally killed on H.M.S. Vnguard 9 July 1917 HARVEY Douglas L [1911] 2nd Lieutenant, 9th Lancers. Killed in action 2 Nov. 1914 HARVEY Frank L [1909] Lieutenant, 9th Lancers. Killed in action 30 Oct. 1914 HASKINS Francis W [1908] Private, Cheshire Regiment. Died July 1916 HASLAM William K S [1911] Captain, Royal Field Artillery. (T.F.). Killed in actin 27 April 1917 HEAPE Brian [Ruston] [1911] Lieutenant Acting Captain, \"A\" Battery, 162nd Brigade, Royal Field Artillery. Killed in action 16 May 1917. Attested 7 August 1914, as 1092, West Riding Divisional Signal Company, Royal Engineers, born Cambridge, aged 22 years 1 month, employed as an Engineer at Vickers Ltd, unmarried, height 5 feet 9¾ inches, chest 40 inches, embodied from 7 August 1914 to 1 October 1914. In the 1901 census he was aged 8, born Trumpington, resident (Heyroun), Chaucer Road, Trumpington, Chesterton, Cambridgeshire. Buried in FAUBOURG D'AMIENS CEMETERY, ARRAS, Pas de Calais, France. Plot V. Row E. Grave 27. See also Cambridge, St. Faith's School Extract from England & Wales Government Probate Death Index 1917: HEAPE Brian Ruston of 10 King's Bench-walk London a captain R.F.A. died 10 May 1917 at Arras in France Administration London 15 August to Walter Heape esquire. Effects £1484 16s. 3d. Extract from De Ruvigny's Roll of Honour 1914-1918, Volume 3, page 133-134: HEAPE, BRIAN RUSTON, Capt., R.F.A., s. of Waiter Heape, M.A., F.R.S., of King's End House. Bicester, and of 10, King's Bench Walk, Temple, by his wife Ethel, dau. of Joseph Ruston ; b. Cambridge. 27 June, 1892: educ. at Parkfield, Hayward's Heath; at Repton. where he was a member of the O.T.C., and shot for his school at Bisley ; he also represented his school in the team sent to Aldershot for the Public Schools competition of his year, and at Trinity College, Cambridge, where he served in the University Cavalry Corps. He was apprenticed to Messrs. Vickers, Sheffield ; joined the West Riding Territorial Royal Engineer Corps on the outbreak of war ; obtained a commission in the Royal Horse Artillery in Dec. 1914, and subsequently exchanged into the Royal Field Artillery. He served with the Expeditionary Force in France and Flanders from March, 1915 ; took part in the operations on the Somme, and was killed in action 16 May, 1917, while acting Major in command of his battery, and fighting his gnus at the Battle of Arras. His Colonel wrote : Brian, as you know, was a great friend of mine, and we had journeyed into much danger together. You have reason to be proud of him as the bravest of brave soldiers. as brave a man as ever I have met. He had nerves of steel, and did not know what fear was ; in fact, he didn't realize that there was any such thing as danger in the whole world. He was a born fighting soldier, a most capable battery commander, and during the whole time he was serving under me I never found a single fault in him, nor did I have a single complaint from him I miss that great big, cheery fellow, with his wonderfully joyful laugh and his perfect good temper. He was the life and soul of his battery,\" and a brother officer: \" His death was nearly as great a blow to us as It must be to you, as we loved him as only a soldier can love a very brave and gallant officer.\" Unm. HEBBLETHWAITE Christopher John? [1903] Lieutenant, Nigeria Regiment., W. African Frontier Force. Killed in action near the Nigerian frontier 7 April 1915 HEDLEY William A C (1914) Lieutenant, The Buffs (E. Kent Regiment.). M. Died 19 July 1918 of wounds received in action HELM Henry P D [1912] Captain, Border Regiment.; Captain (O. and Ad.).Royal Air Force. M. Died 6 Nov. 1918 HENDERSON Alec S [1905] Captain, London Regiment. (R. Fusiliers.). Died 25 April 1915 of wounds received in action HENN Edward Henry Lovett [1910] 2nd Lieutenant, 9th Battalion, Rifle Brigade; attached to King\u0092s Royal Rifle Corps. Killed in action 25 September 1915. Aged 23. Son of Edward Lovett-Henn and Margaret Agnes Vaughan Henry his wife, of Campagne Sidi-Merzoug, El-Biar, Algiers. Educated at Freiburg University, Baden, and Trinity College, Cambridge. B.A., 1913. Qualified for entry to Foreign Office (2nd in Competition), August, 1914. Volunteered Sept., 1914, and went to France in August,1915. No known grave. Commemorated om YPRES (MENIN GATE) MEMORIAL, West-Vlaanderen, Belgium. Panel 46 - 48 and 50. HENRI Frank [1912] Captain, Northumberland Fusiliers. Killed in action 15 June 1918 HERDMAN George A [1914] 2nd Lieutenant, King\u0092s (Liverpool Regiment.). Killed in action1 July 1916 HERMAN George A [1911] Lieutenant, Cambridgeshire Regiment. Killed in action near Givenchy 20 July 1916 HERRIES Alexander D Y [1911] Captain, King\u0092s Own Scottish Borderers. Killed in action on the Somme 23 July 1916 HESLOP George H (1914) Captain, Middlesex Regiment. Killed in action 1 July 1916 HESS Henry (1914) Private, R. Fusiliers (P.S. Bn.); 2nd Lieutenant, Middlesex Regiment. M. Died 28 Oct. 1916 of wounds received in action HETHERINGTON Thomas William [1911] Lieutenant, Durham L.I. Killed in action 17 July 1916 HEXT Thomas M [1915] 2nd Lieutenant, King\u0092s Royal Rifle Corps. Killed in action 29 April 1917 HEYWOOD Arthur G P [1904] Major, Manchester Regiment.; G.S.O. 3. Died 12 Sept. 1918 of wounds received in action 28 Aug. 1918 HEYWOOD Bertram C P [1882] T.D. Colonel, Manchester Regiment. (T.F. Res.). Died 28 Oct. 1914 HEYWORTH Heyworth Potter Lawrence [1896] Captain and Adjt., N. Staffs. Regiment. Killed in action in Gallipoli 6 Aug. 1915 HICKS Basil Perrin [1911] Lieutenant, R. Berkshire Regiment. Killed in action 25 Sept. 1915 HILARY Harry J [1897] 2nd Lieutenant, Royal Field Artillery. Died 3 June 1917 of wounds received in action HILL Charles E C [1913] Lieutenant and Adjt., Highland L.I. M. Killed in action in Mesopotamia 17 April 1916 HILLS William F W [1912] Lieutenant, Royal Field Artillery. and R.F.C. Killed in action 6 March 1917 HILTON Henry D [1902] 2nd Lieutenant, Middlesex Regiment. Killed in action 19 Dec. 1914 HILTON Murray V [1875] Colonel, E. Lancashire Regiment. Killed in action 20 Oct. 1915 HINDLEY-SMITH Evelyn Hay No further information currently HOARE H Colt A [1907] Captain, Dorset Yeo. Died 19 Dec. 1917 of wounds received in action Nov. 1917 HODGSON Cyril A G [1902] Captain, R. North Devon Yeo. Died 20 March 1918 of pneumonia following malaria contracted on active service HODGSON George W H [1907] Lieutenant, Border Regiment. Died 6 Nov. 1914 of wounds received in action 2 Nov. 1914 HOLMAN Donald (1914) Lieutenant, Middlesex Regiment.; attd. The Queen\u0092s (Royal West Surrey Regiment.). Killed in action 8 Aug. 1918 HOPGOOD John L (1914) Private, Middlesex Regiment. (P.S Bn.); 2nd Lieutenant, The Queen\u0092s (Royal West Surrey Regiment.). Died 17 Aug. 1916 of wounds received in action 13 Aug. 1916 HOPKINSON Bertram [1892] F.R.S. Lieutenant Colonel, Royal Air Force. Killed in flying accident in crash of a Bristol F.2b. Monday, 26th August 1918. Aged 44. Son of Dr. John Hopkinson, F.R.S., M.A., D.Sc., and Mrs. E. Hopkinson, of \"Ellerslie\", Adams Rd., Cambridge; husband of Mariana Hopkinson (nee Siemens), of 10, Adams Rd., Cambridge. Buried in the right half, near chapel, in ST. GILES & ST. PETER CHURCHYARD CEMETERY, Cambridge. Grave reference 2D51/2. The RAF List 1st April 1918 lists him as Major serving under Ministry of Munitions (Aircraft Production). See also Cambridge St Giles and Cambridge Guildhall Born 11 January 1874, Birmingham ; eldest son of Dr.John Hopkinson (1849-1898) (later Professor of Electrical Engineering, King's College, London) & Evelyn Hopkinson (nee Oldenburg). Educated at St.Paul's, London, Trinity College, Cambridge (MA Mathematics), & King's College, London (BSc Experimental Physics). Called to the Bar, 1897, & practised patent law. Consultant electrical engineer, 1898-1903. In 1903, married Mariana, eldest daughter of Alexander Siemens; in same year, appointed Professor of Mechanisms & Applied Mechanics, Cambridge University, & elected Professorial Fellow at King's College,Cambridge. Research into electronic measurement techniques, efficiency of internal combustion engines,& effects of projectiles & explosives on armour plate. Elected Fellow of the Royal Society,1910. Also served as Major on London Electrical Volunteers (TF) & commanded RE Section of Cambridge University OTC, 1908-14. On outbreak of war, taught at School of Military Engineering, Chatham, then worked at Admiralty, 1915, on protection of warships from mines and torpedoes, developing \"bulge\" protection system. Transferred to Royal Flying Corps November 1915, as Technical Staff Officer. 1916-18, directed research into aircraft bombing and armament development at Experimental Station, Orfordness. Companion of the Order of St.Michael & St.George (gaz. 24th January 1917) ; prom.to Lt.Col. (RAF) (gaz. 23rd July 1918). Killed in flying accident 26/8/1918, piloting Bristol F.2b C4885; flying solo, crashed in bad weather at Paston, Essex, en route from Martlesham Heath to Hendon. Buried at St.Giles' Cemetery, Cambridge, 30th August 1918, after funeral service at King's College Chapel. Survived by widow & six daughters. HOPKINSON Eric Humphrey [1913] Lieutenant, 1st Battalion, Cambridgeshire Regiment. Awarded the Military Cross (M.C.) M - Mentioned in Despatches twice. Died in German hands 2 June 1915 of wounds received in action. Aged 21. Son of Albert and Olga C. Hopkinson, of 6, Adams Rd., Cambridge. Scholar, Trinity College, Cambridge. No known grave. Commemorated on PLOEGSTEERT MEMORIAL, Hainaut, Belgium. Panel 10. HOPKINSON Rudolph C [1909] Lieutenant, Royal Engineers. (Signals). M. Died 9 Feb. 1917 of wounds received in action 24 Nov. 1915 HOPLEY Geoffrey William Van der Byl [1910]\n\nGeoffrey William Van der Byl Hopley Second LieutenantGeoffrey William Van der Byl Hopley\n\n© IWM (HU 115899) Second Lieutenant, 2nd Battalion, Grenadier Guards and Special Reserve. Died of wounds 18th May 1918. Born 9th September 1891, Kimberley, Cape Province, South Africa. Buried in HARROW CEMETERY, Middlesex. Grave reference 19. I. 3306. See also Lords MCC WW1 Extract from Wisden Cricketers' Almanack Second Lieut. Geoffrey William Vanderbyl Hopley (2nd Battalion Grenadier Guards) died at the age of 23 on May 12 in the Military Hospital at Boulogne-sur-Mer, having been severely wounded in Flanders on February 3. He was in the Harrow Eleven in 1909 and 1910, in the latter season being second in the batting averages with 27.18. In his two matches against Eton he scored 1 and 23, 35 and 8. Proceeding to Cambridge, he obtained his Blue in 1912, making 14 and 6 not out v Oxford, but was unable to keep his place in either of the two following years. In 1914 he gave every promise of regaining a position in the side, scoring 29 and 120 in the Seniors' Match and 86 and 68 in a Trial game, but later he was quite out of form. In 1912 he won the heavyweight boxing for Cambridge. He was brother of Mr. FJV Hopley, and had been a member of the MCC since 1911. Extract from De Ruvigny's Roll Of Honour 1914-1918, Volume 2, page 171: HOPLEY, GEOFFREY WILLIAM VANDER BYL, 2nd Lieut., 2nd Battn. Grenadier Guards. 2nd s. of the Hon. William Musgrove Hopley, of Tenterden, Wynberg, Cape Colony, Senior Judge of Southern Rhodesia, by his wife, Annie, eldest dau. of the Hon. John Vander Byl, M.L.A. ; b. Kimberley, South Africa, 9 Sept. 1891 ; educ. Harrow (Scholar), and Trinity College, Cambridge (Scholar), where he obtained a First Class in the Law Tripos ; subsequently became a Barrister-at-Law, being called to the Bar (Inner Temple) in 1914 ; volunteered for Imperial Service on the outbreak of war in the Aug. of that year, and was gazetted 2nd Lieut. Grenadier Guards on the 19th ; served with the Expeditionary Force in France and Flanders, and died in hospital at Boulogne. 12 May, 1915, from wounds received in action near Bethune on 3 Feb. He was a keen sportsman; while at Harrow played in the Cricket XI. against Eton, and later in the Cambridge Xl. against Oxford ; also represented Cambridge as heavyweight boxer against Oxford : unm. HORNSBY Richard L W [1911] 2nd Lieutenant, Lincolnshire Regiment. Killed in action 9 Oct. 1915 HORNUNG John P [1913] 2nd Lieutenant, Royal Field Artillery. M.C. Died 20 Feb. 1916 of wounds received in action HOWARD Cecil C No further information currently HOWARD John B (1914) Captain, R.Welsh Fusiliers. (T.F.). Died 6 Sept. 1918 of wounds received in action HOWKINS George A [1913] 2nd Lieutenant, Northum,berland Fuls. Killed in action 25-27 Sept. 1915 HUBBACK Francis W [1903] 2nd Lieutenant, London Regiment. (Rifles). Died 12 Feb. 1917 of wounds received in action HUDSON Arthur C [1895] Major, R. Fusiliers. Died 2 Oct. 1916 of wounds received in action HUDSON Ralph Palliser Milbanke [1910] Captain, 3rd Battalion, Duke of Wellington's (West Riding Regiment). Died 25 March 1920 form the effect of wounds received in action. Born 14 October 1890. Baptised 19 November 1890 in Ashbrooke, Christ Church, Durham, son of Ralph Millbanke and Eliza Westropp Hudson. Sailed from Plymouth to Melbourne, Victoria, Australia 8 November 1916, aged 25 aboard the Omrah. See also Charterhouse School, Godalming, Surrey Extract from England & Wales Government Probate Death Index 1920: HUDSON Ralph Palliser Milbanke of 8 the Cedars Sunderland died 25 March 1920 Probate Durham 2 December to Annie Charleston Hudson widow Ralph Frederick Richard Becher lieutenant in H.M. Army and John Sanderson Dawson coal exporter. Effects £16619 11s. 10d. in the United Kingdom. Extract from Lichfield Mercury - Friday 2 April 1920, page 6: Captain Ralph Hudson (\"Peter\"), short story writer and shipowner, has died at Sunderland, aged thirty. His death was indirectlhy due to injuries received through being buried in a shell hole during the war. HUGHES Norman A [1907] Private, R. Fusiliers (P.S. Bn.); Captain, Welsh Regiment. Killed in action 18 Sept. 1918 HUGHES Thomas McK [1902] Private, London Regiment. (Artists Rifles); Lieutenant, King\u0092s Royal Rifle Corps and Gen. Staff (Intelligence), attd., R.F.C. M. Killed in action near Polderhoek 5 Feb. 1918 HUGHES-GIBB Harold Francis [1910] Lieutenant, Royal Field Artillery. Killed in action 18 April 1917 HULTON-SAMS Rev Frederic Edward B [1900] Lce.-Cpl., Bedfordshire Regiment.; Lieutenant, D. of Cornwall\u0092s L.I. Killed in action at Hooge 30 July 1915 HUNTSMAN Benjamin C (1914) Captain, Sherwood Foresters (Notts. and Derby; Regiment., T.F.). Killed in action 7 April 1917 INGRAM Thomas L [1894] Captain, R.A.M.C. D.S.O. M.C. M2. Killed in action 16 Sept. 1916 INSOLE George C L [1907] Captain, Welsh Guards. M.C. Killed in action 12 April 1918 INNES Donald McLeod Second Lieutenant, 14th Battalion, Royal Highlanders (Black Watch). Died of wounds 6 October 1918. Aged 19. Born at Cambridge. Birth registered in the July to September Quarter 1899 in Cambridge. Baptised 11 July 1899 in Cambridge, St Paul, son of Margaret and Hugh Mcleod Innes, of St Eligius Street, Cambridge. Son of Hugh McLeod Innes and Margaret Innes, of 6, St. Elgins (sic - s/b Eligius) St., Cambridge; grandson of Lt. Gen. James John McLeod Innes, V.C., Royal Engineers; brother of Patrick McLeod Innes (below). Scholar of Repton School; Exhibitioner of Trinity College, Cambridge. In the 1901 census he was aged 1, born Cambridgeshire, son of Hugh Mcleod and Margaret Innes, resident 6, St Eligins Street, Cambridge. Buried in ABBEVILLE COMMUNAL CEMETERY EXTENSION, Somme, France. Plot IV. Row G. Grave 16. See also Cambridge Guildhall and also Cambridge St Paul's INNES Patrick McLeod Second Lieutenant, 111th Siege Battery, Royal Garrison Artillery. Killed in action 30 April 1917. Aged 19. Birth registered in the July to September Quarter 1897 in Cambridge. Baptised 13 October 1897 in Cambridge, St Paul, son of Margaret and Hugh Mcleod Innes, of St Eligius Street, Cambridge. Son of Hugh McLeod Innes and Margaret Innes, of 6, St. Eligius St., Cambridge; brother of Donald McLeod Innes (above). Educated at Haileybury College, 1911-1916. Head of School, elected to a History Scholarship at Trinity College, Cambridge, 1915. Buried in LA TARGETTE BRITISH CEMETERY, NEUVILLE-ST. VAAST, Pas de Calais, France. Plot I. Row A. Grave 3. See also Cambridge Guildhall and also Cambridge St Paul's Extract from England & Wales Government Probate Death Index 1917: INNES Patrick McLeod of 6 St. Elgin's-street Cambridge second-lieutenant Royal Garrison Artillery died 3o April 17 Administration Peterborough 5 October to Hugh cLeod Innes fellow and bursar Trinity College.\n\nEffects £144 5s. 4d. IPSWICH Viscount William Henry Alfred [1903] Lieutenant, Coldstream Guards.; Lieutenant (A.), Royal Air Force. Killed in flying accident 23 April 1918 ISHERWOOD Samuel G No further information currently JACKSON Bertram R [1906] Captain, Coldstream Guards. Killed in action 15 Sept. 1916 JACKSON Edward P [1912] 2nd Lieutenant, R. Warwickshire Regiment.; attd. S. Wales Borderers. Killed in action 9 May 1915 JEAKES John W [1899] Lieutenant, R. Berkshire Regiment. Died 12 Oct. 1917 of wounds received in action JENKIN Louis F (1914) 2nd Lieutenant, Loyal N. Lancashire Regiment.; Captain, R.F.C. M.C. and Bar. Killed in action 11 Sept. 1917 JENNISON James L No further information currently JOHN Hugh Graham [1914] 2nd Lieutenant, York and Lancaster Regiment.; attd. Northumberland Fusiliers. (T.F.). Wounded and missing, presumed killed in action, at Hooge 16 June 1915 JOHNSON George A M T (1914) 2nd Lieutenant, London Regiment. (St Pancras Bn.). Killed in action 21 May 1917 JOHNSON Reginald T [1898] Captain, N. Staffs. Regiment. (T.F.). Killed in action near Hulluch 13 Oct. 1915 JOHNSON William Morton [1900] Captain, 16th Battalion, Manchester Regiment. Killed in action at Montauban 2 July 1916. Aged 34. Son of William Henry Johnson, B.Sc., and Agnes Morton Johnson, of Woodleigh, Altrincham, Cheshire. Educated at Harrow and Trinity College, Cambridge. M.A., F.R.G.S. Chairman and Managing Director, R. Johnson, Clapham & Morris Ltd., Manchester. No known grave. Commemorated on THIEPVAL MEMORIAL, Somme, France. Pier and Face 13 A and 14 C. JOICEY Hon Sydney J D [1903] Captain and Adtj., Northumberland Fusiliers. Killed in action 20 March 1916 JONES Cecil Hugh [1906] Captain, R. Welsh Fusiliers. Killed in action 18 Sept. 1918 JONES Evan Davies [1911] 2nd Lieutenant, R. Fusiliers; Lieutenant (A.), Royal Air Force. Killed in action 2 April 1918 JONES Fred J J R [1913] Trooper, 27th Regiment. Of Dragoons, French Army. Died 23 Feb. 1915 of wounds received in action JOWETT Eric C (1914) Lieutenant, Northumberland Fusiliers.; Lieutenant (A.), R.F.C. Died in German hands 9 July 1916 of wounds received in action 8 July 1916 KEELING Frederic H [1904] C.S.M., D. of Cornwall\u0092s L.I. Killed in action 18 Aug. 1916 KEEN Arthur W [1913] Major (A.), Royal Air Force. M.C. Died 2 Sept. 1918 of wounds received in action 15 Aug. 1918 KELSEY Arthur E [1883] Fleet-Surgeon, R.N.; Captain, R.A.M.C. Drowned on H.M. hospital ship Glenart Castle 26 Feb. 1918 KENNEDY Horas T [1908] 2nd Lieutenant, N. Staffs. Regiment.; Lieutenant, R. Scots Fusiliers.; attd Royal Engineers. (Fioeld Survey Coy.). Killed in action 6 June 1917 KENNEDY John M S [1912] Lieutenant, Seaforth Hdrs. Killed in action 10 Aug. 1915 KERRISON Roger O [1891] Old Etonian. Lieutenant-Colonel, 6th Reserve Cavalry Regiment (Formerly Suffolk Yeomanry) attached 4th Brigade, Australian Field Artillery. Died of dysentery 18th September 1917. Aged 44. Son of Roger and Florence Lucy Kerrison, of Tattingstone Place, Ipswich, Suffolk. Educated at Eton and Trinity College, Cambridge. Left Eton College in 1891. Joined the Loyal Suffolk Hussars (Yeomanry) in 1896, subsequently commanded the Regiment. In the 1881 census he was aged 7, born Norfolk, a scholar, son of Roger and Florence Lucy Kerrison, resident Tower House, 17, Ipswich St Mary at the Tower, Ipswich, Suffolk. Married Diana Elizabeth Postle Heseltine in 1896 in St Paul, Wilton Place, Knightsbridge, Middlesex who he divorced and then married Elizabeth Isobel Stuart Ferguson in the July to September Quarter 1915 in St. Martin registration District, London. . Buried in WIMEREUX COMMUNAL CEMETERY, Pas de Calais, France. Plot IV. Row N. Grave 4. See also Lords M.C.C. WW1 War Memorial. Photograph Copyright © Illustrated London News - Saturday 20 October 1917, page 17 Extract from England & Wales Government Probate Death Index 1917: KERRISON Roger Orme of 56 Brompton-square Middlesex died 18 September 1917 iri France Probate London 28 December to Elizabeth Isobel Stuart Kerrison widow.\n\nEffects £19578 12s. 2d. Extract from Hampshire Independent - Saturday 22 September 1917, page 7 and Hampshire Advertiser - Saturday 22 September 1917, page 6: Lieutenan Colonel Roger Orme Kerrison, Reserve Regiment of Cavalry, attached Australian Artillery, died on September 18th, in hospital abroad, of dysentery contracted on active service, aged 44. Colonel Kerrison formerly commanded the Suffolk Hussars Yeomanry. He was a magistrate for Suffolk, and Lord of the Manor of Tattingstone. He married first in 1896 Diana Elisabeth, third daughter of John Postle Heseltine, formerly of Walhampton, Lymington, and second, in 1915, Elizabeth I. Stuart-Ferguson. KINDERSLEY Henry R [1882] Major, Dorset Yeo. and Labour Corps KING Arthur M [1888] Major, Rifle Brigade. Killed in action 15 March 1915 KINNAIRD the Hon Douglas Arthur (Master of Kinnaid) [1898] Old Etonian. Captain, 1st Battalion, Scots Guards. Killed in action 24th October 1914. Aged 35. Master of Kinnaird. Son of 11th Baron Kinnaird, of Rossie Priory, Inchture, Perthshire, resident 10, St. James's Square, London. His brother The Hon Arthur Middleton also fell. Educated Eton and Trinity College, Cambridge. Left Eton College in 1898. Height 5 feet 7½ inches. Religious denomination Presbyterian. Served in Egypt 22nd March 1912 to 1st January 1913 and France from 4th October 1914. Buried in GODEZONNE FARM CEMETERY, Ieper, West-Vlaanderen, Belgium. Plot II. Row A. Grave 1. See also Lords MCC WW1 Extract from De Ruvigny's Roll Of Honour 1914-1918, volume 1, page 216: KINNAIRD, HON. DOUGLAS ARTHUR, Master of Kinnaird, Capt., 2nd Battn. Scots Guards, eldest s. of Arthur Fitzgerald, 11th Lord Kinnaird, K.T., by his wife, Mary Alma Victoria, dau. of Sir Andrew Agnew, of Lochnaw, 8th Baronet; b. Rossie Priory, Inchture, co. Perth, 20 Aug. 1879; educ. Cheam School. Surrey; Eton, and Trinity College, Cambridge (13.A. 1901, M.A. 1905); gazetted 2nd Lieut. 3rd Scots Guards, 22 May, 1901, and promoted Lieut. 1 Feb. 1904, and Capt. 3 Feb. 1 912; transferring to the 2nd Battn. when the 3rd was disbanded; went to Antwerp with his Battn. in the 7th Division; served through the retreat from that place and was killed in action, 23 Oct. 1914, during one of the numerous rearguard actions, to protect the retirement of the Belgian Army. Buried with another officer at Zonnebeke Farm, near Poligne, Belgium; unm. Capt. Kinnaird was in the Volunteer Corps at Eton and Cambridge, and travelled much on the Continent to study Art and Literature. In 1906, he went to East Africa for big game shooting, aud made a large collection of heads and trophies. lie also visited India for the Coronation Durbar at Delhi in 1911. Extract from The Bond of Sacrifice, Volume 1, page 216: CAPTAIN the Honble. DOUGLAS ARTHUR KINNAIRD, MASTER OF KINNAIRD, 2nd BATTN. SCOTS GUARDS, who was killed in action on the 24th October, 1914, near Ypres, was the eldest son of the eleventh Baron Kinnaird and the Baroness Kinnaird, of Rossie Priory, Inchture, Perthshire, and was born there on the 20th August, 1879. He was related to the Duke of Leinster, the Earl of Gainsborough, and Sir Andrew Agnew. Captain Kinnaird was educated at Eton and Trinity College, Cambridge, as Lord Kinnaird had been, taking his degree of M.A. at the University. He was a Lieutenant in the Eton College Volunteer Corps, and also in the Cambridge University Volunteer Corps. He subsequently joined the Forfar and Kincardine Artillery Militia, afterwards entering the Scots Guards in May, 1901, becoming Lieutenant in February, 1904. The 2nd Battalion Scots Guards formed part of the VIIth Division, which left England for Belgium early in October, and in the severe fighting near Kruiseik, in which Captain Kinnaird was killed, the battalion lost many officers. The Master of Kinnaird, who obtained his company in February, 1912, was not married, and his next brother, the Hon. K. F. Kinnaird, becomes heir to the barony. He was a member of the Guards' and Bachelors' Clubs, and among his recreations were polo and cricket. Extract from Dundee Evening Telegraph - Monday 2 November 1914, page 1: MASTER OF KINNAIRD.\n\nSon and Heir of Lord Kinnaird,\n\nHas Been Killed in Yser Battle. Intimation was received at Rossie Priory to-day that the Master of Kinnaird, son and heir of Lord Kinnaird, had been killed in action at the Yser on 24th ult. The Hon. Douglas Arthur Kinnaird was a lieutenant in the Scots Guards. He was born on 20th August, 1879, and was educated at Trinity College, Cambridge. Great sympathy will be extended throug hout the Carse of Gowrie to Lord and Lady Kinnaird on their loss. Extract from Dundee Courier - Tuesday 3 November 1914, page 4: HEIR OF LORD KINNAIRD\n\nOF ROSSIE PRIORY\n\nIS KILLED WHILE FIGHTING\n\nIN FRANCE. ONLY 600 OF BATTALION OF 1200\n\nANSWER ROLL CALL. Information was received at Rossie Priory yesterday that the Hon. Douglas Arthur Kinnaird, the Master of Kinnaird, and son of Lord and Lady Kinnaird, of Rossie Priory, Perthshire, had been killed in action on the Yser on 24th October. Lord and Lady Kinnaird are at present in London, where they are spending the winter months, and the sad news was conveyed to them there. Deceased was a captain in the 2d Battalion of the Scots Guards. He was 35 years of age, and was gazetted second lieutenant on 22d May, 1901, lieutenant on 1st February, 1904, and captain on 3d February, 1912. He was the eldest of four brothers, two of whom are at present serving with the colours, Kenneth Fitzgerald, with the Scottish Horse, and Arthur Middleton, with a London Territorial body. Educated at Cambridge. The late Master Kinnaird, who was educated at Cambridge, took a great interest , all military matters. He was busily engaged training recruits until about a month ago, when his battalion was ordered to the front for active service. Out of the 1200 who comprised the battalion, only some 600 answered the roll-call at the conclusion of the engagement in which the Master of Kinnaird was killed. Deceased was in command of the battalion when he met his death. His servant was wounded in the same engagement. The late Master of Kinnaird, who was unmarried, was most popular with all who knew him, and he will be sadly missed. His untimely death has cast a deep gloom over the surrounding district. Extract from Scottish Referee - Friday 6 November 1914, page 4: LORD KINNAIRD'S SON KILLED. The death is announced this week of Captain the Hon. Douglas Arthur Kinnaird, the eldest son of Lord Kinnaird, President of the English Football Association and President of the Polytechnic Harriers. Captain Kinnaird, who was 35 years of age, was killed in action on October 24. His death will be a great blow to Polytechnic sportsmen. He was a frequent attendant at the executive meetings, and a protagonist of every form of athletic sport. It is but a few weeks back that Lieut.-Col. Ian Hogg, son of the founder of the institute, was killed in action, while Major H. W. Studd, brother to Mr J. E. K. Studd, president of the institute, has been severely wounded in action. Extract from Dundee Courier - Monday 8 March 1915, page 4: THE LATE MASTER OF KINNAIRD Captain the Hon. Douglas Arthur Kinnaird Master of Kinnaird, 2d Battalion Scots Guards, of Rossie Priory, Perthshire, and of 10 James's Square, S.W., who was killed in action “in France or Belgium” on the 24th October last, aged 35 years, intestate and bachelor, left unsettled property gross value £10,090 17s 6d, personalty £973 6s 7d. Letters of administration of his property have been granted to his father, the Right Hon. Arthur Fitzgerald, Baron Kinnaird, K.T., of 10 James's Square, S.W., as next of kin. KNIGHT J O Coldham [1916] 2nd Lieutenant, The Queen\u0092s (Royal West Surrey Regiment.). Killed in action 30 Nov. 1917 KNIGHT Philip C [1911] Private, H.A.C.; 2nd Lieutenant, Somerset L.I. Killed in action 1 July 1916 KOHNSTAMM Norman Mortimer J No further information currently LAFONE Eric W (1914) Captain, Durham L.I. M.C. M. French Croix de Guerre. Killed in action 15 June 1918 LAMBERT Henry M [1897] Captain, 1st Dragoons. Killed in action near Ypres 13 May 1915 LANDALE Douglas B [1909] Lieutenant, Rifle Brigade. M. Killed in action 23 Oct. 1914 LANG Arthur Horace [1909] Second Lieutenant, 2nd Battalion, Grenadier Guards attached Scots Guards. Killed in action between 25th and 26th January 1915. Aged 24. Born 25 October 1890, Malabar Hill, Bombay (now Mumbai), Maharashtra, India. Baptised 12 December 1890, Malabar Hill, All Saints, Bombay (now Mumbai), Maharashtra, India. Son of Basil and Alice Sophia Lang, of Royal Oak Hotel, Sevenoaks Kent. Buried in CANADIAN CEMETERY No.2, NEUVILLE-ST. VAAST, Pas de Calais, France. Plot 12. Row E. Grave 22. See also Lords MCC WW1 See his statistics on CricInfo Extract from The Bond of Sacrifice, Volume 2, page 273: 2nd LIEUTENANT ARTHUR HORACE LANG, SPECIAL RESERVE, GRENADIER GUARDS, attd. 1st BATTN. SCOTS GUARDS, the son of Basil Lang, late Advocate-General of Bombay, and Mrs. Lang, Westerham, Kent, was born in Bombay on the 25th October, 1890. He was educated at Harrow and Trinity College, Cambridge. He was a member of the Pitt Club, at Cambridge, of the Conservative Club, London, and of I Zingari. In August, 1914, he was gazetted 2nd Lieutenant in the Special Reserve of the Grenadier Guards, and for a short time was attached to the 2nd Battalion of that Regiment. Afterwards he was attached to the 1st Battalion, Scots Guards, and was serving with it when he was killed in action defending the front trench at Cuinchy, Flanders, on the 25th June, 1915. Extract from Westminster Gazette - Thursday 24 May 1917, page 3: WILLS. Second-Lieutenant Arthur Horace Lang, Grenadier Guards, a former captain of the cricket eleven at Harrow, left “£100 to Harrow School Cricket Club.” His property was worth £15,346. Extract from Westminster Gazette - Thursday 24 May 1917, page 3: CRICKET AND THE WAR.\n\nOUR FALLEN HEROES.—X. SUSSEX. Sec Lt ARTHUR HORACE LANG (Grenadier Guards, attd Scots Guards) was reported “missing, believed killed,” and suberquently returned as “killed” on about Jan. 26, 1915. Born at Bombay on Oct. 25, 1890, he figured in the Harrow XI. four years (1906-1909), and in the last two acted as skipper and appeared for the' Public Schoots v. the M.C.C. to which was elected to membership in 1910. He was sound batsman and capable wicketkeeper, in the latter department securing eight victims against Eton in 1907. Proceeding to Cambridge University, he did not secure his “blue”\" till his last yaer (1913). though he made some good scores in trial games, and 53 v. the M.C.C. at Lord's, in 1912. Going in first, v. Oxford, he made 28 and 4. and stumped three, his hig"}, {"url": "https://www.perse.co.uk/about/our-staff/", "page_content": "Privacy Overview\n\nThis website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website. It helps our team to understand which sections of the website you find most interesting and useful.\n\nYou can read our privacy overview here."}, {"url": "https://www.thefamouspeople.com/trinity-college-cambridge.php", "page_content": "Trinity College, Cambridge Notable Alumni\n\nRight IconThis ranking is based on an algorithm that combines various factors, including the votes of our users and search trends on the internet.\n\nDiscover the notable alumni of Trinity College, Cambridge. The list includes people like Edward VII, Isaac Newton, Srinivasa Ramanujan, Jawaharlal Nehru & Rajiv Gandhi. This list of notable alumni is loosely sorted by popularity and has people from different domains of life, such as scientists, intellectuals & academics, leaders, writers and miscellaneous etc.\n\nVote for Your Favourite Trinity College, Cambridge Notable Alumni\n\nFounded by Henry VIII in 1546, Trinity College, Cambridge enthralls its students as well as pupils from the whole of the United Kingdom. The breathtaking campus is not just scenic but is renowned for the quality education it provides. Students receiving education here turn out to be famous personalities, and excel in different genres. Currently the home of 600 undergraduates, 300 graduates, and over 180 Fellows, Trinity College, Cambridge aspire students with its alumni, who have achieved heights in their career. Isaac Newton, an English mathematician, astronomer, and physicist studied in this college. Ernest Rutherford, known as the father of nuclear physics and a recipient of the Nobel Prize for “investigations into the disintegration of the elements, and the chemistry of radioactive substances” joined Trinity as a research student at the Cavendish Laboratory under J.J. Thomson. Srinivasa Ramanujan, the other prominent alumnus from the Trinity College, Cambridge is popularly known for his theorems and contributions towards mathematical analysis, number theory, infinite series, and continued fractions. Some other distinguished personalities who received their education from the Trinity College, Cambridge include poet Lord Byron, philosopher Ludwig Wittgenstein, Soviet spies Kim Philby, Guy Burgess, and Anthony Blunt. Besides, Trinity is the only college to achieve 32 Nobel Prizes, 5 Fields Medals in mathematics, and 1 Abel Prize. To find out the other famous alumni from the Trinity College Cambridge, keep reading."}, {"url": "https://www.trin.cam.ac.uk/subjects/history/", "page_content": "There are many intellectual justifications for the study of History. These include: the need for a society to understand its own past if it is to guide its future; the philosophically respectable argument that historical knowledge is the only possible type of knowledge; and the enrichment of human culture in the present. In practice most of those who choose History at university do so because they so greatly enjoy it. That is also why we teach it.\n\nAlthough History is not exactly a vocational subject, nearly all employers of graduates are keen to recruit historians. Many areas of the law, government service, media, finance, and industry value good historians at least as highly than graduates who can claim an ‘expertise’. History provides an intellectual training and a stimulus to the imagination: it enables one to put expertise into its human context. It also teaches the practical skill of absorbing, organising and presenting large amounts of knowledge.\n\nTrinity has a great historical tradition, as the names of T.B. Macaulay, Lord Acton, F.W. Maitland, G.M. Trevelyan, Jack Gallagher, E.H. Carr, Sir John Elliot, Norman Stone, Patrick Collinson, and Dominic Lieven all testify. In particular, Trinity historians have long been at the forefront of the study of imperialism and their aftermaths. From 2019, the College has five teaching Fellows in the subject: Peter Sarris, who works on Roman, medieval European, Byzantine, and Islamic history; Samita Sen, who works on global economic history and the history of modern South Asian; Richard Serjeantson, who studies European history between the Renaissance and the Enlightenment; Daniel Larsen, who works on international and intelligence history in the early twentieth century in the US and UK; and Damian Valdez, who is an intellectual and political historian of Germany in the nineteenth and twentieth centuries. Other historians in the College who may also teach you include Boyd Hilton (eighteenth- and ninteenth-century British history), Sachiko Kusukawa (sixteenth- and seventeenth-century European history and history of science), and Tessa Webber (medieval British history). The College is thus unrivalled in Cambridge in terms of the chronological span and geographical range covered by its historians. This makes for an exciting and diverse learning environment.\n\nThe History Tripos offers a very wide range of options and in spite of the range of expertise available at Trinity, no single college can provide specialist teaching in all its corners. Inevitably, therefore, most of our students will from time to time be sent outside Trinity for supervisions, but we have excellent reciprocal relationships with other colleges and can promise expert tuition in all fields. We are also keen to foster our students’ linguistic skills, and will arrange teaching for those wishing to improve their command of a foreign language or acquire a new one.\n\nWe expect our undergraduates to work hard. But we also think that History is fun, and don’t want our students to be solemn about it. With an undergraduate intake of about 12 a year, as well as several graduate students working for a PhD, historians are an important presence in the College. The Historical Society is one of the College’s most active academic societies and its meetings even attract students who are not themselves historians. Trinity’s library facilities are the best of any college in the University, and we actively encourage our undergraduates to help us develop the collection to meet the requirements of the papers they are taking.\n\nTrinity also has a wide range of awards and grants available to its historians. There is the Lapsley Fund for Medieval Studies; the Crawford Travelling Scholarship; the Projects Fund; and a number of language bursaries. There are also exchange schemes to the Ecole Normale Superieur in Paris and to the Universities of Chicago and Rice in the United States. These generous funds provide unmatched opportunities for students to travel for pleasure, profit, and historical inquiry, whether to Byzantium, Bayeux, Bangladesh, or the local County Records Office. There are also a number of generous History Prizes. The Bowen, Greaves, and James Webb (History of Ideas) prizes are awarded on the basis of essays; the Earl of Derby and Louisa Oriel prizes are also awarded to historians who distinguish themselves in Tripos examinations. The Robson History Prize is intended to encourage ambitious and talented Year 12 or Lower Sixth students who may be considering applying to university to read History or a related discipline. At the same time students will, of course, be able to take advantage of the extraordinarily high quality of accommodation and general facilities that the College offers."}, {"url": "https://www.thestudentroom.co.uk/university/student/trinity-college-cambridge", "page_content": "Trinity College is the largest of the Cambridge Colleges, having around 200 undergraduate students in each intake and some 700 undergraduates altogether.\n\nTrinity College Established: 1546 University: University of Cambridge Address: Trinity Street, Cambridge, CB2 1TQ Telephone: +44 1223 338400 Website: http://www.trin.cam.ac.uk Student Union/JCR website: http://www.tcsu.net Graduate/MCR website: http://basociety.net/ Admittance: undergraduates and postgraduates\n\nStudent Statistics\n\nSee: Cambridge University Student Number Statistics\n\nTrinity Application Statistics See College applications and admissions statistics and Numbers applying to Trinity College\n\nTrinity Application Statistics per subject See Appplication Statistics\n\nLocation\n\nThe central area of the College (Great Court, New Court, Neville's Court, Angel Court, The Chapel, Bar, Hall and the Library) is located in the middle of town on Trinity Lane, just north of Market Square and Kings Parade, with Great Gate (the main entrance) set back slightly from Trinity Street. The south section of College, Whewell's Court, Blue Boar Court, the Winstanley lecture theater and the Wolfson Building opposite Great Gate. The north section of the College, Burrell's Field is reached by crossing out the back of the College and over Queen's Road, about a five minute walk from Great Gate.\n\nAccommodation\n\nSee:\n\nTrinity aims to provide accommodation in College for all new students, whether you are starting an undergraduate or a graduate course. Most first years are accommodated in either Angel Court, the Wolfson Building or in Blue Boar Court, all of which are good by Cambridge standards. Expect a room with a bed (funny old thing), wardrobe, bookcase, desk &chair and a sink. A kitchenette (known for archaic Cambridge reasons as a Gyp Room) will be shared between around 5 or 6 of you, though the facilities vary depending on the court you're assigned. The vast majority of rooms in the Wolfson building, which houses 90 first years, are en suite and large by Cambridge standards, even if they can seem a bit industrial. Several staircases in Angel and Blue Boar are home to some of the largest rooms (they really can be pretty huge). Of course, there are also some more moderately sized (though still pretty good) rooms, which are very reasonably priced.\n\nA student writes: Trinity accommodation seemed good. The room I stayed in (Angel Court) for interview was enormous, but didn't have lots of storage (had a lot of desk area, though, and the sink was in a very small ante-room). A friend stayed in Wolfson for his interview, and I had a test there - the building's ugly from the outside, but was very modern (lots of glass, things on the walls, clearly fairly recently painted) and well-looking inside. He said the room was good.\n\nAccommodation in following years is assigned by a ballot system, and the ballot is reversed so that those who are at the bottom in second year are at the top in third year (though scholars get bumped above everyone else). Once the third years have picked, second-year students are generally left with rooms in New Court, Pearce Hostel, Bishop's Hostel, some rooms in Whewell's Court and most of the rooms in the slightly further afield Burrell's Field to choose from. New Court contains a number of very spacious sets which you might be able to choose if you're nearer the top of the ballot, and those rooms and other rooms in Whewell's, New Court and Bishop's have the advantage of being located in the main part of college. However, if you're after facilities and don't mind living a little bit further away from town, then you could choose Burrell's Field. The rooms here come in three general forms -- the modern tower-style rooms (built in 1996, very nice), the older 1980s rooms in staircases A-F (still quite pleasant), or the houses, which have all been refurbished in recent years - G, X and W on Grange Road and V slightly further into the grounds.\n\nThird years have the best choice of accommodation, with only Senior Scholars choosing before them. This means that, as well as the Whewell's and New Court, future third years can pick some rooms in Great Court, rooms on the 'Blue Boar Podium' which are pretty modern, 4a Bridge Street has an abundance of access to bathrooms and well-equipped kitchens and a few rooms in Nevile's Court for the very lucky.\n\nIn both second and third years, students can also choose to live in a double - usually 2 bedrooms and a living area, with a bathroom in some cases (as in the doubles in Burrell's Field). These generally work out as cheaper than an equivalent single room and the living areas are generally large.\n\nTrinity has possibly the best bedmakers in Cambridge. Every day, bedmakers make beds, empty rubbish bins, and clean the toilet; every other day, they additionally hoover and dust. Furthermore, they change bed linen weekly.\n\nSocial Spaces\n\nLots. The Wolfson Party Room (WPR, pronounced whuper) is a subterranean, troglodytian hole somewhere beneath the Wolfson Building. Generally home to the TCSU-organised Ents. There's also the Butler House Party Room in Burrell's Field, where TCSU lay on a Freshers' Ent.\n\nGardens\n\nTrinity is lucky to have the Backs, and a glorious Fellows' Garden (which, despite the name, is open to students) The South Paddock is one of the few bits of hallowed turf they let students on, and is usually home in the summer to hoards of us. The Fellows' Garden, between Burrell's and the main college site, is great on a sunny day to sit in with a book and forget that you're meant to be working.\n\nDining/Hall\n\nHall is cheap, edible and plentiful. Opinions among Trinity students on Hall's quality are divided. Certain friends from other colleges have commended it highly, though I would certainly say the quality varies. Most would agree that Trinity does very good steaks and roasts, and one culinary art College definitely excels at is pudding/dessert/afters. Supposedly, Trinity invented Creme Brulee, and the Brown Bread Ice Cream is to die for. Seriously lush. Trinity also offers a very good brunch on Sunday, with everything you could want, including waffles and pancakes!\n\nFormal\n\nTrinity formals are particularly formal by Cambridge standards. They happen on Tuesday, Thursday and Saturday for undergraduates, and B.A formal is on Friday. Dress standards are notionally suit, tie, and a gown for everybody (not just College members, as is common at most other Cambridge colleges), with female equivalent.\n\nBar\n\nThe bar is usually heaving before and after formal dinners, but fairly quiet at other times. It is located in Angel Ct, but you can get to it through the passageway between I Great Ct and Angel.\n\nJCR\n\nThere are two JCRs, which are both above the bar. The lower JCR has papers, several board games, tables and comfy seating, and the upper JCR has Sky TV, a DVD player a PS3, comfy seating etc.\n\nLibrary and Computing\n\nLibrary\n\nIt's big, with everything you could want (e.g. free ear plugs, book stands, etc). During exam term you can work in the beautiful Wren library, too. Fines have recently been reduced and borrowing restrictions relaxed.\n\nComputer rooms\n\nThe College has several computer rooms -- one in the library, one in I Great Court with 5 PCs and a Mac with loads of software on, two scanners (one on the mac and one on one PC) , and one black and white printer, one colour printer. Another computer room is located next to the JCR, another by Green Street gate and another in Burrell's Field Porters' Lodge. Read More: Trinity Computing Pages\n\nRoom Internet Connection\n\nEvery college room has at least one ethernet network point and eventually they'll all have WiFi. Everyone is given an ethernet cable when they come to college for the first time. One of the only things the college makes a big fuss about in terms of how you choose to use the internet is peer to peer (p2p) sharing software, which is banned in Trinity. The data usage allowance was increased in 2012 and is now several gigs a day. You shouldn't have any problems unless you spend hours skyping, streaming films and TV from your computer. Eduroam wifi is also available in most places.\n\nAcademic Performance\n\nTrinity has in recent years been dominating the Tompkins Table (which ranks colleges by their Tripos exam results) by huge margins, ranking 1st (2015), 1st (2014), 1st (2013), 1st (2012), 1st (2011), 2nd (2010), 1st (2009), 3rd (2008), 6th (2007), 5th (2006), 3rd (2005), 3rd (2004), 8th (2003), 6th (2002), 3rd (2001), 2nd (2000).\n\nAtmosphere\n\nTrinity is a damn nice place to live, generally. Although it's the largest college in Cambridge, you'll soon make a group of friends, especially given the way the first years are accommodated. Living in the centre of town is a definite advantage, as if it all gets too much for you there's plenty of spaces to escape to in town. Really, with most colleges, you make them into what you want. It's the people that count, and thankfully Trinity has a lower quotient of numpties and irritating characters than some other colleges do.\n\nSports and Gym\n\nAt Old Field, a few minutes’ walk from the Great Gate, Trinity has its own facilities for football, rugby, cricket, and netball. Four squash courts, a badminton court, and nine all-weather tennis courts can be booked free of charge. The hockey pitches are at another site a short distance from the College. All sports clubs at Trinity bar rowing are part of the Field Club, Trinity’s main sports society. Read more: Trinity College Sport and Gym facility information\n\nFacilities\n\nBeing the largest and most wealthy college has its advantages. There's no shortage of washing machines and dryers (yes, you will have to use them, get used to the idea...)\n\nChapel (image 1, image 2)\n\nBar\n\nHall (Sixteenth century, used daily for meals, both formal and informal) (image 1, image 2)\n\nCollege Bar with charging points, sofas and live TV\n\nThe Wren Library (manuscripts) (image 1, image 2, image 3)\n\nGeneral College Library (over 80,000 volumes)\n\nLaw Reading Room (24/7)\n\nWinstanley Lecture Theatre (seats 150, fully-equipped audio-visual theatre)\n\n2 main Computer Rooms (plus a few other computers dotted about college)\n\n6 music practice rooms with upright pianos\n\n2 harpsichords\n\nseveral grand pianos\n\nGym (over near Burrell's) inductions are mandatory, and there are bookable training sessions\n\nFootball, rugby, cricket facilities at Old Fields (a few mins walk from the Great Gate)\n\n4 Squash Courts\n\nBadminton Court\n\nBasketball Court\n\nNetball Court (Old Fields)\n\n9 all-weather tennis courts\n\nHockey pitches\n\nWolfson Party Room (venue for music and dancing)\n\nHealth Centre with college nurses\n\nCollege physiotherapist\n\nCollege councellor\n\nLinks\n\nTrinity Grounds\n\nTrinity Choir\n\nTrinity Sports\n\nOther societies\n\nTrinity May Balls\n\nTrinity Students\n\nCourses\n\nColleges"}, {"url": "https://www.trinity.utoronto.ca/discover/about/history/faculty-of-divinity/", "page_content": "1837-40: Representatives of the United Church of England and Ireland in Upper Canada correspond with the Society for the Propagation of the Gospel about support for fellowships to enable the local education of clergy.\n\n1841: SPG having promised support, Bishop John Strachan requests his Chaplains, Reverend Henry James Grasett and Reverend Henry Scadding of St. James’ Cathedral and Reverend Alexander Neil Bethune, Rector of Cobourg, to prepare a plan for a systematic course in Theology for those to be admitted to Holy Orders. The three chaplains recommended that all candidates, including those being prepared by the Reverend Featherstone Lake Osler in Tecumseth, should be sent to Cobourg to be instructed by Bethune.\n\n1841: November 21. Bishop Strachan announces that he has appointed Bethune, who had studied under Strachan at Cornwall and later at York, Professor of Theology in the Diocese of Toronto and that, in the future, candidates for Holy Orders will be required to take “Regular prescribed courses of theological study” and to be examined by one of the Bishop’s Chaplains before admission.\n\n1842: January 10. First lecture given at the Diocesan Theological Institution at Cobourg, two students being present to hear the lecture. Further support requested from SPG. Eight students were enrolled by the start of the next term and thirteen by midsummer. By January 1852, when the work was transferred to Toronto to become the Faculty of Divinity in the new Trinity College, sixty-nine of the Cobourg Institution’s seventy-seven students had been admitted to Holy Orders. The Debating Society, precursor of the Trinity College Literary Institute, founded in Cobourg and brought to Toronto by the continuing students. The theological course lasted three years and included the Greek Testament, the Thirty-nine Articles of Religion, Evidences of Christianity, Old Testament History, Liturgics, Church Government, Ecclesiastical History, and the Greek and Latin Fathers. Students were required to write sermons, which were read by the other students and commented on by Mr. Bethune, and to undertake mission work in the parishes.\n\n1843: First lectures given at King’s College in Toronto, Bishop Strachan President until 1848. A few of its graduates were ordained. King’s was secularized in 1850 by the government of the Province of Canada and was renamed the University of Toronto.\n\n1851: August 2. Trinity College Act passes legislature, with considerable opposition. The cornerstone of the new College building on Queen Street had been laid April 30, 1851.\n\n1852: January 15. Official opening of Trinity College, Toronto, with three professors and thirty students, including fifteen from the Cobourg Institution who had not yet completed the program there. Reverend George Whitaker, M.A., of Queen’s College, Cambridge, the first Provost and Professor of Divinity. Royal Charter given July 16, 1852, ordaining that Trinity College “shall be a University and have and enjoy all such and the like privileges as are enjoyed by our Universities of our United Kingdom of Great Britain and Ireland.” The University of Trinity College will eventually grant degrees in six faculties.\n\nAt the opening of Michaelmas Term 1852, thirty-six students (thirteen in Divinity, eighteen in Arts and five in Medicine) are enrolled at Trinity, five Divinity students having now completed their course begun in Cobourg. The Divinity course required two years, or six complete terms, in addition to three years in Arts. Among other things, students were required to master one book of the New Testament in Greek, Scripture History, Paley’s Hora Paulinae, Blunt’s Undesigned Coincidences, St. Augustine’s City of God, Book X and Proctor’s History of the Book of Common Prayer.\n\n1877: Foundation of the Protestant Episcopal Divinity School at St. James Cathedral Schoolhouse, which became Wycliffe College in 1882, and moved to the University of Toronto campus.\n\n1881-1994: Charles W.E. Body, MA, Fellow and Lecturer in Theology, St. John’s College, Cambridge, the second Provost and Professor of Theology. In 1882, a second chair in Divinity is established, after an international appeal for supplementary endowment. As Keble Professor of Divinity, John Charles Roper, MA, Keble College and Brasenose College, Oxford, later Vicar of St. Thomas’s Church, professor at General Theological Seminary in New York, and Bishop of Ottawa, occupied this chair from 1886 to 1888. Theological and Missionary Society is formed January 1884 and develops considerable interest in foreign missions, particularly in Japan.\n\n1895-1899: Edward Ashurst Welch, MA, King’s College, Cambridge and Vicar of the Church of the Venerable Bede at Gateshead-on-Tyne, the third Provost of Trinity College, and Dean of Divinity.\n\n1900-1921: Thomas Clark Street Macklem, MA, St. John’s College, Cambridge and Rector of St. Simon’s Church, Toronto, the fourth Provost of Trinity College.\n\n1904: October 1. Federation of the University of Trinity College and the University of Toronto comes into effect. Provision is made in the legislation that Trinity retain its right “to order religious instruction and worship for its own students as it may deem proper”. Trinity College agrees to hold in abeyance its powers to grant degrees, except in Divinity. The University of Toronto assumes responsibility for instruction in the other professional faculties and in the science subjects.\n\n1910: Committee appointed to induce closer relationship between Wycliffe College and Trinity. Despite inducement of very substantial gift offered for a satisfactory and workable union, the plan was unsuccessful.\n\n1912-1916: T. Stannage Boyle, Trinity ’98, the first Dean of Divinity apart from the Provost.\n\n1919-1947: Miss Gertrude Morley, teaching New Testament Greek, the first woman faculty member in the Faculty of Divinity.\n\n1922: First annual meeting of the Conference of Clerical Alumni, later called the Divinity Associates. From 1923, the Dean Starr Lectures delivered at the Annual Conference, first lecturer Bishop Charles H. Brent, ’84, commemorated March 27.\n\n1925: Trinity College removes to its new buildings on the University of Toronto campus at Queen’s Park.\n\n1926-1945: Francis Herbert Cosgrave, MA, BD, Trinity College Dublin, Provost of Trinity College. Provost Cosgrave had been appointed Lecturer in Hebrew in 1907, Professor 1909, and second Dean of Divinity in 1916.\n\n1938: The Faculty of Divinity of Trinity College is a founding seminary of the Association of Theological Schools.\n\n1933-1939: John Lowe, Trinity ’21, later Dean of Christ Church, Oxford, and Vice-Chancellor of the University of Oxford, Dean of the Faculty of Divinity.\n\n1940-1944: Kenneth C. Evans, later Dean of Montreal and Bishop of Ontario, Dean of the Faculty of Divinity.\n\n1943: Together with Emmanuel, Knox and Wycliffe Colleges, the Faculty of Divinity forms the Toronto Graduate School of Theological Studies, a co-operative teaching and examining body for graduate theological studies and the precursor of the Toronto School of Theology.\n\n1944-1962: Charles R. Feilding, Acting Dean then Dean of the Faculty of Divinity. During this period, Faculty of Divinity becomes involved in clinical pastoral education, with Emmanuel College and McMaster Divinity, one of the first theological faculties in Canada to do so. In 1944, the theological program was extended to three years.\n\n1951: The curriculum in Divinity is revised and expanded, leading to the degree of Bachelor of Sacred Theology (S.T.B.).\n\n1954: Blanche Murphy Donovan, Helen Milton and Mary D. Rendell the first women to obtain a divinity degree from Trinity. From 1942, students at the Anglican Women’s Training College had pursued theological studies at Trinity College. Several of these women, including Gertrude Morrison and Constance Purser in 1952, had received the title Scholar in Theology (S.Th.) from Trinity College under the provisions of the Board of Examiners of General Synod.\n\n1957-1972: Derwyn Randolph Grier Owen, BA ’36, MA, PhD, University of Toronto and Professor of Philosophical Theology, Trinity College and Wycliffe College, Provost of Trinity College.\n\n1960-1983: Howard W. Buchner, ’47, Canon of Edmonton, Assistant Dean (1960), Acting Dean (1961), then Dean (1962) of the Faculty of Divinity and Professor of Moral and Pastoral Theology.\n\n1960: Faculty of Divinity, previously housed in classrooms and offices at 99 St. George Street, moves to Gerald Larkin Building.\n\n1969: The three Roman Catholic faculties request membership in T.G.S.T.S. The Committee on Cooperative Theological Education in Toronto is created and, through assistance from the American Association of Theological Schools, moves to establish the Toronto School of Theology. The Faculty of Divinity joins with six other theological institutions, including Wycliffe College, to form The Toronto School of Theology, with a shared calendar and common academic standards for both basic degrees and advanced degrees. The S.T.B. is renamed Master of Divinity. The Toronto School of Theology will become the largest ecumenical consortium of theological schools in the world.\n\n1978: The Faculty of Divinity joins in the Toronto School of Theology Memorandum of Agreement with the University of Toronto. Henceforward, earned degrees in Divinity to be awarded conjointly by Trinity College and the University of Toronto, and all conjoint degree diplomas will bear the seal and signature of the college, University of Toronto and TST.\n\n2000: Trinity College theological library collection and Wycliffe College Library merge in the Theological Collection of the John W. Graham Library.\n\nOctober 2002"}, {"url": "https://intriguing-history.com/issac-newton-at-trinity-college-cambridge/", "page_content": "Isaac Newton at Trinity College Cambridge\n\nIsaac Newton at Trinity College Cambridge, one of many great scientific minds to attend the college. Isaac Newton would spend the majority of his life and all his academic life at Trinity. From this august company the Royal Society would also be formed and as today the people you meet as a student often stand the test of longer term relationships both professional and personal. Newton was no exception forming associations with Christopher Wren and the future Chancellor Montagu all from college connections.\n\nSummary of events around Newton and Trinity College\n\n1660, King Charles II was restored to the throne.\n\nDuring the critical period of transition that followed the death of Cromwell, the College was particularly fortunate in its Master’s\n\n“Their authority was very great but Wilkins, Ferne and Pearson, who occupied the Master’s Lodge in rapid succession during the years 1659 to 1662, were all moderate in temper, and acted with humanity and tact.”\n\nThe ten years of John Pearson’s Mastership were notable for the rapid rise to eminence in the University of the young Isaac Newton.\n\nNewton’s whole academic life, from 1661 to 1696, was spent at Trinity College Cambridge, first as an undergraduate and then as a Fellow from 1667.\n\nIsaac Barrow later succeeded Pearson as Master. It was Barrow who persuaded his friend Sir Christopher Wren to design the Wren Library (completed in 1695), the finest of the Trinity buildings.\n\nIt was Christopher Wren who had a number of connections with Newton, and whilst known by many for his architecture it was as an astronomer of note and a founder of the Royal Society that they were most closely connected.\n\nClick on these links more reflections on the connection between the Scientific Revolution and the Newton connection and the Enlightenment and the association with a number of the key intellects and personalities that rought about the climate in which the period of the Enlightenment could thrive.\n\n[geo_mashup_map height=300 width=350 zoom=11 map_content=”global”]\n\nResearch notes: from Cambridge Alumini lists: an extraordinary life…\n\nMatric. 1661; Scholar, 1664\n\nB.A. 1664-5\n\nM.A. 1668.\n\nFellow, 1667.\n\nRooms to the north of the great Gate. T\n\nLucasian Professor, 1669-1702. F.R.S., 1672.\n\nThe idea of universal gravitation occurred to him at Woolsthorpe in 1665 ‘as he sat alone in a garden.’ He had taken time away from Cambridge due to the plague and was working at home to avoid the health risks of London.\n\nThe Principia was published in 1687, the completion and publication of this work being due to Halley, who paid all expenses and corrected the proofs.\n\nM.P. for Cambridge University, 1689-90 and 1701-2.\n\nWarden of the Mint, 1696\n\nMaster of the Mint, 1699\n\nPresident of the Royal Society\n\n1703; re-elected annually for 25 years.\n\nKnighted, Apr. 15, 1705.\n\nInvolved in a bitter controversy with Leibnitz as to the priority of the discovery concerning fluxions.\n\nCorresponded with John Locke, the ENglish Philosopher on theological subjects.\n\nDied at Kensington, Mar. 20, 1726-7.\n\nBuried in Westminster Abbey\n\nBenefactor to the Chapels of Christ’s and Trinity, to Addenbrooke’s Hospital and the Cambridge Old Schools.\n\nThere is a statue to him by Roubiliac in the Ante-Chapel of Trinity College, and a bust in the Library.\n\nSeries Navigation\n\nShare this: WhatsApp\n\nFacebook\n\nTelegram\n\nTwitter\n\nPinterest\n\nSkype\n\nTumblr\n\nPrint\n\nMore\n\nLinkedIn\n\nReddit\n\n\n\n\n\nLike this: Like Loading..."}]}