{"John Burnham played for Derbyshire in 1871 and 1872, and then again in 1875 and 1876.": [{"url": "https://www.wikiwand.com/en/John_Burnham_(cricketer)", "page_content": "John William Burnham (6 June 1839 – 20 April 1914) was an English cricketer who played for Derbyshire between 1871 and 1876. He was a member of the team that played Derbyshire's first match in May 1871.\n\nEnglish cricketer\n\nQuick facts: Personal information, Full name, Born, D... ▼\n\nBurnham was born at Nottingham, the son of William Burnham, a joiner and his wife Catherine. He became a clerk and in 1863 he was playing for Suffolk and in one match for an All England XI. In 1870 he played several club games for Burnley. He joined Derbyshire in the 1871 season and took part in Derbyshire's first-ever match as a county side, an innings victory over Lancashire. He played the return game later in the season, and played again for Derbyshire in the 1872 season in both fixtures between Derbyshire and Lancashire. Also in 1872 he played some games for Prince's Club in London. In the 1873 season he only played one match for Derbyshire against Lancashire. He did not play again until the 1876 season when his final match, as a first-class player, was against Kent, in which he was bowled out by Test cricketer Charlie Absolom.\n\nBurnham was a right-handed batsman and played eleven innings in six first-class matches with an average of 5.00 and a top score of 31.[1] In 1881 he was living at Litchurch.[2] Burnham umpired one game during the 1879 season, three years after giving up the first-class game.\n\nBurnham died at Derby."}, {"url": "https://www.espncricinfo.com/player/john-burnham-10173", "page_content": "Zimbabwe\n\nAll\n\nAlphabetically sorted top ten of players who have played the most matches across formats in the last 12 months"}, {"url": "https://prabook.com/web/john.burnham/2239432", "page_content": "John Burnham\n\nJune 6, 1839 (age 74) Nottingham, United Kingdom\n\nHe became a clerk and in 1863 he was playing for Suffolk and in one match for an All England XI. In 1870 he played several club games for Burnley. He joined Derbyshire in the 1871 season and took part in Derbyshire\"s first-ever match as a county side, an innings victory over Lancashire. He played the return game later in the season, and played again for Derbyshire in the 1872 season in both fixtures between Derbyshire and Lancashire. Also in 1872 he played some games for Prince\"s Club in London. In the 1873 season he only played one match for Derbyshire against Lancashire. He did not play again until the 1876 season when his final match, as a first-class player, was against Kent, in which he was bowled out by Test cricketer Charlie Absolom. Burnham was a right-handed batsman and played eleven innings in six first class matches with an average of 5.00 and a top score of 31. In 1881 he was living at Litchurch. Burnham umpired one game during the 1879 season, three years after giving up the first-class game. Burnham died at Derby."}, {"url": "https://en-academic.com/dic.nsf/enwiki/5883641", "page_content": "John Burnham ( June 6 , 1839 – April 20 , 1914 ) was an English cricket er. He was a right-handed batsman who played for Derbyshire between 1871 and 1876. Burnham took part in Derbyshire's first-ever match as a county side, an innings victory over Lancashire, and four further matches between the two sides within the next two seasons. Burnham's final match as a first-class player, was a match against Kent, in which he was bowled out by Test cricketer Charlie Absolom .\n\nBurnham was an upper-middle order batsman. Burnham umpired one game during the 1879 season, three years after giving up the first-class game.\n\nExternal links"}, {"url": "https://peoplepill.com/people/john-burnham-2/", "page_content": "John William Burnham (6 June 1839 – 20 April 1914) was an English cricketer who played for Derbyshire between 1871 and 1876. He was a member of the team that played Derbyshire's first match in May 1871.\n\nBurnham was born at Nottingham, the son of William Burnham, a joiner and his wife Catherine. He became a clerk and in 1863 he was playing for Suffolk and in one match for an All England XI. In 1870 he played several club games for Burnley. He joined Derbyshire in the 1871 season and took part in Derbyshire's first-ever match as a county side, an innings victory over Lancashire. He played the return game later in the season, and played again for Derbyshire in the 1872 season in both fixtures between Derbyshire and Lancashire. Also in 1872 he played some games for Prince's Club in London. In the 1873 season he only played one match for Derbyshire against Lancashire. He did not play again until the 1876 season when his final match, as a first-class player, was against Kent, in which he was bowled out by Test cricketer Charlie Absolom.\n\nBurnham was a right-handed batsman and played eleven innings in six first class matches with an average of 5.00 and a top score of 31. In 1881 he was living at Litchurch. Burnham umpired one game during the 1879 season, three years after giving up the first-class game.\n\nBurnham died at Derby.\n\n\n\n"}, {"url": "https://wiki.alquds.edu/?query=John_Burnham_(cricketer)", "page_content": "English cricketer\n\nJohn William Burnham (6 June 1839 – 20 April 1914) was an English cricketer who played for Derbyshire between 1871 and 1876. He was a member of the team that played Derbyshire's first match in May 1871.\n\nBurnham was born at Nottingham, the son of William Burnham, a joiner and his wife Catherine. He became a clerk and in 1863 he was playing for Suffolk and in one match for an All England XI. In 1870 he played several club games for Burnley. He joined Derbyshire in the 1871 season and took part in Derbyshire's first-ever match as a county side, an innings victory over Lancashire. He played the return game later in the season, and played again for Derbyshire in the 1872 season in both fixtures between Derbyshire and Lancashire. Also in 1872 he played some games for Prince's Club in London. In the 1873 season he only played one match for Derbyshire against Lancashire. He did not play again until the 1876 season when his final match, as a first-class player, was against Kent, in which he was bowled out by Test cricketer Charlie Absolom.\n\nBurnham was a right-handed batsman and played eleven innings in six first-class matches with an average of 5.00 and a top score of 31.[1] In 1881 he was living at Litchurch.[2] Burnham umpired one game during the 1879 season, three years after giving up the first-class game.\n\nBurnham died at Derby."}, {"url": "https://cedarhillfoundation.org/notable-resident/john-henry-burnham/", "page_content": "John Burnham was born in Tolland, Connecticut. He enlisted in the Hartford City Guard in July 1861 and served as secretary of the company in 1861 and 1862.\n\nThe Civil War\n\nIn July of 1862, President Lincoln requested 300,000 volunteers. Hartford and surrounding towns responded by forming the 16th Regiment, Connecticut Volunteer Infantry. Lt. Col. Burnham joined the 16th Connecticut. He stayed with the regiment throughout the Civil War.\n\nIn May 1863, Burnham was wounded in battle in Suffolk, Virginia. He returned to service only to be captured by the Confederates following the surrender at the Battle of Plymouth. He was first taken to Libby Prison in Richmond, Virginia. Then to Camp Ogelthorpe in Macon, Georgia and finally to Charleston, South Carolina.\n\nBurnham was released in exchange for another prisoner. As luck would have it, while en route to his regiment, he was captured again. One evening, the Confederate captors were fired upon and Burnham was once again free to join his regiment. He continued to fight until the close of the war.\n\nPostmaster\n\nReturning to Hartford, Burnham continued his career in business. President Grant appointed him Deputy Postmaster of Hartford in October 1871. Then Postmaster in 1872. He left his job due to failing health in 1880.\n\nFailing Health\n\nBurnham’s physical and mental deterioration led to being admitted to the Retreat for the Insane in Hartford. With his health continuing to fail, he was moved to the State Hospital in Middletown.\n\nBurnham died in 1883 from a general breaking down of his body both mentally and physically. He was 46 years old."}, {"url": "https://curiosity.lib.harvard.edu/slavery-abolition-emancipation-and-freedom/feature/reconstruction-1865-1877", "page_content": "Reconstruction, 1865-1877\n\nDonald Brown, Harvard University, G6, English PhD Candidate\n\nNo period in American history has had more wide-reaching implications than Reconstruction. However, white supremacist mythologies about those contentious years from 1865-1877 reigned supreme both inside and outside the academy until the 1960s. Columbia University’s now-infamous Dunning School (1900-1930) epitomizes the dominant narrative regarding Reconstruction for over half of the twentieth century. From their point of view, Reconstruction was a tragic period of American history in which vengeful White Northern radicals took over the South. In order to punish the White Southerners they had just defeated in the Civil War, these Radical Republicans gave ignorant freedmen the right to vote. This resulted in at least 2,000 elected Black officeholders, including two United States senators and 21 representatives. In order to discredit the sweeping changes taking place across the American South, conservative historians argued this period was full of corruption and disorder and proved that Black Americans were not fit to leadership or citizenship.\n\nThanks to the work of a number of Black and leftist historians—most notably John Roy Lynch, W.E.B. Du Bois, Willie Lee Rose, and Eric Foner—that negative depiction of Reconstruction is being overturned. As Du Bois famously wrote in Black Reconstruction in America (1935), this was a time in which “the slave went free; stood for a brief moment in the sun; and then moved back again toward slavery.” During that short time in the sun, underfunded biracial state governments taxed big planters to pay for education, healthcare, and roads that benefited everyone. There is still much more to be unpacked from this rich period of American history, and Houghton Library contains a wealth of material to further buttress new narratives of that era.\n\nBricks without straw ; a novel Reconstructing Reconstruction While some academics, like those of the Dunning School, interpreted Reconstruction as doomed to failure, in the years immediately following the Civil War there were many Americans, Black and White, who saw the radical reforms as being sabotaged from the outset. Writer and civil rights activist Albion W. Tourgée published his best selling novel Bricks Without Straw in 1880. Unlike most White authors at the time, Tourgée centered Black characters in his novel, showing how the recently emancipated were faced with violence and political oppression in spite of their attempts to be equal citizens.\n\nIn this period, two of the most iconic amendments were implemented. The Fourteenth Amendment ratified several crucial civil rights clauses. The natural born citizenship clause overturned the 1857 supreme court case, Dred Scott v. Sandford, which stated that descendants of African slaves could not be citizens of the United States. The equal protection clause ensured formerly enslaved persons crucial legal rights and validated the equality provisions contained in the Civil Rights Act of 1866. Even though many of these clauses were cleverly disregarded by numerous states once Reconstruction ended, particularly in the Deep South, the equal protection clause was the basis of the NAACP’s victory in the Supreme Court decision in Brown v. Board of Education (1954). The Fifteenth Amendment guaranteed another important civil right: the right to vote. No longer could any state discriminate on the basis of race, color, or previous condition of servitude. At Houghton, we have proof of the exhilarating response Black Americans had to the momentous progress they worked so hard to bring about: Nashvillians organized a Fifteenth Amendment Celebration on May 4, 1870. And once again, during the classical period of the Civil Rights Movement, leaders appealed to this amendment to make their case for what became the Voting Rights Act of 1965.\n\nThe Reign of Kings Alpha and Abadon Lorenzo D. Blackson's fantastical allegory novel, The Rise and Progress of the Kingdoms of Light & Darkness ; Reign of Kings Alpha and Abadon (1867), is one of the most ambitious creative efforts of Black authors during Reconstruction. A Protestant religious allegory in the lineage of John Bunyan's The Pilgrim's Progress, Blackson's novel follows his vision of a holy war between good and evil, showing slavery and racial oppression on the side of evil King Abadon and Protestant abolitionists and freemen on the side of good King Alpha. The combination of fantasy holy war, religious pedagogy, and Reconstruction era optimism provide a unique insight to one contemporary Black perspective on the time.\n\nIt is important to emphasize that these radical policy initiatives were set by Black Americans themselves. It was, in fact, from formerly enslaved persons, not those who formerly enslaved them, that the most robust notions of freedom were imagined and enacted. With the help of the nation’s first civil rights president, Ulysses S. Grant (1869-1877), and Radical Republicans, such as Benjamin Franklin Wade and Thaddeus Stevens, substantial strides in racial advancement were made in those short twelve years. Houghton Library is home to a wide array of examples of said advancement, such as a letter written in 1855 by Frederick Douglass to Charles Sumner, the nation’s leading abolitionist. In it, he argues that Black Americans, not White abolitionists like William Lloyd Garrison, founded the antislavery movement. That being said, Douglass was appreciative of allies, such as President Grant, of whom he said: “in him the Negro found a protector, the Indian a friend, a vanquished foe a brother, an imperiled nation a savior.” Houghton Library also houses an extraordinary letter dated December 1, 1876 from Sojourner Truth, famous abolitionist and women’s rights activist, who could neither read nor write. She had someone help steady her hand so she could provide a signed letter to a fan, and promised to also send her supporter an autobiography, Narrative of Sojourner Truth: A Bondswoman of Olden Time, Emancipated by the New York Legislature in the Early Part of the Present Century: with a History of Her Labors and Correspondence.\n\nIn this hopeful time, Black Americans, primarily located in the South, were determined to use their demographic power to demand their right to a portion of the wealth and property their labor had created. In states like South Carolina and Mississippi, which were majority Black at the time, and Louisiana, Alabama, and Georgia, with Black Americans consisting of nearly half of the population, the United States elected its first Black U.S. congressmen. Now that Black Southern men had the power to vote, they eagerly elected Black men to represent their best interests. Jefferson Franklin Long (U.S. congressman from Georgia), Joseph Hayne Rainey (U.S. congressman from South Carolina), and Hiram Rhodes Revels (Mississippi U.S. Senator) all took office in the 41st Congress (1869-1871). These elected officials were memorialized in a lithograph by popular firm Currier and Ives. Other federal agencies, such as the Freedmen’s Bureau, also assisted Black Americans build businesses, churches, and schools; own land and cultivate crops; and more generally establish cultural and economic autonomy. As Frederick Douglass wrote in 1870, “at last, at last the black man has a future.”\n\nBlack Americans quickly took full advantage of their newfound freedom in a myriad of ways. Alfred Islay Walden’s story is a particularly remarkable example of this. Born a slave in Randolph County, North Carolina, he only gained freedom after Emancipation. He traveled by foot to Washington, D.C. and made a living selling poems and giving lectures across the Northeast. He also attended school at Howard University on scholarship, graduating in 1876, and used that formal education to establish a mission school and become one of the first Black graduates of New Brunswick Theological Seminary. Walden’s Miscellaneous Poems, Which The Author Desires to Dedicate to The Cause of Education and Humanity (1872) celebrates the “Impeachment of President Johnson,” one of the most racist presidents in American history; “The Election of Mayor Bowen,” a Radical Republican mayor of Washington, D.C. (Sayles Jenks Bowen); and Walden’s own religious convictions, such as in “Jesus my Friend;” among other topics.\n\nBlack newspapers quickly emerged during Reconstruction as well, such as the Colored Representative, a Black newspaper based in Lexington, KY in the 1870s. As editor George B. Thomas wrote in an “Extra,” dated May 25, 1871: “We want all the arts and fashions of the North, East and Western states, for the benefit of the colored people. They cannot know what is going on, unless they read our paper.... Now, we want everything that is a benefit to our colored people. Speeches, debates, and sermons will be published.”"}, {"url": "https://www.wikitree.com/wiki/Burnham-3678", "page_content": "John Burnham\n\n1784 in Alfreton, Derbyshire, England Bornin\n\nof John Burnham Sonofand [mother unknown]\n\nElizabeth (Jepson) Burnham Husband of— married 1 Apr 1811 in South Normanton, Derbyshire, England\n\n[children unknown]\n\n1868 at about age 84 in Pye Bridge, Derbyshire, England Diedin\n\nProfile last modified 23 Jan 2022\n\nThis page has been accessed 24 times.\n\nBiography\n\nJohn son of John Burnham was christened in Alfreton, Derbyshire, on 22 January 1784.[1]\n\nHe married Elizabeth Jepson in South Normanton on 1 April 1811. Their brothers William Burnham and George Jepson were witnesses.[2]\n\nIn the 1841 census John (age 55) was in Hill Top, Swanwick, Derbyshire, England.[3]\n\nName Sex Age Occupation Birth Place John Burnham 55 labourer Y Elizabeth Burnham 65 Y Luke Burnham 20 coal miner Y John Burnham 20 do Y Elizabeth Burnham 15 Y William Burnham 10 Y\n\nIn the 1851 census John (age 68) was the father-in-law of Samuel Slater in Pye Bridge, Derbyshire, England.[4]\n\nIn the 1861 census John (age 78) was the father-in-law of Samuel Slater in Somercotes, Derbyshire, England.[5]\n\nJohn Burnham of Pye Bridge aged 87 was buried on 2 April 1868 in Riddings, Derbyshire, England.[6]\n\nSources\n\n\"England, Derbyshire, Church of England Parish Registers, 1537-1918,\" database with images, FamilySearch (https://www.familysearch.org/ark:/61903/1:1:QP8C-XQJH : 8 September 2021), John Burnham, 22 Jan 1784; citing 22 Jan 1784; citing Baptism, Alfreton, Derbyshire, England, Derbyshire Record Office, England.\n\n\"England and Wales Census, 1841,\" database with images, FamilySearch (https://familysearch.org/ark:/61903/1:1:M7SY-JPQ : 28 May 2019), John Burnham, Alfreton, Derbyshire, England, United Kingdom; from \"1841 England, Scotland and Wales census,\" database and images, findmypast (http://www.findmypast.com : n.d.); citing PRO HO 107, The National Archives, Kew, Surrey."}, {"url": "https://www.historians.org/research-and-publications/perspectives-on-history/october-2017/john-c-burnham-(1929%E2%80%932017)", "page_content": "Historian of American Psychology and Psychiatry\n\nJohn Chynoweth Burnham, professor of history at Ohio State University (OSU) from 1963 to 2002, died on May 12, 2017. Best known for his work in the history of science and medicine and described as “the dean” of his fields by historian Dorothy Ross, John had a reach that far exceeded his fields of scholarly expertise.\n\nJohn was born on July 14, 1929, in Boulder, Colorado. After graduating from West Seattle High School in Washington state (he was proud of his excellent urban public-school education), he accepted a scholarship to Stanford University, where he took his bachelor’s degree. He went “east,” as he put it, to the University of Wisconsin for his master’s degree, after which he returned to Stanford for his PhD (1958). John always talked more about his teachers than his schools. After he informed his seminar students that the course descended directly from Frederick Jackson Turner, he went through the lineage of his teachers and theirs. He taught students never to stop asking questions and searching for answers, and he expected deep research, concise writing, and historiographical significance.\n\nJohn’s own work regularly disrupted traditional historiography, and altogether, he created and enjoyed an enviable career that extended far beyond his retirement. He spent most of his academic career at OSU, but he also taught and held prestigious research fellowships at the universities of Sydney, Cambridge, Chicago, and Melbourne; Stanford and Johns Hopkins universities; Bowdoin College; and numerous other institutions. He was president of the American Association for the History of Medicine (AAHM) from 1990 to 1992 and edited the Journal of the History of the Behavioral Sciences from 1997 to 2000. He lectured internationally, and scholars have published anthologies and held special conferences to celebrate the significance of his pioneering work to their fields. John published 10 monographs and nearly a hundred articles over the course of his career. His last book, Health Care in America (2015), is a masterful history of medical practice in the United States that stands as a fitting culmination of his scholarship.\n\nJohn was deadly serious about his work and historical scholarship generally. He did not suffer fools gladly, and he had a tough, often unreadable shell. He was also kind, generous, and concerned about other people’s happiness. Susan Reverby described him as “an early supporter of young scholars within the AAHM and wherever we turned up to give papers if he was at the same meetings.” James Gilliam, who studied Chinese history at OSU, was John’s teaching assistant during the early 1980s and said that John was “as much or more responsible for my earning my PhD as anyone on my committee.” John and his wife of 59 years, Marjorie Spencer Burnham, always hosted newcomers to the history department soon after their arrival. In 2001, Marjorie founded a history of medicine lecture series for the OSU Medical Heritage Center and the history department. They were also instrumental in the funding of an endowed lectureship in the medical school. When two colleagues died, John located their manuscripts and found people to finish them; both books won prizes.\n\nAs serious as John was about scholarship, he had a wicked and deadpan sense of humor. He could appreciate being the subject of the joke himself. After he told me about the fabulous prize his book After Freud Left (2012) had just won, I asked, “Which prize?” He answered that it was for the cover. (The designer really was brilliant.) Although it might not have been a joke (one could not always tell with John), when it came time to talk with one of his children about sex, John presented him with a two-volume work on sex education and insisted that he would answer any questions his son had once he finished reading it.\n\nJohn will long be remembered not only for his contributions to the history of medicine, psychology, psychiatry, science, technology, and culture, but also for all the ways he supported his university, his profession, and countless individuals in and outside the profession.\n\nStephanie J. Shaw\n\nOhio State University\n\n\n\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License. Attribution must provide author name, article title, Perspectives on History, date of publication, and a link to this page. This license applies only to the article, not to text or images used here by permission.\n\nThe American Historical Association welcomes comments in the discussion area below, at AHA Communities, and in letters to the editor. Please read our commenting and letters policy before submitting."}]}