{"John Burnham scored his highest first-class score of 73 against Lancashire in 1871.": [{"url": "https://www.theguardian.com/sport/live/2022/jul/13/cricket-county-championship-lancashire-somerset-yorkshire-surrey-live-updates", "page_content": "13 Jul 2022 22.21 BST Pollock guides Worcestershire to victory Tanya Aldred A Baz-balling Ed Pollock bamboozled Middlesex to set up a seven-wicket victory for Worcestershire on a capricious Merchant Taylors’ pitch. His 113, in just 77 balls, included seven sixes which crashed into various festival tents, endangering ice creams and scorecards alike. His highest score also made easy pickings of a target of 238 and, after Pollock eventually fell going for another whopper, the captain Brett D’Oliveira hurried his side over the line. “After the last 10 weeks, where I haven’t scored a bean, I was thinking: ‘I’ve got in, I’m going to make this count,’” Pollock said. “I owe the team a lot of runs, I had a lot of making up to do.” A three-day victory also for Essex, who wrapped up the remaining four Gloucestershire wickets – Simon Harmer dusting his lapel with eight for 112, 13 for 156 in the match. The winless Gloucestershire could at least be buoyed by the performance of Zafar Gohar, who hit 81 from 75 balls to ensure Essex needed to bat again. High-scoring draws seemed inevitable at Scarborough, where Surrey’s Rory Burns was finally out for 132, and Yorkshire’s Dom Bess toiled away for five for 126; and Southport, where Keaton Jennings danced to 318 against Somerset, only the sixth Lancashire player to join the triple-century club. There were also centuries for Derbyshire’s Brooke Guest and Leus du Plooy, the Leicestershire trio of Louis Kimber, Wiaan Mulder and Colin Ackermann and Glamorgan’s Eddie Byrom and Sam Northeast.\n\nUpdated at 14.48 BST\n\n13 Jul 2022 16.59 BST Right, I’m going to have to disappear to write up as I have to make a quick getaway today. If any of you will be at Russell Seymour’s climate talk at Gloucestershire CCC later this eve, please come and say hello.\n\n\n\n13 Jul 2022 16.50 BST And a great effort by Leicestershire in the battle for the Division Two wooden spoon: 439-4, 149 behind. Centuries for Kimber and Ackermann, a near miss for Patel and Mulder fast approaching on 94.\n\n\n\n13 Jul 2022 16.47 BST Hundreds for Leus du Plooy and Brooke Guest From 36-4, great riches. Derbyshire now 260 for four: du Plooy 117 , Guest 109.\n\n\n\n13 Jul 2022 16.39 BST Quite the afternoon session at Trafalgar Road, which slightly passed me by what with curating items for the new museum and concentrating on Worcestershire’s win. Jennings now has 224, just 14 short of the 238 he made at the Roses game at Headingley. Two double centuries in the season for the nicest man in cricketTM. Beautiful day and an absolutely thrilling session of cricket. Brilliantly set up now... https://t.co/FHFIWjQ6Z8 — Jamie Bowman (@JamieBowman77) July 13, 2022\n\n\n\n13 Jul 2022 16.08 BST Worcestershire beat Middlesex by seven wickets! Merchant Taylors’ School: Middlesex 188 and 240 v Worcestershire 191 and 238-3 Dolly does it, but Ed Pollock set the platform. Bravo!\n\n\n\n13 Jul 2022 15.58 BST Tea-timeish scores DIVISION ONE Chelmsford: Essex 310 and 79-1 BEAT Gloucestershire 136 and 252 The Rose Bowl: Hampshire 370-9dec v Warwickshire 217 and 145-6 Canterbury: Kent 335 v Northants 303 and 125-3 Trafalgar Road: Lancashire 443-2 v Somerset 446 North Marine Road: Yorkshire 521 v Surrey 410-6 DIVISION TWO Chester-le-Street: Durham 296 v Derbyshire 283 and 225-4 Sophia Gardens: Glamorgan 318 and 302-4 v Nottinghamshire 285 Merchant Taylors’ School: Middlesex 188 and 240 v Worcestershire 191 and 226-3 Hove: Sussex 588-9 v Leicestershire 388-4\n\n\n\n13 Jul 2022 15.41 BST “If we’re getting this museum going,” says Tom Hopkins with impressive enthusiasm, “can we check if Allan Donald still has Athers’ signed glove knocking around?” I didn’t know this, but you’re quite right - he seems to have given Donald his glove from the famous duel, with the giveaway red mark on the glove signed and circled. However, it was handed over for Donald’s benefit auction, so we might struggle to get our hands on it. Love you, Mike. Photograph: Clive, Mason/ALLSPORT\n\n\n\n13 Jul 2022 15.36 BST The spirit of Shan Masood lives on at Derbyshire, where du Plooy and Guest have put on 166. Derbyshire 203-4, a lead of 190 over Durham. “On the subject of Mike Gatting,” continues Steve Cox. “I was thinking about him on a recent camping holiday (sad I know). He was obviously a very talented batsman and England Captain but when I hear his name I think of. ! Ball of the Century 2 Swearing at the umpire in Pakistan 3 The reverse sweep in the World Cup final 4 Elasticated cricket trousers 5 Taking a catch, throwing the ball in the air then trying, and failing, to catch it again 6 Barmaids 7 Food poisoning from a dodgy Chinese in India “History can be so unfair sometimes.” So true. But I’d also add the rebel tour to that list, which, aside from being a more than dubious moral choice, was a complete disaster. The ANC had been unbanned so demonstrators followed the tourists everywhere, Ali Bacher later admitted that he was worried Gatting might be killed and the tour, funded by the apartheid governement, was eventually cut short.\n\n\n\n13 Jul 2022 15.11 BST Ed Pollock out for a rollicking 113, but he’s more than done his job - Worcs need only another 68 to win. Keaton Jennings is still in, for a more sedate 162. Lancs 369-1. Does anyone happen to be at Trafalgar Road? Is there an obvious reason why Virdi hasn’t bowled more than 11 overs? He doesn’t seem to have been that expensive.\n\n\n\n13 Jul 2022 14.56 BST Eddie Byrom’s majestic innings comes to an end at Sophia Gardens, lbw to Liam Patterson-White for 144. A fifth first-class century. Glamorgan 259-3, a more than handy lead of 292 over Notts. Eddie Byrom - ton time. Photograph: Ryan Hiscott/Getty Images Against the new ball, chasing 238 ... as per Ben Stokes the other week: \"People know what they have to do to bang the door down and get in this team.\" https://t.co/vRTgtUyvHY — Ali Martin (@Cricket_Ali) July 13, 2022\n\nUpdated at 15.24 BST\n\n13 Jul 2022 14.48 BST “Surely,” writes Steve Cox, “you can’t leave out Mike Gatting’s elasticated trousers.” A few bits of memorabilia from this moment in time: Mike Gatting bowled by the ball of the century. Photograph: Adrian, Murrell/ALLSPORT\n\n\n\n13 Jul 2022 14.37 BST A hundred for Ed Pollock! And a seventh... and shortly afterwards, his century! 67 balls, seven sixes, nine fours, making a tough pitch look like an eiderdown. Baz-balling, as Tom Petty nearly sang. Ed Pollock: Bazballing Photograph: Richard Heathcote/Getty Images\n\n\n\n13 Jul 2022 14.31 BST I see Josh Bohannon has eased his way to 60 (polishes her lapels). Lancs 306-1, Jennings 130 not out.\n\n\n\n13 Jul 2022 14.28 BST “A cricket clothing museum?” writes Simon McMahon. “Viv’s maroon cap was one of the things that got me into cricket. Would his chewing gum count? Warnie’s floppy hat would have to be there too. Maybe anything worn by Jack Russell. And Dickie Bird’s umpire coat and flat cap.” Meanwhile, at Merchant Taylors’, Ed Pollock smacks a fifth six into the Worcestershire tent - 79 not out as Worcestershire chase another 121 to win. Maybe, just maybe, with nine wickets left, Ed Barnard will not have to pad up.\n\n\n\n13 Jul 2022 14.22 BST Surrey stumbling, if that’s what you can call 307-5 . Was somehow expecting them to declare at 750-6 tomorrow lunchtime. Anyway, Will Jacks is bowled by a sweaty Thompson for just seven.\n\n\n\n13 Jul 2022 14.09 BST Essex beat Gloucestershire by nine wickets Chelmsford: Essex 310 and 79-1 BEAT Gloucestershire 136 and 252 Essex 22 points, Gloucestershire two points.\n\nWhich leaves poor winless Gloucestershire stuck at the foot of the table in west-country solidarity; and Essex on the tails of the top three.\n\n\n\n13 Jul 2022 14.05 BST “Can I suggest a triptych of a millinery kind for a clothing museum: Hoopers wide brim maroon hat; Waugh’s baggy green; and Greig’s crash helmet?Elsewhere perhaps, Jack Russell’s sunhat in it’s end of career incarnation.” I like it Geoff Wignall!\n\n\n\n13 Jul 2022 13.05 BST Lunchtime-ish scores DIVISION ONE Chelmsford: Essex 310 and 47-1 v Gloucestershire 136 and 140-6 The Rose Bowl: Hampshire 370-9dec v Warwickshire 217 and 72-2 Canterbury: Kent 335 v Northants 303 and 27-0 Trafalgar Road: Lancashire 270-1 v Somerset 446 North Marine Road: Yorkshire 521 v Surrey 281-3 DIVISION TWO Chester-le-Street: Durham 296 v Derbyshire 283 and 103-4 Sophia Gardens: Glamorgan 318 and 172-1 v Nottinghamshire 285 Merchant Taylors’ School: Middlesex 188 and 240 v Worcestershire 191 and 56-0 Hove: Sussex 588-9 v Leicestershire 248-3\n\n\n\n13 Jul 2022 13.00 BST Did you see that Andy Burnham’s King of the North jacket is now on display at Manchester’s People’s History Museum? We've a #mustsee at the museum!@AndyBurnhamGM 's workers’ jacket on display until early Sept@artfund #MuseumOfTheYear 2022 shortlisted museum https://t.co/C6V0QspxMX — People's History Museum (PHM) (@PHMMcr) July 13, 2022 I’m sure various bits of clothing are sitting in various cricket museums, but what would you nominate for display? I’ll start: 1 Rachael Heyhoe Flint’s travelling outfit, that she managed to negotiate out of M and S for one of England women’s overseas tours. 2 Jack Richards’ cravat. 3 Viv’s maroon cap.\n\nUpdated at 13.05 BST\n\n13 Jul 2022 12.53 BST A hundred for Keaton Jennings! Runs, runs, runs for the Roses at the seaside. Jennings eases to 107 in Lancs’ 258-2. At Scarborough, Burns is not out 127, but he must rebuild with Ben Foakes after a wicket each for Bess and Thompson. Amla, it turned out, wasn’t up for three figures today, caught for 79. Surrey 274-3.\n\n\n\n13 Jul 2022 12.43 BST Cook goes! Essex 21-1, the booty to the wild man of the west country, Ryan Higgins.\n\nUpdated at 12.43 BST\n\n13 Jul 2022 12.42 BST An email, which managed to end up in my junk box earlier in the week, apologies to Mike Hill. More memories of John Gwynne: “John joined Whalley Range CC in 1960, and played for nearly 12 years. He left the club at at the tea interval in a match at South West Manchester in the early 70s, after an argument with the skipper. When bridges were built and we all became firm friends again, somebody pointed out he still owed his match fee… plus interest!!!”\n\nI don’t think I mentioned that Lancs were wearing black armbands in his memory at Southport. He will be dearly missed by darts lovers too. A terribly sad day with the passing of my friend John Gwynne…. A giant of a man, a giant voice and a huge personality….reunited with Sid Waddell & Dave Lanning - the darting holy trinity …. — Stuart Pyke (@stuartpykesport) July 9, 2022\n\n\n\n13 Jul 2022 12.30 BST There’s always a stat when Harmer’s about: Harmer takes consecutive 12 wicket hauls in FC cricket for the 2nd time in his career.@EssexCricket — James McCaghrey (@McLovinstatto) July 13, 2022 or two: Since 2002 in CC cricket\n\nMost 9+ wicket Hauls\n\n2- Harmer, Kasprowicz\n\n\n\nMost 8+ wicket Hauls\n\n7- Harmer\n\n3- Kabir Ali\n\n\n\nMost 7+ Wicket Hauls\n\n10- Harmer\n\n8- Mushtaq\n\n\n\n343 wickets at 20.31\n\n23.5% of his Innings have 5 wicket hauls, since 2002 with 25+ matches only Mushtaq is more regular. — James McCaghrey (@McLovinstatto) July 13, 2022\n\nUpdated at 12.31 BST\n\n13 Jul 2022 12.27 BST Kent slumping in the morning heat. Solid work in the middle order dusting to not much, a first-innings lead of just 32 over Northants. Sanderson finishes with 4-63, White 4-62. 109.2 | Sanderson wraps it up. 💪\n\n\n\nHis fourth for the innings, Cobb taking the catch.\n\n\n\nKent 335 all out, a lead of 32. pic.twitter.com/tjKW76FYGQ — Northamptonshire CCC (@NorthantsCCC) July 13, 2022\n\n\n\n13 Jul 2022 12.18 BST Zafar Gohar! Harmered at the last, but not until he thrashed 81 from an increasingly irritated Essex. And in the time it takes me to refresh the page, it’s all over. Harmer 8-112. Glos 252 all out. Essex need just 79 to win.\n\n\n\n13 Jul 2022 12.13 BST This is going to be the day Josh Bohannon re-finds his Championship form: four fours so far on the Southport deck.\n\n\n\n13 Jul 2022 12.04 BST Lloyd and Byrom making it look easy at Sophia Gardens, Glam 112-0; while Rushworth has picked up a third, and Salisbury a first, at Chester le Street. Derby 44-4.\n\n\n\n13 Jul 2022 12.03 BST Just browsing all the enjoyable chat BTL, wasn’t expecting six degrees of separation between CCLive and Rishi Sunak - who I learnt today is the same height as Tendulkar. Anyway, to Division Two, where Kimber was lbw shortly after raising his bat, for 104. A second for Finn: Leicestershire 203-2. Middx have now made the highest total of the game in their second innings, despite losing TRJ and Tom Helm. The whack-a-day runs coming from newbie Umesh Yadav, with a 35 ball 42 and counting. Middx 238-9.\n\nUpdated at 12.07 BST\n\n13 Jul 2022 11.41 BST A hundred for Rory Burns! Hundred happy hour. Now Burns joins the club, at Scarborough. Surrey 216-1, with Amla coming up quickly on the inside.\n\n\n\n13 Jul 2022 11.22 BST A hundred for Louis Kimber A second maiden Championship century of the round, after Lewis Goldsworthy. Well played! Leics 174-2.\n\n\n\n13 Jul 2022 11.20 BST A wicket at Chelmsford! And it isn’t Harmer. Jamie Porter spoils Harmer’s figures, bowling Ollie Price for 43. Gloucs 149-7, 25 behind, and slipping towards a post lunch slink away.\n\n\n\n13 Jul 2022 11.18 BST A hundred for Luke Wells! Three figures notched up even before the final greetings of the morning at Trafalgar Road had been made. A long day ahead for Somerset in the field. Hope they sustained themselves at the Birkdale cheese shop beforehand.\n\n\n\n13 Jul 2022 10.00 BST Scores on the doors DIVISION ONE Chelmsford: Essex 310 v Gloucestershire 136 and 140-6 The Rose Bowl: Hampshire 370-9dec v Warwickshire 217 and 11-0 Canterbury: Kent 287-5 v Northants 303 all out Trafalgar Road: Lancashire 164-0 v Somerset 446 North Marine Road: Yorkshire 521 v Surrey 191-1 DIVISION TWO Chester-le-Street: Durham 296 v Derbyshire 283 and 19-2 Sophia Gardens: Glamorgan 318 and 53-0 v Nottinghamshire 285 Merchant Taylors’ School: Middlesex 188 and 180-6 v Worcestershire 191 all out Hove: Sussex 588-9 v Leicestershire 159-1\n\n\n\n13 Jul 2022 10.00 BST Tuesday's round-up The Essex old hands, Simon Harmer and Alastair Cook, made hay against a beaten-down Gloucestershire. Cook’s 73rd first-class hundred came up with a back-foot glide. His 145 made up nearly half of Essex’s total, Zafar Gofar grabbing five for 84. Gloucestershire’s second innings then sank into an inevitability vortex as Harmer, who had taken five wickets in the first innings at Chelmsford, picked up five more. Amar Virdi, on loan to Somerset, didn’t find things as much to his liking as Lancashire’s Luke Wells and Keaton Jennings got stuck into the spinners, putting on 164 at Southport. Wells had to chew his evening meal on 99 not out. There were no easy runs for England’s out-of-sorts Zak Crawley, out dabbing to midwicket for five, but Kent got within a sniff of Northamptonshire thanks to three scores of 63. England’s Alex Lees also fell for single figures in a topsy‑turvy Durham scorecard, where a wagging tail gave them a slim lead against Derbyshire. It was the Ed Barnard show again at Merchant Taylor’s School as his unbeaten 69 gave Worcestershire a slim lead over Middlesex, who then built a credible second-innings total with bits and pieces. At Hove, Lewis Kimber and Rishi Patel helped Leicestershire to recover from losing Hassan Azad to the first ball of the innings, after Sussex flogged 589. Ian Holland rediscovered his form with 99 for Hampshire against Warwickshire, while Nottinghamshire suffered an unbecoming collapse against Glamorgan, losing six for 30 after Haseeb Hameed had made a fluent 70. Another former England opener, Rory Burns, finished unbeaten on 94 for Surrey after Adam Lyth and Jonny Tattersall notched up Yorkshire’s first triple-century stand for the sixth wicket.\n\n"}, {"url": "https://www.theguardian.com/sport/live/2021/sep/01/lancashire-v-warwickshire-hampshire-v-yorkshire-and-more-county-cricket-live", "page_content": "1 Sept 2021 17.37 BST Just popping back to say another new ball wicket has fallen at Old Trafford! Yates is beaten for sheer pace by Saqib Mahmood and away his off stump rolls.\n\n\n\n1 Sept 2021 17.34 BST And with the news that Hampshire have lost their first wicket, and Warwickshire are 4-0 after 5.3 overs, I must write up the round-up.\n\n\n\n1 Sept 2021 17.32 BST Nottinghamshire beat Somerset by an innings and 160 runs! Somerset 107 and 181 v Nottinghamshire 448. Nottinghamshire 23 points, Somerset 2. Back to the drawing board at Taunton; Notts march on. And Andy Smith would like it known that it wasn’t only Somerset who were shorn of players. Notts are missing: Ball, Broad and Hameed.\n\nUpdated at 17.32 BST\n\n1 Sept 2021 17.06 BST Lancashire all out! Parky lbw for 3. Norwell 6-57, a deficit of 30. And Gary Ballance reaches a barnstorming ton at the Rose Bowl, a ground where he loves to bat. Off just 85 balls, biffing four fours and seven sixes. And Yorkshire have declared leaving Hampshire to score 393 to win. It should be a walkover...\n\n\n\n1 Sept 2021 16.58 BST And Bohannon finally leaves the field, stumped for 170, as the sun pulls back the grimy lace curtain to smile on Old Trafford. A smashing innings, which took Lancashire to safety and beyond.\n\n\n\n1 Sept 2021 16.52 BST Jack Leach leaves the field Stumped for 35. Marchant de Lange is keeping it lively, swatting Paterson for six, his third. but with 184 to make Notts bat again, this is an evening’s final whimper.\n\n\n\n1 Sept 2021 16.43 BST The Division One table as it stands with bonus points Warwickshire 25.o\n\nSomerset 20.5 Lancashire 20.5 Nottinghamshire 12.0 Hampshire 11.5 Yorkshire 8.5\n\n\n\n\n\n1 Sept 2021 16.40 BST Kent beat Leicestershire by 132 runs!!! Leicestershire 109 and 253 Kent 232 and 262 Kent’s first win of the season! A thrashing for Leicestershire, but a flush of warmth from the face-saving afternoon slogging.\n\n\n\n1 Sept 2021 16.28 BST Bailey falls , caught behind , to bring out a side-stepping Mahmood. He was interesting last night: “We have had some pretty flat pitches here but this is the flattest of the lot.\n\n“After a tough day yesterday I thought we stuck at it brilliantly this morning and from the position they were in to react like we did it’s an amazing fightback.\n\n“Six ball overs are quite hard! It was the first day back in the dirt for me since the end of May so I was slightly stiff this morning but it was good to get some overs in the bank I guess.\n\n“It was a tough old day yesterday and the body was feeling it but hopefully we can now bat all day and I can put my feet up.\n\n“The overs you bowl here at Old Trafford with the quality of the wickets are hard overs and obviously the square is like concrete so you can’t just place the ball - you really have to bowl hard into the wicket and there’s not much margin for error. Rather than bowling 20 overs on a green seamer where you can just put the ball where you want it it’s a lot tougher and from a skills point of view it takes some getting used to. Bohannon is unbeaten on 160. Lancs 321-8.\n\n\n\nCome hither to Old Trafford where you will find cakes from @mikebirty and jam from @JamieBowman77 pic.twitter.com/4YPsD1q0zG — tanya aldred (@tjaldred) September 1, 2021\n\n\n\n1 Sept 2021 16.12 BST A sensational last hurrah by the Leicestershire tail: 58 not out from Ed Barnes, 28 not out from No.11 Will Davis - but with 163 more to win and only one wicket left, time is the only question. Milnes 6-53.\n\n\n\n1 Sept 2021 16.10 BST Tea time scores Division One\n\nOld Trafford: Lancashire 317-7 v Warwickshire 371 all out The Rose Bowl: Hampshire 163 v Yorkshire 243 and 216-3 Taunton: Somerset 107 and 98-7 v Nottinghamshire 448 Division Two\n\nThe Riverside: Durham v Surrey: cancelled (Covid) Sophia Gardens: Glamorgan 134 and 112 v Essex 320 Essex win by an innings and 74 runs Bristol: Gloucestershire 191 v Northamptonshire 327 and 34-3 Division Three\n\nNew Road: Worcestershire 213 v Sussex 264 and 149-5 Lord’s: Middlesex 282 and 256 v Derbyshire 205 all out DERBY NEED 334 TO WIN Grace Road: Leicestershire 109 all out and 222-9 v Kent 232 and 262 NOT TEA\n\n\n\n1 Sept 2021 15.53 BST This Division One table is looking tight assuming that Yorks win, Notts win and there is a draw at Old Trafford. Only Hampshire will be dropping off the pace.\n\n\n\n1 Sept 2021 15.52 BST Dane Paterson has 4 for 13, and Somerset are 98-7 in their second innings, 243 behind. Not even Jack Leach can bat out this one.\n\n\n\n1 Sept 2021 15.49 BST Mike Daniels sees us Josh Bohannon raises us Sam Hain: Before the Lancs media mafia (LMM) get busy bigging up Bohannon you should look no further than the scandalously overlooked Sam Hain for the “new Jonathan Trott”. I seem to remember he’s recently got a good score against the formidable Lancs attack which, if the LMM are to be believed, could all be picked for the next Test. Incidentally, I’ve just found out that the Lancashire electrician is called... James Anderson.\n\n\n\n\n\n1 Sept 2021 15.29 BST Seems Gary Ballance has come out with instructions to have a go: a couple of big sixes and a tasty four later, Yorks are 168-2, a lead of 248. Somerset, by comparison, have retreated into their souls.Goldsworthy 10 in an hour, Banton six in 42 balls. 73-4 and a lifetime behind.\n\n\n\n1 Sept 2021 15.20 BST Is the Josh Bohannon train building up a head of steam? Currently 147, and still looking as compactly unobtrusive as ever. Talk on the stream of an England Lions tour gig for Josh Bohannon @tjaldred, but isn't he the kind of orthodox, adhesive Number Three England need?\n\n\n\nThe more I see, the more Trottish he looks. — Gary Naylor (@garynaylor999) September 1, 2021\n\n\n\n1 Sept 2021 14.57 BST Movement at the Ageas Bowl, where George Hill has been caught for 55. Yorks 128-2 with an afternoon to build on their 208 lead. A plucky last wicket stand of 32 at Bristol between Taylor and Warner, Gloucestershire 195-9. Good old Ben Mike 54 not out in the wreckage of Leicestesrhire’s 102-7; while Middlesex have hobbled to 179-8, a lead of 256 over Derbyshire. Lammonby - mine eyes - is gone at Taunton. Somerset 62-4; and Sussex 98-5, a lead over Worcs of 149.\n\n\n\n1 Sept 2021 14.40 BST Ah. Livingstone carefully leaves one that pings on and removes his off stump, sending it scuttting towards the dressing room. Five for Norwell. Well bowled!\n\n\n\n1 Sept 2021 14.35 BST Livingstone has itchy feet. An inside edge makes its merry way through the slips for four. This could be worth watching.\n\n\n\n1 Sept 2021 14.29 BST James Hildreth falls at Somerset. A second for Luke Fletcher. We think Hildreth has one more year on his contract at Taunton. Wishing him a good one. 44-3.\n\n\n\n1 Sept 2021 14.21 BST Bish, bosh. Another one goes - Jones for a duck. Enter the Hundred Hero Livi. Norwell has 4-38\n\n\n\n1 Sept 2021 14.19 BST Division One table going into this round with points carried forwards Warwicks 21 Somerset 18.5 Lancs 16.5 Hampshire 8.5 Notts 5 Yorkshire 4,5 I’d looked for this in vain, thank goodness for Paul Edwards and his printouts.\n\n\n\n1 Sept 2021 14.17 BST A wicket! Vilas well caught at second slip by Yates for 67 scored at relatively quick time. Lancs 244-3.\n\n\n\n1 Sept 2021 14.03 BST So what to look out for this penultimate afternoon? Leicestershire have been briefly saved by rain at 20-6 in the second innings. Tom Kohler-Cadmore has fifty for Yorkshire, who have a lead of 187 against Hampshire. Somerset, I’m afraid, have lost Abell for 11. 39-2. I smell a rare Lammonby century though.\n\n\n\n1 Sept 2021 13.21 BST England's Under 19 Men's squad to play West Indies Rehan Ahmed (Leicestershire) Tom Aspinwall (Lancashire) Sonny Baker (Somerset) Nathan Barnwell (Surrey) George Bell (Lancashire) Jacob Bethell (Warwickshire) Josh Boyden (Lancashire) James Coles (Sussex) Alex Horton (Glamorgan) Dan Ibrahim (Sussex) Archie Lenham (Sussex) Will Luxton (Yorkshire) Harry Petrie (Hampshire) Tom Prest (Hampshire) James Rew (Somerset) James Sales (Northamptonshire) Fateh Singh (Nottinghamshire) George Thomas (Somerset)\n\n\n\n1 Sept 2021 13.14 BST Lunchtime scores (Oh! Leicestershire!) Division One\n\nOld Trafford: Lancashire 215-2 v Warwickshire 371 all out The Rose Bowl: Hampshire 163 v Yorkshire 243 all out and 102-1 Taunton: Somerset 107 and 35-1 v Nottinghamshire 448 Division Two\n\nThe Riverside: Durham v Surrey: cancelled (Covid) Sophia Gardens: Glamorgan 134 and 112 v Essex 320 Essex win by an innings and 74 runs Bristol: Gloucestershire 160-9 v Northamptonshire 327 Division Three\n\nNew Road: Worcestershire 213 v Sussex 264 and 37-3 Lord’s: Middlesex 282 and 128-4 v Derbyshire 205 all out Grace Road: Leicestershire 109 all out and 20-6 v Kent 232 and 262\n\n\n\n1 Sept 2021 12.59 BST Gloucestershire too are slipping into the mire. A second wicket for Simon Kerrigan (Procter has 4-38). At 155-9, they trail Northants by 172.\n\n\n\n1 Sept 2021 12.40 BST Josh Bohannon century! With a flick, it is his! He races back for a second and lifts his bat in the air. Bags of applause from the dressing room, and, softly, from the Warwickshire fielders too. Dane Vilas goes to his first fifty since April.\n\n\n\n1 Sept 2021 12.35 BST An email! From David Hindle. “Good to see the 4 day matches back again. I am watching Lancs vs.\n\nWarwickshire out of the corner of my eye. Excellent stuff again from\n\nBohannon. But you notice how slow the scoring is. Therein lies the\n\ndifference between test players and those who never get the call,\n\nperhaps. The test level batsmen would tend to find a way to score at\n\nthis stage of the game. They wouldn’t find the fielders as often. Is\n\nthat part of the reason why Bohannon, with a stack of runs this season,\n\nand a useful spare bowler, isn’t in the picture for an England call-up?\n\nAnd as I write, Vilas at te other end hits 3 fours in an over. Lancs\n\nneed to get a move on because of bonus points and a very, very remote\n\nchance of a win.” Thanks David. I reckon this is screwed on for a draw. The pitch is not helping the scoring rate, for anyone. And with that, Bohannon hits Yates for six to go to 98. Paul Edwards next to me reckons the mark of a Test batsman is more that they have a solid technique and are comfortable against high pace and good spin.\n\n\n\n1 Sept 2021 12.23 BST Somerset are following on. Bowled out for 107 and now 11-1. Davies for 2. This was Tom Abell’s harsh assessment yesterday: “We have been completely outplayed for two days, having had the better of conditions when bowling yesterday,” he said.”We didn’t take advantage of that and when we turned up this morning we talked about the fact that the game could go either way. The fact that we are now so far behind suggests we didn’t apply ourselves well enough at all.”It’s a good pitch for batting on, although there was some swing. When you reply to a total of over 400 you are under the pump and we haven’t shown enough character or backbone to cope with that.”\n\n\n\n1 Sept 2021 12.19 BST Apologies, Glenn Chapple just came up and talked about Lancashire’s Championship win ten years ago.\n\n\n\n1 Sept 2021 11.43 BST Essex beat Glamorgan by an innings and 74 runs in two and a bit days! Glamorgan 134 & 112 v Essex 320. Essex 22 points, Glamorgan 3 points. Sam Cook 5-37; Chris Cooke 47 not out.\n\n\n\n1 Sept 2021 11.33 BST Some action to report from OT: Luke Wells bowled by a cracker from Norwell that nipped in. And Bohannon has picked up where he left off yesterday.\n\n\n\n1 Sept 2021 11.28 BST Darren Stevens hundred!!!! The big wheel keeps on turning. 70 balls, 13 fours, six sixes! Kent 262-9, lead by 385. Dorian Gray: 107 not out Photograph: John Mallett/ProSports/REX/Shutterstock\n\nUpdated at 11.30 BST\n\n1 Sept 2021 11.19 BST A quick round up: Derbyshire are all out, with Ethan Bamber picking up his first five-fer of the season, for 205. Glamorgan are slipping, sliding to defeat, with Simon Harmer making the first breakthrough, and Sam Cook the second. Currently 97-8. Oh and Middlesex are now 0-1, with Stoneman making a golden duck on his first appearance for the club, bowled by Conners.\n\n\n\n1 Sept 2021 11.09 BST The drizzle turned to mizzle and the umpires marched them out anyway at Old Trafford. Floodlights on and chocks away. The hundred partnership between Bohannon and Wells arrives off 261 balls. Lancs 108-1. A gentle reminder that there will be a 10.30am start for the remainder of the rounds, to make up for the encroaching darkness at the end of the day.\n\n\n\n1 Sept 2021 10.35 BST Start of play scores Division One\n\nOld Trafford: Lancashire 100-1 v Warwickshire 371 all out The Rose Bowl: Hampshire 163 v Yorkshire 243 all out and 34-1 Taunton: Somerset 87-7 v Nottinghamshire 448 Division Two\n\nThe Riverside: Durham v Surrey: cancelled (Covid) Sophia Gardens: Glamorgan 134 all out and 71-6 v Essex 320 Bristol: Gloucestershire 90-6 v Northamptonshire 327 Division Three\n\nNew Road: Worcestershire 186-7 v Sussex 264 Lord’s: Middlesex 282 v Derbyshire 201-9 Grace Road: Leicestershire 109 all out v Kent 232 and 210-9\n\n\n\n1 Sept 2021 10.35 BST Tuesday' round-up Liam Patterson-White’s maiden first-class century sparked a spicy Nottinghamshire performance against a diminished Somerset, shorn of Lewis Gregory and Craig Overton. Notts biffed their way to 448, before slicing through the Somerset batting, starting with a wicket in the first over of the reply. Tom Abell, 35, was the only batsman to pass 12, as Somerset slithered to 87 for seven. Luke Fletcher finished with four for 21. James Vince top-scored for Hampshire, as Yorkshire totted up a first-innings lead of 80. Hampshire’s 163 was a recovery of sorts after Ben Coad and Matthew Fisher had reduced them to 16 for three. It was a dry old day at Old Trafford as Warwickshire inched to 371 with the urgency of a milk float. In reply, Lancashire lost George Balderson for a duck, but Josh Bohannon and Luke Wells put on 94 for the first wicket. Bohannon, on a dapper 59, averages 61.8 in the Championship this season. A two-wicket evening burst from Joe Sarro put Sussex in the driving seat at New Road, leaving Worcestershire trailing by 78. Happy days for a young Sussex team with an average age of 19 and not a cap between them. Glamorgan continued their best impression of a line of cascading dominoes after collapsing for the second time in two days. At one point captain Chris Cooke looked around the wreckage of his second innings to find the score 29 for six. He and Andrew Salter had added 42 by the close, but Essex still lead by 115. At Bristol, Gloucestershire were relieved of their burden at 90 for six when bad light stopped play. There were three wickets each for Ben Sanderson and Luke Procter. The Northants captain, Adam Rossington, made 94, his highest score of the season. Ethan Bamber’s four wickets left Middlesex on top against a struggling Derbyshire; while Darren Stevens’ 55 not out at Grace Road ensured the game scurried along like a swift chaser, with Leicestershire trailing by Kent 333.\n\n"}, {"url": "https://www.skysports.com/cricket/news/12123/12596965/county-championship-middlesex-thrash-glamorgan-josh-bohannon-scores-double-ton-for-lancashire", "page_content": "Josh Bohannon scored a double century and James Anderson took his first wicket of the season as Lancashire dominated day three of their LV= Insurance County Championship clash with Gloucestershire at Emirates Old Trafford.\n\nResuming the day on 289-3, Bohannon pressed his claims for an England Test spot when the series against New Zealand begins in early June, while Red Rose captain Dane Vilas chipped in with 109 as the hosts ultimately declared on 556-7 in their first innings.\n\nBohannon made 231 from 467 balls, hitting 30 fours and a six, as he impressed once more having averaged over 53 in last season's County Championship.\n\nImage: Josh Bohannon scored 231 for Lancashire against Gloucestershire\n\nIn reply, Gloucestershire were reduced to 67-3 by stumps, still trailing by 237 runs going into the final day.\n\nTwitter Due to your consent preferences, you’re not able to view this. Open Privacy Options\n\nAnderson (1-9), who had looked rusty in bowling 16 wicketless overs in the first innings, appeared somewhere back to his best in an opening spell that saw him remove Australian opener Marcus Harris for seven, edging behind.\n\nSaqib Mahmood (1-11), bidding to keep his Test place after an impressive debut in the West Indies, accounted for Chris Dent (19), while Hassan Ali (1-17) - who claimed 6-47 in the first innings - bowled James Bracey (14) with a brilliant yorker.\n\nMiddlesex, Notts, Worcestershire clinch innings wins\n\nMiddlesex completed an innings-and-82-run thrashing of Glamorgan inside the first hour on day three in the sides' Division Two clash in Cardiff.\n\nImage: Toby Roland-Jones took eight wickets in the match as Middlesex thumped Glamorgan in Cardiff\n\nGlamorgan, whose defeat was their first in three games this season, were bowled out for 132 in their second innings having added just 28 runs to their overnight 106-6.\n\nToby Roland-Jones (5-40) and Tom Helm (3-24) shared the final four wickets, with Helm bowling Michael Hogan to clinch Middlesex's first win of the Division Two campaign following last week's draw with Derbyshire.\n\nRoland-Jones ended with match figures of 8-74 having taken 3-34 in Glamorgan's first-innings 122 all out, while he also struck 65 as Middlesex made 336 all out in their sole innings after being 110-6.\n\nRoland-Jones removed Glamorgan's Sam Northeast and Michael Neser inside the first three overs on Saturday morning before fellow seamer Helm accounted for Timm van der Gugten and Hogan.\n\nNottinghamshire crushed Durham by an innings and 141 runs to clinch a dominant victory inside three days of their game at Emirates Riverside.\n\nImage: Ben Slater hit a maiden first-class double century for Nottinghamshire\n\nBen Slater scored a maiden first-class double century to propel the visitors to a commanding total of 488-9 before the declaration came, leaving Durham requiring 259 runs to make Notts bat again.\n\nHowever, the hosts collapsed to 117 all out in the afternoon amid fine bowling from the Midlands outfit to slump to a humbling defeat on home soil, with Luke Fletcher (3-46) and James Pattinson (3-34) claiming three wickets apiece.\n\nAt New Road, Worcestershire earned their first victory of the season after overcoming Sussex by an innings and 34 runs.\n\nSussex lost 15 wickets on the third day and, despite a first-innings century from Cheteshwar Pujara and a half-century from Kent loanee Grant Stewart, they crumbled to a crushing loss.\n\nSussex were without half a dozen players through injury but results have been on a downward spiral for some time. Since the start of last season, they have won only one of 17 Championship matches and been beaten 11 times.\n\nDivision One\n\nElsewhere, in Division One, Hampshire are in sight of a heavy victory over Kent at Canterbury after reducing the hosts to 78-3 at stumps on day three, still needing another 269 runs to avoid an innings defeat.\n\nImage: Liam Dawson hit a career-best171 as Hampshire racked up the runs against Kent\n\nHampshire declared on 652-6 at tea, a lead of 347. Liam Dawson hit his highest first-class score of 171, while Ben Brown cracked 157 as the duo shared in a Hampshire record partnership of 273 for the fifth wicket.\n\nKyle Abbott took 2-9 in Kent's second innings, removing both Zak Crawley (29) and Daniel Bell-Drummond (0) in the space of four balls, while Felix Organ (3) bowled Tawanda Muyeye, leaving Kent hoping for some last-day heroics from Ben Compton, who was unbeaten on 37 at stumps.\n\nEngland's current Test wicketkeeper Ben Foakes had to leave the field after clashing heads with Jamie Overton while taking a brilliant diving catch in Surrey's finely-balanced game against Somerset at the Kia Oval.\n\nA stretcher was initially brought out as a stricken Foakes was given lengthy treatment, but he was eventually able to walk off unaided and will hope to play a further part in a game that could still go either way after three absorbing days.\n\nTom Abell added a fluent 68-ball 53 to his career-best 150 not out earlier in the match and Tom Banton also hit a determined 52 as Somerset reached stumps 225 runs ahead of Surrey at 196-9 in their second innings.\n\nA wonderful day's cricket ended with Jordan Clark having Peter Siddle caught behind by Foakes' replacement, Ollie Pope, from the penultimate ball, with Surrey having grabbed seven wickets for 73 runs after tea.\n\nEngland batter Dan Lawrence defied Warwickshire despite a hamstring injury as Essex battled to avoid defeat in their match at Edgbaston.\n\nImage: Dan Lawrence defiantly batted for 105 balls for Essex despite hampered by injury\n\nTrailing by 217 on first innings, Essex closed the third day on 290-8 - 73 ahead - with Lawrence, who batted at number seven and with a runner, having bolstered their resistance with a valiant 44 from 105 balls.\n\nThe 24-year-old's movement was clearly restricted by the injury he sustained while chasing a ball in the field on the first day. But his resolve, in alliance with Simon Harmer - who made 60 not out - in a seventh-wicket stand of 81 in 29 overs, kept their team alive.\n\nElsewhere, George Hill hit a magnificent unbeaten 151 in just his 11th first-class game to put Yorkshire in complete control on day three of their game against Northamptonshire.\n\nIt was a maiden ton for the former England Under-19s vice-captain, who shared two huge partnerships as Northamptonshire's bowlers were put to the sword.\n\nFirst Hill and Dawid Malan (75) posted a 157-run stand before he combined with Harry Brook (77no off 63 balls) in a blistering assault which garnered 148 runs at a pace more typical of a T20 affair.\n\nSet a notional 499 to win on an increasingly flat surface, Northamptonshire openers Ricardo Vasconcelos and Will Young safely negotiated a tricky final session, posting a 56-run opening stand before the close.\n\nDivision Two\n\nIn the only other Division Two clash, Derbyshire moved to within four wickets of a first victory of the season after Leicestershire finished day three six wickets down in their second innings and still 172 runs behind.\n\nLeicestershire seamer Ed Barnes took five wickets in an innings for the first time earlier in the day as Derbyshire lost their last six first-innings wickets for 27.\n\nBut, after a maiden century from Mattie McKiernan (105) enhanced the value of Shan Masood's superb double hundred on Friday, Derbyshire still reached 531 for a lead of 318.\n\nIt left Leicestershire having to survive two sessions just to take the contest into the final day. They succeeded in that task, but it will need an extraordinary effort from their tail to avoid defeat as they closed on 146-6."}, {"url": "https://www.cricketcountry.com/articles/moments-in-history/jack-boss-meyer-eccentric-schoolmaster-somerset-cricketer-ranji-trophy-captain-738365", "page_content": "Jack ‘Boss’ Meyer: Eccentric schoolmaster, Somerset cricketer, Ranji Trophy captain\n\nMeyer played for Cambridge, and Somerset, and led Western India, but is remembered mostly as founder of Millfield School.\n\nJack Meyer (courtesy: Wikimedia Commons)\n\nEyewitness testimony is provided by Mr Skinner, of Oxhey, who says in the late Forties he saw the inimitable R J O Meyer, captain of Somerset, bowl out a Kent batsman with a high dropping full toss. As Mr Skinner remembers it, Meyer delivered an over of such balls during which the unfortunate batsman became confused by his unorthodox attack and stood away from his wicket in bafflement, only to see the ball land on top of his middle stump. 'Boss' Meyer, a renowned individual thinker who founded Millfield School, was said to have practiced bowling the high lob while headmaster at Millfield. He was dissuaded from making it his specialty in county cricket by the appearance of Godfrey Evans at the crease. Evans, who enjoyed a joke, swatted Meyer's next over all around the park using his bat one-handed like a tennis racket. So far as we know, this was the last time the high dropping full toss was deliberately used in county cricket. Michael Parkinson, 1999.\n\nIt is said that the late Sir Arthur Conan Doyle had once had the mortification of being dismissed in a similar fashion in a Second-Class match by Bunny Lucas. The freak dismissal is reported to have planted the germ of an idea in the fertile imagination of the prolific author that had resulted in the creation of the fictitious asthmatic schoolteacher with a weak heart named Tom Spedegue, who, despite his physical deficiencies, used to take an interest in cricket.\n\nCricketer himself, and an avid cricket blogger, Martin Moseling, having probed the veracity of the story quoted above from existing match records, finds it to be as much of a figment of Skinner s imagination as the fictitious bowling style of Spedegue, of the looping lobs that were said to land on the stumps of surprised batsmen. In the context of RJO Jack Meyer, however, it may be said to be very much in character for the engaging eccentric.\n\nThe Rev. (Horace) Rollo Meyer, Derbyshire cricketer, and a clergyman of the Church of England denomination, and his wife Arabella Crosbie, n e Ward, welcomed their middle son (out of three) on March 15, 1905 at the Rectory, Ampthill, a town and civil parish in Bedfordshire, between Bedford and Luton. Though the child had been formally christened Rollo John Oliver, he was known universally as Jack. In a treatise entitled The History of Millfield 1935-1970, Barry Hobson goes into considerable detail to depict the life and times of Jack Meyer.\n\nEight-year old Jack joined his elder brother at Stratheden School, Blackheath in 1913, before going on to Haileybury College on a scholarship in 1918. Founded in 1804, the seminary had originally been intended for the education of children of British employees of the East India Company, but was to later open its doors to the offspring of other families as well. The aim of the institution had traditionally been to prepare the students for a life of service , be it in the Church, or in the Armed forces, or in public administration. During his time at Haileybury, Meyer s natural gift and proficiency at almost all ball games was to make him one of the outstanding athletes of the immediate post- World War I era.\n\nMeyer matriculated and went up to Pembroke College, Cambridge, in 1923, as a tall, wiry, tense, restless figure aged 18.This was a time when many freshmen at Cambridge and Oxford, particularly if they had happened to be good players, would be happy to just be awarded a Blue, and perhaps cater to their scholastic attainments by merely passing the Responsions, the first of three levels of examinations that needed to be passed successfully for a university degree.\n\nIn an article entitled Rollo Meyer: Visionary and Founder of Millfield School, PJ Lennon writes that, while at Cambridge, 18-year-old Meyer had struck up a firm friendship with Tom Lowry, later to captain New Zealand and to play the first 7 Tests played by his country. Meyer and Lowry founded the Hellfire Club at Cambridge. According to Richard H Thomas in All Out Cricket, the initiation ceremony that Meyer and Lowry had thought of consisted of the incumbent blowing three smoke rings and then spitting through the rings.\n\nMeyer was to himself admit later: In those days there were very few who were trying to get both Blues and degrees, and it was rather easy to get offers of jobs. By 1926 his profile boasted a cricket Blue in all three years and a Half-Blue for racquets, backed up by an Honours Degree in English Literature. At this pint of his life he began to think that he was now ready to make a living for himself. He began by driving a lorry during the Great Strike of 1926.\n\nCricket occupied a lion s share of his time during his tenure at Cambridge, Meyer winning his first Blue in his freshman year. He made his First-Class debut playing for Cambridge against Lancashire at Fenner s in 1924; he scored a duck but picked up 5 wickets in the match including 4 for 51 in the first innings. Between 1924 and 1926 he played 30 First-Class matches for his university, scoring 609 runs at 15.22, with a solitary fifty, and capturing 133 wickets at 23.66, with best figures of 7 for 24, against Leicestershire in his penultimate year.\n\nHis sporting prowess helped him to accept an offer from Harrow to help the master in charge of racquets. This provided Meyer the opportunity of playing Minor Cricket for Hertfordshire during the school holidays, and subsequently also playing 2 First-Class games for Minor Counties. His profile lists 29 Second-Class games for Hertfordshire between 1923 and 1929, during which he is seen to have scored 1,437 runs at 35.92 with 5 centuries, and 142 wickets at 18.52.\n\nMeyer gradually developed into a right-handed batsman, particularly renowned for his stylish straight- and on-driving. His bowling, however, was another matter altogether. In the words of David Foot: The daring variety of his bowling, during which he could summon up late swing and bamboozling medium-paced leg-breaks (often six different balls in an over), was inclined to look more of a lark. Meyer would often keep Somerset wicketkeeper Wally Luckes completely in the dark about what he was about to send down to the batsman, explaining that even at the point of delivering the ball, he would often not be sure himself of what he was about to bowl.\n\nAgainst the visiting South Africans at Lakenham in 1924, his bowling was good enough on behalf of the Minor Counties team to net him 6 for 60, his victims including George Hearne, Fred Susskind, Dave Nourse, Herbie Taylor, and Bob Catterall. He dismissed Catterall in the second innings as well. He also performed well with bat, scoring 26 and 30 in a game that the Minor Counties won by 25 runs.\n\nOn the lookout for a means of making a living after emerging from Cambridge in 1926, Meyer s Haileybury connections stood him in good stead, and he was prevailed upon, while he was at Harrow, to accept a situation in the cotton trade as a trainee broker, and shortly found himself on a steamer, bound for India. The young man arrived at erstwhile Bombay in due course.\n\nMeyer, the fresh Cambridge Cricket Blue, and perhaps yet to get over his youthful naivety, thus found himself in the midst of a critical politico-economic meltdown, a situation that he found difficult to adjust to. The ongoing Indian National Movement, which had received a setback with the demise of CR Das in 1925, was reignited with the appointing of the Simon Commission in 1927, there being no Indian member nominated in the seven-member panel. Several prominent Indian political leaders began to intensify the demand for the full independence of India. Things were to come to a head with the Salt March by Mahatma Gandhi on March 12, 1930.\n\nIn this bewildering maelstrom of political events, Meyer found solace in the familiar ambience of cricket fields, and required very little cajoling to join the ranks of the Europeans in the Bombay Quadrangular, in vogue at the time, in the absence of any formally structured regional First-Class cricket tournament in India at the time.\n\nMeyer was to play 6 matches for the Europeans between 1926-27 and 1934-35, scoring 304 runs at 25.33, with a highest of 85. His four fifties came in successive matches: 50 against Muslims in 1927-28, 66 against Parsees in 1928-29, 85 against Parsees in 1929-30, and 51 in his last game for the Europeans, against Hindus, in 1934-35.\n\nHis bowling on behalf of the Europeans brought him 50 wickets at 15.28, his best figures being 9 for 160, against Muslims at Bombay Gymkhana (later to stage the very first Test match of all on Indian soil), in 1927-28. Perhaps a little elaboration may be in order here, considering the importance of the game in the context of Meyer s First-Class cricket career.\n\nWhen skipper Mohammad Vishram won the toss for the Muslims and decided to take strike, he would probably not have imagined that the innings would be over in a mere 28.3 overs, with the total reading 59. The only man in double figures was Mohammad Hussain, brother of the SM Hadi. Hussain barely made it into double figures with a score of 10. Bowling unchanged from one end, Meyer accounted for 7 of the wickets at a personal cost of only 28.\n\nThe Europeans replied with 217, with William Cullen s 79 being the only individual fifty. That left the Muslims with a deficit of 158 when they began their innings on the second day. To their credit, they hey ended the day at 216 for 5, with Dilawar Hussain on 18 and Vishram on 8.\n\nThe fall of Hussain s wicket at 248 brought Abdus Salaam to the wicket. Salaam (111) was the next to go, at 435, but not before the seventh-wicket stand with the skipper had realised 187. The next three batsmen on the card were all dismissed for ducks, the valiant skipper remaining undefeated on 75. The innings folded up at 437, with Meyer capturing 9 for 160, his best First-Class figures. His 16 wickets in the game were achieved at a cost of 188.\n\nMeyer s match haul of 16 for 188 was the second-best individual performance with the ball for any First-Class game played in India at the time, after the 16 for 69 by Frank Tarrant for England against India at Bombay Gymkhana in 1915-16.\n\nIn the last innings of the game, the winning target for the Europeans was 280. Bolstered by 120 by Cullen and a fourth-wicket stand of 82 with Meyer (50), followed by a fifth-wicket stand of 80 with Gaillard (33*), the Europeans were able to win the game by 4 wickets.\n\nIn India, the young Meyer gradually came into contact with another section of the Indian populace, the so-called upper class, members of the princely and royal families, heads of the largely independent Princely States of India at the time, under the benign titular jurisdiction of the British Viceroy. This segment of the Indian population, however, was keen to follow British values and customs, and was anxious for their progeny to be educated in the best public schools and colleges of England, so that, in addition to a proper English education, they could be initiated into the various British sports that these upper class Indians found so appealing.\n\nMeyer s cricket connections in India brought him into contact with one such royal luminary at this time. Ranjitsinhji advised the young Meyer to opt out of his unrewarding and uninspiring job as a cotton broker, and to concentrate his energies on tutoring the young scions of the royal families in their quest for a holistic British education. In 1929, Ranji offered Meyer a teaching assignment at his own Princely State School, an offer that Meyer was quick to accept.\n\nThus it was, says Barry Hobson, that the man who had rejected offers of teaching posts at both Eton and Harrow in 1926, began his career in education three years later, first at Limbdi, then at Porbandar, and in 1932 as Headmaster of the Palace School at Dhrangadhra.\n\nThe move to Dhrangadhra in 1932 was prompted by the fact that by now, Meyer had already met Joyce, daughter of English parents, but brought up in considerable comfort in India surrounded by a plethora of servants and ayahs, and had been married to her in 1931, was in need of a more permanent situation. The Maharajah of Dhrangadhra had initially created the Palace School for the education of his own children and for the children of his Ministers and civil servants. In 1932, there were about a hundred students in the seminary.\n\nIn his later years, Meyer was to reminisce: I found myself teaching some twenty or so boys and girls with age range of twenty two down to three and an IQ range of eighty to one hundred and forty. Half of them knew no English and I knew no Gujarati. A method of graded small group tuition had to be devised to meet the situation. This was to form the basis of his teaching later at Millfield School.\n\nMeyer s alternative career, and one that was to earn him great fame and honour in his later years, was thus launched in a small princely state of India, under the colonial Eastern Kathiawar Agency, in what is now Saurashtra. The royal ruler of the state went under the honorific title of Maharaja Sri Raj Sahib, and was entitled to a salute of 13 guns.\n\nThese events in Meyer s life, though financially and altruistically rewarding for him, did not, in any way, divert his mind from cricket. When the Ranji Trophy first got underway in 1934-35, Meyer was to be found leading the Western India team against Sind in the second game of all in the history of the tournament.\n\nGhulam Mohammad won the toss for Sind at Karachi. Sind did not last long, the only man in double figures being Naoomal Jaoomal (63), just over half the team total of 125. Narsingrao Kesari captured 5 for 12, while skipper Meyer held 3 catches. Meyer (20) then added 47 for the first wicket with Faiz Ahmed (62). Western India responded with 219, Naoomal Jaoomal taking 5 for 78.\n\nUnder a handicap of 94 runs, the Sind second innings total was 210, Naoomal Jaoomal (53) scoring his second fifty of the match. Resuming at 81 for 5 on the final day, Western India won by 4 wickets; Meyer top-scored with 29.\n\nMeyer played his second (and last) Ranji Trophy match against Bombay at Bombay Gymkhana Ground. Winning the toss, Dattaram Hindlekar and Vijay Merchant added 141 for the second wicket, and Bombay amassed 377. Amar Singh (4 for 93) and Meyer (3 for 111) were the main wicket-takers.\n\nIt was a sorry procession as the Western India, wickets fell in a flurry. The only saving grace was 82 from Sorabji Colah in a very inadequate total of 154; Meyer contributed 1. Bombay were then bowled out for 164, captain LP Jai scoring 55. Brothers Amar Singh (6 for 71) and Ladha Ramji (4 for 29) shared the wickets.\n\nSet a target of 388, Western India were dismissed for 241, conceding a 146-run victory. Standing tall amongst the ruins of the innings, Meyer, opening the batting, scored 91, his highest individual First-Class score till date. Rather surprisingly opening the bowling, Merchant had figures of 4 for 31. This was to be the last First-Class match played by Meyer in India. Being a man proficient in many sports, Meyer was to become the Indian National Champion at racquets and billiards.\n\nBy 1935, Joyce and Jack had two young daughters, Jillian and Jaqueline. The Maharajah of Dhrangadhra was anxious that his three sons should be imbued with a proper British education and upbringing and urged Meyer to exert himself to prepare them for the better known English public schools and for subsequent admission to Oxford or Cambridge. Seizing the opportunity, Meyer decided to leave Indian shores behind after a nine-year sojourn, and to go back to the country of his birth.\n\nThe next phase of the life of Meyer takes us back in time to the year 1889, and to one William Stephens Clark, who had been the guiding light of the shoe-making firm of C and J Clark for the past 25 years. William chose to build the family mansion in Street, a large village and parish town of Somerset, in the year mentioned. Over time, Clark s estate, known as the Mill s Field estate, was to include a stable block, a well-laid-out kitchen garden, and a cottage for the gardener. It was to also include certain features not usually seen in Victorian mansions, like secret doors, staircases and passages. The estate also boasted a Swiss chalet, an open-air swimming pool, and a small boat-house.\n\nIn 1935, the Rev. Horace Rollo and Arabella Meyer rented the property, now known as Millfield, for residential purposes. They welcomed Joyce, Jack, their two granddaughters, and Jack s retinue of Indian students at the estate. Meyer s Indian wards, seven in number, included six princelings in 1935, the three sons of the Maharajah, three of their cousins, and the child of one commoner.\n\nThe school had a relatively humble beginning on June 6, 1935, primarily as an institution where, under the guidance of Meyer, the Indian boys were to cram for admission into British Public Schools. Joyce and Jack adopted the role of tutor-guardians and provided a home from home for the young Indian students throughout their time in England.\n\nDuring his stint at Dhrangadhra, apart from academics, Meyer had tried to inculcate interest in his students in such diverse activities as horse-riding, shooting, swimming, cricket, tennis, and gardening, as part of the British education philosophy of men sana in corporesano a healthy mind in a healthy body. A groom was engaged at Millfield to look after the horses, and a group of gardeners was employed to help the Indian students to continue their training in gardening. A fairly large number of domestic staff members were employed to cater to the personal needs of these youngsters of royal blood.\n\nThe eldest Prince of Dhrangadhra, who had been barely 12 when he had arrived in England in 1935, went on to succeed his father in 1942 as His Highness the Maharajah Sairaj Megharajji. He was to recall his experiences at Millfield at a later date as follows: The old school (in India) was co ed , from the start! However its distaff side was left behind when, in 1935, the School was translated overseas trans-shipped, in functioning order, with principal, preceptors, pupils and staff, 30 together with its peculiar proclivities (minus the horses!) and transplanted in England, to become and blossom, as the Millfield School!\n\nDespite the humble beginning, Millfield began to blossom, becoming one of the first independent schools to become co-educational in 1939. It is on record that Martin, son of the then Deputy Prime Minister, Clement Attlee, had joined Millfield in 1942 in the hope of being able to overcome his dyslexic status. By the time he had completed his university education, Millfield had gained the reputation of becoming the first educational institution in England to deal successfully with the issue of dyslexia among children.\n\nIn a message, Craig Considine, Headmaster of Millfield, has this to say about the present status of the school: The original aim was to introduce the boys, ages between 8 and 15 to the English education system and create a home from home . As it was summer when the six young princes arrived in Somerset, everyone set about preparing a cricket pitch. Eighty years later, sport, along with the arts, academic curriculum and co curriculum remains a significant feature of Millfield s excellent all round education. Today at Millfield we have come a long way from those rudimentary beginnings and enjoy outstanding sport facilities and we no longer expect pupils to construct a cricket pavilion or campus as part of their induction!\n\nIt was now 1936, and, with the onset of summer, it was time to bring the cricket creams out again.At the age of 31, Meyer found himself making his County Championship debut in 1936, when the season was already well underway, for Somerset against Northamptonshire at Bath. Considering that his school was running fairly smoothly by now, Meyer could indulge in cricket only during the school holidays.\n\nMeyer was fortunate to be making his debut for Somerset at this time, the team already having in its ranks players of the calibre of opener Frank Lee; swashbuckling Harold Gimblett, in his second First-Class season; Reggie Ingle, in his penultimate season as Somerset skipper; legendary all-rounder Arthur Wellard; and long-suffering wicketkeeper Wally Luckes, among others. Somerset won by 105 runs, Wellard contributing 70 in the first innings and capturing 6 for 54 and 6 for 69. Gimblett scored a scintillating 143 in the second innings, sharing a first-wicket stand of 114 with Lee (53). Meyer s contributions were 16 and 22, and 28 overs for no wicket.\n\nThis period was also, perhaps, the dawn of his legendary eccentricity. Foot cites an incident of Meyer of once holding up play in a championship match against Northamptonshire after he had dropped a catch offered by Dennis Brookes off Wellard, and then going up to the bowler with a 1 note in hand and profuse apologies for his lapse in the slips.\n\nThere is a story of a championship game being played in uncertain weather in which Somerset had taken field with ten men, Meyer following shortly carrying a red umbrella. He was known to roam the grounds of his school with his golf kit on hand and to occasionally practise driving the ball into his own living room through the open window. One wonders what Joyce would have thought of all this.\n\nHis inaugural season with Somerset was to prove quite profitable for him. He made his bones with Somerset in his second game of the season, a home match against a strong Yorkshire team led by Brian Sellers, although the visitors won the game quite convincingly by an innings and 152 runs. Meyer had figures of 5 for 111 in the first innings, and top-scored with 43 and 32 out of 116 and 94.\n\nIt was August 29, and the schoolmaster s mind was at rest with the holiday season upon him. The adversaries this time were Lancashire, who batted first and put up 423, Cyril Washbrook scoring 103 as Bill Andrews captured 6 for 126 for Somerset.\n\nSomerset replied with 253, Mandy Mitchell-Innes (127) contributing just over half the total. Following on, they were 122 for 5, still 48 in arrears. Meyer stood tall, first adding 90 for the sixth wicket with John Barnwell, then adding a further 72 runs with Wellard. When time ran out on the drawn game, Meyer was left undefeated on 202, scored in 225 minutes, his highest First-Class score.\n\nIn all, between 1936 and 1949, Meyer played 65 matches for Somerset, scoring 2,929 runs at 28.16, with 2 centuries. He also had 16 fifties, and held 33 catches. His 133 wickets for Somerset came at 28.31, and his best analysis of 7 for 74 came against Northamptonshire in 1947. He was captain of Somerset for 26 matches.\n\nMillfield, Meyer s brainchild, was something out of the ordinary with respect to its teaching principles. The aim of the school, according to Lennon, was to nurture talent by providing the very best facilities in teaching and coaching and to provide opportunities in which young people can exercise and explore their abilities; and to give awards to those in financial need.\n\nKnown affectionately and respectfully as the Boss at Millfield, Meyer followed the Robin Hood principle in which affluent families often subsidised the education of deserving children of less privileged families. Meyer s progressive and liberal attitude towards education resulted in the likes of Sean Connery, Elizabeth Taylor, Charlie Watts, King Hussain of Jordan, and Adnan Khashoggi to entrusting their offspring to his care.\n\nSeveral students of Millfield grew to become well-known sporting personalities, including Welsh rugby legend Gareth Edwards, and cricketers Ian Botham, Craig Kieswetter, Peter Denning, Simon Jones, Ben Hollioake, David Engrave, Lilly Allen, Oliver Reid, and Peter Roebuck.\n\nWriting in The Independent, Stephen Chalke had this to say about the first meeting between Roebuck and Meyer: Roebuck, one of six born to schoolteacher parents, caught the cricket bug as a young boy in Bath. He applied for a scholarship to Millfield, the sports-centred independent school run by the eccentric Jack Meyer, a former Somerset captain whose greeting to the 13-year-old entering his study was to throw an orange at him. Well caught, he said. But you should have thrown it back. Roebuck was in, so were both his parents as teachers, and they were given a house in nearby Street. Meyer, ever an unconventional thinker, appealed greatly to the youngster.\n\nRoebuck, himself a complex character forever fighting his own demons, and later to die by his own hand under tragic circumstances, called his mentor a gambler, golfer, chess player, scholar, scrounger and crossword-solver . Referring to his captaincy of Somerset in 1947, Roebuck was to later say, surprise was his weapon, experiment his fancy, dullness his enemy but inconsistency his weakness .\n\nAnother Somerset player who enjoyed a special relationship with Meyer was Gimblett, another man who was to go through troubled times himself. In Gimblett s own words: By the end of 1953 the world was closing in on me.\n\nFollowing Christmas of that year, Gimblett was on sleeping pills and had to spend 16 weeks in a psychiatric hospital. By 1954, when Gimblett had parted ways with Somerset, and had applied for a teaching job at Millfield, Meyer not only gave him the situation, but also took his son in as a pupil. Gimblett was to spend twenty years at Millfield. He used to say that Meyer could charm the hairs off a gooseberry. Despite best efforts, however, and despite using all his charm, Meyer was not able to reinstate Gimblett in the Somerset team.\n\nAt the outbreak of World War II in 1939, many of the male members of the Millfield staff, led by Meyer himself, volunteered for military service. Meyer, 34 and already in the grip of lumbago, was sent back to his campus. He was later given a Royal Air Force Volunteer Service commission as a Flying Officer, later upgraded to Flight Lieutenant, and given the responsibility of organising and commanding the Glastonbury and Street Schools Squadron of the Air Training Corps as part of the British war effort.\n\nIn 1967, Queen Elizabeth II appointed Jack Meyer an OBE for services to education. A compulsive gambler, an unsubstantiated story says that his tenure at Millfield was to end rather abruptly in 1971 when he became involved in an imbroglio involving an all-night gambling session and a bag containing school fees.\n\nMeyer moved to the idyllic settings of Greece in 1973 to become the Headmaster of a school just outside Athens called St. Lawrence College, home to about 770 students between the ages of 3 and 19. Founded by Galinos Karakostas with the idea that the students would be brought along traditional British principles, the chemistry between the founder and Meyer turned out to be beneficial for the students."}, {"url": "https://www.sportsadda.com/cricket/features/highest-individual-score-first-class-cricket", "page_content": "Former West Indies cricketer Brian Lara holds the record for the highest individual score in first-class cricket.\n\nWhile playing for Warwickshire, Lara smashed an unbeaten 501 against Durham in a County Championship match at the Edgbaston Cricket Ground in Birmingham in 1994.\n\nInterestingly, it remains the only quintuple-hundred to be registered in First-Class cricket history.\n\nLara’s record-breaking innings was laced with 62 fours and 10 sixes. The southpaw faced 427 balls to score the quintuple-hundred while staying at the crease for seven hours and 54 minutes. Lara powered Warwickshire to 810/4 before captain Dermot Reeve declared the innings.\n\nEarlier, Durham had posted 556/8d courtesy John Morris’ 204 as the match ended in a draw.\n\nLara broke Pakistan cricketer Hanif Mohammad’s record, who scored 499 for Karachi against Bahawalpur in the semi-final of the Quaid-e-Azam Trophy in 1959.\n\nAfter Bahawalpur were bowled out for 185 in their first innings, Hanif Mohammad played an incredible innings of 499 to help Karachi post 772/7d in their first innings. Mohammad’s scintillating innings included 64 fours.\n\nBahawalpur were once again bundled out for 108 as Karachi secured a massive win by an innings and 479 runs.\n\nAustralia cricket legend Donald Bradman features third on the list for the highest individual score in First-Class cricket.\n\nBradman scored an unbeaten 452 while playing for New South Wales against Queensland in a Sheffield Shield match in 1930.\n\nAfter New South Wales were bowled out for 235 in their first innings, Queensland could only manage 227 in their first innings.\n\nIn the second innings, New South Wales rode on Bradman’s unbeaten 452 to post a massive score of 761/8d. Queensland were skittled out for 84 in their second innings as New South Wales claimed a 685-run victory.\n\nIndia’s Bhausaheb Nimbalkar and Bill Ponsford of Australia complete the top five list for the highest individual scores in first-class cricket.\n\nWhile Bhausaheb Nimbalkar smashed an unbeaten 443 for Maharashtra against Kathiawar in a Ranji Trophy encounter in 1948, Bill Ponsford scored 437 for Victoria against Queensland in a Sheffield Shield match in 1927.\n\nAfter Kathiawar were bowled out for 238 in their first innings, Bhausaheb Nimbalkar’s 443 and opener Kamal Bhandarkar’s 205 powered Maharashtra to 826/4 in their first innings. Maharashtra won by default after Kathiawar forfeited the match.\n\nMeanwhile, Victoria rode on Bill Ponsford’s incredible innings of 437 and Stork Hendry’s 129 to help Victoria post 793 in their first innings.\n\nQueensland were bowled out for 189 and 407 in the two innings, respectively, as Victoria won the match by an innings and 197 runs.\n\nBill Ponsford had earlier scored 429 for Victoria in an Australian domestic miscellaneous first-class match against Tasmania in 1923.\n\nHighest individual scores in first-class cricket\n\nPlayer Runs Team Against Ground Year Brian Lara 501* Warwickshire Durham Birmingham 1994 Hanif Mohammad 499 Karachi Bahawalpur Karachi 1959 Donald Bradman 452* New South Wales Queensland Sydney 1930 Bhausaheb Nimbalkar 443* Maharashtra Kathiawar Pune 1948 Bill Ponsford 437 Victoria Queensland Melbourne 1927 Bill Ponsford 429 Victoria Tasmania Melbourne 1923 Aftab Baloch 428 Sind Baluchistan Karachi 1974 AC MacLaren 424 Lancashire Somerset Taunton 1895 Sam Northeast 410* Glamorgan Leicestershire Leicester 2022 Graeme Hick 405* WORCS Somerset Taunton 1988 Brian Lara 400* West Indies England St John's 2004\n\nPlay fantasy cricket with SportsAdda. Create your team, track your progress and win prizes. Start here.\n\nFollow us on Telegram for the latest updates from the world of sports!\n\nInterested in cricket betting? Click here to check out the list of top sites\n\nFeatured photo: ICC"}, {"url": "https://www.durhamcricket.co.uk/news-and-media/borthwick-scores-100-in-a-day-where-bowlers-dominate-at-chelmsford/", "page_content": "Day 4\n\nA five-wicket haul from Simon Harmer led Essex to a sensational comeback victory over Durham at Chelmsford in the LV= Insurance County Championship.\n\nDefending LV= Insurance County Championship and Bob Willis Trophy champions Essex had been bowled out for 96 in the first innings and gave up a 163-run first-innings deficit, only to win by 44 runs.\n\nThe equation for the last day was simple; Durham required 108 runs and Essex needed seven wickets.\n\nJack Burnham ticked four off the target with the second ball of the day, a well-timed flick off his legs, having scored an enterprising 31 the previous evening.\n\nBurnham and Borthwick’s partnership past 50, with the latter only contributing 13 to it, but only reached 63 before Harmer struck for the first time.\n\nWith 85 required, Burnham departed for 43 when he rocked onto the back foot and hoicked straight to Tom Westley at long-on.\n\nAdam Wheater thought he had stumped Borthwick in Harmer’s next over, to earn a reprimand from the umpires, only for the off-spinner to pin the first-innings century-maker when going back, 80 still needed.\n\nAnd only another run had been added six balls later when Sam Cook, who returned figures of three for 17, had Stuart Poynter lbw.\n\nBen Raine lasted just five balls before Harmer flicked his pad to take his third wicket in 11 balls.\n\nWith 60 to win, Ned Eckersley, tickled Harmer around the corner to Dan Lawrence at leg slip.\n\nHarmer completed his second five-for in the match when Brydon Carse, who had a runner due to a swollen ankle sustained while bowling, was lbw.\n\nHarmer’s match figures an impressive 10 for 136.\n\nJamie Porter completed the victory when he sent Matt Salisbury’s middle stump tumbling.\n\nDurham return to action on Thursday, when they host Derbyshire at Emirates Riverside.\n\nDay 4 Reaction: James Franklin\n\nDay 3\n\nBrydon Carse took a five wicket haul, before Borthwick and Burnham provided a fightback with the bat, with the Durham requiring 108 runs to win on the final day in Chelmsford.\n\nEssex’s last three wickets added a combined 122, with all-rounder Walter’s 77 and fast bowler Allison’s 52 producing an incredible match swing – after the home side had been skittled for 96 in the first innings.\n\nHaving been bowled out for 330, and set Durham 168 to win, Sam Cook and Jamie Porter struck three times with the new ball to leave the visitors on 60 for three, and still requiring 108 more runs on the fourth day.\n\nDurham’s target to win looked a nervy one and after two wickets before a run had been scored it appeared all the more anxious.\n\nWill Young shouldered his arms at Sam Cook for 0, before Alex Lees was lbw to Jamie Porter.\n\nIt took 35 balls before Durham got off the mark, and only 20 runs were on the board when David Bedingham cut to Allison at point.\n\nScott Borthwick dropped anchor and having been one off 39 and six off 67 at points, he ended the day on nine from 88 deliveries, with Jack Burnham reaching an enterprising 31 not out, to swing the pendulum slightly towards Durham.\n\nAt 11am, both sides had clear game plans for the third day – with blue skies overhead.\n\nThe former’s mission to take four quick tail-end wickets started perfectly as Ben Raine pinned Simon Harmer with the third ball of the day. But slowly Essex’s hopes of stealing a win grew with back-to-back 50 run partnerships.\n\nWalter converted his overnight 49 to a half-century with the fifth ball he’d faced – a cut to the boundary to reach the milestone in 74 deliveries. He and Allison negotiated the second new ball on their way to a 58-run stand for the eighth wicket.\n\nWalter departed for a career-best 77 when the impressive Brydon Carse angled across and found an edge behind.\n\nAllison then moved to his maiden career fifty, from 144 balls, as he and Sam Cook continued to tick along.\n\nAfter an extended interval to pay respect to Prince Phillip, Carse ended Allison’s resolve by striking him in front of middle stump four balls after the resumption before Cook edged behind for 37. Carse returning figures of five for 82.\n\nDay 2\n\nScott Borthwick and Brydon Carse took two wickets apiece for Durham to leave Essex facing a first home LV= Insurance County Championship defeat for almost three years.\n\nLeg spinner Borthwick, who had handed the visitors the advantage with a first-innings 100, claimed Ryan ten Doeschate and Adam Wheater in quick succession, after quick Carse had broken a 103-run stand between half-century maker Dan Lawrence and Tom Westley.\n\nEssex, who last lost at the Cloudfm County Ground, Chelmsford in June 2018, ended the day on 208 for six, with a slender lead of 45.\n\nEarlier, Stuart Poynter scored 52 not out, Matt Salisbury made his highest first-class score and Simon Harmer produced his 21st five-wicket haul for Essex as Durham boasted a 163 run first-innings lead.\n\nAfter 18 wickets had fallen on an eccentric first day, Essex would have expected to take the final two Durham wickets quickly.\n\nThat wasn’t to happen as Poynter, Salisbury and Chris Rushworth batted throughout the morning session to score 111 runs, and take the lead to 163.\n\nPoynter and Salisbury had serenely sailed through the majority of the session with a club-record ninth-wicket partnership against Essex of 94.\n\nSalisbury, who started his career at Essex, had matched his more recognised partner as he passed his previous best first-class score of 37.\n\nBut on 41 he became Harmer’s fifth scalp of the innings when he guided the ball straight to Ryan ten Doeschate at short leg.\n\nRushworth arrived to help guide Poynter to an eighth red-ball half-century, from 100 balls, before the number 11 unfurled three boundaries including a beautiful cover drive off Harmer.\n\nSam Cook rounded off the innings two and a half overs into the second new ball, as Rushworth edged to Alastair Cook at first slip – Sam Cook returning three for 57, while Harmer’s final analysis was five for 79.\n\nEssex’s nightmare first morning, where they slumped to 36 for five, looked in danger of being replicated when Nick Browne was bowled by Rushworth and Alastair Cook chipped to midwicket.\n\nBut from 19 for two, Lawrence and Westley recovered with a sublime 103-run stand to drag Essex back towards equality.\n\nLawrence, who made his Test debut over the winter, looked supreme scoring 12 boundaries in his 76 – his fifty coming up in 93 balls.\n\nWestley was more stoic in his scoring, working almost exclusively with his favourable legside before he wafted outside his off stump to nick Carse to first slip to spark a flurry of wickets.\n\nCarse then added Lawrence to his victims as he persuaded the batter to pick out Will Young on the deep midwicket boundary.\n\nEssex edged themselves into the lead four down lost ten Doeschate with lead on one –Borthwick taking a stunning return catch from a low full toss, before the captain found Wheater’s outside edge.\n\nDay 2: Stuart Poynter\n\nDay 1\n\nScott Borthwick collected his first century since returning to Durham after Essex were skittled out for under 100 at the Cloudfm County Ground, Chelmsford for the first time since 2014\n\nBorthwick returned to his home county this winter after four seasons at Surrey before scoring exactly 100 – his first hundred for the club since May 2016 – as Durham ended the day 144 for seven, with a 48 run lead.\n\nDefending Bob Willis Trophy and LV= Insurance County Championship champions Essex were skittled for 96 – with the 94 scored against Derbyshire in 2014 the last time they had been routed for under three figures.\n\nChris Rushworth and Brydon Carse both claimed three wickets, while former Essex paceman Matt Salisbury and Ben Raine also took two apiece.\n\nEssex had won the toss and elected to bat first, on pitch and in conditions not dissimilar to the one which saw 993 runs in a dull draw the week before, but they lost Nick Browne to the third ball of the match, as the opener chopped Rushworth on.\n\nTom Westley, on the back of a double century against Worcestershire last week, and Alastair Cook both departed in quick succession – the former caught behind while expansively driving at Salisbury and the latter lbw.\n\nThe hosts slumped to 36 for five as Carse claimed two wickets in an over when Paul Walter dragged on and Ryan ten Doeschate attempted to duck but periscoped the ball to third slip.\n\nCarse provided more heat as he struck Adam Wheater on the hip and shoulder, as the wicketkeeper and Dan Lawrence battled to put on 38.\n\nAfter lunch, Essex lost three wickets for two runs as the collapse returned, falling from 74 for five to 76 for eight.\n\nWheater tentatively prodded to second slip, Lawrence was bowled, and Simon Harmer rocked onto the back foot and edged to a stooping first slip.\n\nRushworth and Carse cleared up the tail with Ben Allison caught behind and Sam Cook bounced out.\n\nA similar wicket tumble was threatened by Durham when Alex Lees edged behind in the fourth over to hand Sam Cook his 100th first-class wicket for Essex, but Borthwick and Will Young raced past the home side’s score in 27 overs.\n\nWhatever gremlins Essex had found evaded Borthwick has he stormed to a 64-ball half-century, brought up with a sweet sweep.\n\nHarmer struck in consecutive overs as Young turned around the corner to Lawrence at leg slip and David Bedingham skied to mid-off.\n\nJack Burnham and Ned Eckersley also departed, before Borthwick raised his bat on a popular 118-ball hundred – after back-to-back boundaries off Allison.\n\nBorthwick was bowled by a ball that barely bounced before Carse shouldered his arms at a sharp turner after Lawrence entered due to bad light.\n\nFive overs were lost for a delay for bad light but in a 2.4 over return, Raine edged Harmer to first slip – the spinner ending the day with figures of four for 41.\n\nDay 1 reaction: Scott Borthwick"}, {"url": "https://indianexpress.com/article/sports/cricket/brian-lara-first-man-to-score-400-in-test-cricket-on-this-day-6358904/", "page_content": "Brian Lara celebrating the milestone (File Photo) Brian Lara celebrating the milestone (File Photo)\n\nOn April 12, 2004, Brian Charles Lara became the first batsman in the history of Test cricket to score a quadruple century at St. John cricket ground in Antigua against Michael Vaughan’s England. Lara achieved the milestone on Day 3 of the Test in the first session with a single towards fine leg, reaching the milestone from 582 deliveries. His innings was studded with 43 fours and four sixes. There were glorious cover drives, big shots dancing down the wicket and elegant leg glances in the record-breaking innings.\n\nThis was the second time Lara had broken the record of the highest individual score in the longest format of cricket. 10 years earlier (April 16, 1994), the West Indies legend scored 375 against the English side at the same venue. This time around he broke Australian opener Matthew Hayden’s record who scored 380 against Zimbabwe on October 9, 2003.\n\nLara also holds the record of the highest first-class score. He scored an unbeaten 501 for English county cricket team Warwickshire against Durham in 1994."}, {"url": "https://www.sportskeeda.com/cricket/10-indian-players-with-the-most-runs-in-first-class-cricket", "page_content": "The Ranji Trophy, India's premier domestic competition, is an annual affair that features several aspiring cricketers dreaming of donning the Indian jersey.\n\nThis competition, along with the Irani Cup and Duleep Trophy, comprises the first-class scene in India, and is the platform where India hopefuls display their wares. A player performing reasonably well in first-class cricket is invariably called up to represent the Indian national team.\n\nIn this article, we bring to you ten Indian players who have scored the most runs in first-class cricket.\n\nAlthough no current player finds a mention, Cheteshwar Pujara, the number three batsman in the Indian Test team, narrowly misses the bus. Additionally, KP Ranjitshinji, the player after whom the Ranji Trophy is named, is not included in this list because he played Test cricket for England.\n\nWithout any further ado, let us meet the ten-most prolific Indian run-scorers in first-class cricket.\n\n10. Mohammad Azharuddin (Hyderabad, India)\n\nMohammad Azharuddin\n\nFormer Hyderabad and India captain Mohammad Azharuddin stands tenth in the list of all-time leading Indian run-scorers in first-class cricket.\n\nThe wristy batsman scored 15855 runs at an average of 51, a tally that includes 54 centuries and 74 half-centuries. 6215 of these runs, and 22 centuries, came in the 99 Test matches Azharuddin featured in. Currently, the president of the Hyderabad Cricket Association, Azharuddin is the second-highest run-getter for his domestic side, behind VVS Laxman.\n\nThe right-hander was renowned for his impeccable timing and placement. His stylish leg-side play won hearts over but so did his off-side game that he developed later in his career. Fans around the country will always fondly remember him for his silken wristwork and ability to create magic out of nowhere with the willow in hand.\n\nOne of the greatest captains India has ever produced, the Hyderabadi was also a brilliant fielder who manned the point and cover regions. Azharuddin is the only player in Tests to have scored centuries in each of his first three Tests.,\n\nBy scoring his 22nd hundred in what turned out to be his final Test match, Azharuddin became the only Indian among five players overall to have scored hundreds in their first and last Tests.\n\n9. Polly Umrigar (Parsees, Gujarat, Bombay, India)\n\nPolly Umrigar\n\nPahlan Ratanji Umrigar, who played in 243 first-class games, including 59 Tests, stands ninth in the list of all-time leading Indian run-scorers in first-class cricket.\n\nWith 16155 runs to his name scored at an average of 52.28, Umrigar scored 49 centuries and 80 half-centuries during his first-class career. His highest score was 252 not out came against Cambridge University when on a tour of England.\n\nOne of the greatest batsmen India has ever produced, Umrigar's exploits on the cricket ground during the late 1940s to the early 1960s earned him plentiful plaudits. He was also a more than decent bowler, as his 325 wickets at the first-class level would suggest.\n\nUmrigar, the first Indian player to score a Test match double century, was known for his commanding drives as well as for his ability to hook and pull fearlessly in an era where there were no helmets for protection.\n\n8. Dilip Vengsarkar (Bombay, India)\n\nDilip Vengsarkar\n\nOne of the foremost exponents of the drive, Dilip Vengsarkar, stands eighth in the list of all-time leading Indian run-scorers in first-class cricket.\n\nMaking his debut in 1975, the right-hander notched up 17868 runs in 260 first-class appearances at an average of 52, scoring 55 centuries and 87 half-centuries.\n\nIn Test cricket, Vengsarkar scored 6,868 runs at an average of 42.13 in 116 games, tallying 17 centuries and 35 half-centuries in the longest format of the game. In domestic competitions for Bombay, Vengsarkar lent solidity to the middle order.\n\nOne of Vengsarkar's final defiant innings in his first-class career came in an enthralling 1991 Ranji Trophy final. Chasing a 355-run target in 70 overs on the final day against Haryana, Vengsarkar's unbeaten 139 took Bombay to the precipice of an unlikely win before last man Abey Kuruvilla was run out three runs away from the finish line.\n\nHis century in the final earned the then 35-year-old Vengsarkar a spot in India's 1992 tour of Australia, where the right-hander scored a half-century in the first Test in Sydney before retiring.\n\nAfter his retirement, Vengsarkar was the chief selector of the Indian team for a while.\n\n7. GR Viswanath (Mysore, India)\n\nGR Viswanath\n\nGundappa Rangnath Vishwanath stands seventh in the list of India's all-time leading run-scorers in first-class cricket. He piled up 17,970 runs in first-class cricket at an average of 40.93 in 308 games,\n\nThe elegant batsman who turned up for Mysore (later called Karnataka), was renowned for his stylish square cuts. In 91 Tests, Viswanath scored 6,080 runs at an average of 41.93. He was one of two centurions as India successfully chased down a 406-run target in the 1976 Port of Spain Test in 1976.\n\nIn first-class cricket, Viswanath scored 44 centuries and 89 half-centuries. The right-hander is the second-highest run-getter for Karnataka after Rahul Dravid.\n\nVishwanath, who is also the brother-in-law of Sunil Gavaskar, looked divine with his strokeplay when in full flow. He was highly regarded by teammates and opponents alike for playing the game in true spirit.\n\n6. Vijay Hazare (Baroda, Maharashtra, India)\n\nVijay Hazare\n\nOne of the most elegant batsmen India has ever produced, Vijay Hazare, lends his name to the Vijay Hazare Trophy, the premier domestic one-day competition in the country.\n\nThe Baroda and Maharashtra batsman, who also played in 30 Tests, scored 18,740 first-class runs. Hazare finds himself in sixth spot in the list of India's top 10 run-scorers in first-class cricket.\n\nThe right-hander scored 60 centuries and 73 half-centuries in first-class cricket at an average of 58.33, with a highest score of 316 not out. Hazare, along with his namesake Vijay Merchant, were two of India's premier batsmen of their era. Hazare, who passed away in 2004 in Vadodara, would be remembered for his exploits in India's first tour of Australia in 1947/48.\n\n5. Wasim Jaffer (Mumbai, Vidarbha, India)\n\nWasim Jaffer\n\nWasim Jaffer stands fifth in the list of India's all-time leading run-getters in first-class cricket.\n\nThe Mumbai stalwart is the all-time top-scorer in the Ranji Trophy. He scored 19410 first-class runs at an average of 50.67, with 57 centuries and 91 half-centuries.\n\nJaffer also featured in 31 Tests for India, scoring his lone double century in the format against the West Indies in 2006. With five Test centuries, Jaffer may consider himself a tad unfortunate for not featuring in more Tests for his country.\n\nThe Mumbaikar, who has won the most Ranji Trophy titles by any player, was Mumbai's captain when they won their 38th and 39th Ranji Trophy titles in the competition.\n\n4. VVS Laxman (Hyderabad, India)\n\nVVS Laxman\n\nVangipurappu Venkata Sai Laxman, a stylish batsman from Hyderabad, took a particular liking to Australia in international cricket. He stands fourth in the list of all-time leading run-scorers in first-class cricket in India.\n\nWith 19730 runs to his name, a tally that includes 55 centuries and 98 centuries, Laxman was a vital cog in the Hyderabad, South Zone and India teams. The right-hander, who has a top-score of 333 in first-class cricket, scored a record 1415 runs in the 1999-00 Ranji Trophy.\n\nLaxman had one of his most memorable moments when he scored a magnificent 281 against Australia in the 2001 Kolkata Test. Batting out the entire fourth day of that Test along with Dravid, India became only the third team to win a Test after following-on.\n\nWristy flicks and glances off the hips were a hallmark of Laxman's game. The Hyderabad player scored over 8700 runs in 134 Tests, scoring 17 centuries and 56 fifties in the longest format of the game.\n\n3. Rahul Dravid (Karnataka, India)\n\nRahul Dravid\n\nRahul Dravid, one of two batsmen to have scored over 10000 Test runs at number three, is third in the list of most first-class runs by an Indian player.\n\nThe Karnataka batsman, who made his first-class debut in 1990, notched up 23794 runs in first-class cricket, courtesy 68 centuries and 117 half-centuries, during a stellar 22-year career.\n\nNicknamed 'The Wall' for his stoic defensive technique and ability to bat for long periods, Dravid famously scored a double century and an unbeaten 73 to win a memorable Test match against Australia in Adelaide in 2003.\n\nDravid, one of India's Test captains, is one of seven players to have scored over 10000 runs in both Tests and ODIs.\n\n2. Sachin Tendulkar (Mumbai, India)\n\nSachin Tendulkar\n\nSachin Tendulkar is a complete batsman of his generation and a man who 'was not just a cricketer, but an emotion,' according to noted commentator Harsha Bhogle.\n\nThe diminutive Mumbaikar comes second in the list of most first-class runs by an Indian player. Tendulkar scored 25396 first-class runs in 310 games at an average of 57.84, with 81 centuries and 116 half-centuries, in a career spanning almost a quarter-century. A record 15921 of these runs came in Test matches alone.\n\nTendulkar, who is also the all-time top-scorer in ODIs, was strong off the front foot, particularly his straight drives. The first player to score a double century in ODIs, Tendulkar, was also noted for his leg-glances.\n\nHis highest first-class score of 248 not out came against Bangladesh in the 2004 Test in Dhaka, a game India won by an innings and 140 runs.\n\n1. Sunil Gavaskar (Bombay, India)\n\nSunil Gavaskar (left) is seen with Ian Botham here\n\nThe first player to score 10,000 runs and knock up 30 centuries in Test cricket, Sunil Gavaskar, has the most first-class runs than any other Indian player.\n\nThe original Little Master scored 25834 runs in first-class cricket, a tally that includes 81 centuries and 105 half-centuries, at an average of 51.46. Gavaskar's 10122 runs in Tests consist of 34 three-figure scores and 45 half-centuries.\n\nGavaskar is one of five players in Test history to have scored a fourth-innings double hundred, and is the only Indian among three players to hit hundreds in both innings of a Test match on three occasions.\n\nHis record is awe-inspiring as he primarily played in an era of uncovered pitches, and often played without a helmet.\n\nPoll : 0 votes"}, {"url": "https://www.indiatoday.in/sports/cricket/story/this-day-that-year-brian-lara-historic-501-highest-first-class-score-1686144-2020-06-06", "page_content": "By India Today Web Desk: On this day in history, legendary batsman Brian Lara broke another record when he notched up the highest first-class score in cricket history. His iconic 501 not out came just 2 months after his record-breaking triple in Test cricket.\n\nOn June 6 in 1994, Lara scored 501 not out for Warwickshire against Durham at Edgbaston. In the process, he surpassed the Hanif Mohammad's 499 for Karachi against Bahawalpur in the Quaid-e-Azam Trophy semi-final in 1959.\n\nadvertisement\n\nHowever, Lara was given a couple of opportunities by the opposition side as he was bowled a no-ball while batting on 12 and then was also dropped by wicketkeeper Chris Scott on 18.\n\nLara achieved the milestone off 427 balls and in 474 minutes. He hit 174 runs before lunch on the final day of the match and finally brought up his 500 with a cover drive off the bowling of John Morris. Lara hammered 62 fours and ten sixes in his 501*.\n\nThat season, he scored 2006 at an average of 89.82 to become the first man to make seven hundreds in eight first-class innings.\n\nBrian Lara is known as one of the finest modern era cricketers. He amassed 11953 runs, including 34 centuries and 48 fifties with a highest score of an unbeaten 400, in his 131-Test match career. Whereas, finished scored 22156 runs in 261 first-class matches."}, {"url": "https://www.cricketcountry.com/articles/daren-ganga-a-patient-opening-batsman-and-an-inspirational-leader-85640", "page_content": "Updated: August 23, 2014 11:24 PM IST | Edited By: Nishad Pai Vaidya\n\nDaren Ganga proved his leadership credentials very early during his Under-19 days © Getty Images\n\nDaren Ganga, born on January 14, 1979, was a patient West Indian opener who complemented Chris Gayle with his contrasting approach. In 48 Tests for the West Indies, he scored 2,160 runs at an average of 25.71 with three tons and nine fifties. Ganga is more remembered as a leader and his most memorable moment came during the Champions League Twenty20 in 2009 when he led Trinidad and Tobago to the final. An articulate speaker, he is now a commentator. Nishad Pai Vaidya looks back at Ganga’s cricketing journey.\n\nA batsman with more grit and determination than the typical Caribbean flair, Daren Ganga was one interesting player during his days. The orthodox and copybook approach was often contrasting, as the man at the other end, Chris Gayle, fancied whacking every ball out of the ground. However, in the 48 Tests that he played, Ganga maintained his approach and did not fall prey to any temptations. It is surprising that he ended with an average of only 25.71 in Test cricket, but his sharp cricketing brain would mark him as one of the best leaders in recent times in Caribbean cricket.\n\nBorn in Barrackpore, Trinidad on January 14, 1979, Ganga grew up in an East Indian community. In an interview with ESPNcricinfo, he recalls watching Indian movies as a child and that was one way he connected to the origins of his ancestors. But, cricket was a passion and was a sport his whole family took to. Moving through the ranks at an early age, he played for South and Central Trinidad three days shy of his 17th birthday and scored 80. A few days later, he was in the Trinidad Under-19 squad.\n\n[inline-quotes]West Indies also witnessed a leader in Ganga. The fact that he had led West Indies A and a few age group sides had kept him in the reckoning and he had impressed with his tactical skills. [/inline-quotes]\n\nGanga made his First-Class debut against Guyana in the red Stripe Cup in 1996-97 and scored 17 and two on debut. He continued to play age group cricket through the year and was then a part of the West Indies Under-19 team alongside Gayle, Marlon Samuels, Ramnaresh Sarwan and Sylvester Joesph to name a few for the 1998 World Cup in South Africa. Consistent performances in age group cricket and a decent First-Class season that saw him score his maiden ton, as he also made it to the West Indies side for the tough tour to South Africa, before he turned 20.\n\nThe maiden sojourn to South Africa was forgettable for Ganga. In three Tests, he could only muster 75 runs and then his three One-Day Internationals (ODIs) also didn’t yield too many runs. He toured New Zealand in late 1999 and then got an opportunity in Australia in 2000-01. On a tough tour for the West Indies, Ganga impressed with his patience and stoic technique. He didn’t have too many big scores, but when he got starts, he did show some qualities of a good opener. The first fifty in Test cricket finally came against Zimbabwe in 2001 at Bulawayo. On the same tour to Zimbabwe, Ganga scored three fifties in the ODI tri-series which also featured the hosts and India.\n\nHowever, the tough run continued with the sporadic fifties and Ganga had to wait to shine. Then finally, when Australia toured the West Indies in 2003, he hit back to back Test tons to roar back into form. Batting at No 3 at Guyana, he had a sterling 185-run stand with Brian Lara and completed his first Test ton. He followed that up with another big stand with Lara in the Trinidad Test as he moved his way to 117.\n\nDaren Ganga (centre) scored a memorable hundred against Australia in Guyana, forging a wonderful partnership with Brian Lara (left) © Getty Images (File Photo)\n\nGanga continued to remain in the West Indies’ scheme of things and even toured South Africa for the second time. But, his form was inconsistent and by mid-2004, he was out of the side yet again. After those two tons against Australia, he had managed a highest of 73 against Zimbabwe. In early 2005, he scored 265, his highest First-Class score to return to the West Indies side against South Africa but made a duck and was dropped. He finally returned to the side for a good time in 2006 during the tour to New Zealand.\n\nWhile the big scores didn’t come his way, Ganga did show good grit on his return. When India toured, he scored 135 in the third Test at St Kitts and 60 not out in the second innings. On a tough track at Jamaica in the next Test, his innings of 40 was a proof of his quality. With those performances, he truly established himself and later on the tour to Pakistan, he scored 82 and 81, which showed that he was well and truly in the scheme of things. As a result, he was also named the West Indies Player’s Associations (WIPA) Test Player of the Year. He returned for the ODIs on the tour but could not establish himself in the side.\n\n[read-also]6080,6193[/read-also]\n\nWest Indies also witnessed a leader in Ganga. The fact that he had led West Indies A and a few age group sides had kept him in the reckoning and he had impressed with his tactical skills. While on the tour to England in 2007, when Sarwan had a nasty injury, Ganga was asked to lead the side for the remainder of the Test matches. West Indies could not win them, but they showed resolve and fight in those games, nearly coming close in a tough run-chase at Manchester. On a personal note, the only highlight for him on the tour was an innings of 49 and 31 not out at Lord’s.\n\nGanga then moved to South Africa in 2007-08 with a bit of pressure. This time, the inconsistency got the better of him as he could score only 117 runs in six innings and was dropped from the side. That was his last outing in international cricket. It ended where it all started almost a decade ago.\n\nFor Trinidad and Tobago, Ganga continued to remain a vital cog in their unit and led them to victory in the regional T20 tournaments. It was with a team of dashers that he entered the inaugural Champions League Twenty20 (CLT20) in India in 2009. The less fancied team stunned the world with a breathtaking performance and saw the emergence of Kieron Pollard and Adrian Barath to name a few. His team went through to the final and was easily the most popular unit of the tournament. As a captain, he led from the front and became the face of the team and essayed a crucial knock in the semi-final. The defeat in the finals was difficult to take, but it was a memorable performance.\n\nGanga continued to lead Trinidad and Tobago and returned for the tournament in 2011. However, their spirit wasn’t enough this time and they couldn’t replicate that famous performance. In November 2011, he quit as captain and has only played a few games since.\n\nGanga has since donned the role of a commentator and is seen at various cricketing events around the world. An articulate speaker, he had pursued law during his playing days and also runs the Daren Ganga Foundation, which looks after underprivileged kids."}]}