{"John Burnham was a right-handed batsman.": [{"url": "https://en-academic.com/dic.nsf/enwiki/5883641", "page_content": "John Burnham ( June 6 , 1839 – April 20 , 1914 ) was an English cricket er. He was a right-handed batsman who played for Derbyshire between 1871 and 1876. Burnham took part in Derbyshire's first-ever match as a county side, an innings victory over Lancashire, and four further matches between the two sides within the next two seasons. Burnham's final match as a first-class player, was a match against Kent, in which he was bowled out by Test cricketer Charlie Absolom .\n\nBurnham was an upper-middle order batsman. Burnham umpired one game during the 1879 season, three years after giving up the first-class game.\n\nExternal links"}, {"url": "http://everything.explained.today/John_Burnham_(cricketer)/", "page_content": "John Burnham (cricketer) explained\n\nJohn Burnham Country: England Fullname: John William Burnham Birth Date: 6 June 1839 Death Place: Derby, England Batting: Right-handed batsman Year1: 1871–1876 Type1: First-class Debutdate1: 26 May Debutyear1: 1871 Debutagainst1: Lancashire Lastdate1: 20 July Lastyear1: 1876 Columns: 1 Column1: First-class Matches1: 6 Runs1: 55 Bat Avg1: 5.00 100S/50S1: -/- Top Score1: 31 Catches/Stumpings1: 2/- 100S/50S2: / Best Bowling2: / Catches/Stumpings2: / Date: 14 December Year: 2010 Source: https://cricketarchive.com/Players/28/28313/28313.html\n\nJohn William Burnham (6 June 1839 – 20 April 1914) was an English cricketer who played for Derbyshire between 1871 and 1876. He was a member of the team that played Derbyshire's first match in May 1871.\n\nBurnham was born at Nottingham, the son of William Burnham, a joiner and his wife Catherine. He became a clerk and in 1863 he was playing for Suffolk and in one match for an All England XI. In 1870 he played several club games for Burnley. He joined Derbyshire in the 1871 season and took part in Derbyshire's first-ever match as a county side, an innings victory over Lancashire. He played the return game later in the season, and played again for Derbyshire in the 1872 season in both fixtures between Derbyshire and Lancashire. Also in 1872 he played some games for Prince's Club in London. In the 1873 season he only played one match for Derbyshire against Lancashire. He did not play again until the 1876 season when his final match, as a first-class player, was against Kent, in which he was bowled out by Test cricketer Charlie Absolom.\n\nBurnham was a right-handed batsman and played eleven innings in six first-class matches with an average of 5.00 and a top score of 31.[1] In 1881 he was living at Litchurch.[2] Burnham umpired one game during the 1879 season, three years after giving up the first-class game.\n\nBurnham died at Derby.\n\nNotes and References"}, {"url": "https://www.wikiwand.com/en/John_Burnham_(cricketer)", "page_content": "John William Burnham (6 June 1839 – 20 April 1914) was an English cricketer who played for Derbyshire between 1871 and 1876. He was a member of the team that played Derbyshire's first match in May 1871.\n\nEnglish cricketer\n\nQuick facts: Personal information, Full name, Born, D... ▼\n\nBurnham was born at Nottingham, the son of William Burnham, a joiner and his wife Catherine. He became a clerk and in 1863 he was playing for Suffolk and in one match for an All England XI. In 1870 he played several club games for Burnley. He joined Derbyshire in the 1871 season and took part in Derbyshire's first-ever match as a county side, an innings victory over Lancashire. He played the return game later in the season, and played again for Derbyshire in the 1872 season in both fixtures between Derbyshire and Lancashire. Also in 1872 he played some games for Prince's Club in London. In the 1873 season he only played one match for Derbyshire against Lancashire. He did not play again until the 1876 season when his final match, as a first-class player, was against Kent, in which he was bowled out by Test cricketer Charlie Absolom.\n\nBurnham was a right-handed batsman and played eleven innings in six first-class matches with an average of 5.00 and a top score of 31.[1] In 1881 he was living at Litchurch.[2] Burnham umpired one game during the 1879 season, three years after giving up the first-class game.\n\nBurnham died at Derby."}, {"url": "https://www.sportskeeda.com/cricket/top-10-english-middle-order-batsmen-of-all-time", "page_content": "When it comes to Test cricket, the middle-order batsmen are responsible for scoring the bulk of the runs and control the flow of the innings.\n\nSome of the greatest batsmen to have played the game have almost always been middle-order batsmen and the positions between 4 to 7 are absolutely vital if a team is to put up a big score.\n\nEngland, the world's oldest cricketing nation has produced plenty of top-class middle-order batsmen over the course of its cricketing history and many have gone on to become greats of the game. Here is a look at 10 of the very best.\n\n#10 Sir Ian Botham\n\nThe former England great was possibly one of the greatest all-rounders to have ever played the game and had the ability to influence games both with the bat and the ball.\n\nIan Botham batted in middle-order and batted at all positions from number 4 to number 9, however, it was at number 6 that he batted the most times.\n\nIn 97 Test matches that he batted in between positions 4 and 7, Botham scored 5013 runs that included 14 centuries and 21 half-centuries.\n\nHe was primarily an attacking batsman and believed in taking the bowlers on from the outset. That is perhaps the reason why his average is only 34.81, however, as an all-rounder who batted in the middle-order he was one of England's greatest assets.\n\n#9 Allan Lamb\n\nThe South African born batsman was the mainstay of the England middle-order in the 1980s and early 1990s and went on to become one of the best middle-order batsmen to have ever represented the country.\n\nHe did bat at number 3 a few times but it was as a middle-order batsman in the number 5 and number 6 positions that Lamb made his name in international cricket.\n\nHe was a feisty stroke-player and had the technique to negotiate the best bowlers in the business. During his time, the West Indian fast bowlers were almost unplayable at times but Lamb did well against them.\n\nHe batted in the middle-order on 73 occasions and scored 4274 runs at an average of 37.16. He scored 13 centuries and 16 half-centuries as a middle-order batsman.\n\n#8 Paul Collingwood\n\nFormer England all-rounder Paul Collingwood proved to be one of the most accomplished middle-order batsmen from 2003 through to 2011 and although he played at number 5 on most occasions, he batted at numbers 4, 6, and 7 as well.\n\nCollingwood was technically superb and at ease on the green pitches in England, the fast decks in Australia or the dust bowl in the subcontinent. In addition to that, he has an excellent defensive technique that made him such a difficult batsman to dislodge.\n\nHe played in 68 Test matches and scored 4259 runs at an average of 40.56. He notched up 10 hundreds and as many as 20 half-centuries in his distinguished career.\n\n#7 Colin Cowdrey\n\nThe former England great who played 114 Test matches between 1954 and 1975, batted at all positions in the batting order. He had opened the innings on several occasions and also played at number 3, but for the bulk of his career, he was a middle-order batsman who batted at number 4 or 5.\n\nCowdrey was a stroke-player of immense gift and became one of England's longest-serving cricketers in that era. He was also the first cricketer to complete the milestone of 100 Tests. He batted in the middle-order in 73 of those Tests and went on to become one of England's greatest batsman in those positions.\n\nCowdrey scored 4404 runs at an average of 43.17 and slammed 11 centuries in addition to 24 half-centuries.\n\n#6 Graham Thorpe\n\nThe left-handed batsman who played exactly 100 Test matches for England between 1993 and 2005, was the best batsman in the side for much of his career.\n\nHe batted at number 4 or 5 for most of his career and was known for his excellent technique, stroke-making abilities as well as the ability to spin well in tours to the subcontinent.\n\nHe has the second highest run scorer among English middle-order batsmen of all time and he did so in 99 Test matches, during the course of which Thrope scored 6608 runs at an average of 44.95.\n\nHe made 15 centuries and 39 half-centuries and remained one of England's middle-order order mainstays during a pretty tough period for the national team.\n\n#5 Ian Bell\n\nThe right-handed batsman who served as one of the pillars of the English middle-order during the team's ascent to becoming one of the world's best Test sides initially batted at number 3 but then went on to bat in the middle-order.\n\nIan Bell played 118 Tests for England from 2004 to 2015 and in 94 of those games, he batted in the middle-order.\n\nBell had an excellent defence but he was primarily an attacking batsman and he was arguably one of the best players of the cover drive in world cricket for much of his career.\n\nHe is the third highest run scorer among English middle-order batsmen and piled up 5497 runs at an average of 45.05. Bell scored 20 centuries and 33 half-centuries as a middle-order batsman.\n\n#4 David Gower\n\nThe left-handed batsman is probably one of the greatest batsmen to have ever played for England and he was at ease in both the top order as well as in the middle-order.\n\nDavid Gower played for England from between 1978 and 1992 and is regarded as one of the most graceful stroke-makers to have ever played the game.\n\nAlthough he had opened the innings a few times and batted at number 3 plenty of times, it was as a middle-order batsman that he is best known.\n\nAs a middle-order batsman, Gower made 5539 runs at a healthy average of 42.28 and scored 10 hundreds, in addition to 29 fifties.\n\n#3 Kevin Pietersen\n\nKevin Pietersen is one of the greatest batsmen in modern cricket history and will definitely be included among the best batsmen to have ever represented England in Test cricket.\n\nHe did bat in top order on a handful of occasions but it was at number 4 that he made the bulk of his career runs.\n\nPietersen's game was built on the ability to brutally attack the best bowlers, anywhere in the world and although he had trouble with left-arm spin, he overcame those problems and slammed one of the finest hundreds in India to help England win the series in 2012.\n\nAs a middle-order batsman, Pietersen scored 8050 runs, the highest among middle-order batsmen for England and averaged 47.07. He slammed 23 centuries and 34 half-centuries in the process.\n\n#2 Ken Barrington\n\nIn his 13 year Test career from 1955 to 1968, Ken Barrington emerged as one of the world's best batsmen and he is still regarded as one of the finest batsmen to have ever played for England. He had opened the innings 4 times and had even batted at number 3 on 40 occasions.\n\nHowever, the major part of his career was spent as a middle-order batsman at either number 4 or number 5. Barrington was an attacking batsman by nature but later on, in his career, he became far more conservative batsman and was intent on grinding the opposition bowlers to dust.\n\nThe right-handed batsman played in the middle-order in 60 Test matches and scored 3978 runs, at a brilliant average of 50.35. He also brought up 7 centuries and 27 half-centuries as a middle-order batsman.\n\n#1 Denis Compton\n\nDenis Compton, who played for England in 78 Test matches between 1937 and 1957, is the greatest middle-order batsman to have ever played for the country.\n\nIn 72 of those Tests, he batted in the middle-order. Compton was a superb attacking batsman, who liked to take on bowlers and his ability to play all strokes in the book, made him an extremely tough batsman to bowl to.\n\nFor most of his career, Compton batted at number 4, although he did bat at the other middle-order positions at some points in his career.\n\nCompton scored 5422 runs I the middle-order positions and brought up 17 centuries, in addition to 24 half-centuries. However, it is his average of 52.64 that makes him England's greatest ever middle-order batsman.\n\nPoll : 0 votes"}, {"url": "https://www.theguardian.com/sport/2019/may/01/the-rise-of-the-ambidextrous-cricketer", "page_content": "For most of us, the sight of Kamindu Mendis on his international debut in Colombo last year bowling left-arm orthodox spin to Jason Roy and then switching to right-arm off-breaks to the left-handed Ben Stokes brought a frisson of novel excitement. Five thousand miles away in Brisbane, John Buchanan was thinking: “What took you so long?”\n\nBuchanan, who coached Queensland to their first ever Sheffield Shield title in 1995 and later spent eight years as coach of Australia, was preaching the benefits of cricketers being ambidextrous at least 20 years ago. Buchanan is a divisive figure – Shane Warne has described him as, among other things, “a goose [who] has no idea and lacks common sense” but Justin Langer considers him “a great visionary”. Wherever your sympathies lie, it’s hard to deny that he’s an original thinker on the game.\n\nMendis is not the only one. In India there is Akshay Karnewar and, in Pakistan, Yasir Jan, the game’s only ambidextrous pace bowler. In the women’s game, Shaila Sharmin, from Bangladesh, and Jemma Barsby, the daughter of former Queensland opener Trevor, both bowl spin with either arm.\n\nSo, is Buchanan surprised that it took so long for an ambidextrous player to be performing at international level? “Yes and no. Yes insofar as if you agree with the principles then you’d think everybody would be rushing to do it. No in the sense that there are brick walls there in the way people perceive the game to be played.”\n\nThose principles, according to Buchanan, are the same that apply to the benefits of having all-rounders in the team. “One way to outgun, outmuscle or outpoint the opposition is to have more players on the field than they do,” he says. “Taken to its extreme, I’d have bowlers who could bowl left- and right-handed, and fielders who could field with their right and left hands. If you look at batters, there might be a particular bowler, or spell, or particular wear and tear in a wicket that gives a batsman the opportunity to reverse his stance and take back control of the game. That’s our aim – to control the game, to counteract the opposition’s strengths and eliminate our weaknesses by having more options.”\n\nThis all sounds wonderful in theory, but the practice is more challenging. Only one in a hundred people are truly ambidextrous. Buchanan believes that sporting ambidexterity can be trained but it has to start at a really young age. Mike Hussey was a right-handed batsman until he saw Allan Border bat in a Boxing Day Test and decided he wanted to be a left-hander like his new hero. But he was six or seven years old at that time.\n\nDavid Warner bowled wrist-spin with both arms until, Buchanan reckons, he reached elite age-group level and had to focus on one skill (aside from his powerful left-handed batting, of course).\n\nIn his book, On Cricket, Kevin Pietersen explained the childhood origins of his 2006 switch-hit off Muttiah Muralitharan at Edgbaston, which he described as “a bit naughty”. Of his backyard games growing up in South Africa, he wrote: “If you were out for a golden duck you had to face six balls left-handed and, if you got out again, you were out for good. So I thought, I need to become good at this.”\n\nKevin Pietersen switch hits for England at the Kensington Oval in 2009. Photograph: Julian Herbert/Getty Images\n\nBaseball is generally regarded to be at the vanguard of innovation in the world of bat-ball sports yet the number of switch-hitters – batters who can bat right- and left-handed – has not increased in recent years despite the boom in analytics and the endless quest for competitive advantage. Last year, there were just 48 switch-hitters among the 750 active players across the 30 Major League Baseball teams.\n\nSwitch pitchers are even rarer. Pat Venditte of the San Francisco Giants is the only switch pitcher in MLB and Greg A Harris, who played in the 1980s and early 1990s, is regarded as the only other such player in the modern era and his switches to left-hand were very sparing indeed. Just as in cricket, this unusual skill required a law adaptation whereby the switch pitcher has to inform the chief umpire which arm he is throwing with when each new batter appears.\n\n“The people who bowl left-handed and throw right-handed are the interesting ones,” says Carl Hopkinson, the former Sussex batsman who became the ECB’s lead fielding coach last year. “Being able to throw with your non-dominant hand will clearly give you an advantage. But is it such a big advantage to make all the time spent practising it worthwhile? I’m not sure if I’m honest. It’s always something I’ve thought about but I wonder about the cost benefit.”\n\nHopkinson believes there is so much work to be done on the quality and volume of throwing with players’ dominant arms that any serious tilt at universal fielding ambidexterity is some way off. But he’s quick to add: “That open-mindedness and willingness to try different stuff is something that we need to get better at.”\n\nHe acknowledges it is no coincidence that, with the exception of Jemma Barsby, ambidextrous bowlers have mostly emerged from Asia, where players’ early development is traditionally less structured than in England or Australia.\n\nJemma Barsby, an all-rounder who can bowl with both hands, playing for the Heat in the Women’s Big Bash League in Australia. Photograph: Daniel Pockett/Getty Images\n\nHow far did Buchanan push his theory when he was coach of Australia? “As far as I could, which was really only around fielding and was really just a start, trying to get underarm throwing better. While there was a skill component to it, it was probably more about fun. By that stage it’s too late. They have to spend too much time trying to learn something that they haven’t for most of their careers. It has to start early.”\n\nHopkinson agrees: “My advice to any coach of young players would be that, if you have an 11- or 12-year-old who can throw equally well with both arms, then encourage them to keep going as long as they can. Don’t choose. Practise throwing with both each session.”\n\nBuchanan believes the emergence of Mendis and others represents a critical mass that can spark some sort of explosion of ambidextrous cricketers. But he also acknowledges that even in football “where the idea of people using both sides of their body is not foreign, the best players still have a preferred foot”.\n\nThe 65-year-old recently returned to grassroots coaching, taking on a role at Wests in the Brisbane Premier League. It is the first time he has been involved with grade cricket since 1993, when he coached the University of Queensland. The senior players may be too long in the tooth to adopt Buchanan’s ideas, but he hopes that junior coaches may be persuaded to challenge the status quo. Keep an eye, or two, out to see if Buchanan ever achieves his ambidextrous vision.\n\nWho is the best Test batsman in the world? What are the best cricket books ever written? Find out in the new issue of Wisden Cricket Monthly"}, {"url": "https://www.sportskeeda.com/cricket/players-with-the-most-test-centuries-at-each-batting-position", "page_content": "Scoring a Test match hundred, a dream for any aspiring cricketer, depends on a multitude of factors like skill, mental strength, and temperament. But one other factor that is perhaps as important as the ones mentioned above is allowing a player to bat in their preferred batting position.\n\nOver the years, successful batsmen in the game have been the ones who grabbed their opportunities with both hands, and made a particular batting position their own. These players have managed to be prolific scorers in their favoured batting positions, going past the three-figure mark on multiple occasions.\n\nOn that note, let us have a look at the players with the most Test centuries at each batting position.\n\n.\n\nSunil Gavaskar\n\nSunil Gavaskar is one of the best batsmen India has ever produced. He is considered by many to be the best batsman of his time. There is hardly any list on Test batting statistics in which Gavaskar doesn't feature. The diminutive batsman made runs in every part of the world, amassing 10122 runs in 214 innings at an average of 51.10.\n\nThe little master enjoyed unprecedented success batting at the top of the order. Gavaskar scored 34 centuries in his Test career, 33 of them while opening the batting. However, his highest score in Test cricket, 236* came against West Indies in Chennai when he batted at number 4, the only time he scored a ton from a non-opening batting position.\n\nNumber 3: Kumar Sangakkara (37 centuries)\n\n.\n\nKumar Sangakkara has the most Test runs of any Sri Lankan player. .\n\nKumar Sangakkara was the cornerstone of Sri Lankan cricket for over a decade and a half. The southpaw is, undoubtedly, the most successful wicket-keeper-batsman from the island nation. Cricket fans still remember his elegant cover drives. Sangakkara scored 12400 Test runs at an impressive average of 57.14 from 233 innings.\n\nThe left-hander's stats at number three are even better. It is the position in which he batted for large swathes in his career. Sangakkara's average at no. 3 climbs up to 60.83 in the 207 innings he batted at this position. The wicket-keeper batsman scored 37 of his 38 tons, including his best Test score of 319, while batting at number three. His other century came while batting at number 4.\n\nNumber 4: Sachin Tendulkar (44 centuries)\n\n.\n\nTendulkar has been given the name 'God of Cricket' by his fans.\n\nSachin Tendulkar, the man who doesn't need any introduction, is among the finest batsmen to have ever graced the sport. The right-handed batsman scored prolifically against every nation. During the course of his illustrious Test career, Tendulkar scored 15921 runs from 329 innings at an average of 53.79.\n\nTendulkar batted at number four in 275 innings, which comprises about 83% of all his Test innings. By the end of his career, number 4 and Tendulkar became synonymous. Not surprisingly, his best score of 248 not out against Bangladesh in the Dhaka Test in 2004 came at this position.\n\nThe Mumbaikar scored 44 of his 51 Test tons while batting at this position. Tendulkar scored five centuries while batting at number 5, and two at number 6.\n\nNumber 5: Steve Waugh (24 centuries)\n\n.\n\nSteve Waugh plays a cover drive.\n\nSteve Waugh is among the best Test captains to have ever led Australia. Waugh was known for his impressive mental strength and patience.\n\nThe former skipper always managed to hold his nerve in tense match situations. As a batsman, Waugh was equally adept. The right-handed batsman ended his Test Career with 10927 runs in 260 innings at an average of 51.06.\n\nWaugh was a classical middle-order batsman, who mostly batted at number 5. The former Australian captain was most successful at number 5. The Aussie scored 24 of his 32 centuries while batting at this position, which includes his Test best score of 200 achieved in the 1995 Kingston Test against the West Indies.\n\nThe right-hander scored 6 other centuries at number 6, and one each at numbers 3 and 7 respectively.\n\nNumber 6: Asad Shafiq (9 centuries)\n\n.\n\nAsad Shafiq\n\nAsad Shafiq is the only active player to make this list. The 34-year-old Pakistani batsman is a regular in the Test team. The right-handed batsman has scored vital runs lower down the order on several occasions. Shafiq has 4593 Test runs from 123 innings at an average of 39.26.\n\nShafiq has batted lower down the order during his career, and has found most success while batting at number 6. He has scored 9 Test centuries at no. 6, which is the most by any player at this position. Shafiq's Test best score of 140 came at this very position, during a Test against Australia in Brisbane in 2016, where Pakistan fell short of an improbable target of 489 by only 39 runs.\n\nThe man from Karachi has also scored two centuries from number 5, and one from number 4. Shafiq, who looks likely to play for Pakistan for a few more years, hasn't in all likelihood, scored the last of his Test centuries.\n\nNumber 7: Adam Gilchrist (12 centuries)\n\n.\n\nAdam Gilchrist was known for his attacking batting.\n\nAdam Gilchrist redefined the role of a wicket-keeper batsman in the late 90's by his belligerent batting.\n\nHe is one the first wicket-keepers who could bat as well, if not better than a proper batsman. Gilchrist could take any bowler head-on, and come out on top. The southpaw had an excellent ODI career but wasn't far off in Test Cricket too, where he scored 5570 runs from 137 innings at an average of 47.61.\n\nIn ODIs, Gilchrist opened the innings to take full toll of the fielding restrictions, while in Tests, the left-hander wreaked havoc in the lower middle order, coming in at number seven. Gilchrist's 12 tons while batting at number 7 is the most in Test history by any player at this position.\n\nPerhaps, not surprisingly, his best Test score of 204 not out came at this very position, in the 2002 Test against South Africa in Johannesburg which Australia won by an innings and 360 runs. Additionally, the wicket-keeper-batsman scored two centuries while batting at number 6, and one apiece from numbers 3,5, and 8 respectively.\n\nNumber 8: Daniel Vettori (4 centuries)\n\n.\n\nDaniel Vettori.\n\nDaniel Vettori is the youngest New Zealand player to play Test cricket. Although more renowned for his bowling exploits, Vettori was more than handy with the bat in hand. The southpaw scored an impressive 4531 runs from 174 innings at an average of 30.01, to go with the 362 wickets.\n\nDuring his career, Vettori batted in every position, except as an opener. But, he usually batted lower down the order. Four of the left-hander's 6 tons came while batting at number 8, which is a record by any player in Test history batting at that position.\n\nVettori's Test-best score of 140 came, not surprisingly, at number 9, albeit in a losing cause against Sri Lanka in the 2009 Colombo Test. The former skipper's two other Test hundreds came while batting at number 6 and 9 respectively.\n\nNumber 9: Shaun Pollock (2 centuries)\n\n.\n\nShaun Pollock celebrates after completing his hundred.\n\nShaun Pollock is one of the best all-rounders to have played for South Africa. The right-hander was predominantly a bowling all-rounder who troubled many famous batsmen during his prime.\n\nHowever, Pollock was also impressive with the bat in hand. The South African legend amassed a total of 3781 Test runs in 156 innings at an average of 32.32, along with 421 wickets.\n\nFor most of his career, Pollock batted at numbers 7 and 8. The South African legend scored only two centuries in Test cricket. Both of them came when he batted at number 9, which marks the only instance of multiple centuries scored by a player at this position.\n\nNumber 10: Pat Symcox, Reginald Duff, Abul Hasan, Walter Read (1 century)\n\n.\n\nReginald Duff, Walter Read, Pat Symcox, and Abul Hasan(From Left to Right)\n\nScoring a century after coming out to bat at number 10 is a very rare feat in Test cricket. Only 4 players have ever managed to accomplish the same in a Test.\n\nThe first one to do so was Walter Read, who scored 117 against Australia during a 'timeless' Test at the Oval in 1884. Reginald Duff followed suit 8 years later, scoring 104 against England in another 'timeless' Test in Melbourne, in the process becoming the first Test debutant to score a century from that position..\n\nMore than nine decades later, Test cricket witnessed another centurion at no. 10. Pat Symcox scored 108 against Pakistan in the 1998 Johannesburg Test while batting at that position.\n\nFast forward 14 more years, Bangladesh's debutant Abul Hasan registered the second-highest Test score by a no. 10 batsman in Test history when he scored 113 against West Indies in the 2012 Khulna Test.\n\nNumber 11: NONE\n\n.\n\nAshton Agar\n\nAlthough this feat has been accomplished in First Class cricket, of which Test cricket is a sub-set, no player has ever scored a Test century at number 11.\n\nAustralia's Ashton Agar came the closest in this regard, when he scored 98 off 100 balls in a Test match against England in 2013 before the teenager was dismissed two short of what would have been the first hundred by a number 11 player in Test history.\n\nIt marked the first time a number 11 batsman registered a fifty on debut. Warwick Armstrong's unbeaten innings of 45 in 1902 was a record score by a number 11 Test debutant that stood for more than a century.\n\nPoll : 0 votes"}, {"url": "https://www.sportskeeda.com/cricket/top-10-new-zealand-batsmen-of-all-time", "page_content": "Although New Zealand’s history and achievements as a cricketing nation might be considered modest, (particularly in comparison with their illustrious neighbours), one cannot deny that the country has produced plenty of excellent batsmen over the years.\n\nThe likes of Glenn Turner and Martin Crowe were among the best batsmen of their eras, while Kane Williamson is regarded as the premier Test batsman of this era. So, let’s take a look at 10 of the best batsmen to have ever represented the country.\n\n#10 Mark Richardson\n\nRichardson may have played for New Zealand for only four years or so but during that period he became one of the most notoriously difficult batsmen to dislodge. What is even more remarkable is the fact that he started off as a left-arm spinner before eventually turning into a left-hand batsman who could stonewall the best attacks in the world.\n\nRichardson was often the difference between a draw or a loss and win. He had a strike rate of only 37.66 but the average of 44.77 across 38 Tests showed that he batted time and was a throwback to an earlier age. He retired prematurely at the age of 33.\n\n#9 John Wright\n\nJohn Wright was a solid, left-handed batsman\n\nWhile he is perhaps more famous for having been India’s coach, it should not be forgotten that John Wright was an accomplished left-hand opening batsman for New Zealand and part of the team that were quite successful during the 1980s.\n\nHe played 82 Tests in a career spanning around 15 years and scored 5334 runs at an average of 37.82. Wright scored 12 centuries in his Test career but one of his most notable achievements was becoming the first batsman from his nation to cross the 4000-run barrier in Tests.\n\nWright was particularly noted for his solid defensive game but at the same time, he had the ability to play a variety of attacking shots when necessary.\n\n#8 Nathan Astle\n\nNathan Astle was a fearsome prospect at the top of the order\n\nNathan Astle was a mainstay of the New Zealand batting line-up in both Tests and ODIs for little more than a decade, during which he played a number of memorable innings for his country.\n\nAn attacking batsman who loved to take on the opposition, he was particularly successful in the shorter format of the game, notching up 16 hundreds in 223 games. His tally of 16 ODI hundreds is the second highest among New Zealand batsmen.\n\nIn 81 Tests, he scored 4702 runs and also reached three figures on 11 occasions. His most famous innings is the 153 ball 222 he scored against England at Christchurch in 2002. It remains the fastest double hundred in Test cricket.\n\n#7 Stephen Fleming\n\nStephen Fleming was a strokemaker par excellence\n\nConsidered one of New Zealand’s greatest ever captains for having turned a team of limited talents into a competitive machine, Stephen Fleming is also one of the best batsmen to have represented his country at the highest level.\n\nFleming was a strokemaker par excellence and in his 111 Tests for New Zealand, he scored 7172 runs at an average of just over 40. His tally of nine centuries, however, does not do justice to his talent as a batsman.\n\nHowever, he holds the distinction of having been the first batsman from New Zealand to go past 7000 Test runs. In ODIs, he played 280 games for his country and scored eight centuries at a modest average of 32.40.\n\n#6 Brendon McCullum\n\nBrendon McCullum's slam-bang approach at the top was a joy to watch\n\nOnly one word can be used to describe Brendon McCullum the batsman. Freak. A thorough entertainer, he is the only batsman from New Zealand to have scored a triple century. Moreover, he has a freakish strike rate of 64.60 across 101 Tests.\n\nHe set the tone for the innings more often than not with his savage hitting at the top of the order and turned New Zealand into one of the best sides in ODI and T20 cricket. McCullum might not have been everyone’s idea of a true batsman but he was effective in what he did and will go down in history as one of New Zealand’s greatest ever.\n\n#5 Ross Taylor\n\nRoss Taylor is one of New Zealand's greatest batsmen\n\nRoss Taylor emerged as New Zealand’s premier batsman in 2007 just when the previous generation were reaching the twilight of their careers. Over the last decade, he has established himself as one of New Zealand’s greatest batsmen.\n\nTaylor does not quite possess a copybook technique but his unique bottom handed style of batting has proven immensely effective across formats. He has the 2nd highest average (47.10) among all New Zealand batsmen till date and has amassed 6030 runs (16 centuries) in 81 Tests so far.\n\nTaylor has been one of New Zealand’s mainstays in the limited overs formats as well and hopefully, his record will improve further in the last few years of his career.\n\n#4 Bert Sutcliffe\n\nBert Sutcliffe scored a career-best 230 against India\n\nBert Sutcliffe was New Zealand’s first great batsman and although he played only 42 Test matches in a career spanning around 18 years, his class as a batsman was never in any doubt.\n\nSutcliffe was a graceful top-order batsman who could bat for long periods. His greatest series was perhaps the 1949 tour of England in which he averaged 60.42 and was named one of the cricketers of the year by Wisden. He averaged 40.10 overall and his career highest score of 230 not out came against India in Delhi during the 1955-56 tour.\n\n#3 Glenn Turner\n\nTurner was New Zealand's first batting superstar\n\nOpener Glenn Turner was New Zealand’s first superstar batsman and during his international career that lasted around 14 years, he proved to be one of the world’s premier opening batsmen.\n\nTurner had a rock-solid technique and a passion for-run scoring that bordered on obsessive. A solid defensive technique coupled with a determined game made him a hard batsman to dislodge. He played 41 Tests in which he scored 7 centuries and clocked an average of 44.64.\n\nTurner is also famous for having scored 171 not out against East Africa in the inaugural World Cup. It was an unheard of ODI score at the time.\n\n#2 Martin Crowe\n\nMartin Crowe was New Zealand's greatest batsmen until the arrival of a young prodigy called Kane Williamson\n\nSolid technique, scintillating stroke play and intelligence were some of the attributes that made Martin Crowe not only one of New Zealand’s greatest ever batsmen but also among the finest batsmen globally. Crowe was the best batsman in the world in the 1980s and although his career only lasted 77 Tests, he scored 5444 runs at an average of 45.36.\n\nIn addition to that, he scored 17 Test centuries, the highest by a Kiwis until Kane Williamson equalled it. Like any of the great batsmen to have ever played the game, Crowe seemed to have a lot of time to play his strokes.\n\n#1 Kane Williamson\n\nThe greatest Kiwi\n\nKane Williamson is still only 27 years old but has already played 61 Tests along with 114 ODIs and 39 T20s. There is absolutely no doubt that he is already the greatest batsman in New Zealand’s cricketing history.\n\nHe debuted at the age of 20 during a tough away tour to India but did not look out of place even once. He has the technique to play on any pitch, against any bowling attack and in addition to that, like any good batsman, he can attack the best bowlers in the world.\n\nHe has already crossed the 5000-run mark in Tests and has scored 17 centuries, at an average of 51.16. Williamson is now in the race to become the best batsman in the world and it is safe to say that his status as New Zealand’s best ever is safe.\n\nPoll : 0 votes"}, {"url": "https://www.sportskeeda.com/cricket/five-batsmen-who-invented-innovative-shots", "page_content": "The stereotypical image of cricket evokes tradition, class and a stately pace. However, It is equally true that as time has passed, the game has evolved drastically.\n\nFrom limited overs' cricket to colored clothing, from carrom balls to reverse sweeps, cricket has been enriched by innovations.\n\nWe take a look at some great batsmen who invented cricket shots that have entered the annals of the game and become part of the global repertoire of stroke-making.\n\n#5 Ranjit Sinhji\n\nThe Ranji Trophy was named after him\n\nThe grandfather of Indian cricket, Ranjit Sinhji has had the Ranji trophy named after him. Ranji, as he was popularly known, was a king, both in his style and lineage.\n\nSinhji is, to this day, regarded as one of the greatest batsmen to have played the game and was called by noted cricket writer Neville Cardus as the 'midsummer night's dream of cricket\".\n\nRanji played Test cricket for England and first-class cricket for both Cambridge and Sussex. His inclusion in this list is inevitable as he was the most inventive batsman of his time and is credited with coming up with the most delicate cricketing shot possible, the leg glance; the push off the hips to a faster ball that runs off to the boundary with the minimum effort.\n\n#4 Mushtaq Mohammed\n\nMohammed was a proficient leg-spinner as well\n\nThe stylish all-rounder had a long career in the 60s and 70s and even captained Pakistan in a few Tests.\n\nMushtaq comes from a long legacy of cricketers, with his elder brothers Wazir and Haneef also having played Tests for Pakistan successfully.\n\nHe scored 10 Test hundreds for Pakistan and was also a proficient leg-spinner who took 79 Test wickets.\n\nMohammed is credited with bringing the unconventional and extremely difficult reverse sweep into currency (though some believe his elder brother Haneef invented it).\n\nThis shot is now part and parcel of modern day cricket and its aggressive nature but Mushtaq made it a part of his repertoire way back in the '60s.\n\n#3 Tilakaratne Dilshan/Douglas Marillier\n\nDilshan introduced the Dilscoop in the 2009 ICC World T20\n\nAs cricketers, they are as different as possible. Douglas Marillier only played 48 ODIs and made only one ODI century.\n\nTilakaratne Dilshan is, on the other hand, one of the most decorated cricketers of Sri Lanka. However, they count as one batsman here because they both popularised the astounding paddle shot where you lift the ball behind the wicketkeeper, to the fine leg boundary.\n\nMarllier destroyed India in one memorable innings where the shot featured prominently, Dilshan used the Dilscoop to wreak havoc for years.\n\n#2 Kevin Pietersen\n\nPietersen used the switch hit to devastating effect\n\nThe world was left gaping when Kevin Pietersen first used it against the wily legend, Muttiah Muralitharan.\n\nYes, you got that right, I am talking about the switch hit. While anecdotal evidence suggests Jonty Rhodes first played the shot in an ODI, only Pietersen can be called the true inventor of this astounding shot where a right-handed batsman becomes a leftie for a second, and vice versa, before launching it into the stands.\n\nPietersen was a brilliant international batsman despite all his controversies and the switch hit is the proof; David Warner and co. will acknowledge his contribution to the shot.\n\n#1 Sachin Tendulkar\n\nSachin Tendulkar had the full range of shots\n\nSome argue that the uppercut was around a long time before Sachin Tendulkar made it his own.\n\nThey might be right, but Tendulkar's craft while using it truly makes him the inventor of the modern uppercut where the ball doesn't stay on the ground but sails over the third man boundary.\n\nNot only for records is he arguably the greatest to pick up a cricket bat.\n\nPoll : 0 votes"}, {"url": "https://www.itsonlycricket.com/england-opening-batsman", "page_content": "England’s opening batsmen have been under the spotlight in recent years but who are the best openers in the history of the English game?\n\nBest England Openers in Cricket History\n\n1. Herbert Sutcliffe\n\nAlong with Jack Hobbs, Herbert Sutcliffe formed what many believe was England’s best opening partnership of all time. After making his debut against South Africa at Edgbaston in 1924, he played his final test against the same opponents 11 years later.\n\nSutcliffe played 54 test matches in total and scored 4555 runs with 16 centuries. His highest score in tests was 194 but it’s his consistency and his average of 60.73 which puts him at the top of this list.\n\nHerbert Sutcliffe’s technique and incredible powers of concentration were among the keys to his success and he made an incredible 151 centuries in all first class cricket.\n\n2. Geoffrey Boycott\n\nYorkshire’s Geoffrey Boycott was England’s established opening batsman when I grew up watching cricket. He also had a brilliant technique and incredible patience for any type of situation.\n\nBoycott made his debut against Australia in 1964 and would go on to play 108 tests in 18 years. His tally of 8114 runs was a record for England at the time and it included 22 centuries with a highest score of 246.\n\n3. Graham Gooch\n\nAfter making his test debut in 1975, Graham Gooch would eventually take over from Geoff Boycott but the two were very different batters. Gooch would always look to score quickly and to take the shine off the new ball very early on.\n\nIt was an effective approach and one that brought him 8900 runs in test cricket. At one point, he was England’s highest run scorer in the format and the highlight of his career came against India in 1990. Gooch scored 333 on first innings and added a century in the second. His total of 456 in the match remains the highest in test cricket history.\n\n4. Leonard Hutton\n\nLen Hutton took over from Jack Hobbs to become another of England’s most effective opening batters. Hutton himself enjoyed a brilliant career and he still holds the record for the highest score by an Englishman in test cricket.\n\nAgainst Australia at the Oval in 1938, Hutton made 364 in England’s incredible total of 903/7. That effort was one of 19 centuries that he scored in his test career. A more stylish batsman than some of his contemporaries, Len Hutton’s final tally of 6971 international runs came at an impressive average of 56.67.\n\n5. Jack Hobbs\n\nAs part of an extraordinary opening partnership, Jack Hobbs was a mainstay of England’s top order for 23 years from his debut in 1907 to his final test against Australia in 1930. At a time when less international cricket was played, Hobbs featured in just 61 test matches in that long period.\n\nHe certainly made his mark with those relatively limited set of opportunities and, in 102 test innings, he scored 5410 runs at an average of 56.94. His 15 test centuries included a best of 211 which was made against South Africa in 1924.\n\n6. Alastair Cook\n\nAs the highest English test run scorer of all time, Alastair Cook could have been ranked more highly. However, we also need to take into account the amount of test innings that he played and compare them to those of others on this list.\n\nThat’s not to take anything away from Cook. He was a stunning batsman who scored a century on debut against India in 2006. 12 years later he retired from test cricket with another ton in his final innings against the same opponents.\n\nIn total, the former England captain appeared in 161 tests making 12,472 runs. He scored no fewer than 33 hundreds with a best of 294.\n\n7. Michael Atherton\n\nAn obdurate batsman, Michael Atherton showed all the mental qualities needed to become an opener. He had extreme powers of concentration and was unfazed by even the most hostile bowling and sledging from his opponents.\n\nHe may not have always been able to quicken the tempo when he’d been at the crease for a significant amount of time but he was supremely effective at the top of the order. Atherton played 115 tests for England between 1989 and 2001. He made 7728 runs with 16 centuries and a brilliant best of 185 from 492 balls against South Africa in 1995.\n\n8. Andrew Strauss\n\nTogether with Alastair Cook, Andrew Strauss formed one of the best modern-day partnerships in world cricket. They were extremely successful as a pairing and both returned exceptional figures in their own right.\n\nStrauss was another man to score a hundred on his debut when he made 112 against New Zealand at Lord’s in 2004. In fact, Strauss was very unlucky to miss out on doubling up as he was infamously run out on 83 in the second innings.\n\nFrom that first game in 2004, Strauss would go on to play exactly 100 tests as he became an established opener and skipper of the England test side. That century on debut was one of 21 hundreds at test level and that tally includes his highest score of 177.\n\nStrauss was a stylish left hander who could bat at a high tempo when required and he also produced some important innings in One Day Internationals.\n\n9. Marcus Trescothick\n\nMarcus Trescothick was Andrew Strauss’ opening partner for a brief period until health issues away from the pitch sadly brought an end to his playing career. Another left hander, the Somerset man liked to play his shots from the very start and his quick scoring was perfect for a new millennium and a new era for test match cricket.\n\nTrescothick made his debut against the West Indies in 2000 and he would bow out prematurely against Pakistan at The Oval six years later. It was a brief test career but his statistics at test match level prove that he fully deserves his place here.\n\nIn 76 test matches, Marcus Trescothick made 5825 runs for England. His average was an impressive 43.79 and he scored 16 centuries with a highest score of 219. There could have been more but the player continued to enjoy county cricket until his retirement from the game in 2019.\n\n10. John Edrich\n\nJohn Edrich scored the very first century that I watched as a spectator. That’s not why I’ve included him on this list and he very much deserves to be here. His 175 against Australia at Lord’s in 1975 was, however, one of my earliest and favourite cricketing memories.\n\nThis was the tail end of his career, however. John Edrich had made his debut in England’s test side back in 1963 against the West Indies. He was a compact left-handed batsman who also played at the start of the One Day International era but he was more suited to the sedate pace of test cricket.\n\nEdrich famously made a triple century in test cricket, taking 310 from New Zealand in 1965. He passed a hundred on 12 occasions in 77 tests from 1963 to 1976. In total, the left hander made 5138 test runs at an average of 43.54.\n\nPromising England Openers in County Cricket\n\nThe opening slot in the English national team is a problem area at the time of writing. The side has yet to really compensate for the loss of Alastair Cook and a number of batsmen have tried and failed.\n\nAs I write, Durham’s Alex Lees is the latest to be tried in this position and he certainly has some promise. Elsewhere, it may well be time to hand Nottinghamshire’s Joe Clarke a chance. Issues off the field may have held Clarke back, up to this point but his record in English county cricket is hard to ignore.\n\nOther promising young batters who are coming through the county ranks include Harry Brook, Josh Bohannon and Rob Yates. Not all of those players will have opened throughout their young careers but they seem to have the talent and the qualities needed for this specialist role.\n\nRob Yates is particularly interesting, having made big runs in the final of the Bob Willis trophy in 2021 and we could see him included in a test squad before too long."}, {"url": "https://crictv4u.com/full-members/ireland/top-10-best-batsmen-of-ireland-cricket-team/", "page_content": "Ireland national cricket team is popularly known as \"Men in Green\" as well as \"Green and Whites\". Currently, the captain of the Ireland national cricket team is Andrew Balbirnie. Ireland national cricket team was an associate member of the ICC from 1993 but acquired the status of a full member of the International Cricket Council in 2017. Although cricket was not a very popular game in Ireland but recent years, it made its position in Ireland after winning the international matches. Here are the top 10 best batsmen of Ireland national cricket team-\n\n10. Alex Richard Cusack\n\nAlex Richard Cusack is a right-handed batsman in the Ireland national cricket team. He made 745 runs at an average of 22.57in One Day International matches. In the 2011 World Cup, Ireland defeated England when Cusack made 47 runs individually, and, with the partnership of Kevin O'Brien, both made 162 runs. Their partnership changed the whole scene of the match. He is in the 10th position in the ODI ranking of ICC in the Ireland cricket team.\n\n9. Andrew Roland White\n\nAndrew Roland white is an all-rounder in Ireland’s national cricket team. He is a right-handed batsman who made 776 runs at an average of 18.04. He appeared in eight World Cup matches out of a total of nine World Cup matches. He is in the 9th position in the ODI ranking of ICC in the Ireland cricket team.\n\n8. John Francis Mooney\n\nJohn Francis Mooney is a good all-rounder of Ireland national cricket team. He is a left-handed batsman who made 963 runs at an average of 23.48, which includes three half-centuries. He was suspended for three matches in 2013 for tweeting inappropriate content on the death of the British prime minister. He is in the 8th position in the ODI ranking of ICC in the Ireland cricket team.\n\n7. Gary Craig Wilson\n\nGary Craig Wilson is the right-handed batsman of the Ireland national cricket team. His nicknames include Gaz and Will. He made 2,072 runs at an average of 23.81, which includes one century and twelve half-centuries in One Day International matches. He is in the 7th position in the ODI ranking of ICC in the Ireland cricket team.\n\n6. Edmund Christopher Joyce\n\nEd Joyce is a left-handed opening batsman and occasional right-arm bowler of medium pace. He made 2,622 runs in One Day International matches at an average of 38, and also made six centuries and fifteen half-centuries. On 24 May 2018, he retired from cricket. He is in the 6th position in the ODI ranking of ICC in the Ireland cricket team.\n\n5. Andrew Balbirnie\n\nAndrew Balbirnie is the current captain of the Ireland national cricket team. He is a right-handed batsman and a good wicket-keeper also. He made 2,376 runs at an average of 32.54 while making seven centuries and 12 half-centuries in One Day International matches. His highest score was 145 in ODI. He is in the 5th position in the ODI ranking of ICC in the Ireland cricket team.\n\n4. Niall John O'Brien\n\nNiall O'Brien is a right-handed batsman of Ireland national cricket team. he made 2581 runs at an average of 28.05, which includes one century and 18 half-centuries in One Day International matches. He is in the 4th position in the ODI ranking of ICC in the Ireland cricket team.\n\n3. Kevin Joseph O'Brien\n\nKevin O'Brien is a rounder in Ireland’s national cricket team. He is a good batsman and occasional wicket-keeper. He made 3,619 runs at an average of 29.42, while half-centuries and 18 half-centuries in One Day International matches. He is in the 3rd position in the ODI ranking of the Ireland cricket team.\n\n2. William Porterfield\n\nWilliam Porterfield is the opening batsman and captain of the Irish cricket team. He made 4,700 runs, which made him Ireland's leading run-scorer to this date. He also scored eight centuries. He is not only good at batting, but he is also good at fielding. He is an outstanding Ireland fielder who has taken 76 catches. He is in the 2nd position in the ODI ranking of the Ireland cricket team.\n\n1. Paul Stirling\n\nPaul Robert Stirling is an outstanding all-rounder as well as a good right-handed opening batsman of Ireland’s national cricket team. He made 4939 runs in One- Day International matches at an average of 38.99 while making 12 centuries and 26 half-centuries, and he made 2,401 runs in T20I at an average of 30.8. He is in the 1st position in the ODI ranking of the Ireland cricket team."}], "John Burnham played 24 innings in 14 first-class matches with an average of 11.50 and a top score of 73.": [{"url": "https://www.espncricinfo.com/player/john-burnham-10173", "page_content": "India\n\nAll\n\nAlphabetically sorted top ten of players who have played the most matches across formats in the last 12 months"}, {"url": "https://www.espncricinfo.com/magazine/content/story/149094.html", "page_content": "Fred \"Demon\" Spofforth finished with 13 wickets in the Melbourne Test © Getty Images\n\n1879\n\nIt was only fitting that Fred Spofforth should take the first hat-trick in Test cricket, against England in Melbourne: he was the greatest bowler of his age, a demon in the eyes of Englishmen everywhere. The second victim in his hat-trick was Francis Alexander MacKinnon, the 35th MacKinnon of MacKinnon, who was facing his first ball in international cricket. A lot of scorers were grateful that this was his only Test.\n\n1992\n\nAn equally great Australian bowler made an inauspicious Test debut. Only one of Shane Warne's 700-plus Test wickets was taken in this game, against India in Sydney, and it cost him 150 runs - Ravi Shastri was his victim, but not before he hit 206. Warne didn't get any at all in the next Test, in Adelaide, but it was understandable: before this series he'd played in only seven first-class matches. Still, he turned out to be quite useful.\n\n1978\n\nBy scoring 182 in the second innings of the third Test against West Indies in Calcutta, Sunil Gavaskar added to his list of records: he became the first batter to hit a century in each innings of a Test match three times. He had made a mere 107 in the first innings.\n\n2013\n\nNew Zealand were bowled out for 45, their third-lowest total, in Cape Town. Their innings lasted less than 20 overs. They had just memorably beaten Sri Lanka away, but hardly had the euphoria evaporated, and the drama over Ross Taylor's sacking as captain receded from the headlines, that they were rolled over for an innings and 27 runs. Doug Bracewell became Dale Steyn's 300th Test victim. New Zealand lost by an innings in the next Test in Port Elizabeth as well.\n\n1984\n\nWhen you make your maiden first-class hundred at the age of 16, as Daryll Cullinan did today, for Border against Natal B in East London, you're expected to go on and become a star. Although he made an unbeaten 275 in Auckland in 1998-99, then a record for South Africa in Tests, his frailty against Shane Warne and his chatty chums held Cullinan's reputation in check. He averaged only 12.75 against Australia, compared to 48 against everybody else.\n\n1985\n\nBob Holland took his best Test figures and Kepler Wessels scored his fourth hundred for Australia in a dead rubber in the final Test at the SCG as they beat West Indies by an innings and 55 runs. However West Indies won the series 3-1. Wessels' 173 took Australia to 471 and then legspinner Holland took 6 for 54 to enforce the follow-on. He took four more in the second to finish with 10 for 144. This was West Indies' first defeat since they lost in Melbourne 27 Tests earlier, in the 1981-82 series, and their first by an innings since 1968-69.\n\n1960\n\nRaman Lamba, who was born today, joined a sad, select club that includes England men Andy Ducat and Wilf Slack when he died at the crease in Dhaka in 1998 after taking a fatal blow to the head while fielding at short leg. A good enough opening batter to play four Tests for India, Lamba was also the man chased all the way to third man by a maniacal, stump-wielding Rashid Patel in an infamous incident in 1990. Lamba was by no means blameless - he had been taunting Patel, and the ensuing fencing match got Lamba a ten-month ban and Patel 14 months. Lamba had an Irish wife, and played for Ireland against Sussex in the NatWest Trophy in 1990.\n\n2003\n\nHerschelle Gibbs (228) and Graeme Smith (151) destroyed Pakistan's demoralised bowling with an opening stand of 368, at the time South Africa's best for any wicket, on the first day of the Newlands Test. Gibbs' double-hundred is the fastest by a South African and he also became the sixth from his country to reach 3000 Test runs during his innings. South Africa went on to win by an innings and 142 runs. It was the start of a productive year for Smith, who was made captain in March and went on to score consecutive double-centuries in England in July.\n\n1970\n\nFew people take a hat-trick in their last international appearance. But the New South Wales seamer Anthony Stuart, who was born today, did. He took 5 for 26 in his third one-day appearance, against Pakistan in Melbourne in 1996-97, including Ijaz Ahmed, Mohammad Wasim and Moin Khan with successive deliveries. He had already dismissed Aamer Sohail and Zahoor Elahi, but he suffered an ankle injury and Australia never picked him again.\n\n1964\n\nOne of the early pillars of Sri Lanka's bowling was born. Rumesh Ratnayake's brisk pace brought him 73 Test wickets from 1982-83 (when he was only 19) to 1991-92, including 5 for 69 at Lord's in 1991 and 20 wickets at 22.95 against India in 1985-86, the first series Sri Lanka ever won. Mind you, he needed to brush up on his image as a demon fast bowler: after breaking John Wright's nose with a bouncer in a Test in Wellington in 1982-83, he fainted at the sight of blood.\n\n1973\n\nA tall and forceful batter, John Benaud couldn't hope to match his brother Richie's profile, but he averaged 44.60 in his three Tests for Australia, largely thanks to the 142 he made today (93 before lunch) against Pakistan in Melbourne - after being told that he wouldn't be playing in the next Test.\n\n1886\n\nDependable South African opening batter Jack \"Billy\" Zulch was born. Both of his Test hundreds were made in Australia in 1910-11 (his only series abroad), but he was probably better known for the way he was dismissed in Johannesburg in 1921-22. The ball, sent down by Australia's pantherine opening bowler Ted McDonald, was so fast it broke his bat, a sliver of the blade hitting the stumps.\n\nOther birthdays\n\n1875 Bill Bradley (England)\n\n1893 Johnny Moyes (Australia)\n\n1907 Laurie Fishlock (England)\n\n1931 Robin Marlar (England)\n\n1953 David Graveney (England)\n\n1959 Kirti Azad (India)\n\n1987 Abdul Rehman (United Arab Emirates)\n\n1971 Aamer Nazir (Pakistan)\n\n\n\n© ESPN Sports Media Ltd."}, {"url": "https://www.icc-cricket.com/news/657430", "page_content": "In the latest episode of our series, we feature an XI of male cricketers who officiated in international cricket, including two men from the very first Test ever played.\n\nCharles Bannerman\n\nIt was 15 March 1877, and Australia and England played what became known as the first Test match ever. Opening the innings for Australia, Bannerman ended the day unbeaten on 126 in his team’s 166/6 and went on to score 165 in Australia’s 245 before retiring hurt. He scored 4 in the second innings as Australia won by 45 runs and went on to play two more Tests. Ten years on after making his Test debut as a player, Bannerman made his Test debut as an umpire and officiated in 12 matches.\n\nMark Benson played just one Test but officiated in 27\n\n\n\nMark Benson\n\nA good player of fast bowling, the left-handed opener was a regular part of the Kent set-up for 15 seasons, scoring 18,387 first-class runs overall in 292 matches at an average of 40.23. He got his Test debut against India in 1986, and made 30 and 21 in many hours of gritty batting. That, however, was his only Test appearance and he played just one ODI, and after retiring in 1995, Benson turned to umpiring, even becoming part of the International Cricket Council’s Elite Panel, and officiated in 27 Tests, 72 ODIs and 19 Twenty20 Internationals.\n\nJohn Hampshire, then president of Yorkshire, poses with the players during the 2016-17 season\n\n\n\nJohn Hampshire\n\nThe Englishman became the first to score a century on Test debut at Lord’s, against the Windies in 1969, but failed to build on that wonderful start despite being an attractive stroke-player who plied his trade with Yorkshire, Tasmania and Leicestershire for many years. Hampshire went on to play eight Test matches, tallying 403 runs, including two half-centuries to go with that only hundred. His domestic numbers underscore his ability: 28,059 runs from 577 matches at an average of 34.55. He retired in 1984 and made his appearance as a Test umpire five years later, and officiated in 21 Tests and 20 one-day internationals.\n\nPeter Willey played 15 of his 26 Tests against the Windies, scoring two centuries in them\n\n\n\nPeter Willey\n\nA right-handed top-order batsman and off-spin bowler, Willey was England’s go-to man whenever the Windies were around, and he ended up playing 15 of his 26 Tests against the feared opponents between 1976 and 1986. He also played 26 ODIs. Willey’s greatest quality was perhaps his grit, which was on show on both occasions when he scored a Test century, both against the Windies. His 559 first-class appearances resulted in 24,361 runs and 756 wickets. In 1996, he officiated in his first Test, and ended up umpiring in 25 Tests and 34 ODIs.\n\nIan Gould, the England 1983 World Cupper, is a popular umpire now\n\n\n\nIan Gould (wk)\n\nGould, a wicket-keeper batsman who played over two decades of first-class and List A cricket, ended up playing no Test cricket and only 18 ODIs, including in the ICC Cricket World Cup 1983. He was part of an Ashes Test though, coming on as a substitute in Melbourne in the 1982-83 series. He was a solid performer, effecting 603 dismissals in first-class cricket and 279 in List-A cricket, to go with 8756 and 4377 runs in the two formats respectively. He turned to coaching after retirement and then umpiring, and has gone on to officiate in 65 Tests, 125 ODIs and 37 T20Is.\n\nAn illustration of the All-England cricket team of 1868 - James Lillywhite is seated second from right\n\n\n\nJames Lillywhite Jnr\n\nComing from a major 19th century cricketing family, with many of his relatives playing first-class cricket, Lillywhite, then 35, was named captain in the first-ever Test match in 1877, but that series was his only brush with Test cricket, as the left-arm spinner and hard-hitting batsman ended with eight wickets and just 16 runs. Playing first-class cricket for 23 years with Sussex, Lillywhite hit 5523 runs and bagged 1210 wickets, and later turned out as umpire in six Test matches, between 1882 and 1899.\n\nAsoka de Silva was a leg-spinner before switching to umpiring\n\n\n\nAsoka de Silva\n\nThe most successful Sri Lankan umpire in terms of appearances in international cricket, de Silva is probably a better-known official than cricketer, even though he played 10 Tests and 28 ODIs between 1985 and 1992. A useful leg-spinner and lower-order batsman, de Silva scored 323 international runs and picked up 25 wickets. He officiated in his first international game – an ODI between Sri Lanka and Pakistan in Galle in 1999 – just two years after his last first-class appearance and was a part of 49 Tests, 122 ODIs – including at the 2003 and 2007 ICC Cricket World Cups – and 11 T20Is, the last of them in June 2012.\n\nKumar Dharmasena won the World Cup with Sri Lanka in 1996\n\n\n\nKumar Dharmasena\n\nOne of the regulars in Sri Lanka’s outstanding ODI team of the mid-1990s, Dharmasena formed a part of the spin pack led by Muttiah Muralitharan, using his quick and accurate off-spinners to good effect in 31 Tests and 141 ODIs between 1993 and 2004. He ended with 69 Test wickets and 138 ODI wickets and was a useful batsman too, getting better with time as he scored 868 Test runs and 1222 ODI runs. He turned to umpiring after retiring from all formats of the game in 2006. So far, he has officiated in 53 Tests and 84 ODIs along with 22 T20Is. He officiated in the opening ICC Cricket World Cup 2011 game and was one of the umpires for the final of the ICC Cricket World Cup 2015. He is also the only cricketer-turned-umpire to win the ICC's David Shepherd Trophy, given to the Umpire of the Year, which he was given in 2012.\n\nPaul Reiffel was a part of the Australia 1999 World Cup-winning team\n\n\n\nPaul Reiffel\n\nThe Australian right-arm pacer was known for hitting awkward lengths and his ability to move the ball off the pitch both ways, making him a difficult bowler to read. He appeared in 127 international matches – 35 Tests and 92 ODIs, picking up 210 wickets overall. His career was affected by a lot of injuries, which led to his retirement in 2002 when he was 36. His last international appearance, interestingly, was in the ICC Cricket World Cup final of 1999, which Australia won. Reiffel returned 1/29 from 10 overs on that occasion. A decent lower-order batsman, Reiffel ended with six half-centuries in Tests and one in ODIs. In 2009, he returned to the international fold as an umpire and has had a successful career, appearing in 36 Tests, 54 ODIs and 16 T20Is since.\n\nRichard Illingworth (second from right) has been one of the most active umpires in recent years\n\n\n\nRichard Illingworth\n\nThe left-arm spinner played first-class cricket for almost 19 years, making 376 appearances. In 1991, he made his Test and ODI debut for England, more for his miserly ways than great wicket-taking abilities. He took a wicket with his first ball in Tests and was a part of the England side that lost to Pakistan in the ICC Cricket World 1992 final, but never became a regular with England because of the presence of Phil Tufnell. Overall, he played nine Tests and 25 ODIs, picking up 49 wickets. He took up umpiring not long after quitting the game in 2002, making his international debut in 2010 and being a part of 32 Tests, 57 ODIs and 16 T20Is since.\n\nSrinivas Venkataraghavan was a member of India's famed spin quartet and led the team in the 1975 and 1979 World Cups\n\n\n\nSrinivas Venkataraghavan (c)\n\nOne of the members of the great Indian spin quartet, the off-spinner was accurate and effective, picking up 156 wickets in 57 Tests, and also making a name for himself for his close-in fielding. He played his first Test in 1965 and the last in 1983, playing a key role in India’s maiden Test series wins in the Caribbean and in England in 1971, picking up 35 wickets in eight Tests. He also captained India at the 1975 and 1979 ICC Cricket World Cups, and after a long gap following his retirement in 1985, officiated in his first game in 1993 after a short stint as an ICC match referee. He went on to officiate in 73 Tests and 52 ODIs, becoming one of the most respected umpires in the game before retiring in 2004."}, {"url": "https://www.espncricinfo.com/cricketers/shai-hope-581379", "page_content": "Shai Hope made his Test debut as a 21-year-old, having played just 14 first-class matches at the time. But few in the Caribbean doubted his talent as a batsman. Clive Lloyd gave him his West Indies cap, and coach Stuart Law insisted that he only needed one innings to get going. The world eventually got to know why the boy from Barbados was rated so highly when he became the first player, in 534 first-class matches, to score a hundred in each innings at Headingley.\n\nHope was 23 at the time, the youngest member of the XI, leading West Indies to victory with scores of 147 and 118 not out. They had been faced with a target of 322 - not since Bradman's Invincibles rocketed to 404 for 3 in 1948 had a team chased that many on Yorkshire's storied turf, and won. Adding to the occasion was the fact West Indies had been dismantled only a week ago, England beating them by an innings and 209 runs to ensure their fans could savour the advent of day-night Test cricket in the country.\n\nHope made his first-class debut in 2012-13, but propelled himself into consideration for the West Indies team after a superb season in 2014-15, when he scored 628 runs in nine matches - he was the fourth-highest run-getter in the tournament. He racked up 538 runs at 67.25 in 2015-16 - the highest average among the top-10 - and secured his maiden first-class double-hundred at his homeground, Kensington Oval, in March 2017\n\nESPNcricinfo staff"}, {"url": "https://www.espncricinfo.com/cricketers/ollie-pope-887207", "page_content": "Ollie Pope's rapid transition from inventive T20 strokemaker to heavy Championship run scorer attracted the attention of England's national selector Ed Smith when Pope was given a Test debut against India as a specialist batsman in the summer of 2018. To bat at No. 4 after only 15 first-class matches against such powerful opposition was a considerable challenge. He played only two Tests, but he had put down a marker, and at season's end he had contributed 986 runs at an average of 70.43 to Surrey's title-winning season, including a sparkling unbeaten 158 against Yorkshire at The Oval, a career-best, as well as some flashes of ambition in limited-overs formats.\n\nIn 2019, he suffered an early setback when fielding in a game against Essex, as he dislocated his shoulder diving to stop a ball. It required surgery, but time out of the game proved to be a positive - \"it gave me time to reflect and think about what I can do to take my batting to the next level,\" he reflected. He shifted his stance, batting on middle-and-off rather than middle, and the change worked immediately, as he hit an unbeaten 221 in his first Championship game back. He was on standby as a concussion substitute throughout the Ashes summer, though remained unused, but his call-up for the winter tour of New Zealand seemed to suggest a chance to make the No. 6 spot his own would be forthcoming.\n\nAnd so it would prove. Despite unexpectedly keeping wicket in the second Test of that series after a late injury to Jos Buttler, Pope impressed with a fluent 75 in partnership with Joe Root, before starring on the tour to South Africa. His unbeaten 61 underpinned England's effort at Cape Town, and in their win at Port Elizabeth he was superb, compiling a maiden hundred and becoming England's young centurion since Alastair Cook in the process. He also proved himself as an electric close fielder, taking several catches under the helmet over the course of the tour.\n\nFallow periods followed, not least a dispiriting 2021/22 Ashes of 67 runs from three Tests which felt like the start of a necessary absence, away from the limelight. However, Ben Stokes' appointment as Test captain at the start of the following summer brought with it an opportunity. Pope took the initiative to call Stokes and ask to bat three, the only position available in the batting line-up. The skipper appreciated the chutzpah and agreed. Pope held up his end of the deal not just with runs (791 in 12 Tests, two centuries among them) but rate of scoring (75.04). Stokes rewarded him with greater responsibility as unofficial vice-captain, which saw Pope take the reins for warm-up matches ahead of the winter's tours of Pakistan and New Zealand.\n\nPope, a part-time wicketkeeper full of batting invention, made great strides for Surrey in 2017 in all three formats. It was his trickery as a Twenty20 batsman that most won most admirers, but there was also a maiden Championship century. That hundred came in only his third Championship appearance, against Hampshire at the Ageas Bowl, and was full of energetic cuts and pulls as he ended Hampshire's hopes of a last-day victory, the innings culminating in slightly hollow circumstances with an over from the part-time bowling of James Vince, the England batsman, as Hampshire gloomily awaited the draw.\n\nHis Championship debut also made him part of a historic moment when Surrey fielded four teenagers against Middlesex at The Oval, the first time that had happened in a Championship match since World War 2.\n\nPope's 50-over debut had come in 2016, in a Royal London Cup semi-final victory against Yorkshire at Headingley in 2016; he did not take the gloves - he was one of five wicketkeepers in the Surrey side with a sixth, the coach Alec Stewart, looking on, but immediately revealed his busy batting style. Unfortunately for him, the highest-profile moment of his 2017 summer was his drop of Alex Hales - on 9 - in the 50-over final; Hales went on to make a record-breaking 187 not out.\n\nESPNcricinfo staff"}, {"url": "https://deadline.com/2022/04/john-burnham-leaves-icm-partners-atlas-artists-manager-1234999879/", "page_content": "EXCLUSIVE: John Burnham, a cornerstone talent and literary agent who has spent more than 25 years at ICM Partners, is leaving to become a manager and partner at Atlas Artists and Atlas Literary, the Atlas Entertainment subsidiary. The exit is amicable, and Burnham will bring with him a client list of renowned writers, filmmakers and actors he now will represent as a manager.\n\nThe long list of clients that will follow him includes Oscar, Emmy and Pulitzer winners. The roster includes Brandon Cronenberg, John Cusack, Stephen Dorff, Diane English, Kleber Mendonca Filho, Stephen Frears, Walter Hill, Felicity Huffman, Adrian Lyne, Sophia Macy, William H. Macy, Clara Mamet, David Mamet, Joe Mantegna, Nicholas Martin, Elaine May, Malcolm Mays, Takashi Miike, Pat McKinley, Keith McNally, David Milch, Rob Reiner, Emma Tammi, Caroline Thompson, David Twohy, Wayne Wang, Peter Weir, Alice Winn, John Woo and Terry Zwigoff. Others will follow as his exit gets sorted.\n\nBurnham becomes the latest rep switching from agenting to management in the ever-shifting rep space and as CAA moves toward acquiring ICM Partners, which Deadline revealed last fall.\n\n“We are very excited to welcome John to Atlas,” Atlas Artist president Dave Fleming and Atlas Literary president Alex Hertzberg said in confirming the move to Deadline. “John has long been regarded as one of the best representatives of talent and creators in town. With his impeccable roster of clients and relationships at the highest level, John is a perfect fit for our thriving team of managers and executives across the Atlas family.”\n\nSaid ICM Partners managing director Ted Chervin: “We thank John for the enormous contributions he’s made to the success of ICM Partners and for the distinguished career he’s had with ICM before that which goes back over 25 years. We wish him the greatest success with Atlas and look forward to continuing to work very closely with him.”\n\nBurnham first joined ICM after stints with manager Alan Carr and then the Paul Kohner Agency, where he rose from assistant to get his agent stripes. At ICM, he started in the Television Literary Department and then the Motion Picture Department, working for Sue Mengers and Jeff Berg.\n\nHe then joined the William Morris Agency and spent 16 years there, becoming Co-Head of the Motion Picture Department and serving on the agency’s board of directors. Burnham returned to ICM in 2001 as Head of Motion Pictures. He served on ICM’s Board of Directors in its prior configuration before becoming a partner."}, {"url": "https://www.perfectgame.org/Players/Playerprofile.aspx?ID=952907", "page_content": "× MAX ACCELERATION\n\nWHAT IS IT?\n\nThe maximum acceleration the bat experiences during the swing, measured in “g’s”. To be clear, acceleration is not how fast the bat is moving; that’s barrel speed. Acceleration determines how quickly you can reach that top speed.\n\n\n\nON-FIELD IMPACT\n\nMore acceleration means that you can reach your max barrel speed quicker. Higher acceleration lets you wait a little longer before you decide to swing, and in some cases means that you can maintain higher bat speed for more of the swing."}, {"url": "https://www.espncricinfo.com/cricketers/marcus-stoinis-325012", "page_content": "A powerful, versatile batter and medium-pace bowler, Marcus Stoinis has become a mainstay in Australia's limited-overs sides as well as a dominant player in the BBL and a sought-after player in the IPL.\n\nHe debuted for his home state of Western Australia at the age of 19, but won limited opportunities with the Warriors and moved to Victoria to further his career. Eventually persuaded by his piles of runs for Northcote, the Victorian selectors gave him a run of games in the Sheffield Shield side during 2013-14 and Stoinis rewarded them with an outstanding 170 against Tasmania, a breakthrough innings that led to him becoming a regular in the top order. Stoinis was Victoria's leading run-scorer in the 2014-15 Sheffield Shield season and was called into Australia's squad for their limited-overs matches against England in 2015, where he debuted, playing an ODI and a T20I.\n\nHe did not do enough to secure a permanent place in the national squad then, but continued to impress in first-class cricket and scored a century for Australia A against South Africa A in 2016. He was selected for his second ODI in January 2017 and what an ODI comeback it was: after claiming three wickets, Stoinis scored 146 not out from No. 7 to help Australia almost pull off an unlikely victory against New Zealand at Eden Park. That innings gave Stoinis a permanent place in the ODI and T20I teams where he has since batted in a multitude of spots in the middle order and bowled in a variety of roles including the death overs. He was Australia's ODI cricketer of the year in 2018-19. He had a disappointing 2019 World Cup due to a side injury. Since then he has established himself as a senior member of the T20I and ODI teams and has performed well in the IPL as a finisher despite being a dominant opener in the BBL. He used that IPL experience to help guide Australia to victory in the 2021 T20 World Cup with a vital innings in the semi-final against Pakistan.\n\nHis first-class cricket stalled in the same period with a long dip in form, in part due to a lack of continuity. He also had to move from Victoria back to Western Australia for family reasons. Talked about as a potential Test match allrounder, despite a middling first-class record, he was called into an extended Test squad for the second Test against Sri Lanka in February 2019.\n\nESPNcricinfo staff"}]}