{"John Burnham was a right-arm roundarm fast bowler.": [{"url": "https://www.espncricinfo.com/story/cricket-s-turning-points-overarm-bowling-437965", "page_content": "How the bowling arm made its way from below the waist to the shoulder to high over the head\n\n1864\n\n\n\nThe earliest bowling was underarm, although that wasn't always quite as genteel as it might sound. The early cricket historian John Nyren wrote of David Harris, who propelled fast underarms from somewhere near his armpit for Hambledon in the 1780s: \"How it was that the balls achieved the velocity they did by this mode of delivery, I never could comprehend.\"\n\nThe next step, around 1800, was to roundarm bowling. By legend this was started by a woman, Christina Willes, whose voluminous skirts meant she couldn't lob the ball underarm. It's a nice story, but is generally thought to be fanciful these days. What is true is that Christina's brother, John, was no-balled for roundarm bowling in a match at Lord's in 1822: in high dudgeon he jumped on his horse and galloped off, vowing never to play cricket again.\n\nBy the 1860s, roundarm bowling was the norm, but the bowlers were trying to sneak the hand above the shoulder, as what we would recognise today as bowling developed.\n\nIn 1862, Edgar Willsher, playing for England against Surrey at The Oval, was no-balled for overarm bowling. Like Willes before him, Willsher left the field, although he doesn't seem to have had a horse handy to ride off into the south London sunset. The match resumed the next day with a new umpire, and overarm bowling took hold as bowlers began to understand the possibilities."}, {"url": "https://www.wikiwand.com/en/John_Frederick_(English_cricketer)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about John Frederick (English cricketer)?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.cricketcountry.com/articles/john-willes-called-for-round-arm-bowling-leaves-lords-on-horseback-495794", "page_content": "Updated: September 2, 2016 3:23 PM IST | Edited By: Abhishek Mukherjee\n\nMemorial of John Willes in Sutton Valence Churchyard. Willes was the hero (or villain, depending on your point of view) of the incident. Photo courtesy: findgrave.com.\n\nThe laws of cricket were already in place, but under-arm bowling was the prevalent form. The likes of Lumpy Stevens, the first great bowler in history, had ensured that underarm bowling was an art worth pursuing. Round-arm bowling was banned in 1816. Then, on July 15, 1822, John Willes of Kent had a go at round-arm bowling at Lord s, no less, and was no-balled. A fuming Willes left the ground immediately. Abhishek Mukherjee looks back.\n\nBefore I start describing the dramatic proceedings of that day at Lord s, let me first narrate a few relevant aspects of bowling. Bowlers almost invariably bowled under-arm till the end of the 18th century.\n\nThere were reasons for this. Cricket grounds were very few in number, and almost invariably ill-maintained. Sheep were used to clear the grass to make pitches, and scythes were used as mowers. As a result pitches were invariably uneven and bumpy, which often made batting dangerous.\n\nIn other words, over-arm bowling was not required.\n\nIt must also be taken into consideration that cricket of the era were dominated by amateurs, almost all of whom were batsmen. They obviously did not want batting to become difficult.\n\nWalker of Hambledon\n\nBut as has always been the case, cricket found a way to evolve. Tom Walker was a stonewaller for Hambledon with a near-impregnable defence. So reluctant was he to get out that at times he refused to score.\n\nAccording to David Frith, Walker once played 170 balls from David Harris for a solitary run. Walker also scored 95* and 102 for White Conduit Club against Kent in 1786, thus missing out on becoming the first player to score two hundreds in a First-Class match.\n\nDespite his batting feats, history of cricket remembers Walker as the man who probably invented round-arm bowling. At some point of time between 1770 and 1790 he tried bowling with his bowling arm at an angle with his torso.\n\n[read-also]278621,128656,292576,495539[/read-also]\n\nHe realised that the angle and height allowed him to generate more bounce from the already atrocious pitches. From 197 recorded matches Walker claimed at least 337 wickets (along with 6,399 runs); one must remember that he was also an occasional wicketkeeper.\n\nThings were not easy for Walker, for cricket has seldom been prompt in accepting changes. He was no-balled several times and had to revert to lobs.\n\nJohn Nyren wrote in The Hambledon Men: About a couple of years after Walker had been with us [Hambledon], he began the system of throwing instead of bowling, now so much the fashion. At that time it was esteemed foul play, and so it was decided by a council of the Hambledon Club which was called for the purpose.\n\nHowever fascinating Walker s career might have been, this story is not about him, though it involves his wonderful creation.\n\nRound-arm bowling gained popularity in the early 19th century. Let me take a moment here to elaborate on the difference between round-arm and over-arm bowling.\n\nIn round-arm bowling you could not raise your arm above your shoulder. If you have problems visualising that, think of Lasith Malinga. The right arm of Slinga does rise above his shoulder, but only marginally so. You get the basic idea, I presume.\n\nOver-arm bowling, of course, is what we get to see today.\n\nWilles of Kent\n\nThe story begins with Christina Willes. Whether she was a competent cricketer is shrouded in mystery. What we do know is the fact that she was an enthusiastic cricketer, a chunk of her sporting pursuits involving playing with her brother John.\n\nJohn Willes was no ordinary cricketer. He could extract pace even when he bowled under-arm. Not a lot of his cricket career is documented, but he was good enough to make it to the first two Gentlemen vs Players encounters.\n\nPlaying alongside him were several champions of the era like Lord Frederick Beauclerk, Silver Billy Beldham, and Nyren, while the opposition included John Small and our old friend Tom Walker.\n\nWilles took at least 3 wickets from the 2 matches (one must remember that the bowler s name was recorded only if the dismissal was bowled or LBW). He bowled both Beldham and Small in the second of these matches.\n\nLet us get back to Christina. Skirts with massive girth, supported by hoop skirts, were the fashion of the late Georgian era. Christina was no exception to contemporary attire. Obviously, hoop skirts made under-arm bowling rather difficult.\n\nSo Christina came up with a solution. Let us quote AG Steel (some may find the excerpt sexist): Now everyone who has seen ladies attempting to throw a stone or cricket ball will remember that they invariably have a half-round, half-under sort of delivery, and this Miss Willes, in common with the majority of ladies, seems to have possessed. Her brother, accustomed to play against what in those days was the only known style of bowling, viz. under-arm, was somewhat perplexed and worried with this unknown feminine species of ball, which doubtless he found difficult to tackle. How amusing it would have been to have watched this keen cricketer, probably not unconscious of his own merits as a batsman, entirely puzzled by the deliveries of a lady!\n\nDid Christina know she was bowling round-arm? Did John realise what he was playing round-arm? One can only guess.\n\nNote: Though several contemporary writers agree with the story, John Major mentions in More Than a Game that hoop skirts went out of fashion during the era.\n\nAs was expected, John became a practitioner of round-arm bowling. He soon understood its benefits.\n\nWhile Willes was revolutionising bowling, not everyone in England welcomed the idea. Nyren wrote: The first I recollect seeing revive the custom [of round-arm bowling] was Wills [sic], a Sussex man. I am decidedly of opinion, that if it be not stopped altogether, the character of the game will become changed. I should hope that such powerful and efficient members of the Mary-le-bone Club as Mr. Ward, &c., will determine, not only to discountenance, but wholly and finally to suppress it ; and instead, to foster and give every encouragement to genuine, bona fide bowlers men with a fine delivery.\n\nNote: Interestingly, later in the book Nyren refers to Willes as a Kent man .\n\nHowever, Nyren, Beldham, and John Pycroft were all in agreement that Walker was the inventor of round-arm bowling, while Willes was his first prominent successor.\n\nHe was no-balled on several occasions, but Willes was not one to back down. An All-England XIII took on a Kent XXIII at Penenden Heath in July 1807 with 1,000 at stake. Pycroft wrote in The Cricket Field: The straight-arm bowling, introduced by John Willes, Esq., was generally practised in the game, and proved an obstacle against getting runs, in comparison to what might have been got by the straightforward bowling. This bowling met with great opposition. Mr. Willes and his bowling were frequently barred in making a match; and he played sometimes amidst much uproar and confusion. Still he would persevere till the ring closed in on the players, the stumps were lawlessly pulled up, and all came to a standstill.\n\nThe rising popularity of round-arm bowling was not good news for cricket (at least according to the men who mattered). They added a new law in 1816: The ball must be bowled (not thrown or jerked), and be delivered underhand, with the hand below the elbow. But if the ball be jerked, or the arm extended from the body horizontally, and any part of the hand be uppermost, or the hand horizontally extended when the ball is delivered, the Umpires shall call, No Ball .\n\nThat ruled out round-arm bowling. However, it was not easy to subdue Willes.\n\nThat day at Lord s\n\nA formidable Kent side took on MCC at Lord s that July day. MCC won the toss (though there is little supporting document, Beauclerk was possibly leading them) and opted to bat. Richard Lane and Francis Nicholas walked out to bat.\n\nIt is not clear when Willes was summoned to bowl. When his turn came, he bowled round-arm, and was no-balled promptly.\n\nBut there was a problem. Not only was Willes a fast bowler, he also possessed the temperament of one. He was not going to have an umpire calling him for what he thought was right in front of a packed crowd.\n\nWilles had had enough. He marched out of the ground in high dudgeon . More drama unfolded as he mounted his horse parked outside Lord s and left the ground for good, vowing never to return to cricket.\n\nOne can only wonder what went through the spectators minds.\n\nKent were allowed to rope in Thomas Battersbee, a full substitute for Willes, but he was hardly needed. After bowling out MCC for 207, Kent secured a 52-run lead thanks to James Jordan s 86. Batting at No. 11 Battersbee scored 13.\n\nIt turned out to be a no-contest as MCC folded the next morning for 48.\n\nAftermath\n\nWilles had ignited a spark. Perhaps his dramatic exit had to do with it, but one Mr Knight (as per Pycroft) of Alton became the next known practitioner in approximately 1825. Curiously, just like Willes, Knight picked up the art while practising with two ladies .\n\nPycroft s Mr Knight of Alton was George Thomas Knight, the second of four brothers to play First-Class cricket (the others, in chronological order, were Edward, Henry, and Brook).\n\nTrivia (probably irrelevant): George was a favourite nephew of one of his aunts. This aunt, one of the finest exponents of English literature, went by the name of Jane Austen. In fact, George was named George Thomas Austen at birth.\n\nGeorge took Willes case, taking steps to promote round-arm bowling. George was not the greatest of cricketers, but he had three excellent aspects that made him a significant part of cricket history: he was a round-arm bowler himself; he held an influential position (a prominent post in MCC); and he never gave up on his cause.\n\nWilles organised three trial matches between MCC and Sussex in 1827 under the conditions that round-arm bowling will be considered legal in these matches. Sussex included Frederick Lillywhite and Jem Broadbridge, the finest exponents of round-arm bowling of the era, in the Sussex side.\n\nSussex won the first two matches. Nine MCC cricketers signed a declaration after the match: We, the undersigned, do agree that we will not play the third match between All England and Sussex, which is intended to be played at Brighton in July or August unless the Sussex bowlers bowl fair this is, abstain from throwing. Signed by T. Marsden, W. Ashby, W. Mathews, W. Searle, J. Saunders, T. C. Howard, W. Caldecourt, F. Pilch and T. Beagley.\n\nThankfully, the letter was withdrawn, probably because Knight declared that the England bowlers would now have a go at round-arm bowling as well.\n\nWhen Lillywhite and Broadbridge blew them away for 27, everyone predicted another England defeat, but the round-arm bowling of Knight helped restrict Sussex to a 50-run lead. England scored 169 in the second innings before Knight s round-arm skills proved instrumental in securing a thrilling 24-run victory.\n\nThe effectiveness of round-arm bowling was established. On May 19, 1828 the law was amended despite some resistance: The ball shall be bowled; if it be thrown or jerked, or if any part of the hand or arm be above the shoulder at the time of delivery, the umpire shall call No Ball .\n\nIn 1835 round-arm bowling was legalised. In the meantime, during the years of semi-ambiguity, round-arm bowling was practised while most umpires did not bother to call no-balls.\n\nIn 1864, over-arm bowling was finally legalised. Most cricket historians consider the year as the beginning of the modern cricket era .\n\nWhat happened to Willes?\n\nWilles never played competitive cricket again, but he mentored Alfred Mynn, The Lion of Kent . He was also an amateur boxer, was widely acknowledged as the best shot in Kent, and was generally proficient in all sports.\n\nWilles passed away in 1852, seventeen years after round-arm bowling was legalised.\n\nBrief scores:\n\nMCC 207 (Richard Lane 66, Edward Budd 40; John Barnard 3c 1st) and 48 lost to Kent 259 (James Jordan 86; John Sparks 3+ wickets) by an innings and 3 runs."}, {"url": "https://www.wikiwand.com/en/Henry_Wall_(cricketer)", "page_content": "Henry Wall (20 April 1852 – 13 October 1914) was an English cricketer. Born at Wigan, Lancashire, he was a right-handed batsman and right-arm roundarm fast bowler who made three appearances in first-class cricket.\n\nEnglish cricketer\n\nQuick facts: Personal information, Full name, Born, D... ▼\n\nThe son of Thomas Wall, the founder of the Wigan Observer,[1] Wall played the majority of his club cricket for Wigan (but did briefly play for Sefton Park in 1881),[2] with Wall making his first-class cricket debut for Lancashire in 1877 against Sussex at Old Trafford.[3] He made two further first-class appearances in 1877 for Lancashire, against Sussex at Hove and Kent at Maidstone.[3] He scored a total of 24 runs in his three matches, with a high score of 15.[4]\n\nLocal parish records indicate that he was by profession a mining engineer.[5] He died at Southport, Lancashire on 13 October 1914. His brothers, William and Thomas, both played first-class cricket."}, {"url": "https://www.espncricinfo.com/story/left-arm-fast-bowlers-614953", "page_content": "From Brendan Layton, Australia They are the mythical bunch that is a diamond dozen, but those who have made it to the top have shone as some of the finest bowlers of the game\n\n\n\n\n\n\n\nFrom Brendan Layton, Australia\n\nThey are the mythical bunch that is a diamond dozen, but those who have made it to the top have shone as some of the finest bowlers of the game. Mitchell Johnson has blown his way to the top of Australia's bowling attack following a humble start, and Zaheer Khan has emerged from a long and difficult apprenticeship to be India's top bowler. But the main reason they cause excitement is that they are left-arm quicks, and can do things a right-arm bowler would dream about.\n\nThe history of left-arm quicks traces all the way back to the very first Test, where England fielded Tom Emmett, a bluff Yorkshire professional who could bowl very fast on his day. Australia's attack, missing Fred Spofforth, opened the bowling with John Hodges, a Victorian bookmaker who played the first two Tests and never played Test cricket again. On the return match in England, Fred Spofforth was supported by Frank Allen, once hailed 'the bowler of the century', and a man who was allegedly a gargantuan swinger of the ball. He took 4/80 in the match as Spofforth annihilated England.\n\nEngland would tend to rely on left arm orthodox bowlers in its early history, but they did produce an all-rounder who could be dangerous on his day in the form of George Hirst, who achieved more with the bat than the ball in his few Test appearances. More successful was Jack Ferris, who teamed up with Charlie Turner to form one of the most lethal partnerships in Test cricket history. Ferris' career was blighted by the weakness of the Australian batting at the time, and eventually left to play in England as a professional.\n\nWhen South Africa initially came into the Test arena, they struggled to match the strong Australian and English teams, but they did have Arthur 'Dave' Nourse, a left-arm swing bowler who was the 'Grand Old Man of South African Cricket'. In the late 1920's, England unearthed a young lad from Nottinghamshire who would make his mark a few years later as the accomplice of one Harold Larwood. Bill Voce, although yards slower than his older partner, was a key figure in Bodyline where he would set the leg trap and use his awkward angle and great height to create havoc and a long run of bruises. He would have sporadic success in his career, and his last tour with Wally Hammond's team in 1946/47 to Australia when he was long past his peak was a disaster.\n\nAfter World War II Australia unearthed a candidate for one of the all-time left-armers in Bill Johnston, a droll Victorian who had been a spin bowler before he turned to swing. He took 16 wickets against India in his debut Test series and then in the next five took at least 20 wickets. Not bad, especially when you consider that he was competing with Ray Lindwall and Keith Miller for the new ball.\n\nFrank Worrell, a much-underrated bowler due to his batting talent, was often called upon to open the bowling for the West Indies as the struggled to find the next Learie Constantine. He took a best of 7/70, but a younger all-rounder from Barbados would supersede him as an all-rounder and player. Garry Sobers, arguably the greatest all-rounder of them all, took 235 wickets bowling swing, genuinely fast, or any type of spin he felt like.\n\nWhen Australia toured South Africa in 1957/58, a lot of their hopes were pinned on Alan Davidson, who was finally being given the new ball after having to wait behind the impenetrable Lindwall/Miller/Johnston combination. He was acknowledged as a master bowler, but had played 12 Tests and had taken an unremarkable 16 wickets at 34.06. In the next 32 Tests he took 170 wickets at under 20 to reduce that average to 20.53. Doing that he established himself as the finest left-arm quick of that time, and he is only challenged as the greatest of them all by one man.\n\nSouth Africa had developed Trevor Goddard as a useful all-rounder who at times opened the batting and the bowling for his country. When the arrival of some genuinely fast men gave him better support, the ferocious South African team of the 60's was born. The generation gap between the next gifted lefties was bridged by Richard Collinge, a gigantic but gentle swing bowler whose best was overshadowed by Richard Hadlee, but always gave his best for New Zealand.\n\nLefties struggled to make an impact in the 70's. Bernard Julien was spoken of as another Sobers but failed to have an impact. John Lever played 21 tests as a classy swing bowler, but had to shake rumours he used slave or something similar to get swing. Australia produced two with vastly different careers. Gary Gilmour was a spectacular swing bowler and hard hitting batsman who produced his best in the one day game. He struggled later in his career as the increasing professionalism left players of his ilk in the cold. Geoff Dymock, a maths teacher who struggled with remote postings for many years, was a determined, hard-working bowler who improved to such a state in his early 30's that he was considered good enough to partner Dennis Lillee during the Post-WSC reunion. He was the first person to dismiss all 11 batsmen in a team at Green Park in India in a match his batsmen still managed to lose.\n\nIn the 80's there was little to be seen of the left-arm quick, and it was thought they had gone out of fashion as quick as the Malcolm Marshall bouncer. Then suddenly out of Pakistan came a young man with a whippy action that could bowl fast and swing the ball both ways alarmingly late. Wasim Akram took 5/56 in his second Test and showed signs of greatness. At the turn of the decade, he was acknowledged the finest fast bowler in the world, even better than Windies beanpoles Curtley Ambrose and Courtney Walsh. Australian captain Mark Taylor, a man who managed a century against Akram hailed him as the most difficult bowler he had ever faced, and much better than any West Indian of the time. His record is formidable: 414 wickets at 23.62. He suffered during his career from a myriad of scandals, and late in his career he lost a lot of the zip that made him the most feared bowler in the world. That said, in my opinion Wasim Akram is the greatest leftie of them all.\n\nAustralia managed to produce a tall, gangling WA quick that could make the ball swing and lift from a good length. Bruce Reid suffered from back problems his entire career, but managed 113 wickets at 24.63, he was no mug when he got it right. Sri Lanka, after initial struggles, unearthed an invulnerable warrior who to this day carries their pace attack. Chaminda Vaas was never lightning fast, but he learned progressively as he went. He forsook pace to become a crafty swing and seam bowler, capable of blowing away teams on helpful pitches and containing batsmen with his accuracy.\n\nNathan Bracken had been earmarked as the next Bruce Reid when he came through the ranks, but it took a long time to make his mark. And now at 31, and having not played a Test since 2005, a classy swing bowler seems to have cruelly been cast as a limited overs bowler, despite being widely admitted as one of the finest swing bowlers in the world."}, {"url": "https://peoplepill.com/people/john-frederick/", "page_content": "John St John Frederick (6 January 1846 – 10 September 1907) was an English first-class cricketer who played as a right-handed batsman and a right-arm roundarm fast bowler.\n\nLife and career\n\nFrederick was a son of Edward Frederick, a British Army officer. He was educated at Eton, where he played for the school in the Eton and Harrow match in 1861, and Christ Church, Oxford. He made his first-class debut for Oxford University in 1864 against the Marylebone Cricket Club. In the 1864 season, he represented Oxford University in five first-class matches, and he was awarded his blue by appearing in the match against Cambridge University, which Oxford won by four wickets; his contribution, however, was just a single run in his two innings.\n\nFrederick also made his debut for Hampshire against Middlesex in the same season. In the return match against Middlesex, he claimed all of his four first-class wickets in Middlesex's first innings with figures of 4/45.\n\nLater in the season Frederick also made his debut for Middlesex, representing the county in a single first-class match against the Marylebone Cricket Club. He made yet another first-class debut in the 1864 season, this time for the Gentlemen of Marylebone Cricket Club against the Gentlemen of Kent.\n\nIn 1866 Frederick played for the Marylebone Cricket Club against Surrey. He represented the Marylebone Cricket Club in one further first-class match during that season against the Gentlemen of Kent. In addition, he represented Oxford University in a single first-class match against Southgate and played for Hampshire in a single first-class match against Surrey.\n\nIn the 1867 season, Frederick represented Oxford University in four first-class matches, the last of which came against Surrey. In his ten first-class matches for the University, he scored 188 runs at a batting average of 11.05, with a high score of 39.\n\nIn 1868, Frederick played for the Gentlemen of Marylebone Cricket Club against Kent. In 1869 he played for Hampshire against the MCC and his final career first-class match was for the MCC against Kent.\n\nFrederick had a military career. In 1876, he is recorded as a lieutenant in the Inniskilling Dragoons and was appointed as aide-de-camp to the commanding officer of the Cavalry Brigade at Aldershot. In reports of MCC meetings in The Times in the 1890s, Frederick, who was on the committee, is identified as \"Captain J. St J. Frederick\".\n\nFrederick died at Camberley, Surrey on 10 September 1907 after what was described as \"a long illness\". The death notice records that he was a member of the Junior Carlton Club.\n\nFamily\n\nFrederick's nephew Edward Frederick also represented Hampshire in first-class cricket, as well as the Europeans (India)."}, {"url": "https://prabook.com/web/alfred.brown/2567145", "page_content": "Alfred Brown Edit Profile\n\ncricketer\n\nAlfred Brown was an English first-class cricketer from Malton, North Yorkshire, England, who played two games for Yorkshire in 1872, in the home and away fixtures against Surrey."}, {"url": "https://www.mid-day.com/sports/cricket/photo/have-you-seen-the-11-weirdest-bowling-styles-in-ipl-10169", "page_content": "Share:\n\n\n\n\n\nA collage of IPL bowlers\n\nShare:\n\n\n\n\n\nSunil Narine developed the reputation of being a 'mystery bowler' due to the variations he had to his off-breaks, and how he disguised them. He also gripped the ball differently from other more conventional spinners. But he was reported for illegal bowling action and has now remodelled his action. With the straighter arm action, the Kolkata Knight Riders veteran is not getting his old zip and turn which off the pitch as he used to earlier. However, he is one of the most effective and experience bowlers in IPL.\n\nShare:\n\n\n\n\n\nMumbai Indians star pacer Jasprit Bumrah has a very unusual bowling action. He delivers from wide of the crease. Bumrah also has a rare hyper-extension shoulder like former Pakistan fast bowler Shoaib Akthar. He uses this to his advantage and combined with his unorthodox whippy delivery action, inward tilted high-arm action and rapid bowling-arm speed, he falls into the category of bowlers with unique actions and is difficult to read.\n\nShare:\n\n\n\n\n\nFormer Mumbai Indians pacer Lasith Malinga is known as Slinger Malinga because of his unique sling action. He releases the ball in front of the umpire's chest. Malinga is an authentic roundarm. There are some who question the legality of his action, but it is legal because his arm does not straighten from a bent position as he bowls.\n\nShare:\n\n\n\n\n\nFormer Punjab leg-spinner KC Cariappa started out as a fast-bowling all-rounder before he switched to spin. He bowls with an orthodox round-arm action and his leg break is his regular delivery. He has variations like the googly and the faster ball. He also bowls off-spinners without changing the grip. Cariappa, whose stock delivery includes a carrom ball and a back of the hand googly, started playing with a tennis ball and picked up the leather ball only when he was 17. Cariappa played for the Bijapur Bulls in the Karnataka Premier League in 2014. Cariappa is currently part of the Rajasthan Royals team for IPL 2022.\n\nShare:\n\n\n\n\n\nFormer RCB and Punjab Kings leg-spinner Murugan Ashwin bowls an impressively disguised googly. Ashwin bowls with a very straight arm like Anil Kumble. The Chennai born cricketer was a net bowler with Chennai Super Kings (CSK) IN 2017 before he was picked by IPL franchise Rising Pune Supergiant. He also went on to play for Delhi Daredevils (now Delhi Capitals) and Royal Challengers Bangalore.\n\nShare:\n\n\n\n\n\nThe Rajasthan Royals found Kamran Khan in 2008 - the tennis-ball cricketer with no first-class experience. He later played for Pune Warriors India. Kamran was also pulled up for chucking by a Maharashtra Cricket Association umpire during a league match in 2010. He was called Tornado by legendary spinner, the late Shane Warne.\n\nShare:\n\n\n\n\n\nPakistan pacer Sohail Tanvir gained fame for his unorthodox bowling action. The left-arm pacer turned out for Rajasthan Royals in 2008. Delivering off the wrong foot with his rapid-arm motion made him a difficult bowler to get away and he got a lot of success in the Twenty20 format of the game. Playing in his third match of the tournament, on May 4, Tanvir took a match-winning six wickets against the Chennai Super Kings at the Sawai Mansingh Stadium in Jaipur. His figures of 6/14 from four overs were a record in IPL for over a decade. He ended the tournament as the highest wicket-taker, with 22 wickets from 11 matches at an average of 12.09, an economy rate of 6.46 and a strike rate of 11.20, the best among bowlers with more than six wickets.\n\nShare:\n\n\n\n\n\nFormer IPL team Gujarat Lions' left-arm spinner, Shivil Kaushik has a mysterious bowling action quite similar to the one made famous by former South Africa spinner Paul Adams. Kaushik is chinaman bowler but his action is reminiscent of frog-in-the-blender Adams which means he ends up looking towards cover while delivering the ball, instead of looking at the batsman. He has represented the Hubli Tigers in the Karnataka Premier League.\n\nShare:\n\n\n\n\n\nSunrisers Hyderabad bowling coach and ex RCB spin king Muttiah Muralitharan's unique bowling action starts with an open-chested short run-up and ends results with an extremely wristy release. His exaggerated facial expressions during bowling also added an important dimension. Unarguably one of the best spinners in history, he tended to flick the wrist in the outward direction and release the ball. Muralitharan played for CSK, RCB and Kochi Tuskers Kerala.\n\nShare:\n\n\n\n\n\nAjantha Mendis, a mysterious finger spinner, is another unorthodox bowler from Sri Lanka. The former cricketer was part of Kolkata Knight Riders and defunct Pune Warriors India squads in IPL before. He is neither a wrist spinner nor a traditional off-break bowler but can bowl all the different variations using just the tip of his fingers to impart spin. He also admitted to having five different deliveries. He is famous for his carrom ball, released with a flick of his middle finger."}, {"url": "https://peoplepill.com/people/enoch-tranter/", "page_content": "Enoch Tranter (27 April 1842 – 23 September 1910) was an English cricketer active in the mid-1870s. Born at Old Park, Shropshire, Tranter was a left-handed batsman and left-arm roundarm fast bowler who made three appearances in first-class cricket.\n\nDuring the 1870s Tranter played his club cricket for Sefton Park in Liverpool, and was selected to play for Lancashire in 1875, making his debut in first-class cricket against Derbyshire at Old Trafford. He made two further first-class appearances for Lancashire, one in 1875 against the Marylebone Cricket Club at Lord's, and against Kent at Rochdale in 1876. Tranter took 3 wickets with his roundarm bowling, with best figures of 2/11. When fielding he would often field at slip.\n\nHis occupation outside of cricket was as a coal miner. He died at Donnington Wood, Shropshire on 23 September 1910."}, {"url": "https://alchetron.com/Henry-Wall-(cricketer)", "page_content": "Henry Wall (20 April 1852 – 13 October 1914) was an English cricketer. Born at Wigan, Lancashire, he was a right-handed batsman and right-arm roundarm fast bowler who made three appearances in first-class cricket.\n\nThe son of Thomas Wall, the founder of the Wigan Observer, Wall played the majority of his club cricket for Wigan (but did briefly play for Sefton Park in 1881), with Wall making his first-class cricket debut for Lancashire in 1877 against Sussex at Old Trafford. He made two further first-class appearances in 1877 for Lancashire, against Sussex at Hove and Kent at Maidstone. He scored a total of 24 runs in his three matches, with a high score of 15.\n\nLocal parish records indicate that he was by profession a mining engineer. He died at Southport, Lancashire on 13 October 1914. His brothers, William and Thomas, both played first-class cricket."}], "John Burnham took 4 wickets at an average of 28.50 and a best performance of 2 for 11.": [{"url": "https://www.skysports.com/cricket/news/12123/12437376/irelands-curtis-campher-makes-t20-world-cup-history-with-four-wickets-in-four-balls-against-netherlands", "page_content": "Ireland’s Curtis Campher became the first bowler to take four wickets in four balls in a T20 World Cup match with a devastating spell in their win over Netherlands in Abu Dhabi.\n\nThe 22-year-old seamer reduced the Dutch from 51-2 to 51-6, having Colin Ackermann caught down the leg side before Ryan ten Doeschate and then Scott Edwards departed to lbw decisions.\n\nThe on-field umpire originally gave Edwards not out, but Ireland successfully overturned it on review - and Roelof van der Merwe then dragged his first delivery onto the stumps to give Campher his fourth wicket in as many balls.\n\nCampher said: \"My heart was racing quite high but I just took a few deep breaths at the top of my run and made sure that I just managed my skills.\"\n\nTwitter Due to your consent preferences, you’re not able to view this. Open Privacy Options\n\nOnly two other players have achieved that feat in T20 internationals - Afghanistan's Rashid Khan, who did it against Ireland in 2019 and Lasith Malinga of Sri Lanka, who followed suit against New Zealand later that year.\n\nThe only previous hat-trick in the T20 World Cup was recorded by Australia's Brett Lee, who took three Bangladesh wickets in consecutive balls at the first edition of the tournament in 2007.\n\nCampher finished with figures of 4-26 to help restrict the Netherlands to 106 all out in their 20 overs, before Ireland passed that total with 29 balls to spare in a seven-wicket victory.\n\nCampher praised captain Andy Balbirnie for his encouragement, saying: \"To be honest, I wasn't feeling great out there with the ball but the skipper told me to crack the game open. He's a great skip. He gives you free rein when you're bowling to do what you want.\n\nLive ICC World T20 Cricket\n\n\"I'm very fortunate to get [four wickets in four balls]. To be honest I wasn't really thinking about it, maybe it will sink in a little bit later. I was just trying to do what I wanted to do.\n\n\"We knew when Ten Doeschate walked in that we had to go straight to him and that worked and we just carried on with that. That was a plan and we worked on that with our analysts.\n\n\"Any time you get the opportunity to take a wicket in international cricket, it's a real privilege. Any wicket I can do for the team is a real boost.\n\n\"Obviously after that over I didn't really finish the last over as well as I wanted to but I'm learning, I'm young and I just want to do the best I can.\"\n\nTwitter Due to your consent preferences, you’re not able to view this. Open Privacy Options\n\nWho is Curtis Campher?\n\nThe 22-year-old grew up in Johannesburg and represented South Africa at Under-19 level before a chance conversation with Ireland's Niall O'Brien revealed that his grandmother, who came from Derry, qualified him to don the green shirt.\n\nHaving moved to Ireland at the beginning of 2020, Campher was selected for their A team (the Wolves) to play Namibia in a 50-over match and scored 54 on debut - although he failed to take a wicket.\n\nHe registered another half-century on his full ODI debut against England at Southampton in July 2020, top-scoring with 59 not out from 118 balls and going on to claim the wicket of Tom Banton.\n\nCampher bettered his batting performance with 68 from 87 balls in the second ODI and finished the three-match series, which England won 2-1, with five wickets at an average of 28.80.\n\nIreland handed Campher his T20I debut in August and, until Monday's heroics in Abu Dhabi, his best bowling figures were 3-19 during the warm-up series against the UAE ahead of the T20 World Cup.\n\nCampher 'makes something happen'\n\nIreland captain Andy Balbirnie: \"He makes something happen. I said that when he played last year against England, he obviously burst onto the scene with a 50 and a couple of wickets.\n\n\"The first over didn't go well for him [against Netherlands], but we broke it down to basics and said bowl as straight as possible. He did just that.\n\n\"I've not been involved in too many games where an over like that has happened, so I'm just delighted for him.\"\n\nWatch the T20 World Cup live on Sky between now and November 14."}, {"url": "https://testbook.com/question-answer/a-cricketer-whose-bowling-average-is-32-50-runs-p--609aae8c5dcd1ef4ac7f5cf8", "page_content": "Given:\n\nThe bowling average = 32.50, runs per wicket\n\nTakes 8 wickets for 65 runs\n\nAnd decreases his average = 0.50.\n\nCalculation\n\nLet the number of wickets taken before the last match be n.\n\n⇒ Total runs at 32.50 runs per wicket = 32.50n\n\n⇒ Total runs after the current match = 32.50n + 65\n\n⇒ Total no. of wickets after the current match = n + 8\n\nBowling Average after the current\n\n(32.50n + 65)/(n + 8) = 32.50 – 0.50\n\n⇒ (32.50n + 65)/(n + 8) = 32\n\n⇒ (32.50n + 65) = 32(n + 8)\n\n⇒ (32.50n + 65) = 32n + 256\n\n⇒ 0.50 n = 191\n\n⇒ n = 191/ 0.50 = 382\n\n∴ The number of wicket before the last match = 382"}, {"url": "https://www.bbc.co.uk/sport/cricket/59485301", "page_content": "Last updated on .From the section Cricket\n\nPatel had taken 29 wickets at an average of 32.48 in his previous 10 Tests\n\nSecond Test, Wankhede Stadium, Mumbai (day two of five) India 325 (Agarwal 150, Patel 10-119) & 69-0 New Zealand 62 (Ashwin 4-8, Siraj 3-19) India lead by 332 runs Scorecard\n\nNew Zealand's Ajaz Patel became the third bowler in history to take 10 wickets in a Test innings - but India seized control of the second Test.\n\nThe left-arm spinner added six wickets to the four he took on day one to finish with 10-119 as India were bowled out for 325 in Mumbai.\n\nJim Laker and Anil Kumble are the only other players to achieve the feat.\n\nNew Zealand were bowled out for 62 in reply, before India closed day two on 69-0 - a lead of 332.\n\nThe two-match series is level at 0-0 after India came within one wicket of forcing victory in the opening Test.\n\nMumbai-born Patel bowled 47.5 overs - more than twice as many as any other bowler - and his milestone moment came when India's Mohammed Siraj edged an attempted sweep to Rachin Ravindra.\n\nEngland off-spinner Laker took 10 wickets against Australia at Old Trafford in 1956, while India leg-spinner Kumble achieved the feat against Pakistan in Delhi in 1999.\n\nIt is likely that Patel's performance will be in a losing cause, given New Zealand's collapse with the bat.\n\nSiraj removed Will Young, Tom Latham and Ross Taylor in the space of seven balls on his way to figures of 3-19, before the last seven wickets fell to spin as Ravichandran Ashwin claimed 4-8."}, {"url": "https://byjus.com/question-answer/a-man-whose-bowling-average-is-12-4-takes-5-wickets-for-26-runs-and-thereby-decreases-his-average-by-0-4/", "page_content": "Let the number of wickets taken by him before the match be x .\n\nThe bowling average is given to be 12 . 4 .\n\nTotal runs = 12 . 4 x\n\nThe runs scored including this match is given by 12 . 4 x + 26 with the average of 12 .\n\n( 12 . 4 x + 26 ) x + 5 = 12 12 . 4 x + 26 = 12 x + 60 12 . 4 x - 12 x = 60 - 26 0 . 4 x = 34 ∴ x = 85 w i c k e t s"}, {"url": "https://www.cricbuzz.com/profiles/3847/yograj-singh", "page_content": "\n\nFull profile Father of Indian cricketer Yuvraj Singh, Yograj Singh, is a former Indian seamer who played 1 Test and 6 ODIs for India. A right-arm fast-medium bowler, Yograj was selected for India's tour ...\n\nBatting Career Summary M Inn NO Runs HS Avg BF SR 100 200 50 4s 6s Test 1 2 0 10 6 5.0 50 20.0 0 0 0 1 0 ODI 6 4 2 1 1 0.5 12 8.33 0 0 0 0 0\n\nBowling Career Summary M Inn B Runs Wkts BBI BBM Econ Avg SR 5W 10W Test 1 1 90 63 1 1/63 1/63 4.2 63.0 90.0 0 0 ODI 6 5 244 186 4 2/44 2/44 4.57 46.5 61.0 0 0\n\nCareer Information\n\nProfile\n\nFather of Indian cricketer Yuvraj Singh, Yograj Singh, is a former Indian seamer who played 1 Test and 6 ODIs for India. A right-arm fast-medium bowler, Yograj was selected for India's tour of Australia and New Zealand in 1980-81.\n\n\n\nHis performances in the ODIs were very disappointing. In 5 innings, he only took 4 wickets at an average of 46.50. His only Test appearance came against New Zealand at Wellington. He only bowled in the first innings and took 1/63. His only Test wicket came in the form of John Wright. India eventually lost the game by 62 runs. He played in seven first-class matches on the tour and returned with just 13 wickets.\n\n\n\nYograj played 30 first-class matches for Haryana and Punjab. He took 66 wickets at an average of 26.60. After his career got curtailed by injury, Yograj entered the Punjabi film industry and has starred in a number of films.\n\n\n\nControversies:\n\n\n\nRecently, Yograj Singh was in the news for his comments regarding MS Dhoni. Yograj alleged that Dhoni was behind Yuvraj Singh's exclusion from 2015 World Cup squad and claimed that Dhoni has become 'great' only because of the hype created by media. He even said: \\\"There will be a day when Dhoni will be left to beg and become penniless and would not get any favour.\\\"\n\n\n\nIn 2014, he was arrested by Haryana Police in connection with an alleged altercation over car parking in Panchkula.\n\n\n\n"}, {"url": "https://deadline.com/2022/04/john-burnham-leaves-icm-partners-atlas-artists-manager-1234999879/", "page_content": "EXCLUSIVE: John Burnham, a cornerstone talent and literary agent who has spent more than 25 years at ICM Partners, is leaving to become a manager and partner at Atlas Artists and Atlas Literary, the Atlas Entertainment subsidiary. The exit is amicable, and Burnham will bring with him a client list of renowned writers, filmmakers and actors he now will represent as a manager.\n\nThe long list of clients that will follow him includes Oscar, Emmy and Pulitzer winners. The roster includes Brandon Cronenberg, John Cusack, Stephen Dorff, Diane English, Kleber Mendonca Filho, Stephen Frears, Walter Hill, Felicity Huffman, Adrian Lyne, Sophia Macy, William H. Macy, Clara Mamet, David Mamet, Joe Mantegna, Nicholas Martin, Elaine May, Malcolm Mays, Takashi Miike, Pat McKinley, Keith McNally, David Milch, Rob Reiner, Emma Tammi, Caroline Thompson, David Twohy, Wayne Wang, Peter Weir, Alice Winn, John Woo and Terry Zwigoff. Others will follow as his exit gets sorted.\n\nBurnham becomes the latest rep switching from agenting to management in the ever-shifting rep space and as CAA moves toward acquiring ICM Partners, which Deadline revealed last fall.\n\n“We are very excited to welcome John to Atlas,” Atlas Artist president Dave Fleming and Atlas Literary president Alex Hertzberg said in confirming the move to Deadline. “John has long been regarded as one of the best representatives of talent and creators in town. With his impeccable roster of clients and relationships at the highest level, John is a perfect fit for our thriving team of managers and executives across the Atlas family.”\n\nSaid ICM Partners managing director Ted Chervin: “We thank John for the enormous contributions he’s made to the success of ICM Partners and for the distinguished career he’s had with ICM before that which goes back over 25 years. We wish him the greatest success with Atlas and look forward to continuing to work very closely with him.”\n\nBurnham first joined ICM after stints with manager Alan Carr and then the Paul Kohner Agency, where he rose from assistant to get his agent stripes. At ICM, he started in the Television Literary Department and then the Motion Picture Department, working for Sue Mengers and Jeff Berg.\n\nHe then joined the William Morris Agency and spent 16 years there, becoming Co-Head of the Motion Picture Department and serving on the agency’s board of directors. Burnham returned to ICM in 2001 as Head of Motion Pictures. He served on ICM’s Board of Directors in its prior configuration before becoming a partner."}, {"url": "https://www.sportskeeda.com/player/taskin-ahmed", "page_content": "Taskin Ahmed: A Brief Biography\n\nTaskin Ahmed Tazin is a Bangladeshi cricketer who was born on 3 April 1995 at Dhaka in Bangladesh. He is a left handed batsman and a right hand fast bowler who primarily plays as the fast bowler in his team. He is known for his 148 kmph delivery, which is the fastest delivery by a Bangladeshi cricketer in an official international cricket match.\n\n\n\n\n\nDebut\n\n\n\n\n\nTaskin Ahmed made his Test debut against New Zealand on 12 January 2017 at Wellington. He took 1 wicket in the match and New Zealand claimed a victory in the match by 7 wickets.\n\n\n\n\n\nTaskin made his ODI debut against India on 17 June 2014 at Dhaka where he took 5 wickets for 28 runs in 8 overs. Although India won the match by 47 runs, Taskin was praised for his brilliant performance in his first match.\n\n\n\n\n\nTaskin also made his T20I debut at his home ground of Dhaka against Australia on 1 April 2014 where he took the wicket of Glenn Maxwell. However, Australia won the match by 7 wickets.\n\n\n\n\n\nRise to Glory\n\n\n\n\n\nTaskin Ahmed rose to prominence when he was called in as a replacement for Mashrafe Mortaza against Australia. He did not miss the opportunity and dismissed Glenn Maxwell on a fine delivery. He was then signed in by Chittagong Vikings for the Bangladesh Premier League where he showcased his brilliant bowling skills and went on to become one of the most important bowlers for his team over the years.\n\n\n\n\n\nLow Points\n\n\n\n\n\nTaskin Ahmed suffered an injury during the 2013 season of the Bangladesh Premier League and had to spent one full season in rehabilitation. Also, he was banned from bowling in the 2016 ICC World T20 for illegal action, but each time he came out of the odds and is now a regular member of the national team of Bangladesh.\n\n\n\n\n\nClub Career\n\n\n\n\n\nTaskin Ahmed started playing in the Bangladesh Premier League as a part of the Chittagong Kings franchise and took 8 wickets in the 4 matches played in the 2013 season of the tournament. His best bowling figures were 4/31 against Duronto Rajshahi.\n\n\n\n\n\nTaskin Ahmed played for Chittagong Vikings in the 2016 season of Bangladesh Premier League and took 4 wickets in 7 matches at an average of 53.25. Taskin Ahmed improved his performance in the next season and took 15 wickets in 11 matches of the 2017 season of Bangladesh Premier League while playing for Chittagong Vikings. He also took 5 wickets in the match against Sylhet Sixers that season.\n\n\n\n\n\nTaskin Ahmed again played for Chittagong Vikings in the 2018 season and took 14 wickets in 11 matches of the tournament with a bowling average of 23.92 and conceded 335 runs in the tournament. In the 2019 season, he played for Sylhet Sixers and took 22 wickets in 12 matches, which made him the highest wicket taker of the tournament in the season.\n\n\n\n"}, {"url": "https://testbook.com/question-answer/a-cricketer-whose-bowling-average-is-12-runs-per-w--600ed26fc15056628e66ecde", "page_content": "Given:\n\nAverage before this match is 12 runs per wicket\n\nNew average = 12 – 0.4 = 11.6 runs per wicket\n\nTook 5 wickets by giving 40 runs.\n\nCalculation:\n\nLet the number of wickets taken by bowler after the match be X.\n\nSo, number of runs given by bowler after match = ( X – 5) × 12 + 40\n\n⇒ 12X – 60 + 40\n\n⇒ 12X – 20\n\nSo, Average of bowler after match = (12X – 20)/X\n\n⇒ 11.6 = (12X – 20)/X\n\n⇒ 11.6X = 12X – 20\n\n⇒ 0.4X = 20\n\n⇒ X = 20/0.4 = 50\n\nThe wickets were taken by bowler till the last match = 50 – 5 = 45\n\n∴ The total number of wickets taken by the bowler till the last match is 45 wickets.\n\nAlternate Method\n\nMatch average = 40/5 = 8\n\nWickets were taken till the last match = 45.\n\n∴ The total number of wickets taken by the bowler till the last match is 45 wickets."}, {"url": "https://www.thecricketmonthly.com/story/1320218/the--real-value--of-wickets--can-anyone-match-mcgrath", "page_content": "A few months earlier I made an exhaustive analysis of the Real Value of Test runs. Here is the companion article: the Real Value of Test wickets.\n\nDespite the nomenclature, the Real Value of Runs is really the Real Value of Innings, since the innings is the basic measuring unit. There is no sensible way to measure the Real Value of individual runs. A run is a run, and it is not correct to say that a winning hit for runs has much more value than previous runs in that innings.\n\nThe bowling is cheese to the batting chalk. Each ball bowled is a harmless one - maybe a dot ball or a few runs being conceded - unless it results in a dismissal. That dismissal could be that of Don Bradman on 0 or Bhagwath Chandrasekhar on 22, it could be a second-ball dismissal of a top batter or a late-order wicket in a collapsing innings. Hence, it is essential that we determine the Real Value of a wicket using various related factors. We must treat the bowler's spell as a collection of balls delivered, runs conceded and wickets taken - unlike an innings by a batter that is evaluated in its entirety.\n\nThere is another angle here. A bowler may bowl upwards of 200 balls in an innings, and only a few (at most ten) of these are successful, resulting in the capture of a wicket. What about the other deliveries? The bowler has bowled at top batters, bowled to a plan, kept one end under control, and helped their team in different ways. That means that there are several other factors involved, such as the bowling average for the innings, the quality of batting, the match status, the result. The wicket could have been taken in Hamilton in 2002 (Runs per Wicket 14.1) or in Hamilton in 2004 (RpW 53.0). It could have been in a narrow win or in a dead draw. These wide-footprint values cannot be directly assigned to specific wickets but to the complete bowling effort in the innings (hereafter referred to as \"Innspell\"), and then we go down to the individual wickets.\n\nThe bowling exercise is thus substantially more complicated than the batting exercise. I may not provide explanations in full here, and the readers must assume that due care has been taken while building the methodology wherever details are missing.\n\nMy Bowler Performance analysis - Red Cherry 25 or RC25 - took the Bowling Innspell as the base unit and worked on that, while here I take the wicket as the base point. There may be many similarities between the two, but the premise is fundamentally different. Let us now move onward to the overall methodology.\n\nAt match level (max 25 pts)\n\nPitch Quality Index for Match-half or Match, as appropriate\n\nWickets taken in low-PQI situations (bowler-friendly pitches) are valued lower than wickets taken on batter-friendly pitches. Using historical data will not work in this regard; Hamilton and Headingley are two venues, among many, that have had wild swings in pitch behaviour within a short period of time.\n\nThe opposition Batting Strength\n\nBowling against a team with a high Batting Strength index is far more difficult than bowling to a team whose highest batting average is, say, around 30.\n\nLocation/Result/Relative Team Strengths\n\nI do not believe that winning is everything; however, winning should be rewarded. Similarly, drawing a match should get more credit than losing one. And bowlers win matches. Doing well away (winning or drawing) should be rewarded too. Three results, three locations and five strength-comparison indices lead to a complex matrix, and determine the points to be allotted to the team's bowlers.\n\nMatch Status\n\nThe Match Status at the start of the match is neutral, tweaked only by the Relative Team Strengths. Then, at the beginning of the second innings, the Match Status is wholly dependent on how many runs the team bowling second has behind them. The third innings presents more possibilities: the lead/deficit inherited and the sort of fourth-innings target to aim for play a significant part in determining the Status. In the fourth innings, bowling teams have defended anywhere between one run and 835 runs. Using the match-to-date RpW, the difficulty of the chasing task is calculated and Status points allotted. The points for each innings are determined after an analysis of all these conditions. The total is allotted to the bowlers in proportion to the wickets they took (80%) and the overs they bowled (20%). This is to give some recognition to those who bowled long spells, while keeping in mind the importance of taking wickets.\n\nCourtney Walsh's wicket of Craig McDermott in Adelaide in 1993, denying Australia a tie by one run, is worth 30 points, the most any one fourth-innings wicket can be worth under this analysis © Getty Images\n\nAt Innspell level (max ten pts)\n\nWhat is the bowler average for the innings? That plays an important part in determining this value. In the recent Karachi Test, Mitchell Starc took 3 for 29 (9.67), Pat Cummins 1 for 39 (39.0) and Mitchell Swepson 2 for 32 (16.0) in the first innings. It is logical to allot the most points on this measure to Starc, fewest to Cummins and somewhere in between to Swepson.\n\nAt Wicket level (Batter-related: max 60 pts)\n\nA. Which batter was dismissed? (25 pts)\n\nHere I use the Career-to-Date Location Average to get a clear indication of the quality of the wicket. I assign 25% weightage to Recent Form (RF10) - that is, the average in the batter's last ten innings. Kumar Sangakkara (RF10 Ave=118), Garry Sobers (112), Viv Richards (109) and Alastair Cook (110) returned Bradmanesque averages during their peaks, and bowlers' dismissals of such batters should be rewarded.\n\nB. At what score was the batter dismissed? (25 pts)\n\nDismissing Bradman on 152 is an achievement and should help the bowling team. However, dismissing Bradman on 0 is magical, making a huge difference to the bowling team's fortunes. To qualify for these points, the batter must be dismissed at or below the CTD Location Ave-RF value, used in parameter A.\n\nC. Partnership preventer (10 pts)\n\nThis is a special measure that recognises bowlers who did not allow a partnership to develop. Using the batting team's RpW as the base, I allocate a maximum of ten points, depending on the partnership that was formed. The allotted maximum value comes down as we move forward in the innings. By definition, this measure rewards all quick wickets in the opening spell. For example, the three wickets taken by Irfan Pathan in his opening-over hat-trick against Pakistan in Karachi in 2005-06 get 10.0 points each. An interesting fact emerges when we look at the summary of this measure: the average for fast bowlers is 3.24 per wicket, while for spinners it is 2.68.\n\nAt Innings Status level (Inns 1-3: 15 pts; Inns 4: 30 pts)\n\nWhat is the target? What is the score? How many wickets are left? These are the questions used in the Innings Status, determining the points allotted to each wicket. The first three innings are treated differently from the fourth innings. It should be recognised that the moment before Courtney Walsh dismissed Craig McDermott in Adelaide in 1992-93, the score was 184 for 9 and Australia were one run away from tying the match. There is no other comparable situation in Test history. So this wicket is allotted 30 points, the maximum possible.\n\nLet us now move on to a schematic of the process. The article is current up to and including the recent Trent Bridge Test between England and New Zealand.\n\n© Anantha Narayanan\n\nThe four match-level measures are determined, summed up and allotted to each wicket equally. The highest score on this measure is 23.8 out of 25.\n\nThe Innspell value is determined and then allotted to each wicket.\n\nThe three wicket-level values are determined and allotted to the wickets. The highest for the Batter Score measure is 22.7 points and for the Batter Dismissed measure it is 21.1 - both for the wicket of Bradman in separate instances. In the Partnership Preventer measure, wickets of batters dismissed at 0 and no partnership runs are allotted the maximum of 10.0 points.\n\nThen the innings situations are analysed and status values allotted. The maximum values achieved for the four innings are 12.5, 11.8, 13.8 and 30.0 respectively.\n\nA sum of all these values leads to a figure between 10.0 and 73.43 for the 73,644 Test wickets taken in cricket history. This is then mapped on to a value between 0.500 and 1.905, which becomes the Wicket Quality Index (WQI). The WQI average for the 73,644 wickets is 0.995, confirming that the spread is almost perfect. However, the average WQI for pace bowlers is about 2% above par and for spinners about 3% below par. The main reason for this is that pace bowlers tend to take early wickets and spinners tend to need to plan for their wickets, which takes time. Hence, while converting the interim points total to WQI, minor tweaks are applied for all the wickets. In the final reckoning, pace bowlers took 49,832 wickets at an average WQI of 1.001 and spinners 23,803 wickets at 0.982. The distribution of WQI values is below.\n\n© Anantha Narayanan\n\nNote how symmetric the distribution of the WQI values is. Only the 1.20 to 1.30 range is slightly off. The highest frequency is at the 1.00-1.05 group, and the extreme groups have very low values. As mentioned, the mean is 0.995. The standard deviation is 0.198, and the coefficient of variation is a very acceptable 0.199.\n\n© Anantha Narayanan\n\nThe table above gives us an idea of how the WQI values have been distributed across the four innings. The WQI average is slightly below 1.00 in the first two innings and just above 1.00 in the latter two. This is understandable, since wickets get to be more valuable heading towards the end of the match. Third-innings wickets are the most valuable, since the match is still in the balance then. In the fourth innings, quite a few wickets are inconsequential, in wins by big runs or by upwards of five wickets.\n\nThe first table below is arguably the most important. It lists the top wickets of all time by WQI value. Readers might expect the table to be dominated by Bradman dismissals. But Bradman too had his lows in CTD values, and he went gone through an RF average of around 40 just after the Bodyline series. This means that there is good representation all around.\n\n© Anantha Narayanan\n\nThe top wicket of all time is the dismissal of Bradman by Hedley Verity at Lord's in the 1934 Ashes. Australia, after following on, were 43 for 1 when Bradman walked in and was subsequently dismissed for 13. Australia were in deficit by only 113 runs at the time, making the dismissal a crucial one. A target of 150 would have been tough to chase. Close behind comes another Bradman dismissal, this time by Bill Voce in Australia's first innings in Sydney in 1936. Coming in at 1 for 1, Bradman was dismissed first ball. England won by an innings.\n\nThird is a modern dismissal, from Edgbaston in the 2005 Ashes. Australia, chasing 282, had Adam Gilchrist arriving at 134 for 5 and Ashley Giles dismissing him for 1. Though Australia recovered, they lost the match by two runs. Quite close to this comes the opening-day dismissal of Everton Weekes in Kingston in 1953-54. Weekes was on a roll, with CTD and RF values well over 70. Trevor Bailey's dismissal of him for 0 eventually led to a comfortable win for England.\n\nFifty years later, in Kingston, after two 300-plus innings totals, Brian Lara walked in at 15 for 3 and was dismissed immediately by Matthew Hoggard. West Indies were bushwhacked for 47 and England won comfortably. The next four dismissals are those of Bradman by Dick Pollard for 7 in a drawn match, of Bradman by Vijay Hazare for 13 in a draw at the SCG, of Sobers, with a high CTD average, for 0 by Fred Trueman, and of Bradman by Neville Quinn for 2 on the opening day in Melbourne in 1931 (albeit in a match Quinn's team, South Africa, lost).\n\n© Anantha Narayanan\n\nThe best fourth-innings wicket was Giles' dismissal of Gilchrist, as we have already seen. However, in the table above, I look at those fourth-innings wickets that were primarily responsible for close wins. This table is ordered on the fourth-innings Status points. Of course, if a top batter were to be dismissed at 190 for 9 with a couple of runs needed to win, that wicket would have topped the previous chart. But that has never happened. Most of these wickets are of late-order batters.\n\nThe best wicket at the end of the fourth innings was that of McDermott, who was dismissed when a single was needed to tie. It is the only wicket to score a maximum 30 points on this parameter. The second wicket is that of Michael Kasprowicz by Steve Harmison (was it out at all?) in the 2005 Ashes classic at Edgbaston. This is followed by three wickets taken when three runs were needed to tie in each case: the first is the wicket of Jeff Thomson by Ian Botham in Melbourne in 1982, and the next two are from the famous 1902 Old Trafford Ashes Test.\n\nIn sixth place comes the first top-order wicket - No. 3 Azhar Ali's dismissal by Ajaz Patel. New Zealand won that pulsating Abu Dhabi Test against Pakistan in 2019; Ajaz also features on the table with the previous wicket of the innings, Hasan Ali's.\n\n© Anantha Narayanan\n\nAbove is the table of top Innspells - from an aggregate WQI point of view. The list does not feature Anil Kumble's and Ajaz's ten-wicket hauls, but it does contain quite a few eight-wicket hauls. This is owing to the combination of factors that go towards constituting the WQI: the quality of batters, the timing of the dismissals, the innings patterns, the result, the margin, the location.\n\nThe two Jim Laker performances at Old Trafford in 1956 bookend the 1994 Devon Malcolm masterclass, when he tore through a strong South African line-up and secured a great win at The Oval. Then comes Stuart Broad's Trent Bridge pre-lunch blitz in 2015 against Australia, followed by Richard Hadlee's famous effort in Brisbane in 1985 - the top-rated RC25 performance. No surprises among the performances that follow. The only interesting point is that the top 15 contains only one effort in a drawn Test - Glenn McGrath's at Lord's in 1997.\n\n© Anantha Narayanan\n\nThis table, along with the next, represents the most devastating bowling performances in history. They look at the top Innspells, but from an average - rather than aggregate - WQI point of view. The first table has a four-wickets-minimum cut-off. Let us go back to the SCG in 1936. After a good England score, a strong Australia side started their innings on a pitch transformed by a thunderstorm. Voce dismissed Leo O'Brien for 0, Bradman for 0 (a second consecutive duck), Stan McCabe for 0, and Jack Fingleton for 12, and the score was 16 for 4. For some reason Voce bowled only eight overs, and finished with 4 for 10. This Innspell averaged 1.605 on WQI.\n\nIn the first tied Test, in Brisbane in 1960, Wes Hall dismissed Bob Simpson for 0, Neil Harvey for 5, Norman O'Neill for 26, Les Favell for 7, and finally took the key wicket of Richie Benaud. In Kingston in 2009, England took the field trailing by only 74 runs. A few hours later they went down to an innings loss, having been dismissed for 51. Jerome Taylor took five top-order wickets for single figures, averaging 1.55 on the WQI.\n\nMohammad Asif's four top wickets in Kandy in 2005-06 and Cummins' effort in the Indian capitulation of 36 in Adelaide in 2020-21 follow next - separated by 0.003 on the WQI.\n\n© Anantha Narayanan\n\nThis table recognises top Innspells of six wickets or more, ordered, again, by the average WQI. The list is topped by Broad's demolition of South Africa at the Wanderers in 2015-16. He dismissed the top six batters for 17 and averaged 1.45 on the WQI. Broad also has the sixth-placed performance on this table, with his opening-day show against Australia in Nottingham in 2015 - his 8 for 15 averaged 1.38 on the WQI.\n\nIn second place is Ebadot Hossain's very recent 6 for 46, which resulted in one of the most amazing upsets ever - Bangladesh over New Zealand, away. In third place is Fazal Mahmood's famous six wickets against West Indies in Dacca in 1958-59. Next comes Lance Gibbs' marathon effort against England in Georgetown in 1967-68, which almost secured a win for West Indies, followed by Muthiah Muralidaran's third-innings destruction of India (in the company of Ajantha Mendis) in 2008.\n\nFive of these performances are within a range of 0.2 of each other on the WQI. The last performance on the table, Hugh Tayfield's valiant 7 for 23 in Durban in 1949-50, is the only one by a bowler ending on the losing side; Neil Harvey's magnificent unbeaten 151 carried Australia through in a memorable chase there.\n\n© Anantha Narayanan\n\nThis table considers the leading performances by average WQI performance - at a match level. The cut-off criteria are a minimum of five match wickets, and at least two in an innings. Neil Hawke took six wickets in the match in Port-of-Spain in 1964-65, all of top-order batters (Conrad Hunte, Bryan Davis twice, Rohan Kanhai, Basil Butcher and Seymour Nurse) for single figures. His WQI average was a stunning 1.44. Suranga Lakmal's five wickets, away in Bridgetown in 2018, were similar. Among Sydney Barnes' eight victims in Melbourne in 1911-12 six were top-order batters. All five of Danny Morrison's wickets against Sri Lanka in Wellington in 1990-91 were from the top seven. Voce's first-innings effort in Sydney has already been chronicled; in the second innings, he took two other top wickets out of three.\n\n© Anantha Narayanan\n\nNow for career performances. I have organised this data in two tables: the first one for bowlers who took between 100 and 200 career wickets, the second one for those who took over 200.\n\nEngland's early 20th-century left-arm spinner Colin Blythe averaged nearly 1.1 on the WQI for his 100 wickets and leads the table. Pathan, who too just about reached 100 wickets, is next, with an average WQI value of 1.08: across his career he took many top-order wickets. Mohammad Asif, despite having a short career, had an excellent one as far as quality of wickets was concerned, and he is just a decimal point away from Pathan. Alan Davidson, known for his incisive and economical spells at the beginning of innings, comes in next.\n\nThere is a decent representation of spinners here, with five in the top 15, led by Laker in fifth place.\n\nThe value in the last column is the percentage of high-WQI-value wickets in the bowler's overall tally. Fazal Mahmood is the only bowler who has more than 10% such wickets. Asif is close with 9.4%.\n\n© Anantha Narayanan\n\nThe table for bowlers with over 200 wickets is led by McGrath. Vernon Philander is only a fraction away. Then come Malcolm Marshall, Ray Lindwall, and a surprise in the form of Andrew Caddick. The top ten is a who's who of fast bowlers.\n\nTo provide additional information, I have listed five high wicket-takers who missed out on the top ten. Shane Warne, James Anderson and Broad have WQI averages higher than 1.02, while Courtney Walsh and Murali just about break even. Murali took a lot of late-order wickets. Kumble has an average WQI value of around 0.99. Overall, spinners find it difficult to get on to the table. Ravindra Jadeja is the highest-placed spinner, in 14th place, with an average WQI of 1.037.\n\nMcGrath took 563 wickets in his Test career. Of these, 142 (25%) were late-order wickets. Most of these wickets would have had WQIs between 0.7 and 0.9. He made up for this with high WQI values for the top- and middle-order wickets he took, to achieve the relatively high value of 7.5% for wickets with WQI values above 1.4. Lindwall tops on this count, with 8.3% of his wickets being such high-value ones.\n\n© Anantha Narayanan\n\nThis is a special table that lists teams that did well on the WQI front in a particular innings. At the top is South Africa's dismissal of Australia for 47 in 2011-12 in Cape Town. They secured 14.53 points there. The first eight Australia batters scored in single figures, totalling 21 runs between them. The second place is secured by West Indies in the 51-run demolition of England that we encountered earlier. Also here is the Broad match at Trent Bridge: England aggregated 13.86 in that steamrolling of Australia. The one relatively high score in in the top five is Australia's dismissal for 169 of the strong Indian team in Bangalore in 1998. The two 400-plus first-innings totals certainly helped to increase the WQI values in the match.\n\n© Anantha Narayanan\n\nFinally, a table of the best ten-Test streaks from the point of view of average WQI. England left-arm spinner Tony Lock leads here. In a ten-Test streak in the mid-1950s, he took 42 wickets at an average WQI of 1.17. He looked more the English destroyer than Laker during this period, although Old Trafford 1956 changed all that. In second place is McGrath, with 35 wickets at an average of 1.166, though he did not playing in quite a few Tests in that period in the early 2000s. He returned a low number of wickets but most were key wickets.\n\nPakistan left-arm spinner Iqbal Qasim follows close behind, and his streak includes the famous 1987 Bangalore Test, won narrowly by Pakistan. A hair's breadth behind is Broad, whose streak in 2015-16 fetched him 39 wickets. All his matches were against strong teams, and included the 6 for 17 already discussed. Barnes took an astonishing 69 wickets in a ten-Test streak in 1911-12.\n\nConclusion\n\nViewed from one angle, Walsh's dismissal of McDermott in Adelaide could be termed the greatest wicket of all - one run needed to tie the match. However, the fact that McDermott was a lower-order batter prevents me from saying this. If the batter had been Allan Border, I would probably anoint that wicket as the greatest of all. As such, I would say that any Bradman dismissal for a low score - such as Verity's and Voce's - resulting in a win for the other team should qualify for this distinction. Note that a few other low-score dismissals of Bradman - such as Quinn's, Alec Bedser's and Eric Hollies' - did not stop Australia from winning comfortably. Hollies made sure that generations of cricket analysts, myself included, did not need to set a six-character limit for career batting average, and that the number 99.94 attained mythical prominence - but that match was virtually won by Australia before Bradman even padded up.\n\nIn general, spinners have found it a little difficult to gain high WQI values. They take their time and bowl more balls per wicket, whereas fast bowlers have the first bite of the cherry - their early strikes are necessary to keep the batting team on the back foot, and so they gain their marginal benefit in the values.\n\nWhat about Warne's \"ball of the century\" (although I do not think it was)? That dismissal of Mike Gatting scored quite highly: 1.36 WQI points. However, as far as the analysis goes, the next wicket, of Robin Smith, received 1.47 WQI points. The reason is simple. Both were quick wickets to follow earlier wickets. But at the time Smith was a far better batter than Gatting - Career-to-Date average of 47 vs 35, and Recent Form average of 43 vs 29. Unfortunately, the WQI cannot capture the turn imparted - according to some pundits, close to three feet in the case of the Gatting delivery.\n\nAnantha Narayanan has written for ESPNcricinfo and CastrolCricket and worked with a number of companies on their cricket performance ratings-related systems\n\n© ESPN Sports Media Ltd."}, {"url": "https://testbook.com/question-answer/a-cricketer-whose-bowling-average-is-11-5-runs-per--600e508b8b8435b6709169ec", "page_content": "Given:\n\nAverage before this match is 11.5 runs per wicket\n\nNew average = 11.5 – 0.5 = 11 runs per wicket\n\nTook 6 wickets by giving 33 runs.\n\nCalculation:\n\nLet the number of wickets taken by bowler after the match be X.\n\nSo, number of runs given by bowler after match = ( X – 6) × 11.5 + 33\n\n⇒ 11.5X – 69 + 33\n\n⇒ 11.5X – 36\n\nSo, Average of bowler after match = (11.5X – 36)/X\n\n⇒ 11 = (11.5X – 36)/X\n\n⇒ 11X = 11.5X – 36\n\n⇒ 0.5X = 36\n\n⇒ X = 36 × 2 = 72\n\n∴ The total number of wickets taken by the bowler is 72 wickets.\n\nAlternate Method\n\nMatch average = 33/6 = 5.5\n\nTotal wickets taken = 6 + 66 = 72\n\n∴ The total number of wickets taken by the bowler is 72 wickets."}]}