{"Nate Saint worked as a pilot for Mission Aviation Fellowship (MAF) in the Belgian Congo.": [{"url": "https://hub.maf.org/ministry/mafaviation/changing-airplanes-unchanging-mission", "page_content": "When WWII pilots envisioned using small aircraft to help the gospel spread to hard-to-reach areas, could they have imagined what missionary aviation looks like today? Could MAF’s founders have conceived of the complexity of the tools—the aircraft—that now make up the MAF fleet?\n\nNow, more than 75 years after the start of MAF’s ministry, its aircraft have changed dramatically. But one thing that has not changed is MAF’s mission*—to share the love of Jesus Christ so that isolated people will be physically and spiritually transformed.\n\nThe Beginnings (1945 – 1965)\n\nFabric-covered airplanes like the Piper Cruiser, Piper Pacer, and the Stinson Voyager helped start the earliest programs, in Mexico and Central and South America. These light aircraft served remote jungle outposts where western missionary families were bringing the gospel to remote tribes. MAF pilot Nate Saint was passionate about reaching one tribe in particular—one that was feared as a “tribe of killers.” In 1948, he wrote to his parents that he expected the airplane would play a part in reaching them with the gospel.\n\nHis prediction proved true. In January 1956, Saint landed a bright yellow Piper Family Cruiser on a sandbar nicknamed Palm Beach, along the Curaray River. Initially, he and four other missionaries had friendly interactions with members of the feared Waorani. But then, days later, the world learned of the five men’s martyrdom at the hands of the tribe.\n\nFar from slowing down the dream of those early WWII pilots, this incident catapulted the idea of missionary aviation across the globe. As a result, young Christians caught the vision of using airplanes to reach the lost—and MAF grew rapidly.\n\nThe Growing Years (1965 – 1990)\n\nAs MAF moved from fabric-covered to aluminum aircraft, small Cessna aircraft became the workhorses of the day.\n\nIn Indonesia, Cessna 185s and 206s served western missionaries and local evangelists in hard-to-reach areas, and the gospel continued to spread. These new birds nearly doubled the range and load of those earlier aircraft and opened more doors for physical healing, education, community development, and disaster relief to reach isolated people.\n\nA second-generation MAF pilot, Dick Parrott, son of MAF founder/former president Grady Parrott, recalls opening the West Kalimantan, Indonesia, program in 1969 with a brand new C185, PK-MCB, that came to be known as “Charlie Brown.” As the sole pilot/mechanic on the program at the time, Dick was responsible for fixing and flying the airplane.\n\nOf course, other pilots and airplanes followed, and the program expanded to East Kalimantan (now North Kalimantan) and, later, Central Kalimantan. Those small Cessnas brought physical healing to isolated people through a partnership with a Baptist mission hospital, and they enabled the training of 100,000 Dyak Christians through a theological education program. MAF also served a C&MA Bible school there.\n\nA few years ago, when Dick learned that Charlie Brown was going to be removed from service, he was surprised.\n\n“I was amazed that it was still in operation,” said Dick. “You know, MAF does a great job keeping their equipment operational.”\n\nOver in Papua, Indonesia, MAF was continuing to serve western missionaries who were working on Bible translations. Along with the small Cessna airplanes, MAF introduced another aircraft to its fleet in 1976, the helicopter. This new tool helped missionaries survey still-unreached areas and allowed them to live remotely until an airstrip could be built.\n\nRecent Years (1990s – 2020)\n\nIn more recent years, MAF introduced larger, more complex turbine-engine aircraft to its fleet—Cessna Caravans, Quest Kodiaks, and a PC-12. These brought another big jump in range and load capabilities, plus advanced technology that increased safety and efficiency. And, they use jet fuel, verses aviation gasoline (Avgas), which is more readily available overseas.\n\nIn March 2016, an MAF Caravan landed at the Todro airstrip in the Democratic Republic of the Congo. It carried MAF staff, SIL missionaries and local dignitaries who had come to celebrate the completion of the Logoti-language New Testament—a project that moved forward with MAF’s help through years of war and insecurity.\n\nMAF’s service spans multiple decades when it comes to bringing the gospel to a remote people group, serving missionaries working on a translation, delivering completed Bibles, and supporting local churches.\n\nThese decades of service typically represent multiple aircraft as well—the right aircraft for the job.\n\nBut no matter the airplane make, model, or size, each one serves a kingdom purpose—to reach isolated people with the love of Jesus Christ. And each one is meticulously maintained thanks to the support of people like you who have stood with us through the years; people who still believe that the airplane can play a part in introducing people to the gospel.\n\n*When this story was written, we were still using our old vision and mission statements. In 2021 we rephrased them slightly, though the intent is the same. You can see them here."}, {"url": "https://update.maf.org/about/history/nate-saint/", "page_content": "Nate Saint\n\nNate Saint was raised in a conservative Christian family that was deeply devoted to living for Christ. Bible reading, prayer, and stories of missionaries were staples in the Saint household. Because of this foundation, Nate developed a strong sense of purpose and conviction to serve the Lord.\n\nFrom the time that he took his first flight at the age of seven, Nate was fixated on airplanes. His mechanical aptitude was evident early on as he undertook large projects such as building an eight-foot-long sailboat or taking apart the family’s car motor and putting it back together."}, {"url": "https://missionsbox.org/missionary-bio/nate-saint/", "page_content": "“People who do not know the Lord ask why in the world we waste our lives as missionaries. They forget that they too are expending their lives … and when the bubble has burst, they will have nothing of eternal significance to show for the years they have wasted.” – Nate Saint\n\nHis Early Life and Times\n\nNate Saint was born in 1923 near Philadelphia, Pennsylvania. The seventh of eight children, he was raised in a devout Christian home.\n\nLike many young men in the first half of the 20th century, he was fascinated with airplanes. In 1930, at the age of seven, one of his older brothers gave him a ride on a plane. Three years and some thrilling flights later, his brother let him take the controls on a flight. From that time on, he was fascinated, not only with airplanes; he became fascinated with flying.\n\nIn 1942, at the age of 19, Nate enlisted in the U.S. Army where he expected to become a pilot during World War II. Unfortunately, due to a lingering infection, the Army would not allow him to fly. Nate turned that into an opportunity to become an aviation mechanic. He learned valuable lessons in that position that he would use later.\n\nHis Unexpected Life in Aviation\n\nFollowing Nate’s three years in the military, he obtained a commercial pilot’s license and enrolled at Wheaton College. During that time, his father made him aware of the newly established Christian Airmen’s Missionary Fellowship (CAMF) which eventually became the Mission Aviation Fellowship.\n\nThe MAF began transporting missionaries into hard-to-reach places in the jungles of Mexico, Peru, and Ecuador. While at Wheaton, Nate committed his life to serving the Lord as a missionary and missions pilot. He so with the understanding that the work would be dangerous. In one year alone, 51 people died in missionary plane crashes in the jungle. In 1948, Nate and his wife traveled to Ecuador to open an MAF base at Shell Mara.\n\nHis Eventful Life in Ecuador\n\nMissions work in Ecuador did not start well for the avid missionary pilot. In December of his first year, the plane he was piloting crashed after a powerful downforce of wind drove it into the ground. Nate suffered a broken back and other injuries that kept him in a body cast for six months.\n\nThe bulk of Nate’s work was transporting missionaries to villages that would otherwise have taken many days to reach traveling on foot. Once they were in place, he delivered food and supplies for their sustenance and work. Often supplies included medicines and medical equipment they would use to treat illnesses in the tribes to which they ministered.\n\nNate solved one of the early problems in jungle missionary aviation while serving the Lord in Ecuador. Pilots would drop supplies in predetermined locations, but some supplies were destroyed when the hit the ground, and more ended up in the treetops of the jungle canopy. Nate devised a method of safely and efficiently lowering supplies using a bucket and a rope while circling overhead. Not only were the supplies delivered, but the missionaries were able to send messages and other items up to the plane using the device.\n\nNate described his life in Ecuador this way:\n\n“It is our task to lift these missionaries up off those rigorous, life-consuming, and morale-breaking jungle trails—lift them up to where five minutes in a plane equals twenty-four hours on foot. The reason for all this is not a matter of bringing comfort to the missionaries. They don’t go to the steaming, tropical jungles looking for comfort in the first place. It’s a matter of gaining precious time, of redeeming days and weeks, months and even years that can be spent in giving the Word of Life to primitive people.”[1]\n\nHis Eventual Loss in Ecuador\n\nNate and four other missionaries had developed a burden to reach the Aucas, a reclusive tribe of native Indians known to kill others found in their territory. The Ecuadorian government had been considering sending troops in to subdue the natives.\n\nNonetheless, Nate, Jim Elliot, Ed McCully, Peter Fleming, and Roger Youdarian began an effort to break through to the tribe. They started by making flights over the village, dropping gifts from pots and pans to trinkets. Having received what they considered a warm response, they determined that it was time to meet the Aucas in person.\n\nOn January 8, 1956, the five landed the plane on a strip of side alongside a river near the village. They were to make scheduled radio calls to their families back at the airfield compound, but no transmissions were ever made. The Aucas had massacred Nate and the others and left their bodies in the river and along the beach.\n\nThe story made major headlines, including an entire photo spread in Life magazine.\n\nHis Eternal Legacy\n\nJesus said that “even the gates of Hell shall not prevail” against the Kingdom of God and His Church. Indeed, the spears of the Aucas could not. Instead of retreating in fear and defeat, the effort to reach the Aucas continued, including the personal ministry of Nate’s son Steve and sister Ruth and Jim Elliot’s wife Elisabeth, each of whom eventually lived with and ministered to the Aucas.\n\nTheir continued work has created an eternal legacy as many of the Aucas natives have accepted Jesus Christ as their Lord and Savior over the years, including six of the men who participated in the raid and killed Nate and his fellow missionaries.\n\nThe Indians told their families that they were puzzled at why the men did not fight but willingly gave up their lives. Their amazement opened the door for the women to tell them that the men were there to tell them about Jesus Christ who “freely allowed his own death” to ransom them from sin and its inevitable price.\n\nRachel Saint spent the rest of her natural life with Wycliffe Bible Translators among the Aucas and is buried in Ecuador.\n\nKimo, the pastor of the tribe, requested the honor of baptizing Steve and Kathy, Nate’s children, to demonstrate their reconciliation through Christ. The pastor had been a member of the killing party.\n\nGikita, the leader of the attack, died a believer at the age of 80. He said that he was “eager to go to Heaven and live peacefully with the five men who came to tell them about Creator God.”[2]\n\nAs Nate Saint said, “When life’s flight is over, and we unload our cargo at the other end, the fellow who got rid of unnecessary weight will have the most valuable cargo to present to the Lord.”\n\n[1] Jungle Pilot: The Life and Witness of Nate Saint, Russell T. Hill, Copyright 1959 by The Fields, Inc,, Harper Collins Publishers, Inc.\n\n[2] Even Unto Death: Wisdom from Modern Martyrs, edited by Jeanne Kun, The Word Among Us Press, 2002."}, {"url": "https://www.christianitytoday.com/ct/1994/august15/4t9057.html", "page_content": "The skeletal remains of an aircraft, uncovered on a remote beach along a river in Ecuador, are believed to be the lost plane piloted by American missionaries shortly before their murder in 1956.\n\nMission Aviation Fellowship (MAF) staff recently identified the remains of the Piper aircraft in an isolated Ecuadorian jungle as the plane flown by Nate Saint just before he was killed by Auca Indians in 1956.\n\nSaint and four other missionaries were making first contact with a group of indigenous people when they were attacked with spears and killed. The moving story of their martyrdom inspired a generation of Christians around the world to enter foreign mission service.\n\nMAF missionary Bill Clapp positively identified the remains pulled from a sandy beach along the Curaray River as being the front lower fuselage of the airplane flown by Saint. The airplane had lain buried beneath the shifting sands of Palm Beach, a small outcropping on the river, since the incident.\n\nClapp said that parts of the plane, including the motor, had been removed. Some portions of the craft were carried out by the recovery party, which included American military personnel stationed in Panama. Recent heavy rains and a shifting of the course of the river uncovered the lower fuselage, which was discovered by an Indian family.\n\nFollowing the killing of the missionaries, four of the bodies were buried on the river bank at the site. In later years, Elisabeth Elliot, widow of Plymouth Brethren missionary Jim Elliot, and Rachel Saint, sister of Nate Saint, lived among the Auca Indians (known today as the Huaorani), providing them with basic education, health care, and the gospel. Chronicles of the martyred pilots and the ministry to the Aucas have been told in several books, including Through Gates of Splendor and The Savage, My Kinsman, by Elisabeth Elliot, and Jungle Pilot, by Russell Hitt. Others killed in 1956 were Plymouth Brethren missionaries Pete Fleming and Ed McCully, and Roger Youderian of Gospel Missionary Union.\n\nFor Clapp, it was an emotional moment when he first saw the plane's remains in the front yard of an Indian home. Surrounded by two dozen Indians and a few visiting missionaries, he moved the control throttle forward. \"Just think,\" he said, \"the last person to move that throttle in flight was Nate Saint.\"\n\nClapp said he hopes that some of the remainder of the plane can be restored and used as a museum piece to instill a vision for foreign mission work in a younger generation.\n\nClapp led a group of workers, including two sons and a grandson of Nate Saint, back to the isolated beach site to recover additional sections of the plane and to search for the engine, which was left behind by the original search party in the 1950s because of fear of another violent attack.\n\nUsing metal detectors, Clapp, missionaries, and Huaorani searched the beach and river bottom for five days before additional remains were found scattered kilometers apart. The Clapp group was unable to find the engine, in part because, during the 37 years since the incident, the river and its sand beaches have shifted course and location.\n\nClapp said he now believes the engine is in the middle of the river and perhaps will be easier to locate during dry season next January when the river will be much lower.\n\nWhile searching for the plane's remains, Steve and Phil Saint, sons of Nate Saint, met with an 82-year-old Huaorani Indian who participated in the killing of the missionaries in 1956. After a half-hour conversation, the three men stood with their arms around one another as photographs were taken. The Indian had become a Christian convert in the years following the slayings.\n\nCopyright © 1994 Christianity Today. Click for reprint information.\n\nHave something to add about this? See something we missed? Share your feedback here."}, {"url": "https://www.mnnonline.org/news/house-of-maf-martyr-nate-saint-set-for-restoration/", "page_content": "Ecuador (MNN/MAF) — The house in Shell Mera, Ecuador, that MAF (Mission Aviation Fellowship) missionary martyr Nate Saint built in 1948 still stands, but it's crumbling from termites and the daily inch of rain that deluges the eastern Andean foothills.\n\nChris Nevins of the non-profit construction ministry Fuel the Mission (www.fuelthemission.org) is about to change that. On June 15 Nevins and teams of Ecuadorian and North American workers will begin the loving labor of restoring the historic building.\n\n\"MAF holds so dear the history of Nate Saint's work,\" said MAF President John Boyd. \"This major undertaking to restore the house that Nate built with a team of missionaries is so meaningful to MAF, not just for today, but for the future.\n\n\"Young people are taking an interest in Nate Saint and his sacrifice. I know the Lord is going to use this project to inspire the next generation to serve the cause of Christ to the ends of the earth.\"\n\nIn 2006 Nevins, with his wife and son, lived five months in Ecuador to build a school for an orphanage. Nevins, 52, of Scottsdale, Ariz., had worked 30 years in the construction industry, much of it overseeing the building of country clubs, condominiums and housing subdivisions. Three years later, Nevins returned with a team to Ecuador for Bible training.\n\nEn route, the van stopped in Shell Mera, a community on the edge of the jungle, and parked in the MAF hangar a few dozen yards from the Nate Saint house.\n\n\"Life\" magazine brought the story to millions of readers in 1956 with photographs of Marj Saint and wives of the four other missionaries in the house's kitchen, receiving word their husbands had been killed by Auca Indian spears. Nevins had read \"Jungle Pilot,\" Saint's biography, which included photos of the house. Photos are also in \"The Savage, My Kinsman,\" a book by missionary widow Elisabeth Elliot.\n\nSaint designed the 4,000-square-foot facility as his family's living quarters, a guesthouse and a radio center to communicate with his wife, Marj, the radio operator. On any given night, up to 20 missionaries passing through the area spent the night.\n\nNevins arrived at the MAF facility in pouring rain, but still he wanted to go to the house. By then it had been empty for eight years and was no longer safe to walk in.\n\n\"I got 20 feet from the house, and my knees just buckled. I just stood there and cried.\" Nevins said.\n\nThe emotion didn't come from the house itself. \"It's the story of what God did those years ago. It's about grace and restoration,\" he said. \"People come from all over the world to see it because of what God did with ordinary men.\"\n\nLast summer a 13-year-old girl from Texas, whom Nevins knew, posted on her Facebook page that she had visited the house. \"She wrote, 'I can't believe we just visited the Nate Saint house. What a story of what God did through them. But I can't believe they're letting the house fall down, because it seems so important,'\" Nevins recollected.\n\nThat's when Nevins sensed God calling him to do something about it. He sent the girl's comment to Gene Jordan, MAF vice president of human resources, and offered to help restore the Nate Saint house. Soon after, Nevins created Fuel the Mission to help mission groups around the world with their construction needs.\n\nSo far Nevins has raised half of the $75,000 needed to complete the Nate Saint house project. He will rely on the labor of Ecuadorans and North American volunteers.\n\nSaint supervised the five-missionary construction team that began building the house in September 1948. They were MAF pilot Jim Truxton, George Poole of HCJB Radio, Frank Drown and Keith Austin of Gospel Missionary Union, and missionary surgeon M. Everett \"Ev\" Fuller of the HCJB hospital. They lived in tents during the five-week project.\n\nOne night sitting around the campfire, missionary David Cooper stopped to visit as he traveled through Shell Mera. Cooper told Saint about the Auca (Waodani) Indians–a hostile, animist, isolated people group in the eastern Ecuadoran jungle. Eight years later, Saint flew four missionaries to make contact with the Aucas, who killed them.\n\nSaint had designed the house like a World War II army barracks with bare studs on the inside \"to keep the varmints out,\" Nevins said. It was built of termite-resistant jungle mahogany four feet off the ground for ventilation. It rested on concrete pylons with little moats around each which Saint filled with old engine oil to keep bugs out of the house.\n\nGene Jordan grew up in Ecuador as an HCJB missionary kid. As a teenager, he lived several summers in the house. He recalls its mahogany walls were so hard that hanging a picture required a drill.\n\n\"The house always was one of the centers of activity when people were coming or going, with the big dining room and a lot of guests,\" he said.\n\nThrough the decades, the two-story house served as a ministry center and a must-stop on the itinerary of short-term workers and Christian tourists. But as the house aged, its problems became too costly to fix. In addition to moisture and termites, earthquakes, volcanic ash and shifting soil were its perpetual enemies. In 2002, MAF ceased using it.\n\nToday, as many as six vanloads of visitors may stop at the house in a single day. It has remained a draw for Christians around the world because Saint has inspired so many believers to serve the Lord in missions.\n\nAnd it inspired Nevins. He found three issues of \"Life\" magazine from the 1950s and 1960s which featured the Ecuador mission and house. These images will help guide the restoration of the structure which has been nearly decimated by flying termites. As Nevins toured the house with MAF workers, \"crawling through every inch of the attic,\" a ceiling joist began to give way under him.\n\nThe kitchen and radio room will be restored to their original state. The rest of the house will become mission offices and a training room, with an apartment for a resident missionary family in the back. The house's electrical and plumbing systems will be replaced, and it will be wired for Internet. A \"wall of remembrance\" will trace the history of the house.\n\nNevins says the tentative date for the 90-day project's completion is Sept. 15. This depends on funding and the availability of volunteers. Those interested in helping with the project are invited to contact Nevins at www.fuelthemission.org."}, {"url": "https://reachbeyond.org/content/news/read/missionary-pilots-hope-lives-on", "page_content": "(February 8, 2018 - by Ralph Kurtenbach)\n\nA patch of land set apart decades ago for evangelistic outreach has changed hands in eastern Ecuador, with ministry to people of the nearby rainforest continuing to guide its future use.\n\nNeither ceremony nor fanfare surrounded the transaction. In a short exchange that included photographs, the CENTA foundation of missionaries Chet and Katie Williams acquired the property from Reach Beyond (formerly HCJB Global).\n\n\n\nThe Williamses formed CENTA to establish longevity for their vision of bringing culturally relevant instruction and interchange to the indigenous of Ecuador’s Amazon region. With the purchase, they receive property that carries a storied past spanning decades. In the 1950s, Mission Aviation Fellowship (MAF) pilot Nate Saint bought the property—and adjacent land—for use in ministry to the jungle dwellers. One of the earliest structures on the 10-acre plot served as the Epp Memorial Hospital (Hospital Vozandes Oriente or HVO), a long wooden structure set on concrete pylons and with broad awnings for the area’s heavy rains.\n\nSaint’s friends from other mission agencies helped build the hospital. In a black and white photo, Roger Youderian, a WWII paratrooper and later a missionary of Avant (then known as Gospel Missionary Union), is shown on a ladder nailing on roofing. Jim Elliot, a Brethren missionary, who was a capable craftsman, evangelist and linguist, also helped in the effort. On January 8, 1956, Saint, Youderian, Elliot, and two other Brethren missionaries, Ed McCully and Pete Fleming, were speared to death in efforts to reach out to the Waorani of the jungle. Waorani means “the people” but they were then known by the pejorative term, Auca, which means “savage” in Quichua.\n\nAfter the killings, Reach Beyond acquired the hospital and its surrounding compound on two sides of the Motolo River, which runs through Shell. In the 1980s, staff vacated the wooden hospital as HVO moved to a new cinder block facility on the opposite side of the river. Missionary nurse and hospital administrator Eleanor Boyes would later term the long suspension bridge linking the properties, Bridge to the Rain Forest, in her book by that name. The old hospital then became a guesthouse and served in that way until its demolition in 2008. The acreage (known as the Rio Motolo south property) that CENTA purchased also includes the buildings of the now-closed Nate Saint Memorial School, a water tower, a two-story guesthouse, and other remaining structures.\n\n\n\nAt the time of this story, the Williamses said that words of the acronym, CENTA, were not yet public. The CENTA website (www.centamazon.org) describes the entity as having been “formed in Ecuador as a tool to facilitate The Center. The Center is a hub where tribal people can develop culturally relevant transitional life skills in an environment that encourages an abundant life in Christ.” The website solicits free will donations for renovations and repurposing they would like to see on the property—rehabbing the remnants of the hospital kitchen structure, for example, to make a working woodshop.\n\n“We are so glad that the use of this historical place can continue to bless and reach out to the indigenous people of the Amazon jungle,” said Reach Beyond’s Hermann Schirmacher, the mission’s associate regional director in Latin America. “We celebrate with the CENTA family the official transfer of the Rio Motolo south property [on] Dec 19,” he wrote in a memo to the missionary staff. Talks had been underway for a few years.\n\nIn mid-2016, the Williams’ proposal was approved by the board of Reach Beyond’s parent organization, World Radio Missionary Fellowship, Inc. “We really see this place continuing to bring practical help and hope to future generations of tribal people for many years to come,” said Chet Williams, president of CENTA.\n\nIn another agreement, Reach Beyond nurse Miriam Gebb, is now on loan to CENTA. She has served in Ecuador’s jungle region as a community development specialist and health care facilitator for more than 30 years. She views the two—her mission agency and the newly formed foundation—as having “a similar vision to boost cooperation among local and foreign entities in Ecuador.”\n\n\n\nThe CENTA website lists its launch team. Among its members are Dr. Jim Yost, the first cultural anthropologist to work with and research the Waorani people. Their members and culture appear to have been on a path to decimation; revenge killings prevailed until Saint’s sister, Rachel Saint, and Elliot’s widow, Elisabeth Elliot, brought to them their first exposure to Christianity.\n\nYost has described his research as documenting the culture before it became absorbed into Western civilization in Ecuador. Another launch team member is Gilberto Nenquimo. He is a grandson of Mincaye, who in 1956 as a young Waorani was in the raiding party that killed the five missionaries. Jonathan Pifer will also help initiate the training. He grew up in Ecuador as the son of Reach Beyond missionaries, Tim and Lynn Pifer.\n\nReach Beyond has retained the north Rio Motolo property. There, the agency has leased the hospital building to two of its former missionaries, Drs. Eckehart and Klaudia Wolff. In addition, the mission has initiated on the north property, an intensive missionary training curriculum known as CHILI (Community Health Intercultural Learning Initiative), and more recently, a greenhouse with plants to facilitate a cash crop (cacao) and better dietetic variety for people in cooperating jungle communities.\n\n\n\nSource: HCJB Global"}, {"url": "https://hub.maf.org/tag/nate-saint", "page_content": "“You’d better read this book,” Bill Clapp, an MAF alumnus said 53 years ago, as he handed “Jungle Pilot” to a pretty 19-year-old named Carole. “This is what I want to do.” Bill didn’t own a car, but he did have a plane. The two of them had just returned from a flight to take […]\n\nShare this: Facebook\n\nTwitter\n\nPrint\n\nEmail\n\n"}, {"url": "https://hub.maf.org/memorial/joyce-lin-memorial", "page_content": "Remembering Missionary Pilot Joyce Lin\n\nThe sick woman was not well enough to sit in the Mission Aviation Fellowship (MAF) airplane, so pilot Joyce Lin helped her to the floor, tightened the straps to secure her for the flight, and began to pray. Tears welled and her voice cracked as she struggled through the prayer. But these were not tears of sadness—they were tears of hope.\n\nThis was a special moment for Joyce.\n\nJoyce took off from the Wamena airstrip, high in the mountains of Papua, Indonesia, and flew the woman to the larger city of Sentani to receive medical care. This was MAF’s first medical evacuation flight since the COVID-19 lockdown.\n\nIt was also Joyce’s first-ever medevac flight.\n\nAnd it marked a momentous step in Joyce’s journey.\n\nA Long Obedience\n\nAfter earning two degrees in engineering from MIT followed by a decade-long career as an officer in the U.S. Air Force and in private-sector cybersecurity, Joyce felt led to Christian ministry, so she enrolled at Gordon-Conwell Theological Seminary. While in seminary, she discovered missionary aviation and traveled to Papua, Indonesia, for a summer internship with MAF.\n\n“[Ten] years ago, I left Papua convinced I should pursue mission aviation,” Joyce said in a 2019 newsletter. “But there were no guarantees I would actually be able to get to this point.”\n\nJoyce had earned her private pilot license while at MIT, but still needed an instrument rating, a commercial pilot license, and months of training to meet MAF’s standards. She was dealing with back issues and unsure if she would be healthy enough to serve in Indonesia long-term. But “the doors never closed, and every hurdle was cleared.”\n\n“I am thankful to every flight instructor, every friend, and every medical person who contributed in a myriad of ways to help me over those hurdles,” Joyce said. “I am thankful to God, who gave me a vision of what my future would look like and who was steadfastly faithful to keep me on the path that led me [to Papua].”\n\nLiving A Dream\n\nShe arrived at her new home at the MAF base in Sentani as an MAF pilot and IT specialist, and quickly became a key part of the team. She began by flying essential supplies to isolated villages and helping complete a years-long fiber cabling project to support MAF’s IT work in Papua. And just as quickly, her care for her teammates and the people she served left a lasting impact.\n\nEach morning, Joyce would make the “long” commute from her home to her office—which entailed walking out her front door, crossing the street, and opening the doors to the MAF offices at the Sentani airport. She would settle into her desk and get to work. For Joyce, these daily rhythms carried a weight that transcended the work itself. Her desk was not just a desk.\n\n“This is my desk, where I do IT work,” Joyce said. “It is also the place where God has been working on my sanctification, one day at a time.”\n\nIn this far-flung corner of the world, Joyce Lin was living her dream.\n\n“I’m privileged to be serving the many churches and missionaries in Papua who continue to reach out to isolated villages so that people can be both physically and spiritually transformed,” Joyce said.\n\n“Anyone who knew Joyce recognized that she was extremely dedicated. That showed up most in her commitment to being used by God and sharing His love with others, especially those less fortunate. She was extremely generous, giving of herself and her treasures selflessly,” said Brock Larson, regional director of MAF Indonesia and Joyce’s teammate.\n\n“Joyce embodied so much of what we love to see in MAF staff,” said David Holsten, president and CEO of MAF. “She was invested in the local culture, but she maintained a deep connection to her family, friends, and supporters around the world. She was professional in her IT work and in her flying. She was a dedicated teammate and well-loved by those she served.”\n\nJoyce played a vital role in supporting the work of the missionaries, local believers, and communities deep in this rugged landscape. As COVID-19 forced Papua into lockdown, Joyce and her MAF teammates continued to find ways to serve. Joyce found reasons to be thankful even in this unprecedented challenge.\n\n“It may sound strange, but these trying times have enhanced my feeling of purpose here in Papua,” Joyce said in an email update on May 6. “With every flight I see first-hand how MAF is connecting isolated villages with vital supplies and medical care. This can’t be taken for granted in normal times, but especially now with all of the travel restrictions, the people remind us how thankful they are every time an airplane is able to land in their village.”\n\n“We Don’t Mourn as Those Who Have No Hope”\n\nOn May 12, 2020 at 6:27 a.m., Joyce took off from Sentani in an MAF Kodiak—a plane she had dreamed of flying since learning about mission aviation. Her cabin was filled with school supplies and COVID-19 rapid test kits, which she was delivering to a remote village.\n\nIn that moment, soaring through the beautiful Papuan sky, Joyce was doing exactly what God had called her to.\n\nFrom a seminary campus on the other side of the world where she first discovered her calling, to countless training flights in Idaho, to visits with churches across the country, to hours spent in prayer, and finally to arriving in Sentani—God walked with her each step of her journey.\n\nTwo minutes into her flight, Joyce sent out a distress call.\n\nLater, a search and rescue team recovered her body from Lake Sentani.\n\nBut Joyce wasn’t there.\n\nShe was where she had always been—in the arms of her Savior.\n\nHope Worth Sharing\n\nJoyce saw the impact the gospel had made in Papua. The transformation happening in isolated communities scattered across this vast island was evident to her.\n\n“The presence of God has given [the Papuan] people hope, a real hope that I share.”\n\nAnd she carried that hope with her whether she was touching down on a remote airstrip or settling into her IT desk.\n\n“Just two days before she went to be with the Lord, she shared how she was living her dream,” said Brock. “Her years of effort following God’s calling were being rewarded and rewarding others daily. Joyce was a light reflecting Jesus, and she will be deeply missed.”\n\nJoyce’s road to MAF was a long one and it was filled with challenges. But Joyce was always able to see past hardships to the hope that lay beyond them.\n\n“I am most grateful to personally know God, who has never forsaken me in my lowest times (as there have been many) and has repeatedly turned “mourning into dancing” (Ps 30:11) in ways I could not have brought about on my own,” Joyce said. “While I will always be excited to fly planes and work on computers, I am most excited to share the love of Jesus Christ by helping to transform other people’s deep discouragement and mourning into dancing and joy.”\n\nAs we mourn for Joyce, our tears, though tinged with sadness, are the same tears Joyce wept over the sick woman in her airplane—tears of hope.\n\nIn lieu of flowers, donations can be made to the Joyce Lin Memorial Fund, which will enable MAF to train Indonesian national staff in more technically advanced skills like maintaining and flying aircraft. The family will be informed of any donations made to the memorial fund. Cards and messages of condolence can be sent to the family via Derwood Bible Church, Attn: Lin Family, 16011 Chieftain Avenue, Derwood, MD 20855 or emailed to office@derwoodbiblechurch.org."}, {"url": "https://answersingenesis.org/kids/bible/world-missions/nate-saint/", "page_content": "by Avery Foley\n\non September 12, 2017\n\nNate Saint was born in 1923 to a Christian family dedicated to serving the Lord and living for him. Nate was a curious boy who loved airplanes and wanted to be a pilot, like his older brother. When he was 19 Nate signed up for the US Army to serve in World War II and learn to fly airplanes. But when a previous infection in his leg flared up, he was not allowed to fly. However, in his three years in the Army, he did learn a lot about airplanes and how to fix them.\n\nAfter he left the Army, a missionary asked Nate to come to Mexico to fix a badly damaged airplane. Nate went and decided to serve Christ by being a missionary pilot. He married his girlfriend, Marjorie, and headed for the South American country of Ecuador to open a new Missionary Aviation Fellowship station. Nate’s job was to fly missionaries into remote jungle villages and bring them supplies. This was a very dangerous job. But when a crash left Nate with a broken back and badly sprained ankle, he recovered and got right back to flying.\n\nThe supplies that Nate dropped off would often get caught in trees or broken as they fell from the airplane. So Nate invented a bucket drop system. By flying in tight circles a bucket containing supplies could be lowered from the airplane and the bucket would remain still so the missionaries could easily unload it. He also invented a dual injection engine to make flying safer. His inventions are still being used today.\n\nNate and four of his friends had a burden to reach a remote people group called the Aucas. These people were very dangerous, known for killing anyone who dared come into their territory. Using Nate’s bucket system, the missionaries spent three months sending gifts to the Aucas in an expression of friendliness. The Aucas started sending gifts back. The missionaries decided to land the plane on a sand bar and make contact with the Aucas. This would be Nate’s last flight. He and his friends were all killed by the Aucas’ spears.\n\nNate died serving the Lord and taking the gospel where it had never been taken before. But that’s not the end of the story. Nate’s sister, Rachel, along with Elisabeth Elliot, whose husband had also been killed by the Aucas, went back to the Aucas and shared the gospel with them. Because of the love they showed the tribal people, many believed in Jesus and were saved—including some of the very people who had killed Nate and his friends.\n\nThis is the reconstructed frame of Nate Saint's plane used in missionary work in Ecuador. It is currently on display at Mission Aviation Fellowship headquarters.\n\nNate’s son, Steve, joined his Aunt Rachel each summer in the jungle among the tribe that killed his dad. But because he understands the love and grace of God, Steve is friends with the very men who killed his dad and who are now his brothers in Christ. Steve and his sister were even baptized by several Auca believers in the river beside the place where their father died. Steve still lives among these people.\n\nNate’s death was not a waste. God used his and his friends’ deaths to help the gospel grow among the Aucas—the people they loved.\n\nFun Facts about Nate Saint\n\nNate had six brothers and one sister.\n\nNate’s grandfather was a successful inventor, just like Nate.\n\nAs a kid, Nate built an 8-foot sailboat and took apart a car engine just to put it back together again.\n\nLearn More"}, {"url": "https://maf.org/storyhub/for-his-purpose/", "page_content": "How God provided for and confirmed a young boy’s calling so he could serve the Congolese people\n\nBy Jennifer Wolf\n\nTwelve-year-old Jacob O’Brien walked through the double doors at MAF headquarters in Nampa, Idaho, with his junior high class. There in the lobby was the steel frame from Nate Saint’s airplane, recovered years after Saint and four other missionaries were martyred on “Palm Beach” in Ecuador.\n\nJacob knew the story of Nate Saint as part of MAF’s past, but until that tour in 2009, he hadn’t realized there was still a tangible need for pilots to serve overseas.\n\nHe already wanted to be a pilot, so when he found out he could serve God and love people by flying airplanes, he was thrilled.\n\n“From that point on, I was confident that’s what the Lord created me to do,” said Jacob.\n\nAbundant Provision\n\nJacob started praying for an airplane when he was 14 years old. Since his dad was an airline pilot and a flight instructor, it was Jacob’s dream to have his dad teach him how to fly. But you can’t just rent an airplane and bring along your own flight instructor, explained Jacob.\n\nThe family spent over a year making offers on aircraft in their price range, and they all fell through.\n\nThen one day, Jacob’s dad had finished his flights and was riding home on a return trip, still wearing his uniform. The woman seated next to him asked how long he had been with the airline, and were any of his kids interested in flying?\n\nWhen he told her his oldest was, she immediately whipped out a business card and wrote a name and phone number on the back.\n\n“You need to call Bob,” she said. “He’s going to want you to use his airplane to teach your kids how to fly.\n\n“Bob’s my husband,” she explained when he gave her a quizzical look.\n\nJacob’s dad did call Bob and was told: “We’ve got you on the insurance. We have keys being made. I’m so excited for you to use our airplane to teach your son how to fly!”\n\n“I-I don’t know what to say,” Jacob’s dad responded.\n\n“You mentioned to my wife, Linda, that you love the Lord,” said Bob. “Did you know that the Lord is able to do exceedingly abundantly beyond all that we ask or desire? This is God’s abundant provision for your son to learn how to fly.”\n\nJacob went on to get his private pilot’s license in that airplane.\n\n“That’s one of my favorite stories to tell people because it just stands as a pillar of God’s faithfulness in my life,” Jacob said.\n\nAfter high school, Jacob headed to Moody Aviation, where he met Tara, who also had a heart for missions. They were married, and, after graduating, they started the process to join MAF.\n\nCalibrations and Confirmations\n\nIn July of 2019, Jacob and Tara were at MAF’s U.S. headquarters, preparing for a maintenance internship.\n\nJacob completed his technical evaluation at that time, and they both went through candidacy classes. They renewed a friendship with another couple from Moody, Ben and Anna Samuelson, who were also preparing to serve with MAF.\n\nIn October, Jacob and Tara headed to Africa for their one-month internship with the MAF team in Kinshasa, in western Democratic Republic of the Congo (DRC).\n\n“I had lots of expectations going into it from what people told us … how the traffic was crazy and … I was just amazed to see how larger than life everything was there,” Jacob said. “As far as confirming calling, it was everything I expected.”\n\nEven the problems the couple encountered served to affirm their calling.\n\nTara, who spent many of her days at home with their 9-month-old daughter, says it was often dark and rainy. They lost power and their food spoiled in the fridge.\n\n“I had no food, no water, no electricity, and I wasn’t sure what to do,” said Tara. Is this what being a missionary is really like? she wondered.\n\nEven though she didn’t love the situation, Tara says she couldn’t imagine herself anyplace else.\n\n“I think that will be one of those moments that I look back on for my full time as a missionary, knowing, Where else would I be, Lord, besides exactly where you’ve told me to be?”\n\nShared Courage\n\nThe O’Briens returned to the U.S. and were officially accepted as MAF missionaries. They were assigned to the West DRC program. The Samuelsons had been assigned to the East DRC program. Once each couple had found enough prayer and financial partners to join their team, they were ready for the next step: language school.\n\nThe plan was for both families to go to school in France. But a month before they were supposed to leave, COVID-19 restrictions shut down that option.\n\n“We were all kind of shocked when the regional director recommended we relocate to Dakar, Senegal,” Jacob said.\n\nBut at least they knew they’d be going together.\n\nFrom the time the families boarded the same overseas flight to Dakar to the time they left the country for their assigned programs, they were practically inseparable.\n\n“They’ve been our sanity partners in a lot of interactions,” Jacob said.\n\nThe families lived in the same apartment building and saw each other daily. They learned how to get around a new city, how to grocery shop, what they could cook, and where to take the kids to play. They learned a new culture and a new language, with the challenge of parenting two young children each.\n\n“Our two-year-olds went to school together for the first time, so they’re really close,” Tara said. “It’s going to be kind of new for them to be apart.”\n\nTara was looking ahead to when they would say goodbye and leave for their MAF bases in January 2022.\n\nEven with all the hard goodbyes, first with their families in the states, and now this one—each of them knows in their heart it’s not without purpose.\n\nWhen Tara peeled off their family verse, Ephesians 3:20, from the wall of their Dakar apartment as they were packing, she knew this promise would continue to hold true in their new home.\n\nServing with Purpose\n\nEarlier this year, Jacob drove through heavy traffic until he reached his destination: the MAF WDRC hangar in Kinshasa. He was finally going to carry out the dream that God had planted in his heart nearly 12 years ago. Soon he would be flying the sick and injured, medical personnel, evangelistic teams, Bible translators, Sunday school trainers, and many more.\n\nYour compassionate support enables MAF teams in the DRC and around the world to bring help, hope, and healing to isolated people.\n\n*Photos courtesy of the O’Briens and Samuelsons.\n\nThis story appeared in the Vol. 2 2022 edition of FlightWatch. Read the entire issue here:"}]}