{"In 1950, Nate Saint returned to the United States and married Marj Saint.": [{"url": "http://missionaryportal.webflow.io/biography/nate-saint", "page_content": "Nathanael \"Nate\" Saint was an evangelical Christian missionary pilot to Ecuador. He was accompanied by four others: Jim Elliot, Pete Fleming, Ed McCully, and Roger Youderain. All five were killed while attempting to evangelize the Huaorani people through efforts known as Operation Auca.\n\nEarly Life\n\nNate Saint was born in 1923. When he was seven he took his first plane ride with his brother Sam, who would eventually become a commercial pilot for American Airlines. While in the airplane he discovered a love of flying.\n\n‍\n\nHis family was somewhat unusual. His brothers made a sleeping patio on the roof of their home, and his dad built a roller coaster in the backyard.\n\n‍\n\nWhen he joined the army he was stationed in Las Vegas NV, but was transferred to several other locations over the years. A leg injury from a sledding accident caused him some problems while he was in the army. About a year before he was discharged, he almost died while climbing a mountain in Yosemite National Park. After that incident he learned to live life to the fullest.[1]\n\n‍\n\nWhen Nate was asked by a friend to fix a plane somewhere in Mexico, he finally agreed. After he repaired the plane, he discovered a need for his skill in the field of mission-work and also a new awareness of the value of missions. After going to Wheaton College, Nate married Marjorie Farris (commonly called Marj) in 1948 and eventually moved to Shell Mera, Ecuador. Here, Nate built his family a house which would also serve as a guesthouse and a radio center with the other missionaries.[2]\n\nLife in Ecuador, Meeting the Huaroni\n\nIn September 1955, Nate was joined by his teammates, Jim Elliot, Ed McCully, Pete Fleming, and Roger Youderian. Saint finally found a Huaorani settlement while searching by air. To reach the tribe, Saint and the team lowered gifts to the Huaorani in a bucket tied to the plane.\n\n\n\n\n\nThe Huaorani were widely feared by other Ecuadorians, because they combined a desire to be left alone with a willingness to use force. They attacked and killed any intruders without provocation. Nevertheless, the tribe was excited on receiving the gifts and gave some gifts back.\n\n\n\n\n\nFinally, the missionaries decided to try to meet the Huaorani on the ground; and, on January 3, 1956, using the beach as a landing strip, they set up camp four miles from the Huaorani settlement.\n\n\n\n\n\nHow Nate Saint Died\n\nTheir initial contact was encouraging; however, on Sunday, January 8, 1956, the entire team was killed on the beach (known as \"Palm Beach\") when armed Huaorani met and speared them.[3] Nate Saint was the first of the five missionaries to be speared to death.\n\n\n\n\n\nSaint and the other four men became famous worldwide as a result. Life magazine published a 10-page photo essay on the story, which was also covered in Reader's Digest and many other publications. Today, a small school for missionary children in Shell, Ecuador, bears Nate Saint's name. After 51 years, the school has closed in 2017 due to falling enrollment.\n\n\n\n\n\nRachel Saint, Nate's sister, continued the mission efforts to the Huaorani, which eventually came to fruition. This resulted in many of these natives becoming Christians, including those who had killed Saint.[3]\n\n\n\n\n\nNate Saint's Family\n\nParents:\n\nLawrence Saint\n\nKatherine Saint\n\nSpouse:\n\nMarjorie Saint‍\n\nChildren:\n\nKathy Saint Drown\n\nSteve Saint\n\nPhilip Saint\n\nSiblings:\n\nRachel Saint\n\nSam Saint\n\nPhil Saint\n\nDan Saint\n\nDave Saint\n\nSteve Saint\n\nBen Saint\n\nRecommended Resources on Nate Saint\n\nNate Saint Movies\n\nNate Saint Books\n\nNate Saint Quotes\n\n\"People who do not know the Lord ask why in the world we waste our lives as missionaries. They forget that they too are expending their lives... and when the bubble has burst they will have nothing of eternal significance to show for the years they have wasted.\" “Son, we can’t shoot the Waodani. They’re not ready for heaven... we are.” \"When life's flight is over, and we unload our cargo at the other end, the fellow who got rid of unnecessary weight will have the most valuable cargo to present the Lord.\" \"If God would grant us the vision, the word sacrifice would disappear from our lips and thoughts; we would hate the things that seem now so dear to us; our lives would suddenly be too short, we would despise time-robbing distractions and charge the enemy with all our energies in the name of Christ. May God help us ourselves by the eternities that separate the Aucas from a Comprehension of Christmas and Him, who, though he was rich, yet for our sakes became poor so that we might, through his poverty, be made rich.\" \"I would rather die now than to live a life of oblivious ease in so sick a world.\" \"As we have a high old time this Christmas may we who know Christ hear the cry of the damned as they hurtle headlong into the Christless night without ever a chance. May we be moved with compassion as our Lord was. May we shed tears of repentance for these we have failed to bring out of darkness. Beyond the smiling scenes of Bethlehem may we see the crushing agony of Golgotha.\" \"It was traumatic but exhilarating to feel what my father felt. I remember the ache of the separation from the people I loved. I would never go back to that time. Yet the things I learned benefited my life.\"\n\n\n\n\n\nFun Facts About Nate Saint\n\nNate went on his first plane ride with his brother Sam when he was seven years old. Rachel Saint lived with the Huaroni two years after he died. She served as a missionary to Peru before later joining Nate in Ecuador. Nate had six brothers and one sister. Nate’s father, Lawrence Saint, was a famous stain-glass artist, who worked on the Washington National Cathedral. His father was also a painter, specializing in landscape painting and silhouette cutting. As a kid, Nate built an 8-foot sailboat and took apart a car engine just to put it back together again.\n\nSources\n\nThis information is provided under the Wikipedia Creative Common License."}, {"url": "https://www.baptistpress.com/resource-library/news/documentary-explores-56-slayings-of-missionaries-to-ecuador/", "page_content": "DALLAS (BP)–The Waodani Indians of Ecuador were killing six of every 10 of their tribesmen when American missionaries entered their isolated community in January 1956. Anthropologists say the tribe, identified then as the Aucas, had one of the most violent cultures ever documented and was headed toward extinction.\n\nMissionary pilot Nate Saint had located the tribe in circling the Amazon Basin jungle. Wishing to establish contact, Saint hoped a slow, circular flying pattern would allow him to stabilize a long rope and basket dropped from the airplane down to the tribe. A difficult maneuver, it worked, and over 11 weeks in late 1955, Saint and fellow missionaries Jim Elliot, Peter Fleming, Ed McCully and Roger Youderian lowered gifts to the Waodani. When the Waodani returned the favor by sending a bird up in the basket, the missionaries sensed opportunity.\n\nOn Jan. 7, 1956, the five men left their young wives at base camp and landed their plane on a sandbar near the Waodani, making face-to-face contact for the first time.\n\nThe next day, the tribesmen speared them dead.\n\nThe killings made worldwide news at the time. Life magazine devoted a spread to the story on Jan. 30, 1956, and a 1957 book, “The Gates of Splendor,” brought the story to millions of readers from the Christian perspective of Elisabeth Elliot, who was widowed by the killings.\n\nAlmost 50 years later, the tale — with updated material chronicling the tribe’s radical change — has been retold in a 40-minute documentary, “Beyond the Gates of Splendor,” available free of charge to churches, schools and para-church organizations.\n\nA full-length, 90-minute version of the documentary debuted on the big screen in a handful of cities this year and will be available in retail stores on DVD in September, said Randy Swanson, a spokesman for Every Tribe Entertainment (www.everytribe.com), the company that produced it.\n\nThe documentary precedes a full-length theatrical movie, “End of the Spear,” which is in final production and will debut in theaters in early 2006 near the 50th anniversary of the killings, Swanson said.\n\nThe documentary focuses on the missionaries and their families, the Waodani tribesmen and the unlikely story of courage and redemption when two of the missionaries’ widows and one of the missionaries’ sisters and — years later –— the son, daughter-in-law and grandchildren of Nate Saint settle among the tribe.\n\nDescribed by its producer, Kevin McAfee, as a “pre-evangelism” tool, the documentary profiles the Waodani from the perspectives of two anthropologists who studied the tribe. The film also probes the backgrounds, motivations and dreams of the missionaries and their families before and after the killings through recovered 16 mm home movies, still photos and interviews with widows, family members and members of the search crew.\n\nTwo of the killers, Mincaye and Kimo, became Christians and are featured in the documentary via interviews with translators, who relate Mincaye’s humorous observations about American culture after Mincaye visited the United States in the late 1990s with Steve Saint, whose father Mincaye murdered.\n\nThe home movies help document several of the missionaries’ time together at Wheaton College, their courtships and a Christmas celebration just before the murders at the missionaries’ home base down river.\n\nMcAfee, a member of the Oklahoma City-area Council Road Baptist Church in Bethany, said during a Dallas screening that the film aims to give insights into the missionaries as they sought to reach the Waodani –- food for thought that perhaps can be discussed over coffee at Starbucks afterward, he said.\n\nMcAfee also is musical director of the film. His work ranges from dramatic orchestral sounds to Lynyrd Skynyrd’s “Sweet Home, Alabama” during one of documentary’s lighter moments.\n\nBeyond the Gates of Splendor received the Crystal Heart Award at the Heartland Film Festival and “Audience Favorite” at the Palm Beach Film Festival.\n\nMart Green, founder of Mardel, an Oklahoma City-based Christian retail chain, is founder and chief executive officer of Every Tribe Entertainment, which bills itself as “committed to telling significant stories on film in the highest quality possible.”\n\nIn producing its first full-length project, Every Tribe hired McAfee along with Bill Ewing, a former vice president at Columbia Tri-Star to be company president, and Jim Hanon, a Cannes Film Festival award-winner, as a writer and director.\n\n–30–\n\nChurches may order “Beyond the Gates of Splendor” by calling 1-800-695-9847 or by visiting the www.everytribe.com."}, {"url": "https://prabook.com/web/nate.saint/2095622", "page_content": "Nate Saint\n\naviator\n\nAugust 30, 1923 (age 32) Hershey, Pennsylvania, Pennsylvania, United States of America\n\nWhile in the airplane he discovered a love of flying. His family was somewhat unusual. When he joined the army he was stationed in Las Vegas Nevada, but was transferred to several other locations over the years. A leg injury from a sledding accident caused him some problems while he was in the army. About a year before he was discharged, he almost died while climbing a mountain in Yosemite National Park. After that incident he learned to live life to the fullest. In September 1955, Nate was joined by his teammates, Jim Elliot, Editor McCully, Pete Fleming, and Roger Youderian. Saint finally found a settlement while searching by air. To reach the tribe, Saint and the team lowered gifts to the Huaorani in a bucket tied to the plane. The Huaorani were widely feared by other Ecuadoreans, because they combined a desire to be left alone with a willingness to use force. They attacked and killed any intruders without provocation. Nevertheless, the tribe was excited on receiving the gifts and gave some gifts back. Finally, the missionaries decided to try to meet the Huaorani on the ground. And, on January 3, 1956, using the beach as a landing strip, they set up camp four miles from the Huaorani settlement. Their initial contact was encouraging. However, on Sunday, January 8, 1956, the entire team was killed on the beach (known as \"Palm Beach\") when armed Huaorani met and speared them. Life magazine published a 10-page photo essay on the story, which was also covered in Reader\"s Digest and many other publications. Today, a small school for missionary children in Shell, Ecuador, bears Nate Saint\"s name. Rachel Saint, Nate\"s sister, continued the mission efforts to the Huaorani, which eventually came to fruition. In 1966, Marjorie (Marj) Farris Saint married Abe Van Der Puy, President of HCJB World Radio. Abe died in 2003, and Marj died in 2004, from cancer. She is buried in Hillcrest Memorial Gardens, south of Ocala, Florida. Nate\"s older son, Steve Saint, spent time as a child visiting his missionary family members and friends and getting to know the Huaorani. Steve was baptized in the Name of Jesus Christ by Mincaye, who was the very man who killed his father but later converted to Christ. Steve Saint now works with the Huaorani people and travels around the world, preaching the gospel, often accompanied by Mincaye. A documentary based on the story, Through the Gates of Splendor, was released in 2005. The following year, a feature film, End of the Spear, was released on January 20, a week and a half after the 50-year anniversary of the killings. Steve Saint also helped write Jungle Pilot, based on his father\"s diary about his time in Ecuador and work with the Huaorani Indians."}, {"url": "http://www.worldheritage.org/articles/Nate_Saint", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://blog.eastwest.org/blog/missionary-mindset-nate-saint", "page_content": "The Missionary Mindset series looks into the lives of notable missionaries to provide valuable insights and inspiration. Read the last post in the Missionary Mindset series here.\n\nGod uses the smallest details, like the interests and abilities of one man, to bring about extraordinary changes in the lives of many. That’s the story of Nate Saint—a man who soared to great heights to share the gospel in one of the most dangerous parts of the world.\n\nNate’s Background\n\nNate Saint was born to Lawrence and Katherine Saint in 1923. The Saint family was one of faithful Christians who were deeply devoted to living in complete surrender to Jesus Christ. Because of this, Nate grew up with a firm foundation of faith and a lasting conviction to serve the Lord.\n\nWhen Nate was just seven years old, he took his very first flight in his brother’s airplane. A spirit of adventure was instantly instilled in Nate, and he knew just what he wanted to do with his life. He wanted to fly like his brother. Little did Nate know how the Lord would later use his love for flying.\n\nAt 19 years old, Nate joined the armed services to pursue Air Corps training. He desired to serve his country through aviation, and the talent to do so. Though his time in the army took him all over the United States and even across the globe, Nate was never one to lose his spiritual grounding. It was the call of Christ that gave Nate a sense of purpose.\n\nHowever, that purpose was questioned as Nate faced an unexpected trial. While training with the Air Corps, a recurring infection Nate had dealt with in the past came back once again. This infection was quickly diagnosed, and Nate was dismissed from the Air Corps … crushing his dreams of becoming a fighter pilot.\n\nIt was in this time of hopelessness that the Lord began revealing a much bigger purpose for Nate’s life.\n\nWith more time on his hands, Nate directed his energy towards airplane mechanics. Nate discovered that this skill came naturally to him as he learned to fix airplanes in difficult—if not impossible—circumstances.\n\nNate’s Legacy\n\nAfter marrying his sweetheart, Marjorie Farris, the Lord began opening doors for Nate. Instead of serving just the United States, Nate was presented with the opportunity to serve the nations by becoming a full-time missionary pilot. Without second thought, he committed to this position. Nate and his wife packed up their lives to halfway across the globe to Ecuador.\n\nThe work there was plenty and Nate was equipped and ready to help fly missionaries to various destinations in the jungle and deliver supplies and resources to missionary families.\n\nHowever, in 1948, Nate set off to make another one of his deliveries. Just minutes after a perfect takeoff, Nate knew something was amiss. His plane began to rapidly descend, and crashed in Quito, Ecuador. Even after months spent in the hospital and bed-ridden at home, Nate’s desire to reach the lost for Christ kept him going.\n\nHe returned to his work as a pilot more confident than ever.\n\nIn his faithful and fearless service, Nate helped pioneer missions in hard to reach areas, namely the thick of the jungle. What would take 40 days of land travel, Nate could accomplish within in a matter of hours. This inspired Nate to invent more effective ways delivering supplies and reaching the lost. Among these inventions was the famous “bucket dropping system,” that missionary pilots still use to this day.\n\nThis very system was the backbone to “Operation Auca.”\n\nWhile flying one day, Nate noticed a village he had never before seen. This village was home to the Indian tribe known as the Aucas—a tribe characterized by their violent killing patterns. Despite the prevalent dangers, Nate, along with four others—Jim Elliot, Pete Fleming, Ed McCully, and Roger Youderian—set out to bring the good news of Jesus to the unreached.\n\nFor months, these five men flew over the village and lowered gifts to the Auca Indians as a sign of friendly contact. As the gifts were well received by the tribe, the men began preparation for face-to-face contact.\n\nOn January 8, 1956, Nate flew with the four others to Palm Beach—an area near the Auca village. Despite hopeful initial meetings, all five men were martyred on the beach.\n\nThankfully, the story does end there. Rachel Saint—Nate’s sister—as well as Elisabeth Elliot—Jim’s wife—continued their loved ones’ mission work. By the grace of God and the power of the Holy Spirit, these women were able to bring the good news of Christ to the Auca tribe. Many in the tribe were saved, including six of the killing party.\n\nMore Inspiration from Nate\n\n“When life's flight is over, and we unload our cargo at the other end, the fellow who got rid of unnecessary weight will have the most valuable cargo to present the Lord.”\n\n“If God would grant us the vision, the word sacrifice would disappear from our lips and thoughts; we would hate the things that seem now so dear to us; our lives would suddenly be too short, we would despise time-robbing distractions and charge the enemy with all our energies in the name of Christ. May God help us ourselves by the eternities that separate the Aucas from a Comprehension of Christmas and Him, who, though he was rich, yet for our sakes became poor so that we might, through his poverty, be made rich.”\n\n“And people who do not know the Lord ask why in the world we waste our lives as missionaries. They forget that they too are expending their lives... and when the bubble has burst they will have nothing of eternal significance to show for the years they have wasted.”\n\nRead the next Missionary Mindset here."}, {"url": "https://www.findagrave.com/memorial/39005652/marjorie-van_der_puy", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "http://justus.anglican.org/resources/bio/74.html", "page_content": "\n\n\n\nIn the dense rain-forests of Ecuador, on the Pacific side of the Andes Mountains, lives a tribe of Indians who call themselves the Huaorani (\"people\" in their language, Huao), but whose neighbors have called them the Aucas (\"savages\" in Quechua). For many generations they have been completely isolated from the outside world, disposed to kill any stranger on sight, and feared even by their head-hunting neighbors, the Jivaro tribe.\n\nIn 1955, four missionaries from the United States who were working with the Quechas, Jivaros, and other Indians of the interior of Ecuador became persuaded that they were being called to preach the Gospel to the Huaorani as well.\n\nNate Saint was 32 years old (born 1923), and devoted to flying. He had taken flying lessons in high school and served in the Air Force in Wwii. After the war, he enrolled in Wheaton College to prepare for foreign mission work, dropped out to join the Missionary Aviation Fellowship, established a base at Shell Mera (an abandoned oil exploration camp in Ecuador) in September 1948, and flew short hops to keep missionaries supplied with medicines, mail, etc. Once his plane crashed, but a few weeks later he returned to work in a cast from his neck to his thighs. He was married to Marjorie (maiden name??).\n\nThe other threee, Ed McCully, Jim Elliot, and Peter Fleming, all Plymouth Brethren, came to Ecuador in 1952 to work for CMML (Christian Missions in Many Lands).\n\nEd McCully was ?? years old (born 19??). He had been a football and track star at Wheaton College, and president of senior class. After Wheaton, he enrolled at Marquette to study law, but dropped out to go to Ecuador. He and his wife Marilou (maiden name?) worked with the Quechuas at Arajuno, a base near the Huaorani. Half a dozen Quechuas had been killed at the base by Huaorani in the past year.\n\nJim Elliot was 28 years old (born 1927), an honors graduate of Wheaton College, where he had been a debater, public speaker, and champion wrestler. In Ecuador, he married Elisabeth Howard. They did paramedic work, tending broken arms, malaria, snakebite. The taught sanitation, wrote books in Quechua, and taught literacy.\n\nPeter Fleming was 27 years old (born 1928), from the University of Washington, an honor student, a linguist, married to Olive (maiden name?). They ran a literacy program among the Quechuas.\n\nNate and Ed found a Huaorani settlement from the air in late September, 1955. Nate made four more flights on Thursday, 29 September, and found a settlement only 15 minutes from their station. They told Jim and Pete, and the four planned their strategy. They would keep the project secret from everyone but their wives, to avoid being joined by adventurers and the press, with the chance that someone not dedicated to the mission would start shooting at the first sign of real or imagined danger, and destroy the project. They had one language resource, a Huaorani girl, Dayuma, who had fled from her tribe years earlier after her family was killed in a dispute, who was now living with Nate's sister Rachel, and who spoke both Huao and Quechua. From her they learned enough of the language to get started. They would fly over the village every Thursday and drop gifts as a means of making contact and establishing a friendly relation. Eventually they would try for closer contact. Nate had discovered that, if he lowered a bucket on a line from the plane, and flew in tight circles, the bucket remained almost stationary, and could be used to lower objects to the ground. He had devised a mechanism to release the bucket when it touched down.\n\nOn Thursday 6 October, one week after locating the village, they dropped an aluminum kettle into an apparently deserted village. On the next flight, several Huaorani were waiting, and they dropped a machete. On the third flight, they dropped another machete to a considerably larger crowd. Beginning with the fourth flight, they used a loudspeaker system to call out friendly messages in Huao. Soon the Huaorani were responding with gifts of their own tied to the line: a woven headband, carved wooden combs, two live parrots, cooked fish, parcels of peanuts, a piece of smoked monkey tail.... They cleared a space near their village, and built platforms to make the exchanges easier.\n\nAfter three months of air-to-ground contact, during which they made far more progress than they had hoped, the missionaries decided that it was time for ground contact--that they could not keep their activities secret much longer, and that delay risked a hostile encounter between the Huaorani and some third party. They decided that the expedition needed a fifth man, and so brought in Roger Youderian (married to Barbara ???), from rural Montana, a former paratrooper who had fought in the Battle of the Bulge (major German offensive in Belgium in the last stages of Wwii), and had been in General Eisenhower's honor guard. Roger had been working with the Jivaros, and was thoroughly at home in the jungle, accustomed to living like the Jivaros, and blessed with acute survival instincts. They located a beach that would serve as a landing strip, about four miles from the village, and decided to go in on Tuesday 3 January 1956. After some discussion, they decided to carry guns, having heard that the Huaorani never attacked anyone who was carrying a gun, and having resolved that they would, as a last resort, fire the guns into the air to ward off an attack, but would shoot no-one, even to save their own lives.\n\nOn Tuesday they flew in and made camp, and then flew over the village to invite the Huaorani to visit them. The first visitors showed up on Friday, a man, a woman, and a teen-aged girl. They stayed for several hours in apparent friendliness, and then left abruptly. On Saturday, no one showed, and when the plane flew over the village, the Huaorani seemed frightened at first, but lost their fright when presents were dropped. On Sunday afternoon, 8 January 1956, at about 3pm, all five missionaries were speared to death at their camp. A search party the next day found no signs of a struggle, and the lookout who was to be stationed in a tree-house overlooking the camp at ground level had come down, so it appeared that the meeting had originally seemed friendly, and that the attack had been a surprise. Ed McCully's body was seen and identified, but was swept away by the river and not recovered. The other four, at the request of their wives, were buried at the site of the camp where they had died.\n\nThe effort to reach the Huaorani was not abandoned but rather intensified. Within three weeks, Johnny Keenan, another pilot of the Ecuador Mission, was continuing the flights over the Auca village. More than twenty fliers from the United States promptly applied to take Nate's place. More than 1000 college students volunteered for foreign missions in deirect response to the story of the Five Martyrs. In Ecuador, at the mission stations, attendance by Indians at schools and church services reached record levels, and the number of conversions skyrocketed. A Jivaro undertook to go at once to another Jivaro tribe that had been at war with his own tribe for years, bearing the Christian message, and his visit brought peace between the two tribes. Truly, as Tertullian said 1800 year ago, the blood of the martyrs is the seed of the Church.\n\nIn less than three years, Rachel Saint (sister of Nate Saint) and Elisabeth Elliot (widow of Jim Elliot) had not only renewed contact but had established permanent residence in a Huarani settlement, where they practised basic medicine and began the process of developing a written form of the language.\n\nWhy did the Huaorani suddenly turn hostile? Much later, one of the Huaorani who had helped to kill the five martyrs explained that the tribe, who had had almost no contact with outsiders that did not involve killing or attempted killing on one side or another, wondered why the whites wanted to make contact with them; and while they wanted to believe that their visitors were friendly, they feared a trap. After the killings, they realized their mistake. When they were attacked, one of the missionaries fired two shots as warnings, and one shot grazed a Huaorani who was hiding in the brush, unknown to the missionaries. It was therefore clear that the visitors had weapons, were capable of killing, and had chosen not to do so. Thus, the Huaorani realized that the visitors were indeed their friends, willing to die for them if necessary. When in subsequent months they heard the message that the Son of God had come down from heaven to reconcile men with God, and to die in order to bring about that reconciliation, they recognized that the message of the missionaries was the basis of what they had seen enacted in the lives of the missionaries. They believed the Gospel preached because they had seen the Gospel lived.\n\nPRAYER (traditional language):\n\nAlmighty God, who didst call thy faithful servants Nate Saint, Ed McCully, Jim Elliot, Peter Fleming, and Roger Youderian to be witnesses and martyrs to the Huaorani peoples in the rain forests of Ecuador, and by their labors and suffering didst raise up a people for thine own possession: Pour forth thy Holy Spirit upon thy Church in every land, that by the service and sacrifice of many, thy holy Name may be glorified and thy kingdom enlarged; through Jesus Christ our Lord, who liveth and reigneth with thee and the Holy Spirit, one God, for ever and ever.\n\nPrecious in thy sight, O Lord, is the death of thy saints, Whose faithful witness, by thy providence, hath its great reward: We give thee thanks for thy martyrs Nate Saint, Ed McCully, Jim Elliot, Peter Fleming, and Roger Youderian, who purchased with their blood a hearing for the Gospel among the forest-dwellers of Ecuador, especially the Huaorani people, and for their wives, who shared with them in their work and witness; and we pray that with them we also may obtain the crown of righteousness which is laid up for all who love the appearing of our Savior Jesus Christ; who liveth and reigneth with thee and the Holy Spirit, one God, for ever and ever.\n\nPRAYER (contemporary language):\n\nAlmighty God, who called your faithful servants Nate Saint, Ed Mccully, Jim Elliot, Peter Fleming, and Roger Youderian to be witnesses and martyrs to the Huaorani peoples in the rain forests of Ecuador, and by their labors and suffering raised up a people for your own possession: Pour forth your Holy Spirit upon your Church in every land, that by the service and sacrifice of many, your holy Name may be glorified and your kingdom enlarged; through Jesus Christ our Lord, who lives and reigns with you and the Holy Spirit, one God, for ever and ever.\n\nPrecious in your sight, O Lord, is the death of your saints, Whose faithful witness, by your providence, has its great reward: We give you thanks for your martyrs Nate Saint, Ed McCully, Jim Elliot, Peter Fleming, and Roger Youderian, who purchased with their blood a hearing for the Gospel among the forest-dwellers of Ecuador, especially the Huaorani people, and for their wives, who shared with them in their work and witness; and we pray that with them we also may obtain the crown of righteousness which is laid up for all who love the appearing of our Savior Jesus Christ; who lives and reigns with you and the Holy Spirit, one God, for ever and ever.\n\n\n\n\n\nUnless otherwise indicated, this biographical sketch was written by James E. Kiefer and any comments about its content should be directed to him. The Biographical Sketches home page has more information."}, {"url": "https://peoplepill.com/people/steve-saint/", "page_content": "Stephen Farris Saint (born January 30, 1951) is an Ecuadorian-born business entrepreneur, pilot, and author. He is known for being the son of Nate Saint, a famous missionary pilot, as well as for his own work among indigenous tribes.\n\nEarly life\n\nSteve was born in Quito, Ecuador, at a mission hospital. He was the second of Nate and Marj Saint's three children. He has an older sister, Kathy, and a younger brother, Philip. The family lived in Quito where his father was a missionary pilot with Mission Aviation Fellowship. In 1956, his father and four other missionaries were killed by Waodani Indians during Operation Auca, during an effort to make peaceful contact with them.\n\nAfter the death of Saint's father, the family moved to Quito where Saint attended school. It was during this time that his aunt, Rachel Saint, and Elisabeth Elliot successfully made peaceful contact with the Waodani and were living with them in the jungle. At 10 years of age, Saint first went to live with the Waodani, staying with them during the summers. He learned about living in the jungle, and also developed relationships with many members of the tribe. In June 1965, \"Babae\", as he was called by the tribe, was baptized in the Curaray River by Kimo and Dyuwi, two of his father's killers who had since converted to Christianity.\n\nLife in the United States\n\nAfter graduating from Alliance Academy in Quito, Steve Saint moved to the United States to attend Wheaton College where in 1973 he received a Bachelor of Arts degree in economics. Soon after graduation, he returned to Ecuador and worked for a time as a tour guide. It was there that he met and married his wife Virginia Lynn Olson (known as Ginny) who was from Minnesota and visiting Ecuador on a short-term mission team. Shortly after the birth of their first child, the Saints returned to the United States and lived in Minnesota where Saint began a successful career as a businessman. They later moved to Ocala, Florida.\n\nReturn to Ecuador\n\nIn 1994, Rachel Saint died in Ecuador after spending 36 years with the Waodani. Saint immediately traveled to Ecuador to bury her. It was then that the Waodani tribe who had known Saint as a child asked him to move his family down to live with them. After talking the decision over with his family, he accepted the tribe's invitation, moving to the jungle in 1995. Saint worked with the Waodani to improve their living conditions by building a community center and develop a desperately needed economy.\n\nLater life\n\nSaint left Ecuador in 1996, feeling that his continued presence in the tribe would hinder their progression towards self-independence. He has, however, made several subsequent trips, and continued to work with the tribe. On one such trip, he was helping a group of Waodani Indians put together their own airplane in Shell. A group of Quechua Indians approached him and asked why they could not build an airplane for their tribe. Saint replied that they could, and this was when Saint discovered the need for a global effort aimed at teaching practical skills to indigenous people. Shortly later he founded the Indigenous People's Technology and Education Center, Inc. (I-TEC) whose projects include an airworthy flying car, the I-Fly Maverick. As of 2010 Saint was seeking backing for commercial production.\n\nSaint appeared in and narrated the 2004 documentary film Beyond the Gates of Splendor. In 2005 he published his memoirs, a book titled End of the Spear. In 2006 there was a major film adaptation of the book, and Saint was heavily involved in the production process. He was also the stunt pilot who flew the replica of his father's PA-14 in the film.Template:See the book Walking His Trail, ISBN 978-1-4143-1376-4.\n\nHe has also authored other books including Walking His Trail.\n\nSaint has been especially close to Mincaye, one of the Waodani tribesmen who killed his father. He and Mincaye have made several appearances together in television interviews and at Christian concerts throughout the world. Steve now often visits churches to talk about his life.\n\nJune 2012 injury\n\nOn June 13, 2012, Saint was seriously injured by a falling piece of equipment while testing it. He was partially paralyzed from the neck down and was scheduled for surgery on June 20, 2012 to relieve pressure on his spine. By September 2012 recovery was well on its way. A message on his Facebook page states that he was back to work, writing newsletters by May 2013.\n\nFamily\n\nThe Saints have four children — Shaun, Jaime, Jesse, and Stephenie. Shaun is a medical doctor, Jaime works for I-TEC and has six daughters, and Jesse owns Saint Aviation and has 10 children. Stephenie briefly attended the University of Florida, but died in the summer of 2000 of a sudden cerebral hemorrhage.\n\nToday, Steve and Ginny live in Ocala, Florida, and continue to make regular trips to Ecuador.\n\nWorks\n\nBooks\n\nThe Great Omission: Fulfilling Christ's Commission Completely (2001). ISBN 1-57658-216-7\n\n(2001). ISBN 1-57658-216-7 End of the Spear (2005). ISBN 0-8423-8488-X\n\n(2005). ISBN 0-8423-8488-X Walking His Trail: Signs of God Along the Way (2007). ISBN 978-1-4143-1376-4\n\nArticles\n\nContributions\n\nJungle Pilot: The Story Continues (1997), epilogue to the updated edition of Jungle Pilot: The Gripping Story of the Life and Witness of Nate Saint, Martyred Missionary to Ecuador by Russell T. Hitt, (1957).\n\n(1997), epilogue to the updated edition of by Russell T. Hitt, (1957). List of books by John Piper|Suffering and the Sovereignty of God (2006), by John Piper.\n\nOther sources"}, {"url": "https://www2.wheaton.edu/bgc/archives/exhibits/Ecuador1956/10%20Who's%20Who.htm", "page_content": "Brief Descriptions of People Mentioned in the\n\nCaptions or the Documents in This Exhibit\n\nCornell Capa. Professional photojournalist on assignment for Life magazine. His photos and coverage played a very large part in the international telling of the Waorani/missionary story . Bill Cathers. Wheaton graduate (class of 1950) who, with Jim Elliot and Ed McCully, broadcast the evangelistic radio program The March of Truth from Chester, Illinois in 1950-1951. Dawa. Waorani woman, wife of Kimo. Assisted Elisabeth Elliot with Wao language learning. Herbert Elliot. Jim Elliot’s brother, who was a Plymouth Brethren missionary for 50 years in Peru . Kenneth Fleming. Brother of Peter Fleming and missionary to the Zulu people in South Africa, later a professor at Emmaus Bible Institute in Iowa . Olive Fleming. Wife of Peter Fleming and Plymouth Brethren missionary to Ecuador. Eventually returned to the United States. Later married to Walter Liefeld. Gikita. Waorani man, leader of the group that killed the missionaries on Palm Beach. He later became a Christian and a leader in the Waorani church . Gimari. Young Waorani woman, sister of Nampa and Dayuma, who was one of the three people from the tribe to make a friendly first-contact with the five missionaries on Palm Beach on January 6, 1956. The missionaries nicknamed her Delilah. Elizabeth Green. Pilot during World War II, one of the founders of Missionary Aviation Fellowship, and Nate Saint’s first contact with the organization. Ron Harris. Plymouth Brethren worker in Mexico with whom Jim Elliot spent a week in 1947, learning about the missionary life . Gerald and Jane Hawthorne. Jane was Jim Elliot’s sister. The Hawthornes lived in Wheaton, Illinois, where Gerald taught at Wheaton College. Russell Hitt. Evangelical author and journalist. Author of the Nate Saint biography, Jungle Pilot. David Howard. Brother of Elisabeth Elliot, brother-in-law and Wheaton College roommate of Jim Elliot. Howard traveled to Ecuador immediately after the killings to be with his sister. Philip Howard, Sr. Father of Elisabeth Howard Elliot and editor of the Sunday School Times, which gave a great deal of coverage to the killing of the five missionaries and later development of Christianity among the Waorani. Dr. Oswaldo Hurtado . President of Ecuador, 1981-1984 . Ipa (also Epa) . A Waorani woman, the oldest wife of Naenkiwi. Clarence W. Jones. Co-founder of the missionary short wave radio station HCJB in Quito, Ecuador. He was prominent in broadcasting the news about the deaths of the five men in 1956 and the continuing development of the story. Rosi Jung. Colleague of Catherine Peeke and another key person in the translating the New Testament in Wao. John Keenan. Pilot with Missionary Aviation Fellowship who worked closely with Nate Saint and the other four men in planning “Operation Auca.” After the murder of the missionaries, he flew over their camp, worried because they had not checked in at their regular time by radio. Kimo. A Waorani man, one of the men who attacked and killed the missionaries at Palm Beach. He was one of the first converts to Christianity among the Waorani. He traveled with Komi and Rachel Saint to Berlin, Germany in 1966 to attend the World Congress on Evangelism and give his testimony. Komi. A Waorani man, president of the village of Toñampade and husband of Dayuma. He attended the 1966 World Congress on Evangelism with Kimo and Rachel Saint . Mark Lee. Professor of drama and rhetoric at Northwestern Schools in Minneapolis, Minnesota. He had Roger Youderian as a student . Hobey E. Lowrence. One of the founders of Mission Aviation Fellowship and one of its leaders in the 1950s. Marilou McCully. Wife of Ed McCully, mother of Steve, Mike and Matt, and Plymouth Brethren missionary to Ecuador. After Ed’s death, she ran a home for missionary children in Quito for several years before returning to the United States . T. E. McCully Sr. Father of Ed McCully. Mankamo (also Mankamu, Mankimo). Wife of Gikita. She and Mintaka left the Waorani and lived in Arajuno, Ecuador, where she met Elisabeth Elliot. She and Mintaka went back to the Waorani in 1958 and played a major part in inviting Elisabeth Elliot to come and live among her people. Minkaye (also Mincayi, Minkayani). A Waorani man, one of the men who attacked and killed the missionaries at Palm Beach. Later one of the killers of Naenkiwi. He later became a Christian. He played a large part in Steve Saint’s 2006 film, The End of the Spear.\n\n\n\nMintaka. Older Waorani woman, sister of Gikita. She was one of the three people from the tribe to make first contact with the five missionaries on Palm Beach on January 6, 1956. Later she and Mankamo left the Waorani and lived in Arajuno, Ecuador, where they met Elisabeth Elliot. She went back to the Waorani in 1958 and played a major part in inviting Elliot to come and live among her people. Nampa. Waorani man, brother of Dayuma and Gimade. He was one of the six men who attacked the missionaries at Palm Beach. He was wounded in the attack and either died from that wound or died in a hunting accident a year later. Naenkiwi. Waorani male. He was one of the three Waorani who visited the missionaries on January 6. He later falsely told a party of Waorani that the missionaries had attacked their visitors, and thus precipitated the killing of the five men. Naenkiwi was later killed by other members of his tribal group. Nimonka. A Waorani man, one of the men who attacked and killed the missionaries at Palm Beach. Later, one of the killers of Naenkiwi . Harold John Ockenga. The pastor of Park Street Church in Boston, Massachusetts, and a well-known evangelical leader. J. Grady Parrot. President of Mission Aviation Fellowship in 1956 . Marj Saint. Wife of Nate Saint, mother of Steve, and a Mission Aviation Fellowship worker. She later married Abe Van der Puy. Rachel Saint. Missionary with Wycliffe Bible Translators, later independent. She was the sister of Nate Saint and established a bond with Dayuma in the mid-1950s, after Dayuma fled her tribe. She took Dayuma to the United States in 1957-1958. Later, she went with Elisabeth and Valerie Elliot to live with the Waorani in 1958 and continued to do so for the rest of her life. In 1966, she went with Kimo and Komi to the World Congress on Evangelism in Berlin, Germany. She did the first translation of the Gospel of Mark into Wao.\n\n\n\nSamuel Saint. Brother of Nate Saint. He acted as the liaison and business agent of the five widows in the United States . Robert Savage. Missionary to Ecuador who served as program director for the missionary short-wave station HCJB in Quito, Ecuador. John Smart. Editor of The Fields, the mission magazine of the Plymouth Brethren Assemblies . Clyde Taylor. Executive Director of the Evangelical Foreign Mission Association and one of the trustees of the Five Missionary Martyrs Fund. Wilfred Tidmarsh. Plymouth Brethren missionary in Ecuador who was somewhat a mentor to Jim Elliot, Ed McCully and Peter Fleming . Umpurae (or possibly Ompodae). Waorani woman, wife of Minkaye. Assisted Elisabeth Elliot with the Wao language. Abe Van der Puy. Head of the Foreign Missionary Fellowship in Ecuador in 1956 and staff member of HCJB short wave radio station. He was deeply involved in broadcasting the story of the five men’s deaths immediately after the event. He was also credited with the article that appeared in Reader’s Digest in August 1956, although it was essentially written by a Digest editor. Jack Wyrtzen. Prominent American Fundamentalist evangelist and broadcaster . Barbara Youderian. Wife of Roger Youderian and Gospel Missionary Union worker in Ecuador. Yowe (also Yowi or Dyuwe). A Waorani man, one of the men who attacked and killed the missionaries at Palm Beach. Later one of the killers of Naenkiwi. He later became a Christian and a leader in the Waorani church."}, {"url": "https://archives.wheaton.edu/repositories/4/resources/564", "page_content": "A great deal of the material in the collection relates to the life, death, and faith of Peter Fleming. Folder 2-14 contains reminiscences about Fleming as a child and teenager from Evan Cochrane and another person, perhaps Ken Fleming, Peter’s brother. Additional reminiscences are in folder 2-2. In a February 10, 1956, letter Ken Fleming wrote to Abraham Van Der Puy remembering his brother, apparently to help Van Der Puy with the book he was supposed to write about the life and deaths of the five missionaries. Elisabeth Elliot eventually carried out this book project. It was published as Through Gates of Splendor. Some of the papers Peter Fleming wrote as a university student are in folder 2-18, as well as the valedictorian address he gave in high school, an undated poem, and a list of Scripture verses dealing with “the fear of the Lord.” Especially interesting is a handwritten, much-corrected paper on Willis Shenk, a Youth for Christ worker who served as a mentor to him.\n\n\n\nFolder 2-4 has several of Fleming’s letters. Those to Jim Elliot from 1951 discuss Fleming’s growing belief (developing in part out of his contacts with Elliot and Wilfred Tidmarsh) that he should go to Ecuador as a missionary and also indicating his interest in the people called Aucas (now known by their own name for themselves, the Waorani). Other letters trace his on-again, off-again courtship with Olive Ainslie and his conflict between his desire to marry her and his belief that he should be a single missionary in Ecuador. Folder 2-12 contains the prayer card printed for him (and fellow missionaries Jim Elliot and Bill and Irene Cathers). The file also contains his March 4, 1953 letter proposing to her and his December 5th letter from the same year stating that he was returning briefly to the United States to marry her. A letter from 1955 from Peter and Olive to Jim and Elisabeth Elliot and Ed and Marilou McCully traces the Flemings’ activities in Quito, Ecuador, and elsewhere as they are preparing to work in the jungle and learning the Quichua language. Folder 2-13 contains Olive Fleming’s handmade Quichua dictionary, grammar, and hymnbook. There are also a couple of letters to Fred, Clara, and Jane Elliot (Fred and Clara were Jim Elliot’s parents and Jane was his sister), describing his work in Ecuador. The folder also contains one prayer letter to the Flemings’ supporters and Peter’s report on a short-term Bible institute for Quichua Indians in the fall of 1955. Folder 2-16 contains a page with some 1952 excerpts from Peter’s diary, which Olive apparently transcribed when she was writing his biography. Folder 2-15 contains a copy of the official report of his death from the American vice consul in Quito.\n\n\n\nThe collection also documents the deaths of the five male missionaries at the hands of Waorani Indians on January 8, 1956, and the immediate aftermath. Folder 2-16 contains reports, letters, statements, and transcripts about the deaths, the so-called Auca Incident. Most of these were written within days or weeks of the killings. Included are statements by Hobey Lowrence and Grady Parrot of Mission Aviation Fellowship; transcripts of excerpts from the diaries of Jim Elliot and Nate Saint; the written report of the search party; and statements from missionary radio station HCJB in Quito which, along with Life magazine, did the most to publish the story to the world. The transcribed comments made about Waorani culture by Dayuma and the transcripts from 1958 and 1961 with Waorani about what actually happened on the day of the murders are especially interesting. Folder 2-9 contains excerpts of letters sent to HCJB from people who had heard their broadcasts about the Auca Incident. Folder 2-11 contains programs from memorial services for the men and poems written in their honor. Tape T1 contains the comments of the president and treasurer of Christian Missions in Many Lands after their visit to Ecuador immediately after the death of the men.\n\n\n\nThe two scrapbooks in the collection, described in detail elsewhere, contain newspaper and magazine clippings and photographs of the mission to Waorani, the search party that traveled to the site on Palm Beach to discover what happened, and the breaking of the news to the family and friends at Arajuno. There are additional newspaper and magazine stories in folders 1-1 and 1-4. These are predominantly American and Ecuadorian, but there are also others from other countries of South America and Europe. Life magazine played a major part in telling the story immediately to the world through the photojournalism of Cornell Capa. Folder 1-1 contains copies of the original story in the January 30, 1956 issue as well as the follow-up stories they did through 1961.\n\n\n\nThese same scrapbooks also document the immense interest in the story shown by the outside world, especially, but not limited to Protestants in the United States. Besides the material in the scrapbooks, clippings in folders 1-5 and 1-6 and the folder in oversize drawer 33 contain many of the articles that appeared in the publications of the Plymouth Brethren, The Sunday School Times, His (magazine of the InterVarsity Christian Fellowship), and various secular Sunday magazines.\n\n\n\nMuch of the attention on the widows of the five men and on their children. For the next few years, they kept in fairly close touch with each other. The collection contains letters that Elisabeth Elliot, Marj Saint, and Marilou McCully wrote to one or more of the other widows. Sometimes one would write a letter to the other four simply addressed to “Girls” or “The Four.” Besides keeping each other aware of what was going on in their lives, they also discussed how they should respond to projects such as the attempt to write a book about the mission of the five men and their deaths (this eventually became Through Gates of Splendor by Elisabeth Elliot, see folders 2-1, 2-2, 2-14) and the film that Mission Aviation Fellowship wanted to make. Marj Saint, a worker with MAF, returned to the United States in 1957 to work on this project; her consultations with the other widows about what was being done and what should be done can be found in folders 2-1, 2-3, 2-6 and 2-7. This became the film and filmstrip Mid-Century Martyrs (Tape 2, see also collection 136).\n\n\n\nOlive Fleming and Marilou McCully also returned to the United States in 1957 for a time, spending time with family, recuperating, and speaking at churches and other venues. Scrapbook Liefeld I contains some of the newspaper coverage of these events, as do clippings in folder 1-6. Folders 2-3, 2-6, and 2-7 contain letters Fleming, McCully, and Saint exchanged keeping each other posted on what was happening in their lives. Olive Fleming and Marilou McCully returned together to Ecuador in later 1957, partly so Olive could help Marilou with her children during the trip. The back of photo album Liefeld II contains photos and other memorabilia that Olive preserved from the other four widows and their families into the mid-1960s.\n\n\n\nAnother project was to gather more information on the Waorani and to attempt to make contact again. Eventually this led to Elisabeth Elliot (with her daughter Valerie) and Rachel Saint, sister of Nate Saint, going to live among the Waorani. Eventually a Christian community grew out of these efforts. Folders 2-1 and 2-8 contain letters Elliot and Saint soon after they arrived in the Waorani village. Folders 1-1, 1-7 through 1-13, 2-1, 2-5, and 2-16 document the early beginnings of these efforts. Tape 3 contain Olive’s comments on the effort to reach the Waorani on the Dave Garroway’s radio program.\n\n\n\nDocuments found in folders 2-7 and 2-10 as well as in Photo Album Liefeld I tell of Olive Fleming’s efforts to come to terms with her husband’s death, the end of her missionary work in Ecuador, and the start of a new life in the United States. Folder 2-2 contains letter from her brother-in-law and sister-n-law Ken and Helena Fleming. The same letters also give news about the Flemings’ work as Plymouth Brethren missionaries among the Zulu people of South Africa. Later newspaper stories about her are in folders 1-8, 1-10, 1-11, 1-18.\n\n\n\nPrograms and other material from the ceremonies held at the twentieth, fortieth, and fiftieth anniversaries of the men’s deaths in folders 1-2 and 2-11 illustrate later developments in the missionary/Waorani story. So do other clippings are in folders 1-7 through 1-21.\n\n\n\nSelect List of People Referred to in the Documents in Collection 701\n\n\n\nCornell Capa. Professional photojournalist on assignment for Life magazine. His photos and coverage played a very large part in the international telling of the Waorani/missionary story.\n\n\n\nBill Cathers. Wheaton graduate (class of 1950) who, with Jim Elliot and Ed McCully, broadcast the evangelistic radio program The March of Truth from Chester, Illinois, in 1950-1951.\n\n\n\nDawa (Diwa). Waorani woman, wife of Kimo. Assisted Elisabeth Elliot with Wao language learning.\n\n\n\nJim Elliot. Husband of Elisabeth Elliot and Plymouth Brethren missionary to Ecuador. One of the five men killed on January 8, 1956, by Waorani tribesmen.\n\n\n\nElisabeth Elliot. Wife of Jim Elliot and Plymouth Brethren missionary of Ecuador. In 1958, she went with her daughter Valerie and Rachel Saint to live among the Waorani, which she did for periods until 1961. Returned to the United States where she became a writer, lecturer, and teacher.\n\n\n\nKenneth Fleming. Brother of Peter Fleming and missionary to the Zulu people in South Africa, later a professor at Emmaus Bible Institute in Iowa.\n\n\n\nPeter Fleming. Husband of Olive Fleming and Plymouth Brethren missionary to Ecuador. One of the five men killed on January 8, 1956, by Waorani tribesmen.\n\n\n\nOlive Fleming. Wife of Peter Fleming and Plymouth Brethren missionary to Ecuador. Eventually returned to the United States. Later married to Walter Liefeld.\n\n\n\nGami. Waorani woman, mother of Naenkiwi.\n\n\n\nGikita. Waorani man, leader of the group that killed the missionaries on Palm Beach. He later became a Christian and a leader in the Waorani church.\n\n\n\nGimari. Young Waorani woman, sister of Nampa and Dayuma, who was one of the three people from the tribe to make a friendly first-contact with the five missionaries on Palm Beach on January 6, 1956. The missionaries nicknamed her Delilah.\n\n\n\nJane Elliot Hawthorne. Jane was Jim Elliot’s sister. She and her husband Gerald Hawthorne lived in Wheaton, Illinois, where Gerald taught at Wheaton College.\n\n\n\nDavid Howard. Brother of Elisabeth Elliot, brother-in-law and Wheaton College roommate of Jim Elliot. Howard traveled to Ecuador immediately after the killings to be with his sister.\n\n\n\nPhilip Howard, Sr. Father of Elisabeth Howard Elliot and editor of The Sunday School Times, which gave a great deal of coverage to the killing of the five missionaries and later development of Christianity among the Waorani.\n\n\n\nIpa (also Epa). A Waorani woman, the oldest wife of Naenkiwi.\n\n\n\nClarence W. Jones. Co-founder of the missionary short wave radio station HCJB in Quito, Ecuador. He was prominent in broadcasting the news about the deaths of the five men in 1956 and the continuing development of the story.\n\n\n\nJohn Keenan. Pilot with Missionary Aviation Fellowship who worked closely with Nate Saint and the other four men in planning “Operation Auca.” After the murder of the missionaries, he flew over their camp, worried because they had not checked in at their regular time by radio.\n\n\n\nKimo. A Waorani man, brother of Mankamo. One of the men who attacked and killed the missionaries at Palm Beach. He was one of the first converts to Christianity among the Waorani. He traveled with Komi and Rachel Saint to Berlin, Germany, in 1966 to attend the World Congress on Evangelism and give his testimony.\n\n\n\nKomi. A Waorani man, president of the village of Toñampade and husband of Dayuma. He attended the 1966 World Congress on Evangelism with Kimo and Rachel Saint.\n\n\n\nHobey E. Lowrence. One of the founders of Mission Aviation Fellowship and one of its leaders in the 1950s.\n\n\n\nEd McCully. Husband of Marilou McCully and Plymouth Brethren missionary to Ecuador. One of the five men killed on January 8, 1956, by Waorani tribesmen.\n\n\n\nMarilou McCully. Wife of Ed McCully, mother of Steve, Mike and Matt, and Plymouth Brethren missionary to Ecuador. After Ed’s death, she ran a home for missionary children in Quito for several years before returning to the United States.\n\n\n\nT. E. McCully, Sr. Father of Ed McCully.\n\n\n\nMankamo (also Mankamu, Mankimo). Wife of Gikita, sister of Kimo. She and Mintaka left the Waorani and lived in Arajuno, Ecuador, where she met Elisabeth Elliot. She and Mintaka went back to the Waorani in 1958 and played a major part in inviting Elisabeth Elliot to come and live among her people.\n\n\n\nMinkaye (also Mincayi, Minkayani, Minkayi). A Waorani man, one of the men who attacked and killed the missionaries at Palm Beach. Later one of the killers of Naenkiwi. He later became a Christian.\n\n\n\nMintaka. Older Waorani woman, sister of Gikita. She was one of the three people from the tribe to make first contact with the five missionaries on Palm Beach on January 6, 1956. Later she and Mankamo left the Waorani and lived in Arajuno, Ecuador, where they met Elisabeth Elliot. She went back to the Waorani in 1958 and played a major part in inviting Elliot to come and live among her people.\n\n\n\nNampa. Waorani man, brother of Dayuma and Gimade. He was one of the six men who attacked the missionaries at Palm Beach. He was wounded in the attack and either died from that wound or died in a hunting accident a year later.\n\n\n\nNaenkiwi. Waorani male. He was one of the three Waorani who visited the missionaries on January 6, 1956. He later falsely told a party of Waorani that the missionaries had attacked their visitors, and thus precipitated the killing of the five men. Other members of his tribal group later killed Naenkiwi.\n\n\n\nNimonka. (also Ninumga) A Waorani man, one of the men who attacked and killed the missionaries at Palm Beach. Later, one of the killers of Naenkiwi.\n\n\n\nJ. Grady Parrot. President of Mission Aviation Fellowship in 1956.\n\n\n\nMarj Saint. Wife of Nate Saint, mother of Steve, and a Mission Aviation Fellowship worker. She later married Abe Van der Puy.\n\n\n\nNate Saint. Husband of Marj Saint and pilot with Mission Aviation Fellowship. One of the five men killed on January 8, 1956, by Waorani tribesmen.\n\n\n\nRachel Saint. Missionary with Wycliffe Bible Translators, later independent. She was the sister of Nate Saint and established a bond with Dayuma in the mid-1950s, after Dayuma fled her tribe. She took Dayuma to the United States in 1957-1958. Later, she went with Elisabeth and Valerie Elliot to live with the Waorani in 1958 and continued to do so for the rest of her life. In 1966, she went with Kimo and Komi to the World Congress on Evangelism in Berlin, Germany. She did the first translation of the Gospel of Mark into Wao.\n\n\n\nSamuel Saint. Brother of Nate Saint. He acted as the liaison and business agent of the five widows in the United States.\n\n\n\nRobert Savage. Missionary to Ecuador who served as program director for the missionary short-wave station HCJB in Quito, Ecuador.\n\n\n\nWilfred Tidmarsh. Plymouth Brethren missionary in Ecuador who was somewhat a mentor to Jim Elliot, Ed McCully and Peter Fleming.\n\n\n\nUmpurae (or Ompodae). Waorani woman, wife of Minkaye. Assisted Elisabeth Elliot with the Wao language.\n\n\n\nAbe Van der Puy. Head of the Foreign Missionary Fellowship in Ecuador in 1956 and staff member of HCJB short wave radio station. He was deeply involved in broadcasting the story of the five men’s deaths immediately after the event. He was also credited with the article that appeared in Reader’s Digest in August 1956, although it was essentially written by a Digest editor. He later married Marj Saint.\n\n\n\nBarbara Youderian. Wife of Roger Youderian and Gospel Missionary Union worker in Ecuador.\n\n\n\nRoger Youderian. Husband of Barbara Youderian and Gospel Missionary Union worker in Ecuador. One of the five men killed on January 8, 1956, by Waorani tribesmen.\n\n\n\nYowe (also Yowi or Dyuwe). A Waorani man, one of the men who attacked and killed the missionaries at Palm Beach. Later one of the killers of Naenkiwi. He later became a Christian and a leader in the Waorani church."}]}