{"Nate Saint and four other missionaries—Jim Elliot, Peter Fleming, Ed McCully, and Roger Youderian—formed the Missionary Aviation Fellowship's (MAF) Ecuadorian Mission.": [{"url": "https://www.christianity.com/wiki/history/who-were-the-five-missionaries-who-died-in-the-ecuador-jungle.html", "page_content": "Sixty-four years ago, on January 8, 1956, five men between the ages of 27 and 32, were speared to death trying to reach a violent, indigenous tribe in Ecuador with the gospel. They all left behind wives and four had young children. The men knew the task was dangerous, even life-threatening. So, who were these men and what would cause them to willingly lay down their lives?\n\nThe Missionaries\n\nJames “Jim” Elliot (Christian Missions in Many Lands) and his wife Elisabeth or “Betty” were both graduates of Wheaton College near Chicago. They had one daughter, Valerie, together. Jim and Elisabeth were both single missionaries to Ecuador before they were married.\n\nPeter “Pete” Fleming (Christian Missions in Many Lands) was married to Olive. He studied philosophy at the University of Washington before becoming a missionary. Pete and Jim Elliot went to Ecuador as missionaries together in 1952 before they both got married in 1954. They continued their attempts to reach the Huaorani together with Ed, Nate, and Roger.\n\nEdward “Ed” McCully (Christian Missions in Many Lands), also a graduate of Wheaton College, married Marilou (graduate of Moody Bible Institute in Chicago) and was father to Stephen, Michael, and Matthew. (Marilou was eight months pregnant with Matthew at the time of Ed’s death.)\n\nNathanael “Nate” Saint (Missionary Aviation Fellowship) was married to Marjorie and father to Kathy, Stephen, and Philip. He had also attended Wheaton College. According to From Jerusalem to Irian Jaya: A Biographical History of Christian History Missions, “Perhaps the best-known missionary pilot has been Nate Saint, whose role in the Auca tragedy made him a household name in evangelical circles.” It was due to Nate Saint’s skill as a pilot that the five missionaries were able to land on “Palm Beach.” Nate served in World War II with the Army Air Corps.\n\nRoger Youderian (Gospel Missionary Union) attended Montana State College, enlisted in the U.S. Army, was a paratrooper in World War II, and afterwards attended Northwestern College to prepare for missions. He married Barbara and had two children, Beth and Jerry.\n\nThe Mission\n\nThe interdenominational, evangelical missionaries, Jim Elliot, Pete Fleming, Ed McCully, Nate Saint, and Roger Youderian, were speared to death by the very people they were attempting to reach with the gospel. The five men left behind five widows. The Huaorani Indians (otherwise known as the Waodani, Waorani, or Auca Indians), totaling around 500 tribe members in 1955, were a violent tribe of indigenous, Amerindians living in the Amazonian region of Ecuador.\n\nThe tribe was fearful of outsiders and had been known to kill any that entered their territory. They were also internally violent. The missionaries chose to go to the Huaorani tribe because they were known to be completely “unreached” by the gospel. The tragedy was featured in the January 30, 1956 edition of Life Magazine which was the first time the Huaorani tribe was ever photographed in their natural surroundings.\n\nAccording to that 1956 edition of Life Magazine, the missionaries discovered the “Aucas” or Huaorani “as they and their wives were ministering to Quechua-speaking and Jivaro Indians.” The term Auca means “savages” in Quechua. They physically found the tribe flying over Auca territory in Nate Saint’s plane. The men spent weeks dropping gifts from the plane to the Aucas in a bucket before finding the courage to land the plane on the shore of the Curaray River. They believed the Aucas to be friendly when they finally landed on the riverbank that they referred to as “Palm Beach.”\n\n“Between October 6 and December 23, Saint, accompanied by either McCully or Elliot, made 13 flights over the Wao clearings. Fleming provided prayer and financial support from his station. Saint lowered gifts to the ground. First, they sent down an aluminum cooking pot decorated with floating ribbons, then buttons, pants, shirts (the Waorani wore only cotton G-strings), an ax head, knives, photos, machetes. The Waorani received these gifts with smiles and laughter. They began to return gifts: a headband, woven thread, smoked monkey tail, two squirrels, a parrot. During these exchanges, the men shouted carefully mouthed phrases in the Wao language, which they had picked up from Dayuma, a young Wao woman who had fled tribal violence only to live in servitude at a nearby hacienda.”\n\nTo Lay Down One’s Life\n\nIn early January, all five men, believing that God was providing an “open door” to reach the Huaorani with the good news of Jesus Christ, landed on the banks of the Curaray River in Nate Saint’s plane. Although initial contacts seemed friendly, all five men were ultimately speared to death by the Huaorani (who believed that all outsiders would eventually shoot them with guns). Elliot, Fleming, McCully, Saint, and Youderian, of course, had no intention of shooting the Indians, but, rather, were hoping and praying to be able to share with them the hope of eternal life that they had in Christ.\n\nAgain, what would cause five young men with families to willingly lay down their lives? Did they truly believe that their mission to reach the Aucas was worth risking everything? They absolutely did. They believed the story of the New Testament, that Jesus Himself had laid down His life to save those who were spiritually lost. The Aucas, or Huaorani, had never heard of Jesus’ love and sacrifice on the cross. They didn’t have a Bible in their language and had not heard the message of salvation. They needed someone to come tell them, and yet that required great courage as the Huaorani were known for violence. The five men who went believed it was what Christ would have done and what Christ wanted them to do!\n\nIf you declare with your mouth, “Jesus is Lord,” and believe in your heart that God raised him from the dead, you will be saved. For it is with your heart that you believe and are justified, and it is with your mouth that you profess your faith and are saved…. for, “Everyone who calls on the name of the Lord will be saved.” How, then, can they call on the one they have not believed in? And how can they believe in the one of whom they have not heard? And how can they hear without someone preaching to them? And how can anyone preach unless they are sent?” (Romans 10:9-15, NIV).\n\nNot in Vain\n\nSo, did the men die in vain? Did the Huaorani ever hear and receive the message about Jesus? It turns out that the men weren’t the only courageous ones. Following their deaths, with the help of Dayuma, Jim’s wife, Elisabeth (along with daughter, Valerie), and Nate’s sister, Rachel, returned to live among the Huaorani, offering them forgiveness and completing the task the men had begun. This led to the conversion of many in the tribe, including at least one of the murderers. Ultimately, the New Testament was translated into the Wao language. “Nate Saint’s eldest son, Steve, and his family lived among the Waorani for a year in 1995.”\n\nSources\n\nhttps://christianhistoryinstitute.org/magazine/article/martyrs-to-the-spear/\n\nhttps://www.christiantoday.com/article/i-miss-my-father-but-he-gave-his-life-for-christ-daughter-of-murdered-christian-missionary-speaks-out/104967.htm\n\nhttps://www.inspirationalchristians.org/evangelists/jim-elliot-biography/\n\n“Shadow of the Almighty” by Elisabeth Elliot\n\n“Through Gates of Splendor” by Elisabeth Elliot\n\n“These Strange Ashes” by Elisabeth Elliot\n\n©iStock/Getty Images Plus/Kalistratova\n\n\n\n\n\nKristi Walker has been a missionary in Berlin, Germany for over 15 years working with an international church as the Director of Student Ministries. Her birthday is January 8, and the story of the five missionaries who died in Ecuador has greatly impacted and inspired her. She is the author of two books: Disappointment: A Subtle Path Away from Christ and Convinced. Applying Biblical Principles to Life’s Choices."}, {"url": "http://justus.anglican.org/resources/bio/74.html", "page_content": "\n\n\n\nIn the dense rain-forests of Ecuador, on the Pacific side of the Andes Mountains, lives a tribe of Indians who call themselves the Huaorani (\"people\" in their language, Huao), but whose neighbors have called them the Aucas (\"savages\" in Quechua). For many generations they have been completely isolated from the outside world, disposed to kill any stranger on sight, and feared even by their head-hunting neighbors, the Jivaro tribe.\n\nIn 1955, four missionaries from the United States who were working with the Quechas, Jivaros, and other Indians of the interior of Ecuador became persuaded that they were being called to preach the Gospel to the Huaorani as well.\n\nNate Saint was 32 years old (born 1923), and devoted to flying. He had taken flying lessons in high school and served in the Air Force in Wwii. After the war, he enrolled in Wheaton College to prepare for foreign mission work, dropped out to join the Missionary Aviation Fellowship, established a base at Shell Mera (an abandoned oil exploration camp in Ecuador) in September 1948, and flew short hops to keep missionaries supplied with medicines, mail, etc. Once his plane crashed, but a few weeks later he returned to work in a cast from his neck to his thighs. He was married to Marjorie (maiden name??).\n\nThe other threee, Ed McCully, Jim Elliot, and Peter Fleming, all Plymouth Brethren, came to Ecuador in 1952 to work for CMML (Christian Missions in Many Lands).\n\nEd McCully was ?? years old (born 19??). He had been a football and track star at Wheaton College, and president of senior class. After Wheaton, he enrolled at Marquette to study law, but dropped out to go to Ecuador. He and his wife Marilou (maiden name?) worked with the Quechuas at Arajuno, a base near the Huaorani. Half a dozen Quechuas had been killed at the base by Huaorani in the past year.\n\nJim Elliot was 28 years old (born 1927), an honors graduate of Wheaton College, where he had been a debater, public speaker, and champion wrestler. In Ecuador, he married Elisabeth Howard. They did paramedic work, tending broken arms, malaria, snakebite. The taught sanitation, wrote books in Quechua, and taught literacy.\n\nPeter Fleming was 27 years old (born 1928), from the University of Washington, an honor student, a linguist, married to Olive (maiden name?). They ran a literacy program among the Quechuas.\n\nNate and Ed found a Huaorani settlement from the air in late September, 1955. Nate made four more flights on Thursday, 29 September, and found a settlement only 15 minutes from their station. They told Jim and Pete, and the four planned their strategy. They would keep the project secret from everyone but their wives, to avoid being joined by adventurers and the press, with the chance that someone not dedicated to the mission would start shooting at the first sign of real or imagined danger, and destroy the project. They had one language resource, a Huaorani girl, Dayuma, who had fled from her tribe years earlier after her family was killed in a dispute, who was now living with Nate's sister Rachel, and who spoke both Huao and Quechua. From her they learned enough of the language to get started. They would fly over the village every Thursday and drop gifts as a means of making contact and establishing a friendly relation. Eventually they would try for closer contact. Nate had discovered that, if he lowered a bucket on a line from the plane, and flew in tight circles, the bucket remained almost stationary, and could be used to lower objects to the ground. He had devised a mechanism to release the bucket when it touched down.\n\nOn Thursday 6 October, one week after locating the village, they dropped an aluminum kettle into an apparently deserted village. On the next flight, several Huaorani were waiting, and they dropped a machete. On the third flight, they dropped another machete to a considerably larger crowd. Beginning with the fourth flight, they used a loudspeaker system to call out friendly messages in Huao. Soon the Huaorani were responding with gifts of their own tied to the line: a woven headband, carved wooden combs, two live parrots, cooked fish, parcels of peanuts, a piece of smoked monkey tail.... They cleared a space near their village, and built platforms to make the exchanges easier.\n\nAfter three months of air-to-ground contact, during which they made far more progress than they had hoped, the missionaries decided that it was time for ground contact--that they could not keep their activities secret much longer, and that delay risked a hostile encounter between the Huaorani and some third party. They decided that the expedition needed a fifth man, and so brought in Roger Youderian (married to Barbara ???), from rural Montana, a former paratrooper who had fought in the Battle of the Bulge (major German offensive in Belgium in the last stages of Wwii), and had been in General Eisenhower's honor guard. Roger had been working with the Jivaros, and was thoroughly at home in the jungle, accustomed to living like the Jivaros, and blessed with acute survival instincts. They located a beach that would serve as a landing strip, about four miles from the village, and decided to go in on Tuesday 3 January 1956. After some discussion, they decided to carry guns, having heard that the Huaorani never attacked anyone who was carrying a gun, and having resolved that they would, as a last resort, fire the guns into the air to ward off an attack, but would shoot no-one, even to save their own lives.\n\nOn Tuesday they flew in and made camp, and then flew over the village to invite the Huaorani to visit them. The first visitors showed up on Friday, a man, a woman, and a teen-aged girl. They stayed for several hours in apparent friendliness, and then left abruptly. On Saturday, no one showed, and when the plane flew over the village, the Huaorani seemed frightened at first, but lost their fright when presents were dropped. On Sunday afternoon, 8 January 1956, at about 3pm, all five missionaries were speared to death at their camp. A search party the next day found no signs of a struggle, and the lookout who was to be stationed in a tree-house overlooking the camp at ground level had come down, so it appeared that the meeting had originally seemed friendly, and that the attack had been a surprise. Ed McCully's body was seen and identified, but was swept away by the river and not recovered. The other four, at the request of their wives, were buried at the site of the camp where they had died.\n\nThe effort to reach the Huaorani was not abandoned but rather intensified. Within three weeks, Johnny Keenan, another pilot of the Ecuador Mission, was continuing the flights over the Auca village. More than twenty fliers from the United States promptly applied to take Nate's place. More than 1000 college students volunteered for foreign missions in deirect response to the story of the Five Martyrs. In Ecuador, at the mission stations, attendance by Indians at schools and church services reached record levels, and the number of conversions skyrocketed. A Jivaro undertook to go at once to another Jivaro tribe that had been at war with his own tribe for years, bearing the Christian message, and his visit brought peace between the two tribes. Truly, as Tertullian said 1800 year ago, the blood of the martyrs is the seed of the Church.\n\nIn less than three years, Rachel Saint (sister of Nate Saint) and Elisabeth Elliot (widow of Jim Elliot) had not only renewed contact but had established permanent residence in a Huarani settlement, where they practised basic medicine and began the process of developing a written form of the language.\n\nWhy did the Huaorani suddenly turn hostile? Much later, one of the Huaorani who had helped to kill the five martyrs explained that the tribe, who had had almost no contact with outsiders that did not involve killing or attempted killing on one side or another, wondered why the whites wanted to make contact with them; and while they wanted to believe that their visitors were friendly, they feared a trap. After the killings, they realized their mistake. When they were attacked, one of the missionaries fired two shots as warnings, and one shot grazed a Huaorani who was hiding in the brush, unknown to the missionaries. It was therefore clear that the visitors had weapons, were capable of killing, and had chosen not to do so. Thus, the Huaorani realized that the visitors were indeed their friends, willing to die for them if necessary. When in subsequent months they heard the message that the Son of God had come down from heaven to reconcile men with God, and to die in order to bring about that reconciliation, they recognized that the message of the missionaries was the basis of what they had seen enacted in the lives of the missionaries. They believed the Gospel preached because they had seen the Gospel lived.\n\nPRAYER (traditional language):\n\nAlmighty God, who didst call thy faithful servants Nate Saint, Ed McCully, Jim Elliot, Peter Fleming, and Roger Youderian to be witnesses and martyrs to the Huaorani peoples in the rain forests of Ecuador, and by their labors and suffering didst raise up a people for thine own possession: Pour forth thy Holy Spirit upon thy Church in every land, that by the service and sacrifice of many, thy holy Name may be glorified and thy kingdom enlarged; through Jesus Christ our Lord, who liveth and reigneth with thee and the Holy Spirit, one God, for ever and ever.\n\nPrecious in thy sight, O Lord, is the death of thy saints, Whose faithful witness, by thy providence, hath its great reward: We give thee thanks for thy martyrs Nate Saint, Ed McCully, Jim Elliot, Peter Fleming, and Roger Youderian, who purchased with their blood a hearing for the Gospel among the forest-dwellers of Ecuador, especially the Huaorani people, and for their wives, who shared with them in their work and witness; and we pray that with them we also may obtain the crown of righteousness which is laid up for all who love the appearing of our Savior Jesus Christ; who liveth and reigneth with thee and the Holy Spirit, one God, for ever and ever.\n\nPRAYER (contemporary language):\n\nAlmighty God, who called your faithful servants Nate Saint, Ed Mccully, Jim Elliot, Peter Fleming, and Roger Youderian to be witnesses and martyrs to the Huaorani peoples in the rain forests of Ecuador, and by their labors and suffering raised up a people for your own possession: Pour forth your Holy Spirit upon your Church in every land, that by the service and sacrifice of many, your holy Name may be glorified and your kingdom enlarged; through Jesus Christ our Lord, who lives and reigns with you and the Holy Spirit, one God, for ever and ever.\n\nPrecious in your sight, O Lord, is the death of your saints, Whose faithful witness, by your providence, has its great reward: We give you thanks for your martyrs Nate Saint, Ed McCully, Jim Elliot, Peter Fleming, and Roger Youderian, who purchased with their blood a hearing for the Gospel among the forest-dwellers of Ecuador, especially the Huaorani people, and for their wives, who shared with them in their work and witness; and we pray that with them we also may obtain the crown of righteousness which is laid up for all who love the appearing of our Savior Jesus Christ; who lives and reigns with you and the Holy Spirit, one God, for ever and ever.\n\n\n\n\n\nUnless otherwise indicated, this biographical sketch was written by James E. Kiefer and any comments about its content should be directed to him. The Biographical Sketches home page has more information."}, {"url": "https://www.christianitytoday.com/ct/2006/january/rest-of-story.html", "page_content": "The crowd in the echoing hall of the airport ebbs and flows like flotsam and jetsam in a dirty river. I keep my eye on the red feather in the bird-breast headpiece worn by an elfin man. He still seems more legend than reality. I am following Mincaye, a leader of the formerly \"stone age\" Waodani people of Ecuador's Amazon jungle. He is following Babae, Steve Saint. Steve's baseball-capped head bobs up and down with his gait, like that of a lanky teenager. I think Mincaye would follow him anywhere, but here, in Hyderabad, India, Mincaye follows especially closely.\n\nThis is the latest chapter in a story that began 50 years ago on a remote sandbar in the jungles of Ecuador. Then Mincaye and fellow tribesmen used spears and machetes to slaughter Saint's father, Nate Saint, a Mission Aviation Fellowship (MAF) pilot, along with missionaries Jim Elliot, Ed McCully, Pete Fleming, and Roger Youderian.\n\nThe story, first recounted in Life magazine and now retold in End of the Spear, a motion picture released this month, has inspired many Christians to consider a missionary calling and sparked dozens of books (including Elisabeth Elliot's Through Gates of Splendor), movies, radio programs, and articles. More importantly, the violent, short lives of the Waodani—called \"Auca,\" or savages, at the time—were transformed. Mincaye, once a murderer of missionaries, has become a missionary himself. That's why he is here.\n\nAlso remarkable is how well Mincaye represents where the missions movement is headed.\n\n\"I came to speak God's carvings,\" Mincaye says, as Steve translates from Wao tededö into English. \"Carvings\" is the term the Waodani use for the Bible. \"God tells us to teach the other people.\"\n\nFrom ‘Stone Age’ to Today\n\nWhile death by spear is no longer a threat for the estimated 25 percent to 40 percent of the tribe who believe in Christ, some Waodani villages still carry out murderous vendettas. \"If people die and haven't heard, it's all over for them,\" says Mincaye, presumed to be in his 70s. Speaking of the most recent (2003) killing spree among the Waodani, Mincaye leans his leathery brown face toward mine and slices a thick finger across my throat. Then he holds up his hands, fingers splayed, and gestures to his feet, now covered in stiff leather shoes. He claps his hands together and my stomach does an uncomfortable flip.\n\n\"He is saying that they killed as many as his fingers and his toes,\" Steve explains.\n\nArticle continues below\n\nMartyrdom at the Movies\n\n\n\nOpening in theaters on January 20, End of the Spear features the events of 1956 from the perspectives of a Waodani tribe leader, Mincayani (a composite character played by Louie Leonardo), and Nate Saint's son, Steve (Chase Ellison/Chad Allen). The movie is stirring and lush, shot in Panama with members of the Embera tribe cast in all but a few key Waodani roles. Produced by an independent Christian studio called Every Tribe Entertainment (ETE), the film elevates the visual storytelling portfolio of independent Christian movies.\n\n\n\nThe movie, narrated by Steve, reaches back into Mincayani's childhood. In so doing, it reveals a worldview that spawned unrelenting violence. It depicts the missionaries a bit like frat boys—goofy, exuberant, optimistic.\n\n\n\nLast fall, ETE released on dvd its award-winning 2003 documentary about the same events, Beyond the Gates of Splendor . In different ways, the two projects reveal how two men have become like father and son. Through them, viewers can learn the power of forgiveness and reconciliation. —Lisa Ann Cockrel\n\nAccording to Gordon-Conwell Theological Seminary's World Christian Database, some 80 percent of the Waodani (also known through the years as the Waorani or the Huarani) have heard the message, with 40 percent professing Christian faith. (MAF, however, estimates that only a quarter of the group is Christian.) From only 600 Waodani documented in 1958, the tribe has grown to about 2,000, according to anthropologists James S. Boster and James Yost and linguist Catherine Peeke of Wycliffe Bible Translators' sister organization, SIL International (formerly the Summer Institute of Linguistics). Other estimates put the number at 1,000.\n\nWhatever the precise figures, any population growth is a welcome change from the Waodani's homicidal history. According to Yost, formerly a research and consultant anthropologist for SIL, half of all Waodani deaths prior to the first friendly contact by Rachel Saint and Elisabeth Elliot in 1958 resulted from murders by fellow tribe members. (Another 20 percent were from shootings by outsiders, according to Yost.)\n\nNow some anthropologists, such as Boster, who is a professor at the University of Connecticut, say Christianity was pivotal in ending the tribal violence.\n\n\"I believe that conversion to Christianity was instrumental in saving the Waodani,\" Boster told CT. He says the five missionaries' refusal to fight back, despite their guns, and the forgiveness shown by the missionaries' close kin showed the Waodani the power of Christianity.\n\nArticle continues below\n\nAside from salvation, medicine has been the biggest need among Amazonian tribal groups during the last 50 years. The difference now is that the medical treatment may come from within the group rather than from foreigners. Previously, dentistry for the Waodani had been like other gifts of the cowadi, or foreigners. It was dropped from the sky.\n\nSteve Saint's aunt Rachel, called \"Star\" by the Waodani, lived with the people for three decades after her brother's martyrdom. She helped translate the Bible into their language. When she died in 1994 of cancer, Waodani leaders quickly invited Steve, who had spent school vacations in the jungle, to take her place. After moving his family to Ecuador, Steve discovered that the Waodani were still dependent on foreign money and missionaries.\n\nThe Waodani wanted Steve, a former MAF pilot, to teach them to fly. \"Before, when Star was living with us, when people's teeth were hurting, some foreigners came to fix our teeth, but they only came sometimes,\" Mincaye recalls. \"So Kimo and I started thinking, Why can't we do this?\"\n\nSteve, with a business background, launched a new company, I-TEC (Indigenous People's Technology and Education Center), to help the Waodani use new technology. One project modified a powered parachute to transport passengers, cargo, and even stretcher patients in and out of the jungle.\n\nThen the Waodani asked Steve to teach them basic dentistry. According to the World Health Organization, cavities and poor oral health afflict much of the world and are too costly to treat using traditional methods. But Mincaye says that the Waodani see dentistry in much the same way as missionary dentists see it—as a way to evangelize. \"Teach us the tooth thing, and they will see us well,\" Mincaye told Steve. \"That's the door opener so the people know we really care about them.\"\n\nIgnoring the seeming impossibility of first learning dentistry—a profession requiring years of schooling and experience for Westerners—and then teaching it to people who 50 years ago were using stone axes to fell trees, Steve turned his entrepreneurial skills to the new challenge.\n\nFirst, an American dentist taught Steve the basic skills and knowledge needed to extract and fill teeth, inject anesthesia, and prescribe antibiotics. I-TEC then developed a portable dental chair that folds into a backpack along with an instrument tray, a headlamp, and a solar-powered drill, all light enough to be packed through the jungle or loaded onto a powered parachute.\n\nArticle continues below\n\nAs intended, the dental work has opened doors for Christian Waodani to speak about eternal matters. Mincaye says he tells patients he is fixing their teeth because the Creator has done good things for him.\n\n\"In our place, whoever has fever, cut, hurting, they come to us because they know we care,\" Mincaye says. \"We take care of their hurt, then we teach them how to take care of their heart.\n\n\"I teach them God's carvings.\"\n\nFor years, Charlie Vittitow, a dentist from Louisville, Kentucky, has worked among indigenous people with short-term mission teams from Southeast Christian Church. The idea that began with Mincaye's simple request to learn \"the tooth thing\" launched a new ministry of dentistry for Vittitow and Southeast. Using I-TEC's equipment and philosophy, they began not only bringing help but also passing on professional knowledge.\n\nIn January 2004, Vittitow taught church pastors in Ghana how to extract decayed teeth and fill cavities, inject anesthesia, and prescribe antibiotics. Vittitow admits that teaching dentistry basics to Christian ministers \"tests my enthusiasm for evangelism.\" But he likes what he has seen so far and says the benefits far outweigh the risks. \"With this model, we are empowering the indigenous people. We should do this in all aspects of ministry.\"\n\nCross-cultural Challenges\n\nEmpowering locals is a dominant theme in missions today. According to David Howard, Elisabeth Elliot's brother and a long-time missionary to Latin America, it is one of the most drastic shifts in cross-cultural outreach during the past 50 years.\n\n\"The non-Western world missionary movement is one of the most exciting things,\" Howard, former general director of the World Evangelical Alliance, told CT. Howard documents three historical phases in missions: dependence (1650–1945), independence (1945–1974), and interdependence (1974–present). The last phase began with the decision to focus not on geopolitical nations but on distinct ethno-linguistic groups—now estimated at more than 13,000 worldwide—to fulfill the Great Commission.\n\n\"We began to realize that the job is huge, much bigger than we realized,\" Howard said. The number of unevangelized groups in India, for example, has grown rather than diminished in the last few decades, simply because the nation has been regrouped according to ethnicities and tribes rather than geographic areas.\n\nArticle continues below\n\nMission strategist Ralph D. Winter, founder of the U.S. Center for World Mission, launched the mission concept of people groups. Winter brushes aside the common canard—heard most recently in Venezuela—that missionaries undermine indigenous cultures, such as that of the Waodani. \"If it were not for missionaries,\" Winter tells CT, \"literally thousands of indigenous languages would have perished.\"\n\nThe New Testament is now available not only in the Waodani language, but also in the language of the Jivaro, with whom Roger Youderian worked, and in the languages of five other Amazonian people groups.\n\nWhile missionaries seek to preserve these cultures, younger members of Amazonian tribes are often willing to abandon them. Monetized economies introduced by oil companies and the subsequent trappings of civilization that follow them often exert a strong pull. The Waodani themselves rely on ecotourism to raise money for their medical ministry.\n\nDependency remains a risk. Steve acknowledges that technologies and skills introduced into the tribe may create a new form of reliance on outsiders if not handled carefully.\n\nScott Moreau, the chair of intercultural studies at Wheaton College, told CT that dependency is a perennial risk in missions. \"Dependency is a monster issue, and the disparity of economic resources will always generate that possibility,\" Moreau acknowledged. But he expressed optimism that better cross-cultural training of missionaries and a new goal of interdependence between Westerners and non-Westerners have altered the equation.\n\n\"Theoretically,\" he said, \"things have changed.\"\n\n‘We have to go every place’\n\nBack in India, Mincaye is testing Moreau's theory. Snapping on latex gloves and gesticulating energetically about the proper way to extract a tooth, he says to a group of Christian workers from Hyderabad, \"Firm and gentle.\" Steve translates from Wao tededö into English, then Caleb Premanandam of Harvest Ministries in Hyderabad translates into Telugu, Urdu, and Hindi for the 10 local pastors in attendance. They show little inhibition about learning dentistry.\n\n\"They have spread their smiles,\" Premanandam says of the pastors now addressing the felt needs of the rural communities around Hyderabad. \"This will be a platform for the gospel.\" Dental ministry has already also become a bridge into communities where militant Hindus were hostile to Christians.\n\nArticle continues below\n\nNow Steve and Mincaye are speaking in a small, 10-year-old church where a Hindu extremist murdered one of the evangelizing pastors last spring.\n\n\"When I was a little boy and my dad flew off and was killed,\" Steve says, \"I thought, How can life ever be good again? But God gave me the man who killed my father to be like a father to me and a grandfather to my children.\"\n\nThe Indian church prays that someday the man who killed their pastor will come to know Christ and join their family, too.\n\nOn our way back via Amsterdam, I ask Mincaye what he thinks of his mission trip to India. \"Did you see it well to come so far?\" Steve translates.\n\n\"Jesus told us we have to go every place,\" Mincaye says, \"and wasn't it nice that the airplane was coming this way?\"\n\nFrom the beginning of the 20th century, when there were no Christians among them, the Waodani now have at least 400 Christians, as well as a global evangelist in Mincaye.\n\nAfter we land, a customs official begins his interrogation of Mincaye. \"You've just arrived from India?\" Steve translates, and Mincaye nods. His earlobes dangle like thick rubber bands. He prefers not to wear the balsa wood discs that traditionally adorn them. He is smiling wide now, revealing shiny white dentures.\n\n\"What is his profession?\" the customs officer inquires of Steve. Without blinking, Steve replies: \"He's a dentist.\"\n\nRebecca Barnes is a freelance writer and editor in Louisville, Kentucky, where she is a member of Southeast Christian Church.\n\nCopyright © 2006 Christianity Today. Click for reprint information.\n\nRelated Elsewhere:\n\nAlso posted today is:\n\nInterview: Death Worked Backwards | End of the Spear, a new film about the 1956 missionary martyrs in Ecuador, is similar to the Narnia story in some ways, says Steve Saint, son of one of the murdered men.\n\nEnd of the Spear, Beyond the Gates of Splendor, and Elisabeth Elliot's book Through the Gates of Splendor are available from Christianbook.com and other retail outlets.\n\nMore Christianity Today articles on the Ecuador martyrs includes:\n\nThe Unfinished Mission to the 'Aucas' | Forty years ago my father, Nate Saint, and four other young missionaries (Jim Elliot, Pete Fleming, Ed McCulley, and Roger Youderian) were speared to death while trying to reach the \"Auca\" Indians in the Amazon jungles of South America. Today, I have a home among these people—properly called Huaorani—and some of the very men who speared my father have become substitute grandfathers to my children. By Stephen E. Saint (March 2, 1998)\n\nArticle continues below\n\nEcuadorian Martyrs Story on Stage | A new stage production touring the United States is retelling the story of how five missionaries lost their lives in the jungles of Ecuador 40 years ago (Oct. 28, 1996)\n\n>Did They Have to Die? | Forty years after five missionaries lost their lives in the Ecuadorian jungle, the killers explain what really happened. By Steve Saint (Sept. 16, 1996)\n\nMartyrs' Lost Plane Recovered in Ecuador | The skeletal remains of an aircraft, uncovered on a remote beach along a river in Ecuador, are believed to be the lost plane piloted by American missionaries shortly before their murder in 1956. (August 15, 1994)\n\nMore about End of the Spear and Beyond the Gates of Splendor from Christianity Today Movies includes:\n\nEnd of the Spear Big Winner at Heartland | Film about 1956 missionary martyrs in Ecuador wins Film Festival's $50,000 Grand Prize; others also lauded at Crystal Heart Awards Ceremony. (Oct. 17, 2005)\n\nBeyond the Gates of Splendor | This documentary, telling the true story of five American missionaries murdered on a remote sandbar in Ecuador half a century ago, explodes the myth of the noble savage. (Oct. 4, 2005)\n\nFrom Film Neophyte to Movie Mogul | Before recently, Mart Green had never been in a movie theater, but he's the driving force behind two new films about the 1956 missionary martyrs in Ecuador—and the tribe that killed them. (April 26, 2005)\n\nHave something to add about this? See something we missed? Share your feedback here."}, {"url": "https://www.christianity.com/church/church-history/timeline/1901-2000/jim-elliot-no-fool-11634862.html", "page_content": "January 2, 1956, was the day that 29-year-old Jim Elliot had waited for most of his life. He jumped out of bed, dressed as quickly as he could, and got ready for the short flight over the thick Ecuador (Eck-wah-door) jungle. Almost three years of jungle ministry and many hours of planning and praying had led Jim to this day. Within hours, he and four other missionaries would be setting up camp in the territory of a dangerous and uncivilized Indian tribe known then as the Aucas (Ow-cuz), known now as the Waodani (Wah-o-dah-nee). The Aucas had killed all outsiders ever caught in their area. Even though it was dangerous, Jim Elliot had no doubt God wanted him to tell the Aucas about Jesus.\n\nJim Elliot's Childhood\n\nAs a little boy growing up in Portland, Oregon, Jim Elliot listened carefully as visiting missionaries told him about life on faraway mission fields. He asked them questions and dreamed about being a missionary himself someday. It saddens him that many people in other countries died without knowing about God.\n\nThe Long Boat Trip\n\nOn February 2, 1952, Jim Elliot waved goodbye to his parents and boarded a ship for the 18-day trip from San Pedro, California, to Quito (Kee-toe), Ecuador, South America.\n\nHe and his missionary partner, Pete Fleming, first spent a year in Quito learning to speak Spanish. Then they moved to Shandia (Shan-dee-ah), a small Quichua (Kee-chew-wah) Indian village to take the place of the retiring missionary. Jim and Pete studied hard to learn the language and fit in. Their hard work paid off; in six months, both were speaking Spanish well enough to move to Shandia. When they arrived in Shandia, they also had to learn the speech of the Quichuas.\n\nJim's Plan to Reach the Aucas\n\nThree years later many Quichuas had become faithful Christians. Jim now began to feel it was time to tell the Aucas about Jesus.\n\nThe Aucas had killed many Quichuas. They had also killed several workers at an oil company-drilling site near their territory. The oil company closed the site because everyone was afraid to work there. Jim knew the only way to stop the Aucas from killing was to tell them about Jesus. Jim and the four other Ecuador missionaries began to plan a way to show the Aucas they were friendly.\n\nNate Saint, a missionary supply pilot, came up with a way to lower a bucket filled with supplies to people on the ground while flying above them. He thought this would be a perfect way to win the trust of the Aucas without putting anyone in danger. They began dropping gifts to the Aucas. They also used an amplifier to speak out friendly Auca phrases. After many months, the Aucas even sent a gift back up in the bucket to the plane. Jim and the other missionaries felt the time had come to meet the Aucas face-to-face.\n\nOne day while flying over Auca territory, Nate Saint spotted a beach that looked long enough to land the plane on. He planned to land there and the men would build a tree house to stay safe in until friendly contact could be made.\n\nThe missionaries were flown in one-by-one and dropped off on the Auca beach. Nate Saint then flew over the Auca village and called for the Aucas to come to the beach. After four days, an Auca man and two women appeared. It was not easy for them to understand each other since the missionaries only knew a few Auca phrases. They shared a meal with them, and Nate took the man up for a flight in the plane. The missionaries tried to show sincere friendship and asked them to bring others next time.\n\nThe missionaries waited for other Aucas to return for the next two days. Finally, two Auca women walked out of the jungle on day six. Jim and Pete excitedly jumped in the river and waded over to them. As they got closer, these women did not appear friendly. Jim and Pete almost immediately heard a terrifying cry behind them. As they turned they saw a group of Auca warriors with their spears raised, ready to throw. Jim Elliot reached for the gun in his pocket. He had to decide instantly if he should use it. But he knew he couldn't. Each of the missionaries had promised they would not kill an Auca who did not know Jesus to save himself from being killed. Within seconds, the Auca warriors threw their spears, killing all the missionaries: Ed McCully, Roger Youderian, Nate Saint, Pete Fleming and Jim Elliot.\n\nWaiting to Hear\n\nLate in the afternoon of Sunday, January 8, Elisabeth Elliot, Jim's wife, waited by the two-way radio to hear Nate Saint and his wife discuss how things had gone that day. But there was no call. As evening turned to night, the wives grew worried. They knew the news was not good.\n\nThe next morning another missionary pilot flew over the beach to look for the men. He saw only the badly damaged plane on the beach.\n\nNews quickly spread around the world about the five missing missionaries. A United States search team went to the beach, found the missionaries' bodies, and buried them.\n\nBut don't think Operation Auca ended there because it didn't. In less than two years Elisabeth Elliot, her daughter Valerie, and Rachel Saint (Nate's sister) were able to move to the Auca village. Many Aucas became Christians. They are now a friendly tribe. Missionaries, including Nate Saint's son and his family, still live among the Aucas today.\n\nElisabeth Elliot even helped make a movie about Operation Auca called Through Gates of Splendor. It showed real-life scenes of the five missionaries on the beach with the friendly Aucas. It also included footage of the two years she and her daughter spent living in an Auca village.\n\nJim Elliot's Mission and Legacy\n\nDuring his life, Jim Elliot longed for more people to become missionaries. In his death, however, he probably inspired more people to go to other countries to share the love of Jesus than he ever could have in life.\n\nMake It Real! Questions to make you dig a little deeper and think a little harder.\n\nJim desired to serve God as a missionary. How do you desire to serve God? Jim chose not to use a gun to protect himself when attacked by the Aucas. Why? What would you have done and why? Jim's wife and daughter went to live with the Aucas after Jim was killed. Can you imagine choosing to live in the Auca village after such a tragedy?\n\nSuggested reading: Jim Elliot by Kathleen White (Men of Faith series, Bethany House Pub.) Jim Elliot by Susan Miller (Heroes of the Faith series, Barbour Pub.) Jim Elliot: One Great Purpose by Janet & Geoff Benge (Christian Heroes: Then and Now series, Ywam Pub.)\n\n\n\nFurther Reading:\n\nWho Were the Five Missionaries Who Died in the Ecuador Jungle?\n\nMissionaries Died in Ecuador Jungle\n\n9 Missionaries All Christians Should Know\n\nA Tribute to Elisabeth Elliot\n\nPhoto credit: Flickr/North Valley Baptist Church"}, {"url": "https://www.persecution.com/stories/stories-of-christian-martyrs-jim-elliot-pete-fleming-ed-mccully-nate-saint-roger-youderian/", "page_content": "A news flash alerted the world: “Five Men Missing in Auca Territory.” The date was Monday, January 9, 1956. A team of missionary pioneers trying to make peaceful contact with an infamous tribe of Indians in Ecuador, the Waodani, had failed to make a scheduled radio call. For almost a full day no word had come from their camp on the Curaray River, which they named “Palm Beach.” Then a hovering pilot reported the badly damaged plane at the camp. This was followed by a gruesome confirmation on Wednesday, January 11, when the first body was spotted in the river. Though a search and rescue team was quickly formed, the discovery of more bodies quickly changed the mission from rescue to retrieval and burial.\n\n\n\nBy Friday of that week the team reached the missionaries’ campsite\n\nand hurriedly buried four of the bodies. The men had died violently from\n\nrepeated spear wounds and machete cuts. The fifth body (Ed McCully)\n\nwas never located after being identified on the beach but then washed\n\naway by the river. Five widows and eight orphans mourned the deaths\n\nand looked to God for comfort and direction. The world witnessed in\n\nstunned amazement.\n\n\n\nShockwaves from the tragedy traveled around the globe. Eventually,\n\nthousands of Christians identified the news of the deaths of five young\n\nmen as the turning point in their lives. In her book, Through Gates of\n\nSplendor, written a year after the deaths, Jim Elliot’s widow, Elisabeth,\n\ndescribed some of the remarkable early results from what seemed like a\n\ntragic waste of life. The places of service vacated by those men were filled\n\nmany times over by young men and women moved and motivated by\n\ntheir selfless sacrifice. Fifty years later, the effects continue to be felt.\n\nWithin two years of their deaths, Elisabeth Elliot and Nate Saint’s\n\nsister made a friendly and lasting contact with the Waodanis. Bible\n\ntranslation into the Waodani language began. One by one, the men who\n\ncommitted the murder became believers in the One who sent the missionaries to reach them. Steve Saint spent much of his childhood among the Waodanis. Despite the fact that they had killed his father, Steve\n\nbecame an adopted son of the tribe and eventually took his own family\n\nto live for a time among them. The painful arrival of the Gospel among\n\nthat violent people worked a miracle of transformation.\n\n\n\nWhile martyrdom has always been part of the great battle between\n\ngood and evil in the spiritual realms, the death of believers has not\n\nalways resulted directly from those seeking to silence their witness.\n\nViolence has often been an expression of fear, suspicion, ignorance or\n\ntiming rather than a conscious rejection of the message. The five men\n\nwho died in Ecuador had spent months contacting the Waodanis\n\nthrough over-flights and gifts exchanged via an ingenious bucket drop\n\ndevised by the team’s pilot, Nate Saint. Though the tribe had a history\n\nof violent encounters with outsiders, the men had decided they had\n\nestablished some degree of mutual trust that would support a direct\n\ncontact. At first, their cautious optimism had been rewarded by a visit\n\nfrom three Waodanis. That had occurred without incident. They had\n\nexpected further contact. Little did the missionaries know that they had\n\nstepped into an intra-tribe squabble.\n\n\n\nWhen the attack party killed the five men, their actions weren’t\n\npersonal or even driven by what or who the white men represented. The\n\nviolence was almost a diversion from internal issues the Waodanis\n\ncouldn’t handle. Two of the three who had visited the camp at Palm\n\nBeach reported that the missionaries had mistreated them; the third\n\nperson argued otherwise. Though others in the group recognized the\n\nfalse accusations, it seemed easier to eliminate the cause (the missionaries)\n\nthan to address the internal issues. Once the possibility of killing was\n\nraised, the general tone in the tribal group shifted to well-established\n\npatterns of preparation for battle. They knew the white men had guns; they didn’t know they wouldn’t use them. Several of the Waodanis\n\nreported hearing strange supernatural voices and seeing moving lights\n\nin the sky during the attack, as if God sent an angelic choir to celebrate\n\nthe faithfulness and the homecoming of His loyal servants.\n\n\n\nSteeped in generations of horrific hand-to-hand combat, combined\n\nwith the heightened memory that tends to characterize verbal cultures,\n\nthe Waodani display an amazing capacity for remembering the details\n\nof battles. Lengthy conversations among the Waodani often consist of\n\nshow-and-tell descriptions of spear and machete scars and gruesome\n\nminutiae of the deaths of enemies. But it wasn’t until years later that Steve\n\nSaint heard the full story of the raid. Reminiscing by a fire late at night,\n\nthe aging warriors gave an account of the event, still amazed that the\n\nwhite men had done nothing to defend themselves. Steve learned that\n\nMincaye, who had since become a father to him, had actually been the\n\none who had dealt the deathblow to his father. As soon as he knew, Saint\n\nrealized it didn’t really matter. What mattered was that God had used\n\nan amazing mixture of spiritual weapons, including the deaths of five\n\nservants, to defeat the power of fear and violence that had kept the Waodani captive as far back as they could remember.\n\n\n\nIn his book End of the Spear, Saint reports that he has been\n\nfrequently asked over the years about the struggle he must have experienced to forgive those who had taken his father from him. He has always responded that it was never a struggle for him. Even to his grieving five-year-old mind, the death of his father and friends had been a part of\n\nGod’s plan. You don’t have to forgive someone whom you have never\n\nheld responsible for an act.\n\n\n\nTrue to the Maker and Mover behind the scenes, the story of the\n\nWaodani displays God’s ways. Those who were once the impossible-to-reach are now taking their place among those who reach out. Believers\n\namong the Waodani have suffered for Christ and at least one has experienced martyrdom. Their long history with violence makes them keen observers of the state of the “modern” world, where the increasing fascination and practice of hatred, violence, and killing appear all too familiar for those recently freed from that life of despair. God’s deeper\n\npurposes take time to come to light. Occasionally, those who are paying\n\nattention get to see those purposes shine and are amazed.\n\n\n\n“Before being shot by you, we wish\n\nto thank you heartily for what you\n\nhave meant to us. You baptized us;\n\nyou taught us the way of eternal life,\n\nyou gave us Holy Communion with\n\nthe same hand in which you now have\n\na gun… God bless you, and remember\n\nthat our last thought of you was\n\nnot one of indignation against\n\nyour failure. Everyone passes\n\nthrough hours of darkness.\n\nWe die with gratitude.”\n\n—Two Christian girls, Chiu-Chin-Hsiu and\n\nHo-Hsiu-Tzu, who were killed by their pastor, whom\n\nthe guards had promised to release if he shot them"}, {"url": "https://www.christiantoday.com/article/tragedy-and-transformation-nate-saints-grandson-jamie-now-calls-the-tribe-who-killed-his-grandfather-family/105709.htm", "page_content": "Tragedy and transformation: Nate Saint's grandson Jamie now calls the tribe who killed his grandfather 'family'\n\nJamie Saint's life has been shaped by tragedy and radical transformation. His famous missionary grandfather was murdered by the tribe he was trying to reach out to in 1956. Through years of hard work, the tribe and family have reconciled, and their story has inspired Jamie's missionary work across the world today.\n\nNate Saint joined the Mission Aviation Fellowship (MAF) in the late 1940s, where he piloted small planes serving missionaries in the Amazon rainforest of Ecuador, South America. In 1955 Saint located an Indian tribe he had been searching for: the Waodani people.\n\nNate, with the help of four other missionaries including Jim Elliot, initiated contact with the tribe through 13 weeks of gift-giving via 'bucket drops' from his aircraft. The gift-giving was reciprocated by the tribe and so the missionaries decided to make personal contact. There was one successful day of drinking lemonade with tribe members on the beach, but two days later, the missionaries arrived on the beach and were speared to death by the Waodani tribe.\n\nThe story of this group – known as Operation Auca – is famous among missionary chronicles. It was a brutal tragedy that saw the missionaries become modern martyrs. But this tragedy was also the beginning of a story of hope.\n\nWhen I discuss his grandfather's story with Jamie Saint, he offers a startling analysis: 'God did not allow those killings to take place. He actually orchestrated them.'\n\nSaint points to complex tribal politics, only understood years after the fact, that led to the murder of his grandfather. The missionaries unwittingly became involved in a bloody family vendetta that had been taking place at the time of their arrival. Such killings were not unusual in the Waodani tribe, where there was a 60 per cent homicide rate.\n\nHowever, Saint highlights the unique, precise circumstances of the killings that have led him to conclude that God directly orchestrated the events.\n\nAs he explains: 'Without those killings, the next chapter of the story wouldn't have been written.\n\n'Through a series of events, the warrior who speared my grandfather, ended up adopting my Dad.'\n\nThe story of adoption and family reconciliation was possible because Jim Elliot's wife Elizabeth and Nate Saint's sister Rachel returned to the tribe. Through years of hard work and communication they brought many of them to Christ. The missionaries developed a written language for the Waodani and a translation of the New Testament.\n\nSoon the Waodani invited the westerners to stay with them and teach them useful skills for meeting the needs of the people.\n\n'You teaching us, together will teach everyone,' they said.\n\nThis sharing of knowledge, so that it could be passed on again and again, was the beginning of the Indigenous People's Technology and Education Centre (I-TEC) founded by Jamie's father Steve, with which Jamie now works today.\n\nJamie says: 'We train Christ followers around the world on how to meet their own people's physical needs, as a door for the gospel.'\n\nI-TEC travel around the world teaching skills of film, storytelling, mechanics, medicine, dentistry. These skills give indigenous people the capacity to meet people's 'felt needs' which calms hostility and gives them credibility for the gospel message they have to share. Jamie says that through I-TEC's ministry, hundreds of thousands, possibly even millions have been affected.\n\n'We have been given this vision by the tribe, and believe this is a biblically correct, culturally sensitive approach to mission,' he says.\n\nSaint sees I-TECs work as part of an emerging approach to mission across the world: 'There's a major push to focus on training and equipping, to empower people rather than going and doing. Not creating dependency, empowering the indigenous Church to be self-sustaining, self-propagating and self-governing.'\n\nThis helps keep the focus on serving the people in need, not simply the 'experiences' of those who make the trips. He says: 'When the focus is on what you're gonna get rather than what you're gonna give, then mission goes backwards.'\n\nDoes Jamie struggle with the weight of his family's legacy? He refers to a 'big shadow' hanging over him from his father and grandfather.\n\n'I'm referred to as the grandson of Nate Saint or the son of Steve Saint. But God never told me to be Nate Saint or Steve Saint and I can't be those guys...what God wants from me is to write my story in the way that he wants to write it, and use me in the way that he's gifted me.'\n\nThe interest in 'God's story' is one that now guide's Jamie's life.\n\n'God has a story to write with each of our lives, while he doesn't promise that every chapters going to be easy, he promises to make sense of even the difficult chapters.\n\n'Years ago, I said, Lord, you write my story...just show me enough so that I can be obedient.'\n\nHe says the story of his grandfather has now 'come full circle', as I-TEC still regularly partners with MAF in its work. The relationship with the Waodani tribe – who Saint describes as 'family' – continues, with several visits a year. There are very few killings now, he says, and the Waodani 'take care of us'.\n\nThe Waodani people, in contrast to white developed-world westerners, Saint says, have a unique, profound understanding of 'relationship'.\n\nHe says: 'In the developed world in the west, we're so scheduled and busy with life. In the jungle if they have food and shelter, that's all there is to life. They spend a lot of time just being together, telling stories – its relational.'\n\nSaint holds no grudges for the killings that took place in 1956.\n\n'They didn't know any better. This is not a story that my grandpa wrote, it's a story that God wrote. If I was to harbour resentment, I'd really be harbouring resentment to the story that God wrote. I've found that's not a good idea.'\n\nYou can follow @JosephHartropp on Twitter"}, {"url": "http://missionaryportal.webflow.io/biography/nate-saint", "page_content": "Nathanael \"Nate\" Saint was an evangelical Christian missionary pilot to Ecuador. He was accompanied by four others: Jim Elliot, Pete Fleming, Ed McCully, and Roger Youderain. All five were killed while attempting to evangelize the Huaorani people through efforts known as Operation Auca.\n\nEarly Life\n\nNate Saint was born in 1923. When he was seven he took his first plane ride with his brother Sam, who would eventually become a commercial pilot for American Airlines. While in the airplane he discovered a love of flying.\n\n‍\n\nHis family was somewhat unusual. His brothers made a sleeping patio on the roof of their home, and his dad built a roller coaster in the backyard.\n\n‍\n\nWhen he joined the army he was stationed in Las Vegas NV, but was transferred to several other locations over the years. A leg injury from a sledding accident caused him some problems while he was in the army. About a year before he was discharged, he almost died while climbing a mountain in Yosemite National Park. After that incident he learned to live life to the fullest.[1]\n\n‍\n\nWhen Nate was asked by a friend to fix a plane somewhere in Mexico, he finally agreed. After he repaired the plane, he discovered a need for his skill in the field of mission-work and also a new awareness of the value of missions. After going to Wheaton College, Nate married Marjorie Farris (commonly called Marj) in 1948 and eventually moved to Shell Mera, Ecuador. Here, Nate built his family a house which would also serve as a guesthouse and a radio center with the other missionaries.[2]\n\nLife in Ecuador, Meeting the Huaroni\n\nIn September 1955, Nate was joined by his teammates, Jim Elliot, Ed McCully, Pete Fleming, and Roger Youderian. Saint finally found a Huaorani settlement while searching by air. To reach the tribe, Saint and the team lowered gifts to the Huaorani in a bucket tied to the plane.\n\n\n\n\n\nThe Huaorani were widely feared by other Ecuadorians, because they combined a desire to be left alone with a willingness to use force. They attacked and killed any intruders without provocation. Nevertheless, the tribe was excited on receiving the gifts and gave some gifts back.\n\n\n\n\n\nFinally, the missionaries decided to try to meet the Huaorani on the ground; and, on January 3, 1956, using the beach as a landing strip, they set up camp four miles from the Huaorani settlement.\n\n\n\n\n\nHow Nate Saint Died\n\nTheir initial contact was encouraging; however, on Sunday, January 8, 1956, the entire team was killed on the beach (known as \"Palm Beach\") when armed Huaorani met and speared them.[3] Nate Saint was the first of the five missionaries to be speared to death.\n\n\n\n\n\nSaint and the other four men became famous worldwide as a result. Life magazine published a 10-page photo essay on the story, which was also covered in Reader's Digest and many other publications. Today, a small school for missionary children in Shell, Ecuador, bears Nate Saint's name. After 51 years, the school has closed in 2017 due to falling enrollment.\n\n\n\n\n\nRachel Saint, Nate's sister, continued the mission efforts to the Huaorani, which eventually came to fruition. This resulted in many of these natives becoming Christians, including those who had killed Saint.[3]\n\n\n\n\n\nNate Saint's Family\n\nParents:\n\nLawrence Saint\n\nKatherine Saint\n\nSpouse:\n\nMarjorie Saint‍\n\nChildren:\n\nKathy Saint Drown\n\nSteve Saint\n\nPhilip Saint\n\nSiblings:\n\nRachel Saint\n\nSam Saint\n\nPhil Saint\n\nDan Saint\n\nDave Saint\n\nSteve Saint\n\nBen Saint\n\nRecommended Resources on Nate Saint\n\nNate Saint Movies\n\nNate Saint Books\n\nNate Saint Quotes\n\n\"People who do not know the Lord ask why in the world we waste our lives as missionaries. They forget that they too are expending their lives... and when the bubble has burst they will have nothing of eternal significance to show for the years they have wasted.\" “Son, we can’t shoot the Waodani. They’re not ready for heaven... we are.” \"When life's flight is over, and we unload our cargo at the other end, the fellow who got rid of unnecessary weight will have the most valuable cargo to present the Lord.\" \"If God would grant us the vision, the word sacrifice would disappear from our lips and thoughts; we would hate the things that seem now so dear to us; our lives would suddenly be too short, we would despise time-robbing distractions and charge the enemy with all our energies in the name of Christ. May God help us ourselves by the eternities that separate the Aucas from a Comprehension of Christmas and Him, who, though he was rich, yet for our sakes became poor so that we might, through his poverty, be made rich.\" \"I would rather die now than to live a life of oblivious ease in so sick a world.\" \"As we have a high old time this Christmas may we who know Christ hear the cry of the damned as they hurtle headlong into the Christless night without ever a chance. May we be moved with compassion as our Lord was. May we shed tears of repentance for these we have failed to bring out of darkness. Beyond the smiling scenes of Bethlehem may we see the crushing agony of Golgotha.\" \"It was traumatic but exhilarating to feel what my father felt. I remember the ache of the separation from the people I loved. I would never go back to that time. Yet the things I learned benefited my life.\"\n\n\n\n\n\nFun Facts About Nate Saint\n\nNate went on his first plane ride with his brother Sam when he was seven years old. Rachel Saint lived with the Huaroni two years after he died. She served as a missionary to Peru before later joining Nate in Ecuador. Nate had six brothers and one sister. Nate’s father, Lawrence Saint, was a famous stain-glass artist, who worked on the Washington National Cathedral. His father was also a painter, specializing in landscape painting and silhouette cutting. As a kid, Nate built an 8-foot sailboat and took apart a car engine just to put it back together again.\n\nSources\n\nThis information is provided under the Wikipedia Creative Common License."}, {"url": "https://www.christianitytoday.com/news/2021/march/wheaton-college-missionary-plaque-jim-elliot-waorani.html", "page_content": "The college plans to update the inscription to “reflect the full dignity” of the Waorani tribe.\n\n|\n\nImage: Courtesy of Wheaton College\n\nEdman Chapel\n\nMore than 65 years after two of its alumni were killed in what became the most famous example of missionary martyrdom in the 20th century, Wheaton College wants to tell a better story to honor their work.\n\nWheaton president Philip Ryken announced this week that a plaque honoring alumni Jim Elliot and Ed McCully along with Nate Saint, Roger Youderian, and Pete Fleming has been taken down from the campus chapel while a task force meets to suggest new phrasing to remove the word “savage.”\n\nElliot and McCully graduated from Wheaton in 1949. The five men were killed in January 1956 after making peaceful contact with the isolated and hostile indigenous group in Ecuador. The following year, their classmates donated the plaque, which includes relief images of Elliot and McCully.\n\nIn describing the tribe, then called “Aucas” (“savage” in the lowland Quichua language), the plaque reads, “For generations all strangers were killed by these savage indians.” Contemporary accounts of the mission now refer to the tribe by the name they call themselves, Waorani.\n\nIn his emailed statement, Ryken said the term “savage” is a pejorative term that “has been used historically to dehumanize and mistreat indigenous peoples around the world. Any descriptions on our campus of people or people groups should reflect the full dignity of human beings made in the image of God.”\n\nRyken and other members of Wheaton leadership have received about a dozen comments about the plaque this school year from students and members of the campus community, said Joseph Moore, Wheaton’s director of marketing communications. He said the president released the statement because the plaque has been temporarily removed, and leadership wanted the campus community to “know about its review, rewording, and return.”\n\nThe change comes at a time when Gen Z Christians are rethinking the church’s historical approach to international missions. Last year, a Barna study found that 38 percent of adults under 35 agreed with the statement, “in the past, missions work has been unethical,” compared with 23 percent of older adults.\n\nThe rewording of the Wheaton plaque also reflects how the narrative around the Ecuador missionaries has evolved. Elisabeth Elliot’s Through Gates of Splendor—written in just eight weeks and submitted right before the first anniversary of her husband’s death—became the “go-to evangelical account” of what happened, said Lucy S. R. Austen, author of a forthcoming biography of Elisabeth Elliot.\n\nIn subsequent writings, though, Elisabeth sought to dispel the idea of the Waorani as wild savages and Americans as the great saviors, particularly in her third book The Savage My Kinsman. She continued to minister and live among the tribe for years after the killings.\n\n“But in evangelical America we have tended to keep right on telling and retelling the same little sliver of time, in the same streamlined version of events, with the same triumphal gloss that Elliot laid down in 1956, and the same almost exclusive focus on the five men themselves,” Austen said.\n\nShe hopes as Americans revisit the story of the slain missionaries, they will re-examine their attitudes toward it and what we focus on when we remember and retell such accounts.\n\n“It seems to me that white Americans tended to have a faulty understanding of non-Western cultures when the plaque was given, and that now that we know better, changing the plaque would be a great chance to do better,” said Austen.\n\nIn recent years, several evangelical institutions have taken the opportunity to “do better” in the ways they remember their missionary past.\n\nIn 2016, Whitman College, named in memory of slain missionaries Marcus and Narcissa Whitman, dropped the mascot “Fighting Missionaries.” The Whitmans wanted to bring the gospel to the tribes living in the Oregon Valley, but their good intentions were mired by their sense of cultural superiority.\n\nMembers of the Cayuse tribe killed the Whitmans in November 1847, more than 11 years after the Whitmans first arrived and in the midst of a measles outbreak brought by white settlers that killed far more natives than white people.\n\n“I do not think a mascot … should precipitate the difficult conversations around challenging ideas. A mascot is meant to be something around which supporters of a college, and particularly athletic teams, rally,” Whitman College president Kathleen Murray said at the time.\n\nAnd the Haystack Monument, a marker on the Williams College campus commemorating five students who hid in a haystack during a violent storm and dedicated their lives to foreign missions, has received extra scrutiny in recent years, though it remains in its place on campus.\n\nWheaton has grappled with missionary violence in the past, too. For its first 73 years, the school’s mascot was the Crusaders, a name it dropped in 2000. In announcing the change, then-president Duane Liftin said, “I came to realize that those [Crusades] were not very happy episodes in Christianity. They are not something we want to glorify.\" The school is now known as the Wheaton Thunder.\n\nCross-cultural missionaries have always had to navigate the complexities of their role. Even in previous generations, Christians see examples of how leaders did so with cultural sensitivity and humility, said Lloyd Kim, coordinator for Mission to the World. He points to 19th century missionary Hudson Taylor—who dressed in Chinese clothing, grew out his hair like Chinese men, and required the missionaries with his China Inland Mission to do the same—as an example of humility in evangelism.\n\nAs international missions becomes more culturally diverse, one of the most significant changes is that mission agencies are letting national partners lead. Western missionaries, instead, come in as guests. “We’re trying to dispel the attitude that says, ‘We are the heroes coming to save you.’ We are coming in as learners,” Kim said."}, {"url": "https://missionsbox.org/missionary-bio/nate-saint/", "page_content": "“People who do not know the Lord ask why in the world we waste our lives as missionaries. They forget that they too are expending their lives … and when the bubble has burst, they will have nothing of eternal significance to show for the years they have wasted.” – Nate Saint\n\nHis Early Life and Times\n\nNate Saint was born in 1923 near Philadelphia, Pennsylvania. The seventh of eight children, he was raised in a devout Christian home.\n\nLike many young men in the first half of the 20th century, he was fascinated with airplanes. In 1930, at the age of seven, one of his older brothers gave him a ride on a plane. Three years and some thrilling flights later, his brother let him take the controls on a flight. From that time on, he was fascinated, not only with airplanes; he became fascinated with flying.\n\nIn 1942, at the age of 19, Nate enlisted in the U.S. Army where he expected to become a pilot during World War II. Unfortunately, due to a lingering infection, the Army would not allow him to fly. Nate turned that into an opportunity to become an aviation mechanic. He learned valuable lessons in that position that he would use later.\n\nHis Unexpected Life in Aviation\n\nFollowing Nate’s three years in the military, he obtained a commercial pilot’s license and enrolled at Wheaton College. During that time, his father made him aware of the newly established Christian Airmen’s Missionary Fellowship (CAMF) which eventually became the Mission Aviation Fellowship.\n\nThe MAF began transporting missionaries into hard-to-reach places in the jungles of Mexico, Peru, and Ecuador. While at Wheaton, Nate committed his life to serving the Lord as a missionary and missions pilot. He so with the understanding that the work would be dangerous. In one year alone, 51 people died in missionary plane crashes in the jungle. In 1948, Nate and his wife traveled to Ecuador to open an MAF base at Shell Mara.\n\nHis Eventful Life in Ecuador\n\nMissions work in Ecuador did not start well for the avid missionary pilot. In December of his first year, the plane he was piloting crashed after a powerful downforce of wind drove it into the ground. Nate suffered a broken back and other injuries that kept him in a body cast for six months.\n\nThe bulk of Nate’s work was transporting missionaries to villages that would otherwise have taken many days to reach traveling on foot. Once they were in place, he delivered food and supplies for their sustenance and work. Often supplies included medicines and medical equipment they would use to treat illnesses in the tribes to which they ministered.\n\nNate solved one of the early problems in jungle missionary aviation while serving the Lord in Ecuador. Pilots would drop supplies in predetermined locations, but some supplies were destroyed when the hit the ground, and more ended up in the treetops of the jungle canopy. Nate devised a method of safely and efficiently lowering supplies using a bucket and a rope while circling overhead. Not only were the supplies delivered, but the missionaries were able to send messages and other items up to the plane using the device.\n\nNate described his life in Ecuador this way:\n\n“It is our task to lift these missionaries up off those rigorous, life-consuming, and morale-breaking jungle trails—lift them up to where five minutes in a plane equals twenty-four hours on foot. The reason for all this is not a matter of bringing comfort to the missionaries. They don’t go to the steaming, tropical jungles looking for comfort in the first place. It’s a matter of gaining precious time, of redeeming days and weeks, months and even years that can be spent in giving the Word of Life to primitive people.”[1]\n\nHis Eventual Loss in Ecuador\n\nNate and four other missionaries had developed a burden to reach the Aucas, a reclusive tribe of native Indians known to kill others found in their territory. The Ecuadorian government had been considering sending troops in to subdue the natives.\n\nNonetheless, Nate, Jim Elliot, Ed McCully, Peter Fleming, and Roger Youdarian began an effort to break through to the tribe. They started by making flights over the village, dropping gifts from pots and pans to trinkets. Having received what they considered a warm response, they determined that it was time to meet the Aucas in person.\n\nOn January 8, 1956, the five landed the plane on a strip of side alongside a river near the village. They were to make scheduled radio calls to their families back at the airfield compound, but no transmissions were ever made. The Aucas had massacred Nate and the others and left their bodies in the river and along the beach.\n\nThe story made major headlines, including an entire photo spread in Life magazine.\n\nHis Eternal Legacy\n\nJesus said that “even the gates of Hell shall not prevail” against the Kingdom of God and His Church. Indeed, the spears of the Aucas could not. Instead of retreating in fear and defeat, the effort to reach the Aucas continued, including the personal ministry of Nate’s son Steve and sister Ruth and Jim Elliot’s wife Elisabeth, each of whom eventually lived with and ministered to the Aucas.\n\nTheir continued work has created an eternal legacy as many of the Aucas natives have accepted Jesus Christ as their Lord and Savior over the years, including six of the men who participated in the raid and killed Nate and his fellow missionaries.\n\nThe Indians told their families that they were puzzled at why the men did not fight but willingly gave up their lives. Their amazement opened the door for the women to tell them that the men were there to tell them about Jesus Christ who “freely allowed his own death” to ransom them from sin and its inevitable price.\n\nRachel Saint spent the rest of her natural life with Wycliffe Bible Translators among the Aucas and is buried in Ecuador.\n\nKimo, the pastor of the tribe, requested the honor of baptizing Steve and Kathy, Nate’s children, to demonstrate their reconciliation through Christ. The pastor had been a member of the killing party.\n\nGikita, the leader of the attack, died a believer at the age of 80. He said that he was “eager to go to Heaven and live peacefully with the five men who came to tell them about Creator God.”[2]\n\nAs Nate Saint said, “When life’s flight is over, and we unload our cargo at the other end, the fellow who got rid of unnecessary weight will have the most valuable cargo to present to the Lord.”\n\n[1] Jungle Pilot: The Life and Witness of Nate Saint, Russell T. Hill, Copyright 1959 by The Fields, Inc,, Harper Collins Publishers, Inc.\n\n[2] Even Unto Death: Wisdom from Modern Martyrs, edited by Jeanne Kun, The Word Among Us Press, 2002."}, {"url": "https://christianhof.org/youderian/", "page_content": "Operation Auca\n\n1923 – 1956\n\n“Go Ye and Preach the Gospel. Five did and Died”. This was the title of the January 30, 1956, Life magazine article that told of five missionaries who\n\nlost their lives while striving to accomplish the command given by Jesus Christ in Mark 16:15. Operation Auca was an attempt by five American\n\nmissionary families to contact the Huaorani people of the rainforest of Ecuador. The Huaorani, also known as Aucas (a modification of awqa, the Quechua word for “enemies”), were an isolated tribe known for their violence against both their own people and outsiders who entered their territory. With the intention of being the first Christians to evangelize the previously unreached Huaorani, the missionaries began making regular flights over Huaorani settlements in September 1955, dropping gifts. After several months of exchanging gifts, on January 3, 1956, the missionaries established a camp at “Palm Beach,” a sandbar along the Curaray River, a few miles from Huaorani settlements. Their efforts ended on January 8, 1956, when all five—Jim Elliot, Nate Saint, Ed McCully, Peter Fleming, and Roger Youderian—were attacked and speared by a group of Huaorani warriors. The news of their deaths was broadcast around the world, and Life magazine covered the event with a photo essay.\n\nThe deaths of the men galvanized the missionary effort in the United States, sparking an outpouring of funding for evangelism efforts around the world. Their work is still frequently remembered in Christian publications, and in 2006 was the subject of the major motion picture film production, End of the Spear. Several years after the death of the men, the widow of Jim Elliot, Elisabeth, and the sister of Nate Saint, Rachel, returned to Ecuador as missionaries with the Sumner Institute of Linguistics (now SIL International) to live among the Huaoranis. This eventually led to the conversion of many, including some of those involved in the killing. Only eternity will tell how many lives have been impacted around the world for the cause of Christ because of the obedience of these missionaries to surrender their lives to preach the Gospel.\n\nArtist note: Pictured left to right: (Row 1) Pete Fleming, Nate Saint and Jim Elliot; (Row 2) Roger Youderian and Ed McCully"}], "Jim Elliot was a missionary in the Missionary Aviation Fellowship's (MAF) Ecuadorian Mission.": [{"url": "https://hub.maf.org/ministry/mafaviation/changing-airplanes-unchanging-mission", "page_content": "When WWII pilots envisioned using small aircraft to help the gospel spread to hard-to-reach areas, could they have imagined what missionary aviation looks like today? Could MAF’s founders have conceived of the complexity of the tools—the aircraft—that now make up the MAF fleet?\n\nNow, more than 75 years after the start of MAF’s ministry, its aircraft have changed dramatically. But one thing that has not changed is MAF’s mission*—to share the love of Jesus Christ so that isolated people will be physically and spiritually transformed.\n\nThe Beginnings (1945 – 1965)\n\nFabric-covered airplanes like the Piper Cruiser, Piper Pacer, and the Stinson Voyager helped start the earliest programs, in Mexico and Central and South America. These light aircraft served remote jungle outposts where western missionary families were bringing the gospel to remote tribes. MAF pilot Nate Saint was passionate about reaching one tribe in particular—one that was feared as a “tribe of killers.” In 1948, he wrote to his parents that he expected the airplane would play a part in reaching them with the gospel.\n\nHis prediction proved true. In January 1956, Saint landed a bright yellow Piper Family Cruiser on a sandbar nicknamed Palm Beach, along the Curaray River. Initially, he and four other missionaries had friendly interactions with members of the feared Waorani. But then, days later, the world learned of the five men’s martyrdom at the hands of the tribe.\n\nFar from slowing down the dream of those early WWII pilots, this incident catapulted the idea of missionary aviation across the globe. As a result, young Christians caught the vision of using airplanes to reach the lost—and MAF grew rapidly.\n\nThe Growing Years (1965 – 1990)\n\nAs MAF moved from fabric-covered to aluminum aircraft, small Cessna aircraft became the workhorses of the day.\n\nIn Indonesia, Cessna 185s and 206s served western missionaries and local evangelists in hard-to-reach areas, and the gospel continued to spread. These new birds nearly doubled the range and load of those earlier aircraft and opened more doors for physical healing, education, community development, and disaster relief to reach isolated people.\n\nA second-generation MAF pilot, Dick Parrott, son of MAF founder/former president Grady Parrott, recalls opening the West Kalimantan, Indonesia, program in 1969 with a brand new C185, PK-MCB, that came to be known as “Charlie Brown.” As the sole pilot/mechanic on the program at the time, Dick was responsible for fixing and flying the airplane.\n\nOf course, other pilots and airplanes followed, and the program expanded to East Kalimantan (now North Kalimantan) and, later, Central Kalimantan. Those small Cessnas brought physical healing to isolated people through a partnership with a Baptist mission hospital, and they enabled the training of 100,000 Dyak Christians through a theological education program. MAF also served a C&MA Bible school there.\n\nA few years ago, when Dick learned that Charlie Brown was going to be removed from service, he was surprised.\n\n“I was amazed that it was still in operation,” said Dick. “You know, MAF does a great job keeping their equipment operational.”\n\nOver in Papua, Indonesia, MAF was continuing to serve western missionaries who were working on Bible translations. Along with the small Cessna airplanes, MAF introduced another aircraft to its fleet in 1976, the helicopter. This new tool helped missionaries survey still-unreached areas and allowed them to live remotely until an airstrip could be built.\n\nRecent Years (1990s – 2020)\n\nIn more recent years, MAF introduced larger, more complex turbine-engine aircraft to its fleet—Cessna Caravans, Quest Kodiaks, and a PC-12. These brought another big jump in range and load capabilities, plus advanced technology that increased safety and efficiency. And, they use jet fuel, verses aviation gasoline (Avgas), which is more readily available overseas.\n\nIn March 2016, an MAF Caravan landed at the Todro airstrip in the Democratic Republic of the Congo. It carried MAF staff, SIL missionaries and local dignitaries who had come to celebrate the completion of the Logoti-language New Testament—a project that moved forward with MAF’s help through years of war and insecurity.\n\nMAF’s service spans multiple decades when it comes to bringing the gospel to a remote people group, serving missionaries working on a translation, delivering completed Bibles, and supporting local churches.\n\nThese decades of service typically represent multiple aircraft as well—the right aircraft for the job.\n\nBut no matter the airplane make, model, or size, each one serves a kingdom purpose—to reach isolated people with the love of Jesus Christ. And each one is meticulously maintained thanks to the support of people like you who have stood with us through the years; people who still believe that the airplane can play a part in introducing people to the gospel.\n\n*When this story was written, we were still using our old vision and mission statements. In 2021 we rephrased them slightly, though the intent is the same. You can see them here."}, {"url": "https://www.christiantoday.com/article/i-miss-my-father-but-he-gave-his-life-for-christ-daughter-of-murdered-christian-missionary-speaks-out/104967.htm", "page_content": "'I Miss My Father, But He Gave His Life For Christ': Daughter Of Murdered Missionary Jim Elliot Speaks Out\n\nThe daughter of an American missionary murdered in the Amazon jungle says she believes God allowed it to happen so the world could see what a real commitment to Christ actually means.\n\n'My father and the other four missionaries definitely knew it was dangerous, but they were willing to give up their lives in order for the Huaorani to know the truth - what we believe be the truth,' Valerie Shepard tells the BBC World Service Witness programme.\n\n\n\nHer father Jim Elliot arrived in Ecuador in March 1952 to be a missionary to the indigenous tribes in the Amazon jungle.\n\nHe found out about the tribe, then called the Auca tribe, from a pejorative Quechua word for 'savages', through another missionary who had been there.\n\nHe was warned they were 'violent, stone age' and knew nothing about the outside world.\n\nShepherd says: 'It just caught his heart and he felt that those were the people he was supposed to go to.'\n\nHe and the missionary pilot Nate Saint took several flights over the Amazonian jungle, looking for the tribe.\n\nHe saw an elderly man waving at him from next to a house, and felt he was being invited down.\n\nThe five missionaries then flew back, found a beach beside the river, landed and set up camp.\n\nAfter three days of waiting, two women and one young man from the tribe emerged from the jungle. 'The joy of the five men was that they were perfectly friendly and there didn't seem to be any hostility at all.' But the tribe was suspicious and began to fear they were being deceived. They decided they should kill the visitors before they were themselves killed.\n\nTen men arrived at the beach, speared the five missionaries and left the bodies in the water.\n\n'After my father's death my mother got to know two Huaorani women who had fled the tribe because of the violence. They said we want you, and the sister of Nate Saint, we want you to come and tell our people about God. While we lived with them, and we were there almost two-and-a-half years, I of course got to know all of the tribe and the ten men who had done the killing.\n\n'Amazingly, I really don't remember being afraid of them. They were always laughing and they would always make my mother laugh. So I simply enjoyed being with them. Of course it was a tragedy and I often wish I had known my dad. Still do. But I really believe that God allowed this to happen so that more and more people could actually see what real commitment to Christ means. And I really don't believe their lives were wasted.'\n\nBesides Saint and Elliot, the other three missionaries who were killed were Ed McCully, Peter Fleming, and Roger Youderian."}, {"url": "https://www.inspirationalchristians.org/evangelists/jim-elliot-biography/", "page_content": "Jim Elliot in Ecuador\n\nEarly Life\n\nJim Elliot began his life in Portland, Oregon in the USA. His mother, Clara, was a chiropractor and his father, Fred, was a minister. They married and settled in Seattle, WA where they welcomed their first son, Robert in 1921.\n\nLater they relocated the family to Portland where Herbert arrived in 1924, Jim in 1927, and Jane in 1932.\n\nJim knew Christ from an early age and was never afraid to speak about Him to his friends. At age six Jim told his mother, “Now, mama, the Lord Jesus can come whenever He wants. He could take our whole family because I’m saved now, and Jane is too young to know Him yet.”\n\nThe Years That Cemented His Desire To Serve The Lord In Missions\n\nJim entered Benson Polytechnic High School in 1941. He carried a small Bible with him and, an excellent speaker; he was often found speaking out for Christ. He and his friends were not afraid to step out and find adventure. One thing Jim didn’t have time for in those early years were girls. He was once quoted as telling a friend, “Domesticated males aren’t much use for adventure.”\n\nIn 1945 Jim traveled to Wheaton, IL to attend Wheaton College. His main goal while there was to devote himself to God. He recognized the importance of discipline in pursuing this goal. He would start each morning with prayer and Bible study. In his journal he wrote, “None of it gets to be ‘old stuff’ for it is Christ in print, the Living Word. We wouldn’t think of rising in the morning without a face-wash, but we often neglect the purgative cleansing of the Word of the Lord. It wakes us up to our responsibility.”\n\nJim’s desire to serve God by taking His gospel to unreached people of the world began to grow while at Wheaton. The summer of 1947 found him in Mexico and that time influenced his decision to minister in Central America after he finished college.\n\nJim met Elisabeth Howard during his third year at Wheaton. He did ask her for a date which she accepted and then later cancelled. They spent the next years as friends and after she finished at Wheaton they continued to correspond. As they came to know each other there was an attraction, but Jim felt he needed to unencumbered by worldly concerns in order to devote himself completely to God.\n\nIn addition to his hope to one day travel to a foreign country to share Christ with the unchurched of the world, he also felt the need to share with people in the United States. On Sundays while at Wheaton he would often ride the train into Chicago and talk to people in the train station about Christ. He often felt ineffective in his work as the times of knowingly leading people to Christ were few. He once wrote, “No fruit yet. Why is that I’m so unproductive? I cannot recall leading more than one or two into the kingdom. Surely this is not the manifestation of the power of the Resurrection. I feel as Rachel, ‘Give me children, or else I die.’”\n\nAfter college with no clear answer as to working for the Lord in a foreign country, Jim returned home to Portland. He continued his disciplined Bible study as well as correspondence with Elisabeth Howard whom he called Betty.\n\nThey both felt a strong attraction to each other during this time, but also felt that the Lord may have been calling them to be unmarried as they served Him.\n\nIn June of 1950 he travelled to Oklahoma to attend the Summer Institute of Linguistics. There he learned how to study unwritten languages. He was able to work with a missionary to the Quichuas of the Ecuadorian jungle. Because of these lessons he began to pray for guidance about going to Ecuador and later felt compelled to answer the call there.\n\nElisabeth Elliot wrote in Shadow of the Almighty:\n\n“The breadth of Jim’s vision is suggested in this entry from the journal:\n\nAugust 9. “God just now gave me faith to ask for another young man to go, perhaps not this fall, but soon, to join the ranks in the lowlands of eastern Ecuador. There we must learn: 1) Spanish and Quichua, 2) each other, 3) the jungle and independence, and 4) God and God’s way of approach to the highland Quichua. From thence, by His great hand, we must move to the Ecuadorian highlands with several young Indians each, and begin work among the 800,000 highlanders. If God tarries, the natives must be taught to spread southward with the message of the reigning Christ, establishing New Testament groups as they go. Thence the Word must go south into Peru and Bolivia. The Quichuas must be reached for God! Enough for policy. Now for prayer and practice.” “\n\nThe Ecuador Years\n\nIn February 1952 Jim finally left America to travel to Ecuador with Pete Fleming. In May Elisabeth moved to Quito and though they didn’t feel the need to get engaged she and Jim did begin a courtship.\n\nIn August Jim left Elisabeth in Quito and travelled with Pete to Shell Mera. At the Mission Aviation Fellowship headquarters in Shell Mera, Jim and Pete learned more about the Acua Indians, a people group that was largely unreached and very savage.\n\nLeaving Shell Mera, Pete and Jim moved on to Shandia where Jim was captivated by the Quichua. He felt very strongly that this was exactly where God intended for him to work to spread the Gospel.\n\nWhile Jim was in Shandia, Elisabeth was working to learn more about the Colorado Indians near Santa Domingo. In January of 1953 he went to Quito and she met him there and they were finally engaged. They married in October of that year and their only child Valerie was born in 1955.\n\nThey settled in Shandia and continued their work with the Quichua Indians. It was Jim’s desire to be able to reach the Waodoni tribe that lived deep in the jungles and had little contact with the outside world. A Waodoni woman who had left the tribe was taken in by the missionaries and helped them to learn the language.\n\nJim, along with Pete, Ed McCully, Roger Youderian, and their pilot Nate Saint began to search by plane in hopes of finding a way to contact the Waodoni. The found a sandbar in the middle of the Curaray River that worked as a landing strip for the plane and it was there that they first made contact with the Waodoni. They were elated to be able to finally be able to attempt to share the love of Christ with this people group.\n\nAfter their first meeting, one of the tribe, a man they called George lied to the tribe about the men’s intentions. This lie led the Waodoni warriors to plan an attack for when the missionaries returned. The men did return on January 8, 1956 and were surprised by ten members of the tribe who massacred the missionaries.\n\nJim’s short life that was filled with the desire to share God’s love can be summed up by a quote that is attributed to him. “He is no fool who gives that which he cannot keep, to gain what he cannot lose.”"}, {"url": "https://www.imb.org/2019/04/01/missionary-legacy-jim-elisabeth-elliot/", "page_content": "Many of us are well acquainted with the story: Jim Elliot and Elisabeth Howard met as undergraduates at Wheaton College. After a stormy courtship, seeking to reconcile their love for each other and their desire to do missions work, they married. They sought, along with four other families, to evangelize the Auca (later Waorani) people, an indigenous tribe in Amazonian Ecuador. And then Jim and four missionary friends were speared to death. It’s a heroic account that for generations has spurred on the modern missions movement.\n\nJim and Elisabeth’s only daughter, Valerie Shepard Elliot, has had an unusual perspective in all of this. Soon after her mother’s death in 2015, Valerie stumbled on a collection of her mother’s letters to her father during their courtship. “Every letter has so many profound truths in them that they are unbelievable treasures,” she says. The result is Devotedly: The Personal Letters and Love Story of Jim and Elisabeth Elliot, where Valerie compiled never-before-published letters and private journals about the early years of her parents’ love story.\n\nI corresponded with Valerie and asked about what surprised her most while combing through her parents’ letters, what their missionary legacy has been, how the Lord worked amid her mother’s various health challenges, and more.\n\nIvan: Many are familiar with your parents’ love story story through Passion and Purity and Shadow of the Almighty. What was most surprising about their story as you worked on this new project?\n\nValerie: My mother gave me my father’s letters many years before I got to read them (simply because of the number of children I still had at home needing my attention). So when I had the quiet time after the last one left to attend college, I was most amazed by his writing ability and poetic imagery, my mother’s brilliant logic and clarity, and the delightful sense of humor they both had. I also didn’t know how they struggled with not being sure of whether God wanted them to marry, and why and how long it took for my father to know when he had “the green light”!\n\nIn a video promotion for the book, you describe how after your mother’s death and preparing for her memorial service you told your husband, “I can’t carry this weight of the legacy.” How heavy is this legacy? And in what ways is it heavy?\n\nI know that in order to honor Christ, my life must measure up with the gospel, but I also know my own inconsistencies and lack of serious perseverance. My gifts and my calling are different from my parents. My concern was how to keep the legacy alive using my own voice. As Eugene Peterson wrote in his book, A Long Obedience in the Same Direction, I knew my own tendency to be distracted by many other things could get in the way of obedience. But my husband helped me understand it’s not about me; it’s about who Christ is, and he carries the load.\n\nWhat do you see as your parents’ missionary legacy?\n\nThe effect of my parents’ lives and my father’s death, especially, had a huge impact on missions from 1956 through the 1960s. My mother’s books, Through Gates of Splendor (1957) and Shadow of the Almighty (1958), changed many people’s lives. She shared my father’s story of working with four other men as missionaries to the Auca Indian tribe, when they were brutally murdered by the very people they were trying to reach with the gospel.\n\nTheir story of sacrifice and devotion to God still strikes at the heart of one’s selfishness. That’s why, I believe, it has been and continues to be a powerful catalyst for calling Christian men and women to mission work.\n\nChoosing to become a missionary is a decision to weigh carefully. Doing God’s work doesn’t mean that you’re promised complete safety or guaranteed you’ll see immediate results. But there is immense assurance that you’re following the Lord God Almighty whose plans are far greater than anything you could imagine.\n\nEven though my father and his fellow missionaries’ lives were taken, their work among the Auca Indians was far from over. My mother (and other missionaries) picked up where they left off, living and working among her husband’s murderers. God used her obedience and faithfulness to ultimately reach and transform the tribe for Jesus Christ.\n\nAs your mother’s health declined over the last decade of her life due to dementia, how did you see the Lord at work in her life amid the various challenges?\n\nI saw my mother quietly accept what had happened to her, though she couldn’t express it. Before she lost most of her speech, a phrase that she often spoke was “God knows the way through the wilderness.” She seemed peaceful and trusting, and she was delighted when people came to visit her to tell her of their prayers and their love.\n\nShe had been such a strong-minded and independent woman, but the dementia gave her an accepting and sometimes a resigned spirit, which just exemplified her trust in the sovereignty of the Lord.\n\nWhat were some of the favorite stories your mom told you about your dad when you were growing up that helped you get to know him? What did they do for entertainment/rest/fun in the jungle? What lessons from their marriage helped shape your own marriage?\n\nI can’t think of any specific stories, but her joy in their relationship definitely was an example to me of what a courtship and marriage should be. There weren’t many “fun options” for them in their “free time” because there was so much to do every day.\n\nThey did believe in resting and reading on Sundays, and if they had any free time, they would’ve gone swimming or taken a hike. They both loved being outdoors and I have the same desire. I think the example of having good conversations, laughter over hilarious situations (my parents were such excellent observers of people and of nature), and enjoyment of one another has grown in our own marriage, especially now that my husband is retired.\n\nWhat piece of wisdom from your father’s journals has most deeply affected you in your Christian walk?\n\nThere are several wise quotes that challenge me and all boil down to the same thing: genuinely living for God’s glory, not my own. His maxim, “Determination, not desire, determines destiny,” has helped me in these last two years as I contemplate my own “wants” as opposed to my determination to apply the disciplines I know God wants of me. My subconscious phrase I’ve lived by has most often been “plenty of time” (to do what I want!) because I tend to have unrealistic expectations of what can be done in one day.\n\nI also love the prayer that my father wrote in his journal: “I have covenanted with the Father, that He would either glorify Himself to the utmost in me, or slay me.” I want to live as he did—all out for God’s glory—and be just as eager for death, so that God may be seen in either. This quote spurs me on to prayer that I will simply be God’s child, being obedient, radiating his glory, and not looking for praise from people.\n\nAs my father wrote, “Lord, make my way prosperous not that I achieve high station, but that my life be an exhibit to the value of knowing God.”\n\nIvan Mesa is a contributing editor for the International Mission Board and an editor for The Gospel Coalition."}, {"url": "https://intervarsity.org/news/remembering-five-missionary-martyrs", "page_content": "Fifty years ago this month the world learned of five men who gave their lives to take God’s message of love to one of the most savage tribes in the South American jungle. While the price that they paid was unusually high, their commitment was not unusual when compared to the hundreds of thousands of other young men and women who have attended InterVarsity’s Urbana Student Missions Convention and given up their own ambitions to serve God’s purpose in the world.\n\nFor one of those five men, Jim Elliot, the Urbana convention nurtured and encouraged his dream of becoming a missionary. He and his Wheaton College roommate, David Howard, attended InterVarsity’s first missions convention in Toronto in 1946 and returned in 1948 when the convention moved to the University of Illinois at Champaign-Urbana.\n\nBy Urbana 48 Jim was president of the Student Foreign Missions Fellowship at Wheaton. He had written a drama which he presented to Urbana delegates to challenge them with information about the areas of the world still unreached with the gospel. “It gave a strong appeal to students to consider what God wanted them to do,” David recalled.\n\nJim missed Urbana 51; he was already on the mission field in Ecuador. David had been working on staff with InterVarsity; he became assistant director of Urbana 51. But soon he too was on the mission field in Costa Rica. After Jim married David’s sister Elisabeth, the honeymooners visited David and his wife in Costa Rica. “So the last time I saw Jim Elliot was on his honeymoon at our home in Costa Rica,” David said.\n\nPete Fleming, another of the five missionaries, was a leader of the InterVarsity chapter at the University of Washington as an under-graduate. Inspired by the chapter adviser to consider an academic career, he entered graduate school and taught a student Bible study. Even after he had joined his friend Jim Elliot on the mission field in Ecuador, he was considering ways of ministering to university students in Quito.\n\nAt the first Urbana convention following their deaths, Urbana 57, surprisingly little was said about the five martyred missionaries, at least according to the recorded remarks of the plenary speakers and David’s recollection.\n\n“The book that my sister Elisabeth wrote to tell that story, Through Gates of Splendor, was not out yet. And [neither was] the next book, The Shadow of the Almighty, which was the biography of Jim Elliot. Those books—and Jim Elliot’s journals—began to have a tremendous influence.”\n\nSubsequent Urbana conventions did nourish the legacy of the five martyred missionaries. Elisabeth Elliot spoke at Urbanas 73, 76, 79 and 96. Both of her books telling the story have been featured as Books of the Day at Urbana. David Howard returned from the mission field to become director of Urbana 73 and Urbana 76. “I’ve been in probably 80 countries,” David Howard said, “and almost everywhere I go I invariably run into people who tell me they’re serving today on the mission field because God used Urbana to call them into the field.”\n\nBut God is also using Urbana to call men and women to more than traditional missions activities. David attended the 2004 convention of the Evangelical Theological Society because his son David Jr., a professor and dean at Bethel Seminary, was president that year. “I was amazed at how many theologians and professors of theology, and other members of that society, came to me to thank me because Urbana 73 or 76 was a major factor in leading them into God’s service. Not to the mission field,” he pointed out, “but serving God as professors of biblical studies, theology and so on.”\n\nOne of David’s best Urbana stories involves his niece, Valerie—the daughter of Jim and Elisabeth Elliot—and Valerie’s husband Walt. “They’ve gone this past year to Congo, as missionaries,” he said. “In a prayer letter that she just sent out, she indicates that at Urbana 76 she and her husband felt called of God into missions. But God led them elsewhere for 29 years–in pastoral ministry–before the way finally opened for them. So now they’re on the field, in Africa.”\n\nThe complete David Howard interview is an InterVarsity podcast; you can access it at the bottom of this page.\n\nThe story of Jim Elliot, Pete Fleming, Nate Saint, Roger Youderian, and Ed McCully is dramatized in the movie The End of the Spear, which began showing nationwide later in January 2006."}, {"url": "https://snaccooperative.org/view/38484503", "page_content": "Mission Aviation Fellowship founded 1944 as Christian Airmen's Missionary Fellowship; name changed to Missionary Aviation Fellowship, 1947, and to Mission Aviation Fellowship, 1973.\n\nFrom the description of Records of the Mission Aviation Fellowship, 1977-1981 (inclusive). (Yale University). WorldCat record id: 702152480\n\nNondenominational agency providing aviation services to mission agencies; incorporated May 20, 1945; initially staffed by former World War II pilots; provided aerial transportation, ambulance service, supply lines to remote areas, cooperative medical and dental services to rural and frontier stations, and surveying of potential sites for new missionary efforts; also operated a radio communications network, maintained its planes and airstrips and lent personnel to sister MAF groups; principle service to mission stations, but also to governments and on non-mission assignments; presidents of MAF were James Truxton (1945-1949), Grady Parrott (1949-1970), Charles Mellis (1970-1973), Charles Bennett (1973-1985), Max Meyers (1985-1997), Gary Bishop (1998-2004), Kevin Swanson (2004-2007), John Boyd (2008- ); headquarters located in Nampa, Idaho (following Los Angeles, Fullerton, and Redlands,California); field bases established in various countries; named Christian Airmen's Missionary Fellowship until 1947 when it changed to Mission Aviation Fellowship; public relations and information productions include publications (MISSION AVIATION, WINGS OF PRAISE AND PRAYER and PRAISE AND PRAYER BRIEFINGS), films and books; provided air transportation, ambulance service, and supply lines to remote areas; brought cooperative medical and dental service to rural and frontier stations depending on air transport; and surveyed possible sites of new mission endeavor; also operated a radio communications network, maintained its airstrips, and lent personnel to sister MAF groups; worked in cooperation with independent sister organizations in Great Britain, Australia, New Zealand, Canada, Holland, Finland, Surinam, Mexico, Brazil, and South Africa; provided rescue during political uprisings, and relief for famine and drought, floods, hurricanes and earthquakes.\n\nFrom the description of Records of Mission Aviation Fellowship, 1944-[ongoing]. (Wheaton College). WorldCat record id: 30767574"}, {"url": "https://fromthevault.wheaton.edu/2021/06/01/remembering-the-other-elliots/", "page_content": "The above photograph was taken in Yurimaguas, a port town in the Amazonian rainforests of northern Peru where Bert and Colleen Elliot ministered for over thirty years. The river depicted is either the Río Huallaga or Río Paranapura. Undated\n\nEarlier this year, the Wheaton College Billy Graham Center Archives marked the 65th anniversary of the death of Wheaton alumnus Jim Elliot and four other American missionaries in Ecuador at the hands of Waorani tribe members in January 1956. The shocking event became an instant media sensation among evangelicals and the general public in the United States. The five missionaries—particularly Jim Elliot—were praised as examples of heroic dedication to Christian evangelism following their deaths, due in large part to the literary efforts of Jim’s widow, Elisabeth Elliot, who chronicled the now-famous story in Through Gates of Splendor (1957) and secured her husband’s place in post-war missionary mythology through the publication of his journals, Shadow of the Almighty, in 1958. The Archives’ digital exhibit To Carry the Light Further explores this fascinating narrative of missionary martyrdom through photographs, newspaper clippings, letters, and diary entries held in the Archives’ collections.\n\nThe death of the five men remains a perpetually fascinating story in American evangelical circles today, and the Elliot papers are among the most popular collections in the Archives’ holdings. Archival materials relating to the other Ecuador martyrs have also found their way to the Archives over the years, adding new dimensions to the story of the Waorani. Those collections include the papers of Peter Fleming’s brother Kenneth, and widow Olive, as well as Ed and Marilou McCully. Just this year, the Archives opened Collection 721, a recent donation of papers containing significant correspondence from Jim Elliot to his parents, Fred and Clara, and their own response in the wake of his shocking death.\n\nBert and Colleen Elliot pose with an unidentified Peruvian Christian in Pucallpa, circa 1958.\n\nWhile Jim and Elisabeth Elliot are familiar names to twentieth-century American evangelicals, much less known are the other missionary Elliots — Bert and Colleen. Like his younger brother Jim, Bert also felt called to evangelistic work in Latin America. In 1949, three years before Jim Elliot landed in Ecuador, Bert and his wife Colleen sailed for Peru, where they would serve as missionaries for over sixty years. The photographs and documents featured on this page and many others related to the Elliots’ lives and work in Peru are found in Collection 684: Papers of Herbert and Colleen Elliot. The Elliots’ correspondence alone spans over 50 years, from 1943 to 1994, and provides rich details about the rigors of missionary life and unexpected challenges of evangelistic work.\n\nColleen Elliot completed the Missionary Medicine program at BIOLA University in 1948, training that she put to good use in rural Peru, where access to medical care was scarce. Colleen’s correspondence to her parents and sister in the United States is filled with descriptions of setting broken bones, treating rare eye diseases, snake bites, and infections, as well as the numerous babies she delivered.\n\nColleen Elliot with Peruvian woman and child, circa 1959.\n\nThe photograph on the right offers just a glimpse into the quotidian realities of the mission field. Collen’s inscription on the back of the image reads: “This is the little girl who broke her arm almost a year ago in Santa Cruz and we took her to the hospital. We stopped to see her and she gave me a chicken. Her arm is well but very crooked and useless as you can see.” In her letters, Colleen also reflects on the spiritual aspects of providing medical and the opposition she faced from indigenous witch doctors who opposed both Western medical practices and the Christian gospel.\n\nOut of necessity Bert Elliot became an amateur dentist and was frequently called upon to extract teeth, circa 1959.\n\nDuring their sixty years in Peru, Bert and Colleen ministered in a variety of locations, including Lima, Lagunas, Yurimaguas, Chiclayo, Cajamarca, and Trujillo. In addition to providing rudimentary medical care in rural areas, evangelizing, and planting churches, the Elliots also founded Colegio Cristiano Elliot in 1988 to provide a Christian education for Peruvian children. Named after Jim Elliot, the Colegio still exists today and offers education based on biblical values to students from kindergarten through high school.\n\nThe following excerpt is taken from a letter written by Bert Elliot to his in-laws while traveling back to Peru after a visit to the United States, following the death of his brother Jim Elliot earlier that year. Dated May 17, 1956, the letter describes the pain of parting from family members after their furlough, and Bert reflects on the spiritual legacy he inherited from his parents and the comfort he finds in the gospel following Jim’s death.\n\nLetter to the Collison family located in the Papers of Bert and Colleen Elliot, Box 1, Folder 10. May 17, 1956."}, {"url": "https://blog.eastwest.org/blog/missionary-mindset-jim-elliot", "page_content": "The Missionary Mindset series looks into the lives of notable missionaries to provide valuable insights and inspiration. Read the last post in the Missionary Mindset series here.\n\nJim Elliot is one of the most well-known missionaries of the 20th Century. He was one of five missionaries killed during Operation Auca—a mission to bring the gospel to the Huaorani people in Ecuador. His desire to reach the most feared tribe in Ecuador led to an evangelical effort in this country that continues to grow today.\n\nJim’s Background\n\nBorn into a Christian home, Jim Elliot professed his faith in Jesus at age six. From a very early age, his parents stressed obedience to God’s will, honesty, and adventurous living in the name of God.\n\nIn 1945, Jim enrolled at Wheaton College where he was praised as a charming public speaker and was encouraged to pursue acting by his professors. But Jim was captured by a different call—reaching those who had never heard the Word of God—and his coursework suffered as he elevated searching and understanding the Scriptures over his classes.\n\nWhile at Wheaton, Jim also met his future wife—Elisabeth—though the couple would not marry until 1952 after both delved into life as missionaries.\n\nJim’s college years were marked by his charismatic energy and willingness to step out of his comfort zone and into areas of spiritual darkness. In fact, he relished opportunities to leave his comfortable home, believing that the news of Jesus Christ was worth infinitely more than his own life.\n\nHe began evangelizing in Mexico during his college years, and the fearless spirit dwelling in him eventually ignited a passion for the Huaorani tribes of Ecuador. Often referred to as “Auca”—meaning savages—this tribe was known for their hostility toward outsiders.\n\nJim was a pacifist who fearlessly advocated for peace and urgently wanted to bring an end to the violent Huaorani culture. He knew the risk involved in reaching these people, but Jim was convinced the only way to end their history of killing and usher in peace was through the gospel.\n\nInitially, Jim began working with the Quechua Indians of Ecuador before joining Ed McCully, Roger Youderian, Pete Fleming, and Nate Saint to reach the Huaoranis. They first approached this people group with empathy and wisdom, lowering gifts from a helicopter and using a megaphone to broadcast well-meaning Auca phrases.\n\nTheir movement toward the tribe was peaceful, slow, and methodical, rather than intrusive. They waited for the Huaorani people to respond to their gifts by sending a gift of their own. And when the tribe responded, the five missionaries settled on a beach nearby.\n\nTheir first meeting with a small group of Huaorani people was successful—they even brought one man whom they called “George” into the helicopter for a brief trip. However, soon after their initial contact, ten Huaorani men came to their base and killed all five missionaries. At his death, he left behind his wife, Elisabeth, and daughter, Valerie.\n\nJim’s Legacy\n\nJim and his fellow missionaries’ deaths could have been the end of the evangelical missions in Ecuador, but two years after the death of her husband, Elisabeth Elliot—with daughter Valerie and Nate Saint’s sister, Rachel—headed back to the heart of the Ecuadorian jungle to finish the work they started.\n\nBecause of Jim’s bravery and boldness to the point of death, his work led to:\n\nThe publication of Shadow of the Almighty: The Life and Testament of Jim Elliot and Through Gates of Splendor, which tell his missionary story\n\nSchools founded in his name in California and Colorado\n\nThe growth of Ecuadorian missions by those who continue to be inspired by his bravery\n\nJim Elliot knew the joy of loving Jesus and spent his life zealously sharing the good news of His death and resurrection. Jim’s love for the Word of God and one of the most hostile people groups in South America is a strong testimony of surrendering all for God’s glory.\n\nAnd because of His great sacrifice many hearts have been sealed by Christ.\n\nMore Inspiration from Jim Elliot\n\nJim is one of the most quoted missionaries in the realm of missions. Below are a few of East-West’s favorite quotes that inspire us as we labor among the unreached.\n\n“He is no fool who gives what he cannot keep to gain that which he cannot lose.”\n\n“Wherever you are, be all there! Live to the hilt every situation you believe to be the will of God.”\n\n“Forgive me for being so ordinary while claiming to know so extraordinary a God.”\n\n“Lord, give me firmness without hardness, steadfastness without dogmatism, love without weakness.”\n\nRead the next Missionary Mindset here."}], "Peter Fleming was a missionary in the Missionary Aviation Fellowship's (MAF) Ecuadorian Mission.": [{"url": "http://missionaryportal.webflow.io/biography/pete-fleming", "page_content": "Peter Sillence Fleming was an evangelical Christian who was one of five missionaries killed while participating in Operation Auca, an attempt to evangelize the Huaorani people of Ecuador.\n\nEarly Life\n\nFleming was born in Seattle, Washington. He was taught the Bible from an early age, but did not get actually saved until he was 13 years old after hearing the testimony of a blind evangelist. During his late teens and early twenties, Fleming was known for his knowledge of Scripture and spiritual maturity.\n\n\n\n\n\nIn high school, Fleming earned letters in basketball and golf. He was also a good student and graduated as valedictorian of his class. He also won a citywide oratorical contest.\n\n\n\n\n\nIn 1946, Fleming went to the University of Washington as a philosophy major. He was very driven in college, working part-time and dedicating much time to prayer and Bible study, as well as keeping up on his classes. He was also elected president of the UCA at his college, and received a master's degree from there in 1951.\n\n\n\n\n\nFleming met Jim Elliot during many conferences and mountain climbing expeditions arranged by a large Christian organization. They were good friends and once spent six weeks preaching together across the country. Elliot had a great deal of influence on Fleming and was largely responsible for his becoming a missionary and for his decision to temporarily break off his engagement to Olive Ainslie, a childhood friend.\n\nLife in Ecuador\n\nFleming went to Ecuador in 1952 as a part of a two-man team with Jim Elliot. After serving on the mission field in Ecuador, Jim Elliot married Elisabeth Elliot. Shortly afterwards, Fleming proposed to Olive in a letter, and they were married in 1954.\n\n\n\n\n\nIn September 1955, Fleming joined with Elliot and three other missionaries in Operation Auca, an attempt to reach the Auca Indians with the Gospel. He was the last member of the team to join, largely because of concerns of his wife.\n\nHow Pete Fleming Died\n\nPete and Olive had only been married 18 months when all five of the team were attacked by a group of Huaorani warriors and Fleming was killed along with the other missionaries. A search party found Fleming's body floating in the Curaray River. His body was identified by a red woven belt he was wearing.\n\n\n\n\n\nAccording to reports, Fleming was speared by Kimo, a man who later became one of the first Auca converts to Christianity. Four years before his death, he wrote in a journal \"I do want to be committed to the work there laying down my life for their faith.\" Some of the Quichua Indians and even some of the Auca killers came to saving faith in Christ.\n\n\n\n\n\nShortly before Fleming's death, Olive had her second miscarriage. She soon returned to the United States in order to recover. She eventually remarried, to Walter Liefeld.\n\nPete Fleming's Family\n\nParents:\n\nKenneth Fleming\n\nGreta Fleming\n\nSpouse:\n\nOlive Sinslie Fleming\n\nSiblings:\n\nKen Fleming\n\nRecommended Resources on Pete Fleming\n\nPete Fleming Movies\n\nPete Fleming Books\n\nPete Fleming Quotes\n\n“How continually I thank God for bringing me here, almost overcoming the impossible and pushing me out. I felt ‘thrust out’ and how grateful I am for God’s impelling.” “I would gladly give my life for that tribe if only to see an assembly of those proud, clever, smart people gathering around a table to honor the Son - gladly, gladly, gladly. What more could be given to a life?” “If my innocence will cost me my life, so be it.”\n\nFun Facts About Pete Fleming\n\nIn 1989, his wife Olive returned to Ecuador and met the Indians who were responsible for her husband's death\n\nSources\n\nElliot, Elisabeth (2005). Through Gates of Splendor. Wheaton, IL: Tyndale. ISBN 0-8423-7151-6. Fleming, Ken (1995). Peter Fleming: A Man of Faith. Christian Missions in Many Lands. p. 152. ISBN 1-888735-86-3. Liefeld, Olive Fleming (1990). Unfolding Destinies: The Untold Story of Peter Fleming and the Auca Mission. Discovery House Publishers. ISBN 1-57293-041-1.\n\nThis information is provided under the Wikipedia Creative Common License."}, {"url": "https://researchworks.oclc.org/archivegrid/collection/data/30767574", "page_content": "Details\n\n204 boxes (127.9. cubic ft.).\n\nOffice files of MAF, a mission agency that provided transportation, radio contact and other support to missions working in remote areas, as well as some services to non-mission agencies -- Materials, including correspondence, minutes, reports, prayer letters, personnel files, and budgets, that document the administration and activities of MAF, especially the regional offices in Africa, Asia, Europe and Latin America, the Development division (extensive individual prayer letters from entire mission staff), the Research and Planning division, Personnel division, and the technical requirements of mission aviation. These documents reflect its origins and early history as CAMF, operation, flight service, policies, personnel management and pilot training, relations with governments and other organizations, outreach to a wide financial support base, stewardship of finances, and publications to maintain communication with financial and prayer. Other topics documented throughout the collection include missionaries' adjustment to foreign climates and cultures; exacting technical aspects of aviation, especially concerned with small aircraft; evaluation of aviation and radio as mission tools; political and cultural affairs of Africa, South America, and Southeast Asia; and inter-mission relations and cooperation; sister movements in other countries (particularly British Missionary Aviation Fellowship), production of publications, missionary adjustment to culture, technical aspects of aviation, political and cultural affairs of Africa (particularly Zaire), South America and Southeast Asia, relations with the Catholic Church in predominantly Catholic countries, missions in much of the developing world, inter-mission relations and cooperation, the murder of missionaries by Huaorani Indians in Ecuador in the \"Auca Incident,\" and other mission-relatedtopics. Persons prominently featured include: James Truxton, Charles Mellis, Grady Parrot, martyr Nate Saint (and his fellow martyrs and their families), Charles Bennett, Max Meyers\n\nNondenominational agency providing aviation services to mission agencies; incorporated May 20, 1945; initially staffed by former World War II pilots; provided aerial transportation, ambulance service, supply lines to remote areas, cooperative medical and dental services to rural and frontier stations, and surveying of potential sites for new missionary efforts; also operated a radio communications network, maintained its planes and airstrips and lent personnel to sister MAF groups; principle service to mission stations, but also to governments and on non-mission assignments; presidents of MAF were James Truxton (1945-1949), Grady Parrott (1949-1970), Charles Mellis (1970-1973), Charles Bennett (1973-1985), Max Meyers (1985-1997), Gary Bishop (1998-2004), Kevin Swanson (2004-2007), John Boyd (2008- ); headquarters located in Nampa, Idaho (following Los Angeles, Fullerton, and Redlands, California); field bases established in various countries; named Christian Airmen's Missionary Fellowship until 1947 when it changed to Mission Aviation Fellowship; public relations and information productions include publications (MISSION AVIATION, WINGS OF PRAISE AND PRAYER and PRAISE AND PRAYER BRIEFINGS), films and books; provided air transportation, ambulance service, and supply lines to remote areas; brought cooperative medical and dental service to rural and frontier stations depending on air transport; and surveyed possible sites of new mission endeavor; also operated a radio communications network, maintained its airstrips, and lent personnel to sister MAF groups; worked in cooperation with independent sister organizations in Great Britain, Australia, New Zealand, Canada, Holland, Finland, Surinam, Mexico, Brazil, and South Africa; provided rescue during political uprisings, and relief for famine and drought, floods, hurricanes and earthquakes\n\nSelected files closed to researchers for specified time period without the written permission from the President of Mission Aviation Fellowship\n\nOrganized into twelve series: I. President, II. Chief Operating Officer, III. Board, IV. International, V. Development, VI. Research & Planning, VII. Technical, VIII. Finance, IX. Personnel, X. Other Missions, XI. General, XII. Miscellaneous\n\nFinding aid available in repository reading room or at Web site\n\nRelated Resources\n\nFinding aid available at: https://archives.wheaton.edu/repositories/4/resources/176"}, {"url": "https://www.christianitytoday.com/ct/2021/october-web-only/mission-aviation-maf-doc-papua-ends-earth.html", "page_content": "In a remote village on the side of a mountain in Papua, a man has been writing letters.\n\n“I’ve written so many letters asking for teachers to come,” he says. “I’ve written so many letters, my pens have all run out of ink. I don’t have any more pens to write with. But then all of the sudden I heard you guys were coming. I was so happy hearing that I could not sleep at all last night.”\n\nA new documentary tells the story of that arrival and the missionary pilots who support the work of Bible translators, church planters, and Christian teachers in the remotest mountain villages. Ends of the Earth will be playing in about 700 theaters across the US on Monday, October 18, and Thursday, October 21. It is also available to churches.\n\nCT talked to Mission Aviation Fellowship President and CEO David Holsten about the importance of the documentary, his theology of missions, and the challenges of flying small planes in and out of mountain villages like Puluk, where it took the people 15 years to build a runway with picks, shovels, and crowbars.\n\nWhat are your hopes for this documentary?\n\nWe want people to see with clarity how the gospel can bring lasting change to somebody living in great isolation—isolation that isn’t just geographical. They are spiritually isolated, linguistically isolated, ethnically isolated. In some of these villages, infant mortality is 80 percent, women and children are abused, and there’s constant war. It’s pretty horrific.\n\nLiku, a Wano Bible teacher, says this in the documentary: “People in America might think we live in a pristine, beautiful place, but they haven’t seen for themselves what it is really like here.”\n\nThe gospel and the values of the kingdom that follow change people’s lives in a deep and impactful way. And we want that story to be told. That’s good news.\n\nIt’s a mysterious part of the gospel that says God loves the people at the very edge of what the world thinks matters, the people who are marginalized. You know, even among Christians there’s a kind of calculation about return on investment (ROI) and “bang for our buck.” You hear this with mission work too. But we can’t really approach this from an ROI perspective. The gospel is costly. Jesus comes and he gives his life so we can have life. And he’s the shepherd who goes after the one lost sheep.\n\nMAF lives in the world of that one: This little tribe of 100 people, 150 people, living on the top of a mountain—to most of the world, they don’t exist and they certainly don’t matter. From a financial standpoint it doesn’t make sense. It’s costly to take an aircraft up there that’s a worth a few million dollars.\n\nArticle continues below\n\nBut what’s the price of a soul? We wanted to show that story.\n\nHow is mission aviation different from other kinds of flying?\n\nYou’re flying in areas that are remote, and because of that, there is minimal infrastructure, whether that’s communications equipment that allows regular contact with air traffic control or weather-reporting equipment that can give you an accurate picture and forecasts weather conditions.\n\nMaintenance is challenging too. You can’t just order a part and have it show up the next morning on a FedEx truck. You have to anticipate changing a component, in some cases, up to four months before you need to change it.\n\nThe pilots do everything pretty much on their own. Airline pilots get on their planes, and the load, the weight of the load, the balance of it has been calculated for them. A missionary pilot has to compute the load of the aircraft. They have to load and unload it. The passengers come aboard, and they have to brief them in their language. You may even have to climb up on the wing to put the fuel into the plane. It’s pretty different.\n\nAnd then probably the most significant differences are the airstrips themselves. As you see in the documentary, these airstrips are made by villages with hand tools. They are grass or dirt or rock; they can have slope—they tend to slope—and it’s a very dynamic setting. Every time I get ready to land, I’m circling, looking for a wild pig or a water buffalo that’s going to come out on the runway.\n\nIt’s really quite challenging. You have to be able to fly your aircraft with a high level of precision, which I think most pilots enjoy rising to that challenge. But it’s unforgiving of any significant mistakes.\n\nI think it’s one of the most gratifying ways to use an airplane.\n\n\n\nMission aviation requires such precision and careful planning. Is there some tension between that and the ethos of the missionaries on the ground? Especially in these remote regions, missionaries often place an emphasis on adapting, making do, and being creative and flexible.\n\nOh, it sounds like you’ve had some experience with missions! There is an interesting tension there. Flying requires a lot of planning. It requires a lot of resources and a lot of systems and infrastructure. I’ve seen that raise the eyebrows of our missionary peers. Some people see that as being very business-like and—maybe this is an inelegant way to say it, but—nonspiritual.\n\nArticle continues below\n\nBut it’s what is required. It’s what you have to do in order to have a service that people can have confidence in. And you know when people are putting their kids on an airplane, they really appreciate the preparation and how careful we are.\n\nI think for the most part we work together and people understand that different contexts need different approaches.\n\nCT reported on the one fatal accident that MAF has had in the last 20 years, when pilot Joyce Lin died in a crash in 2020. The investigation is still ongoing, so I know you can’t talk about the details of what happened. But can you talk about how that tragedy has impacted MAF?\n\nAn event like this, as difficult as it is, forces you to wrestle with, really, what is the price you’re willing to pay? Everybody who does mission aviation wrestles with that at some level, but it became a whole lot more real to everybody: If that were to happen to me, if that were to happen to my husband, if it were to happen to my friend, would I believe that loss was for a worthy thing? Is it something I would ultimately be willing to give my life to?\n\nIn aviation it’s sort of anathema to say it’s okay to give your life for something. You’re always seeking to make it as safe as you possibly can. We invest a tremendous amount of research and effort so that we don’t have to pay that price. But the truth is, you assume a certain level of risk anytime you take off and fly in an airplane in the places that we fly. There’s a reality—that’s one of the tensions in mission aviation ministry.\n\nJoyce’s team really had to wrestle with this. And I think they would say, and they will say, “Yeah. Yeah, this is something that is worth it.”\n\nWhen you see the impact of the gospel, the airstrip being opened so Wano Bible teachers can go in and begin their gospel presentation, you say, “Yes, this is a priceless thing.”\n\nArticle continues below\n\nOne of the most interesting parts of the documentary, to me, was seeing the Wano Christian leaders setting priorities for the mission work. Liku is shown making decisions, for example, about where the next runway should go. Can you talk about the partnership between Western missionaries and Papuan believers?\n\nLiku is our brother. He’s our brother, and I can hardly talk about him without crying. But if you go do this sort of work and you think, I’m here with all the answers, you will be humbled. If your eyes are even remotely open, you will quickly think, I have so much to learn from these guys. And that’s one of the highlights of the time overseas: to learn from these brothers and sisters.\n\nThis is my opinion, but I think God has called us to work cross-culturally with brothers and sisters. That’s part of the Great Commission, that we need to be cross-cultural.\n\nJust recently we had a gathering, and a young woman raised her hand and said, “What do you think about the Western colonialism that’s been attached to mission work?”\n\nI said, “In my journey that I’ve been on the last 20 years, I haven’t seen that.” I’m not saying it didn’t take place. I know it has. I know there have been flawed approaches and sinful behavior—that is absolutely the case. But what I’ve seen in the last 20 years is a journeying side by side. I see humility far more than arrogance, people across cultures saying, “How do I walk with you? Teach me a way to appropriately contextualize this in this setting.”\n\nAnd it’s a beautiful thing. You are forced to wrestle with your inadequacies and the gifting of brothers of sisters who haven’t had anywhere near the access to resources that you’ve had. It’s inspiring. It’s humbling. And praise God for it.\n\nIn some ways the documentary is like a recruiting film. Does MAF need more pilots? Do the missions you serve need more workers?\n\nOftentimes we find ourselves saying things like, “We could use twice the number of pilots we have.” Globally, right now we might have 80 or 90 pilots. We could use twice that amount.\n\nWhen I visit a team in Papua or the other places we serve, like Haiti, Lesotho (which is in Africa), or the Democratic Republic of the Congo, I often find one person doing several jobs.\n\nWe recruit mostly from the Christian colleges with training programs for missionary pilots: Moody Bible Institute, Liberty University, LeTourneau University. But it’s a challenging process and a long process. Most folks, on average, enroll in a flight training program, which is five years long. They’ll go through that program; then they’ll often work for a year or two to get experience. They join us and go through support raising, all of that. It’s not unusual from the time they started the program to the first flight overseas to take eight or nine years.\n\nArticle continues below\n\nIt takes a lot of focus and drive to get through that.\n\nAnd there are other folks who know how to fly, but they don’t have the commitment to incarnational presence and the spiritual aspect. We got calls from some airline pilots early on during COVID. They were seeing the downturn, and they would reach out intrigued by what we do and approach us to see if this is something they could do for six months until airline business picks back up.\n\nBut they lacked the understanding and what it demands spiritually. To do this, you have to learn another language, uproot your family, count the costs, and really say, “God has called me.”\n\nOur prayer is “Lord, stir the heart of this generation.”\n\nWe think people will be intrigued by what we do. Ultimately, we would love to see people get behind our ministry, and we hope the young men and women who are intrigued by mission work—we pray their hearts are stirred."}, {"url": "https://maf.org/about/history/", "page_content": "After World War II, a few veteran pilots in the US and UK dreamed of a way they could use their flying skills to reach isolated people with the gospel. They founded MAF a few years later, and for more than 75 years now men and women have been using aviation to share Christ’s love in the most remote places on earth. Learn about some of our earliest pilots, including Betty Greene, who conducted MAF’s inaugural flight; and Nate Saint. They both appear in the vintage footage above.\n\nMAF History Timeline\n\nScroll through this interactive timeline to see highlights of what God has done through MAF, its partners, and faithful donors—serving together for seven decades."}, {"url": "https://maf.org/missionaries/dewinkle/", "page_content": "The DeWinkle family are serving as a pilot/mechanic family in Suriname, impacting lives by transporting missionaries, supplies, and individuals in need of medical evacuations. Peter supports the Mission Aviation Fellowship program as a pilot and mechanic. Miriam serves as a homemaker and support for Peter, while taking care of their five children: Gideon, Moriah, Titus, Naomi and Susanna.\n\nPeter was born in Modesto, California, to Dutch parents and was saved by grace around age five. His parents raised him in God’s Word and daily lived out their faith. When Peter was eight, he and his family moved to Idaho to start a farm. Working on mechanical projects around the farm and going on a mission trip to Mexico showed him he had a passion for serving others and propelled him into the exciting world of aviation. He believes mission aviation is the perfect fit for the gifts God has given him because he loves to help people, work with equipment, and share the gospel with others.\n\nMiriam was also born in Modesto, California, to Dutch immigrant parents and came to truly know Jesus when she was five. She credits early growth in her faith to her parents’ strong walk and daily devotions along with their prayers for each one of their children. Miriam remembers her aunt, a Wycliffe translator stationed in Cameroon, telling of the incredible ways God was working! This sparked a passion in Miriam’s heart to share Jesus’ love with others. She has enjoyed many trips to Europe and especially enjoys engaging with people from other cultures.\n\nMiriam wrote, “In 2007 I married Peter, who also shared a passion for reaching others with the love of Christ! It is with great joy that we serve God as a family. He has been continually gracious and faithful to us. We are very thankful!” Peter and Miriam look forward to seeing how God will use them for His glory.\n\nGod calls the men and women of MAF to serve Him in unique ways. He may also be calling you to a special role in De Winkle’s ministry. Please prayerfully consider becoming a ministry partner with them through prayer and/or financial support."}, {"url": "https://www.christianitytoday.com/ct/2006/marchweb-only/110-52.0.html", "page_content": "On Wednesday, January 11, 1956, a Piper Cruiser PA-14 dipped slowly over the Curaray River in eastern Ecuador. Mission Aviation Fellowship (MAF) pilot Johnny Keenan leaned out the window, looking, looking. Below him squatted the stripped remains of another yellow Piper. Nothing stirred. Then, about a quarter mile downriver, he saw the khaki pants and white shirt of a young man floating face down in the water. Johnny reached for his radio.\n\nOn the other end of his call, some 50 miles away at Shell Mera, sat pilot wife, Marj Saint. She listened to Johnny's message as three other women hovered at her side.\n\nLate on Wednesday the body of law student-turned-missionary, Ed McCully, was identified by Quichua Indians who knew him. Unable to retrieve the body from the Curaray, they tossed McCully's size 13 1/2 shoe on the shore and brought back his watch.\n\nOn Friday, January 13, a search party hiked and canoed their way through 25 miles of jungle to rendezvous with Ecuadorian soldiers, other Quichuas, a U.S. military officer, and Life photographer Cornell Capa. They found what was left of a dream: a few personal effects, an overturned pot of beans, and, in the water, the bodies of four young missionaries. They were World War II paratrooper Roger Youderian, budding scholar Peter Fleming, the intensely spiritual, indomitable Jim Elliot, and the imaginative, technologically creative MAF pilot Nate Saint. The search party buried the bodies just inside the jungle during a torrential downpour. Jack Shalanko, who helped, later wrote, \"They were decomposed beyond recognition. Some still had spears in them.\"\n\nThese men between the ages of 27 and 32 were husbands and fathers (eight children ages seven and younger among them, with one more baby due in a month). All shared a passion for taking the good news to those who had never heard the name of Jesus. \"Operation Auca\" was over. Or was it?\n\nBraving the jungle\n\nThe dream had taken shape in the minds of Saint, Elliot, McCully, and Fleming. The first three had known each other at Wheaton College, where Saint had taken a year's classes and where Elliot and McCully were campus leaders, star athletes, and notorious practical jokers. Other missionaries nicknamed them \"the Brethren boys,\" since all worked under the auspices of the Plymouth Brethren. In conversations together they had wondered if they might be able to make peaceful contact with an isolated and hostile indigenous group in Ecuador, then called \"Aucas\" (\"savage\" in the lowland Quichua language) and now known by the name they give themselves, \"Waorani\" (\"the people\").\n\nArticle continues below\n\nIn late 1955, approximately 500 Waorani lived scattered across a territory about the size of Connecticut. Their lands were only a short plane ride from the locations where Elliot, McCully, and Saint were posted. Moving frequently and living in small clearings, the Waorani were hard for outsiders to locate. Most didn't want to, since the Indians greeted all visitors with eight-foot-long spears. However, in September 1955, when Saint and Fleming spotted a number of Wao clearings, they thought they could use the airplane to prepare the way for peaceful ground contact.\n\nBetween October 6 and December 23, Saint, accompanied by either McCully or Elliot, made 13 flights over the Wao clearings. Fleming provided prayer and financial support from his station. Saint lowered gifts to the ground. First, they sent down an aluminum cooking pot decorated with floating ribbons, then buttons, pants, shirts (the Waorani wore only cotton G-strings), an ax head, knives, photos, machetes. The Waorani received these gifts with smiles and laughter. They began to return gifts: a headband, woven thread, smoked monkey tail, two squirrels, a parrot. During these exchanges the men shouted carefully mouthed phrases in the Wao language, which they had picked up from Dayuma, a young Wao woman who had fled tribal violence only to live in servitude at a nearby hacienda.\n\nThe seeming openness of the Waorani and favorable weather led the missionaries to consider early January for peaceful contact. A month before the launch, they added Roger Youderian, a member of the Gospel Missionary Union who had survived the Battle of the Bulge. The date was set for Tuesday, January 3, 1956. Saint ferried the other four to their designated spot some six miles from the nearest Wao clearing. \"The neighbors,\" two Wao women and a man, showed up on Friday, January 6. From the perspective of the five missionaries, it was a friendly visit. The Indians sampled hamburgers, and the missionaries shared their insect repellent. The man, Naenkiwi, was intrigued by the airplane, so Saint took him for a ride. The Waorani were talkative, but neither group understood the other.\n\nDangerous liaisons\n\nThe missionaries did not know that contact with these three Waorani had placed them in the middle of a potentially deadly conflict. Naenkiwi wanted to marry Gimari, the younger of the two women. Her brother, Nampa, objected, and the Waorani, who were engaged in vicious patterns of violence among themselves, often killed for less than this. The rage was deflected to the five missionaries. They were cowodi (\"outsiders\" or \"cannibals\") and traditional enemies. Years later, Geketa, a member of the spearing party, gave his perspective on what happened in a film produced by the Summer Institute of Linguistics:\n\nArticle continues below\n\n\"One day a plane flew over us. It circled and it circled. They dropped clothes and knives to us from the plane. Then they called, 'Come, come, come with us.' A few from our group went to meet them. Later, the next night, Nampa went into a rage over a wedding he was against. Nampa grabbed all his spears and yelled to me, 'Come on, let's go and kill. Just right here close by are cowodi. Remember how our mothers warned us when we were children. Cowodi have always carried guns and shot us. Now here's our chance, let's kill them.' [The next day] the plane landed on the sandbar, then we went off with our spears to kill. The cowodi were on the sandbar calling to us. Nampa ran at one with a spear. The man shot Nampa, and the man fell right there. We speared another, and even as they were running, I speared two more The last cowodi called out to us. 'Don't spear. Don't spear.' And we understood. 'We just came to meet you. We aren't going to kill you. Why are you killing us?' He was standing on a log jutting out of the river when Kimu ran a spear through his chest, and he fell into the water.\"\n\nAlthough the exact circumstances are unclear, further reconstructions of the event suggested that one missionary did fire a pistol, probably the shot that hit Nampa, who later died. The missionaries clearly offered no organized resistance, nor did any seek to save himself apart from his friends. By mid-afternoon, Sunday, January 8, it was all over. Nate Saint's watch stopped at 3:12 p.m.\n\nThe making of heroes\n\nThe story of the five missionaries killed in Ecuador circled the globe and struck a deep chord among American evangelicals as well. During the 20th century, an estimated 26 million people around the world were killed at least in part because of their Christian faith. Most of these died relatively unnoticed. Yet these five became known, modeled, celebrated, almost beatified, so that at the 50th anniversary of their death, books and films continue to appear and many people remember. Why?\n\nSome of the explanation rests rightly on the character of the five and their wives. They were courageous, passionately spiritual, adventurous, and acted out of concern for the well-being of the Waorani. They were willing to give their lives in order spare these people the agonies of hell\u0097and did so.\n\nArticle continues below\n\nCircumstances seemed united to appeal to the masses. The men with their wives and children embodied all that post-war Americans hoped for their own families. New worldwide communication sustained public attention in the first decade where such instant story-telling was possible. Quito missionary radio station HCJB carried the unfolding story via short wave. Life magazine sent photographer Cornell Capa to the scene. Reader's Digest picked up the story including journal notes by the men. Elisabeth Elliot's Through Gates of Splendor became a best seller. Magazine articles profiled the commitment of the wives as four of them remained to continue in missionary service.\n\nFor people searching for meaning in a world caught up in Cold War fears, this eternal perspective on life held greatappeal. As historian Dana Robert has commented of other missionary heroes or heroines, in death the five men became more important as missionaries to their homeland than they were able to be to the Waorani. Over the years, many have pointed to the deaths as influential in their conversion or their call to the mission field.\n\n\"On behalf of Jesus, do not spear.\"\n\nWhat happened to the Waorani? Before the men's deaths, the Wao woman Dayuma had worked as a language informant for Rachel Saint, Nate's older sister. Rachel served with the Summer Institute of Linguistics (SIL). Dayuma opened the way for Rachel and Jim Elliot's widow, Elisabeth, to make peaceful contact with Dayuma's extended family, including the men who had speared their loved ones.\n\nThe Waorani had experienced more than six decades of violent and bloody revenge killings among themselves. More than 60 percent of the deaths during this period were violent, making the Waorani one of the most violent cultures on earth, according to anthropologists James Yost and James S. Boster. In Wao culture, Rachel and Elisabeth should have sought revenge. When instead they spoke of God, they offered the Waorani a way to end the cycle of violence.\n\nOver the next 20 years, this happened. Most Waorani no longer live in fear of spearings, although in 1987, two Catholic missionaries were killed by warriors from an isolated group of Waorani, and as recently as 2003, there was a tragic outbreak of intra-tribal violence.\n\nElisabeth Elliot left the Waorani in December 1961. Except for about five years, Rachel Saint lived among the people until her death in 1994. She began the translation of the New Testament into the Wao language, completed by SIL staff members Catherine Peeke and Rosi Jung. Anthroplogist Yost and literacy coordinator Pat Kelley also learned the difficult Wao language and spent extended periods with the people during the 1970s and 1980s. Nate Saint's eldest son, Steve, and his family lived among the Waorani for a year in 1995. All have tried to model what it means to be Christian, though there has been controversy over the years about their and other missionary involvement.\n\nArticle continues below\n\nThe Waorani themselves, who number about 2,000 today, have faced numerous challenges brought by increasing encounters with the outside world. Some have rejected Christianity as they understand it, others have accepted the limited version of \"thou shalt not kill,\" and still others are seeking a vital, meaningful faith based on their understanding of God's Word.\n\nBut the seed has been planted, and there are Waorani who live the faith for which, a half-century ago, the five missionaries died.\n\nKathryn Long is associate professor of history at Wheaton College and is writing a book on the history of the Waorani/missionary contact. Carolyn Nystrom is a freelance writer living in St. Charles, IL.\n\nCopyright © 2006 Christianity Today. Click for reprint information.\n\nRelated Elsewhere:\n\nChristianity Today also covered the anniversary of the martyrdom.\n\nOut Cast: The Chad Allen Controversy\n\nThe Wrong End of the Spear | Is Christian passion for purity blinding us to our missionary impulse? (Feb. 08, 2006)\n\nOut Cast: The Chad Allen Controversy\n\n'I Feel Betrayed' | A son-in-law of one of the murdered missionaries says the casting was a mistake. (Feb. 08, 2006)\n\nReaders Affirm Decision to Hire Gay Actor | Most Christianity Today Movies readers say End of the Spear's filmmakers were right to honor their commitment once they had offered the lead role to Chad Allen, a homosexual. (Feb. 1, 2006)\n\nChristian Studio Explains Hiring of Gay Actor | The makers of End of the Spear didn't find out about co-star Chad Allen's homosexuality until after they offered him the job, and then they felt obliged to honor the contract. (Jan. 26, 2006)\n\nReviews: End of the Spear The story has been told in Christian circles for 50 years. In 1956, five missionaries were brutally murdered in the Ecuadorian jungle by members of the Waodani tribe they went to serve. And then something amazing happened; the killers became Christians. (Jan. 20, 2006)\n\nArticle continues below\n\nDeath Worked Backwards | End of the Spear, a new film about the 1956 missionary martyrs in Ecuador, is similar to the Narnia story in some ways, says Steve Saint, son of one of the murdered men. (Jan. 18, 2006)\n\nThe Rest of the Story | Half a century after killing five missionaries, the 'Auca' find themselves on the cutting edge of modern missions. (Jan. 18, 2006)\n\nEnd of the Spear Big Winner at Heartland | Film about 1956 missionary martyrs in Ecuador wins Film Festival's $50,000 Grand Prize; others also lauded at Crystal Heart Awards Ceremony. (Oct. 17, 2005)\n\nMore Christian history, including a list of events that occurred this week in the church's past, is available at ChristianHistory.net. Subscriptions to the quarterly print magazine Christian History & Biography are also available.\n\nPrevious Christian History Corners include:\n\nPhysicians of the Soul | J. I. Packer discusses the English Puritans, their quest for holiness, and why they are still worth remembering. (Feb. 24, 2006)\n\nBlessing the Church with its History | Douglas Sweeney argues for an evangelical movement that welcomes diversity and repents of its blind spots. (Feb. 10, 2006)\n\nErasmus's Revolutionary 'Study Bible' | The spiritual father of so many English Reformers died at the hands of the church he refused to leave. (Jan. 13, 2006)\n\nCampus Ministry Cambridge Style | The roots of InterVarsity and other evangelical college clubs (Jan. 6, 2006)\n\nDorothy Sayers: \"The Dogma Is the Drama\" | An interview with Barbara Reynolds. (Dec. 16, 2005)\n\nSharing Stories from the Heart | The lessons of history are fair game for use today. (Dec. 9, 2005)\n\nEat, Drink, and Relax | Think the Pilgrims would frown on today's football-tossing, turkey-gobbling Thanksgiving festivities? Maybe not. (Nov. 18, 2005)"}, {"url": "https://maf.org/missionaries/marx/", "page_content": "The Marx family has served with Mission Aviation Fellowship for almost 48 years in Honduras, Ecuador, and the US, working in aviation, finances, and administration. Currently, Steve works in the Purchasing Department at headquarters, keeping the MAF worldwide fleet supplied with parts. After years of teaching, Ann now ministers providing lesson plans, advice and encouragement for homeschooled grandchildren and takes care of her family and home. Steve and Ann are excited to be involved in the overall ministry of MAF.\n\nSteve was born in Reading, PA, to missionary parents and grew up in Central America. He accepted the Lord at age 12 during a chapel service at his missionary kids’ school. Steve trained at Moody Bible Institute in Chicago, IL, and earned a degree in missionary aviation at Moody Aviation in Elizabethton, TN. He also attended Westmont College in Santa Barbara, CA. He holds a commercial single-engine pilot’s license with instrument ratings and served as an MAF pilot/mechanic in Honduras in 1974. Due to medical needs, Steve returned to the States in 1976, married Carmen (from Honduras) in 1977. Steve received training at the MAF headquarters as a bookkeeper and administrator before returning to Honduras in 1982. Steve was widowed in 1990 and moved to Ecuador with his three children in 1991. He shares that no matter what comes his way in life, he is reminded that God makes no mistakes, is in complete control, and will not desert him.\n\nAnn was born and raised in Ontario, Canada, and was led to the Lord at age 5 by her mother. Her favorite verse is Proverbs 3:5-6. “Trust in the Lord with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge him, and he shall direct thy paths.” Ann’s mother gave her this verse when she was a child. Ann attended London Baptist Bible College in London, Ontario, and earned a degree in Religious Education. She met Steve in 1994 when she was teaching at the Nate Saint School in Shell, Ecuador. They were married in 1995. Their fourth child was born in Ecuador in 1998.\n\nThe Marxes’ three older children, Brian, Eileen, and Cristi, along with their spouses, have their own distinct ministries serving the Lord. Their youngest, Ryan, earned a degree in graphic design and is job-searching.\n\nGod calls the men and women of MAF to serve Him in unique ways. He may also be calling you to a special role in the Marxes’ ministry. Please prayerfully consider becoming a Ministry Partner with them through prayer and/or financial support."}, {"url": "https://hub.maf.org/memorial/joyce-lin-memorial", "page_content": "Remembering Missionary Pilot Joyce Lin\n\nThe sick woman was not well enough to sit in the Mission Aviation Fellowship (MAF) airplane, so pilot Joyce Lin helped her to the floor, tightened the straps to secure her for the flight, and began to pray. Tears welled and her voice cracked as she struggled through the prayer. But these were not tears of sadness—they were tears of hope.\n\nThis was a special moment for Joyce.\n\nJoyce took off from the Wamena airstrip, high in the mountains of Papua, Indonesia, and flew the woman to the larger city of Sentani to receive medical care. This was MAF’s first medical evacuation flight since the COVID-19 lockdown.\n\nIt was also Joyce’s first-ever medevac flight.\n\nAnd it marked a momentous step in Joyce’s journey.\n\nA Long Obedience\n\nAfter earning two degrees in engineering from MIT followed by a decade-long career as an officer in the U.S. Air Force and in private-sector cybersecurity, Joyce felt led to Christian ministry, so she enrolled at Gordon-Conwell Theological Seminary. While in seminary, she discovered missionary aviation and traveled to Papua, Indonesia, for a summer internship with MAF.\n\n“[Ten] years ago, I left Papua convinced I should pursue mission aviation,” Joyce said in a 2019 newsletter. “But there were no guarantees I would actually be able to get to this point.”\n\nJoyce had earned her private pilot license while at MIT, but still needed an instrument rating, a commercial pilot license, and months of training to meet MAF’s standards. She was dealing with back issues and unsure if she would be healthy enough to serve in Indonesia long-term. But “the doors never closed, and every hurdle was cleared.”\n\n“I am thankful to every flight instructor, every friend, and every medical person who contributed in a myriad of ways to help me over those hurdles,” Joyce said. “I am thankful to God, who gave me a vision of what my future would look like and who was steadfastly faithful to keep me on the path that led me [to Papua].”\n\nLiving A Dream\n\nShe arrived at her new home at the MAF base in Sentani as an MAF pilot and IT specialist, and quickly became a key part of the team. She began by flying essential supplies to isolated villages and helping complete a years-long fiber cabling project to support MAF’s IT work in Papua. And just as quickly, her care for her teammates and the people she served left a lasting impact.\n\nEach morning, Joyce would make the “long” commute from her home to her office—which entailed walking out her front door, crossing the street, and opening the doors to the MAF offices at the Sentani airport. She would settle into her desk and get to work. For Joyce, these daily rhythms carried a weight that transcended the work itself. Her desk was not just a desk.\n\n“This is my desk, where I do IT work,” Joyce said. “It is also the place where God has been working on my sanctification, one day at a time.”\n\nIn this far-flung corner of the world, Joyce Lin was living her dream.\n\n“I’m privileged to be serving the many churches and missionaries in Papua who continue to reach out to isolated villages so that people can be both physically and spiritually transformed,” Joyce said.\n\n“Anyone who knew Joyce recognized that she was extremely dedicated. That showed up most in her commitment to being used by God and sharing His love with others, especially those less fortunate. She was extremely generous, giving of herself and her treasures selflessly,” said Brock Larson, regional director of MAF Indonesia and Joyce’s teammate.\n\n“Joyce embodied so much of what we love to see in MAF staff,” said David Holsten, president and CEO of MAF. “She was invested in the local culture, but she maintained a deep connection to her family, friends, and supporters around the world. She was professional in her IT work and in her flying. She was a dedicated teammate and well-loved by those she served.”\n\nJoyce played a vital role in supporting the work of the missionaries, local believers, and communities deep in this rugged landscape. As COVID-19 forced Papua into lockdown, Joyce and her MAF teammates continued to find ways to serve. Joyce found reasons to be thankful even in this unprecedented challenge.\n\n“It may sound strange, but these trying times have enhanced my feeling of purpose here in Papua,” Joyce said in an email update on May 6. “With every flight I see first-hand how MAF is connecting isolated villages with vital supplies and medical care. This can’t be taken for granted in normal times, but especially now with all of the travel restrictions, the people remind us how thankful they are every time an airplane is able to land in their village.”\n\n“We Don’t Mourn as Those Who Have No Hope”\n\nOn May 12, 2020 at 6:27 a.m., Joyce took off from Sentani in an MAF Kodiak—a plane she had dreamed of flying since learning about mission aviation. Her cabin was filled with school supplies and COVID-19 rapid test kits, which she was delivering to a remote village.\n\nIn that moment, soaring through the beautiful Papuan sky, Joyce was doing exactly what God had called her to.\n\nFrom a seminary campus on the other side of the world where she first discovered her calling, to countless training flights in Idaho, to visits with churches across the country, to hours spent in prayer, and finally to arriving in Sentani—God walked with her each step of her journey.\n\nTwo minutes into her flight, Joyce sent out a distress call.\n\nLater, a search and rescue team recovered her body from Lake Sentani.\n\nBut Joyce wasn’t there.\n\nShe was where she had always been—in the arms of her Savior.\n\nHope Worth Sharing\n\nJoyce saw the impact the gospel had made in Papua. The transformation happening in isolated communities scattered across this vast island was evident to her.\n\n“The presence of God has given [the Papuan] people hope, a real hope that I share.”\n\nAnd she carried that hope with her whether she was touching down on a remote airstrip or settling into her IT desk.\n\n“Just two days before she went to be with the Lord, she shared how she was living her dream,” said Brock. “Her years of effort following God’s calling were being rewarded and rewarding others daily. Joyce was a light reflecting Jesus, and she will be deeply missed.”\n\nJoyce’s road to MAF was a long one and it was filled with challenges. But Joyce was always able to see past hardships to the hope that lay beyond them.\n\n“I am most grateful to personally know God, who has never forsaken me in my lowest times (as there have been many) and has repeatedly turned “mourning into dancing” (Ps 30:11) in ways I could not have brought about on my own,” Joyce said. “While I will always be excited to fly planes and work on computers, I am most excited to share the love of Jesus Christ by helping to transform other people’s deep discouragement and mourning into dancing and joy.”\n\nAs we mourn for Joyce, our tears, though tinged with sadness, are the same tears Joyce wept over the sick woman in her airplane—tears of hope.\n\nIn lieu of flowers, donations can be made to the Joyce Lin Memorial Fund, which will enable MAF to train Indonesian national staff in more technically advanced skills like maintaining and flying aircraft. The family will be informed of any donations made to the memorial fund. Cards and messages of condolence can be sent to the family via Derwood Bible Church, Attn: Lin Family, 16011 Chieftain Avenue, Derwood, MD 20855 or emailed to office@derwoodbiblechurch.org."}, {"url": "https://prabook.com/web/peter.fleming/1953674", "page_content": "Peter Fleming\n\nMissionary\n\n1928 (age 28) Seattle, King County, United States of America\n\nHe was taught the Bible from an early age, but did not get actually saved until he was 13 years old after hearing the testimony of a blind evangelist. During his late teens and early twenties, Fleming was known for his knowledge of Scripture and spiritual maturity. In high school, Fleming earned letters in basketball and golf. In 1946, Fleming went to the University of Washington as a philosophy major. He was very driven in college, working part-time and dedicating much time to prayer and Bible study, as well as keeping up on his classes. He was also elected president of the UCA at his college, and received a master\"s degree from there in 1951. Fleming met Jim Elliot during many conferences and mountain climbing expeditions arranged by a large Christian organization. They were good friends and once spent six weeks preaching together across the country. Fleming went to in 1952 as a part of a two-man team with Jim Elliot. After serving on the mission field in, Jim Elliot married Elisabeth Elliot. In September 1955, Fleming joined with Elliot and three other missionaries in Operation Auca, an attempt to reach the Auca Indians with the Gospel. They had only been married 18 months when all five of the team were attacked by a group of Huaorani warriors and Fleming was killed along with the other missionaries. A search party found Fleming\"s body floating in the Curaray River. His body was identified by a red woven belt he was wearing. Four years before his death, he wrote in a journal \"I do want to be committed to the work there laying down my life for their faith.\" Some of the Quichua Indians and even some of the Auca killers came to saving faith in Christ. Shortly before Fleming\"s death, Olive had her second miscarriage. She soon returned to the United States in order to recover. She eventually remarried, to Walter Liefeld."}, {"url": "https://archives.wheaton.edu/repositories/4/resources/176", "page_content": "Office files of MAF, a mission agency that provided transportation, radio contact and other support to missions working in remote areas, as well as some services to non-mission agencies.\n\n\n\nMaterials, including correspondence, minutes, reports, prayer letters, personnel files, and budgets, that document the administration and activities of MAF, especially the regional offices in Africa, Asia, Europe and Latin America, the Development division (extensive individual prayer letters from entire mission staff), the Research and Planning division, Personnel division, and the technical requirements of mission aviation. These documents reflect its origins and early history as CAMF, operation, flight service, policies, personnel management and pilot training, relations with governments and other organizations, outreach to a wide financial support base, stewardship of finances, and publications to maintain communication with financial and prayer. Other topics documented throughout the collection include missionaries' adjustment to foreign climates and cultures; exacting technical aspects of aviation, especially concerned with small aircraft; evaluation of aviation and radio as mission tools; political and cultural affairs of Africa, South America, and Southeast Asia; and inter-mission relations and cooperation; sister movements in other countries (particularly British Missionary Aviation Fellowship), production of publications, missionary adjustment to culture, technical aspects of aviation, political and cultural affairs of Africa (particularly Zaire), South America and Southeast Asia, relations with the Catholic Church in predominantly Catholic countries, missions in much of the developing world, inter-mission relations and cooperation, the murder of missionaries by Huaorani Indians in Ecuador in the \"Auca Incident,\" and other mission-relatedtopics. Persons prominently featured include: James Truxton, Charles Mellis, Grady Parrot, martyr Nate Saint (and his fellow martyrs and their families), Charles Bennett, Max Meyers."}], "Ed McCully was a missionary in the Missionary Aviation Fellowship's (MAF) Ecuadorian Mission.": [{"url": "http://missionaryportal.webflow.io/biography/ed-mccully", "page_content": "Theophilus \"Ed\" McCully was an evangelical Christian missionary to Ecuador who, along with Jim Elliot, Pete Fleming, Nate Saint, and Roger Youderian, was killed while attempting to evangelize the Huaorani (or Auca) people, through efforts known as Operation Auca.\n\nEarly Life\n\nMcCully was the second oldest of three children. He grew up in Milwaukee, Wisconsin, where his father was a bakery executive. The family attended a Plymouth Brethren assembly called at that time the \"Good News Chapel,\" but is now called \"Wauwatosa Bible Chapel\".[1] McCully's father was also a church elder, who preached from the pulpit.\n\n\n\n\n\nIn the fall of 1945, McCully enrolled in Wheaton College where he majored in business and economics. It was also at Wheaton where he met and became good friends with Jim Elliot.\n\n\n\n\n\nIn college, McCully was an exceptional student. At 6'2\" and 190 lbs., he proved to be very athletic and was on both the football and track teams.\n\n\n\n\n\nHe also distinguished himself as a gifted orator, and became very popular among his classmates. His self-authored speech about U.S. Treasury Secretary Alexander Hamilton won McCully the 1949 National Hearst Oratorical Contest in San Francisco, a contest in which over 10,000 students had entered. That same year, McCully was unanimously elected senior class president.\n\n\n\n\n\nAfter graduating from Wheaton in 1949, McCully entered Marquette University Law School intent on becoming a lawyer. Just before his second year there, he took a job as a hotel night clerk.\n\n\n\n\n\nOriginally intending to spend the long hours studying classwork, he instead began reading more of the Bible. The biblical narrative of Nehemiah as well as his correspondence with Jim Elliot, who was making preparations to leave for Ecuador at the time, inspired McCully to consider missionary work. Finally, on September 22, 1950, the day before he was to register for his second year of school, he announced he would not be returning.\n\n\n\n\n\nAfter dropping out of law school, McCully began a ministry in the United States. In the winter and spring of 1951, he and Jim Elliot shared a weekly evangelical radio broadcast. He also travelled and spoke at various churches around the country. At one stop in Pontiac, Michigan, he met his future wife, Marilou Hobolth, a Moody Bible Institute graduate. They were married on June 29, 1951.\n\n\n\n\n\nHe then entered the School of Missionary Medicine in Los Angeles (today part of Biola University). He spent a year there studying dentistry, obstetrics, and tropical diseases and their treatments.\n\n\n\n\n\nLife in Ecuador\n\nThe McCullys went to Ecuador supported by Christian Missions in Many Lands (CMML). Ed, Marilou and their 8 month old son, Stevie, left for Ecuador by ship on December 10, 1952.\n\n\n\n\n\nThey first stayed in Quito to finish their Spanish study, then joined Jim Elliot and Pete Fleming at their mission station in Shandia. Eventually the McCullys took up residence at the Arajuno mission station deep in the jungle. They worked with the Quechua Indians.\n\nHow Ed McCully Died\n\nIn the fall of 1955, McCully, along with Jim Elliot and missionary pilot Nate Saint, began Operation Auca, their plan to reach the previously un-contacted Auca Indians. Since the Auca had a reputation as one of the most murderous tribes on earth, everything was done to earn their trust.\n\n\n\n\n\nThe missionaries began by making gift drops from Saint's airplane. McCully would often accompany Saint on these missions. When the missionaries felt they had built up enough of a rapport with the Aucas, they decided to land in their territory. By this time, Roger Youderian and Pete Fleming had also joined the effort. Saint was able to land the airplane on a sandbar along the Curaray River.\n\n\n\n\n\nHowever, after friendly ground contact with three Aucas, the missionaries were attacked by a party of six Auca warriors and three women. McCully was the fourth of the five missionaries to be speared by a young Auca named Mincaye, and also severely mutilated with a machete after he grabbed and tried to hold back one of his attackers. His role is described in the 2006 film End of the Spear.\n\n\n\n\n\nShortly afterwards, a search party was organized to find the men. McCully's body was not found by the search party, but he was presumed to be dead. Some Quechua Indians had later found his body further down stream, and even produced McCully's shoe and wristwatch as evidence.\n\n\n\n\n\nEd McCully's Family\n\nParents:\n\nT. Edward McCully Sr.\n\nLois Green McCully\n\nSpouse:\n\nMarilou Hobolth McCully\n\nChildren:\n\n‍3\n\n\n\n\n\nAt the time of Ed's death, Marilou was eight months pregnant with their third son, Matt. She returned home to give birth and to meet with family. Ed McCully's memorial service was held at his home church in Wauwatosa, Wisconsin, and drew around 800 people.\n\n\n\n\n\nMarilou eventually returned to Ecuador and lived in Quito for 6 years, running a home for missionary children. She later returned to America and settled in Washington State where she worked as a hospital bookkeeper. She never remarried, and died of cancer on April 24, 2004.\n\n\n\n\n\nRecommended Resources on Ed McCully\n\nEd McCully Movies\n\nEd McCully Books\n\nThrough Gates of Splendor by Elisabeth Elliot\n\nEd McCully Quotes\n\n“I have one desire now - to live a life of reckless abandon for the Lord, putting all my energy into it.” “We’ve already put our trust in Him for salvation, so why not do it as far as our life is concerned?” “Night before last I was reading in Nehemiah. I finished the book, and read it through again. Here was a man who left everything as far as position was concerned to go do a job nobody else could handle. And because he went the whole remnant back in Jerusalem got right with the Lord. Obstacles and hindrances fell away and a great work was done” “I have one desire now - to live a life of reckless abandon for the Lord, putting all my energy into it. Maybe He'll send me someplace where the name of Jesus Christ is unknown. Jim, I'm taking the Lord at His word, and I'm trusting Him to prove His Word. It's kind of like putting all your eggs in one basket, but we've already put our trust in Him for salvation, so why not do it as far as our life is concerned?” “If there's nothing to this business of eternal life we might as well lose everything in one crack and throw our present life away with out life hereafter. But if there is something to it, then everything else the Lord says must hold true likewise.”\n\nSources\n\nThis information is provided under the Wikipedia Creative Common License."}, {"url": "https://maf.org/storyhub/it-has-been-60-years/", "page_content": "… since Nate Saint, Jim Elliot, Peter Fleming, Roger Youderian, and Ed McCully gave their lives so that the Waorani (then Auca) tribe could hear the Gospel. After initial efforts to make contact with this remote tribe in Ecuador were deemed positive, these brave men landed on a river beach deep in the jungle to build relationships with these people. Sadly, they died at the hands of those they were trying to reach.\n\nYet God wove this tragedy into a beautiful story of redemption, as many members of this tribe—including those in the killing party—eventually accepted Jesus Christ as their Savior and Lord.\n\nThe news of this event spread around the world, and organizations like MAF found themselves flooded with applicants who were ready to follow in the footsteps of these men and go to the ends of the earth for the sake of the Gospel.\n\nEven today, many of our staff initially came to MAF because they read Jungle Pilot—the story of Nate Saint’s life.\n\nToday we remember and celebrate the lives of these men and what their sacrifice has meant not only for the Waorani tribe but for isolated people around the world who are still coming to Christ in the wake of their legacy.\n\nView a short video (above) and check out the “Generations” documentary (below) to catch a glimpse of the Waorani tribe today, and learn how they’re passing on their faith in Jesus Christ."}, {"url": "https://www.christianitytoday.com/ct/2006/marchweb-only/110-52.0.html", "page_content": "On Wednesday, January 11, 1956, a Piper Cruiser PA-14 dipped slowly over the Curaray River in eastern Ecuador. Mission Aviation Fellowship (MAF) pilot Johnny Keenan leaned out the window, looking, looking. Below him squatted the stripped remains of another yellow Piper. Nothing stirred. Then, about a quarter mile downriver, he saw the khaki pants and white shirt of a young man floating face down in the water. Johnny reached for his radio.\n\nOn the other end of his call, some 50 miles away at Shell Mera, sat pilot wife, Marj Saint. She listened to Johnny's message as three other women hovered at her side.\n\nLate on Wednesday the body of law student-turned-missionary, Ed McCully, was identified by Quichua Indians who knew him. Unable to retrieve the body from the Curaray, they tossed McCully's size 13 1/2 shoe on the shore and brought back his watch.\n\nOn Friday, January 13, a search party hiked and canoed their way through 25 miles of jungle to rendezvous with Ecuadorian soldiers, other Quichuas, a U.S. military officer, and Life photographer Cornell Capa. They found what was left of a dream: a few personal effects, an overturned pot of beans, and, in the water, the bodies of four young missionaries. They were World War II paratrooper Roger Youderian, budding scholar Peter Fleming, the intensely spiritual, indomitable Jim Elliot, and the imaginative, technologically creative MAF pilot Nate Saint. The search party buried the bodies just inside the jungle during a torrential downpour. Jack Shalanko, who helped, later wrote, \"They were decomposed beyond recognition. Some still had spears in them.\"\n\nThese men between the ages of 27 and 32 were husbands and fathers (eight children ages seven and younger among them, with one more baby due in a month). All shared a passion for taking the good news to those who had never heard the name of Jesus. \"Operation Auca\" was over. Or was it?\n\nBraving the jungle\n\nThe dream had taken shape in the minds of Saint, Elliot, McCully, and Fleming. The first three had known each other at Wheaton College, where Saint had taken a year's classes and where Elliot and McCully were campus leaders, star athletes, and notorious practical jokers. Other missionaries nicknamed them \"the Brethren boys,\" since all worked under the auspices of the Plymouth Brethren. In conversations together they had wondered if they might be able to make peaceful contact with an isolated and hostile indigenous group in Ecuador, then called \"Aucas\" (\"savage\" in the lowland Quichua language) and now known by the name they give themselves, \"Waorani\" (\"the people\").\n\nArticle continues below\n\nIn late 1955, approximately 500 Waorani lived scattered across a territory about the size of Connecticut. Their lands were only a short plane ride from the locations where Elliot, McCully, and Saint were posted. Moving frequently and living in small clearings, the Waorani were hard for outsiders to locate. Most didn't want to, since the Indians greeted all visitors with eight-foot-long spears. However, in September 1955, when Saint and Fleming spotted a number of Wao clearings, they thought they could use the airplane to prepare the way for peaceful ground contact.\n\nBetween October 6 and December 23, Saint, accompanied by either McCully or Elliot, made 13 flights over the Wao clearings. Fleming provided prayer and financial support from his station. Saint lowered gifts to the ground. First, they sent down an aluminum cooking pot decorated with floating ribbons, then buttons, pants, shirts (the Waorani wore only cotton G-strings), an ax head, knives, photos, machetes. The Waorani received these gifts with smiles and laughter. They began to return gifts: a headband, woven thread, smoked monkey tail, two squirrels, a parrot. During these exchanges the men shouted carefully mouthed phrases in the Wao language, which they had picked up from Dayuma, a young Wao woman who had fled tribal violence only to live in servitude at a nearby hacienda.\n\nThe seeming openness of the Waorani and favorable weather led the missionaries to consider early January for peaceful contact. A month before the launch, they added Roger Youderian, a member of the Gospel Missionary Union who had survived the Battle of the Bulge. The date was set for Tuesday, January 3, 1956. Saint ferried the other four to their designated spot some six miles from the nearest Wao clearing. \"The neighbors,\" two Wao women and a man, showed up on Friday, January 6. From the perspective of the five missionaries, it was a friendly visit. The Indians sampled hamburgers, and the missionaries shared their insect repellent. The man, Naenkiwi, was intrigued by the airplane, so Saint took him for a ride. The Waorani were talkative, but neither group understood the other.\n\nDangerous liaisons\n\nThe missionaries did not know that contact with these three Waorani had placed them in the middle of a potentially deadly conflict. Naenkiwi wanted to marry Gimari, the younger of the two women. Her brother, Nampa, objected, and the Waorani, who were engaged in vicious patterns of violence among themselves, often killed for less than this. The rage was deflected to the five missionaries. They were cowodi (\"outsiders\" or \"cannibals\") and traditional enemies. Years later, Geketa, a member of the spearing party, gave his perspective on what happened in a film produced by the Summer Institute of Linguistics:\n\nArticle continues below\n\n\"One day a plane flew over us. It circled and it circled. They dropped clothes and knives to us from the plane. Then they called, 'Come, come, come with us.' A few from our group went to meet them. Later, the next night, Nampa went into a rage over a wedding he was against. Nampa grabbed all his spears and yelled to me, 'Come on, let's go and kill. Just right here close by are cowodi. Remember how our mothers warned us when we were children. Cowodi have always carried guns and shot us. Now here's our chance, let's kill them.' [The next day] the plane landed on the sandbar, then we went off with our spears to kill. The cowodi were on the sandbar calling to us. Nampa ran at one with a spear. The man shot Nampa, and the man fell right there. We speared another, and even as they were running, I speared two more The last cowodi called out to us. 'Don't spear. Don't spear.' And we understood. 'We just came to meet you. We aren't going to kill you. Why are you killing us?' He was standing on a log jutting out of the river when Kimu ran a spear through his chest, and he fell into the water.\"\n\nAlthough the exact circumstances are unclear, further reconstructions of the event suggested that one missionary did fire a pistol, probably the shot that hit Nampa, who later died. The missionaries clearly offered no organized resistance, nor did any seek to save himself apart from his friends. By mid-afternoon, Sunday, January 8, it was all over. Nate Saint's watch stopped at 3:12 p.m.\n\nThe making of heroes\n\nThe story of the five missionaries killed in Ecuador circled the globe and struck a deep chord among American evangelicals as well. During the 20th century, an estimated 26 million people around the world were killed at least in part because of their Christian faith. Most of these died relatively unnoticed. Yet these five became known, modeled, celebrated, almost beatified, so that at the 50th anniversary of their death, books and films continue to appear and many people remember. Why?\n\nSome of the explanation rests rightly on the character of the five and their wives. They were courageous, passionately spiritual, adventurous, and acted out of concern for the well-being of the Waorani. They were willing to give their lives in order spare these people the agonies of hell\u0097and did so.\n\nArticle continues below\n\nCircumstances seemed united to appeal to the masses. The men with their wives and children embodied all that post-war Americans hoped for their own families. New worldwide communication sustained public attention in the first decade where such instant story-telling was possible. Quito missionary radio station HCJB carried the unfolding story via short wave. Life magazine sent photographer Cornell Capa to the scene. Reader's Digest picked up the story including journal notes by the men. Elisabeth Elliot's Through Gates of Splendor became a best seller. Magazine articles profiled the commitment of the wives as four of them remained to continue in missionary service.\n\nFor people searching for meaning in a world caught up in Cold War fears, this eternal perspective on life held greatappeal. As historian Dana Robert has commented of other missionary heroes or heroines, in death the five men became more important as missionaries to their homeland than they were able to be to the Waorani. Over the years, many have pointed to the deaths as influential in their conversion or their call to the mission field.\n\n\"On behalf of Jesus, do not spear.\"\n\nWhat happened to the Waorani? Before the men's deaths, the Wao woman Dayuma had worked as a language informant for Rachel Saint, Nate's older sister. Rachel served with the Summer Institute of Linguistics (SIL). Dayuma opened the way for Rachel and Jim Elliot's widow, Elisabeth, to make peaceful contact with Dayuma's extended family, including the men who had speared their loved ones.\n\nThe Waorani had experienced more than six decades of violent and bloody revenge killings among themselves. More than 60 percent of the deaths during this period were violent, making the Waorani one of the most violent cultures on earth, according to anthropologists James Yost and James S. Boster. In Wao culture, Rachel and Elisabeth should have sought revenge. When instead they spoke of God, they offered the Waorani a way to end the cycle of violence.\n\nOver the next 20 years, this happened. Most Waorani no longer live in fear of spearings, although in 1987, two Catholic missionaries were killed by warriors from an isolated group of Waorani, and as recently as 2003, there was a tragic outbreak of intra-tribal violence.\n\nElisabeth Elliot left the Waorani in December 1961. Except for about five years, Rachel Saint lived among the people until her death in 1994. She began the translation of the New Testament into the Wao language, completed by SIL staff members Catherine Peeke and Rosi Jung. Anthroplogist Yost and literacy coordinator Pat Kelley also learned the difficult Wao language and spent extended periods with the people during the 1970s and 1980s. Nate Saint's eldest son, Steve, and his family lived among the Waorani for a year in 1995. All have tried to model what it means to be Christian, though there has been controversy over the years about their and other missionary involvement.\n\nArticle continues below\n\nThe Waorani themselves, who number about 2,000 today, have faced numerous challenges brought by increasing encounters with the outside world. Some have rejected Christianity as they understand it, others have accepted the limited version of \"thou shalt not kill,\" and still others are seeking a vital, meaningful faith based on their understanding of God's Word.\n\nBut the seed has been planted, and there are Waorani who live the faith for which, a half-century ago, the five missionaries died.\n\nKathryn Long is associate professor of history at Wheaton College and is writing a book on the history of the Waorani/missionary contact. Carolyn Nystrom is a freelance writer living in St. Charles, IL.\n\nCopyright © 2006 Christianity Today. Click for reprint information.\n\nRelated Elsewhere:\n\nChristianity Today also covered the anniversary of the martyrdom.\n\nOut Cast: The Chad Allen Controversy\n\nThe Wrong End of the Spear | Is Christian passion for purity blinding us to our missionary impulse? (Feb. 08, 2006)\n\nOut Cast: The Chad Allen Controversy\n\n'I Feel Betrayed' | A son-in-law of one of the murdered missionaries says the casting was a mistake. (Feb. 08, 2006)\n\nReaders Affirm Decision to Hire Gay Actor | Most Christianity Today Movies readers say End of the Spear's filmmakers were right to honor their commitment once they had offered the lead role to Chad Allen, a homosexual. (Feb. 1, 2006)\n\nChristian Studio Explains Hiring of Gay Actor | The makers of End of the Spear didn't find out about co-star Chad Allen's homosexuality until after they offered him the job, and then they felt obliged to honor the contract. (Jan. 26, 2006)\n\nReviews: End of the Spear The story has been told in Christian circles for 50 years. In 1956, five missionaries were brutally murdered in the Ecuadorian jungle by members of the Waodani tribe they went to serve. And then something amazing happened; the killers became Christians. (Jan. 20, 2006)\n\nArticle continues below\n\nDeath Worked Backwards | End of the Spear, a new film about the 1956 missionary martyrs in Ecuador, is similar to the Narnia story in some ways, says Steve Saint, son of one of the murdered men. (Jan. 18, 2006)\n\nThe Rest of the Story | Half a century after killing five missionaries, the 'Auca' find themselves on the cutting edge of modern missions. (Jan. 18, 2006)\n\nEnd of the Spear Big Winner at Heartland | Film about 1956 missionary martyrs in Ecuador wins Film Festival's $50,000 Grand Prize; others also lauded at Crystal Heart Awards Ceremony. (Oct. 17, 2005)\n\nMore Christian history, including a list of events that occurred this week in the church's past, is available at ChristianHistory.net. Subscriptions to the quarterly print magazine Christian History & Biography are also available.\n\nPrevious Christian History Corners include:\n\nPhysicians of the Soul | J. I. Packer discusses the English Puritans, their quest for holiness, and why they are still worth remembering. (Feb. 24, 2006)\n\nBlessing the Church with its History | Douglas Sweeney argues for an evangelical movement that welcomes diversity and repents of its blind spots. (Feb. 10, 2006)\n\nErasmus's Revolutionary 'Study Bible' | The spiritual father of so many English Reformers died at the hands of the church he refused to leave. (Jan. 13, 2006)\n\nCampus Ministry Cambridge Style | The roots of InterVarsity and other evangelical college clubs (Jan. 6, 2006)\n\nDorothy Sayers: \"The Dogma Is the Drama\" | An interview with Barbara Reynolds. (Dec. 16, 2005)\n\nSharing Stories from the Heart | The lessons of history are fair game for use today. (Dec. 9, 2005)\n\nEat, Drink, and Relax | Think the Pilgrims would frown on today's football-tossing, turkey-gobbling Thanksgiving festivities? Maybe not. (Nov. 18, 2005)"}, {"url": "https://www2.wheaton.edu/bgc/archives/exhibits/Ecuador1956/02.4%20McCully%20.htm", "page_content": "Name: Theophilus Edward McCully Jr., known as Ed\n\nDate and place of birth: June 1, 1927\n\nAccepted Jesus Christ as Savior: At the age of seven\n\nCommitment to missionary service: September 1950, while reading the book of Nehemiah in the Bible\n\nMission agency: Christian Missions in Many Lands (Plymouth Brethren)\n\nEducation: Wheaton College, 1945-1949 (left for 14 months in 1945 for service in the Navy); Lake Forest College, 1945-1946; Northwestern University, 1945-1946; Marquette University Law School, 1949-1950 (dropped out to become a missionary); School of Missionary Medicine in Los Angeles, California, 1951-1952\n\nMilitary experience: U.S. Navy, June 27, 1945 to August 29, 1946\n\nMarriage: Marilou Hobolth in June, 1951. They met when he spoke at a Christian young people’s banquet in Pontiac, Michigan\n\nChildren: Steve (1952), Mike (1954), Matt (1956)\n\nExperience in Christian work: Series of evangelistic radio broadcasts with Jim Elliot in southern Illinois in 1951; gave messages at a number of churches and other forums, 1951; helped run a Christian boarding school for boys with Jim Elliot and Peter Fleming; became a Christian worker among the Quichuas in Arajuno\n\nMission stations in Ecuador: Arrived in Ecuador December 1952 after language study in Quito, Shandia and then Arajuno (very close to Waorani territory)"}, {"url": "https://wiki2.org/en/Ed_McCully", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nTheophilus McCully (June 1, 1927 – January 8, 1956) was a Christian missionary to Ecuador who, along with four other missionaries, was killed while attempting to evangelize the Huaorani people, through efforts known as Operation Auca.\n\nYouTube Encyclopedic\n\n1 / 2 Views: 88 694 304\n\nMissionaries Murdered\n\nThrough Gates of Splendour Transcription\n\nEarly years\n\nMcCully was the second oldest of three children. He grew up in Milwaukee, Wisconsin, where his father was a bakery executive. The family attended a Plymouth Brethren assembly called at that time the \"Good News Chapel,\" but is now called \"Wauwatosa Bible Chapel\".[1] McCully's father was also a church elder, who preached from the pulpit.[citation needed]\n\nCollege years\n\nIn the fall of 1945, McCully enrolled in Wheaton College where he majored in business and economics. It was also at Wheaton where he met and became good friends with Jim Elliot.\n\nIn college, McCully was an exceptional student. At 6'2\" and 190 lbs., he proved to be very athletic and was on both the football and track teams. He also distinguished himself as a gifted orator, and became very popular among his classmates. His self-authored speech about U.S. Treasury Secretary Alexander Hamilton won McCully the 1949 National Hearst Oratorical Contest in San Francisco, a contest in which over 10,000 students had entered. That same year, McCully was unanimously elected senior class president.[citation needed]\n\nAfter graduating from Wheaton in 1949, McCully entered Marquette University Law School intent on becoming a lawyer. Just before his second year there, he took a job as a hotel night clerk. Originally intending to spend the long hours studying classwork, he instead began reading more of the Bible. The biblical narrative of Nehemiah as well as his correspondence with Jim Elliot, who was making preparations to leave for Ecuador at the time, inspired McCully to consider missionary work. Finally, on September 22, 1950, the day before he was to register for his second year of school, he announced he would not be returning.\n\nMinistry in America\n\nAfter dropping out of law school, McCully began a ministry in the United States. In the winter and spring of 1951, he and Jim Elliot shared a weekly Christian radio broadcast. He also travelled and spoke at various churches around the country. At one stop in Pontiac, Michigan, he met his future wife, Marilou Hobolth, a Moody Bible Institute graduate. They were married on June 29, 1951.\n\nHe then entered the School of Missionary Medicine in Los Angeles (today part of Biola University). He spent a year there studying dentistry, obstetrics, and tropical diseases and their treatments.\n\nMinistry in Ecuador\n\nThe McCullys went to Ecuador supported by Christian Missions in Many Lands (CMML). Ed, Marilou and their 8 month old son, Stevie, left for Ecuador by ship on December 10, 1952. They first stayed in Quito to finish their Spanish study, then joined Jim Elliot and Pete Fleming at their mission station in Shandia. Eventually the McCullys took up residence at the Arajuno mission station deep in the jungle. They worked with the Quechua Indians.\n\nIn the fall of 1955, McCully, along with Jim Elliot and missionary pilot Nate Saint, began Operation Auca, their plan to reach the previously un-contacted Auca Indians. Since the Auca had a reputation as one of the most murderous tribes on earth, everything was done to earn their trust. The missionaries began by making gift drops from Saint's airplane. McCully would often accompany Saint on these missions.\n\nWhen the missionaries felt they had built up enough of a rapport with the Aucas, they decided to land in their territory. By this time, Roger Youderian and Pete Fleming had also joined the effort. Saint was able to land the airplane on a sandbar along the Curaray River. However, after friendly ground contact with three Aucas, the missionaries were attacked by a party of six Auca warriors and three women. McCully was the fourth of the five missionaries to be speared by a young Auca named Mincaye, and also severely mutilated with a machete after he grabbed and tried to hold back one of his attackers. His role is described in the 2006 film End of the Spear.\n\nShortly afterwards, a search party was organized to find the men. McCully's body was not found by the search party, but he was presumed to be dead. Some Quechua Indians had later found his body further down stream, and even produced McCully's shoe and wristwatch as evidence.[citation needed]\n\nSurviving family\n\nAt the time of Ed's death, Marilou was eight months pregnant with their third son, Matt. She returned home to give birth and to meet with family. Ed McCully's memorial service was held at his home church in Wauwatosa, Wisconsin, and drew around 800 people.\n\nMarilou eventually returned to Ecuador and lived in Quito for 6 years, running a home for missionary children. She later returned to America and settled in Washington State where she worked as a hospital bookkeeper, and served as pianist at Evergreen Bible Chapel in Federal Way, Washington. She never remarried, and died of cancer on April 24, 2004.[citation needed]\n\nReferences"}, {"url": "https://hub.maf.org/tag/ed-mccully", "page_content": "… since Nate Saint, Jim Elliot, Peter Fleming, Roger Youderian, and Ed McCully gave their lives so that the Waorani (then Auca) tribe could hear the Gospel. After initial efforts to make contact with this remote tribe in Ecuador were deemed positive, these brave men landed on a river beach deep in the jungle […]\n\nShare this: Facebook\n\nTwitter\n\nPrint\n\nEmail\n\n"}, {"url": "https://maf.org/missionaries/marx/", "page_content": "The Marx family has served with Mission Aviation Fellowship for almost 48 years in Honduras, Ecuador, and the US, working in aviation, finances, and administration. Currently, Steve works in the Purchasing Department at headquarters, keeping the MAF worldwide fleet supplied with parts. After years of teaching, Ann now ministers providing lesson plans, advice and encouragement for homeschooled grandchildren and takes care of her family and home. Steve and Ann are excited to be involved in the overall ministry of MAF.\n\nSteve was born in Reading, PA, to missionary parents and grew up in Central America. He accepted the Lord at age 12 during a chapel service at his missionary kids’ school. Steve trained at Moody Bible Institute in Chicago, IL, and earned a degree in missionary aviation at Moody Aviation in Elizabethton, TN. He also attended Westmont College in Santa Barbara, CA. He holds a commercial single-engine pilot’s license with instrument ratings and served as an MAF pilot/mechanic in Honduras in 1974. Due to medical needs, Steve returned to the States in 1976, married Carmen (from Honduras) in 1977. Steve received training at the MAF headquarters as a bookkeeper and administrator before returning to Honduras in 1982. Steve was widowed in 1990 and moved to Ecuador with his three children in 1991. He shares that no matter what comes his way in life, he is reminded that God makes no mistakes, is in complete control, and will not desert him.\n\nAnn was born and raised in Ontario, Canada, and was led to the Lord at age 5 by her mother. Her favorite verse is Proverbs 3:5-6. “Trust in the Lord with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge him, and he shall direct thy paths.” Ann’s mother gave her this verse when she was a child. Ann attended London Baptist Bible College in London, Ontario, and earned a degree in Religious Education. She met Steve in 1994 when she was teaching at the Nate Saint School in Shell, Ecuador. They were married in 1995. Their fourth child was born in Ecuador in 1998.\n\nThe Marxes’ three older children, Brian, Eileen, and Cristi, along with their spouses, have their own distinct ministries serving the Lord. Their youngest, Ryan, earned a degree in graphic design and is job-searching.\n\nGod calls the men and women of MAF to serve Him in unique ways. He may also be calling you to a special role in the Marxes’ ministry. Please prayerfully consider becoming a Ministry Partner with them through prayer and/or financial support."}, {"url": "https://www.christianitytoday.com/ct/1994/august15/4t9057.html", "page_content": "The skeletal remains of an aircraft, uncovered on a remote beach along a river in Ecuador, are believed to be the lost plane piloted by American missionaries shortly before their murder in 1956.\n\nMission Aviation Fellowship (MAF) staff recently identified the remains of the Piper aircraft in an isolated Ecuadorian jungle as the plane flown by Nate Saint just before he was killed by Auca Indians in 1956.\n\nSaint and four other missionaries were making first contact with a group of indigenous people when they were attacked with spears and killed. The moving story of their martyrdom inspired a generation of Christians around the world to enter foreign mission service.\n\nMAF missionary Bill Clapp positively identified the remains pulled from a sandy beach along the Curaray River as being the front lower fuselage of the airplane flown by Saint. The airplane had lain buried beneath the shifting sands of Palm Beach, a small outcropping on the river, since the incident.\n\nClapp said that parts of the plane, including the motor, had been removed. Some portions of the craft were carried out by the recovery party, which included American military personnel stationed in Panama. Recent heavy rains and a shifting of the course of the river uncovered the lower fuselage, which was discovered by an Indian family.\n\nFollowing the killing of the missionaries, four of the bodies were buried on the river bank at the site. In later years, Elisabeth Elliot, widow of Plymouth Brethren missionary Jim Elliot, and Rachel Saint, sister of Nate Saint, lived among the Auca Indians (known today as the Huaorani), providing them with basic education, health care, and the gospel. Chronicles of the martyred pilots and the ministry to the Aucas have been told in several books, including Through Gates of Splendor and The Savage, My Kinsman, by Elisabeth Elliot, and Jungle Pilot, by Russell Hitt. Others killed in 1956 were Plymouth Brethren missionaries Pete Fleming and Ed McCully, and Roger Youderian of Gospel Missionary Union.\n\nFor Clapp, it was an emotional moment when he first saw the plane's remains in the front yard of an Indian home. Surrounded by two dozen Indians and a few visiting missionaries, he moved the control throttle forward. \"Just think,\" he said, \"the last person to move that throttle in flight was Nate Saint.\"\n\nClapp said he hopes that some of the remainder of the plane can be restored and used as a museum piece to instill a vision for foreign mission work in a younger generation.\n\nClapp led a group of workers, including two sons and a grandson of Nate Saint, back to the isolated beach site to recover additional sections of the plane and to search for the engine, which was left behind by the original search party in the 1950s because of fear of another violent attack.\n\nUsing metal detectors, Clapp, missionaries, and Huaorani searched the beach and river bottom for five days before additional remains were found scattered kilometers apart. The Clapp group was unable to find the engine, in part because, during the 37 years since the incident, the river and its sand beaches have shifted course and location.\n\nClapp said he now believes the engine is in the middle of the river and perhaps will be easier to locate during dry season next January when the river will be much lower.\n\nWhile searching for the plane's remains, Steve and Phil Saint, sons of Nate Saint, met with an 82-year-old Huaorani Indian who participated in the killing of the missionaries in 1956. After a half-hour conversation, the three men stood with their arms around one another as photographs were taken. The Indian had become a Christian convert in the years following the slayings.\n\nCopyright © 1994 Christianity Today. Click for reprint information.\n\nHave something to add about this? See something we missed? Share your feedback here."}, {"url": "https://www2.wheaton.edu/bgc/archives/exhibits/Ecuador1956/10%20Who's%20Who.htm", "page_content": "Brief Descriptions of People Mentioned in the\n\nCaptions or the Documents in This Exhibit\n\nCornell Capa. Professional photojournalist on assignment for Life magazine. His photos and coverage played a very large part in the international telling of the Waorani/missionary story . Bill Cathers. Wheaton graduate (class of 1950) who, with Jim Elliot and Ed McCully, broadcast the evangelistic radio program The March of Truth from Chester, Illinois in 1950-1951. Dawa. Waorani woman, wife of Kimo. Assisted Elisabeth Elliot with Wao language learning. Herbert Elliot. Jim Elliot’s brother, who was a Plymouth Brethren missionary for 50 years in Peru . Kenneth Fleming. Brother of Peter Fleming and missionary to the Zulu people in South Africa, later a professor at Emmaus Bible Institute in Iowa . Olive Fleming. Wife of Peter Fleming and Plymouth Brethren missionary to Ecuador. Eventually returned to the United States. Later married to Walter Liefeld. Gikita. Waorani man, leader of the group that killed the missionaries on Palm Beach. He later became a Christian and a leader in the Waorani church . Gimari. Young Waorani woman, sister of Nampa and Dayuma, who was one of the three people from the tribe to make a friendly first-contact with the five missionaries on Palm Beach on January 6, 1956. The missionaries nicknamed her Delilah. Elizabeth Green. Pilot during World War II, one of the founders of Missionary Aviation Fellowship, and Nate Saint’s first contact with the organization. Ron Harris. Plymouth Brethren worker in Mexico with whom Jim Elliot spent a week in 1947, learning about the missionary life . Gerald and Jane Hawthorne. Jane was Jim Elliot’s sister. The Hawthornes lived in Wheaton, Illinois, where Gerald taught at Wheaton College. Russell Hitt. Evangelical author and journalist. Author of the Nate Saint biography, Jungle Pilot. David Howard. Brother of Elisabeth Elliot, brother-in-law and Wheaton College roommate of Jim Elliot. Howard traveled to Ecuador immediately after the killings to be with his sister. Philip Howard, Sr. Father of Elisabeth Howard Elliot and editor of the Sunday School Times, which gave a great deal of coverage to the killing of the five missionaries and later development of Christianity among the Waorani. Dr. Oswaldo Hurtado . President of Ecuador, 1981-1984 . Ipa (also Epa) . A Waorani woman, the oldest wife of Naenkiwi. Clarence W. Jones. Co-founder of the missionary short wave radio station HCJB in Quito, Ecuador. He was prominent in broadcasting the news about the deaths of the five men in 1956 and the continuing development of the story. Rosi Jung. Colleague of Catherine Peeke and another key person in the translating the New Testament in Wao. John Keenan. Pilot with Missionary Aviation Fellowship who worked closely with Nate Saint and the other four men in planning “Operation Auca.” After the murder of the missionaries, he flew over their camp, worried because they had not checked in at their regular time by radio. Kimo. A Waorani man, one of the men who attacked and killed the missionaries at Palm Beach. He was one of the first converts to Christianity among the Waorani. He traveled with Komi and Rachel Saint to Berlin, Germany in 1966 to attend the World Congress on Evangelism and give his testimony. Komi. A Waorani man, president of the village of Toñampade and husband of Dayuma. He attended the 1966 World Congress on Evangelism with Kimo and Rachel Saint . Mark Lee. Professor of drama and rhetoric at Northwestern Schools in Minneapolis, Minnesota. He had Roger Youderian as a student . Hobey E. Lowrence. One of the founders of Mission Aviation Fellowship and one of its leaders in the 1950s. Marilou McCully. Wife of Ed McCully, mother of Steve, Mike and Matt, and Plymouth Brethren missionary to Ecuador. After Ed’s death, she ran a home for missionary children in Quito for several years before returning to the United States . T. E. McCully Sr. Father of Ed McCully. Mankamo (also Mankamu, Mankimo). Wife of Gikita. She and Mintaka left the Waorani and lived in Arajuno, Ecuador, where she met Elisabeth Elliot. She and Mintaka went back to the Waorani in 1958 and played a major part in inviting Elisabeth Elliot to come and live among her people. Minkaye (also Mincayi, Minkayani). A Waorani man, one of the men who attacked and killed the missionaries at Palm Beach. Later one of the killers of Naenkiwi. He later became a Christian. He played a large part in Steve Saint’s 2006 film, The End of the Spear.\n\n\n\nMintaka. Older Waorani woman, sister of Gikita. She was one of the three people from the tribe to make first contact with the five missionaries on Palm Beach on January 6, 1956. Later she and Mankamo left the Waorani and lived in Arajuno, Ecuador, where they met Elisabeth Elliot. She went back to the Waorani in 1958 and played a major part in inviting Elliot to come and live among her people. Nampa. Waorani man, brother of Dayuma and Gimade. He was one of the six men who attacked the missionaries at Palm Beach. He was wounded in the attack and either died from that wound or died in a hunting accident a year later. Naenkiwi. Waorani male. He was one of the three Waorani who visited the missionaries on January 6. He later falsely told a party of Waorani that the missionaries had attacked their visitors, and thus precipitated the killing of the five men. Naenkiwi was later killed by other members of his tribal group. Nimonka. A Waorani man, one of the men who attacked and killed the missionaries at Palm Beach. Later, one of the killers of Naenkiwi . Harold John Ockenga. The pastor of Park Street Church in Boston, Massachusetts, and a well-known evangelical leader. J. Grady Parrot. President of Mission Aviation Fellowship in 1956 . Marj Saint. Wife of Nate Saint, mother of Steve, and a Mission Aviation Fellowship worker. She later married Abe Van der Puy. Rachel Saint. Missionary with Wycliffe Bible Translators, later independent. She was the sister of Nate Saint and established a bond with Dayuma in the mid-1950s, after Dayuma fled her tribe. She took Dayuma to the United States in 1957-1958. Later, she went with Elisabeth and Valerie Elliot to live with the Waorani in 1958 and continued to do so for the rest of her life. In 1966, she went with Kimo and Komi to the World Congress on Evangelism in Berlin, Germany. She did the first translation of the Gospel of Mark into Wao.\n\n\n\nSamuel Saint. Brother of Nate Saint. He acted as the liaison and business agent of the five widows in the United States . Robert Savage. Missionary to Ecuador who served as program director for the missionary short-wave station HCJB in Quito, Ecuador. John Smart. Editor of The Fields, the mission magazine of the Plymouth Brethren Assemblies . Clyde Taylor. Executive Director of the Evangelical Foreign Mission Association and one of the trustees of the Five Missionary Martyrs Fund. Wilfred Tidmarsh. Plymouth Brethren missionary in Ecuador who was somewhat a mentor to Jim Elliot, Ed McCully and Peter Fleming . Umpurae (or possibly Ompodae). Waorani woman, wife of Minkaye. Assisted Elisabeth Elliot with the Wao language. Abe Van der Puy. Head of the Foreign Missionary Fellowship in Ecuador in 1956 and staff member of HCJB short wave radio station. He was deeply involved in broadcasting the story of the five men’s deaths immediately after the event. He was also credited with the article that appeared in Reader’s Digest in August 1956, although it was essentially written by a Digest editor. Jack Wyrtzen. Prominent American Fundamentalist evangelist and broadcaster . Barbara Youderian. Wife of Roger Youderian and Gospel Missionary Union worker in Ecuador. Yowe (also Yowi or Dyuwe). A Waorani man, one of the men who attacked and killed the missionaries at Palm Beach. Later one of the killers of Naenkiwi. He later became a Christian and a leader in the Waorani church."}, {"url": "https://maf.org/missionaries/raney/", "page_content": "Jonathan and Cindee Raney faithfully served the people of Indonesia with Mission Aviation Fellowship (MAF) for decades. The first eight years, they had the joy of living and working in Kalimantan, Indonesia, as a pilot/mechanic family, later adding program management responsibilities to the mix. In 2000 Jonathan and Cindee moved to Papua, Indonesia, where they served faithfully in administrative and leadership roles. In 2014, following the Lord’s leading through MAF, Jonathan and Cindee were positioned in the Indonesian capital city of Jakarta where Jonathan oversaw MAF’s Indonesia area office that interfaces with the necessary government entities to obtain the vital permissions and permits for MAF to serve in Indonesia. Cindee continued to give her time to hospitality and care with a guesthouse ministry for many the visitors passing through Jakarta.\n\nIn 2021 Jonathan and Cindee transitioned to the MAF headquarters in Idaho where Jonathan was asked to serve as Vice President Safety/Quality for MAF. He is really excited to still be involved in the operations and safety not only for Indonesia but for MAF US’s programs around the world. Cindee is an administrative assistant to two departments in MAF. One is called Waypoints where they mentor people before they come to MAF until they are finished with their first term, helping them continue to grow in the Lord and become disciple makers. The other is our Base Operations that maintains our facilities here at headquarters.\n\nIsaiah 42:10 says, “Sing to the Lord a new song, His praise from the ends of the earth, you who go down to the sea, and all that is in it, you islands, and all who live in them.” Jonathan shares. “We count it a humble privilege to be available and used by our Lord for His purposes and glory in the ministry of MAF. What a blessing it is to serve missions, national churches, and isolated people through aviation. Bringing help, hope and healing.\n\nDeuteronomy 31:8 states, “The Lord himself goes before you and will be with you; He will never leave you nor forsake you. Do not be afraid; do not be discouraged.” This verse has been very encouraging for Cindee as she has impacted and been instrumental to many over the years. From her heavy involvement in flight following and providing hospitality, to running the MAF guesthouse facilities in Papua and mission guest house facility in central Jakarta, to caring for our language school students, and providing a loving home for the family, Cindee has continued to pour her life into others. Cindee continues to thank the Lord for His care and hand of blessing on their children’s and now grandchildren’s lives. With their four children grown, Cindee is thankful for the new opportunities the Lord is giving her in this season of life.\n\nJonathan and Cindee are both children of MAF pilot families. Jonathan’s family arrived in the Philippines when Jonathan was not even a year old. Sadly, Jonathan’s father was killed in an aircraft accident delivering Christmas goods to a mission family in 1968. As a nurse, Jonathan’s mother returned to the Philippines, and a few years later the family moved to Irian Jaya (now known as Papua, Indonesia) where his mother served as a school nurse for the local community. Cindee was born in Shell, Ecuador, as her parents began their MAF ministry. A number of years later, the Lord directed and moved her parents to Irian Jaya (Papua) as well. It was during this time that Jonathan and Cindee met and mutual respect was first born. They were reacquainted years later while attending Moody Bible Institute in Chicago. Jonathan earned a B.S. degree in Mission Aviation Technology at Moody Bible Institute and holds commercial, instrument, pilot, and instrument instructor’s ratings along with an airframe and powerplant mechanic’s license. Respect soon turned to love, and they were married in 1987. After working in aviation in the Seattle area, Jonathan and Cindee joined MAF to go overseas in 1990 where they served in Indonesia until December 2020. Since January 2021, Jonathan and Cindee are impacting MAF ministries worldwide through their essential new roles.\n\nGod calls the men and women of MAF to serve Him in unique ways. He may also be calling you to a special role in the Raneys’ ministry. Please prayerfully consider becoming a Ministry Partner with Jonathan and Cindee through prayer and/or financial support."}], "Roger Youderian was a missionary in the Missionary Aviation Fellowship's (MAF) Ecuadorian Mission.": [{"url": "http://missionaryportal.webflow.io/biography/roger-youderian", "page_content": "Roger Youderian was an American evangelical Christian missionary to Ecuador who, along with four others, was killed while attempting to evangelize the Huaorani people through Operation Auca.\n\nEarly Life\n\nYouderian was born in Sumatra, Montana, of Armenian descent. He contracted polio at the age of nine, crippling him slightly. He overcame the effects of the disease during high school, making it possible for him to play basketball.\n\n\n\n\n\nAfter graduating from Fergus High School in Lewistown, Montana in 1941, he attended Montana State College (now Montana State University) until he enlisted in the U.S. Army in 1943.\n\n\n\n\n\nAs a paratrooper stationed in England, he assisted an Army chaplain and eventually became an evangelical Christian. In 1944, he participated in the Rhine jump and the Battle of the Bulge, and then returned to Montana in 1946.[1]\n\n\n\n\n\nYouderian was a member of Emmanuel Baptist Church in Lewistown, Montana and played the piano for the church.\n\n\n\n\n\nYouderian entered Northwestern College near Minneapolis, Minnesota, by this time having been called to the mission field. There he studied Christian education and met Barbara Orton.\n\n\n\n\n\nYouderian graduated from Northwestern College in 1950. He and Orton married in 1951, and they applied to be missionaries with the non-denominational mission board Gospel Missionary Union. Upon being accepted, they underwent training for six months in Kansas City in preparation for their work in Ecuador.[2]\n\nLife in Ecuador\n\nYouderian, his wife, and their infant daughter Beth left for Ecuador in 1953, staying first in Quito to study Spanish and eventually moving to Macuma, a mission station in the country's southern jungle.\n\n\n\n\n\nThere, he and his wife worked with fellow Gospel Missionary Union missionaries Frank and Marie Drown, a veteran missionary couple ministering to the Jivaro people. The Youderians focused on learning the language and developing a literacy program, and with that in mind, Roger spent time visiting Jivaro homes and learning more about their culture.[3]\n\n\n\n\n\nAfter working with them for about a year, Youderian and his family began ministering to a tribe related to the Jivarro, the Achuar people. He worked with missionary pilot Nate Saint to provide important medical supplies, but after a period of attempting to build relationships with them, he failed to see any positive effect and, growing depressed, considered returning to the United States.\n\n\n\n\n\nHowever, during this time, four other missionaries in Ecuador were planning Operation Auca, an attempt to reach another group of people, the Auca. Nate Saint approached Youderian about joining their team to meet the Auca, and he assented.[4]\n\nHow Roger Youderian Died\n\nOn January 3, 1956, Youderian set up camp at \"Palm Beach\" along the Curaray River with Jim Elliot and Ed McCully. During the day, they were joined by Nate Saint and Pete Fleming. Having already contacted and exchanged gifts through the air with the Auca, the men hoped to have friendly encounters with them.\n\n\n\n\n\nOn January 6, several Auca approached them and appeared to be friendly, but two days later, all five were attacked and killed by a group of Auca warriors. According to reports,Youderian was speared while he was trying to radio to Shell for help. His body was later pulled from the river and buried at Palm Beach in a common grave with three of the other men. All family members were safely returned to the United States where they still reside today.[5]\n\nRoger Youderian's Family\n\nSpouse:\n\nBarbara Orton Youderian\n\nChildren:\n\n2\n\nRecommended Resources on Roger Youderian\n\nRoger Youderian Movies\n\nRoger Youderian Books\n\nThrough Gates of Splendor by Elisabeth Elliot\n\nRoger Youderian Quotes\n\n\"I will be led and taught of the Holy Spirit. God desires full development, use and activity of our faculties. The Holy Spirit can and will guide me in direct proportion to the time and effort I will expend to know and do the will of God. I must read the Bible to know God's will. At every point I will obey and do I will die to self. I will begin to ask God to put me in a service of constant circumstances where to live Christ I must die to self. I will be alive unto God. That I may learn to love Him with my heart, mind, soul, and body.\"\n\nFun Facts About Roger Youderian\n\nRoger was a paratrooper and Army chaplain while serving in World War II. Roger played the piano for his church, Emmanuel Baptist Church.\n\nSources\n\nThis information is provided under the Wikipedia Creative Common License."}, {"url": "https://www.christianity.com/wiki/history/who-were-the-five-missionaries-who-died-in-the-ecuador-jungle.html", "page_content": "Sixty-four years ago, on January 8, 1956, five men between the ages of 27 and 32, were speared to death trying to reach a violent, indigenous tribe in Ecuador with the gospel. They all left behind wives and four had young children. The men knew the task was dangerous, even life-threatening. So, who were these men and what would cause them to willingly lay down their lives?\n\nThe Missionaries\n\nJames “Jim” Elliot (Christian Missions in Many Lands) and his wife Elisabeth or “Betty” were both graduates of Wheaton College near Chicago. They had one daughter, Valerie, together. Jim and Elisabeth were both single missionaries to Ecuador before they were married.\n\nPeter “Pete” Fleming (Christian Missions in Many Lands) was married to Olive. He studied philosophy at the University of Washington before becoming a missionary. Pete and Jim Elliot went to Ecuador as missionaries together in 1952 before they both got married in 1954. They continued their attempts to reach the Huaorani together with Ed, Nate, and Roger.\n\nEdward “Ed” McCully (Christian Missions in Many Lands), also a graduate of Wheaton College, married Marilou (graduate of Moody Bible Institute in Chicago) and was father to Stephen, Michael, and Matthew. (Marilou was eight months pregnant with Matthew at the time of Ed’s death.)\n\nNathanael “Nate” Saint (Missionary Aviation Fellowship) was married to Marjorie and father to Kathy, Stephen, and Philip. He had also attended Wheaton College. According to From Jerusalem to Irian Jaya: A Biographical History of Christian History Missions, “Perhaps the best-known missionary pilot has been Nate Saint, whose role in the Auca tragedy made him a household name in evangelical circles.” It was due to Nate Saint’s skill as a pilot that the five missionaries were able to land on “Palm Beach.” Nate served in World War II with the Army Air Corps.\n\nRoger Youderian (Gospel Missionary Union) attended Montana State College, enlisted in the U.S. Army, was a paratrooper in World War II, and afterwards attended Northwestern College to prepare for missions. He married Barbara and had two children, Beth and Jerry.\n\nThe Mission\n\nThe interdenominational, evangelical missionaries, Jim Elliot, Pete Fleming, Ed McCully, Nate Saint, and Roger Youderian, were speared to death by the very people they were attempting to reach with the gospel. The five men left behind five widows. The Huaorani Indians (otherwise known as the Waodani, Waorani, or Auca Indians), totaling around 500 tribe members in 1955, were a violent tribe of indigenous, Amerindians living in the Amazonian region of Ecuador.\n\nThe tribe was fearful of outsiders and had been known to kill any that entered their territory. They were also internally violent. The missionaries chose to go to the Huaorani tribe because they were known to be completely “unreached” by the gospel. The tragedy was featured in the January 30, 1956 edition of Life Magazine which was the first time the Huaorani tribe was ever photographed in their natural surroundings.\n\nAccording to that 1956 edition of Life Magazine, the missionaries discovered the “Aucas” or Huaorani “as they and their wives were ministering to Quechua-speaking and Jivaro Indians.” The term Auca means “savages” in Quechua. They physically found the tribe flying over Auca territory in Nate Saint’s plane. The men spent weeks dropping gifts from the plane to the Aucas in a bucket before finding the courage to land the plane on the shore of the Curaray River. They believed the Aucas to be friendly when they finally landed on the riverbank that they referred to as “Palm Beach.”\n\n“Between October 6 and December 23, Saint, accompanied by either McCully or Elliot, made 13 flights over the Wao clearings. Fleming provided prayer and financial support from his station. Saint lowered gifts to the ground. First, they sent down an aluminum cooking pot decorated with floating ribbons, then buttons, pants, shirts (the Waorani wore only cotton G-strings), an ax head, knives, photos, machetes. The Waorani received these gifts with smiles and laughter. They began to return gifts: a headband, woven thread, smoked monkey tail, two squirrels, a parrot. During these exchanges, the men shouted carefully mouthed phrases in the Wao language, which they had picked up from Dayuma, a young Wao woman who had fled tribal violence only to live in servitude at a nearby hacienda.”\n\nTo Lay Down One’s Life\n\nIn early January, all five men, believing that God was providing an “open door” to reach the Huaorani with the good news of Jesus Christ, landed on the banks of the Curaray River in Nate Saint’s plane. Although initial contacts seemed friendly, all five men were ultimately speared to death by the Huaorani (who believed that all outsiders would eventually shoot them with guns). Elliot, Fleming, McCully, Saint, and Youderian, of course, had no intention of shooting the Indians, but, rather, were hoping and praying to be able to share with them the hope of eternal life that they had in Christ.\n\nAgain, what would cause five young men with families to willingly lay down their lives? Did they truly believe that their mission to reach the Aucas was worth risking everything? They absolutely did. They believed the story of the New Testament, that Jesus Himself had laid down His life to save those who were spiritually lost. The Aucas, or Huaorani, had never heard of Jesus’ love and sacrifice on the cross. They didn’t have a Bible in their language and had not heard the message of salvation. They needed someone to come tell them, and yet that required great courage as the Huaorani were known for violence. The five men who went believed it was what Christ would have done and what Christ wanted them to do!\n\nIf you declare with your mouth, “Jesus is Lord,” and believe in your heart that God raised him from the dead, you will be saved. For it is with your heart that you believe and are justified, and it is with your mouth that you profess your faith and are saved…. for, “Everyone who calls on the name of the Lord will be saved.” How, then, can they call on the one they have not believed in? And how can they believe in the one of whom they have not heard? And how can they hear without someone preaching to them? And how can anyone preach unless they are sent?” (Romans 10:9-15, NIV).\n\nNot in Vain\n\nSo, did the men die in vain? Did the Huaorani ever hear and receive the message about Jesus? It turns out that the men weren’t the only courageous ones. Following their deaths, with the help of Dayuma, Jim’s wife, Elisabeth (along with daughter, Valerie), and Nate’s sister, Rachel, returned to live among the Huaorani, offering them forgiveness and completing the task the men had begun. This led to the conversion of many in the tribe, including at least one of the murderers. Ultimately, the New Testament was translated into the Wao language. “Nate Saint’s eldest son, Steve, and his family lived among the Waorani for a year in 1995.”\n\nSources\n\nhttps://christianhistoryinstitute.org/magazine/article/martyrs-to-the-spear/\n\nhttps://www.christiantoday.com/article/i-miss-my-father-but-he-gave-his-life-for-christ-daughter-of-murdered-christian-missionary-speaks-out/104967.htm\n\nhttps://www.inspirationalchristians.org/evangelists/jim-elliot-biography/\n\n“Shadow of the Almighty” by Elisabeth Elliot\n\n“Through Gates of Splendor” by Elisabeth Elliot\n\n“These Strange Ashes” by Elisabeth Elliot\n\n©iStock/Getty Images Plus/Kalistratova\n\n\n\n\n\nKristi Walker has been a missionary in Berlin, Germany for over 15 years working with an international church as the Director of Student Ministries. Her birthday is January 8, and the story of the five missionaries who died in Ecuador has greatly impacted and inspired her. She is the author of two books: Disappointment: A Subtle Path Away from Christ and Convinced. Applying Biblical Principles to Life’s Choices."}, {"url": "https://www.howold.co/person/roger-youderian/biography", "page_content": "Roger Youderian Biography\n\nAmerican Christian missionary\n\nRoger Youderian (January 21, 1924 – January 8, 1956) was an American Christian missionary to Ecuador who, along with four others, was killed while attempting to evangelize the Huaorani people through efforts known as Operation Auca.\n\nEarly life\n\nYouderian was born in Sumatra, Montana, of Armenian descent. He contracted polio at the age of nine, crippling him slightly. He overcame the effects of the disease during high school, making it possible for him to play basketball. After graduating from Fergus High School in Lewistown, Montana in 1941, he attended Montana State College (now Montana State University) until he enlisted in the U.S. Army in 1943.\n\nWorld War II\n\nAs a paratrooper stationed in England, he *isted an Army chaplain and eventually became a Christian. In 1944, he participated in the Operation_Varsity and the Battle of the Bulge, and then returned to Montana in 1946.\n\nPost war\n\nYouderian was a member of Emmanuel Baptist Church in Lewistown, Montana and played the piano for the church.\n\nYouderian entered Northwestern College near Minneapolis, Minnesota, by this time having been called to the mission field. There he studied Christian education and met Barbara Orton. Youderian graduated from Northwestern College in 1950. He and Orton married in 1951, and they applied to be missionaries with the nondenominational mission board Gospel Missionary Union. Upon being accepted, they underwent training for six months in Kansas City in preparation for their work in Ecuador.\n\nMinistry in Ecuador\n\nYouderian, his wife, and their infant daughter Beth left for Ecuador in 1953, staying first in Quito to study Spanish and eventually moving to Ma*a, a mission station in the country's southern jungle. There, he and his wife worked with fellow Gospel Missionary Union missionaries Frank and Marie Drown, a veteran missionary couple ministering to the Jivaro people. The Youderians focused on learning the language and developing a literacy program, and with that in mind, Roger spent time visiting Jivaro homes and learning more about their culture.\n\nAfter working with them for about a year, Youderian and his family began ministering to a tribe related to the Jivarro, the Achuar people. He worked with missionary pilot Nate Saint to provide important medical supplies, but after a period of attempting to build relationships with them, he failed to see any positive effect and, growing depressed, considered returning to the United States. However, during this time, four other missionaries in Ecuador were planning Operation Auca, an attempt to reach another group of people, the Auca. Nate Saint approached Youderian about joining their team to meet the Auca, and he *ented.\n\nOn January 3, 1956, Youderian set up camp at \"Palm Beach\" along the Curaray River with Jim Elliot and Ed McCully. During the day, they were joined by Nate Saint and Pete Fleming. Having already contacted and exchanged gifts through the air with the Auca, the men hoped to have friendly encounters with them. On January 6, several Auca approached them and appeared to be friendly, but two days later, all five were attacked and killed by a group of Auca warriors. According to reports, Youderian was speared while he was trying to radio to Shell for help. His body was later pulled from the river and buried at Palm Beach in a common grave with three of the other men. All family members were safely returned to the United States where they still reside today.\n\nNotes\n\nReferences"}, {"url": "http://armeniapedia.org/index.php?title=Roger_Youderian", "page_content": "Roger Youderian (January 21, 1924 – January 8, 1956) was a Christian missionary to Ecuador, where he was killed by Huaorani warriors.\n\nRoger was born in Sumatra, Montana. He contracted polio at the age of nine, crippling him slightly. He overcame the effects of the disease during high school, making it possible for him to play basketball. After graduating, he attended Montana State College until he enlisted in the U.S. Army in 1943. As a paratrooper stationed in England, he assisted an Army chaplain and eventually became an evangelical Christian. In 1944, he participated in the Rhine jump and the Battle of the Bulge, and then returned to Montana in 1946.[1]\n\nUpon returning, Roger entered Northwestern College in Minneapolis, by this time having been called to the mission field. There he studied Christian education and met Barbara Orton. The two married in 1951, and applied to be missionaries with the nondenominational mission board Gospel Missionary Union. Upon being accepted, they underwent training for six months in Kansas City in preparation for their work in Ecuador.[2]\n\nRoger and Barbara and their infant daughter Beth left for Ecuador in 1953, staying first in Quito to study Spanish and eventually moving to Macuma, a mission station in the country's southern jungle. Youderian began work in Ecuador in 1953 under the mission board. Along with his wife Barbara and daughter Beth, he settled in the southern jungle of Ecuador, in a mission station called Macuma. There, he and his wife worked with a veteran missionary couple, ministering to the Shuar people. They focused on learning the language and developing a literacy program, and with that in mind, Roger spent time visiting Shuar homes and learning more about their culture.[3]\n\nAfter working with them for about a year, Roger and his family began ministering to a tribe related to the Shuar, the Achuar people. He worked with Nate Saint to provide important medical supplies, but after a period of attempting to build relationships with them, he failed to see any positive effect and, growing depressed, considered returning to the United States. However, during this time four other missionaries in Ecuador were planning Operation Auca, an attempt to reach another people group, the Huaorani. Nate Saint approached him about joining their team to meet the Huaorani, and he assented.[4]\n\nRoger set up camp at \"Palm Beach\" along the Curaray river with Jim Elliot and Ed McCully on January 3, 1956. During the day they were joined by Nate Saint and Pete Fleming. Having already contacted and exchanged gifts through the air with the Huaorani, the men hoped to have friendly encounters with them. On January 6, several Huaorani approached them and appeared to be friendly, but two days later, all five were attacked and killed by a group of Huaorani warriors. Roger's body was later pulled from the river and buried at Palm Beach.[5]\n\nThis article contains content from Wikipedia, used here under the GNU Free Documentation License."}, {"url": "https://hub.maf.org/tag/roger-youderian", "page_content": "… since Nate Saint, Jim Elliot, Peter Fleming, Roger Youderian, and Ed McCully gave their lives so that the Waorani (then Auca) tribe could hear the Gospel. After initial efforts to make contact with this remote tribe in Ecuador were deemed positive, these brave men landed on a river beach deep in the jungle […]\n\nShare this: Facebook\n\nTwitter\n\nPrint\n\nEmail\n\n"}, {"url": "https://maf.org/missionaries/raney/", "page_content": "Jonathan and Cindee Raney faithfully served the people of Indonesia with Mission Aviation Fellowship (MAF) for decades. The first eight years, they had the joy of living and working in Kalimantan, Indonesia, as a pilot/mechanic family, later adding program management responsibilities to the mix. In 2000 Jonathan and Cindee moved to Papua, Indonesia, where they served faithfully in administrative and leadership roles. In 2014, following the Lord’s leading through MAF, Jonathan and Cindee were positioned in the Indonesian capital city of Jakarta where Jonathan oversaw MAF’s Indonesia area office that interfaces with the necessary government entities to obtain the vital permissions and permits for MAF to serve in Indonesia. Cindee continued to give her time to hospitality and care with a guesthouse ministry for many the visitors passing through Jakarta.\n\nIn 2021 Jonathan and Cindee transitioned to the MAF headquarters in Idaho where Jonathan was asked to serve as Vice President Safety/Quality for MAF. He is really excited to still be involved in the operations and safety not only for Indonesia but for MAF US’s programs around the world. Cindee is an administrative assistant to two departments in MAF. One is called Waypoints where they mentor people before they come to MAF until they are finished with their first term, helping them continue to grow in the Lord and become disciple makers. The other is our Base Operations that maintains our facilities here at headquarters.\n\nIsaiah 42:10 says, “Sing to the Lord a new song, His praise from the ends of the earth, you who go down to the sea, and all that is in it, you islands, and all who live in them.” Jonathan shares. “We count it a humble privilege to be available and used by our Lord for His purposes and glory in the ministry of MAF. What a blessing it is to serve missions, national churches, and isolated people through aviation. Bringing help, hope and healing.\n\nDeuteronomy 31:8 states, “The Lord himself goes before you and will be with you; He will never leave you nor forsake you. Do not be afraid; do not be discouraged.” This verse has been very encouraging for Cindee as she has impacted and been instrumental to many over the years. From her heavy involvement in flight following and providing hospitality, to running the MAF guesthouse facilities in Papua and mission guest house facility in central Jakarta, to caring for our language school students, and providing a loving home for the family, Cindee has continued to pour her life into others. Cindee continues to thank the Lord for His care and hand of blessing on their children’s and now grandchildren’s lives. With their four children grown, Cindee is thankful for the new opportunities the Lord is giving her in this season of life.\n\nJonathan and Cindee are both children of MAF pilot families. Jonathan’s family arrived in the Philippines when Jonathan was not even a year old. Sadly, Jonathan’s father was killed in an aircraft accident delivering Christmas goods to a mission family in 1968. As a nurse, Jonathan’s mother returned to the Philippines, and a few years later the family moved to Irian Jaya (now known as Papua, Indonesia) where his mother served as a school nurse for the local community. Cindee was born in Shell, Ecuador, as her parents began their MAF ministry. A number of years later, the Lord directed and moved her parents to Irian Jaya (Papua) as well. It was during this time that Jonathan and Cindee met and mutual respect was first born. They were reacquainted years later while attending Moody Bible Institute in Chicago. Jonathan earned a B.S. degree in Mission Aviation Technology at Moody Bible Institute and holds commercial, instrument, pilot, and instrument instructor’s ratings along with an airframe and powerplant mechanic’s license. Respect soon turned to love, and they were married in 1987. After working in aviation in the Seattle area, Jonathan and Cindee joined MAF to go overseas in 1990 where they served in Indonesia until December 2020. Since January 2021, Jonathan and Cindee are impacting MAF ministries worldwide through their essential new roles.\n\nGod calls the men and women of MAF to serve Him in unique ways. He may also be calling you to a special role in the Raneys’ ministry. Please prayerfully consider becoming a Ministry Partner with Jonathan and Cindee through prayer and/or financial support."}, {"url": "https://maf.org/missionaries/yoder/", "page_content": "Caleb and Josie-Lynne Yoder are humbled by the opportunity the Lord has given them to serve with Mission Aviation Fellowship. Caleb will be serving as a maintenance specialist, ensuring that the aircraft used by MAF are functional and safe. Josie-Lynne will continue to be a stay-at-home mom to their three children, while keeping her hands open to whatever opportunities God has for her. They both desire to serve the community wherever they live and to help show people the light of Christ. Their kids, Rayne, Leo, and Sage are excited for the chance to meet new people and see new sights.\n\nCaleb was born in Hamilton, Montana, to a family of strong Christians who helped shape the faith that Caleb has today. While he was growing up, his parents founded a prison ministry that allowed men exiting prison to have transitional housing and a community of believers. Caleb witnessed lives changed by the radical love of Jesus. As a teenager, he attended a missions conference in Germany where he saw believers from all over the world come together and worship the Lord. The experience had a huge impact on him.\n\nAs an adult, Caleb worked at an aviation composite manufacturing company, and God used this as a doorway to attend Moody Bible Institute. Both he and his wife, Josie-Lynne, were continually drawn to Moody, but it seemed too far out of reach due to finances and time. Yet through lots of prayer, they decided this was the route God wanted them to take. Caleb put in his Moody application, and a week later, he was notified that he was going to be laid off and that the company would pay for retraining as part of a severance package. This included cost of living and all tools, books, and supplies. In 2020 Caleb received his A&P License. They are now excited to serve with MAF and to see what God has in store for the future.\n\nJosie-Lynne was born on a brisk leap year day in Spokane, Washington. She was not raised in a church nor with ideas of missions, but she had a strong desire to travel the world. This desire only increased after a trip to Germany with her mom when she was a teenager. God was gracious in Josie-Lynne’s life and surrounded her with the love and friendship of Caleb and his family, who helped lead her into a relationship with Jesus. Though not immediate friends, the two would talk, and Caleb never forgot Josie-Lynne, even after she stopped coming to the youth group, so he continued to pray for her.\n\nOn a sunny day in 2010, Josie-Lynne accepted Christ. As her relationship with the Lord grew, she began to learn more and more about missions and what that really meant. Caleb and Josie-Lynne prayed about dating, and Josie- Lynne saw an image of a golden ring. They knew that if God was going to let them date, this meant marriage. The two wed thirteen months later. Through Caleb’s time at Moody Bible Institute and Josie-Lynne’s growing desire to travel, missions became their apparent path. Knowing that God had given Caleb and Josie-Lynne this desire helped lead them to MAF.\n\nThe Yoders have their hands open to the Lord, praying His will is done, and that the unreached turn to Jesus. God calls the men and women of MAF to serve Him in unique ways. He may also be calling you to a special role in Caleb and Josie-Lynne’s ministry. Please prayerfully consider becoming a ministry partner with them through prayer and/or financial support."}, {"url": "https://prabook.com/web/roger.youderian/1927077", "page_content": "Roger Youderian\n\nMissionary\n\nJanuary 21, 1924 (age 31) Sumatra, Montana, Rosebud County, United States of America\n\nHe contracted polio at the age of nine, crippling him slightly. He overcame the effects of the disease during high school, making it possible for him to play basketball. As a paratrooper stationed in England, he assisted an Army chaplain and eventually became an evangelical Christian. In 1944, he participated in the Rhine jump and the Battle of the Bulge, and then returned to Montana in 1946. Youderian entered Northwestern College near Minneapolis, Minnesota, by this time having been called to the mission field Upon being accepted, they underwent training for six months in Kansas City in preparation for their work in Ecuador. The Youderians focused on learning the language and developing a literacy program, and with that in mind, Roger spent time visiting Jivaro homes and learning more about their culture. After working with them for about a year, Youderian and his family began ministering to a tribe related to the Jivarro, the Achuar people. He worked with missionary pilot Nate Saint to provide important medical supplies, but after a period of attempting to build relationships with them, he failed to see any positive effect and, growing depressed, considered returning to the United States. However, during this time, four other missionaries in Ecuador were planning Operation Auca, an attempt to reach another group of people, the Auca. Nate Saint approached Youderian about joining their team to meet the Auca, and he assented. On January 3, 1956, Youderian set up camp at \"Palm Beach\" along the Curaray River with Jim Elliot and Editor McCully. During the day, they were joined by Nate Saint and Pete Fleming. Having already contacted and exchanged gifts through the air with the Auca, the men hoped to have friendly encounters with them. On January 6, several Auca approached them and appeared to be friendly, but two days later, all five were attacked and killed by a group of Auca warriors. According to reports,Youderian was speared while he was trying to radio to Shell for help. His body was later pulled from the river and buried at Palm Beach in a common grave with three of the other mentor All family members were safely returned to the United States where they still reside today."}, {"url": "https://www.dailyleader.com/2019/09/06/its-a-legacy-of-love-and-truth-daughter-of-missionaries-to-speak-at-fbc/", "page_content": "‘It’s a legacy of love (and) truth’ — Daughter of missionaries to speak at FBC Published 11:29 pm Friday, September 6, 2019\n\nOn Jan. 8, 1956, when Valerie was just 10 months old, her father Jim and four of his friends were murdered on a beach in Ecuador by a group of Huaorani/Waodani warriors.\n\nThe fierce men — from the tribe popularly known as Aucas, “savages” — speared the men who refused to fight back. The Christian missionaries hoped even as they died their attackers would understand they were loved. Loved not just by their victims, but by the God in whose name they’d come.\n\nValerie Elliot Shepard, the only child of Jim and Elisabeth Elliot, was left without a father. So were the children of Roger Youderian, Ed McCully and Nate Saint. The fifth victim, Pete Fleming, though married, was not yet a father.\n\nShepard will be at First Baptist Church Brookhaven Sept. 17, 6:30-8 p.m., to share her parents’ story.\n\nThe events of that January day in the rain forest have been immortalized in numerous books, films, documentaries and websites. For many, the testimony of these men and the families they left behind — some of whom continued to work to reach the Huaroni for Christ — have been the inspiration to become missionaries, to dedicate their lives to following Jesus or to reach out to their neighbors with the gospel.\n\nShepard grew up seeing her mother share her story through the books she authored. As the wife of a pastor for 43 years, Shepard has played her own role in sharing the love of Christ. When her husband, Walter Shepard, retired in 2018, the couple moved to Long Beach.\n\nA few years ago, Shepard began looking through stored items for her father’s original journals. What she came across instead were at least four years’ worth of correspondence between her parents from the years they courted. She found that each of her parents had written letters to the other that quoted scripture and other books they were reading, that encouraged one another and shared truths with deep wisdom, said Shepard.\n\n“It’s a legacy of love. It’s a legacy of truth,” she said.\n\nWhen her mother died and she was planning the memorial service, Shepard told her husband, “I can’t carry this legacy.”\n\n“He said, ‘It’s not you that carries it — it’s Christ, and it’s Christ that you are sharing with other people when you share the story.’ So, I hope to carry on the legacy simply by telling the story,” said Shepard.\n\nEarlier this year, Shepard published “Devotedly: The Personal Letters and Love Story of Jim and Elisabeth Elliot.”\n\nShepard contacted a friend with ties to Lincoln County and asked if she could come speak. Renee Hutson, director of Women on Mission for a nine-county area, was tasked with putting together an event to allow Shepard to reach a large audience and allow as many as possible to meet Shepard and hear the story of her parents’ love for one another and for Jesus.\n\nOpen to anyone — not just women or any certain church denomination — the time of fellowship and sharing with Shepard at First Baptist is $5 per person for the meal and registration is required. Registration deadline is Monday and interested persons can call the church office at 601-833-5118 or Hutson at 601-748-0705 to register.\n\nThe missionaries who lost their lives that day in 1956 had their base at Shell, Ecuador. Shell is now the home of Casa de Fe, a home for abandoned, abused, neglected or disabled children with a goal to love, educate and serve their physical, educational and spiritual needs. The home has more than 60 children on average who are looked after daily at a cost of more than $30,000 each month.\n\nCase de Fe is a ministry close to Shepard’s heart, so Women on Mission asks event attendees to bring a donation of school supplies for the home’s students, as well. A voluntary love offering will also be collected to help cover Shepard’s travel expenses.\n\nFor more information, visit www.fbcbrookhaven.org or call the church office."}, {"url": "https://bennett-projects.com/roger-youderian/", "page_content": "Roger Youderian\n\nRoger Youderian\n\n(Missionary martyr in Equador, 1950’s.)\n\nRoger Youderian was one of five American missionaries who were killed by Auca Indians in the Ecuadorian jungle, 1956. This Reader’s Theatre was written from conversations the writer had around Barbara Youderian’s kitchen table. Roger Youderian, Jim Elliot, Pete Fleming, Ed McCully, and Nate Saint, may your story never die….may we of the next generations live with equal passion for our God’s glory.\n\n“Worthy are you to take the scroll and to open its seals, for you were slain, and by your blood you ransomed people for God from every tribe and language and people and nation…” Revelations 5:9 ESV\n\nSample of Youderian\n\nReader’s Theatre and/or Dinner Theatre\n\nLength: about 45 minutes and/or 2 hours\n\nCast: 2 (1W/1WorM) plus a men’s quartet\n\nSetting: flashes back and forth from Barbara Youderian’s kitchen to a Radio Studio\n\nFeatures: men’s quartet singing hymns from the 1950’s\n\nShare this: Twitter\n\nFacebook\n\n"}]}