{"Thutmose III reigned for 54 years.": [{"url": "https://www.britannica.com/biography/Thutmose-III", "page_content": "Thutmose III , (died 1426 bce), king (reigned 1479–26 bce) of the 18th dynasty , often regarded as the greatest of the rulers of ancient Egypt . Thutmose III was a skilled warrior who brought the Egyptian empire to the zenith of its power by conquering all of Syria, crossing the Euphrates (see Tigris-Euphrates river system ) to defeat the Mitannians , and penetrating south along the Nile River to Napata in the Sudan. He also built a great number of temples and monuments to commemorate his deeds.\n\nIn the 22nd year of Thutmose’s reign, a formidable coalition was formed against Egypt , led by the king of Kadesh in northern Syria and no doubt supported by the Mitanni. At this moment of crisis, Hatshepsut died, and Thutmose as sole ruler began a series of annual military campaigns aimed at Nubia and the Levantine powers.\n\nAs he grew up, Thutmose may even have been entrusted with command of the army on campaign in Nubia ; he may have also fought in Gezer in Palestine . His grandfather Thutmose I had penetrated into northern Syria; Thutmose II, though far from a weakling, had not followed this success, and Hatshepsut may have been unwilling to send an army into the field. Thus, through inaction, Egyptian influence in Syria and Palestine declined. The sons and grandsons of the Syrian princes who had surrendered to Thutmose I no longer sent tribute, and the king of Mitanni , a powerful Mesopotamian kingdom with its capital beyond the Euphrates, was able to extend his control westward to the Mediterranean .\n\nThutmose III was the son of Thutmose II ; his mother was one of the king’s secondary wives or a lesser harem queen, named Isis . Since there was no prince with a better claim to the throne, the boy was crowned king on the early death of his father; he was very young at the time. Hatshepsut —the daughter of Thutmose I , the wife and sister of Thutmose II, and the mother of Thutmose III’s half-sister Neferure—acted as regent. By the seventh year of his reign this strong-minded and ambitious woman herself assumed the attributes, dress, and insignia of a king and to all intents and purposes reigned in his stead. As one of her courtiers says, “she directed the affairs of the whole land according to her wishes.” Still, Thutmose was given an education befitting his royal station. He was taught all military skills, especially archery, which he demonstrated in public display, and horsemanship, in which he showed considerable prowess . He was later to boast that none among his followers could equal him in physical strength and in marksmanship.\n\nMilitary campaigns\n\nAfter a few months’ preparation the king was ready to march at the head of his army. The first campaign is recorded in some detail on the walls of the temple he built at Karnak in Thebes, which describe the march to Gaza and thence to Yahmai south of the Carmel Range, the council of war, and the king’s bold decision to surprise the enemy encamped at Megiddo, northeast of Carmel and about 18 miles (29 km) southeast of the modern city of Haifa. Thutmose’s approach was by the route least expected—a narrow defile over the mountain. It was successful: the enemy was defeated, and Megiddo was taken after a siege of eight months. In subsequent campaigns, which are less fully described in the annals, ports on the Phoenician coast were converted into Egyptian supply bases, and Kadesh and other cities in Al-Biqāʿ (Bekaa) valley were taken.\n\nIn the 33rd year of Thutmose’s reign, the time was at last ripe for his most audacious move, an attack on the kingdom of Mitanni itself, which had grown stronger since the day when Thutmose I had taken its army by surprise. Thutmose planned the campaign well; pontoon boats were transported across Syria on oxcarts for the crossing of the Euphrates River. The ensuing encounter, which must have taken place on the eastern bank, is not described by the annalist; it resulted in the precipitate flight of the Mitannian king and the capture of 30 members of his harem and some hundreds of his soldiers. Triumphantly, Thutmose set up his commemorative inscription by the river’s edge, next to that of his grandfather Thutmose I. It was his farthest point of advance. On the homeward journey he hunted elephant in the land of Niy, in the Orontes valley, and on his return he celebrated a great triumph at Thebes and dedicated prisoners and booty to the temple of the state god, Amon.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn later campaigns (there were 17 in all), Thutmose III was content to consolidate what he had won and to lay the foundations of an imperial organization of his Asian possessions. Native rulers, members of local ruling dynasties, were henceforward set to govern their own territories as vassals of Egypt and were bound by solemn oath to keep the peace, render annual tribute, and obey the Egyptian representative in the region, the “overseer of foreign lands.” Their sons were sent as hostages to Egypt and educated at court, so that in due course they might return to rule their inheritance, Egyptianized in outlook and sympathies. Fortresses were built, and Egyptian garrisons were stationed at key points along the coast and in the highlands.\n\nTo the south, Thutmose reaffirmed the southern boundary of Egyptian domination over Nubia as far as Kurgus, and at Napata, near Mount Barkal, he built a temple to Amon. He thoroughly subdued the turbulent Nubian tribes and employed many of them in the gold mines, which from his reign on became the basis of Egyptian wealth in foreign exchange with the princes of western Asia. For the last 12 years of his reign, he was content to enjoy the fruits of his victories. The tribute of Syria and Palestine and of the Sudan poured into his treasury; the annals list huge quantities of timber and metal ores, cattle, and grain delivered by the conquered. Minoan Crete and Cyprus, Babylonia, Assyria, and the Hittites sent gifts. The tombs of high officials of the reign are decorated with scenes depicting the reception of foreign envoys coming from places as far away as the Aegean and the Greek mainland to lay their rich and exotic gifts at the feet of the pharaoh. The prestige of Egypt had never been so great."}, {"url": "https://www.newworldencyclopedia.org/entry/Thutmose_III", "page_content": "Thutmose III Tuthmosis III, Thothmes III, \"Manahpi(r)ya\" in the Amarna letters Basalt Statue of Thutmosis III in Luxor Museum Pharaoh of Egypt Reign 1479 B.C.E. to 1425 B.C.E. , 18th Dynasty Predecessor Hatshepsut Successor Amenhotep II Royal titulary Nomen:\n\nThutmose Neferkheperu\n\nThoth is born, beautiful of forms Horus name: Kanakht Khaemwaset\n\nMighty Bull, Arising in Thebes\n\n\n\nNebty name: Wahnesytmireempet\n\nEnduring in kingship like Re in heaven\n\n\n\nGolden Horus: Sekhempahtydsejerkhaw\n\nPowerful of strength, holy of diadems\n\n\n\nConsort(s) Hatshepsut-Meryetre, Nebtu, Menwi, Merti,\n\nMenhet, Neferure (?), Sitiah[1] Father Thutmose II Mother Aset Died 1425 B.C.E. Burial KV34 Monuments Cleopatra's Needles\n\nThutmose III (sometimes read as Thutmosis or Tuthmosis III and meaning Thoth is Born) was the sixth Pharaoh of the Eighteenth Dynasty of Ancient Egypt. During the first 22 years of Thutmose's reign he was merely lesser coregent to his stepmother, Hatshepsut. After her death and his subsequent gain of power over his kingdom, he created the largest empire Egypt had ever seen; conducting no less than 17 campaigns and conquering from Niy in north Syria to the fourth cataract of the Nile in Nubia. After his years of great campaigns were over, he established himself as a great builder pharaoh as well. He was responsible for building over 50 temples in Egypt and building massive additions to Egypt's chief temple at Karnak. New highs in artistic skills were reached during his reign, as well as unique architectural developments never seen before and never again after his reign. When he died, he was buried in the Valley of the Kings like the rest of the kings from this period in Egypt, and was succeeded by his son Amenhotep II, with whom he seems to have had a short coregency. Thutmose III ruled for almost 54 years, and his reign is usually dated from April 24, 1479 B.C.E. , to March 11, 1425 B.C.E.\n\nFamily\n\nThutmose III was the son of Pharaoh Thutmose II and Aset (sometimes transliterated Isis), a secondary wife of Thutmose II.[2] Because he was his father's only son, he took the throne when Thutmose II died, however because he was not the son of his father's Queen, Hatshepsut, his \"degree\" of royalty, so to speak, was less than ideal.[3] To bolster his image, he may have married a daughter of Thutmose II and Hatshepsut.[4] Neferure and Merytre-Hatshepsut II have been suggested, but in the case of the former it is uncertain if they were ever married,[5] and in the case of the latter it is doubtful if Merytre-Hatshepsut was Hatshepsut's daughter.[5] Regardless of this, when Thutmose II died Thutmose III was too young to rule, so Hatshepsut became his regent and soon coregent, declaring herself to be the Pharaoh.[4] For approximately 22 years Thutmose III had little power over the empire while Hatshepsut assumed the formal titulary of kingship complete with a royal prenomen—Maatkare. After the death of Hatshepsut, Thutmose III ruled Egypt on his own for 32 years until his death in his 54th regnal year.[6]\n\nBesides the possible marriage to Neferure, Thutmose III had two known wives. Sat-jah bore his firstborn, Amenemhet, but the child preceded his father in death.[5] His successor, Amenhotep II, was born to Merytre-Hatshepsut II, who most modern scholars think was not Hatshepsut's daughter.[5]\n\nThutmose III ruled from 1479 B.C.E. to 1425 B.C.E. according to the Low Chronology of Ancient Egypt. This has been the dominant theory in academic circles since the 1960s,[7] yet in some academic circles the dates 1504 B.C.E. to 1450 B.C.E. are still preferred.[8] These dates, like all the dates of the 18th Dynasty, are open to dispute because of uncertainty about the circumstances surrounding the recording of a Heliacal Rise of Sothis in the reign of Amenhotep I.[9] A papyrus from Amenhotep I's reign records this astronomical observation which could theoretically be used to perfectly correlate the Egyptian chronology with the modern calendar, however to do this the latitude where the observation was taken must also be known. This document has no note of the place of observation, but it can safely be assumed that it was taken in either a delta city like Memphis or Heliopolis, or in Thebes. These two latitudes give dates 20 years apart, the High and Low chronologies, respectively.\n\nThe length of Thutmose III's reign, is known to the day thanks to information found in the tomb of the court official Amenemheb.[10] He assigns his death to his 54th regnal year,[11] on the thirtieth day of the third month of Proyet.[12] The day of his accession is known to be I Shemu day 4, and astronomical observations can be used to establish the exact dates of the beginning and end of his reign (assuming the low chronology) from April 24, 1479 B.C.E. to March 11, 1425 B.C.E. , respectively.[13]\n\nThutmose's military campaigns\n\nWidely considered a military genius by historians, he was an active expansionist ruler who is sometimes called Egypt's greatest conqueror or \"the Napoleon of Egypt.\"[14] He is recorded to have captured 350 cities during his rule and conquered much of the Near East from the Euphrates to Nubia during 17 known military campaigns. He was the first Pharaoh to cross the Euphrates, doing so during his campaign against Mitanni. His campaign records were transcribed onto the walls of the temple of Amun at Karnak, and are now transcribed into Urkunden IV. He is consistently regarded as one of the greatest of Egypt's warrior pharaohs, who transformed Egypt into an international superpower by creating an empire that stretched from southern Syria through to Canaan and Nubia.[15]\n\nThutmose III appears to have first led two military excursions while he was reigning under Hatshepsut; these are not considered part of his 17 campaigns, and predate his first campaign. One appears to have been to Syria and the other apparently to Nubia. These would have been late in Hatshepsut's reign, when Thutmose was apparently growing restless.[8]\n\nMuch is known about Thutmosis \"the warrior,\" not only because of his military achievements, but also because of his royal scribe and army commander, Thanuny, who wrote about his conquests and reign. The prime reason why Thutmosis was able to conquer such a large number of lands, is because of the revolution and improvement in army weapons. His army had also carried boats on dry land.\n\nAnnals of Tuthmoses III at Karnak depicting him standing before the offerings made to him after his foreign campaigns.\n\nFirst Campaign\n\nWhen Hatshepsut died on the tenth day of the sixth month of Thutmose III's twenty second year, the king of Kadesh moved his army to Megiddo.[16] Thutmose III mustered his own army and departed Egypt, passing through the border fortress of Tjaru (Sile) on the twenty-fifth day of the eighth month.[17] Thutmose marched his troops through the coastal plain as far as Jamnia, then inland to Yehem, a small city near Megiddo, which he reached in the middle of the ninth month of the same year.[17] The ensuing Battle of Megiddo was probably the largest battle in any of Thutmose's 17 campaigns.[18] A ridge of mountains jutting inland from Mount Carmel stood between Thutmose and Megiddo, and he had three potential routes to take.[18] The northern route and the southern route, both of which went around the mountain, were judged by his council of war to be the safest, but Thutmose, in an act of great bravery (or so he claims, but such self praise is normal in Egyptian texts), accused the council of cowardice and took a dangerous route[19] through a mountain pass which he alleged was only wide enough for the army to pass \"horse after horse and man after man.\"[17]\n\nDespite the laudatory nature of Thutmose's annals, such a pass does indeed exist (although it is not quite as narrow as Thutmose indicates)[20]) and taking it was a brilliant strategic move, since when his army emerged from the pass they were situated on the plain of Esdraelon directly between the rear of the Canaanite forces and Megiddo itself.[18] For some reason, the Canaanite forces did not attack him as his army emerged,[19] and his army routed them decisively.[18] The size of the two forces is difficult to determine, but if, as Redford suggests, the amount of time it took to move the army through the pass can be used to determine the size of the Egyptian force, and if the number of sheep and goats captured can be used to determine the size of the Canaanite force, then both armies were around 10,000 men.[21] According to Thutmose III's Hall of Annals in the Temple of Amun at Karnak, the battle occurred on \"Year 23, I Shemu [day] 21, the exact day of the feast of the new moon\"[22] – a lunar date. This date corresponds to May 9, 1457 B.C.E. based on Thutmose III's accession in 1479 B.C.E. After victory in battle, however, his troops stopped to plunder the enemy and the enemy was able to escape into Megiddo.[23]. Thutmose was forced to besiege the city instead, but he finally succeeded in conquering it after a siege of seven or eight months (see Siege of Megiddo).[23]\n\nThis campaign drastically changed the political situation in the ancient Near East. By taking Megiddo, Thutmose gained control of all of northern Canaan, and the Syrian princes were obligated to send tribute and their own sons as hostages to Egypt.[24] Beyond the Euphrates, the Assyrian, Babylonian, and Hittite kings all gave Thutmose gifts, which he alleged to be \"tribute\" when he recorded it on the walls of Karnak.[25] The only noticeable absence is Mitanni, which would bear the brunt of the following Egyptian campaigns into Asia.\n\nTours of Canaan and Syria\n\nThutmose's second, third, and fourth campaigns appear to have been nothing more than tours of Syria and Canaan to collect tribute.[26] Traditionally, the material directly after the text of the first campaign has been considered to be the second campaign.[27] This text records tribute from the area which the Egyptians called Retenu (roughly equivalent to Canaan), and it was also at this time that Assyria paid a second \"tribute\" to Thutmose III.[28] However, it is probable that these texts come from Thutmose's 40th year or later, and thus have nothing to do with the second campaign at all. If so, then no records of this campaign have been found at all so far.Cite error: Closing </ref> missing for <ref> tag This survey is dated to Thutmose's 25th year.[29] No record remains of Thutmose's fourth campaign whatsoever,[30] but at some point in time a fort was built in lower Lebanon and timber was cut for construction of a processional barque, and this probably fits best during this timeframe.[31]\n\nConquest of Syria\n\nThe fifth, sixth, and seventh campaigns of Thutmose III were directed against the Phoenician cities in Syria and against Kadesh on the Euphrates. In Thutmose's 29th year, he began his fifth campaign wherein he first took an unknown city (the name falls in a lacuna) which had been garrisoned by Tunip.[32] He then moved inland and took the city and territory around Ardata.[33] Unlike previous plundering raids, however, Thutmose III subsequently garrisoned the area known as Djahy, which is probably a reference to southern Syria.[34] This now permitted him to ship supplies and troops back and forth between Syria and Egypt.[33] Although there is no direct evidence for it, it is for this reason that some have supposed that Thutmose's sixth campaign, in his 30th year, commenced with a naval transportation of troops directly into to Byblos, bypassing Canaan entirely.[33] After the troops arrived in Syria by whatever means, they proceeded into the Jordan river valley and moved north from there, pillaging Kadesh's lands.[35] Turning west again, Thutmose took Simyra and quelled a rebellion in Ardata, which had apparently rebelled once again.[36] To stop such rebellions, Thutmose began taking hostages from the cities in Syria. The cities in Syria were not guided by the popular sentiment of the people as much as they were by the small number of nobles who were aligned to Mitanni: a king and a small number of foreign Maryannu.[35] Thutmose III found that by taking family members of these key people to Egypt as hostages, he could drastically increase their loyalty to him.[35] However, Syria did rebel yet again in Thutmose's 31st year, and he returned to Syria for his seventh campaign, took the port city of Ullaza[35] and the smaller Phoenician ports,[36] and took even more measures to prevent further rebellions.[35] All the excess grain which was produced in Syria was stored in the harbors he had recently conquered, and was used for the support of the military and civilian Egyptian presence ruling Syria.[35] This furthermore left the cities in Syria desperately impoverished, and with their economies in ruins, they had no means of funding a rebellion.[37]\n\nAttack on Mitanni\n\nAfter Thutmose III had taken control of the Syrian cities, the obvious target for his eighth campaign was the state of Mitanni, a Hurrian country with an Indo-Aryan ruling class. However, to reach Mitanni, he had to cross the Euphrates river. Therefore, Thutmose III enacted the following strategy. He sailed directly to Byblos[38] and then made boats which he took with him over land on what appeared to otherwise be just another tour of Syria,[36] and he proceeded with the usual raiding and pillaging as he moved north through the lands he had already taken.[39] However, here he continued north through the territory belonging to the still unconquered cities of Aleppo and Carchemish, and then quickly crossed the Euphrates in his boats, taking the Mitannian king entirely by surprise.[39] It appears that Mitanni was not expecting an invasion, so they had no army of any kind ready to defend against Thutmose, although their ships on the Euphrates did try to defend against the Egyptian crossing.[38] Thutmose III then went freely from city to city and pillaged them while the nobles hid in caves (or at least this is the typically ignoble way Egyptian records chose to record it).[39] During this period of no opposition, Thutmose put up a second stele commemorating his crossing of the Euphrates, next to the one his grandfather Thutmose I had put up several decades earlier.[39] Eventually a militia was raised to fight the invaders, but it fared very poorly.[39] Thutmose III then returned to Syria by way of Niy, where he records that he engaged in an elephant hunt.[40] He then collected tribute from foreign powers and returned to Egypt in victory.[38]\n\nTours of Syria\n\nThutmose III returned to Syria for his ninth campaign in his 34th year, but this appears to have been just a raid of the area called Nukhashshe, a region populated by semi-nomadic people.[41] The plunder recorded is minimal, so it was probably just a minor raid.[42] Records from his tenth campaign indicate much more fighting, however. By Thutmose's 35th year, the king of Mitanni had raised a large army and engaged the Egyptians around Aleppo.[43] As usual for any Egyptian king, Thutmose claimed a total crushing victory, but this statement is suspect. Specifically, it is doubted that Thutmose accomplished any great victory here due to the very small amount of plunder taken.[43] Specifically, Thutmose's annals at Karnak indicate he took a total of only ten prisoners of war.[44] He may have simply fought the Mitannians to a stalemate,[43] yet he did receive tribute from the Hittites after that campaign, which seems to indicate the outcome of the battle was in Thutmose's favor.[40]\n\nThe next two campaigns are lost.[40] His eleventh is presumed to have happened in his 36th regnal year, and his twelfth is presumed to have happened in his 37th, since his thirteenth is mentioned at Karnak as happening in his 38th regnal year.[45] Part of the tribute list for his twelfth campaign remains immediately before his thirteenth begins, and the contents recorded (specifically wild game and certain minerals of uncertain identification) might indicate that it took place on the steppe around Nukhashashe, but this remains mere speculation.[46]\n\nIn his thirteenth campaign Thutmose returned to Nukhashashe for a very minor campaign.[45] The next year, his 39th year, he mounted his fourteenth campaign against the Shasu. The location of this campaign is impossible to determine definitely, since the Shasu were nomads who could have lived anywhere from Lebanon to the Transjordan to Edom.[47] After this point, the numbers given by Thutmose's scribes to his campaigns all fall in lacunae, so campaigns can only be counted by date. In his fortieth year, tribute was collected from foreign powers, but it is unknown if this was actually considered a campaign (i.e., if the king went with it or if it was lead by an official).[48] Only the tribute list remains from Thutmose's next campaign in the annals,[49] and nothing can be deduced about it, except that it was probably another raid to the frontiers around Niy.[50] His final Asian campaign is better documented, however. Sometime before Thutmose's 42nd year, Mitanni apparently began spreading revolt among all the major cities in Syria.[50] Thutmose moved his troops by land up the coastal road and put down rebellions in the Arka plain and moved on Tunip.[50] After taking Tunip, his attention turned to Kadesh again. He engaged and destroyed three surrounding Mitannian garrisons and returned to Egypt in victory.[51] However, his victory in this final campaign was neither complete nor permanent, since he did not take Kadesh,[51] and Tunip could not have remained aligned to him for very long, certainly not beyond his own death.[52]\n\nNubian Campaign\n\nThutmose took one last campaign in his 50th regnal year, very late in his life. He attacked Nubia, but only went as far as the fourth cataract of the Nile. Although no king of Egypt had ever penetrated as far as he did with an army, previous kings' campaigns had spread Egyptian culture that far already, and the earliest Egyptian document found at Gebel Barkal in fact comes from three years before Thutmose's campaign.[53]\n\nMonumental Construction\n\nThutmose III was a great builder pharaoh and constructed over 50 temples, although some of these are now lost and only mentioned in written records.[8] He also commissioned the building of many tombs for nobles, which were made with greater craftsmanship than ever before. His reign was also a period of great stylistic changes in the sculpture, paintings, and reliefs associated with his construction.\n\nArtistic developments\n\nThutmose's architects and artisans showed great continuity with the formal style of previous kings, but several developments set him apart from his predecessors. Although he followed the traditional relief styles for most of his reign, but after his 42nd year, he began having himself depicted wearing the red crown of Lower Egypt and a šndyt-kilt, an unprecedented style.[5] Architecturally, his use of pillars was also unprecedented. He built Egypt's only known set of heraldic pillars, two large columns standing alone instead of being part of a set supporting the roof.[54] His jubilee hall was also revolutionary, and is arguably the earliest known building created in the basilica style.[54] Thutmose's artisans achieved new heights of skill in painting, and tombs from his reign were the earliest to be entirely painted, instead of painted reliefs.[5] Finally, although not directly pertaining to his monuments, it appears that Thutmose's artisans finally had learned how to use the skill of glassmaking, developed in the early 18th dynasty, to create drinking vessels by the core-formed method.[55]\n\nKarnak\n\ntekhen waty, today standing in Rome since the time of Constantine II in 357. C.E. Thutmose III'stoday standing in Rome since the time of Constantine II in 357. C.E.\n\nThutmose dedicated far more attention to Karnak than any other site. In the Iput-isut, the temple proper in the center, he rebuilt the hypostyle hall of his grandfather Thutmose I, dismantled the red chapel of Hatshepsut and built Pylon VI and a shrine for the bark of Amun in its place, and built an antechamber in front of it, the ceiling of which was supported by his heraldic pillars.[54] He built a temenos wall around the central chapel containing smaller chapels, along with workshops and storerooms.[54] East of the main sanctuary, he built a jubilee hall in which to celebrate his Sed Festival. The main hall was built in basilica style, with rows of pillars supporting the ceiling on each side of the aisle.[54] The central two rows were higher than the others to create windows where the ceiling was split.[54] Two of the smaller rooms in this temple contained the reliefs of the survey of the plants and animals of Canaan which he took in his third campaign.[56]\n\nEast of the Iput-Isut, he erected another temple to Aten where he was depicted as being supported by Amun.[57] It was inside this temple that Thutmose planned on erecting his tekhen waty, (\"unique obelisk.\")[57] The tekhen waty was designed to stand alone, instead as part of a pair, and is the tallest obelisk ever successfully cut. It was not, however, erected until Thutmose IV raised it[57] 35 years later.[58] It was later moved to Rome and is known as the Lateran Obelisk.\n\nThutmose also undertook building projects to the south of the main temple, between the sanctuary of Amun and the temple of Mut.[57] Immediately to the south of the main temple, he built the seventh pylon on the north-south road which entered the temple between the fourth and fifth pylons.[57] It was built for use during his jubilee, and was covered with scenes of defeated enemies.[57] He set royal colossi on both sides of the pylon, and put two more obelisks on the south face in front of the gateway.[57] The eastern one's base remains in place, but the western one was transported to hippodrome in Constantinople.[57] further south alone the road, he put up pylon VIII which Hatshepsut had begun.[54] East of the road, he dug a sacred lake of 250 by 400 feet, and then placed another alabaster bark shrine near it.[54]\n\nStatuary\n\nLike earlier pharaohs, Thutmose III placed statues inside his temples to show his strength and to portray him as a devout pharaoh who worshipped the gods. Stylistically, many of his statues share many of the same features of his immediate predecessor, Hatshepsut, and the only statues with solid attributions to either pharaoh are those that were inscribed with the individual pharaoh's name. Statuary of both rulers often share the same almond-shaped eyes, arching browline, moderately aquiline nose and a gently curved mouth with a slight smile.[59] Systematic studies of the inscribed statues of these two pharaohs have been developed that provide a set of stylistic, iconographic, contextual and technical criteria necessary to identify uninscribed statues of these pharaohs with some degree of certainty.[60]\n\nThere are many examples of statues depicting Thutmose III kneeling down in an \"offering\" position, typically offering milk, wine, or some other food substance to a god. While examples of this style can be found with some of the earlier pharaohs of the New Kingdom, it is thought that the emphasis on this style marks a change in the increasingly public aspects of the Egyptian religion. These positions include the form called \"offering to an altar\" and show the pharaoh both in the kneeling and standing positions. Thutmose is shown in other statues offering geese and, possibly, oil[61]. The faces of the statues are idealized to portray both a traditional view of kings and the contemporary idea of beauty; this was apparent in statues of Hatshepsut, but is more obvious in statues of Thutmose III and his immediate descendants Amenhotep II, Thutmose IV and Amenhotep III. Another important development that relates to this form of statuary is that at least one instance of this type represents the first known royal statuette that was cast in bronze.[62]\n\nTomb image of Thutmosis III being suckled by the goddess Isis in the form of a tree.\n\nTomb\n\nThutmose's tomb, discovered by Victor Loret in 1898, was in the Valley of the Kings.It uses a plan which is typical of 18th dynasty tombs, with a sharp turn at the vestibule preceding the burial chamber. Two stairways and two corridors provide access to the vestibule which is preceded by a quadrangular shaft, or \"well.\" The vestibule is decorated with the full story of the Book of Amduat, the first tomb to do so in its entirety. The burial chamber, which is supported by two pillars, is oval shaped and its ceiling decorated with stars, symbolizing the cave of the god Sokar. In the middle lies a large red quartzite sarcophagus in the shape of a cartouche. On the two pillars in the middle of the chamber there are passages from the Litanies of Re, a text that celebrates the sun god, who is identified with the pharaoh. On the other pillar is a unique image depicting Thutmosis III being suckled by the goddess Isis in the guise of the tree.\n\nThutmose III's tomb in the Valley of the Kings (KV34) is the first one in which Egyptologists found the complete Amduat, an important New Kingdom funerary text. The wall decorations are done in a simple, \"diagrammatic\" way, imitating the manner of the cursive script one might expect to see on a funerary papyrus than the more typically lavish wall decorations seen on most other royal tomb walls. The coloring is similarly muted, executed in simple black figures and text on a cream background with highlights in red and pink. The decorations depict the pharaoh aiding the gods in defeating Apep, the serpent of chaos, thereby helping to ensure the sun's daily rebirth as well as the pharaoh's own resurrection.[63]\n\nDefacing of Hatshepsut's Monuments\n\nUntil recently, a general theory has been that after the death of her husband Thutmose II, Hatshepsut 'usurped' the throne from Thutmose III. Although Thutmose III was a co-regent during this time, early historians have speculated that Thutmose III never forgave his step-mother for denying him access to the throne for the first two decades of his reign.[64] However, this theory has in recent times been reviewed as questions arise why Hatshepsut would have allowed a resentful heir to control armies, which it is known he did. This view is further supported by the fact that no strong evidence has been found to show Thutmose III was actively seeking to reclaim his throne. Added to this is the fact that the monuments of Hatshepsut were not damaged until at least 20 years after her death in the reign of Thutmose III and possibly Amenhotep II.\n\nAfter her death, many of Hatshepsut's monuments and depictions were subsequently defaced or destroyed, including those in her famous mortuary temple complex at Deir el-Bahri. These have traditionally been interpreted to be evidence of acts of damnatio memoriae (condemning a person by erasing him or her from recorded existence) by Thutmose III. However, recent research by scholars such as that of Charles Nims and Peter Dorman have re-examined these erasures and found that the acts which could be dated started sometime during year 46 or 47 of Thutmose's reign.[65] Another often overlooked fact is that it was not only Hatshepsut who received this treatment, as the monuments of her chief steward Senenmut, who was closely associated with her rule, were similarly defaced where they were found.[66] All of this evidence casts serious doubt upon the popular theory that Thutmose III ordered their destruction in a fit of vengeful rage shortly after his accession. These days the purposeful destruction of the memory of Hatshepsut is seen as a measure designed to ensure the smooth succession of his son (the future Amenhotep II), as opposed to any of surviving relatives of Hatshepsut who may have had an equal or better claim to the throne. It may also be likely that this measure could not have been taken earlier until the passing of powerful officials who had served under both Hatshepsut and Thutmose III had occurred.[67]\n\nDeath and burial\n\nAccording to the American Egyptologist Peter Der Manuelian, a statement in the tomb biography of an official named Amenemheb establishes that Thutmose III died on Year 54, III Peret day 30 of his reign after ruling Egypt for 53 years, 10 months, and 26 days.(Urk. 180.15) Thutmose III, hence, died just one month and four days shy of the start of his 55th regnal year.[68]\n\nMummy\n\nMummified head of Thutmose III\n\nThutmose III's mummy was discovered in the Deir el-Bahri Cache above the Mortuary Temple of Hatshepsut in 1881. He was interred along with those of other 18th and 19th dynasty leaders Ahmose I, Amenhotep I, Thutmose I, Thutmose II, Ramesses I, Seti I, Ramesses II, and Ramesses IX, as well as the 21st dynasty pharaohs Pinedjem I, Pinedjem II, and Siamun.\n\nWhile it is popularly thought that his mummy was originally unwrapped by Gaston Maspero in 1886, it was in fact first unwrapped by Émile Brugsch, the Egyptologist who supervised the evacuation of the mummies from the Deir el-Bahri Cache five years previously in 1881, soon after its arrival in the Boulak Museum. This was done while Maspero was away in France, and the Director General of the Egyptian Antiquities Service ordered the mummy re-wrapped. So when it was \"officially\" unwrapped by Maspero in 1886, he almost certainly knew it was in relatively poor condition.[69]\n\nIt had been extensively damaged in antiquity by tomb robbers, and its wrappings subsequently cut into and torn by the Rassul family who had originally rediscovered the tomb and its contents only a few years before.[70] Maspero's description of the body provides an idea as to the magnitude of the damage done to the body:\n\nHis mummy was not securely hidden away, for towards the close of the 20th dynasty it was torn out of the coffin by robbers, who stripped it and rifled it of the jewels with which it was covered, injuring it in their haste to carry away the spoil. It was subsequently re-interred, and has remained undisturbed until the present day; but before re-burial some renovation of the wrappings was necessary, and as portions of the body had become loose, the restorers, in order to give the mummy the necessary firmness, compressed it between four oar-shaped slips of wood, painted white, and placed, three inside the wrappings and one outside, under the bands which confined the winding-sheet.[71]\n\nOf the face, which was undamaged, Maspero's says the following:\n\nHappily the face, which had been plastered over with pitch at the time of embalming, did not suffer at all from this rough treatment, and appeared intact when the protecting mask was removed. Its appearance does not answer to our ideal of the conqueror. His statues, though not representing him as a type of manly beauty, yet give him refined, intelligent features, but a comparison with the mummy shows that the artists have idealised their model. The forehead is abnormally low, the eyes deeply sunk, the jaw heavy, the lips thick, and the cheek-bones extremely prominent; the whole recalling the physiognomy of Thûtmosis II, though with a greater show of energy.[71]\n\nMaspero was so disheartened at the state of the mummy, and the prospect that all of the other mummies were similarly damaged (as it turned out, few were in as poor a state), that he would not unwrap another for several years.[72]\n\nUnlike many other examples from the Deir el-Bahri Cache, the wooden mummiform coffin that contained the body was original to the pharaoh, though any gilding or decoration it might have had had been hacked off in antiquity.\n\nIn his examination of the mummy, the anatomist G. Elliot Smith stated the height of Thutmose III's mummy to be 1.615m (5ft. 3.58in.).[73] This has led people to believe that Thutmose was a short man, but Smith measured the height of a body whose feet were absent, so he was undoubtedly taller than the figure given by Smith.[74] The mummy of Thutmose III now resides in the Royal Mummies Hall of the Cairo Museum, catalog number 61068.\n\nLegacy\n\nThutmose III's name lives on in the monuments and architectural legacy, which have survived into modern times. His military feat in extending the Egyptian Empire helped to ensure the longevity of that ancient civilization. His reconquest of Syria and Nubia mark him as one of the most successful of Egypt's rulers. His defaming of Hatshesut after her death, though, may be a blemish on his record although he is generally considered to have been a fair ruler.\n\nSee also\n\nNotes\n\n\n\n\n\nReferences and further reading\n\nBeckerath, Jurgen Von, and Edward F Wente. 1998. \"Chronologie Des Agyptischen Neuen Reiches.\" Journal of Near Chronologie des Pharaonischen Ägypten ISSN 0022-2968.\n\nISSN 0022-2968. Bedford, Donald B., The Wars in Syria and Palestine of Thutmose III. (Culture and History of the Ancient Near East 16) Leiden: Brill, 2003. ISBN 9004129898, treats the military annals of Thutmose III, with regard to his conquests in the Levant\n\n(Culture and History of the Ancient Near East 16) Leiden: Brill, 2003. ISBN 9004129898, treats the military annals of Thutmose III, with regard to his conquests in the Levant Breasted, James Henry. Ancient Times: A History of the Early World; An Introduction to the Study of Ancient History and the Career of Early Man. (Outlines of European History, 1). Boston: Ginn and Company, 1914.\n\n(Outlines of European History, 1). Boston: Ginn and Company, 1914. __________. Ancient Records of Egypt. Volume Two, The Eighteenth Dynasty. Urbana, IL: University of Illinois Press, 2001 ISBN 0252069749\n\nUrbana, IL: University of Illinois Press, 2001 ISBN 0252069749 Breasted, James Henry. Ancient Records of Egypt, Vol. II. Chicago: University of Chicago Press, 1906\n\nChicago: University of Chicago Press, 1906 Campbell, Edward Fay, Jr. The Chronology of the Amarna Letters with Special Reference to the Hypothetical Coregency of Amenophis III and Akhenaten. Baltimore: The Johns Hopkins Press, 1964.\n\nBaltimore: The Johns Hopkins Press, 1964. Cline, Eric H., and David O'Connor. Thutmose III: A New Biography. Ann Arbor, MI: University of Michigan Press, 2006. ISBN 0472114670. incorporates a number of important new survey articles regarding the reign of Thutmose III, including administration, art, religion and foreign affairs\n\nAnn Arbor, MI: University of Michigan Press, 2006. ISBN 0472114670. incorporates a number of important new survey articles regarding the reign of Thutmose III, including administration, art, religion and foreign affairs Der Manuelian, Peter. Studies in the Reign of Amenophis II. Hildesheimer Ägyptologische Beiträge (HÄB) Verlag: 1987.\n\nHildesheimer Ägyptologische Beiträge (HÄB) Verlag: 1987. Dodson, Aidan, and Dyan Hilton. The Complete Royal Families of Ancient Egypt. Thames and Hudson, 2004. ISBN 0500051283.\n\nThames and Hudson, 2004. ISBN 0500051283. Forbes, Dennis C. Tombs, Treasures, Mummies: Seven Great Discoveries of Egyptian Archaeology. Sebastopol, CA: KMT Communications, Inc., 1998.\n\nSebastopol, CA: KMT Communications, Inc., 1998. Gardiner, Alan. Egypt of the Pharaohs. Oxford University Press, 1964.\n\nOxford University Press, 1964. Grimal, Nicolas. A History of Ancient Egypt. (original Librairie Arthéme Fayard, 1988) reprint. Oxford: Blackwell, 1992. ISBN 9780631174721.\n\n(original Librairie Arthéme Fayard, 1988) reprint. Oxford: Blackwell, 1992. ISBN 9780631174721. Honey, W. B., \"Review of Glass Vessels before Glass-Blowing by Poul Fossing.\" The Burlington Magazine for Connoisseurs (Apr. 1941): 135.\n\n(Apr. 1941): 135. Lipińska, Jagwida, \"Thutmose III,\" 403. The Oxford Encyclopedia of Ancient Egypt, Ed. Donald Redford. Vol. 3. New York: Oxford University Press, 2001. ISBN 9780195102345.\n\nEd. Donald Redford. Vol. 3. New York: Oxford University Press, 2001. ISBN 9780195102345. Maspero, Gaston. History Of Egypt, Chaldaea, Syria, Babylonia, and Assyria, Volume 5. (of 12), [2]. Project Gutenberg .\n\n(of 12), [2]. . Murnane, William J. Ancient Egyptian Coregencies. The Oriental Institute of the University of Chicago, 1977.\n\nThe Oriental Institute of the University of Chicago, 1977. Redford, Donald B., \"The Chronology of the Eighteenth Dynasty.\" Journal of Near Eastern Studies 25 (2) (1966): 119.\n\n25 (2) (1966): 119. __________. Egypt, Canaan, and Israel in Ancient Times. Princeton Univ Press, 1992. ISBN 9780691036069.\n\nPrinceton Univ Press, 1992. ISBN 9780691036069. __________. The Wars in Syria and Palestine of Thutmose III. Boston: Koninklijke Brill, 2003. ISBN 9789004129894.\n\nBoston: Koninklijke Brill, 2003. ISBN 9789004129894. Reisinger, Magnus. Entwicklung der ägyptischen Königsplastik in der frühen und hohen 18. Dynastie. Münster: Agnus-Verlag, 2005. ISBN 3000158642.\n\nMünster: Agnus-Verlag, 2005. ISBN 3000158642. Russman, Edna R., ed. Etermal Egypt: Masterworks of Ancient Art from the British Museum. Berkeley, CA: University of California Press, 2001. ISBN 1885444192.\n\nBerkeley, CA: University of California Press, 2001. ISBN 1885444192. Shaw, Ian. The Oxford History of Ancient Egypt. New York: Oxford University Press, 2000. ISBN 0192804588.\n\nNew York: Oxford University Press, 2000. ISBN 0192804588. Shaw, Ian, and Paul Nicholson. The Dictionary of Ancient Egypt. New York: Harry N. Abrams, Inc., 1995. ISBN 0810990962.\n\nNew York: Harry N. Abrams, Inc., 1995. ISBN 0810990962. Smith, G. Elliot. The Royal Mummies. (original 1912)(Duckworth Egyptology Series) (reprint Gerald Duckworth Ltd, 2000. ISBN 9780715629598.\n\n(original 1912)(Duckworth Egyptology Series) (reprint Gerald Duckworth Ltd, 2000. ISBN 9780715629598. Steindorff, George, and Keith Seele. When Egypt Ruled the East. University of Chicago, 1942.\n\nUniversity of Chicago, 1942. Tyldesley, Joyce. Hatchepsut: The Female Pharaoh. New York: Viking, 1996. ISBN 9780670859764.\n\nAll links retrieved March 12, 2020.\n\nJimmy Dunn, Thutmosis III touregypt.net."}, {"url": "https://www.nationalgeographic.com/culture/article/thutmose-iii", "page_content": "Thutmose III (unknown-ca 1426 B.C.) wasted no time making a name for himself, once he was out from under the shadow of the over-reaching regent-turned-pharaoh Hatshepsut. He transformed Egypt from an inward-looking kingdom into a triumphant, conquering nation. And he established a reputation as a brilliant military strategist, one whom later historians would call the “Napoleon of Egypt.”\n\nJust a few months after coming to power, Thutmose III marched with an army of 20,000 soldiers to Megiddo, in modern-day northern Israel—a site better known by its Greek name, Armageddon. A coalition of opponents had gathered there, outside the city. Scribes traveled with Thutmose III’s forces and recorded the campaign’s details, an invaluable chronicle now known as the Annals of Thutmose III.\n\n5:58\n\nThe pharaoh defied his advisers and surprised his foes by surging through a treacherous mountain pass to mount a deadly direct attack on Megiddo. He rode up front during that perilous advance to show that he trusted in the gods to protect him and his troops, and indeed, all made it through the pass unscathed. Then he entered battle at Megiddo “on a chariot of fine gold, decked in his shining armor,” dazzling and intimidating his opponents, who soon gave up the fight and retreated to their last bastion of safety within the city walls. Thutmose III laid siege to Megiddo for seven months, mercilessly starving out its remaining inhabitants until they surrendered.\n\nThutmose III flexed his military might repeatedly: in Nubia, in Phoenician ports, in the valuable trade center of Kadesh, and in the kingdom of Mitanni, in modern-day Syria and Turkey. Over the course of 17 campaigns, he secured more territory than any other pharaoh. By the end, he controlled Egypt’s largest ever empire. (Learn more about King Tut and his time as pharoah.)\n\nPlease be respectful of copyright. Unauthorized use is prohibited.\n\nThe spoils from Thutmose III’s military campaigns—including plunder, taxes, and tribute—vastly enriched Egypt’s treasury and made him the richest man in the world at the time. But he also secured human capital from his captured lands. The sons of conquered rulers were taken to Egypt and educated at court. Acclimated to Egyptian ways, those offspring returned home sympathetic to Egyptian rule.\n\nUnlike one of his later successors, Ramses II—who exaggerated his military achievements—Thutmose III earned the triumphs recorded on the numerous monuments he built. His annals were inscribed on the sanctuary walls at the great Temple of Amun at Karnak. The Festival Hall there depicts the fauna and flora—including 275 plants—he collected on his Asian campaigns. He installed obelisks at Karnak and built the sun god temple at Heliopolis. And by destroying—albeit incompletely—references to Hatshepsut and her reign, Thutmose III fashioned a direct line to his eponymous predecessors, strengthening his claim and his legacy as the rightful and most powerful ruler of Egypt.\n\nThis text is an excerpt from the National Geographic special issue The Most Influential Figures of Ancient History."}, {"url": "https://www.worldhistory.org/Thutmose_III/", "page_content": "Thutmose III (also known as Tuthmosis III, r. 1458-1425 BCE) was the 6th king of Egypt's 18th Dynasty, one of the greatest military leaders in antiquity, and among the most effective and impressive monarchs in Egypt's history. His throne name, Thutmose, means 'Thoth is Born', while his birth name, Menkhperre, means 'Eternal are the Manifestations of Ra'.\n\nBoth of these throne names reference important deities of ancient Egypt Thoth, the god of writing and wisdom, and Ra, the supreme god of the sun. Thutmose III was the son of Thutmose II and a lesser wife named Iset. Thutmose II (r. 1492-1479 BCE) was married to Queen Hatshepsut (r. 1479-1458 BCE), royal daughter of Thutmose I (r. 1520-1492 BCE) and a powerful woman who held the position of God's Wife of Amun.\n\nRemove Ads Advertisement\n\nWhen Thutmose II died, Hatshepsut became regent of Egypt since Thutmose III was too young to rule. She was supposed to maintain this position but, instead, declared herself pharaoh and ruled independently. Thutmose III, when he came of age and proved himself able, was given command of the armed forces by his step-mother; a choice she would not regret as he proved himself an exceptional military strategist and charismatic leader. He is often referred to in the present day as 'the Napoleon of Egypt', but unlike Napoleon, Thutmose III never lost a single engagement, expanded and maintained his empire, and was worshiped by his people for centuries after his death.\n\nYouth Under Hatshepsut & Rise to Power\n\nThutmose III was born c. 1481 BCE and was only three years old when his father died and Hatshepsut was made regent and then reigning monarch. He grew up at the royal court of Thebes, capital of Egypt throughout most of the period of the New Kingdom (c. 1570 - c. 1069 BCE). Although there is little documentation of his life during this time, a great emphasis was placed on the physical and intellectual development of princes during the New Kingdom of Egypt as they were expected to one day rule over an expanding empire.\n\nRemove Ads Advertisement\n\nThutmose III, therefore, would have spent a great deal of time in school, at athletics, and learning about military tactics and strategies. He probably went along on the early campaigns Hatshepsut commissioned as this was a common practice among New Kingdom pharaohs to acquaint their successors with warfare at an early age. During this time, Thutmose III developed skills in archery, horsemanship, hand-to-hand combat, and athletic ability. There is no doubt that military training was his priority but his education went far beyond battle tactics and the use of weapons; his later reign makes clear he was a highly cultured and sophisticated man who was aware of the value of cultures beyond Egypt's borders, recognized the importance of art and music, and had a great respect for human life.\n\nStatue of King Thutmose III Osama Shukir Muhammed Amin (Copyright)\n\nWhile he was growing up, his step-mother was reigning over one of the most prosperous periods in Egypt's history. After the initial campaigns to secure her position, there were no others throughout Hatshepsut's reign and the army was only deployed in small troops to protect trade expeditions and to maintain the borders. Hatshepsut did not allow her military to stand idle, however, or weaken as evidenced by how quickly Thutmose III was able to mobilize and lead the armies once he came to power.\n\nLove History? Sign up for our free weekly email newsletter!\n\nHatshepsut may have married her daughter Neferu-Ra to Thutmose III in order to secure succession but it does not seem, after his youth, that he spent much time at court. Orientalist James Henry Breasted has suggested he would have probably lived among the soldiers from a fairly early age in order to stay out of Hatshepsut's way and prove himself useful to her reign. It was common enough for noble princes to be removed at the discretion of a reigning monarch who perceived them as a threat and Thutmose III shows too great an ambition to have made himself so vulnerable.\n\nThat he succeeded in his plans is evidenced by the fact that, before the end of her reign, Hatshepsut had placed him in command of her armies. Her reign ended with her death in 1458 BCE, and Thutmose III came to the throne. Hatshepsut had maintained a tight control of Egypt's borders and provinces, but with her death, the kings of Egyptian-controlled states in Canaan and Syria rebelled. Thutmose III was not interested in negotiation and certainly was not going to let these provinces simply leave the empire, and so he set out on his first military campaign.\n\nMilitary Campaigns\n\nIn his time as pharaoh, Thutmose III would lead 17 successful military campaigns in 20 years. He ordered the details of his victories to be inscribed at the Temple of Amun at Karnak and they are considered the most extensive records of ancient Egyptian military campaigns extant. His first is his most famous – The Battle of Megiddo – and is the one described in the most exacting narrative. His later campaigns lose this form and are given with less detail, appearing more as lists of spoils than narratives of the king's victories.\n\nRemove Ads Advertisement\n\nIn his time as pharaoh, Thutmose III would lead 17 successful military campaigns in 20 years.\n\nThe reason for the decline in narrative form is not clear, but the claim of some scholars that it indicates a stronger cohesion of the state in which pragmatic lists of goods superseded narratives of a pharaoh's victory is untenable; there are a number of such narratives in the centuries following Thutmose III's reign, most notably that of Ramesses II (r. 1279-1213 BCE) concerning Kadesh and Ramesses III (r. 1186-1155 BCE) regarding his victory over the Sea Peoples. The most reasonable explanation for the brevity of the later inscriptions is simply that the writer of the Megiddo narrative died.\n\nThe story of the Battle of Megiddo was written by Thutmose III's private secretary, military scribe, and general Tjaneni (also given as Thanuny, c. 1455 BCE) who was with him throughout the event. Tjaneni kept a journal on a leather scroll (later deposited for posterity at the Temple of Amun in Thebes) which Thutmose III so admired he ordered the narrative inscribed on the walls of the temple as well as those of others throughout Egypt.\n\nTjaneni provides a detailed description of Thutmose III as a commander-in-chief fully aware of his abilities and those of his troops and completely confident of victory. In the most famous passage of the account, the pharaoh calls a conference with his senior staff to discuss marching orders to Megiddo and tells them they will be taking the narrow road from Aruna, on which the army will have to march single-file, rather than either of the wider and more easily travelled roads which were available.\n\nRemove Ads Advertisement\n\nThe generals object to this, arguing that they have intelligence the enemy is waiting for them at the pass to the plains of Megiddo from the Aruna road and their rearguard will still be marching while the vanguard is engaged with the enemy. Thutmose III hears their counsel but disagrees, telling them that they may take whatever road they choose but he will be leading his army along the Aruna road and will be leading from the front. The generals then agree to follow wherever he chooses to take them.\n\nHis decision on the Aruna road was characteristic of Thutmose III's resolve to pursue a course he considered best regardless of the difficulties. The armies would have had an easier time on the other roads – especially considering that, on the Aruna path, they had to dismantle and carry the chariots and supply wagons – but it would have cost the army the element of surprise which Thutmose III recognized as imperative.\n\nTemple of Karnak, Wars of Thutmose III Michael Lusk (CC BY-NC-SA)\n\nAs it turned out, the enemy was not waiting at the end of the Aruna road but on the two easier paths which they expected Thutmose III to take at the head of so large an army. No one expected him to lead his forces along what was essentially a cattle path. After giving his army a night to rest and refresh themselves, he ordered the attack the next morning, leading from the front, and drove his opponents from the field. The report then details how his army, delighted at the victory, gathered treasures from the fallen instead of pursuing survivors and taking the city. This cost Thutmose III complete victory on the field that day because it gave the people of Megiddo time to prepare their defenses.\n\nRemove Ads Advertisement\n\nEven so, Thutmose III marched on the city, surrounded it with a moat and a stockade, and lay siege to it for seven or eight months until it surrendered. He offered very generous terms to the people – none of the surviving ringleaders of the revolt were executed – which essentially came down to a promise not to incite rebellion in the future. He then turned his army around and marched back home with his enormous loot from the campaign, pausing only to harvest the crops of the defeated and bring them back to Egypt.\n\nAt Megiddo, he also initiated a policy he would adhere to throughout all his campaigns of bringing the noble children of the defeated kings back to Egypt to be educated as Egyptians. These children were held as hostages to guarantee the good behavior of their parents but were treated with all the respect due to royalty, housed in the palace, and given many freedoms. When they came of age, they were allowed to return home where, since they had now spent their youth in Egypt, they supported and encouraged Egyptian culture and the state's interests when they were elevated to positions of power.\n\nThutmose III's victory at Megiddo gave him control of northern Canaan from which he would launch his campaign into Syria to take Kadesh. He campaigned against the Mitanni and erected a stele at the Euphrates River, commemorated in his inscription at Karnak, known as Thutmose III's Hymn of Victory. His Nubian campaigns were equally successful, and by his 50th year, he had expanded Egypt's holdings beyond any of his predecessors and made the country wealthier than it had been since the beginning of the 4th Dynasty of the Old Kingdom of Egypt (c. 2613- 2181 BCE).\n\nPatron of the Arts\n\nHis reign was not only focused on military conquest, however, as his patronage of the arts shows. Thutmose III commissioned upwards of 50 temples, numerous tombs, monuments, and contributed more significantly to the Temple of Amun at Karnak than any other pharaoh. His renovations and additions to the Karnak temple, in fact, are among the most significant in that they preserve the names of past kings (whose monuments he would sometimes remove in his renovations) and provide narratives of his own campaigns and initiatives which have proven to be extremely important to scholars in the study of the culture.\n\nTemple of Amun, Karnak Dennis Jarvis (CC BY-SA)\n\nArtistic techniques and experimentation reached new heights under Thutmose III. Glass-making had been known for centuries but was now perfected to the point where drinking vessels could be made of glass. Statuary was less idealized and more realistic – a trend begun in the Middle Kingdom of Egypt (2040-1782 BCE) – but abandoned in favor of the traditional idealism in art established during the Old Kingdom. Thutmose III is depicted in his statuary as a tall, handsome man in excellent physical condition and this is considered a realistic portrayal in that, first, all depictions are uniform and, second, depictions of others – also consistent – are far from flattering.\n\nHis artisans produced some of the finest work in Egypt's history including elaborate tombs decorated with intricate paintings and freestanding columns as well as contributing enormous pylons to Karnak. In keeping with Egypt's respect for and love of nature, he encouraged public parks and gardens, created lakes and ponds for the people's recreation and enjoyment, and had a private garden cultivated both around his palace and at Karnak temple.\n\nDefacement of Hatshepsut's Monuments\n\nHis artistic sensibilities and respect for others are at odds with a policy almost universally ascribed to him: the desecration of Hatshepsut's monuments and the attempt to erase her name from history. Scholars are divided on when this happened in his reign but it was certainly not in the early years. Whenever it transpired, the name and images of Hatshepsut were removed from all public monuments as well as the exterior and some of the interior work at her mortuary temple at Deir el-Bahri.\n\nTo remove a person's name was to condemn them to non-existence; one needed to be remembered in order to continue one's eternal journey in the afterlife. Further, it was thought that the deceased needed daily sustenance in the form of food and drink offerings delivered to their tombs, where their body was preserved through mummification and statues representing them enabled their soul to visit and partake of these offerings. The so-called Execration Texts of ancient Egypt make clear that the removal of one's name was only justified if that person had committed some serious offense, but there is no evidence of Hatshepsut being involved with any such crimes.\n\nTemple of Hatshepsut, Aerial View N/A (CC BY)\n\nMost likely, Thutmose III ordered this action to prevent Hatshepsut from standing as a role model for future women who might aspire to rule. The position of the monarch of Egypt was traditionally occupied by males and, by assuming power for herself, Hatshepsut had departed from this practice. The first king of Egypt was thought to have been the god Osiris who was murdered by his brother Set and brought back to life by his sister-wife Isis. He was finally succeeded by his son Horus who defeated Set, took back the throne, and re-established order in the land. Kings associated themselves with Horus during their reign and with Osiris, who became Lord of the Dead, in the afterlife; there was no place in this narrative for a woman to hold supreme power.\n\nThe central cultural value of ancient Egypt was ma'at (harmony and balance) and this relied largely on an adherence to tradition. Ancient Egyptians are often characterized as conservative for this reason: departure from tradition could result in a loss of stability – balance – and the return of primordial chaos. It was the duty of the pharaoh to maintain ma'at and this is probably the motivation behind Thutmose III's eradication of Hatshepsut's name.\n\nHe backdated his reign to remove all evidence of her ever having ruled Egypt and replaced some of her images in her mortuary temple with his own. All of her public monuments were torn down – especially those at Karnak – and replaced by his, though, at other sites, only her name was removed. So thorough was this erasure of his predecessor that Hatshepsut's name was unknown in Egypt's history until the 19th century CE. Later kings of Egypt thought the beautiful Temple of Hatshepsut at Deir el-Bahri was built by Thutmose III, and many of them would claim her impressive monuments as their own.\n\nThutmose III essentially created the Egyptian empire single-handedly.\n\nIt has been suggested that Thutmose III had nothing to do with these actions and that they were perpetrated by his son and successor Amenhotep II (r. 1425-1400 BCE) either in the latter part of Thutmose III's reign or the beginning of his own. Although this is possible, it does not seem probable in that, by the time of Amenhotep II, Thutmose III had already ordered Hatshepsut's works at Karnak removed and replaced by his own. Further, the image and name of Hatshepsut was left intact within the interior of her mortuary temple.\n\nIf Amenhotep II, who never knew Hatshepsut, was trying to erase her from history, it is unlikely he would have spared her memory anywhere. Leaving her name and image intact, but out of the public eye, suggests that Thutmose III was only interested in maintaining the tradition of a male pharaoh in Egypt's history but did not wish his step-mother any ill will.\n\nWhen he died, of natural causes, in c. 1425 BCE, he was buried in his own mortuary temple beside that of Hatshepsut at Deir el-Bahri. Even though he had basically claimed her temple as his own, he still would not have had his eternal resting place located so close to hers if he had sincerely believed she deserved to be sentenced to non-existence.\n\nConclusion\n\nThe unfortunate result of this action is that, ever since the rediscovery of Hatshepsut, Thutmose III is as often referenced for her eradication as he is for his many accomplishments and magnificent reign. Thutmose III essentially created the Egyptian empire single-handedly. He elevated Egypt's status as a powerful and prosperous nation, employed the people in monumental building projects, and epitomized the ideal of the valiant Egyptian warrior-king who led his forces to successive victories.\n\nThutmose III's consideration for his enemies in defeat and gentle treatment of them made him respected far beyond the boundaries of his country. He established an empire stretching from the Euphrates River in Mesopotamia, through Syria and the Levant, down through Nubia to the Fifth Cataract of the Nile.\n\nAlthough there is little doubt that the people of these lands would have preferred their independence, they prospered under his reign through the peace he established and maintained through his military and diplomatic skills. In every respect, Thutmose III represented the ideal pharaoh to his people and his memory has endured to the present day as one of the greatest kings of ancient Egypt."}, {"url": "https://www.worldhistoryedu.com/thutmose-iii-history-military-campaigns-greatest-achievements/", "page_content": "Thutmose III, one of ancient Egypt’s greatest rulers, was the 6th pharaoh of the Eighteenth Dynasty. His reign, which spanned from around 1479 to 1425 BC, was one marked by his unrelenting thirst for dominance and power. Arguably Egypt’s greatest warrior king, Thutmose III built upon the laurels and works of predecessors like his stepmother Hatshepsut and his father Thutmose II.\n\nWith a total of 17 military campaigns, this powerful king was able to stretch the boundaries of Egypt, turning Egypt into the most dominant power in the region. It is generally accepted among Egyptologists and scholars alike that Egypt reached its pinnacle during the reign of Thutmose III. What were some of his most famous military campaigns? And how did Thutmose III bring the mighty Mitannians to submission?\n\nBelow, World History Edu explores the life, family tree, military campaigns, and major achievements of ancient Egyptian pharaoh Thutmose III.\n\nQuick facts about Thutmose III\n\nBirth: c. 1481 BC\n\nDied: c. 1425 BC\n\nAged: 56\n\nBurial place: Valley of the Kings, Luxor, Egypt\n\nReligion: Ancient Egyptian religion\n\nFather: Thutmose II\n\nMother: Iset\n\nSiblings: Neferure\n\nSpouses: Satiah, Nebtu, Menwi, Menhet, Merti, Nebsemi\n\nChief consort: Merytre-Hatshepsut\n\nChildren: Menkheperre, Nebetiunet, Merytamun C, Merytamun D, Iset, Siamun, Nefertiri, Amenemhat, Amenhotep II\n\nReign: 1479-1425 BC\n\nDynasty: 18th\n\nPredecessor: Queen Hatshepsut\n\nSuccessor: Amenhotep II\n\nEpithets: “Lasting is the Manifestation of Ra”, “The Lasting One of the Manifestation of Ra”\n\nOther names: Thutmosis (“Born of Thoth” or “Thoth is born”)\n\nMost known for: Steering ancient Egypt to its zenith ever\n\nConquests: northern Syria, parts of Nubia, Palestine, Niya Kingdom\n\nBirth and early life\n\nSon of Egyptian ruler Thutmose II and Queen Iset, Thutmose III was born around 1481 BC. Following the death of his father in 1479 BC, he was the most eligible person to rise to throne. However, he was only just child at the time. Hence his stepmother Queen Hatshepsut ruled on his behalf as regent of Egypt.\n\nGrowing up, the young boy-king received the best of education befitting of an Egyptian monarch. Thutmose III also received training in military tactics, horse and chariot riding, archery, and among others. Right from an early age, he had a knack for horsemanship, as he was very well built and a good marksman.\n\nNames and epithets\n\nAs it was common for ancient Egyptian kings and queens, Thutmose III went by a number of names and epithets. His two main names were associated with major Egyptian gods Ra and Thoth. For example his name Tuthmosis or Thutmose evokes the meaning of “Thoth is born” or “Born of Thoth”. The god Thoth was the Egyptian deity of the moon, time, and wisdom.’\n\nThutmose III’s other name mn-ḫpr-rˁ ḏḥwty-ms means “Lasting is the Manifestation of Ra” or “The Lasting One of the Manifestation of Ra”. Egyptians believed that the sun god Ra, also known as the chief of the Egyptian pantheon, steered his sun barge through the sky bringing sunlight to land.\n\nThutmose II – Thutmose III’s father\n\nThutmose II was the father of Thutmose III. Born to Pharaoh Thutmose I and Queen Mutnofret, Thutmose II was the fourth pharaoh of the 18th Dynasty of Egypt. His reign is said to have started in 1493 and ended upon his death in 1479. During his reign he achieved a number of things, including quelling revolts in the Levant and Nubia.\n\nIn addition to Iset, Thutmose III’s mother, Thutmose II had a number of consorts. Upon his death in 1479, Thutmose II’s chief consort Queen Hatshepsut succeeded him to the throne.\n\nQueen Iset – Thutmose III’s mother\n\nWith Hatshepsut taking the role as the Great Royal Wife of Thutmose II, Queen Iset was the secondary wife of Thutmose II. Iset’s name was derived from the name of the ancient Egyptian mother goddess Isis. In some ancient texts and inscriptions, Iset is referred to as the chief consort of Thutmose II. Thutmose III’s mother’s name appears on his mummy wrappings as well as a statue of the king in the Karnak Temple Complex. Upon her son’s coronation as the sole ruler of Egypt in 1458 BC (i.e. after the death of Queen Hatshepsut), Iset received the epithet “King’s Mother”.\n\nA number of Iset’s images and depictions can be found in the tomb of Thutmose III at the Valley of the Kings. Many of those depictions see her revered as the manifestation of the Egyptian goddess Isis. In one depiction, she can be seen standing behind Thutmose III on a boat.\n\nQueen Hatshepsut’s regency, co-regency and ultimate rule\n\nFollowing the death of Thutmose II around 1479 BC, the Great Royal Wife Hatshepsut became regent Thutmose II’s only son Thutmose III, who was too young to reign as king. Even long before the death of Thutmose II, Hatshepsut’s power in the kingdom was quite immense, with some describing her as the real power behind Thutmose II’s reign. Thutmose II, a lesser son of Thutmose I, had to marry Hatshepsut in order to consolidate his power.\n\nAbout seven years into her regency, Hatshepsut will go from regent of Egypt to co-ruler of the kingdom until her death in 1458 BC. She thus co-ruled with her stepson Thutmose III. Upon her death, Thutmose III became the sole ruler of Egypt.\n\nHatshepsut assigned herself full titles of a pharaoh. She donned clothes similar to the ones Egyptian pharaohs wore. Bent on dominating the affairs of land of Egypt, she also assumed the insignia of the Egyptian pharaoh. Effectively ruling as pharaoh from c. 1479 to 1458 BC, Hatshepsut, who was also known as “Foremost of Noble Ladies”, steered Egypt to great heights.\n\nRead More: 10 Greatest Accomplishments of Queen Hatshepsut\n\nThutmose III and Hatshepsut\n\nUpon attaining the age of maturity, Queen Hatshepsut appointed Thutmose III as the commander of her army. Egyptologists note that Thutmose III served as the co-ruler of Egypt throughout the reign of Hatshepsut. There was hardly any grudge between the two as they worked in tandem. Both rulers had royal names and insignia.\n\nAs a matter of fact their different leadership traits complemented perfectly. Some scholars have noted that the co-rulership of Hatshepsut and Thutmose III proved extremely beneficial for the latter’s sole reign over Egypt.\n\nMajor achievements of Thutmose III\n\nLike many 18th Dynasty pharaohs of ancient Egypt, Thutmose III benefited a lot from the technology transferred to Egypt during the reign of Hyksos rulers [Fifteenth Dynasty (c. 1650-1550 BC)]. Armed with military innovations like the horse and chariot, the sickle sword and the composite bow, Thutmose III embarked on many military campaigns and conquests. By so doing, he was able to wield tremendous influence in the region, from southern Syria and Canaan to the east to Nubia to the south. Ancient Egypt was truly a superpower during the reign of Pharaoh Thutmose III.\n\nDuring his reign from 1479 BC to 1425 BC, Thutmose III was able to accomplish a lot of outstanding things. Some of his major accomplishments are as follows:\n\nAncient Egypt’s Napoleon\n\nEgyptologists often opine that there was hardly any ancient Egyptian ruler that could rival the expansionist ambitions of Thutmose III. It’s been estimated that he spent more than twenty years of his thirty-year reign as Egypt’s sole ruler campaigning in foreign lands. It is for this reason some historians like to refer to him as ancient Egypt’s Napoleon.\n\nThutmose III embarked upon a total of 17 campaigns in foreign territories, capturing several hundreds of cities in the process. By the time he was through, he had expanded Egypt’s influence and dominion to places as far as the Near East, Nubia in the south, and the Euphrates.\n\nAn astute commander of Egypt’s army\n\nAs co-ruler and commander of Egypt’s army, Thutmose III prepared himself adequately to reassert Egypt’s influence in northern Syria, Nubia and Palestine. For many years since his grandfather Thutmose I’s conquest of those regions, Egypt’s hold over those regions had gradually faded. During his father Thutmose II’s reign, the tributes that Egypt received from those foreign rulers steadily fell.\n\nAnd the fact that Egypt was left with a boy-king following the death of Thutmose II in some way emboldened those foreign Syrian princes to rebel against Egypt’s influence in the region. The task of bringing those regions back under Egypt’s control fell squarely on Thutmose III. Realizing this, co-ruler Queen Hatshepsut was right in naming her stepson and co-ruler Thutmose III the commander-in-chief of Egypt’s army.\n\nBy his mid-20s, he had grown into a fine warrior, knowledgeable in many military tactics and skilled at weapon handling. Thutmose was ready to begin his military campaigns in Syria and other surrounding regions in Mesopotamia.\n\nThutmose III led what was possible the mightiest and largest Egyptian army ever\n\nThutmose III’s early introduction into the army proved extremely useful for him going forward. Steadily he went on to build a very large army that instilled a lot fear in Egypt’s foreign enemies. Historians and Egyptologists like to believe that Thutmose’s reign saw the Egyptian army reach its peak, boasting of the largest army in ancient Egypt’s history.\n\nMarched his army to capture Megiddo\n\nIn what is widely recognized as Thutmose III’s first campaign, the young Egyptian ruler led his army to halt the growing power of the king of Kadesh. Thutmose’s army went through Jamnia before arriving at Megiddo.\n\nBefore facing off the king of Kadesh in the Battle of Megiddo, Thutmose is said to have made a very brave decision of taking the most challenging route to the battle ground. Contrary to the advice of his war counsel, the Egyptian king chose to take the riskiest path through a narrow mountain pass in the Wadi Ara (present-day in Israel). The path allowed Thutmose and his army to strategically place themselves between the rear side of the enemy forces and Megiddo. The battle, which was the biggest of all the 17 campaigns of Thutmose III, ended in a resounding victory for Thutmose. The Pharaoh laid siege to the city for about eight months before bringing Megiddo to its knees. As the troops made their way back to Egypt, they helped themselves to plundering much of the resources of Megiddo.\n\nWielded control over all of Canaan and large parts of Syria\n\nThe capture of Megiddo meant that Thutmose III had placed himself in firm control of all of Canaan and many other parts of Syria. In order to maintain that firm control of those places he ordered the payment of large annual tributes to Egypt. Those foreign lands were also required to send their princes and heirs to Egypt where they were Egyptionalized so to speak. By so doing, Egypt was able to secure strong loyalty from those princes once they turned to rulers of their respective cities.\n\nConquered Kadesh and other cities in Al-Biqa valley\n\nFurthermore, Thutmose conquered many ports on the Phoenician coast, allowing him to gain greater control of Syria. After plundering the town of Ardata, he turned the place into an important strategic base for Egypt. In his sixth campaign, the Egyptian king proceeded to take and pillage many Kadesh territories. As part of his effort to prevent those conquered territories from rebelling, he sometimes plundered a lot of their resources, thereby leaving them impoverished with no ability to mount a rebellion.\n\nBrought the state of Mitanni under Egypt’s control\n\nBeginning around the end of Thutmose III’s grandfather’s reign, Thutmose I, the rulers of Mitanni, a Mesopotamian kingdom, had started to grow in power and influence in the region. Thutmose III was bent on clipping Mitanni’s rise. In his 33rd year, he led his army on an eight campaign. After crossing the Euphrates River, he took on the Mitannian forces, who were anything but ready for an invasion. The king of Mitanni fled, allowing Thutmose III to force Mitanni into complete submission. The Egyptian king is said to have taking about more than 30 members of the Mitannian’s harem and several hundreds of soldiers prisoners.\n\nTo commemorate his spectacular victory, he erected a stele next to his grandfather’s stele in the region. Thutmose thus became the first Egyptian monarch since Thutmose I to cross the Euphrates.\n\nA prominent builder of spectacular buildings\n\nA great patron of the arts and architecture, Thutmose III is said to have tasked his architects to build many magnificent structures, most famous among them came at the Temple of Amun at Karnak. Thutmose is credited with enlarging the complex by erecting new buildings and obelisks. For example he rebuilt his grandfather Thutmose I’s hypostyle hall. He also built a jubilee hall to mark his reign during the Sed festival. He also built a new temple at Dayr al-Bahri, just close to Hatshepsut’s mortuary temple.\n\nMore Thutmose III facts\n\nAs a result of the immense influence he had, many foreign princes and monarchs, from the Hittite region to the Mesopotamian region, frequently presented him a wide array of gifts. Rulers from as far as the Aegean and the Greek mainland sent envoys and gifts to Thutmose III.\n\nMuch of what we know about Thutmose III comes from the records of Thanuny, a royal scribe and commander in Thutmose III’s army.\n\nHe was a known hunter of elephant in the land of Niy in the Orontes Valley.\n\nOften times, the prisoners of war and the loot that he took from foreign lands were presented to the god Amun (Amon).\n\nAfter conquering a foreign land, Thutmose III would deploy native rulers to govern those territories. Those rulers were required to remain loyal, keep the peace, and pay annual tributes to Egypt. During his reign, Egypt received tributes from Nubia (Sudan), Syria, and Palestine.\n\nTypical of many Egyptian pharaohs, the records of Thutmose III are a bit boastful, exaggerating the abilities of the Egyptian king.\n\nIt was during Thutmose III’s reign that Egyptian artisans mastered glass making.\n\nIn his final few years on the throne, some of his courtiers, along with his heir Amenhotep II, tried to erase the records, including images and cartouches, of Hatshepsut and her reign. In some cases, Hatshepsut’s achievements were appropriated to Thutmose II and Thutmose I.\n\nHe loved to bring animals and plants from far and wide into his kingdom. Some of those foreign beasts and plants can be seen on the walls of the Festival Hall at Karnak.\n\nFor quite a number of centuries, Egyptians took to inscribing the name of Thutmose III on amulets. It was believed that those amulets protected the wearer.\n\nMummy and memorial temple\n\nThutmose III was buried in a very remote corner of the Valley of the Kings in western Thebes.\n\nHis mummy was discovered in 1889. Archaeologists believe that the 21st dynasty priest-kings (1076- c. 945 BC) kept his mummy in that place in order to protect it from being desecrated.\n\nBased on his mummy, Thutmose III’s height was in the region of five feet three inches (around 1.6 meters).\n\nDiscovered in 1962, Thutmose III’s memorial temple was sited next to Hatshepsut’s memorial temple in Dayr al-Bahri.\n\nMore Thutmose III achievements\n\nHis final military campaign saw him put down a rebellion (instigated by some exiled members of the Mitannian royal family) in the Arka plain. He also destroyed many Mitannian garrisons in the region.\n\nAround his 50th regnal year, he turned his attention to his southern borders, where he captured many Nubian territories, including Napata and Kurgus. He is famed for being the first Egyptian king to march an army as far as the fourth cataract of the Nile River.\n\nShortly after securing those Nubian regions, he erected a temple in honor of the god Amun. He also captured a number of prisoners that he would later send to the gold mines. Scholars state that the produce from those gold mines formed a significant portion of Egypt’s wealth.\n\nThutmose III’s consorts and children\n\nIn some texts it’s noted that Thutmose III married his half-sister Neferure, who was the daughter of Thutmose II and Pharaoh-Queen Hatshepsut. Neferure was at some point was even referred to as the God’s Wife.\n\nIn another account, the great royal wife of Thutmose III was rather Merytre-Hatshepsut. By her, Thutmose III gave birth to Amenhotep II, his successor. Merytre-Hatshepsut became the chief consort of the king after the death of Satiah. Additionally, Merytre-Hatshepsut was the mother of Thutmose’s successor Amenhotep II. In the course of her life, Merytre-Hatshepsut had titles like Great King’s Wife, God’s Wife, King’s Mother, Sole One, Beloved of Ra, and First among the nobles.\n\nOther famous wives of Thutmose III include Menwi, Merti, and Menhet. Those three women were princesses from foreign lands who were sent to the royal harem of the pharaoh. Although they were regarded as minor wives of the king, the three women still held a bit of influence in the royal court, receiving titles like King’s Wife.\n\nThutmose III also had the likes of Nebtu, Nebsemi and Satiah in his royal harem. It’s been stated that by later, Thutmose III bore his eldest son Prince Amenemhat. Satiah was psossibly Thutmose III’s first Great Royal Wife.\n\nKing Thutmose III had many children, including Menkheperre, Nebetiunet, Merytamun C, Merytamun D, Iset, and Nefertiri.\n\nFamily Tree of Thutmose III\n\nSuccessor\n\nThutmose III’s reign spanned for about 54 years; the first twenty-two years of his reign was spent serving as the co-ruler of Egypt with his stepmother Queen Hatshepsut. In his final few years, he appointed his son and heir Amenhotep II as a junior co-regent.\n\nHis eldest son and heir, Amenemhat, predeceased him, possibly dying of a plague. Following the death of Amenemhat, Amenhotep II became heir to Thutmose III."}, {"url": "https://www.bible.ca/archeology/bible-archeology-exodus-date-1440bc.htm", "page_content": "The Date and Pharaoh of the Exodus: 1446 BC\n\nPharaoh who killed Hebrew children: Amunhotep I: 1532-1511 BC\n\nPharaoh's Daughter who adopted Moses: Hatshepsut: 1526 BC\n\nPharaoh of Moses' flight to Midian: Thutmoses II/Hatshepsut: 1498-1485 BC\n\nPharaoh of the Exodus: Thutmoses III: 1485/1464 - 1431 BC\n\nPharaoh of the Exodus: Thutmoses III: (1485-1431)\n\nThutmoses III was Pharaoh in 1446 BC for a total of 54 years. (1485-1431).\n\nThere were three distinct phases to his rule.\n\n1. (1485-1464) First was when he was a baby and his stepmother Hatshepsut ruled as co-regent for 21 years.\n\n2. (1464-1446) Second, after Hatshepsut died, he ruled as Pharaoh for 18 years until the exodus.\n\n3. (1446-1431) Third, he ruled another 15 years after the exodus.\n\n\"Ok, I'll let em go now...\"\n\nThutmoses III\n\n\n\nThe Chronology of the Pharaohs of Egypt\n\n(by Steve Rudd) This low Egyptian chronology is derived, in part with the Ebers Papyrus, by assuming that the heliacal rising of Sothis was observed from the city of Thebes (Theban) which produces a date for the creation of the Ebers Papyrus of 1523 BC (+/- 6 yrs) and therefore sets the reign of Amenhotep I to 1532-1511 BC. We follow K. A. Kitchen in using the low chronology and add six years to all his dates. Pharaoh Reign Dates Notes Ahmose (Nebpehtyre) 25 1557-1532 Hyksos defeated, rise of the pharaoh who knew not Joseph. Hatshepsut born 1536 to Thutmoses I Amunhotep I (Djeserkare)\n\nKills Hebrew children in 1526 21 1532-1511 Moses born and Hebrew children killed in 1526. Princess Hatshepsut age 10, finds Moses Thutmoses I (Aakheperkare) 13 1511-1498 Thutmoses II (Aakheperenre)\n\nPharaoh of oppression in 1488\n\nMarried to step-sister Hatshepsut 13 1498-1485 Oppression, Moses flees the year before his adopted mother begins to co-reign with Thutmoses III, when Thutmoses II died. Thutmoses III born around 1496 when Moses was 30. Moses 40 in 1486 Hatshepsut, and her infant stepson Thutmoses III co rule for 20 years 21 1485-1464 Hatshepsut died in 1464 at age 77 Thutmoses III ruler before exodus 18 1464-1446 17 annual campaigns came to an end in 1446 never happened because the army drowned in the Red Sea 18th year of Thutmoses III is exactly 480 yrs before Solomon builds temple Year\n\n18 Exodus\n\n1446 1 Kings 6:1 Thutmoses III after exodus 15 1446-1431 No campaigns after Exodus Amenhotep II (Aakheperure) (second born son) 25 1431-1406 Weak king who signs peace accords. Israel has been at Kadesh for 12 years when he becomes king and dies the year Joshua crossed the Jordan. Thutmoses IV (Menkheperure) 10 1406-1396 . Amunhotep III (Nebmaatre) 38 1396-1358 . Akhenaten (Amunhotep IV) 17 1358-1341 Become King the year bJoshua dies. Converts to monotheism. Tutankhamun (Nebkheperure) 10 1341-1331 Reverts to polytheism and is murdered. Ay (Kheperkheperure) 3 1331-1328 . Horemheb (Djeserkheperure) 28 1328-1300 . Totals 257 1557-1300 .\n\nIntroduction:\n\nThe date of the exodus was 1446 BC when Israel left Egypt and 1406 BC when they crossed the Jordan into the promised land. The Bible is consistent and clear on this date: 1 Kings 6:1; Judges 11:26; Acts 13:19. The three verses are powerful, convincing and consistent . When Moses killed the Egyptian, he fled to Midian for 40 years from Thutmoses II who was Pharaoh from 1498-1485 BC. Thutmoses III was the Pharaoh of the Exodus who reigned 1485 - 1431 BC in three phases. The exodus occurred in Thutmoses III's 18 year of rule after his mother died.\n\nLate date of 1250 BC where Ramesses II (1279–1213 BC, low chronology) is the pharaoh of the exodus:\n\nAn Exodus in 1250 BC trashes the inspiration of scripture and contradicts known archaeology. Advocates of a 1250 BC exodus date quote Exodus 1:11 to prove that Israel lived in the city of “Ramesses” and helped build it. They say, \"Obviously the city did not precede the Pharaoh after whom it was named, so Ramesses II must be the Pharaoh of the Exodus. Sounds convincing until you read the passage that says that in 1876 BC Joseph also lived in \"the land of Ramesses\" (Genesis 47:11). Obviously then Ramesses was named after an ancient city that existed 600 years before he was born. The Merneptah Stele (1205 BC) proves the late exodus date of 1250 BC to be wrong:\n\n\n\na. Pharaoh Merneptah was the son of the pharaoh Ramesses II (1279–1213 BC, low chronology).\n\nb. Merneptah refutes the late date of 1250 BC for the exodus and Ramesses II as the Pharaoh:\n\ni. If Ramesses II is the pharaoh of the Exodus, then the date of the exodus is 1250 BC.\n\nii. If the exodus is 1250 BC then the conquest started in 1210 BC and was complete in 1203 BC.\n\niii. The 1250 BC exodus date is impossible because in 1205 BC, Merneptah boasts that he conquered Israel in the middle of the conquest of Joshua.\n\nc. Since the exodus was really in 1446 BC, then the Merneptah Stele was created during the time of Deborah (Judges 4, 1204-1144 BC).\n\nd. Merneptah’s invasion in 1205 BC is a perfect synchronism for the chronology of the judges:\n\ni. Ehud judged Israel for 98 years between 1302-1204 BC. There was an initial 18 years of oppression under the Moabites (Judges 3:14) between 1304-1286 BC. Then in 1284 BC Ehud killed Ehud and Israel experienced 80 years of peace ending in 1204 BC.\n\nii. From 1204-1184 BC, there were 20 years of oppression until Deborah kills Sisera, defeats Jabin and burns Hazor in 1184 BC. It has been known for some time that archeologists have misdated the second burning of Hazor by Deborah too early at 1230 BC because they fail to mark the death of Joshua in 1356 BC who burned Hazor the first time in 1401 BC. Joshua was Moses’ “youth servant” (Ex 33:11; Num 11:28) who was born in 1466 BC, was 20 years old at Mt. Sinai in 1446 BC, lived 110 years then died in 1356 BC.\n\niii. The beginning of the period of Israel’s oppression in 1204 BC one year later than when Merneptah attacked Israel in 1205 BC.\n\niv. Therefore, when we lay the archaeology of Merneptah Stele over top of the accepted chronology of the Judges, it is a perfect fit!\n\nv. What you read in the book you find in the ground!\n\nArchaeologists Kathleen Kenyon and Israel Finkelstein are enemies of the Bible:\n\nAs a professional archaeologist, I can testify that the vast majority of my fellow archaeologist who conduct excavations in Israel do not believe the Bible is an historical document. The vast majority of Israeli archaeologists living in Israel today believe their own history in the Tanakh is fiction. Bible hating archaeologists like Kathleen Kenyon who excavated Jericho and Israel Finkelstein who excavated Shiloh, have deceived the world by concluding the exodus is a myth.\n\nc. John Garstang excavated Jericho 1930-1936 and concluded Jericho was destroyed in 1406 BC by Joshua confirming the Bible. Garstang documented imitation Cypriot ware pottery from the late 15th century BC he found at Jericho. Kathleen Kenyon excavated Jericho 1952-1958 and concluded that the Bible story of Jericho was a myth because the walls of Jericho had already fallen 150 years before Joshua arrived in 1406 BC. Her conclusion was based upon the lack of Cypriot ware pottery used in the 15th century BC, although Garstang had documented local Canaanite imitation Cypriot pottery 20 years earlier. Dr. Bryant Wood who has a PhD in Late Bronze Canaanite pottery reexamined her pottery finds and proved she had misdated the LB I destruction layer of the city. Not only did the Canaanite pottery date to LB I, Wood documented imitation Cypriot ware that Kenyon had ignored. Kenyon never did an in-depth analysis of the pottery from the destruction layer and totally ignored the local Canaanite 15th century BC pottery which Garstang had correctly dated. Wood confirmed the work of Garstang and refuted Kenyon’s conclusion that the Bible story was a myth.\n\n\n\nIsrael Finkelstein is a minimalist, meaning he believes Abraham, the exodus, David and Solomon are all mythical figures invented by Jews in the 7th century BC to create a cultural backdrop. Finkelstein concluded in his excavation 1993 report at Shiloh that the site was unoccupied 1400-1100 BC, the precise period when the Bible says the tabernacle tent was active. However, the author is staff archaeologist of the current excavations at Shiloh 2017-present and clear evidence of occupation between 1400-1100 BC has been discovered. The problem in both these cases is that Bible commentaries, dictionaries and encyclopedias quote Kenyon and Finkelstein, despite the fact their conclusions have been refuted. This is like how university biology textbooks in 2020 are filled with evidences of evolution that have been debunked for over 100 years. Summary of dates revealed in the Bible:\n\nThe time after leaving Egypt to 4th year of Solomon's reign is 480 years: 1 Kings 6:1 (Solomon reigned in 970 BC when David died.) The time from crossing the Jordan to Jephthah is 300 years Judges 11:26 (Jephthah lived in 1100 BC) The time from entering Egypt until the time of Samuel was 450 years: Acts 13:19 (400 + 40 + 10: Joshua took 10 years to take the land) The period of the Judges is 262 years. (From death of Joshua in 1356 BC to birth of Samuel in 1094 BC) The many genealogies of the Bible verify and confirm everything. Trust the Bible when it dates the exodus to 1446 BC. Reject 1250 BC for the date of the exodus.\n\nA. Scripture dates the exodus to 1446 BC: 1 Kings 6:1, Judges 11:26-28 and Acts 13:19-20\n\n1. The Bible says Israel spent 430 years in Egypt: 1876-1446 BC\n\na. There are three verses that give the duration of the time spent in Egypt. Exodus 12:40-41 and Galatians 3:17 both say 430 years whereas Genesis 15:13 says 400 years. The difference is easy to understand because God was speaking to Abraham in general times looking forward and the other two were quite specific times looking back.\n\ni. \"Now the time that the sons of Israel lived in Egypt was four hundred and thirty years. And at the end of four hundred and thirty years, to the very day, all the hosts of the Lord went out from the land of Egypt.\" Exodus 12:40-41\n\nii. \"What I am saying is this: the Law, which came four hundred and thirty years later, does not invalidate a covenant previously ratified by God, so as to nullify the promise.\" Galatians 3:17\n\niii. \"God said to Abram, \"Know for certain that your descendants will be strangers in a land that is not theirs, where they will be enslaved and oppressed four hundred years.\" Genesis 15:13\n\nb. Apostle Paul said that from the time Israel entered Egypt till they fully settled Canaan under Joshua was 450 years. This is calculated by adding the generalized 400 years Abraham was told in Genesis 15:13 plus 40 years in the wilderness plus 10 years it took Joshua to fully occupy the land. It is important to notice that Paul is approximating because he said \"About 450 years\". God in general terms told Abraham 400 years in Genesis 15:13, but Paul knew that the specific time was 430 years in Exodus 12:40-41; Galatians 3:17. \"When He had destroyed seven nations in the land of Canaan, He distributed their land as an inheritance-all of which took about four hundred and fifty years.\" Acts 13:19\n\nConnecting Solomon’s temple to the exodus in 1446 BC: Solomon began building the temple in Jerusalem in the 4th year of his reign. This verse says that 480 years before the 4th year of Solomon's reign Israel left Egypt. That makes the exodus 1446 BC: \"Now it came about in the 480th year after the sons of Israel came out of the land of Egypt, in the fourth year of Solomon's reign over Israel , in the month of Ziv which is the second month, that he began to build the house of the Lord.\" (1 Kings 6:1) Those who try to symbolize the 480 years into 12 generations of 40 years are gravely mistaken. Why would such a symbolic number be applied to the specific of \"the 4th year of Solomon\". Further, the foundation of the temple is a critical date of great importance. The idea that the number 480 is symbolic and not literal is not reasonable. If God intended there to be any symbolism in the literal 480 years being 12 generations of 40 years (and there may not be), this shows the power of providence of God to bring such things about. There are other examples of these precise dating in scripture at key and important times. \"And at the end of four hundred and thirty years, to the very day , all the hosts of the Lord went out from the land of Egypt.\" (Exodus 12:41) It makes perfect sense that just as the 430 years TO THE VERY DAY, was literal, so too is the date of the temple started 480 years EXACTLY. There is no valid reason why the number should not be taken literally and many reasons why it should be taken literally. Jephthah’s 300 years:\n\nJephthah who lived in 1100 BC said Israel crossed the Jordan 300 years earlier. Sihon, the Ammonite king, wanted his land back that Israel took under Joshua. Jephthah asks Sihon why he suddenly wants the land back 300 years later and never requested such before now. \"'While Israel lived in Heshbon and its villages, and in Aroer and its villages, and in all the cities that are on the banks of the Arnon, three hundred years, why did you not recover them within that time ? 'I therefore have not sinned against you, but you are doing me wrong by making war against me; may the Lord, the Judge, judge today between the sons of Israel and the sons of Ammon.' \" But the king of the sons of Ammon disregarded the message which Jephthah sent him.\" (Judges 11:26-28) Low chronology takes the block of 258 years that is the sum of the length of time each Pharaoh was king and defines it as a single unit. (25, 21, 13, 13, 21, 18, 15, 26, 10, 38, 17, 10, 3, 28).\n\nWe are uncertain exactly when they were king, but we know how long and in what order! Archeology doesn't tell us the date they lived, but it certainly tells us how long each ruled! The problem is accounting for unknown coregencies which would collapse the time scale. We solved the problem, by ignoring that which is uncertain (when they ruled) and focused on what was very certain: how long each ruled, and in what order. Without archeology, we would be unable to know any of this, but we have found actual tombs, inscriptions, mummies, war records that supply the information we need with great certainty. Our approach, therefore, began with the assumption that the exodus happened in the 18th dynasty of Egyptian Pharaoh's.\n\nBecause historians are \"all over the map\" in the dates they lived to over 75 years, we considered all possible candidates for the pharaoh of the Exodus. After a careful and detailed study of all the 18th dynasty pharaoh's, it became rapidly clear Thutmoses III was the only real possible candidate as the Pharaoh of the Exodus.\n\nThutmoses III was he pharaoh in 1446 BC using low Chronology Two historical synchronisms occurred in 1446 BC. His 17 annual military campaigns ended in his 18th year of sole reign after his mother Hatshepsut died. Her image was chipped out of Egyptian relief starting in 1446 BC because she adopted Moses who brought about the destruction of Egypt through the 10 plagues. He was the most powerful of the 18th dynasty kings and a perfect candidate for God to humble.\n\nThink of our solution as two fixed blocks of time that are \"Indivisible Units of Chronology\": Block one is the fixed 480 years between the Exodus and the 4th year of Solomon in 1 Kings 6:1. Block two is the fixed 258-year block of time for the 18th dynasty Pharaoh's. We know that the Exodus of 1446 occurs in the middle of the 18th dynasty so the only problem is exactly where we lock the two blocks together. Our solution was that 1446 BC is the 18th year of Thutmoses III. We used a similar approach to solve Eli - Solomon Chronology. Using the Judges to calculate the exodus at 1446 BC:\n\nThe chronology of the Judges fits almost perfectly from Othneil, the first Judge, down to Jephthah in 1100 BC. The chronology of the Judges from Jephthah down to Solomon also fits almost perfectly within 6 years. In proving the exodus of 1446 BC, we can use the Jephthah to Solomon Chronology in this way: According to Judges 11:26-28, Jephthah lived 300 years after Israel crossed the Jordan which is 1100 BC. Solomon's 4th year as king was 480 years after Israel left Egypt and 140 years after Jephthah. The period of the Judges ended when David became king in 1010 BC, since Samuel judged till he died in 1014 BC. If we take the raw chronological numbers from the book of Judges we get this: Jephthah 6 years + Ibzan 7 years + Elon 10 years + Abdon 7 years + Eli 40 years + Samuel 60 years (who died in 1014 BC) + 40 years of David + 4 years of Solomon = 174 years. Unadjusted it is only 34 years too long. (Remember the Bible tells us plainly that Samson judged at the same time as Jephthah, so we don't count Samson or the oppression that preceded him.) But we also know that Eli judged from 1134 - 1094 BC which was before Jephthah! So we can actually ignore the 40 years Eli judged altogether! Now if we add Jephthah's 300 years back to the crossing of the Jordan and add 40 years in the wilderness and add the 134 years forward from Jephthah to the 4th year of Solomon, we get 474 years. 1 Kings 6:1 says the actual period was 480 years. Using the Judges Chronology, the difference is only 6 years! This is a stunning confirmation of the statement in 1 Kings 6:1 that the exodus happened 480 years before the 4th year of Solomon. It clearly refutes the 1250 BC exodus. All this makes it utterly impossible for the Bible believer to teach the exodus took place in 1250 BC. Trust your Bible, not Bible trashing archeologists who teach a 1250 BC exodus. Detailed study on the Chronology of Judges\n\nBible chronologies and genealogies says the Exodus happened in 1446 BC:\n\nTo suggest that the exodus happened in 1250 BC creates problems with the many chronologies and genealogies within the Bible that take us from Adam to Christ. The ten generations between Adam and Noah: Gen 5. \"Noah was five hundred years old, and Noah became the father of Shem, Ham, and Japheth.\" Genesis 5:32 The ten generations between Noah and Abraham: Gen 11 The twelve tribes from Jacob to David: 1 Chron chapters 2 - 9 Adam to Jesus: Luke 3:23-38; Matt. 1:1-17 1 Kings 6:1, Judges 11:26 and Acts 13:19 are powerful, convincing and consistent .\n\nThey are powerful because there is a witness of three distinct and explicit texts that give a date of 1446 BC for the Exodus. They are convincing because they are stated clearly in non-figurative narratives cradled in true historical stories. They are consistent because the three texts all give the same date, not different dates.\n\nB. Egyptian Chronology: Six-year shift applied to Kitchen’s Low Chronology\n\nWe accept and follow the low chronology of Kenneth Kitchen, which makes Thutmoses III the pharaoh of the exodus, then make an adjustment sliding his entire time scale six years earlier. Kitchen’s date for the 18th regnal year Thutmoses III’s sole reign after his mother died is 1440 BC. Our chronology slides the 18th year of Thutmoses III six year older from 1440 BC to 1446 BC. Professional Egyptologists all agree that a 6-year shift is well inside the error margin of any Egyptian chronology and therefore possibly correct. The year of the exodus in 1446 BC had two Egyptian chronological markers:\n\nThutmoses III’s 17 annual campaigns of war into foreign lands came to an end in 1446 BC because his entire army was drowned in the Red Sea. The erasure of images of Hatshepsut began in 1446 BC because she adopted Moses who destroyed Egypt through the ten plagues. The pharaoh of the Exodus is dependent upon which of low or high Egyptian chronology is correct. It all depends upon which city the “heliacal rising” of the Dog Star was observed.\n\nThutmoses III, low chronology: If “heliacal rising” of the Dog Star was observed from Thebes, then low chronology is correct and Thutmoses III would be the pharaoh of the Exodus because his reign falls between 1450 – 1440 BC. Amenhotep II, high chronology: If “heliacal rising” of the Dog Star was observed from Memphis, then low chronology is correct and Amenhotep II would be the pharaoh of the Exodus because his reign falls between 1450 – 1440 BC. Our low Chronology is remarkably orthodox, but there is one difference.\n\nWe can precisely pinpoint the Exodus of 1446 with the 18th year of Pharaoh Thutmoses III. Just as all old Testament Bible events can be dated in relation to the reign of Solomon, so too all the Pharaoh's of Egypt can be dated in relation to the 18th year of Thutmoses III. Both are anchors in historical dating. This represents original research and we are not aware of anyone who has ever connected the 18th year of Thutmoses III's reign with the year of the Exodus in 1446 BC. We use the Low Egyptian chronology as proposed by A. K. Kitchen and add 6 years:\n\nThe Ebers Papyrus dates records the heliacal rising of Sothis on the 9th year, 3rd month, 3rd season (i.e. the 11th month of the Egyptian calendar) as happening on the 9th year of the reign of Amenhotep I. Egyptian Low Chronology + 6 years: We adjusted Kitchen's low chronology dates upward by 6 years. The low Egyptian chronology is derived, in part in part with the Ebers Papyrus, by assuming that the heliacal rising of Sothis was observed from the city of Thebes (Theban) which produces a date of 1523 BC (+ or - 6 years, so we use 1529 BC) and therefore sets the reign of Amenhotep I to 1532-1511 BC. High Chronology: The high Egyptian chronology is derived, in part with the Ebers Papyrus, by assuming that the heliacal rising of Sothis was observed from the city of Memphis (Memphite/Heliopolitan) which produces a date of 1541 BC and therefore sets the reign of Amenhotep I to 1550-1529 BC. Egyptian chronology is a mess and must be grounded upon Biblical dating: The Bible is the far more reliable dating system for historical chronology and synchronisms. There are many reasons why we cannot rely upon the chronologies of the 18th dynasty pharaohs as being reliable given the almost certain fact that there are many unknown coregencies which would collapse the chronology by at least 6 years. So we are confident in our choice to use Kitchen's low chronology numbers and then simply adding 6 years to each. Kenneth Kitchen discusses Egyptian Chronology in the Anchor Bible Dictionary:\n\n\"The rise of the Nile was not the only event noticed in the July time of the year in Egypt. Quite by coincidence, the so-called “heliacal rising” of the Dog Star (Gk Sothis, from Egyptian Sopdet) also took place on the original July “New Year” of the civil calendar. (The heliacal rising of Sothis is defined as that day on which this star first becomes visible just before sunrise, after 70 days of invisibility, Parker 1950: 7.) Because of the behavior of Egypt’s too-short civil calendar, some 1460 years have to elapse between one sighting of this heliacal rising of Sothis on the 1st day of the 1st month of the 1st season (New Year’s Day) in the civil calendar and the next time this exact sighting could reoccur. This period of about 1460 years is therefore called a Sothic cycle. Fortunately, one such date point is known: within the period 139–42 a.d. (Parker 1976: 182). Therefore, allowing for variations in the stellar motion of Sothis, it can be calculated that previous Sothic cycles would begin in 1313 b.c. and 2769 b.c., if observed at Memphis (see Parker 1976: 182, who uses astronomic notation). Fixing the date of these cycles should (in theory) help us to date any reign of a pharaoh, if a heliacal rising of Sothis is found mentioned in a particular year of his rule on a specific date in the civil calendar—one only needs to know inside which cycle his reign falls. For example, if some king who belonged within the period 2700 to 1350 b.c. had a document dated to his Year 1, mentioning the rising of Sothis on the 6th day of the 4th month of the summer season (11th month in the year), it is clear that the civil calendar had crept forward 335 days since such a rising last happened on its New Year’s Day. So, 4 × 335 years had elapsed since 2769 b.c., putting our theoretical king’s accession (Year 1) at about 2769 minus (4 × 335) years b.c., or 2769 minus 1340 = 1429 b.c. Alas, in practice things are not so simple. There are several complications . First, one must allow for a 4-year margin of error (before quarter days add up to one day, among other factors). Second, the geographical location of any reported Sothic sighting affects reckoning of the date . In practice, the further south the sighting, the later the date b.c. So, we need to know, for example, whether a report of Sothis was made in Memphis, Thebes, or Elephantine . Only two usable Sothic rising reports are known to us at present: one in Year 7 of Sesostris (Senwosret) II or III, and one in Year 9 of Amenhotep I. The former one may have been observed either in Memphis or Elephantine; there would be a roughly 30-year difference in date, depending on place of observation. The latter one would have been seen in either Thebes (source of the Ebers Papyrus bearing the datum) or Elephantine; the date difference is then only about 11 years. (For the suggestion of Elephantine as the point of observation for both risings, leading to ultra-low dates for both, see Krauss 1985; contrast Kitchen 1987a: 42–44, 47, where the corresponding options of observations made at Memphis and Thebes respectively are preferred.)\" (ABD, Egypt, History of, Chronology, K. A. Kitchen, v2, p324) \"A rising of Sothis is recorded for Year 9 of Amenhotep I in Papyrus Ebers, a document found at Thebes. If the observation of Sothis was also made at Thebes, the most natural solution, then it would lead us to set the accession of Amenhotep I at 1525 b.c., and the beginning of the 18th Dyn. (and NK) with the accession of Ahmose I at ca. 1550 b.c. If, however, we follow the theory of Krauss that all Sothis observations were taken far south in Elephantine, then the 18th Dyn. would have begun 11 years later, in 1539 b.c. From the reign of Thutmose III we have a lunar date which would imply his accession to the throne in 1479 b.c., in line with a similar datum from the reign of Rameses II, favoring his accession in 1279 b.c., in conjunction (1) with synchronisms with other Near Eastern rulers and (2) with the lapse of generations linking the Rameside period to later epochs. If the 18th Dyn. began in 1550 b.c., there is ample time for the reigns of Thutmose I and II in between those of Amenhotep I and Thutmose III. If, however, the dynasty began in 1539 b.c. (so Krauss 1985), then only 13 years are available for those two reigns—which is decidedly cramped and not realistic. Between the reigns of Thutmose III of 54 years (1479–1425 b.c. and Rameses II of 66 years (1279–1213 b.c.), all the intervening reigns can be fitted in without any serious problems . Most lengths of reigns can be determined quite closely (Kitchen 1987a; 1989). Bones of contention include the possibility of a coregency between Amenhotep III and Akhenaten, which would require a longer reign for Amenhotep II; and whether or not Amenmesses of the 19th Dyn. had an independent reign (on the latter point, see Kitchen 1987b).\" (ABD, Egypt, History of, Chronology, K. A. Kitchen, v2, p327)\n\nDouble chronological marker in the 18th year of Thutmoses III:\n\n\n\nOur Egyptian Chronology chose Thutmoses III as the Pharaoh of the Exodus because an incredible double marker stands out two flashing neon lights in Thutmoses III's life. Two key events happened as a direct result of the 10 plagues and the exodus of Moses in 1446 BC:\n\nFirst: After 17 yearly military campaigns, they suddenly stopped because pharaoh’s army was killed in the Red Sea. Second: The beginning of the erasing of Hatshepsut’s image from statues and records at precisely the same time because she adopted Moses. Thutmoses III’s annual campaigns ended out of necessity and the erasure of Hatshepsut’s image began out of revenge.\n\n1 Kings 6:1 confirms the 18th dynasty pharaohs witnessed the Exodus: Using 1 Kings 6:1 we can harmonized the 18th dynasty Pharaohs directly with the reign of Solomon. The Exodus occurred exactly 480 years (479 literal BC years when adjusted for inclusive counting) before the temple was built by Solomon. Looking at the many candidates for Pharaoh in 1446, we were able to conclude, with a high level of confidence, that the 18th year of Thutmoses III's reign after his stepmother Hatshepsut died, is the date of the exodus in 1446 BC. It is a truly stunning fit! This Chronology creates a solid anchor between the 18th year of Thutmoses III as being the date of the Exodus and the 480 years to the time Solomon started the temple. (1 Kings 6:1). Connecting the 18th year of Thutmoses III with the year of the exodus has never been done before.\n\nC. Thutmoses II and Hatshepsut: Pharaoh’s of the oppression:\n\nThe Hyksos “knew Joseph” but the 18th dynasty \"did not know Joseph\": The slavery of the Hebrews coincides with the Hyksos being expelled from Egypt. The Hyksos rule Egypt for 119 years (1657-1538 BC): “The Pharaohs who knew Joseph”. The timing of the expulsion of the Hyksos and the enslaving of Israel perfectly fits Thutmoses III as the pharaoh of. In 1657 BC the Hyksos overthrew the pharaohs of Egypt and built their palaces at Tel el-Dab'a. The Hyksos ruled for about 119 years, displacing the Egyptians as the government of Egypt. They were the Pharaohs who \"knew Joseph\" and cooperated with the Hebrews. Archeology has confirmed that the Hyksos built three palaces at Tel el-Dab'a directly beside the Hebrews. From the time of Joseph down to the end of the Hyksos period, the Hebrews enjoyed freedom with no slavery, but that was about to end. The Hyksos were expelled by the 18th dynasty Pharaohs of Egypt who “Knew not Joseph”. In 1538 BC Ahmoses I finally defeated the Hyksos and the Hebrews were stripped of their financial control of the commercial shipping hub and became oppressed slaves who built two storage cities of Pithom and Ramesses (Ex 1:11). The oppression of the Hebrews began in 1538 BC and ended in 1446 BC with the Exodus of Moses. No one can be certain about who the Hyksos were but they were most likely the Edomites. They were the \"shepherd kings\" that were friendly to the Hebrews so one might infer that they were a fellow Semitic tribe. Hyksos were Edomites: The book of Job shows Job to be the king of Edom or a preeminent patriarch, at about the time that Joseph enters Egypt. Perhaps the Hyksos were friendly to the Hebrews because they were fellow Semites who shared a common heritage through Abraham. When the Hyksos were defeated, a New Kingdom of 18th dynasty of pharaohs arose who \"knew not Joseph\". This would explain why the Hebrews were enslaved by the 18th dynasty pharaohs because the Hebrews were relatives of the Hyksos. Esau (Edom) and Jacob were twin brothers of Isaac. Isaac's blessing to Esau was: \"Then Isaac his father answered and said to him, \"Behold, away from the fertility of the earth shall be your dwelling, And away from the dew of heaven from above. \"By your sword you shall live, And your brother you shall serve; But it shall come about when you become restless, That you will break his yoke from your neck .” Genesis 27:39-40. The entire world was ruled by Egypt under Joseph because they sold everything they had in order to get the wheat of Egypt. During the first 200 years that Israel was in Egypt, the sons of Jacob (Israel) ruled the world. If the Hyksos were the children of Esau (Edom) this fulfilled Isaac’s prophecy of a time when Esau “broke the yoke” of being ruled Jacob. It was a friendly rule, just as Jacob's rule over Edom had been. It was a role reversal prophesied by a dying Isaac. The expulsion of the Hyksos and the beginning of the New Kingdom through the 18th dynasty, is perfect timing because Moses is born in 1526, only 12 years after the Hyksos were finally expelled in 1538. The Hyksos were foreign shepherd king Pharaoh's “who knew Joseph” and were replaced by the Thutmoside dynasty who “knew not Joseph”. Hatshepsut is \"Pharaoh's daughter\" who adopted Moses:\n\n\n\nHatshepsut, is the only candidate for the \"Pharaoh's daughter\" who drew Moses out of the Nile. Born in 1541 BC, she would have been 15 years old when Moses was born in 1526. Hatshepsut's father was Thutmoses I and her mother was Queen Amoses. Queen Ahmose had four children with Thutmosis I, but three died young leaving Hatshepsut as the only person who could wear the title of \"Pharaoh's daughter\". (Ex 2:7-10; Acts 7:21; Heb 11:24) The bible says that pharaoh's daughter adopted Moses out of pity. However, since she was unable to ever bear a son to Thutmoses II, Moses became her only chance for personal succession. This all changed when Moses was about 30, when Thutmoses II's second wife named Iset, bore him a son named Thutmoses III. Remember that Thutmoses II was Hatshepsut's stepbrother whom she married and jointly raised Moses to adulthood. Moses was heir apparent, until Thutmoses III was born when Moses was 30 in 1496 BC. The timing of the birth of Moses and the much later birth of Thutmoses III is proven by the fact that Thutmoses III was very young while he was coregent with his stepmother Hatshepsut until she died. Thutmoses II and Hatshepsut the pharaohs of oppression:\n\nThutmoses II and Hatshepsut were married stepchildren. Thutmoses II was the Pharaoh of the oppression who wanted to kill Moses who then fled to Midian. At this time, several things came together all in accordance with God's providence. It all started when Moses killed the Egyptian.\n\nFirst: Moses was putting his trust in God and was turning away from the riches of Egypt. (Heb 11) Second: a true full blooded \"first born heir\" to the throne had been recently been born to Thutmoses II through his second wife, Iset. Third: this placed enormous pressure on the ambitious Hatshepsut who only had Moses as an adopted \"first born\" heir. Fourth: there was likely a rivalry with bad feelings between Iset and Hatshepsut just like Sarah and Hagar. Fifth: Moses, like Hatshepsut, could also \"read between the lines\" and see that there was an upcoming power battle over the rightful heir to the throne of Egypt between him and Thutmoses III. Queen Hatshepsut was furious woman scorned because \"Moses refuses to be called Hatshepsut's son\" Heb 11:24. Moses insulted and hurt his stepmother by turning his back on everything she thought was important. In reality, both Thutmoses II and Hatshepsut were out to kill Moses for different reasons and were both \"Pharaoh's of the oppression\". Thutmoses II wanted to kill Moses to make his biological first-born son, Thutmoses III Pharaoh, because Moses had legal first right! Hatshepsut wanted to kill Moses out of vengeful hurt of rejection as a “mother spurned”.\n\nD. Thutmoses III was the Exodus Pharaoh:\n\nMoses derives his name from the 18th dynasty not the 19th dynasty of Ramesses. \" Moses \" derives his name from Ah moses , Thut moses I and the \"Thut moses \" dynasty of kings. Thutmoses I was the father of Hatshepsut who named Moses. It is obvious Moses did not get his name from not from the 19th dynasty era of Rameses II. It is sad that bible trashing archeologists deliberately spell \"Thut moses \" in ways that breaks any connection with \"Moses\" of the Bible. These variant spellings include: Tuth mosis , Tuth mose , Thot mes . Remember that the name \"Thut moses \" was written in hieroglyphics (pictures), but the name Moses is written in Hebrew and Greek. Because we are certain of how Moses' name was spelled in English, and that he got his name from Hatshepsut, the daughter of Thut moses I, the modern archeological world, and all Bible students would be both prudent and correct to spell the 18th dynasty pharaohs as \"Thutmoses\". This is a case of using the inspired text of the Bible to teach Egyptologists how to correctly spell the Thutmoses 18th dynasty of pharaohs!\n\n\n\nThutmoses III was Pharaoh in 1446 BC : (1485-1431, low chronology)\n\nThutmoses III was Pharaoh in 1446 BC for a total reign of 54 years. (1485-1431). There were three distinct phases to his rule. First: (1495-1464) from when he was a baby and his step-mother Hatshepsut ruled as co-regent for 21 years. This period is generally ascribed directly to Hatshepsut as Pharaoh, especially since she proclaimed herself pharaoh before she died. Thutmoses III was Hatshepsut step son and when her husband and step brother Thutmoses II died, she ruled until Thutmoses III grew up. Second: (1464-1446) after Hatshepsut died Thutmoses III ruled as Pharaoh for 18 years until the exodus. Third: (1446-1431) Thutmoses III ruled another 15 years after the exodus.\n\nThutmoses III was great, powerful and prideful vs. weak Amenhotep II Thutmoses III was one of the greatest and most powerful Pharaohs of Egypt. He is in the class of Herod the Great in 39 BC and Hadrian in 135 AD. Thutmoses III’s son, Amenhotep II, was small, insignificant and unaccomplished in contrast. The 17 campaigns of Thutmoses III into the promised land and surrounding areas (Levant), are numbered successively throughout his reign. His 17 campaigns started in the second year and then one campaign each year for the next 17 years, then they ended in 1446! This means that his last campaign ended in year 18 after Hatshepsut died! Thutmoses III’s military conquests softened up Canaan for the eventual conquest of Joshua 40 years later. When you are looking for a powerful prideful Pharaoh that God wanted to humble, Thutmoses III is the man. This where Thutmoses III’s second born son, Amenhotep II is a poor candidate for the pharaoh of the exodus because he was weak and ineffective! Amenhotep II had only two military campaigns, in contrast to his father’s seventeen. Thutmoses III conquered the Mitanni with a powerful surprise attack on his eighth campaign (1436 BC), but Amenhotep II merely signed peace treaties with Mitanni in year 9 of his reign (1422 BC).\n\nVictory stele of Thutmoses III The text is a poem praising 'son' for victories over Canaan, Nubia, Mesopotamia, Phoenicia, Cyprus, Asia Minor, Greek Archipelago. Unless this is another case of exaggeration like the Merneptah stele, it appears Thutmoses III had conquered the promised land at the time Israel was at Kadesh Barnea. He was powerful enough, that he may have done such.\n\nThe only known Mud brick making by foreign slaves in 1446 BC:\n\nThe only record of mud bricks being made by non-Egyptian foreign slaves is in the tomb of Rekhmire who lived at the same time as Thutmoses III. Pictured below are Hebrews making mud bricks in the Tomb of Rekhmire the Vizier (tomb TT100) in ancient Thebes (Luxor). Dated to Thutmoses III. Although mud brick making was common, it is amazing that the only archeologically known example of non-Egyptian foreign slaves making bricks, dates from the time of the Exodus in 1446 BC.\n\n\n\n5. Moses was firstborn by adoption and Thutmoses III legally second born:\n\na. There are two reasons why Thutmoses III survived the tenth plague even though he was biologically first born.\n\ni. First: Even if Thutmoses III was the first born, he was exempted from the 10th plague. God told Moses that after the death of the firstborn, Pharaoh would let Israel Go, not that the 10th plague would kill him. The whole point was to humiliate Pharaoh, not kill him.\n\nii. Second: Thutmoses III was not the legal \"firstborn\", merely the biological firstborn.\n\nb. Moses had been adopted into the family and took the legal place of firstborn and therefore heir to the throne. The matter of succession would have become a point of conflict between Hatshepsut and her husband Thutmoses II, once Thutmoses III was born. Thutmoses III would have surely been make fully aware of this huge family fight and it was in his best interest to side with biology.\n\nc. Moses left the matter unresolved when he fled for Midian. The question would have lingered in Thutmoses III's mind until he got his answer in the 10th plague that Moses really was the rightful firstborn heir to the throne he sat upon.\n\nd. When Moses first shows up and demands that his stepbrother \"Let Israel go\", it was a bizarre irony. Here you have Moses, the rightful legal heir to the very throne that he turned his back on, demanding of Thutmoses III the usurper to let Israel go. The pride and the rivalry must have been enormous for Thutmoses III. After 9 plagues, Moses stands before his stepbrother and says that the first born will die. Thutmoses III had to emphasize his claim as firstborn, in order to gain the throne! Moses' statement that all the firstborn of Egypt would die caused terror to enter Thutmoses III's heart. When Moses said, \"you will never see my face again\", Pharaoh may have interpreted this to be a prediction of his imminent death.\n\ne. When Thutmoses III survived the death of the firstborn he was relieved to be alive but shamed that he was proven to be a usurper. The fact he did not die, proved that Moses was in fact firstborn and the living rightful pharaoh of Egypt.\n\nThutmoses III did not die in the red sea:\n\na. The Pharaoh of the Exodus did NOT die in the Red Sea. The Bible nowhere says Pharaoh drowned in the Red Sea. Further, drowning in the Red Sea was the easy way out. It was far more humiliating for Thutmoses III to have to travel back to a destroyed Egypt WITHOUT his army to face his people.\n\nb. Some rule out Thutmoses III as a candidate for the Pharaoh of the Exodus BECAUSE he died 15 years after the Red Sea crossing in 1431 BC. It must be noted that using high or low Egyptian chronology neither Thutmoses III or his son Amenhotep II died in 1446 BC in the Red Sea.\n\nc. With all the factual errors in the classic 4-hour Hollywood movie, \"THE TEN COMMANDMENTS\" with Charlton Heston, the spectacular scene where Pharaoh army are drowned before his eyes and he drops his staff is correct!\n\nd. Ps 136:15 says God \"shook off\" Pharaoh but didn’t' kill him. The Hebrew word for \"overthrew\" is literally \"shook off\" and is metaphoric of ridding the Hebrews of Pharaoh's control. It DOES NOT say that God drowned or killed Pharaoh and his army in the Red Sea.\n\ni. \"But He overthrew Pharaoh and his army in the Red Sea\" (Psalm 136:15)\n\ne. Notice how scripture carefully differentiates Pharaoh from HIS ARMY:\n\ni. \"Then the Egyptians took up the pursuit, and all Pharaoh’s horses, his chariots and his horsemen went in after them into the midst of the sea. At the morning watch, the Lord looked down on the army of the Egyptians through the pillar of fire and cloud and brought the army of the Egyptians into confusion. He caused their chariot wheels to swerve, and He made them drive with difficulty; so the Egyptians said, “Let us flee from Israel, for the Lord is fighting for them against the Egyptians.” Then the Lord said to Moses, “Stretch out your hand over the sea so that the waters may come back over the Egyptians, over their chariots and their horsemen.” So Moses stretched out his hand over the sea, and the sea returned to its normal state at daybreak, while the Egyptians were fleeing right into it; then the Lord overthrew the Egyptians in the midst of the sea. The waters returned and covered the chariots and the horsemen, even Pharaoh’s entire army that had gone into the sea after them; not even one of them remained.\" (Exodus 14:23-28)\n\nii. In the victory song of Moses notice it never says Pharaoh himself drowned: \"Pharaoh’s chariots and his army He has cast into the sea; And the choicest of his officers are drowned in the Red Sea.\" (Exodus 15:4)\n\n7. Thutmoses III's annual campaigns ended in 1446:\n\na. Thutmoses III made 17 yearly military conquests into Canaan and the levant that started in his second year and continued every year until his 18th year which was 1446 BC when his army drowned in the Red Sea.\n\nb. His campaigns did not start until after his coregent stepmother Hatshepsut died in 1464. In the 34 years that Thutmoses III ruled after Hatshepsut died, he launched 17 military campaigns into Canaan and Syria, and Nubia (southern Nile).\n\nc. Thutmoses III’s annual campaigns ended because his army lay 1381 meters (4530 feet, almost a mile) under water at the Straits of Tiran.\n\nd. After 17 annual campaigns, the 18th campaign of 1446 never happened! Nothing in the Bible says that Thutmoses III died with his army in the Red Sea.\n\n8. Defacing and erasure of Hatshepsut by Thutmoses III started in 1446:\n\n\n\na. Immediately after the Exodus, Thutmoses III erased all evidence of both the Hebrews in Goshen and his step-mother, Hatshepsut for adopting Moses into the royal family.\n\nb. The well documented erasure of Hatshepsut from records and monuments began after 1446 BC at the hand of Thutmoses III.\n\nc. The erasure of Hatshepsut from history did not occur before his 42nd regnal year (year 20 after Hatshepsut died) which brings us to exactly 1443 BC, which is three years after the exodus! Another perfect fit!\n\nd. Bible trashers say Thutmoses III was a misogynist who hated women:\n\ni. Bible trashing historians dismiss the exodus as myth and make it their primary goal is to hide any connection between Egypt and the Exodus. These Bible hating archeologists suggest that Thutmoses III was motivated by sexist male revenge against an \"overbearing and dominant wicked feminist step-mother who usurped her female place in a male dominated world\"! But this is a ridiculous and strained explanation given the fact that Thutmoses III waited 21 years after the death of Hatshepsut to erase her memory. The anger and revenge of Esau to kill Jacob for stealing the title of first born, had fully subsided after 21 years. (An amazing co-incidence in both numbers and the usurping of the firstborn birthright.)\n\nii. \"If Thutmoses III was the culprit [of erasure], he must have had sufficient motive to attempt to prevent her from living eternally. According to Egyptian religion, removing the name or image of a deceased person was a direct assault on his/her spirit. For him to live forever in the Field of Reeds, his body, image, or name must survive on earth. If all memory of him were lost or destroyed, the spirit too would perish, initiating the much-dreaded \"second death,\" a total obliteration from which there could be no return. This act against Hatshepsut was an attempt to 'condemn her to oblivion - a fate worse than death for an Egyptian.' Thus the extermination of Hatshepsut's image from the earth was indeed a drastic step: the removal of her spirit from its perpetual existence in the afterlife. Such reprisal seems far too severe to fit the motive of mere sexism.\" (Amenhotep II and the Historicity of the Exodus Pharaoh, Douglas Petrovich).\n\n9. Defacing and erasure of Senenmut (or Senmut) by Thutmoses III in 1446:\n\nSenmut was a man: Senmut literally means, \"mother's brother\" which fits well with an older trusted servant. The statue (right) in the Louvre museum shows Senmut as a male. You can see his nipple. Important women in Egypt, like women today, wear tops! So that settles it. There are no bearded statues of a topless Hatshepsut with nipples showing. These show her bearded but fully clothed with obvious breasts under her shirt. The inscription on the stone says: \"Neferure: daughter of Pharaoh.\"\n\na. Thutmoses III not only ordered the erasure of all images of Hatshepsut, but also to a man known in history as \"Senenmut\".\n\nb. Senmut was one of Hatshepsut's most trusted advisers. Perhaps he was seen by Thutmoses III, as being a contributor to the exodus disaster that came upon Egypt.\n\nc. Thutmoses III was a baby when his father died and he inherited the throne, since Moses had very recently fled to Midian. This explains why Hatshepsut ruled as co-regent with her stepson, Thutmoses III for 21 years until her death.\n\nd. The Cairo museum has a statue of \"Senmut\" with a baby's head in front. (below left) Senmut was an elderly man whom Hatshepsut trusted. He is often pictured with Neferure (daughter of Pharaoh) as a child. This is the correct interpretation. Being an old man, it may be that Senmut was Hatshepsut's nurse, as well as Thutmoses III's and Neferure's (Hatshepsut daughter).\n\ne. Wild Speculation and Fiction:\n\nMyth #1: In the statues, the adult is Hatshepsut and the child is Moses.\n\nMyth #2: Neferure = Hatshepsut = Nefure.\n\nMyth #3: Hatshepsut did not have a daughter named Neferure. Neferure is Hatshepsut.\n\nMyth #4: Senmut = Moses = Hatshepsut Xnem Amen = Thutmoses II.\n\nMyth #5: The statues memorializes baby Moses under the care of the daughter of Pharaoh.\n\nMyth #6: Moses actually became Pharaoh with the title Thutmoses II.\n\nf. Facts: In the statues, the adult is Senmut and the child is Neferure. Neferure was the daughter of Hatshepsut. The name Nefure is never applied to Hatshepsut but is a fictional invention. Hatshepsut married Thutmoses II not Moses. However, because it is a fact that Hatshepsut wore a fake beard and took on the male persona later in her reign, some mistakenly believe the adult in the statue is her, not the male servant Senmut (or Senenmut). These two statues are not of a \"fake bearded Hatshepsut\" (aka Neferure) and the baby is Senmut, which is another name for Moses.\n\ng. Senmut remained single his whole life, (probably because he was a eunuch), disappeared mysteriously and his tomb was unfinished. This fueled the speculation that Senmut is Moses who also unmarried before he fled Egypt for Midian at age 40.\n\nh. The adult in these two statues is Senmut, a trusted steward of Queen Hatshepsut, and Thutmoses III defaced his statues because of Senenmut's obvious close role he played in association with Hatshepsut. Senmut is not Moses, Neferure is not Hatshepsut. However, it is entirely possible that Senmut, being Hatshepsut's \"mother’s brother\", was the official \"eunuch guardian\" that cared for Hatshepsut as a baby and later Moses, Thutmoses III and Neferure!\n\ni. Thutmoses III defaced both Hatshepsut and Senmut statues and wanted to erase them both from history as a direct result of the exodus in 1446 BC.\n\nE. Amenhotep II: Second born son who survived the 10th plague (1431-1406 BC)\n\n1. Amenhotep II was \"second born\" son of Thutmoses III:\n\na. Thutmoses III is confirmed as the pharaoh of the exodus in that his firstborn son \"Amenemhat\" by Queen Merytre-Hatshepsut died in the 10th plague but his second born son, Amenhotep II survived the 10th plague and succeeded Thutmoses III on the throne.\n\ni. Thutmoses III’s firstborn son Amenemhat by was killed by the tenth plague.\n\nii. In the providence of God, it is well documented that Amenhotep II, was Thutmoses III's second born son by Queen Satiah, who became Pharaoh in 1431 BC.\n\nb. Low vs. high Egyptian chronology:\n\ni. Using low Egyptian chronology, Amenhotep II survived the 10th plague in 1446 BC, then died exactly 40 years later when Joshua crossed the Jordan in 1406 BC! He survived death the year the slaves left Egypt and died the year the runaway slaves became a nation with land of their own!\n\nii. Using high Egyptian chronology, those who wrongly believe Amenhotep II was the pharaoh of the exodus, have no evidence that his firstborn son died in the 10th plague of 1446 BC. In other words, we are 100% sure that Amenhotep II was not firstborn and 0% sure that Amenhotep II’s own firstborn son died before he did.\n\n2. Amenhotep II: Replacement Slaves in 9th year conquest of 1422 BC\n\na. While Amenhotep II makes a poor choice as the pharaoh of the exodus, he had one successful campaign into Canaan year 9, 1422 BC, when Israel was at Kadesh Barnea year 22. Amenhotep II had to go on a raid to replenish 3 million lost Hebrew slaves 22 years earlier because of the exodus. Amenhotep II records his capture of 101,128 slaves in Canaan during his 9th year campaign in 1422 BC. In truth, the year 9 campaign was more about refueling a devastated nation, rather than a truly powerful display of military might like that of his father, Thutmoses III.\n\nb. The Memphis Stela documents Amenhotep II's two campaigns. The first into Syria in year 7 (May 15, 1424 BC), and the second into Canaan and Edom in Year 9 (Nov 15, 1422 BC). However, the Amada Stela and Elephantine Stela both indicate the first campaign happened in year 3 (July 4, 1428 BC). In year 9 (1422 BC), Amenhotep II signed a peace treaty with the king of Mitanni. Strangely, the total number of slaves captured in the stela is 89,600, but the sum of the individual numbers add up to 101,128 slaves.\n\ni. \"A record of the plunder that his majesty carried off: 127 princes of Retenu; 179 brothers of princes; 3,600 Apiru [or Habiru Hebrews at Kadesh Barnea]; 15,200 Shasu; 36,300 Kharu; 15,070 Nagasuites/Neges; 30,652 of their family members; total: 89,600 people, and their endless property likewise; all their cattle and endless herds; 60 chariots of silver and gold; 1,032 painted chariots of wood; 13,500 weapons for warfare.\" (Amenhotep II, Memphis Stela, 2nd campaign, year 9, 1422 BC)\n\nc. The capture of 3600 Habiru (Hebrews) in 1422 BC occurred year 24 of the exodus and year 22 at Kadesh Barnea. The 3600 men were likely deserters from Kadesh Barnea who had complained to Moses. The Bible records more than once, that Israel mutinied Moses and started marching back to Egypt. Evidently 3600 of these Hebrews got their wish and were once again enslaved in Egypt by Amenhotep II. Good riddance!\n\ni. \"We remember the fish which we used to eat free in Egypt, the cucumbers and the melons and the leeks and the onions and the garlic, but now our appetite is gone. There is nothing at all to look at except this manna.\" Numbers 11:5-6.\n\nii. \"So they said to one another, \"Let us appoint a leader and return to Egypt.” (Numbers 14:4)\n\nF. Amarna Tables document the conquest of Joshua in 1406 BC\n\nThe Amarna Tablets (1404 - 1341 BC) More: Amarna Tablets which chronicle the conquest of Joshua Tablet EA 286: \"The Habiru are now capturing the fortresses of the Pharaoh. Not a single governor remains among them to my lord the King: all have perished. Zimrida of Lachish has been killed. May the King send help. Lo, if no reinforcements come this year, all the countries of my lord the King will be utterly destroyed. ... The land of the King is lost to the Habiru. And now indeed a city of the territory of Jerusalem, Bet-Ninib, has been captured. ... After taking the city of Rubuda, they are now attempting to take Jerusalem... , What have I done against my lord the King, that thou lovest the Habiru, and hatest the governors? ... The Habiru have wasted all the territory of the King', and so on.\" (Amarna Tablet, A Letter from Abdu-Heba of Jerusalem, EA 286) Tablet EA 276: \"They are now attempting to take Jerusalem. ... Gezer, Ashkelon, and Lachish have given oil, food, and supplies to the Habiru. ... Labaya and the land of Shechem have given all to the Habiru.\" (Amarna Tablet, A Letter from Abdu-Heba of Jerusalem, EA 287)\n\n1. The 382 Amarna Letters represent one of the greatest archeological proofs that the conquest under Joshua of the promised land is true.\n\na. The Amarna Letters fully document the Habiru (Hebrews) conquest of Canaan by Joshua starting in 1406 BC.\n\nThe Amarna tablets are a second record of the conquest from Egyptian and Canaanite cuneiform tablets written in Akkadian Babylonian.\n\nc. A broader date for the Amarna tablets is 1404 - 1340 BC (64 years). They cannot be any earlier than the beginning of the conquest of the Judah (1404 BC) or any later when Amarna was destroyed in the second year of King Tut (1340 BC). These dates represent the outer limits and the actual period of the Amarna letters is likely shorter than 64 years.\n\n2. David Rohl destroys this powerful synchronism with the conquest by shifting the date for the Amarna tablets and Akhenaten to the time of king Saul of Judah.\n\na. During the time of Saul and David the promised land was under the control of the Philistines not Egypt.\n\nb. In the Bible narrative of Saul, David and Solomon, Egypt is never even mentioned at a combatant.\n\nc. In Rohl’s chronology, the mass Philistines immigration into Canaan did not occur until the 8th year of Ramesses III which he misdates to 916 BC.\n\nd. Rohl believes Ramesses II is the same person as Shishak of the Bible (945-924 BC) who attacked Jerusalem in 925 BC and died in 924 BC.\n\ne. This means that the Philistines did not mass migrate into Canaan until 916 BC (8th year of Ramesses III).\n\nf. Rohl therefore cannot use the Amarna tablets to document the conquest of Joshua. Rohl has Saul fighting the Egyptian control of Canaan as seen in the Amarna Tablets but Egypt is not mentioned in the Bible even once during the reign of Saul or David in any way. The Bible shows Saul’s main enemy was the Philistines where David killed Goliath, yet according to Rohl, this was 100 years before the Philistines arrived in large numbers after the death of Solomon in 924 BC.\n\n3. The Hebrew conquest of Canaan under the command of Joshua took exactly eight years to complete (1407-1399 BC) but it wasn't until 1404 BC that Joshua began the conquest of southern Israel, followed by the conquest of northern Israel.\n\na. Aaron died on the 1st day of the 5th month of the 40th year of the wilderness wandering (summer 1407 BC). Shortly after mourning Aaron for 30 days, the people left Mount Hor, defeated the Transjordan nations, and then mourned for Moses 30 days. They crossed the Jordan on the 10th day of the 1st month of the 41st year (spring, 1406 BC), four days before the 41st Passover, which was exactly 40 years to the day they left Goshen. They started counting sabbatical years and Jubilee after crossing the Jordan. (Num 33:38; 20:28; Deut 34:8; Josh 4:19; 5:10)\n\nb. From Josh 14:10 we know that Caleb was given Hebron 45 years after Moses promised it to him. This corresponded with year 5 after crossing the Jordan in 1406 BC. Caleb possessed Hebron in 1401 BC.\n\nc. “Now behold, the Lord has let me live, just as He spoke, these forty-five years, from the time that the Lord spoke this word to Moses, when Israel walked in the wilderness; and now behold, I am eighty-five years old today.\" (Joshua 14:10)\n\n4. A cry for Egypt to send military help:\n\na. The letters are correspondence between the city kings of Canaan to pharaoh in Egypt where they beg pharaoh to send troops to defend against the invading Hebrews. There is no evidence that Egypt ever sent any troops as requested but remained a distant observer as Joshua conquered Canaan.\n\nb. Collectively, the Amarna tablets tell the story of how the local Canaanite population first begged Egypt for help, then betrayed and deceived each other for survival and committed treason by surrendering to the Hebrews.\n\nc. Most of the local Canaanites were killed by the invading “Habiru”.\n\n5. In a breathtaking confirmation of the conquest of Joshua the cities of Jerusalem, Shechem, Gezer, Ashkelon, Lachish and others are mentioned by name in the Amarna Tablets.\n\n6. One tablet exactly agrees with the Bible in that Shechem was taken early \"given all to the Habiru\" and other tablets confirm that the unconquered cities of Jerusalem, Gezer, Ascalon, and Lachish had started to pay tribute: \"given oil, food, and supplies to the Habiru\".\n\na. Jerusalem was taken in a later stage after the death of Joshua: \" Now it came about after the death of Joshua that the sons of Israel inquired of the Lord, saying, \"Who shall go up first for us against the Canaanites, to fight against them? ... Then the sons of Judah fought against Jerusalem and captured it and struck it with the edge of the sword and set the city on fire.\" Judges 1:1,8\n\nb. Ashkelon was taken in a later stage after the death of Joshua: \"And Judah took Gaza with its territory and Ashkelon with its territory and Ekron with its territory.\" Judges 1:18\n\nc. Gezer was not immediately captured: \"But they did not drive out the Canaanites who lived in Gezer, so the Canaanites live in the midst of Ephraim to this day, and they became forced laborers.\" Joshua 16:10\n\n7. Complete list of conquered cities in the Amarna Tablets:\n\nBible city name Amarna city name City mayor/king Acco Akka Satatna & Surata Aijalon Ayyaluna Ammiya Arka Irqata Aduna Arvad Island Arwada, Ruad Ashkelon Ashqeluna Yidya Ashtaroth Astartu Biridashwa & Ayyab ? Batruna ? Berothai, Berothah Beirut, Biruta, Berytus Ammunira Cypress Alashiya Damascus Dimaški Biryawaza Gammad Kumidu, Gammadim, Gammatites Gaza Hazzatu Yahtiru Gebal Byblo, Gubla Rib-Hadda Gezer Gazru Milkilu & Yapahu Hamath Lapana, Ematu Teuwatti/Tiwati Hazor Hasura Abdi-Tirshi Hebron Qiltu (might be Keilah) Shuwardata Jerusalem Jerusalem Abdi-heba Joppa Yapu Kadesh on the Orontes Qidsu, Qissa, Qinsa Etakkama/Aituamma Keilah Qiltu (Might be Hebron) Shuwardata Kenath Qana, Nobah Lachish Lakisha Zimredda & Shipti-bala Megiddo Magidda Biridiya Qatna Mishrefeh Akizzi Shechem Sakmu Labayu Sidon Siduna Zimredda Shiloh Silu Yaptih-Hadda Sumur Simyra, Zemar Taanach Tahnaka Tunip Tunip Aki-Teššup Tyre Surru Abi-Milku Ugarit Ugaritu Niqm-Adda II ? Muhhazu ?\n\nG. The conversion of Akhenaten to monotheism\n\n1. One of the most stunning events in religious history is the conversion of Akhenaten to monotheism in 1358 BC.\n\n2. Akhenaten became Pharaoh in 1358 BC only 2 years before Joshua died in 1356 BC. He reigned 17 years and died in 1341 BC.\n\na. Akhenaten was very aware of the power of the Hebrew God which demanded monotheistic worship.\n\nb. As Pharaoh, he knew how the 10 plagues of Moses had destroyed Egypt.\n\nc. He would know how the Hebrews had crossed the Red Sea on dry ground through 300-meter-high walls of water on either side, which came crashing down to drown Egypt's entire military.\n\nd. It was clear to Akhenaten the monotheistic God of the Hebrews was superior to the polytheistic pantheon of Egyptian gods.\n\ne. Akhenaten could clearly see that monotheism was superior to polytheism.\n\nf. Akhenaten converted to monotheism by worshipping the sun god, \"Aten\".\n\n3. Akhenaten's conversion to monotheism (sun worship) is a stunning marker unparalleled in Egyptian history and only the exodus and conquest can explain it.\n\nConclusion:\n\nThe evidence that Thutmoses III was the Pharaoh of the exodus is overwhelming. The only other possible candidate might be Amenhotep II, his son, but he pales against the towering stature of his father in all ways. Pharaoh who killed Hebrew children: Amunhotep I: 1532-1511 BC Pharaoh's Daughter who adopted Moses: Hatshepsut: 1526 BC Pharaoh of Moses' flight to Midian: Thutmoses II + Hatshepsut: 1498-1485 BC Pharaoh of the Exodus: Thutmoses III: 1485/1464 - 1431 BC The Bible is quite clear that the exodus happened in 1446 BC.\n\nBy Steve Rudd: Contact the author for comments, input or corrections.\n\n\n\n\n\nGo To Start: WWW.BIBLE.CA"}, {"url": "https://www.marcus-parve.com/en/thutmosis-iii-pharaoh-of-the-XNUMXth-dynasty/", "page_content": "Thutmose III, sixth pharaoh of the 1479th Dynasty, reigned from 1425 to XNUMX BC He is often considered one of the greatest rulers of ancient Egypt, due to his many military campaigns and expansion territorial.\n\nYouth and accession to the throne\n\nThutmose III was the son of Thutmose II and a secondary wife, Isis. When his father died, he was still too young to reign, and his stepmother Hatshepsut assumed the regency, then proclaimed herself pharaoh. Thutmose III acceded to the throne on the death of Hatshepsut in 1479 BC.\n\nMilitary campaigns\n\nThe reign of Thutmose III was marked by his numerous military campaigns, which earned him the nickname of “Egyptian Napoleon”. He led more than 17 expeditions to West Asia, expanding the Egyptian empire from Syria to Sudan. His conquests strengthened Egyptian control over trade routes and ensured the country's prosperity.\n\nAdministration and reforms\n\nThutmose III was also an able administrator. He consolidated and extended the Egyptian administration in the conquered territories, while ensuring a centralization of power. He also reformed the clergy, especially that of Amun, reasserting royal authority over religious institutions.\n\nProlific builder\n\nAs pharaoh, Thutmose III was a great builder. He ordered the construction of many temples and monuments, notably at Karnak, where he had the great pylon and several obelisks built. He is also responsible for many constructions in Medinet Habou, Heliopolis and Memphis.\n\nDeath and posterity\n\nThutmose III died after a reign of 54 years and was buried in the Valley of the Kings, in a tomb designated under the number KV34. He was succeeded by his son, Amenhotep II. The period of Thutmose III is considered the height of New Kingdom Egypt, and its military and architectural legacy lives on today.\n\nIn summary, Thutmose III is one of the most emblematic pharaohs of ancient Egypt, due to his military successes, his territorial expansion and his work as a builder. He left behind a powerful and prosperous empire, which marked the history of New Kingdom Egypt."}, {"url": "https://egyptholidaytravel.com/king-thutmose-iii-eighteenth-dynasty/", "page_content": "Thutmose III (variously also spelt Tuthmosis or Thothmes)\n\nHistory of Thutmose III\n\n____________________\n\nwas the sixth pharaoh of the Eighteenth Dynasty. Officially, Thutmose III ruled Egypt for almost 54 years and his reign is usually dated from 24 April 1479 BC to 11 March 1425 BC, from the age of two and until his death at age fifty-six; however, during the first 22 years of his reign, he was coregent with his stepmother and aunt, Hatshepsut, who was named the pharaoh. While he was shown first on surviving monuments, both were assigned the usual royal names and insignia and neither is given any obvious seniority over the other. Thutmose served as the head of Hatshepsut’s armies.[dubious – discuss] During the final two years of his reign, he appointed his son and successor, Amenhotep II, as his junior co-regent. His firstborn son and heir to the throne, Amenemhat, predeceased Thutmose III. Becoming the sole ruling pharaoh of the kingdom after the deaths of Thutmose II and Hatshepsut, he created the largest empire Egypt had ever seen; no fewer than 17 campaigns were conducted and he conquered lands from the Niya Kingdom in northern Syria to the Fourth Cataract of the Nile in Nubia. When Thutmose III died, he was buried in the Valley of the Kings, as were the rest of the kings from this period in Egypt. Names : Thutmose’s two main names transliterate as mn-ḫpr-rˁ ḏḥwty-ms. They are normally realised as Menkheperra Djehutymes, meaning “Eternal are the manifestations of Ra, Born of Thoth”\n\nFamily\n\nThutmose III had several wives:\n\nDates and length of reign\n\nThutmose’s military campaigns\n\nFirst Campaign\n\nTours of Canaan and Syria\n\nTours of Canaan and Syria\n\nAttack on Mitanni\n\nTours of Syria\n\nNubian Campaign\n\nMonumental construction\n\nArtistic developments\n\nKarnak\n\nTomb\n\nDefacing of Hatshepsut’s monuments\n\nDeath and burial\n\nMummy\n\nThutmose III was the son of Thutmose II by a secondary wife, Iset. His father’s great royal wife was Queen Hatshepsut. Her daughter, Neferure, was Thutmose’s half-sister. When Thutmose II died, Thutmose III was too young to rule. Hatshepsut became his regent, soon his co-regent, and shortly thereafter declared herself to be the pharaoh while never denying kingship to Thutmose III. Thutmosis III had little power over the empire while Hatshepsut exercised the formal titulary of kingship. Her rule was quite prosperous and marked by great advancements. When Thutmose III reached a suitable age and demonstrated the capability, she appointed him to head her armies.-Satiah: She may have been the mother of his firstborn son, Amenemhat. An alternative theory is that the boy was the son of Neferure. Amenemhat predeceased his father. -Merytre-Hatshepsut. Thutmose’s successor, the crown prince and future king Amenhotep II, was the son of Merytre-Hatshepsut. Additional children include Menkheperre and daughters named Nebetiunet, Meryetamun (C), Meryetamun (D) and Iset. Merytre-Hatshepsut was the daughter of the divine adoratrice Huy. -Nebtu: she is depicted on a pillar in Thutmose III’s tomb. -Menwi, Merti, Menhet, three foreign wives. -Neferure: Thutmose III may have married his half-sister, but there is no conclusive evidence for this marriage. It has been suggested that Neferure, instead of Satiah, may have been the mother of AmenemhatThutmose III reigned from 1479 BC to 1425 BC according to the Low Chronology of Ancient Egypt. This has been the conventional Egyptian chronology in academic circles since the 1960s, though in some circles the older dates 1504 BC to 1450 BC are preferred from the High Chronology of Egypt. These dates, just as all the dates of the Eighteenth Dynasty, are open to dispute because of uncertainty about the circumstances surrounding the recording of a Heliacal Rise of Sothis in the reign of Amenhotep I. A papyrus from Amenhotep I’s reign records this astronomical observation which theoretically could be used to perfectly correlate the Egyptian chronology with the modern calendar; however, to do this the latitude where the observation was taken must also be known. This document has no note of the place of observation, but it can safely be assumed that it was taken in either a Delta city, such as Memphis or Heliopolis, or in Thebes. These two latitudes give dates 20 years apart, the High and Low chronologies, respectively. The length of Thutmose III’s reign is known to the day thanks to information found in the tomb of the military commander Amenemheb-Mahu. Amenemheb-Mahu records Thutmose III’s death to his master’s 54th regnal year, on the 30th day of the third month of Peret. The day of Thutmose III’s accession is known to be I Shemu day four, and astronomical observations can be used to establish the exact dates of the beginning and end of the king’s reign (assuming the low chronology) from 24 April 1479 BC to 11 March 1425 BC respectively..Widely considered a military genius by historians, Thutmose III conducted at least 15 campaigns in 20 years. He was an active expansionist ruler, sometimes called Egypt’s greatest conqueror or “the Napoleon of Egypt.” He is recorded to have captured 350 cities during his rule and conquered much of the Near East from the Euphrates to Nubia during seventeen known military campaigns. He was the first pharaoh after Thutmose I to cross the Euphrates, doing so during his campaign against Mitanni. His campaign records were transcribed onto the walls of the temple of Amun at Karnak and are now transcribed into Urkunden IV. He is consistently regarded as one of the greatest of Egypt’s warrior pharaohs who transformed Egypt into an international superpower by creating an empire that stretched from the Asian regions of southern Syria and Canaan to the east, to Nubia to the south. Whether the Egyptian empire covered even more areas is even less certain. The older Egyptologists, most recently Ed. Meyer, believed that Thutmosis had also subjected the islands of the Aegean Sea. This can no longer be upheld today. A submission of Mesopotamia is unthinkable; and whether the tributes of Alashia (Cyprus) were more than occasional gifts remains questionable. In most of his campaigns, his enemies were defeated town by town until being beaten into submission. The preferred tactic was to subdue a much weaker city or state one at a time resulting in surrender of each fraction until complete domination was achieved. Much is known about Thutmosis “the warrior” not only because of his military achievements, but also because of his royal scribe and army commander, Thanuny, who wrote about his conquests and reign. Thutmose III was able to conquer such a large number of lands because of the revolution and improvement in military weapons. When the Hyksos invaded and took over Egypt with more advanced weapons, such as horse-drawn chariots, the people of Egypt learned to use these weapons. Thutmose III encountered little resistance from neighbouring kingdoms, allowing him to expand his realm of influence easily. His army also carried boats on dry land. These campaigns are inscribed on the inner wall of the great chamber housing the “holy of holies” at the Karnak Temple of Amun. These inscriptions give the most detailed and accurate account of any Egyptian king .When Hatshepsut died on the 10th day of the sixth month of Thutmose III’s 21st year, according to information from a single stela from Armant, the king of Kadesh advanced his army to Megiddo. Thutmose III mustered his own army and departed Egypt, passing through the border fortress of Tjaru (Sile) on the 25th day of the eighth month. Thutmose marched his troops through the coastal plain as far as Jamnia, then inland to Yehem, a small city near Megiddo, which he reached in the middle of the ninth month of the same year. The ensuing Battle of Megiddo probably was the largest battle of Thutmose’s 17 campaigns. A ridge of mountains jutting inland from Mount Carmel stood between Thutmose and Megiddo and he had three potential routes to take.The northern route and the southern route, both of which went around the mountain, were judged by his council of war to be the safest, but Thutmose, in an act of great bravery (or so he boasts, but such self-praise is normal in Egyptian texts), accused the council of cowardice and took a dangerous route through the Aruna mountain pass, which he alleged was only wide enough for the army to pass “horse after horse and man after man.” Despite the laudatory nature of Thutmose’s annals, such a pass does indeed exist, although not as narrow as Thutmose indicates, and taking it was a brilliant strategic move since when his army emerged from the pass they were situated on the plain of Esdraelon, directly between the rear of the Canaanite forces and Megiddo itself. For some reason, the Canaanite forces did not attack him as his army emerged, and his army routed them decisively. The size of the two forces is difficult to determine, but if, as Redford suggests, the amount of time it took to move the army through the pass may be used to determine the size of the Egyptian force, and if the number of sheep and goats captured may be used to determine the size of the Canaanite force, then both armies were around 10,000 men. Most scholars believe that the Egyptian army was more numerous. According to Thutmose III’s Hall of Annals in the Temple of Amun at Karnak, the battle occurred on “Year 23, I Shemu [day] 21, the exact day of the feast of the new moon”, a lunar date. This date corresponds to 9 May 1457 BC based on Thutmose III’s accession in 1479 BC. After victory in battle, his troops stopped to plunder the enemy and the enemy was able to escape into Megiddo.Thutmose was forced to besiege the city, but he finally succeeded in conquering it after a siege of seven or eight months (see Battle of Megiddo (15th century BC)). This campaign drastically changed the political situation in the ancient Near East. By taking Megiddo, Thutmose gained control of all of northern Canaan and the Syrian princes were obligated to send tribute and their own sons as hostages to Egypt. Beyond the Euphrates, the Assyrian, Babylonian and Hittite kings all gave Thutmose gifts, which he alleged to be “tribute” when he recorded it on the walls of Karnak. The only noticeable absence is Mitanni, which would bear the brunt of the following Egyptian campaigns into Western Asia.Thutmose’s second, third and fourth campaigns appear to have been nothing more than tours of Syria and Canaan to collect tribute. Traditionally, the material directly after the text of the first campaign has been considered to be the second campaign. This text records tribute from the area which the Egyptians called Retjenu (roughly equivalent to Canaan) and it was also at this time that Assyria paid a second “tribute” to Thutmose III. It is probable that these texts come from Thutmose’s 40th year or later and thus have nothing to do with the second campaign at all. If so, no records of this campaign have been found. Thutmose’s third campaign was not considered significant enough to appear in his otherwise extensive Annals at Karnak. A survey was made of the animals and plants he found in Canaan, which was illustrated on the walls of a special room at Karnak. This survey is dated to Thutmose’s 25th year. No record remains of Thutmose’s fourth campaign, but at some point a fort was built in lower Lebanon and timber was cut for construction of a processional barque, and this probably fits best during this time frame.The fifth, sixth and seventh campaigns of Thutmose III were directed against the Phoenician cities in Syria and against Kadesh on the Orontes. In Thutmose’s 29th year, he began his fifth campaign, where he first took an unknown city (the name falls in a lacuna) which had been garrisoned by Tunip. He then moved inland and took the city and territory around Ardata; the town was pillaged and the wheatfields burned. Unlike previous plundering raids, Thutmose III garrisoned the area known as Djahy, which is probably a reference to southern Syria. This permitted him to ship supplies and troops between Syria and Egypt. Although there is no direct evidence for it, it is for this reason that some have supposed that Thutmose’s sixth campaign, in his thirtieth year, commenced with a naval transportation of troops directly to Byblos, bypassing Canaan entirely. After the troops arrived in Syria by whatever means, they proceeded into the Jordan River valley and moved north, pillaging Kadesh’s lands. Turning west again, Thutmose took Simyra and quelled a rebellion in Ardata, which apparently had rebelled again. To stop such rebellions, Thutmose began taking hostages from the cities in Syria. The cities in Syria were not guided by the popular sentiment of the people so much as they were by the small number of nobles who were aligned to Mitanni: a king and a small number of foreign Maryannu. Thutmose III found that by taking family members of these key people to Egypt as hostages, he could drastically increase their loyalty to him. Syria rebelled again in Thutmose’s 31st year and he returned to Syria for his seventh campaign, took the port city of Ullaza and the smaller Phoenician ports and took more measures to prevent further rebellions. All the excess grain which was produced in Syria was stored in the harbors he had recently conquered and was used for the support of the military and civilian Egyptian presence ruling Syria. This left the cities in Syria desperately impoverished. With their economies in ruins, they had no means of funding a rebellion.After Thutmose III had taken control of the Syrian cities, the obvious target for his eighth campaign was the state of Mitanni, a Hurrian country with an Indo-Aryan ruling class. However, to reach Mitanni, he had to cross the Euphrates River. He sailed directly to Byblos and made boats which he took with him over land on what appeared to otherwise be just another tour of Syria, and he proceeded with the usual raiding and pillaging as he moved north through the lands he had already taken. He continued north through the territory belonging to the still unconquered cities of Aleppo and Carchemish and quickly crossed the Euphrates in his boats, taking the Mitannian king entirely by surprise. It appears that Mitanni was not expecting an invasion, so they had no army of any kind ready to defend against Thutmose, although their ships on the Euphrates did try to defend against the Egyptian crossing. Thutmose III then went freely from city to city and pillaged them while the nobles hid in caves, or at least this is the typically ignoble way Egyptian records chose to record it. During this period of no opposition, Thutmose put up a second stele commemorating his crossing of the Euphrates next to the stele his grandfather, Thutmose I, had put up several decades earlier. A militia was raised to fight the invaders, but it fared very poorly. Thutmose III then returned to Syria by way of Niy, where he records that he engaged in an elephant hunt. He collected tribute from foreign powers and returned to Egypt in victory.Thutmose III returned to Syria for his ninth campaign in his 34th year, but this appears to have been just a raid of the area called Nukhashshe, a region populated by semi-nomadic people. The plunder recorded is minimal, so it was probably just a minor raid. Records from his 10th campaign indicate much more fighting. By Thutmose’s 35th year, the king of Mitanni had raised a large army and engaged the Egyptians around Aleppo. As usual for any Egyptian king, Thutmose boasted a total crushing victory, but this statement is suspect due to the very small amount of plunder taken. Thutmose’s annals at Karnak indicate he only took a total of 10 prisoners of war. He may have fought the Mitannians to a stalemate, yet he did receive tribute from the Hittites after that campaign, which seems to indicate the outcome of the battle was in Thutmose’s favor. The details about his next two campaigns are unknown. His 11th is presumed to have happened in his 36th regnal year and his 12th is presumed to have happened in his 37th year since his 13th is mentioned at Karnak as happening in his 38th regnal year. Part of the tribute list for his 12th campaign remains immediately before his 13th begins, and the contents recorded, specifically wild game and certain minerals of uncertain identification, might indicate that it took place on the steppe around Nukhashshe, but this remains mere speculation. In his 13th campaign, Thutmose returned to Nukhashshe for a very minor campaign. His 14th campaign, waged during his 39th year, was against the Shasu. The location of this campaign is impossible to determine since the Shasu were nomads who could have lived anywhere from Lebanon to the Transjordan to Edom. After this campaign, the numbers given by Thutmose’s scribes to his campaigns all fall in lacunae, so they can only be counted by date. In his 40th year, tribute was collected from foreign powers, but it is unknown if this was considered a campaign (i.e. if the king went with it or if it was led by an official). Only the tribute list remains from Thutmose’s next campaign, and nothing may be deduced about it except that it was probably another raid to the frontiers around Niy. His final Asian campaign is better documented. Sometime before Thutmose’s 42nd year, Mitanni apparently began spreading revolt among all the major cities in Syria. Thutmose moved his troops by land up the coastal road and put down rebellions in the Arka plain (“Arkantu” in Thutmose’s chronicle) and moved on Tunip. After taking Tunip, his attention turned to Kadesh again. He engaged and destroyed three surrounding Mitannian garrisons and returned to Egypt in victory.His victory in this final campaign was neither complete nor permanent since he did not take Kadesh, and Tunip could not have remained aligned to him for very long, certainly not beyond his own death.Thutmose’s last campaign was waged in his 50th regnal year. He attacked Nubia, but only went so far as the fourth cataract of the Nile. Although no king of Egypt had ever penetrated so far with an army, previous kings’ campaigns had spread Egyptian culture that far already, and the earliest Egyptian document found at Gebel Barkal dates from three years before Thutmose’s campaign.Thutmose III was a great builder and constructed over 50 temples, although some of these are now lost and only mentioned in written records. He also commissioned the building of many tombs for nobles, which were made with greater craftsmanship than ever before. His reign was also a period of great stylistic changes in the sculpture, paintings and reliefs associated with construction, much of it beginning during the reign of Hatshepsut.Thutmose’s architects and artisans showed great continuity with the formal style of previous kings, but several developments set him apart from his predecessors. Although he followed the traditional relief styles for most of his reign, after his 42nd year he began having himself depicted wearing the red crown of Lower Egypt and a šndyt-kilt, an unprecedented style. Architecturally, his use of pillars also was unprecedented. He built Egypt’s only known set of heraldic pillars, two large columns standing alone instead of being part of a set supporting the roof. His jubilee hall was also revolutionary and is arguably the earliest known building created in the basilica style. Thutmose’s artisans achieved new heights of skill in painting, and tombs from his reign were the earliest to be entirely painted instead of painted reliefs. Although not directly pertaining to his monuments, it appears that Thutmose’s artisans had learned glass making skills, developed in the early 18th Dynasty, to create drinking vessels by the core-formed method.Thutmose dedicated far more attention to Karnak than any other site. In the Iput-isut, the temple proper in the center, he rebuilt the hypostyle hall of his grandfather Thutmose I, dismantled the red chapel of Hatshepsut, built Pylon VI, a shrine for the bark of Amun in its place, and built an antechamber in front of it, the ceiling of which was supported by his heraldic pillars. He built a temenos wall around the central chapel containing smaller chapels, along with workshops and storerooms. East of the main sanctuary, he built a jubilee hall in which to celebrate his Sed festival. The main hall was built in basilica style with rows of pillars supporting the ceiling on each side of the aisle. The central two rows were higher than the others to create windows where the ceiling was split. Two of the smaller rooms in this temple contained the reliefs of the survey of the plants and animals of Canaan which he took in his third campaign. East of the Iput-Isut, he erected another temple to Aten, where he was depicted as being supported by Amun. It was inside this temple that Thutmose planned on erecting his tekhen waty, or “unique obelisk.” The tekhen waty was designed to stand alone instead as part of a pair and is the tallest obelisk ever successfully cut. It was not, however, erected until Thutmose IV raised it 35 years later. It was later moved to Rome by Emperor Constantius II and is now known as the Lateran Obelisk. In 390 AD, Christian Roman Emperor Theodosius I re-erected another obelisk from the Temple of Karnak in the Hippodrome of Constantinople, now known as the Obelisk of Theodosius. Thus, two obelisks of Tuthmosis III’s Karnak temple stand in Papal Rome and in Caesaropapist Constantinople, the two main historical capitals of the Roman Empire. Thutmose also undertook building projects to the south of the main temple between the sanctuary of Amun and the temple of Mut. Immediately to the south of the main temple, he built the seventh pylon on the north-south road which entered the temple between the fourth and fifth pylons. It was built for use during his jubilee and was covered with scenes of defeated enemies. He set royal colossi on both sides of the pylon and put two more obelisks on the south face in front of the gateway. The eastern obelisk’s base remains in place, but the western obelisk was transported to the Hippodrome in Constantinople. Farther south along the road, he put up Pylon VIII, which Hatshepsut had begun. East of the road, he dug a sacred lake of 250 by 400 feet and placed another alabaster bark shrine near it. He commissioned royal artists to depict his extensive collections of fauna and flora in the Botanical garden of Thutmosis III.Thutmose’s tomb (KV34) was discovered by Victor Loret in 1898 in the Valley of the Kings. It uses a plan which is typical of 18th Dynasty tombs, with a sharp turn at the vestibule preceding the burial chamber. Two stairways and two corridors provide access to the vestibule, which is preceded by a quadrangular shaft or “well”. A complete version of Amduat, an important New Kingdom funerary text, is in the vestibule, making it the first tomb where Egyptologists found the complete text. The burial chamber, which is supported by two pillars, is oval-shaped and its ceiling decorated with stars, symbolizing the cave of the deity Sokar. In the middle lies a large red quartzite sarcophagus in the shape of a cartouche. On the two pillars in the middle of the chamber there are passages from the Litanies of Re, a text that celebrates the later sun deity, who is identified with the pharaoh at this time. On the other pillar is a unique image depicting Thutmosis III being suckled by the goddess Isis in the guise of the tree. The wall decorations are executed in a simple “diagrammatic” way, imitating the manner of the cursive script one might expect to see on a funerary papyrus rather than the more typically lavish wall decorations seen on most other royal tomb walls. The colouring is similarly muted, executed in simple black figures accompanied by text on a cream background with highlights in red and pink. The decorations depict the pharaoh aiding the deities in defeating Apep, the serpent of chaos, thereby helping to ensure the daily rebirth of the sun as well as the pharaoh’s own resurrection.Until recently, a general theory has been that after the death of her husband Thutmose II, Hatshepsut ‘usurped’ the throne from Thutmose III. Although Thutmose III was a co-regent during this time, early historians have speculated that Thutmose III never forgave his stepmother for denying him access to the throne for the first two decades of his reign. However, in recent times this theory has been revised after questions arose as to why Hatshepsut would have allowed a resentful heir to control armies, which it is known she did. This view is supported further by the fact that no strong evidence has been found to show Thutmose III sought to claim the throne. He kept Hatshepsut’s religious and administrative leaders. Added to this is the fact that the monuments of Hatshepsut were not damaged until at least 25 years after her death, late in the reign of Thutmose III when he was quite elderly. He was in another coregency, this one with his son, who would become Amenhotep II, who is known to have attempted to identify the works of Hatshepsut as his own. Additionally, Thutmose III’s mortuary temple was built directly next to Hatshepsut’s, an act that would have been unlikely to occur if Thutmose III bore a grudge against her. After her death, many of Hatshepsut’s monuments and depictions were subsequently defaced or destroyed, including those in her famous mortuary temple complex at Deir el-Bahri. Traditionally, these have been interpreted by early modern scholars to be evidence of acts of damnatio memoriae (condemning a person by erasure from recorded existence) by Thutmose III. However, recent research by scholars such as Charles Nims and Peter Dorman has re-examined these erasures and found that the acts of erasure which could be dated only began some time during year 46 or 47 of Thutmose’s reign (c. 1433/2 BC). Another often overlooked fact is that Hatshepsut was not the only one who received this treatment. The monuments of her chief steward, Senenmut, who was closely associated with her rule, were similarly defaced where they were found. All of this evidence casts serious doubt upon the popular theory that Thutmose III ordered the destruction in a fit of vengeful rage shortly after his accession. Currently, the purposeful destruction of the memory of Hatshepsut is seen as a measure designed to ensure a smooth succession for the son of Thutmose III, the future Amenhotep II, as opposed to any of the surviving relatives of Hatshepsut who had an equal or better claim to the throne. It also may be likely that this measure could not have been taken until the deaths of powerful religious and administrative officials who had served under both Hatshepsut and Thutmose III. Later, Amenhotep II even claimed that he had built the items he defaced .According to the American Egyptologist Peter Der Manuelian, a statement in the tomb biography of an official named Amenemheb establishes that Thutmose III died in Year 54, III Peret day 30 of his reign after ruling Egypt for “53 years, 10 months and 26 days” (Urk. 180.15). Thutmose III died one month and four days shy of the start of his 54th regnal year. When the co-regencies with Hatshepsut and Amenhotep II are deducted, he ruled alone as pharaoh for just over 30 of those years.Thutmose III’s mummy was discovered in the Deir el-Bahri Cache above the Mortuary Temple of Hatshepsut in 1881. He was interred along with those of other 18th and 19th Dynasty leaders Ahmose I, Amenhotep I, Thutmose I, Thutmose II, Ramesses I, Seti I, Ramesses II and Ramesses IX, as well as the 21st Dynasty pharaohs Pinedjem I, Pinedjem II and Siamun. While it is popularly thought that his mummy originally was unwrapped by Gaston Maspero in 1886, it was in fact first unwrapped by Émile Brugsch, the Egyptologist who supervised the evacuation of the mummies from the Deir el-Bahri Cache in 1881. It was unwrapped soon after its arrival in the Boulak Museum while Maspero was away in France, and the Director General of the Egyptian Antiquities Service ordered the mummy re-wrapped. So when it was “officially” unwrapped by Maspero in 1886, he almost certainly knew it was in relatively poor condition. The mummy had been damaged extensively in antiquity by tomb robbers and its wrappings subsequently cut into and torn by the Rassul family, who had rediscovered the tomb and its contents only a few years before. Maspero’s description of the body provides an idea as to the magnitude of the damage done: His mummy was not securely hidden away, for towards the close of the 20th dynasty it was torn out of the coffin by robbers, who stripped it and rifled it of the jewels with which it was covered, injuring it in their haste to carry away the spoil. It was subsequently re-interred, and has remained undisturbed until the present day; but before re-burial some renovation of the wrappings was necessary, and as portions of the body had become loose, the restorers, in order to give the mummy the necessary firmness, compressed it between four oar-shaped slips of wood, painted white, and placed, three inside the wrappings and one outside, under the bands which confined the winding-sheet. Of the face, which was undamaged, Maspero says the following: Happily the face, which had been plastered over with pitch at the time of embalming, did not suffer at all from this rough treatment, and appeared intact when the protecting mask was removed. Its appearance does not answer to our ideal of the conqueror. His statues, though not representing him as a type of manly beauty, yet give him refined, intelligent features, but a comparison with the mummy shows that the artists have idealised their model. The forehead is abnormally low, the eyes deeply sunk, the jaw heavy, the lips thick, and the cheek-bones extremely prominent; the whole recalling the physiognomy of Thûtmosis II, though with a greater show of energy. Maspero was so disheartened at the state of the mummy and the prospect that all of the other mummies were similarly damaged (as it turned out, few were in so poor a state) that he would not unwrap another for several years. Unlike many other examples from the Deir el-Bahri Cache, the wooden mummiform coffin that contained the body was original to the pharaoh, though any gilding or decoration it might have had had been hacked off in antiquity. In his examination of the mummy, the anatomist Grafton Elliot Smith stated the height of Thutmose III’s mummy to be 1.615m (5 ft. 3.58in.), but the mummy was missing its feet, so Thutmose III was undoubtedly taller than the figure given by Smith. The mummy of Thutmose III now resides in the Royal Mummies Hall of the Cairo Museum, catalog number 61068."}]}