{"John Loder started his career in the music industry in the 1920s.": [{"url": "https://www.theguardian.com/news/2005/aug/19/guardianobituaries.artsobituaries", "page_content": "I first met the sound engineer and record producer John Loder in about 1968. He was on an acid trip and seemed to be talking out of the top of his head. The next time I met him he was straight and made a lot more sense. We soon found that we shared. a common interest in Jimi Hendrix, Frank Zappa, John Coltrane, and KarlHeinz Stockhausen. When we got bored with them, we would play birdsong forwards and Bach backwards.\n\nBy 1970 John, who has died aged 59, and I were working together in Exit, an avant-garde outfit. I was the percussionist, playing an amplified bicycle wheel, and he was using an ancient one-track tape-recorder discovered in a friend's attic; primitive, but it was the beginning of what was to become John's lifework.\n\nFinanced by a brief spell as a mini-cab driver, by 1972 John had cobbled together an innovatory multi-track sound system, first used as a part of the wildly ambitious avant-garde International Carnival of Experimental Sound (ICES 72). By the time Exit disbanded in 1974, John had accumulated enough equipment to build a recording studio in the small garage of his north London home.\n\nDuring the next three years we lost touch, but by 1977 he was recording advertising jingles - which he didn't enjoy - and I had cofounded the band Crass, which I enjoyed thoroughly. From then on the ball started to rock and roll. As \"the ninth member of the band\", John became our recording engineer and financial manager: the music was bad and so was the money, but it was fun.\n\nWithin a couple of years Crass albums were dominating the alternative charts, and John's garage had become Southern Studios. In 1979 we created Crass Records and, despite marketing our first single for 45p against John's warning that every copy would lose us 3p, we made money.\n\nWe were in business, and from the outset it was clear that the music industry was not well pleased; John was a maverick, a DIY champion who didn't play the game. In his philosophy, beautiful came before big: to the last he drove a wreck of an old van, and never considered moving his garage studio to a more \"desirable\" location.\n\nLikewise, attempts to buy him out failed, just as media attempts to denigrate Crass had no effect on its growing popularity. Crass Records became the label that every aspiring punk band looked to, Southern Studios their destination, and John their engineer of choice.\n\nThroughout that time, with scores of bands being released on the label, no contract was ever signed and no paperwork ever thrust in faces. It was all done on trust, a principle that John held dear throughout his life. And it was John's managerial, production and engineering skills which were to assist the likes of Crass, Bjork, Chumbawamba, Fugazi, Shellac, The Jesus And Mary Chain, Slint and Babes In Toyland into the public domain,\n\nBorn near Plymouth, educated at a boarding school that he didn't like, John studied electrical engineering at London's City University. Details of his early history are brief because he didn't like talking about himself. John was one of those people who appears to have been born on their 20th birthday.\n\nFor every band that made it on to Crass Records, 10 were turned away. Crass's ideology was uncompromising and, as John felt, many good bands were losing the chance of public exposure. As a response, in partnership with his artist wife Sue, he created several labels and Southern Distribution, to ensure that they found a market. Aided by a small team to whom John was devoted, Southern grew into the international force that it is today.\n\nJohn resisted many attempts over the years to rein him in; as other independents collapsed, Southern survived, as majors conglomerated and became increasingly bland, Southern remained a vibrant voice in the wilderness. When bands got too big for their boots or managers began to burn his ears, John would suggest they go elsewhere. In the truest sense, Southern was a cottage industry, it placed people before profit.\n\nMedia requests for interviews with John always drew a blank, he displayed a reticence which extended even to his closest friends. For that reason very few people were aware that during the last 18 months he had been battling with a brain tumour which finally killed him.\n\nBut just as John's studio has become legendary, so has his insistence that quality of product should come before quantity: his angle, small is beautiful, was the big idea.\n\nHe is survived by his wife, Sue, and daughter, Natasha.\n\n· John Loder, record producer, born April 7 1946; died August 12 2005."}, {"url": "https://www.allmusic.com/artist/john-loder-mn0000238526/biography", "page_content": "Producer and engineer John Loder founded the landmark Southern Studios and its accompanying record label and distribution network, all potent forces in the emergence and continued longevity of post-punk. Born April 7, 1946, outside of Plymouth, England, Loder briefly studied electrical engineering at London's City University, but music was his obsession -- in particular experimental and avant-garde recordings -- and in 1970 he began collaborating with the avant outfit Exit. With earnings saved from a short tenure driving a taxi, by 1972 Loder had assembled his own multi-track sound system, and two years later opened a recording studio in the garage of his North London home.\n\nHe spent the mid-'70s writing and recording advertising jingles, but in 1977 crossed paths with fellow Exit alum Penny Rimbaud, who in the interim co-founded the punk group Crass. Soon Loder was installed as the band's recording engineer and financial adviser, and with a few additional improvements his garage was officially opened as Southern Studios. With Rimbaud, he also founded Crass Records, and the staunch D.I.Y. ethics of studio and label alike -- no contracts or paperwork, just handshake deals and mutual trust -- earned enormous respect from punk artists and fans.\n\nOver the years to follow, Loder created several additional labels and also Southern Distribution to ensure a home and retail channels for worthy bands that might otherwise go unnoticed. His production and managerial portfolio ultimately swelled to include a who's who of underground acts including Björk, the Jesus and Mary Chain, Fugazi, Shellac, and Slint, and despite the music industry's trend towards consolidation, the Southern empire remained as fiercely independent as its owner. After battling a brain tumor, Loder died August 12, 2005, at the age of 59."}, {"url": "https://archive.org/details/78_johann-strauss-his-story-and-his-music-side-4_johann-strauss-john-loder-vox-symph_gbia0082795d", "page_content": "Writer: Johann Strauss\n\nPerformer: John Loder; Vox Symphony\n\nMusic Master Series.\n\nDigitized at 78 revolutions per minute. Four stylii were used to transfer this record. They are 3.5mil truncated eliptical, 2.3mil truncated conical, 2.8mil truncated conical, 3.3mil truncated conical. These were recorded flat and then also equalized with Turnover: 375.0, Rolloff: -12.0.\n\nThe preferred versions suggested by an audio engineer at George Blood, L.P. have been copied to have the more friendly filenames.\n\nMatrix number: VX-259 S4\n\nCatalog number: VX 259 S-4\n\nOther IDs from the record include: Album 259; Side 4"}, {"url": "https://www.celebsagewiki.com/john-loder", "page_content": "Age, Biography and Wiki\n\nJohn Loder (John Muir Lowe) was born on 3 January, 1898 in London, England, UK, is an Actor. Discover John Loder's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of John Loder networth?\n\nPopular As John Muir Lowe Occupation actor Age 90 years old Zodiac Sign Capricorn Born 3 January 1898 Birthday 3 January Birthplace London, England, UK Date of death 26 December, 1988 Died Place London, England, UK Nationality UK\n\nWe recommend you to check the complete list of Famous People born on 3 January. He is a member of famous Actor with the age 90 years old group.\n\nJohn Loder Height, Weight & Measurements\n\nAt 90 years old, John Loder height is 6' 3\" (1.91 m) .\n\nPhysical Status Height 6' 3\" (1.91 m) Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is John Loder's Wife?\n\nHis wife is Alba Julia Lagomarsino (22 September 1958 - 1972) ( divorced) ( 1 child), Evelyn Auff Mordt (23 November 1949 - 1955) ( divorced), Hedy Lamarr (27 May 1943 - 17 July 1947) ( divorced) ( 2 children), Micheline Cheirel (26 June 1936 - 1941) ( divorced) ( 1 child), Sophie Kabel (? - ?) ( divorced) ( 1 child)\n\nFamily Parents Not Available Wife Alba Julia Lagomarsino (22 September 1958 - 1972) ( divorced) ( 1 child), Evelyn Auff Mordt (23 November 1949 - 1955) ( divorced), Hedy Lamarr (27 May 1943 - 17 July 1947) ( divorced) ( 2 children), Micheline Cheirel (26 June 1936 - 1941) ( divorced) ( 1 child), Sophie Kabel (? - ?) ( divorced) ( 1 child) Sibling Not Available Children Not Available\n\nJohn Loder Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is John Loder worth at the age of 90 years old? John Loder’s income source is mostly from being a successful Actor. He is from UK. We have estimated John Loder's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nJohn Loder Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.britannica.com/biography/John-Legend", "page_content": "John Legend, byname of John Roger Stephens, (born December 28, 1978, Springfield, Ohio, U.S.), American singer-songwriter and pianist who achieved success in the early 21st century with his fusion of R&B and soul music. He also was a sought-after session musician. Legend was the first African American man to win all four major North American entertainment awards (EGOT: Emmy, Grammy, Oscar, and Tony).\n\nStephens was born into a musically gifted working-class family. His mother directed a church choir, while his grandmother played organ and his father and brother played drums at the church. He took piano lessons and sang in the church choir as a child. His parents homeschooled him for several of his elementary-school years. After he graduated from high school, he attended the University of Pennsylvania (B.A., 1999). He then moved to New York City, working for the Boston Consulting Group by day and playing piano and singing in nightclubs; he sold self-produced CDs (John Stephens [2000] and Live at Jimmy’s Uptown [2001]) at those appearances. In 2001 he was introduced to the up-and-coming producer Kanye West and began contributing keyboard music and backing vocals to tracks by other artists, among them Alicia Keys, Talib Kweli, and the Black-Eyed Peas. During that time he adopted the stage name John Legend.\n\nBritannica Quiz 2010s Music Quiz\n\nLegend worked on West’s debut album as a rap musician, The College Dropout (2004). After West formed his own label (G.O.O.D. Records) with Sony Music, the first album he produced was Legend’s major-label debut, Get Lifted, released in the final week of 2004. Buoyed by the ballad “Ordinary People,” the album rose up European and American popular-music and rhythm-and-blues charts. It garnered eight Grammy Award nominations and won for best R&B album and best male R&B vocal performance. In addition, Legend took the award for best new artist. His sophomore effort, Once Again (2006), won plaudits as well as Legend’s second Grammy for best male R&B vocal performance (for the single “Heaven”). Legend was a cowinner (with Joss Stone and Van Hunt) of the award for best R&B performance by a duo or group with vocals for their rendition of the Sly and the Family Stone song “Family Affair” on the tribute album Different Strokes by Different Folks.\n\nLegend’s popularity continued with his 2008 studio release, Evolver. His 2010 collaboration with the Roots, Wake Up!, won three Grammys—best R&B album, best traditional R&B vocal performance (“Hang On in There”), and best R&B song (“Shine”). In 2013 his album Love in the Future yielded the smash hit single “All of Me.” The following year Legend and rapper Common recorded the gospel-influenced song “Glory,” written by them for the film Selma (2014). The song, which invokes a call to end racial injustice, won both a Golden Globe Award and an Academy Award for best original song. Legend’s fifth studio album, Darkness and Light (2016), yielded the hit song “Love Me Now” and featured collaborations with Chance the Rapper, Miguel, and Brittany Howard of Alabama Shakes. Bigger Love appeared in 2020, and it later won a Grammy for best R&B album.\n\nIn 2017 Legend coproduced August Wilson’s Jitney on Broadway, and he received a Tony Award when the drama was named best play revival. The following year Legend played the title role in a well-received live telecast of the 1970 rock opera Jesus Christ Superstar. As a coproducer, he garnered a Creative Arts Emmy Award when the show won for best live variety special. With that honour, he completed his EGOT. In 2019 Legend became a coach on the televised singing competition The Voice.\n\nLegend also won praise for his philanthropic efforts, in particular his work to improve educational opportunities in poor communities."}, {"url": "https://www.findagrave.com/memorial/8735635/john-loder", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.nesta.org.uk/team/john-loder/", "page_content": "John is an investment director in Nesta’s Impact Investments team, leading our work to back ventures that align with the healthy life mission.\n\nJohn started his investment career at Merrill Lynch, before moving to become a founding partner at the investment fund Corin Capital. After a decade in the City, John moved to The Young Foundation, working on supporting and catalyzing innovation in healthcare. He then moved to Nesta, where before joining the impact investment team he led on digital health strategy as well as contributing to a variety of programmes supporting innovators and influencing thinking and policy in health.\n\nJohn is a board director for Nesta investments Third Space Learning and Oomph, and Observer for Skin Analytics and ProFinda. He is a trustee of the Swaziland Charitable Trust and oversees a small hill farm in the borders of Scotland."}, {"url": "https://www.musicindustryhowto.com/songs-from-the-1920s/", "page_content": "The 1920s often get overlooked when it comes to music. But songs from the 1920s were a combination of styles, from jazz and blues to classical. As a result, many popular songs of the 1920s remain well-known, and many of those we forget deserve remembering.\n\nHere are some of the most popular songs of the 1920s.\n\n“Rhapsody in Blue” by George Gershwin\n\nYear:1924\n\nPaul Whitman commissioned ‘Rhapsody in Blue' from George Gershwin. Musically it's a fascinating piece because Gershwin blends the conventions of classical music theory with nascent jazz.\n\nAudiences loved it, but critics were ambivalent. Despite this, ‘Rhapsody in Blue' cemented Gershwin in musical history and became the soundtrack for the developing Jazz Age.\n\n“Ain't Misbehavin'” by Fats Waller\n\nYear: 1929\n\n‘Ain't Misbehavin” sounds as cheeky and playful as the title suggests. In Fats Waller's hands, it comes alive with daring improvisations and harmonies.\n\nWaller debuted his composition in Harlem for an all-black revue called ‘Hot Chocolate.' Originally Margaret Simms and Paul Bass sang the piece, but it also became an instrumental staple. Famously, Louis Armstrong turned it into an unforgettable trumpet solo.\n\n“Ol' Man River” by Paul Whiteman\n\nYear: 1928\n\n‘Ol' Man River' began life as a musical number in ‘Showboat.' Jerome Kern wrote the music, and Oscar Hammerstein wrote the lyrics.\n\n‘Ol' Man River' is memorable for its ponderous bass opening. As sung by Paul Whiteman, it has the richness and smoothness of dark chocolate.\n\nLater, Kern's music contrasts this legato verse with a sprightly banjo, the beloved instrument of the 1920s.\n\nAs you listen, pay attention to the lyrics. ‘Showboat' proved musicals could have serious subjects. The sentiment comes through in the music, and ‘Ol Man River' is no exception.\n\n“Bye Bye Blackbird” by Gene Austin\n\nYear: 1926\n\nThe first thing you notice listening to Gene Austin's famous version of ‘Bye Bye Blackbird' is that it begins with an introduction that often gets omitted in modern recordings.\n\nThe song was composed by Ray Henderson, and the lyrics are by Mort Dixon.\n\nNot only was ‘Bye Bye Blackbird' one of the most popular songs of the 1920s, but it became a cultural touchstone. Listeners will recognize it from films and television series like:\n\nTenko\n\nPeaky Blinders\n\nThe History Boys\n\n“Charleston” by Arthur Gibbs\n\nYear: 1923\n\nAnother of the most memorable songs from the 1920s is ‘Charleston.' It first appeared in the Broadway musical ‘Running Wild.' Cecil Mack wrote the words, and James P Johnson set them to music, inspired by the stride piano approach to jazz.\n\nIn this fusion of jazz and ragtime, the left-hand plays a ragtime rhythm and feel while the right hand improvises a melody.\n\n“Sweet Georgia Brown” by Ben Bernie\n\nYear:1925\n\nAccording to Ben Bernie, his inspiration for the jazz standard ‘Sweet Georgia Brown' came from a meeting with George Thaddeus Brown, who explained that he named his daughter Georgia for the state she was born in.\n\nBernie cited this anecdote as the source of both music and lyrics, despite the song's words being attributed to Maceo Pinkard.\n\nIts popularity remains ongoing, and jazz artists still cover ‘Sweet Georgia Brown' when they want to reinvent the musical wheel.\n\n“In the Jailhouse Now” by Jimmie Rodgers\n\nYear:1928\n\n‘In The Jailhouse Now' has a long and colorful history as a vaudeville act. It became a popular song in the 1920s thanks to Jimmie Rodgers, who sang it while playing the banjo.\n\nThe other distinctive quality of Rodgers' rendition of ‘In the Jailhouse Now' is his signature yodel.\n\nThe Soggy Bottom Brothers immortalized ‘In The Jailhouse Now' for posterity when they sang it in ‘O Brother, Where Art Thou?'\n\n“Dark Was the Night” by Blind Willie Johnson\n\nYear:1927\n\nWhat's immediately noticeable about ‘Dark Was the Night' is its use of slide guitar instead of the popular banjo.\n\n‘Dark Was the Night' takes its name from a hymn. And while Johnson sang and played at street corners or in mission halls, this blues-gospel hybrid is primarily instrumental. The most vocalization it has is Johnson's close-mouthed humming on the melody line.\n\n“Swanee” by Al Jolson\n\nYear: 1920\n\nWhen it comes to songs of the 1920s, it's impossible not to talk about ‘Swanee.' George Gershwin wrote it in 1919, and when Al Jolson sang it in 1920, it quickly became one of the most popular songs of the 1920s.\n\nSuddenly everyone knew about ‘Swanee.' One of the most distinctive features is the bird calls that play during the bridge. They're bright, cheerful, and contrast with the fast-paced melody.\n\nIt's best known to Australians as the music behind the Sydney Swans Rules of Football Club advertising campaign.\n\n“West End Blues” by Louis Armstrong\n\nYear: 1928\n\n‘West End Blues' is a blues composition by Jo Oliver. It uses the 12-bar blues chord progression. Originally it was instrumental, but Clarence Williams later gave it words.\n\nOther standout features of the Louis Armstrong version of ‘West End Blues' include the use of:\n\nHand symbols\n\nScat singing\n\nTrumpet cadenza\n\nThis opening cadenza is one of Armstrong's defining moments in his career. It's musically fluid and flexible in a way that anticipates the jazz of the 30s and 40s. Remarkably, the inspiration for the cadenza came from a trumpet exercise drill that Armstrong then improvised.\n\n“Makin' Whoopee” by Eddie Cantor\n\nYear:1929\n\nNot all 1920s songs come from the early 20s. For example, late in the decade, ‘Makin' Whoopee' soared to popularity as sung by Eddie Cantor.\n\nMuch of its popularity hinges on the song's playfulness. It's a jazz-blues blend that playfully warns men of the perils and pitfalls of marriage. The recurring phrase “Makin' Whoopee” was a way to talk about intimate romantic relationships and avoid the music censors.\n\nToday this popular song from the 1920s is remembered in the euphemistic phrase ‘Makin' whoopee,' which is still used euphemistically to talk about sex without being explicit.\n\nIn addition to Eddie Cantor, other famous artists who sang this song include:\n\nBing Crosby\n\nElla Fitzgerald\n\nDoris Day\n\nThe King Cole Trio\n\n“Dardanella” by Ben Selvin\n\nYear: 1920\n\nBen Selvin first recorded ‘Dardanella' in 1919. Its popularity was such that he re-recorded it in 1920, and it became the first song to sell over three million copies.\n\nThis popular 1920s song was such a success that unauthorized recordings began appearing, despite copyright warnings in local magazines.\n\nOther famous versions of this popular song from the 1920s include renditions by:\n\nHenry Burr\n\nPrince's Orchestra\n\nHarry Raderman\n\n“Black and Tan Fantasy” by Duke Ellington\n\nYear: 1927\n\nNo list of songs of the 1920s would be complete without a recording by Duke Ellington. ‘Black and Tan Fantasy' was one of Ellington's many jazz compositions.\n\nWhile many of these were dance tunes, that's not the case with ‘Black and Tan Fantasy.' Instead, it's jungle jazz and showcases a particular African culture more expressive than dance music.\n\nIt was a staple at musical institutions like the Cotton Club, where it played an integral role in floor shows.\n\n“Stardust” by Hoagy Carmichael\n\nYear: 1927\n\nYou can't talk about 1920s songs without mentioning Hoagy Carmichael's ‘Stardust.'\n\nCarmichael discovered jazz at university, and in ‘Stardust,' he created one of the jazz standards of the age. With Michael Parish's help, he gave the song lyrics.\n\nIts popularity continued well past the 1920s. People were still singing this popular 1920s song in the 40s. Noteworthy performances include:\n\nDuke Ellington\n\nArt Tatum\n\nFats Waller\n\nElla Fitzgerald\n\n“Yes, We Have No Bananas” by Ben Selvin\n\nYear: 1923\n\nOf all the 1920s songs on this list, ‘Yes We Have No Bananas' has the most fascinating history. Frank Silver and Irving Cohen wrote it after noticing the distinctive cadence of a Grecian fruit seller.\n\nBut this popular 1920s song quickly outgrew its humble origins. Because of its secular lyrics, it became the theme song for the outdoor relief protests in Belfast, where it uniquely united Catholics and Protestants.\n\nIt also became the anthem of British citizens faced with banana rationing during World War Two.\n\nDespite its novelty origins, keen musical observers can hear several famous melodies in this song, including:\n\nThe Hallelujah Chorus\n\nMy Bonnie Lies Over the Ocean\n\nI Dreamed I Dwelt In Marble Halls\n\nSeeing Nellie Home\n\nAn Old-Fashioned Garden\n\n“Dinah” by Ethel Waters\n\nYear: 1925\n\nHarry Akst and Sam M. Lewis wrote ‘Dinah' in 1925. Ethel Waters was the first to sing it, using it as her introduction to the Plantation Club.\n\nIt gave Waters her start on Broadway and later became a musical number in ‘Kid Boots.'\n\nIn addition to Waters, other famous versions of the song came from:\n\nCliff Edwards\n\nThe Revelers\n\nFanny Rose Shore\n\nShore's version was so ubiquitous that, in light of this 1920s song, she became known as ‘Dinah Shore.' The name stuck and remained her stage name for the rest of Shore's career.\n\n“April Showers” by Al Jolson\n\nYear:1921\n\nFrom its opening chords, this popular song of the 1920s is lyric and romantic. Al Jolson sings a smooth, legato version with an orchestra to swoon to.\n\nLouis Silvers and B.G. De Sylva wrote the song. Jolson premiered the song in the musical Bombo, and it soon became one of his signature songs.\n\nPerhaps because of its overt sentimentality, ‘April Showers' was also a popular song in the 1920s to parody. Of these, the best-known features lyrics by Spike Jones and Doodles Weaver.\n\nMemorably, the song was an integral part of a Morcombe and Wise skit that featured the comedians taking turns to douse each other with water.\n\nThe fun was had by more than comedians. In 1953, a judge sang ‘April Showers' after resolving a case between an orchestra and its leader.\n\n“It Had to Be You” by Isham Jones\n\nYear: 1924\n\nAnother song for your list of popular 1920s songs is ‘It Had to Be You.' Isham Jones wrote the song in 1924, and the original version is instrumental.\n\nHowever, lyrics were written for it by Gus Kahn.\n\nIn a testament to the popularity of this song from the 1920s, it was featured in various film and television programs, including:\n\nA Slight Case of Murder\n\nCasablanca\n\nDoctor Who\n\n“St Louis Blues” by Louis Armstrong\n\nYear:1929\n\nYou can't miss the bold, brassy opening of this popular 1920s song. Louis Armstrong's virtuosic trumpet playing immediately stands out, as does his singing when he takes over the vocal line.\n\nW. C. Handy wrote ‘St Louis Blues' in 1914. It was one of the first blues songs there was. Today, it remains a popular jazz standard. In addition to Armstrong, notable performances include those by:\n\nCab Calloway\n\nCount Basie\n\nGlenn Miller\n\nBoston Pops Orchestra\n\n“Louise” by Maurice Chevalier\n\nYear: 1929\n\nNot all songs of the 1920s featured jazz or blues harmonies. ‘Louise' is an example of this. It's a lilting, melodic song.\n\nThe gently swung rhythm gives the music momentum and keeps it harmonically interesting.\n\nMaurice Chevalier performed it first in the 1929 film Innocents of Paris and is immediately recognizable for his distinctive voice.\n\n“Some of These Days” by Sophie Tucker\n\nYear: 1926\n\nShelton Brooks wrote ‘Some of These Days' in 1910. But it was Sophie Tucker who turned it into a popular song of the 1920s.\n\nTucker heard the song in 1910 and realized it had the potential to be a musical hit. She recorded the song on a wax cylinder. When history proved her right about the popularity of ‘Some of These Days,' Ted Lewis and his orchestra accompanied Tucker on her famous 1926 recording.\n\nThe song was Tucker's signature piece, and she sang it often throughout her career.\n\n“Always” by Vincent Lopez\n\nYear: 1926\n\nIrving Berlin wrote ‘Always' for his wife in 1926, which explains the swooping sentimentality of the orchestration.\n\nThe romance and musical accessibility of ‘Always' ensured it was one of the songs of the 1920s that everyone could and did sing.\n\nHowever, most listeners will recognize it because of Noel Coward's wickedly clever appropriation of this popular favorite as a musical plot point in his play, ‘Blithe Spirit.'\n\nInstead of being the loving serenade Berlin doubtless intends, Coward turns ‘Always' into the promise protagonist Charles Condomine's wife makes to him from beyond the grave. And when she successfully murders his second wife, she joins the ghostly persecution.\n\n“Valencia” by Paul Whiteman\n\nYear: 1926\n\nUnlike other 1920s songs we've discussed, ‘Valencia' is a pasodoble or Spanish military march. It's this that gives the music its cut-time pace and musical momentum.\n\nThe lyrics were originally Spanish, but when the silent film Valencia made it one of the popular songs of the 1920s, it acquired English lyrics, too.\n\n“I'll See You In My Dreams” by Isham Jones\n\nYear:1924\n\nThis is another of the songs of the 1920s composed collaboratively by Isham Jones and Gus Khan. Like other 1920s songs, it has a noticeably long introduction before the words come in.\n\nThis intro style is common in 1920s music because dancing was still integral to how people met and socialized. You can hear this in the fast tempo of the music, which is perfect for the fast-paced dances of the time.\n\n“Three O'clock in the Morning” by Paul Whiteman\n\nYear: 1922\n\nSpeaking of dancing, ‘Three O'clock in the Morning' is a waltz by Julián Robledo. You can hear the lilting up-down of the dance cadence on the third beat of each bar.\n\nDespite belonging to an older dance tradition than some of the songs of the 1920s on this list, when Paul Whiteman recorded it in 1922, it was tremendously popular. It was such a success it was one of the first recordings to sell over a million copies.\n\nDon't forget to listen for the Westminster Quarters that opens and closes the song.\n\nBest Songs From The 1920s, Final Thoughts\n\nThe popular songs of the 1920s vary from jazz to blues to lyrical, sentimental songs you can dance to. All hearken back to a fascinating time in musical history. Classical music was giving way to jazz, and musicians were becoming increasingly adventurous with their compositions.\n\nWhile some of the songs of the 1920s have faded into obscurity, the ones that survive endure for a reason."}, {"url": "https://www.npr.org/2019/09/27/765163037/john-legend-on-the-music-industry-his-career-politics-and-balancing-it-all", "page_content": "John Legend On The Music Industry, His Career, Politics And Balancing It All\n\nEnlarge this image Courtesy of John Legend Courtesy of John Legend\n\nLately, John Legend seems to be one of the busiest people in the entertainment business. Apart from making music, in the past few years he has been all over TV, starring in NBC's live Jesus Christ Superstar broadcast and producing multiple shows, including a new hip-hop competition show for Netflix. On top of it all, Legend remains engaged in political conversations and philanthropic causes. He sat down with Sam Sanders to talk about balancing it all and where his career has taken him.\n\nEditor's note: This podcast includes language some listeners may find offensive.\n\nInterview Highlights\n\nOn Rhythm + Flow, the new hip-hop competition show he's working on for Netflix\n\nI think the content is already fresh because it's hip-hop, and we haven't had that before. We've seen so many variations of the singing shows, and I understand why they work. Part of the formula for the singing shows is that you're singing covers, so you're singing songs that are already familiar but [with] unfamiliar voices.\n\nThe challenge of doing a hip-hop show is that it's a lot of original material the audience has never heard before, and so they're being judged not only on their performance and their ability to perform in front of a crowd, but also on their writing ability. And I think it really works for Netflix because it's not network television. There aren't the same kind of restrictions around what can be said, and there's a lot more edginess that is allowed on Netflix.\n\nOn the growing platform for hip-hop across different kinds of media\n\nFor a long time the network system and the traditional media outlets were afraid to touch certain things, afraid to be edgy in certain areas. And some of it has an overlay of racism and fear of marginalized people having centrality in these systems — but I think part of it was also just fear of whatever reaction they might get from the audience. And having to be mainstream, having to appeal to as broad an audience as possible, I think it psyched a lot of these networks out and made them afraid to take risks.\n\nBut now we're in a landscape where there are so many different outlets for marginalized voices that just didn't exist before, and because of that, we're being able to prove ourselves and show that our ideas are creatively exciting and also can sell really well.\n\nOn playing piano on Lauryn Hill's \"Everything Is Everything\"\n\nWhile I was in college — and even before I went to college — I was a choir director. So in high school I was doing that at my home church in Ohio, and then once I moved to Pennsylvania I started driving up every weekend to this church in Scranton, Pa., which I connected with due to a family friend from Ohio. One of the choir members was an artist and singer-songwriter named Tara Michel, and we became friends. And she happened to have grown up with Lauryn Hill.\n\nLauryn invited her to come out to the studio in Jersey where she was recording the Miseducation album. One time I drove Tara to the studio, and obviously she wanted me to drive her out there but she also wanted me to meet Lauryn and possibly get a chance to show her what I could do. During one of the breaks when they were writing \"Everything Is Everything,\" Tara said, \"John, why don't you play a couple songs for Lauryn?\" So I sang one original song for her, and I sang a Stevie Wonder song, \"Love's in Need [of Love Today].\" She was like, \"Why don't you play on this song we're working on right now?\" [So] I played on \"Everything Is Everything.\" I didn't know if that was going to make the album — I didn't know anything. But a few months later, I got a call from Columbia Records asking how to spell my name for the credits, and so that's when I knew I was on the album. And I got a little $500 check.\n\nOn engaging in political activism\n\nI've always thought of myself as a very political person, even as a child. When I would go to the library, I would choose to read about Dr. King. I would choose to read about the struggle. I would choose to read about people who fought for justice. That's always been inspiring to me. I've always thought about my role as an artist and someone with influence as a special gift that gives me the opportunity to speak out about these things.\n\nI wrote an essay when I was 15 years old; it was a McDonald's essay competition for Black History Month. It was called \"future black history makers,\" and the prompt was basically, \"How will you make black history?\" I said I was going to do it by becoming a famous artist and using my success to fight for justice. I'm living that 25 years later.\n\nOn the state of the music industry now versus when he released his first record\n\nIt's never been the same when it comes to actually buying physical copies of music. I don't even buy physical copies of albums anymore. I'm not really saddened by it, because I love the fact that I can stream anything I want to listen to. ... I think that's great for music. I think that's great for listeners. I think that more music gets listened to because of that. But I think the downside is that we still have to make sure everyone in the industry gets compensated well — that writers can still survive and studio musicians can still survive, and that all these other people who are part of the musical ecosystem can still make a living off streaming revenue.\n\nOn the current listenership for hip-hop and R&B\n\nI think hip-hop is doing just fine. There's just fewer, more narrow outlets for R&B, whereas when I first started out, I think hip-hop and R&B were more on closer to equal footing. When I was growing up in the '90s, that was definitely the case. Now in the competition for black music ears, hip-hop is more dominant, and it limits the opportunities for R&B to be as prominent and dominant in the zeitgeist.\n\nThis episode was produced by Anjuli Sastry and edited by Alexander McCall. It was adapted for the Web by Alexander McCall."}, {"url": "https://en.wikisource.org/wiki/Dictionary_of_National_Biography,_1885-1900/Loder,_John_David", "page_content": "​LODER, JOHN DAVID (1788–1846), violinist, a member of a musical family long resident in Bath, the son of John Loder (d. 1795 at Weymouth), musician, was born at Bath in 1788. He was at the head of his profession in Bath for many years, leading the band of the theatre, and giving concerts in association with Sir George Smart from 1823, and others. After 1826, when Loder was soloist at the Gloucester musical festival, he was leader at the Three Choirs festivals until 1845. He subsequently resided in London, became professor of the Royal Academy of Music, and a principal violin, 1840, succeeding Cramer as leader, 1845, at the Ancient Concerts. Loder also led at the Philharmonic and other concerts. His thorough knowledge of orchestral and chamber music caused his services to be especially sought in the performance of new and intricate works. He was a successful teacher of the violin and viola, and the author of a standard work of instruction for the violin, 1814, one more elementary than the foreign class-books hitherto employed, and more methodical than the compilations of Geminiani and Barthélémon. The 'Instruction Book' passed through many editions, one of the most recent being edited by Carrodus in 1884.\n\nLoder died at Albany Street, Regent's Park, on 13 Feb. 1846, in his fifty-eighth year. He left a widow, five sons—of whom three, Edward James [q. v.], John Fawcett, and William, were established musicians— and two daughters.\n\nLoder supplemented his (1) 'General and Comprehensive Instruction Book for the Violin,' 1814, by (2) 'A First Set of Three Duets for two Violins,' 1837, and (3) 'The whole Modern Art of Bowing,' 1842.\n\nLoder's second son, John Fawcett Loder (1812-1853), violinist, born in 1812, played in London orchestras. He took the viola in Dando's quartet from 1842 till 1853 (Grove, Dict. of Mus. i. 429). He died suddenly in Hawley Crescent, London, on 16 April 1853."}], "John Loder worked as a sound engineer for the British branch of the Columbia Graphophone Company.": [{"url": "https://www.theguardian.com/news/2005/aug/19/guardianobituaries.artsobituaries", "page_content": "I first met the sound engineer and record producer John Loder in about 1968. He was on an acid trip and seemed to be talking out of the top of his head. The next time I met him he was straight and made a lot more sense. We soon found that we shared. a common interest in Jimi Hendrix, Frank Zappa, John Coltrane, and KarlHeinz Stockhausen. When we got bored with them, we would play birdsong forwards and Bach backwards.\n\nBy 1970 John, who has died aged 59, and I were working together in Exit, an avant-garde outfit. I was the percussionist, playing an amplified bicycle wheel, and he was using an ancient one-track tape-recorder discovered in a friend's attic; primitive, but it was the beginning of what was to become John's lifework.\n\nFinanced by a brief spell as a mini-cab driver, by 1972 John had cobbled together an innovatory multi-track sound system, first used as a part of the wildly ambitious avant-garde International Carnival of Experimental Sound (ICES 72). By the time Exit disbanded in 1974, John had accumulated enough equipment to build a recording studio in the small garage of his north London home.\n\nDuring the next three years we lost touch, but by 1977 he was recording advertising jingles - which he didn't enjoy - and I had cofounded the band Crass, which I enjoyed thoroughly. From then on the ball started to rock and roll. As \"the ninth member of the band\", John became our recording engineer and financial manager: the music was bad and so was the money, but it was fun.\n\nWithin a couple of years Crass albums were dominating the alternative charts, and John's garage had become Southern Studios. In 1979 we created Crass Records and, despite marketing our first single for 45p against John's warning that every copy would lose us 3p, we made money.\n\nWe were in business, and from the outset it was clear that the music industry was not well pleased; John was a maverick, a DIY champion who didn't play the game. In his philosophy, beautiful came before big: to the last he drove a wreck of an old van, and never considered moving his garage studio to a more \"desirable\" location.\n\nLikewise, attempts to buy him out failed, just as media attempts to denigrate Crass had no effect on its growing popularity. Crass Records became the label that every aspiring punk band looked to, Southern Studios their destination, and John their engineer of choice.\n\nThroughout that time, with scores of bands being released on the label, no contract was ever signed and no paperwork ever thrust in faces. It was all done on trust, a principle that John held dear throughout his life. And it was John's managerial, production and engineering skills which were to assist the likes of Crass, Bjork, Chumbawamba, Fugazi, Shellac, The Jesus And Mary Chain, Slint and Babes In Toyland into the public domain,\n\nBorn near Plymouth, educated at a boarding school that he didn't like, John studied electrical engineering at London's City University. Details of his early history are brief because he didn't like talking about himself. John was one of those people who appears to have been born on their 20th birthday.\n\nFor every band that made it on to Crass Records, 10 were turned away. Crass's ideology was uncompromising and, as John felt, many good bands were losing the chance of public exposure. As a response, in partnership with his artist wife Sue, he created several labels and Southern Distribution, to ensure that they found a market. Aided by a small team to whom John was devoted, Southern grew into the international force that it is today.\n\nJohn resisted many attempts over the years to rein him in; as other independents collapsed, Southern survived, as majors conglomerated and became increasingly bland, Southern remained a vibrant voice in the wilderness. When bands got too big for their boots or managers began to burn his ears, John would suggest they go elsewhere. In the truest sense, Southern was a cottage industry, it placed people before profit.\n\nMedia requests for interviews with John always drew a blank, he displayed a reticence which extended even to his closest friends. For that reason very few people were aware that during the last 18 months he had been battling with a brain tumour which finally killed him.\n\nBut just as John's studio has become legendary, so has his insistence that quality of product should come before quantity: his angle, small is beautiful, was the big idea.\n\nHe is survived by his wife, Sue, and daughter, Natasha.\n\n· John Loder, record producer, born April 7 1946; died August 12 2005."}, {"url": "https://www.wikiwand.com/en/John_Loder_(sound_engineer)", "page_content": "John F. Loder (7 April 1946 – 12 August 2005) was an English sound engineer, record producer and founder of Southern Studios, as well as a former member of EXIT and co-founder of the Southern Records distribution company with his wife Sue.[1] He was also the studio engineer of choice for Crass and Crass Records, and was often considered to be the band's \"ninth member\".[2]\n\nQuick facts: John Loder, Born, Died, Occupation(s)... ▼\n\nMusical artist\n\nLoder was born near Plymouth and educated at boarding school before studying electrical engineering at London's City University. During his post-graduate work there, he became involved in early experiments in digital encoding of audio for the military. By 1970 he had joined EXIT, alongside Penny Rimbaud, utilising a one-track tape-recorder. This led to Loder eventually founding a record studio in his garage after the disbanding of EXIT in 1974.[1] Loder was recording advertising jingles in 1977 when his path crossed once again with Rimbaud, who had by then co-founded Crass, and invited Loder to become the band's engineer and financial manager, roles Loder happily accepted.[1]\n\nWhen Crass founded their own record label, Loder worked as an engineer on most of the label's releases, and when Loder saw potential in a number of bands turned away by Crass Records, Loder set up Southern Records.[1]\n\nLoder engineered and produced for many bands other than Crass, among them the Jesus and Mary Chain (for whom he engineered the recordings of the Psychocandy album), Big Black (Songs About Fucking), PJ Harvey, Babes in Toyland, Fugazi (mastering the vinyl edition of 2001's The Argument), Ministry and Shellac (mastering 2000's 1000 Hurts). American musician and recording engineer Steve Albini (member of Big Black and Shellac), has spoken highly of Loder and described him as a critical influence:\n\nWhen I was in Big Black we did a session with him, and I thought he was a terrific engineer. He showed me the potential for getting the most out of the equipment without making the equipment the focus of attention. He knew how to do things quickly and with great sensitivity to the band, and had a complete working knowledge of his equipment. In any situation he could snap his fingers and do the right thing, because he knew exactly how things worked and what to do. [3]\n\nIn the mid-1980s, Loder established a television production facility at Southern. Its notable output included the music show Snub TV, which after first being syndicated nationwide in the US, went on to further success on BBC2 and in other countries.\n\nLoder was responsible for encouraging and establishing independent alternative ezines, donating the use of Southern's servers and bandwidth, taking part in pioneering online media streaming and simulcasting.\n\nLoder died of a brain tumour on 12 August 2005, aged 59.[4][2]"}, {"url": "https://en-academic.com/dic.nsf/enwiki/1182857", "page_content": "John Loder ( April 7 1946 - August 12 2005 ) was a British sound engineer, record producer and founder of Southern Studios , as well as a former member of EXIT and co-founder of the Southern Records distribution company with his wife Sue. He was also the studio engineer of choice for Crass Records , and was often considered to be the bands' '9th member'. [Penny Rimbaud, John Loder obituary, \"The Guardian\", Friday August 19, 2005, http://www.guardian.co.uk/obituaries/story/0,,1552016,00.html] Loder died of a brain tumour.\n\nLoder was born near Plymouth and educated at boarding school before studying electrical engineering at London's City University. During his post-graduate work here he became involved in early experiments in digital encoding of audio for the military. By 1970 he had joined EXIT, alongside Penny Rimbaud , utilising a one-track tape-recorder. This led to Loder eventually founding a record studio in his garage after the disbanding of EXIT in 1974. In 1977 Loder was recording advertising jingles when his path crossed once again with Rimbaud, who had by then co-founded Crass , and at this point invited Loder to become the band's engineer and financial manager, roles Loder happily accepted.\n\nWhen Crass founded their own record label, Loder worked as an engineer on most of the label's releases, and when Loder saw potential in a number of bands turned away by Crass Records due to ideological differences, Loder set up Southern Records .\n\nLoder engineered and produced for many bands other than Crass, among them The Jesus and Mary Chain , for whom he engineered the recordings of the Psychocandy album, PJ Harvey , Babes in Toyland, Fugazi, Ministry and Shellac.\n\nIn the mid 80s Loder established a television production facility at Southern. Amongst its notable output was the music show Snub TV which, after first being syndicated nationwide in the USA, went on to further success on BBC2 and in other countries.\n\nJohn Loder was responsible for encouraging and establishing independent alternative internet ezines, donating the use of Southern's servers and bandwidth, taking part in pioneering online media streaming and simulcasting. [ http://web.archive.org/web/19970605012723/http://www.southern.com/CORE/ ]\n\nReferences"}, {"url": "https://www.howold.co/person/john-loder-sound-engineer/biography", "page_content": "John Loder Biography\n\nMusical artist\n\nJohn F. Loder (7 April 1946 – 12 August 2005) was an English sound engineer, record producer and founder of Southern Studios, as well as a former member of EXIT and co-founder of the Southern Records distribution company with his wife Sue. He was also the studio engineer of choice for Cr* and Cr* Records, and was often considered to be the band's \"ninth member\".\n\nLoder was born near Plymouth and educated at boarding school before studying electrical engineering at London's City University. During his post-graduate work there, he became involved in early experiments in digital encoding of audio for the military. By 1970 he had joined EXIT, alongside Penny Rimbaud, utilising a one-track tape-recorder. This led to Loder eventually founding a record studio in his garage after the disbanding of EXIT in 1974. Loder was recording advertising jingles in 1977 when his path crossed once again with Rimbaud, who had by then co-founded Cr*, and invited Loder to become the band's engineer and financial manager, roles Loder happily accepted.\n\nWhen Cr* founded their own record label, Loder worked as an engineer on most of the label's releases, and when Loder saw potential in a number of bands turned away by Cr* Records, Loder set up Southern Records.\n\nLoder engineered and produced for many bands other than Cr*, among them the Jesus and Mary Chain (for whom he engineered the recordings of the Psychocandy album), Big Black (Songs About *), PJ Harvey, Babes in Toyland, Fugazi (mastering the vinyl edition of 2001's The Argument), Ministry and Shellac (mastering 2000's 1000 Hurts). American musician and recording engineer Steve Albini (member of Big Black and Shellac), has spoken highly of Loder and described him as a critical influence:\n\nWhen I was in Big Black we did a session with him, and I thought he was a terrific engineer. He showed me the potential for getting the most out of the equipment without making the equipment the focus of attention. He knew how to do things quickly and with great sensitivity to the band, and had a complete working knowledge of his equipment. In any situation he could snap his fingers and do the right thing, because he knew exactly how things worked and what to do.\n\nIn the mid-1980s, Loder established a television production facility at Southern. Its notable output included the music show Snub TV, which after first being syndicated nationwide in the US, went on to further success on BBC2 and in other countries.\n\nLoder was responsible for encouraging and establishing independent alternative ezines, donating the use of Southern's servers and bandwidth, taking part in pioneering online media streaming and simulcasting.\n\nLoder died of a brain tumour on 12 August 2005, aged 59.\n\nReferences"}, {"url": "https://www.liquisearch.com/john_loder_sound_engineer", "page_content": "John F Loder (7 April 1946 – 12 August 2005) was an English sound engineer, record producer and founder of Southern Studios, as well as a former member of EXIT and co-founder of the Southern Records distribution company with his wife Sue. He was also the studio engineer of choice for Crass Records, and was often considered to be the band's \"9th member\".\n\nLoder was born near Plymouth and educated at boarding school before studying electrical engineering at London's City University. During his post-graduate work here he became involved in early experiments in digital encoding of audio for the military. By 1970 he had joined EXIT, alongside Penny Rimbaud, utilising a one-track tape-recorder. This led to Loder eventually founding a record studio in his garage after the disbanding of EXIT in 1974. In 1977 Loder was recording advertising jingles when his path crossed once again with Rimbaud, who had by then co-founded Crass, and at this point invited Loder to become the band's engineer and financial manager, roles Loder happily accepted.\n\nWhen Crass founded their own record label, Loder worked as an engineer on most of the label's releases, and when Loder saw potential in a number of bands turned away by Crass Records due to ideological differences, Loder set up Southern Records.\n\nLoder engineered and produced for many bands other than Crass, among them The Jesus and Mary Chain, for whom he engineered the recordings of the Psychocandy album, Big Black's Songs About Fucking, PJ Harvey, Babes in Toyland, Fugazi, Ministry and Shellac. In the mid 1980s Loder established a television production facility at Southern. Amongst its notable output was the music show Snub TV which, after first being syndicated nationwide in the USA, went on to further success on BBC2 and in other countries.\n\nLoder was responsible for encouraging and establishing independent alternative internet ezines, donating the use of Southern's servers and bandwidth, taking part in pioneering online media streaming and simulcasting.\n\nLoder died of a brain tumour in 2005, aged 59."}, {"url": "https://www.discogs.com/artist/232794-John-Loder", "page_content": "Everything's Alright When You're Down\n\nWho Do You Love and 1 more…\n\nPROCX 18\n\nWithin You Without You Various - Sgt. Pepper Knew My Father (Album, Comp) 4 versions\n\nPROCX 18\n\nCanada\n\n1988"}, {"url": "http://punkrocker.org.uk/punkscene/OBITjohnloder.html", "page_content": "JOHN LODER\n\nSound engineer who founded the legendary Southern Studios in London.\n\nBorn April 7 1946; died August 12 2005.\n\n\n\nI first met the sound engineer and record producer John Loder in about 1968. He was\n\non an acid trip and seemed to be talking out of the top of his head. The next time I met\n\nhim he was straight and made a lot more sense. We soon found that we shared. a\n\ncommon interest in Jimi Hendrix, Frank Zappa, John Coltrane, and KarlHeinz\n\nStockhausen. When we got bored with them, we would play birdsong forwards and\n\nBach backwards.\n\n\n\nBy 1970 John, who has died aged 59, and I were working together in Exit, an\n\navant-garde outfit. I was the percussionist, playing an amplified bicycle wheel, and he\n\nwas using an ancient one-track tape-recorder discovered in a friend's attic; primitive,\n\nbut it was the beginning of what was to become John's lifework.\n\nFinanced by a brief spell as a mini-cab driver, by 1972 John had cobbled together an\n\ninnovatory multi-track sound system, first used as a part of the wildly ambitious\n\navant-garde International Carnival of Experimental Sound (ICES 72). By the time Exit\n\ndisbanded in 1974, John had accumulated enough equipment to build a recording\n\nstudio in the small garage of his north London home.\n\n\n\nDuring the next three years we lost touch, but by 1977 he was recording advertising\n\njingles - which he didn't enjoy - and I had cofounded the band Crass, which I enjoyed\n\nthoroughly. From then on the ball started to rock and roll. As \"the ninth member of the\n\nband\", John became our recording engineer and financial manager: the music was bad\n\nand so was the money, but it was fun.\n\n\n\nWithin a couple of years Crass albums were dominating the alternative charts, and\n\nJohn's garage had become Southern Studios. In 1979 we created Crass Records and,\n\ndespite marketing our first single for 45p against John's warning that every copy would\n\nlose us 3p, we made money.\n\n\n\nWe were in business, and from the outset it was clear that the music industry was not\n\nwell pleased; John was a maverick, a DIY champion who didn't play the game. In his\n\nphilosophy, beautiful came before big: to the last he drove a wreck of an old van, and\n\nnever considered moving his garage studio to a more \"desirable\" location.\n\n\n\nLikewise, attempts to buy him out failed, just as media attempts to denigrate Crass had\n\nno effect on its growing popularity. Crass Records became the label that every\n\naspiring punk band looked to, Southern Studios their destination, and John their\n\nengineer of choice.\n\n\n\nThroughout that time, with scores of bands being released on the label, no contract\n\nwas ever signed and no paperwork ever thrust in faces. It was all done on trust, a\n\nprinciple that John held dear throughout his life. And it was John's managerial,\n\nproduction and engineering skills which were to assist the likes of Crass, Bjork,\n\nChumbawamba, Fugazi, Shellac, The Jesus And Mary Chain, Slint and Babes In\n\nToyland into the public domain,\n\n\n\nBorn near Plymouth, educated at a boarding school that he didn't like, John studied\n\nelectrical engineering at London's City University. Details of his early history are brief\n\nbecause he didn't like talking about himself. John was one of those people who\n\nappears to have been born on their 20th birthday.\n\n\n\nFor every band that made it on to Crass Records, 10 were turned away. Crass's\n\nideology was uncompromising and, as John felt, many good bands were losing the\n\nchance of public exposure. As a response, in partnership with his artist wife Sue, he\n\ncreated several labels and Southern Distribution, to ensure that they found a market.\n\nAided by a small team to whom John was devoted, Southern grew into the international\n\nforce that it is today.\n\n\n\nJohn resisted many attempts over the years to rein him in; as other independents\n\ncollapsed, Southern survived, as majors conglomerated and became increasingly\n\nbland, Southern remained a vibrant voice in the wilderness. When bands got too big\n\nfor their boots or managers began to burn his ears, John would suggest they go\n\nelsewhere. In the truest sense, Southern was a cottage industry, it placed people\n\nbefore profit.\n\n\n\nMedia requests for interviews with John always drew a blank, he displayed a reticence\n\nwhich extended even to his closest friends. For that reason very few people were\n\naware that during the last 18 months he had been battling with a brain tumour which\n\nfinally killed him.\n\n\n\nBut just as John's studio has become legendary, so has his insistence that quality of\n\nproduct should come before quantity: his angle, small is beautiful, was the big idea.\n\n\n\nHe is survived by his wife, Sue, and daughter, Natasha.\n\n\n\nPenny Rimbaud\n\nFriday August 19, 2005 The Guardian\n\n"}, {"url": "https://www.calendarz.com/on-this-day/august/12/john-loder-sound-engineer", "page_content": "Death\n\nAug, 12\n\nJohn Loder (sound engineer)\n\nJohn Loder, English sound engineer and producer, founded Southern Studios (b. 1946)\n\nJohn F. Loder (7 April 1946 – 12 August 2005) was an English sound engineer, record producer and founder of Southern Studios, as well as a former member of EXIT and co-founder of the Southern Records distribution company with his wife Sue. He was also the studio engineer of choice for Crass and Crass Records, and was often considered to be the band's \"ninth member\".Loder was born near Plymouth and educated at boarding school before studying electrical engineering at London's City University. During his post-graduate work there, he became involved in early experiments in digital encoding of audio for the military. By 1970 he had joined EXIT, alongside Penny Rimbaud, utilising a one-track tape-recorder. This led to Loder eventually founding a record studio in his garage after the disbanding of EXIT in 1974. Loder was recording advertising jingles in 1977 when his path crossed once again with Rimbaud, who had by then co-founded Crass, and invited Loder to become the band's engineer and financial manager, roles Loder happily accepted.When Crass founded their own record label, Loder worked as an engineer on most of the label's releases, and when Loder saw potential in a number of bands turned away by Crass Records, Loder set up Southern Records.Loder engineered and produced for many bands other than Crass, among them the Jesus and Mary Chain (for whom he engineered the recordings of the Psychocandy album), Big Black (Songs About Fucking), PJ Harvey, Babes in Toyland, Fugazi, Ministry and Shellac. In the mid-1980s, Loder established a television production facility at Southern. Its notable output included the music show Snub TV, which after first being syndicated nationwide in the US, went on to further success on BBC2 and in other countries.\n\n\n\nLoder was responsible for encouraging and establishing independent alternative ezines, donating the use of Southern's servers and bandwidth, taking part in pioneering online media streaming and simulcasting.\n\n\n\nLoder died of a brain tumour on 12 August 2005, aged 59."}, {"url": "https://peoplepill.com/people/john-loder-1/", "page_content": "John F. Loder (7 April 1946 – 12 August 2005) was an English sound engineer, record producer and founder of Southern Studios, as well as a former member of EXIT and co-founder of the Southern Records distribution company with his wife Sue. He was also the studio engineer of choice for Crass and Crass Records, and was often considered to be the band's \"ninth member\".\n\nLoder was born near Plymouth and educated at boarding school before studying electrical engineering at London's City University. During his post-graduate work there, he became involved in early experiments in digital encoding of audio for the military. By 1970 he had joined EXIT, alongside Penny Rimbaud, utilising a one-track tape-recorder. This led to Loder eventually founding a record studio in his garage after the disbanding of EXIT in 1974. Loder was recording advertising jingles in 1977 when his path crossed once again with Rimbaud, who had by then co-founded Crass, and invited Loder to become the band's engineer and financial manager, roles Loder happily accepted.\n\nWhen Crass founded their own record label, Loder worked as an engineer on most of the label's releases, and when Loder saw potential in a number of bands turned away by Crass Records, Loder set up Southern Records.\n\nLoder engineered and produced for many bands other than Crass, among them the Jesus and Mary Chain (for whom he engineered the recordings of the Psychocandy album), Big Black (Songs About Fucking), PJ Harvey, Babes in Toyland, Fugazi, Ministry and Shellac. In the mid-1980s, Loder established a television production facility at Southern. Its notable output included the music show Snub TV, which after first being syndicated nationwide in the USA, went on to further success on BBC2 and in other countries.\n\nLoder was responsible for encouraging and establishing independent alternative ezines, donating the use of Southern's servers and bandwidth, taking part in pioneering online media streaming and simulcasting.\n\nLoder died of a brain tumour on August 12, 2005, aged 59."}, {"url": "https://wiki.alquds.edu/?query=John_Loder_(sound_engineer)", "page_content": "Musical artist\n\nJohn F. Loder (7 April 1946 – 12 August 2005) was an English sound engineer, record producer and founder of Southern Studios, as well as a former member of EXIT and co-founder of the Southern Records distribution company with his wife Sue.[1] He was also the studio engineer of choice for Crass and Crass Records, and was often considered to be the band's \"ninth member\".[2]\n\nLoder was born near Plymouth and educated at boarding school before studying electrical engineering at London's City University. During his post-graduate work there, he became involved in early experiments in digital encoding of audio for the military. By 1970 he had joined EXIT, alongside Penny Rimbaud, utilising a one-track tape-recorder. This led to Loder eventually founding a record studio in his garage after the disbanding of EXIT in 1974.[1] Loder was recording advertising jingles in 1977 when his path crossed once again with Rimbaud, who had by then co-founded Crass, and invited Loder to become the band's engineer and financial manager, roles Loder happily accepted.[1]\n\nWhen Crass founded their own record label, Loder worked as an engineer on most of the label's releases, and when Loder saw potential in a number of bands turned away by Crass Records, Loder set up Southern Records.[1]\n\nLoder engineered and produced for many bands other than Crass, among them the Jesus and Mary Chain (for whom he engineered the recordings of the Psychocandy album), Big Black (Songs About Fucking), PJ Harvey, Babes in Toyland, Fugazi (mastering the vinyl edition of 2001's The Argument), Ministry and Shellac (mastering 2000's 1000 Hurts). American musician and recording engineer Steve Albini (member of Big Black and Shellac), has spoken highly of Loder and described him as a critical influence:\n\nWhen I was in Big Black we did a session with him, and I thought he was a terrific engineer. He showed me the potential for getting the most out of the equipment without making the equipment the focus of attention. He knew how to do things quickly and with great sensitivity to the band, and had a complete working knowledge of his equipment. In any situation he could snap his fingers and do the right thing, because he knew exactly how things worked and what to do.[3]\n\nIn the mid-1980s, Loder established a television production facility at Southern. Its notable output included the music show Snub TV, which after first being syndicated nationwide in the US, went on to further success on BBC2 and in other countries.\n\nLoder was responsible for encouraging and establishing independent alternative ezines, donating the use of Southern's servers and bandwidth, taking part in pioneering online media streaming and simulcasting.\n\nLoder died of a brain tumour on 12 August 2005, aged 59.[4][2]"}]}