{"John Loder was posthumously inducted into the Music Producers Guild Hall of Fame in 2008.": [{"url": "https://www.theguardian.com/news/2005/aug/19/guardianobituaries.artsobituaries", "page_content": "I first met the sound engineer and record producer John Loder in about 1968. He was on an acid trip and seemed to be talking out of the top of his head. The next time I met him he was straight and made a lot more sense. We soon found that we shared. a common interest in Jimi Hendrix, Frank Zappa, John Coltrane, and KarlHeinz Stockhausen. When we got bored with them, we would play birdsong forwards and Bach backwards.\n\nBy 1970 John, who has died aged 59, and I were working together in Exit, an avant-garde outfit. I was the percussionist, playing an amplified bicycle wheel, and he was using an ancient one-track tape-recorder discovered in a friend's attic; primitive, but it was the beginning of what was to become John's lifework.\n\nFinanced by a brief spell as a mini-cab driver, by 1972 John had cobbled together an innovatory multi-track sound system, first used as a part of the wildly ambitious avant-garde International Carnival of Experimental Sound (ICES 72). By the time Exit disbanded in 1974, John had accumulated enough equipment to build a recording studio in the small garage of his north London home.\n\nDuring the next three years we lost touch, but by 1977 he was recording advertising jingles - which he didn't enjoy - and I had cofounded the band Crass, which I enjoyed thoroughly. From then on the ball started to rock and roll. As \"the ninth member of the band\", John became our recording engineer and financial manager: the music was bad and so was the money, but it was fun.\n\nWithin a couple of years Crass albums were dominating the alternative charts, and John's garage had become Southern Studios. In 1979 we created Crass Records and, despite marketing our first single for 45p against John's warning that every copy would lose us 3p, we made money.\n\nWe were in business, and from the outset it was clear that the music industry was not well pleased; John was a maverick, a DIY champion who didn't play the game. In his philosophy, beautiful came before big: to the last he drove a wreck of an old van, and never considered moving his garage studio to a more \"desirable\" location.\n\nLikewise, attempts to buy him out failed, just as media attempts to denigrate Crass had no effect on its growing popularity. Crass Records became the label that every aspiring punk band looked to, Southern Studios their destination, and John their engineer of choice.\n\nThroughout that time, with scores of bands being released on the label, no contract was ever signed and no paperwork ever thrust in faces. It was all done on trust, a principle that John held dear throughout his life. And it was John's managerial, production and engineering skills which were to assist the likes of Crass, Bjork, Chumbawamba, Fugazi, Shellac, The Jesus And Mary Chain, Slint and Babes In Toyland into the public domain,\n\nBorn near Plymouth, educated at a boarding school that he didn't like, John studied electrical engineering at London's City University. Details of his early history are brief because he didn't like talking about himself. John was one of those people who appears to have been born on their 20th birthday.\n\nFor every band that made it on to Crass Records, 10 were turned away. Crass's ideology was uncompromising and, as John felt, many good bands were losing the chance of public exposure. As a response, in partnership with his artist wife Sue, he created several labels and Southern Distribution, to ensure that they found a market. Aided by a small team to whom John was devoted, Southern grew into the international force that it is today.\n\nJohn resisted many attempts over the years to rein him in; as other independents collapsed, Southern survived, as majors conglomerated and became increasingly bland, Southern remained a vibrant voice in the wilderness. When bands got too big for their boots or managers began to burn his ears, John would suggest they go elsewhere. In the truest sense, Southern was a cottage industry, it placed people before profit.\n\nMedia requests for interviews with John always drew a blank, he displayed a reticence which extended even to his closest friends. For that reason very few people were aware that during the last 18 months he had been battling with a brain tumour which finally killed him.\n\nBut just as John's studio has become legendary, so has his insistence that quality of product should come before quantity: his angle, small is beautiful, was the big idea.\n\nHe is survived by his wife, Sue, and daughter, Natasha.\n\n· John Loder, record producer, born April 7 1946; died August 12 2005."}, {"url": "https://www.howold.co/person/john-loder-sound-engineer/biography", "page_content": "John Loder Biography\n\nMusical artist\n\nJohn F. Loder (7 April 1946 – 12 August 2005) was an English sound engineer, record producer and founder of Southern Studios, as well as a former member of EXIT and co-founder of the Southern Records distribution company with his wife Sue. He was also the studio engineer of choice for Cr* and Cr* Records, and was often considered to be the band's \"ninth member\".\n\nLoder was born near Plymouth and educated at boarding school before studying electrical engineering at London's City University. During his post-graduate work there, he became involved in early experiments in digital encoding of audio for the military. By 1970 he had joined EXIT, alongside Penny Rimbaud, utilising a one-track tape-recorder. This led to Loder eventually founding a record studio in his garage after the disbanding of EXIT in 1974. Loder was recording advertising jingles in 1977 when his path crossed once again with Rimbaud, who had by then co-founded Cr*, and invited Loder to become the band's engineer and financial manager, roles Loder happily accepted.\n\nWhen Cr* founded their own record label, Loder worked as an engineer on most of the label's releases, and when Loder saw potential in a number of bands turned away by Cr* Records, Loder set up Southern Records.\n\nLoder engineered and produced for many bands other than Cr*, among them the Jesus and Mary Chain (for whom he engineered the recordings of the Psychocandy album), Big Black (Songs About *), PJ Harvey, Babes in Toyland, Fugazi (mastering the vinyl edition of 2001's The Argument), Ministry and Shellac (mastering 2000's 1000 Hurts). American musician and recording engineer Steve Albini (member of Big Black and Shellac), has spoken highly of Loder and described him as a critical influence:\n\nWhen I was in Big Black we did a session with him, and I thought he was a terrific engineer. He showed me the potential for getting the most out of the equipment without making the equipment the focus of attention. He knew how to do things quickly and with great sensitivity to the band, and had a complete working knowledge of his equipment. In any situation he could snap his fingers and do the right thing, because he knew exactly how things worked and what to do.\n\nIn the mid-1980s, Loder established a television production facility at Southern. Its notable output included the music show Snub TV, which after first being syndicated nationwide in the US, went on to further success on BBC2 and in other countries.\n\nLoder was responsible for encouraging and establishing independent alternative ezines, donating the use of Southern's servers and bandwidth, taking part in pioneering online media streaming and simulcasting.\n\nLoder died of a brain tumour on 12 August 2005, aged 59.\n\nReferences"}, {"url": "https://www.billboard.com/music/awards/rock-and-roll-hall-of-fame-posthumous-inductions-8548091/", "page_content": "This year’s Rock and Roll Hall of Fame induction class is notably heavy on artists who are no longer with us. The Notorious B.I.G. was murdered in 1997. Whitney Houston died in 2012. Three members of T. Rex (Marc Bolan, Steve Currie and Mickey Finn) have died, as have two members of The Doobie Brothers (Michael Hossack and Keith Knudsen).\n\nExplore Explore The Notorious B.I.G. See latest videos, charts and news See latest videos, charts and news\n\nIt’s the first time that seven musicians will be honored posthumously at the Rock Hall since 2001, when Ritchie Valens, Freddie Mercury of Queen and five members of the doo-wop group The Flamingos were honored posthumously. It’s also the first time in seven years that two solo artists have been inducted posthumously — in 2013, both Donna Summer and Albert King were admitted to the Hall following their deaths.\n\nCounting both solo artists and group members, every Rock and Roll Hall of Fame induction class has included at least one posthumous induction. In the Rock Hall’s first two years, there were many posthumous inductions, as the Hall caught up with the greats of rock’s early years. In 1987, there were eight — the highest number to date.\n\nHere are all the years where two or more solo artists (as defined by the Hall) were inducted posthumously.\n\n1986: Sam Cooke, Buddy Holly, Elvis Presley\n\n1987: Eddie Cochran, Marvin Gaye, Bill Haley, Clyde McPhatter, Ricky Nelson, Big Joe Turner, Muddy Waters, Jackie Wilson\n\n1994: John Lennon, Bob Marley\n\n1995: Janis Joplin, Frank Zappa\n\n1999: Del Shannon, Dusty Springfield\n\n2013: Albert King, Donna Summer\n\n2020: Whitney Houston, The Notorious B.I.G.\n\nRelated Rock Hall Expands Boundaries With Unexpected 2020 Induction Class\n\nWith posthumous inductions, acceptance speeches are traditionally made by family members, colleagues or friends, and performances are by other artists paying tribute. It’s not as celebratory as when the honorees are still living, but it adds another dimension to the evening — a sobering sense of an artist’s mortality, and the encouraging fact that, with great artists, the work lives on."}, {"url": "https://www.nytimes.com/2016/04/28/arts/music/prince-guitar-rock-hall-of-fame.html", "page_content": "Then I was sitting there, and I heard somebody playing a guitar riff from a song that I wrote with Average White Band. And I looked over and Prince was looking right at me and playing that song. And I thought, “Yeah, you actually do know who I am!”\n\nGALLEN They finish, and I go up to Jeff and Tom, and I sort of huddle up with these guys, and I’m like: “This cannot be happening. I don’t even know if we’re going to get another rehearsal with him. [Prince]. But this guy cannot be playing the solos throughout the song.” So I talk to Prince about it, I sort of pull him aside and had a private conversation with him, and he was like: “Look, let this guy do what he does, and I’ll just step in at the end. For the end solo, forget the middle solo.” And he goes, “Don’t worry about it.” And then he leaves. They never rehearsed it, really. Never really showed us what he was going to do, and he left, basically telling me, the producer of the show, not to worry. And the rest is history. It became one of the most satisfying musical moments in my history of watching and producing live music.\n\nINCIARDI You hear all this sort of harmonics and finger-tapping, sort of like what you’d hear Eddie Van Halen do. He runs through all these different sort of guitar techniques that are sort of astonishing. You hear what sounds like someone cocking a shotgun. There’s all these strumming power chords that really, really connected. Then he plays his version of the Eric Clapton solo. He evokes Eric’s solo in very sort of truncated fashion. As he ends the song, he plays this flourishing thing that sort of ends up sounding a little bit like Spinal Tap, but in a good way.\n\nPETTY You see me nodding at him, to say, “Go on, go on.” I remember I leaned out at him at one point and gave him a “This is going great!” kind of look. He just burned it up. You could feel the electricity of “something really big’s going down here.”\n\nFERRONE Tom sort of went over to him and said, “Just cut loose and don’t feel sort of inhibited to copy anything that we have, just play your thing, just have a good time.” It was a hell of a guitar solo, and a hell of a show he actually put on for the band. When he fell back into the audience, everybody in the band freaked out, like, “Oh my God, he’s falling off the stage!” And then that whole thing with the guitar going up in the air. I didn’t even see who caught it. I just saw it go up, and I was astonished that it didn’t come back down again. Everybody wonders where that guitar went, and I gotta tell you, I was on the stage, and I wonder where it went, too.\n\nGALLEN I still feel like people don’t realize what an amazing guitar player he was. As a rock guitar player, he can go toe to toe with anybody.\n\nPETTY It’s funny because just a few days ago, he was in mind all afternoon, I was thinking about him. And I had just been talking with Susanna Hoffs of the Bangles — he wrote their “Manic Monday” song. She was telling me the story of that, of how she came to have that song and meet Prince. And I was thinking about him a lot that day, and I almost told myself I was going to call him and just see how he was. I’m starting to think you should just act on those things all the time."}, {"url": "https://www.billboard.com/music/awards/musicians-hall-of-fame-inductees-2022-vince-gill-don-mclean-1235163659/", "page_content": "Vince Gill, Don McLean, Ray Stevens and Marty Stuart and His Fabulous Superlatives are among the musicians to be honored at the Musicians Hall of Fame and Museum’s 2022 Concert and Induction Ceremony. The event is set for Tuesday, Nov. 22, at 7 p.m. CT at the Nashville Municipal Auditorium.\n\nJim Guercio will receive the producer award and George Massenburg will receive the engineer award.\n\nPhil Vassar will host the event, which will feature live performances by Rodney Crowell, Steve Miller, Wendy Moten and Mike Farris, with more performers to be announced. This is the Musicians Hall of Fame’s seventh induction ceremony, but its first since 2019. There was an induction ceremony every year from 2007-09, but they have been irregular since then, in 2014, 2016, 2019 and 2022.\n\nMarty Stuart and His Fabulous Superlatives consists of Stuart, Chris Scruggs, Harry Stinson, Kenny Vaughan and Mick Conley.\n\nThe induction ceremony and concert follows the recent death of Musicians Hall of Fame founder Joe Chambers, who died on Sept. 28 after an extended illness. He was 68.\n\n“We’re proud to honor Joe’s legacy by celebrating this year’s inductees with a night of vibrant live music and special performances by legendary musicians,” Linda Chambers, executive vice president & chief operating officer of the Musicians Hall of Fame (and Chambers’ widow), said in a statement.\n\nTickets are on sale now. A limited number of tickets are on sale to the general public here.\n\nThe Musicians Hall of Fame & Museum honors all musicians “regardless of genre or instrument,” according to a statement. Inductees are nominated by current members of the American Federation of Musicians and by other music industry professionals. The Hall’s newest addition, The Grammy Museum Gallery, is a 9,000-square-foot, interactive exhibit where visitors learn about every aspect of the music industry.\n\nFor more information about the Musicians Hall of Fame and Museum including details on membership, visit musicianshalloffame.com."}, {"url": "https://www.npr.org/2022/05/02/1095856361/the-judds-and-ray-charles-join-the-country-music-hall-of-fame", "page_content": "The Judds and Ray Charles join the Country Music Hall of Fame\n\nEnlarge this image toggle caption Julie Jacobson/AP Julie Jacobson/AP\n\nNASHVILLE, Tenn. — Ray Charles and The Judds joined the Country Music Hall of Fame on Sunday in a ceremony filled with tears, music and laughter, just a day after Naomi Judd died unexpectedly.\n\nThe loss of Naomi Judd altered the normally celebratory ceremony, but the music played on, as the genre's singers and musicians mourned the country legend while also celebrating the four inductees: The Judds, Ray Charles, Eddie Bayers and Pete Drake. Garth Brooks, Trisha Yearwood, Vince Gill and many more performed their hit songs.\n\nNaomi and Wynonna Judd were among the most popular duos of the 1980s, scoring 14 No. 1 hits during their nearly three-decade career. On the eve of her induction, the family said in a statement to The Associated Press that Naomi Judd died at the age of 76 due to \"the disease of mental illness.\"\n\nDaughters Wynonna and Ashley Judd accepted the induction amid tears, holding onto each other and reciting a Bible verse together.\n\n\"I'm sorry that she couldn't hang on until today,\" Ashley Judd said of her mother to the crowd while crying. Wynonna Judd talked about the family gathering as they said goodbye to her and she and Ashley Judd recited Psalm 23.\n\n\"Though my heart is broken I will continue to sing,\" Wynonna Judd said.\n\nFans gathered outside the museum, drawn to a white floral bouquet outside the entrance and a small framed photo of Naomi Judd below. A single rose was laid on the ground.\n\nCharles' induction showcased his genre-defying country releases, which demonstrated the genre's commercial appeal. The Georgia-born singer and piano player grew up listening to the Grand Ole Opry and in 1962 released \"Modern Sounds in Country and Western Music,\" which became one of the best selling country releases of his era.\n\nBlinded and orphaned at a young age, Charles is best known for R&B, gospel and soul, but his decision to record country music changed the way the world thought about the genre, expanding audiences in the Civil Rights era.\n\nEnlarge this image toggle caption Winslow Townson/AP Winslow Townson/AP\n\nCharles' version of \"I Can't Stop Loving You,\" spent five weeks on top of the Billboard 100 chart and remains one of his most popular songs. He died in 2004.\n\nBrooks sang \"Seven Spanish Angels,\" one of Charles' hits with Willie Nelson, while Bettye LaVette performed \"I Can't Stop Loving You.\"\n\nCountry Music Hall of Famer Ronnie Milsap said he met Charles when he was a young singer and that others tried to imitate Charles, but no one could measure up.\n\n\"There was one of him and only one,\" said Milsap. \"He sang country music like it should be sung.\"\n\nThe Hall of Fame also inducted two recordings musicians who were elemental to so many country songs and singers: Eddie Bayers and Pete Drake.\n\nBayers, a drummer in Nashville for decades who worked on 300 platinum records, is a member of the Grand Ole Opry band. He regularly played on records for The Judds, Ricky Skaggs, George Strait, Alan Jackson and Kenny Chesney. He is the first drummer to join the institution.\n\nDrake, who died in 1988, was a pedal steel guitar player and a member of Nashville's A-team of skilled session musicians, played on hits like \"Stand By Your Man\" by Tammy Wynette and \"He Stopped Loving Her Today\" by George Jones. He is the first pedal steel guitar player to become part of the Hall of Fame."}, {"url": "https://www.brianepstein.com/induction.html", "page_content": "\n\nBrian Epstein Inducted Into The Rock and Roll\n\nHall of Fame by Peter Asher\n\nBrian Epstein was posthumously inducted into the Rock and Roll Hall of Fame on Thursday, April 10, 2014, at the Barclays Center in Brooklyn, New York. The formal title of the award is the Ahmet Ertegun Lifetime Achievement Award. Brian Epstein's induction was combined with the induction of Rolling Stones manager/producer Andrew Loog Oldham. This video clip created by an attendee - presents the audio (illustrated with visuals) of the induction presentation speech given by manager/producer/musician Peter Asher on that night. Underneath the video clip you will find the verbatim transcript of the speech.\n\n\n\n\"I am often asked what I think it takes to become a great manager. And my answer, while not necessarily very helpful, is simple and true: a great client. A band who makes brilliant music. \"I am very proud tonight to have been asked to induct the first two managers into the Rock and Roll Hall of Fame, each of whom managed one of the most important ensembles in music history, let alone just rock 'n' roll - and each of whom guided his band from anonymity to global stature - but in very different ways. \"When Brian Epstein first heard and saw the Beatles at the Cavern in 1961 he became a believer. That belief was the force behind his absolute determination to advise, to cajole and to proselytize to the very limit of his powers. That belief remained intact even when every record company turned the Beatles down before he finally got them an audition with George Martin. Brian loved, respected, protected the Beatles and that love never flagged. \"I knew Brian. He was a man of impeccable honesty and exceptional charm and intelligence and he took his responsibilities extremely seriously. His biggest fear was of ever letting the Beatles down in any way whatsoever. He cared very deeply about every detail. He made sure that media access to a Beatle was a special event as was every show they did. And of course he was delighted when the world eventually agreed with him that he had indeed found the best band in the land. Specifically, of course, 73 million Americans agreed on February 9th 1964 when they watched the Ed Sullivan Show. With typical shrewdness and foresight, Brian had negotiated a deal for multiple appearances on the show at a reduced fee, knowing that exposure was more important than a few extra dollars. \"I remember a time when my old duo Peter and Gordon was on the road with the Beatles in 1966 and we were all travelling together on an absurdly luxurious private train which had been built for the Queen. Brian was sitting at the head of a majestic 30-foot-long dining-room table as the train whizzed through the German countryside, surrounded by Beatles and a few close friends... his joy and his well-justified pride in the tour's unprecedented success were palpable. But equally, when things went horribly wrong in the Philippines only a week later (through no fault of Brian's - it's an Imelda Marcos story - you should look it up), he took it very seriously. He was a tormented man. He cared very deeply indeed.\n\nPeter Asher at the 2014 Rock and Roll Hall of Fame induction ceremony \"I also remember walking with Paul McCartney decades ago to a Rolling Stones club gig in London. Paul was looking forward very much to the show but he did express some jealousy over the fact that Brian made the Beatles wear suits on stage and the Rolling Stones were allowed to wear whatever they liked. \"And of course, the man who allowed that was my second inductee, Andrew Loog Oldham. Andrew was a teenager himself when he first encountered the Stones... Something of a hustler and a manipulator. He had the instinctive understanding of the youth culture of 60s Britain. He was a promotional genius and a master of the media long before anyone even started talking about 'branding' as they do today Aside from the greatness of the Stones' music (I used to go and see them myself once a week in a club called Studio 51 in London every Monday night before they ever made a record and they were amazing!) \"But Andrew also saw what the Stones could become culturally. He brilliantly positioned the 'dangerous' Stones as the cultural antithesis of the 'lovable' Beatles, creating a climate in which the idea of your daughter marrying a Rolling Stone was an horrific prospect - now of course she'd be marrying into the British aristocracy! And let us not forget that Andrew's commitment and creativity extended into the studio as well; he encouraged (as they said) - indeed virtually commanded! - Mick and Keith to write their own songs; he produced the Stones' first five albums. And they were brilliant records. \"So, two disparate, extraordinary and prescient managers for two very different musical groups. Groups parallel only in their intense ambition, their consuming love for the extraordinary and exquisite music which enthralled us all - American rhythm & blues and rock 'n' roll. The greatest cultural innovation of the 20th Century and the reason we're all here tonight. \"Brian of course brilliantly managed other acts as well: Cilla Black, Billy J. Kramer, Gerry and the Pacemakers and more; he furthermore embraced the Beatles' own musical growth. When they started to experiment, he urged them never to play it safe. And to continue their growth wherever it took them. \"And Andrew went on of course, to found one of the very coolest indie labels of all time, Immediate Records - the early home of Rod Stewart, Fleetwood Mac and The Small Faces. \"Andrew was not able to be with us tonight. And the Epstein family asked me express their thrilled delight. They're only sorry that of course neither Brian's brother Clive, nor his parents Harry & Queenie are alive to witness this celebration. \"But thus it is that with the very greatest pride and ineffable delight, I induct two men who helped create musical history: Brian Epstein and Andrew Loog Oldham, into the Rock and Roll Hall of Fame where they so certainly belong. \"Thank you very much.\"\n\nThe Hall of Fame's unprecedented action in combining the presentation of awards to two separate, unrelated inductees in a single, very brief presentation provoked some protests. Oldham - a good friend of Brian - protested that he and Brian both deserved to be treated like other past inductees in the same category and be inducted individually - and he boycotted the ceremony. The Epstein family also decided not to attend the event. The 2014 ceremony inducting a total of nine inductees had a duration of five and a half hours. Peter Asher - who was not responsible for the Hall of Fame's decision to combine the two inductions - was given a strict limitation of only five minutes in which to induct both men.\n\n"}, {"url": "https://www.tcm.com/tcmdb/person/146645%7C8979/Alan-J.-Pakula/", "page_content": "Biography\n\nKnown for drawing Oscar caliber performances out of his actors while helming suspenseful, moody thrillers, director Alan J. Pakula emerged from the theater world to produce a number of quality films in the 1960s with director Robert Mulligan, most notably the iconic adaptation of Harper Lee's novel \"To Kill a Mockingbird\" (1962). He went on to produce another six films with Mulligan during the decade before stepping into the director's chair himself for the low-key melodrama \"The Sterile Cuckoo\" (1969). But with his next picture, \"Klute\" (1971), Pakula began cementing his reputation as a fine practitioner of the conspiracy thriller while showcasing exemplary performances from his leading actors. He went on to practically define the genre with \"The Parallax View\" (1974), a box office disappointment at the time that later earned a reputation as one of the best conspiracy thrillers ever made. Pakula rounded out his so-called paranoia trilogy with \"All the President's Men\" (1976), arguably his finest achievement and one of the best movies of the entire decade. With the tearjerker drama \"Sophie's Choice\" (1983), he tackled the exceedingly difficult subject of the Holocaust in exceptional fashion while allowing star Meryl Streep to deliver an Oscar-winning performance that long remained the best of her storied career. Later in his career, Pakula began delivering rather underwhelming, but nonetheless financially successful movies like \"The Pelican Brief\" (1993), which nonetheless helped cap a sterling career highlighted by some the best movies Hollywood had to offer.\n\nBorn on April 7, 1928 in the Bronx, NY, Pakula was raised by his father, Paul, who owned a printing and advertising business, and his mother, Jeanette, a homemaker. After attending the Bronx High School of Science, he graduated from the private boys and girls institution, The Hill School, when he was 16 years old. Before moving on to college, Pakula spent a summer working in the office of agent Leland Hayward, which sparked an interest in show business. At Yale University, he studied drama and began directing plays at the University Club. Following graduation in 1948, Pakula moved out to Los Angeles, where he started his career in earnest as an assistant in the cartoon department at Warner Bros. From there, he became an assistant to writer-director Don Hartman and followed his boss to Paramount Studios when he became head of production. While continuing to work in Hollywood, Pakula produced a number of plays back in New York, including \"There Must Be a Pony\" starring Myrna Loy and \"Comes a Day\" with George C. Scott and Judith Anderson.\n\nPakula graduated to producing films with the baseball psychodrama \"Fear Strikes Out\" (1957), which marked the first of seven collaborations with director Robert Mulligan. Their most significant work came about with their next movie, \"To Kill a Mockingbird\" (1962), the iconic adaptation of Harper Lee's only novel which starred Gregory Peck as the virtuous Atticus Finch, a widowed Southern lawyer with two small children (Mary Badham and Phillip Alford) who defends a black man (Brock Peters) against charges that he raped a white woman. Nominated for a number of Academy Awards, \"To Kill a Mocking Bird\" won three for Best Art Director, Best Screenplay and Best Actor for Peck, whose very name became synonymous with the role of Atticus Finch. Pakula continued his collaborations with Mulligan on several move films to varying degrees of success, though nothing reached the status of \"Mockingbird.\" He produced the romantic dramedy, \"Love with the Proper Stranger\" (1964) starring Steve McQueen and Natalie Wood, before reuniting with McQueen on \"Baby, the Rain Must Fall\" (1965) and Wood on \"Inside Daisy Clover\" (1965). The producer-director pair had a box office hit with \"Up the Down Staircase\" (1967), which starred Sandy Dennis as an idealistic young teacher tackling her first assignment, before concluding their working relationship with \"The Stalking Moon\" (1968) with Gregory Peck.\n\nPakula launched his own directing career with the sensitive, if somewhat static melodrama \"The Sterile Cuckoo\" (1969), which yielded a strong, Oscar-nominated performance from Liza Minnelli. Two years later, he embarked on what informally became known as his paranoia trilogy with \"Klute\" (1971), a moody psychological thriller that starred Donald Sutherland as a private detective investigating the murder of a friend, only to learn that both victim and killer were clients of the same high-class call girl (Jane Fonda). Lauded for its striking blend of film noir with 1970s paranoid sensibilities, \"Klute\" was a major showcase for the director and his stars, particularly Fonda, who won the Academy Award for Best Actress. Pakula moved on to the underrated, gorgeously shot \"Love and Pain and the Whole Damn Thing\" (1973), which focused on the unlikely relationship between a dying woman (Maggie Smith) and a much younger man (Timothy Bottoms). He next helmed the gripping political thriller \"The Parallax View\" (1974), the second in his paranoia trilogy. The film starred Warren Beatty as an intrepid reporter who accidentally uncovers a secret organization in the business of framing socially unacceptable people in a series of assassinations, only to become more deeply involved than he planned. Considered too dark even for those difficult times, \"The Parallax View\" received mixed reviews and poor box office totals upon its release. But over time, the film earned a reputation - bolstered by numerous critics - as being one of the all-time classics of the conspiracy thriller genre.\n\nDespite the financial failure of \"The Parallax View,\" Pakula directed what many would call his best film, \"All the President's Men\" (1976), a fact-based look at the lonely and often daunting Watergate investigation by Washington Post reporters Bob Woodward (Robert Redford) and Carl Bernstein (Dustin Hoffman). With a taut script from eventual Oscar-winning scribe William Goldman, Pakula crafted a suspenseful story despite an audience knowing the eventual outcome. \"All the President's Men\" was a box office hit and earned several Academy Award nominations, including nods for Best Picture and Best Director, while cementing its place as one of the best films of that decade, if not of all time. Now established as a bankable director, Pakula stepped away from conspiracy thrillers and turned his attentions to \"Comes a Horseman\" (1978), a Western set in the 1940s. Reuniting with Jane Fonda and Jason Robards - who won an Oscar for playing Bill Bradley in \"All the President's Men\" - Pakula earned mixed reviews for his understated, contemporary cowboy tale that showcased fine performances from its cast, including Richard Farnsworth, who earned an Oscar nomination for Best Supporting Actor.\n\nBecause he tended to favor performances above other elements, Pakula was able to showcase actors delivering their highest quality work. He next directed \"Starting Over\" (1979), based on a strong script from James L. Brooks, a serio-comic look at the aftermath of divorce that featured strong turns by Burt Reynolds as the newly single journalist, Candice Bergen as his tone-deaf ex-wife who harbors dreams of a singing career and Jill Clayburgh as his new lover. Returning to political thrillers, Pakula helmed \"Rollover\" (1981), his third collaboration with Fonda, who played the widow of a corporate executive involved in high-stakes financial dealings. The director-producer branched into screenwriting with his critically-acclaimed and Oscar-nominated adaptation of William Styron's Holocaust drama \"Sophie's Choice\" (1983), which showcased Meryl Streep in a luminous portrayal of a concentration camp survivor romanced by a mentally unstable Jew (Kevin Kline) and a Southern would-be author (Peter MacNichol). Powerfully realized, \"Sophie's Choice\" was a mature look at a difficult subject and delivered what many felt was the finest performance of Streep's already impressive career, bringing her an Oscar for Best Actress. He next directed \"Orphans\" (1987), a stylized adaptation of Lyle Kessler's play starring Albert Finney and Matthew Modine that nonetheless suffered in its translation from stage to screen.\n\nPakula moved on to write his first original screenplay for his next directing effort, \"See You in the Morning\" (1989), an autobiographical romantic dramedy about two divorcees (Jeff Bridges and Alice Krige) struggling to combine their families after getting married. For his follow-up, \"Presumed Innocent\" (1990), he scripted - along with Frank Pierson - and directed an adaptation of Scott Turow's best-selling novel that was rife with the familiar Pakula themes of social and political anxieties exacerbated by sexual tensions. Despite an all-star cast that included Harrison Ford, the overall effect fell short of its potential for greatness, but the film was still a powerful addition to the director's legacy, and underscored his reputation an intelligent filmmaker. Pakula went on to directed \"Consenting Adults\" (1992), a thriller starring Kevin Kline, Mary Elizabeth Mastrantonio, Kevin Spacey and Rebecca Miller that involved mate swapping and murder. Next up was \"The Pelican Brief\" (1993), a loose and rather superficial adaptation of the John Grisham novel about a young female law student (Julia Roberts) who endangers her own life after solving a supposedly unsolvable crime. Despite its flaws, \"The Pelican Brief\" became a huge box office hit - due mainly to the allure of its female lead, then the biggest star in the world. Pakula was a hired gun on \"The Devil's Own\" (1997), a low-key thriller about an Irish terrorist (Brad Pitt) taken in by an American cop (Harrison Ford) and his family who know nothing about his background. The troubled production made headlines during and after filming, thanks to Pitt badmouthing the script, while audiences failed to turn the star pairing into a hit. The movie proved to be Pakula's last. On Nov. 19, 1998, the director was involved in what The New York Times described as a \"freak accident\" on the Long Island Expressway, when a piece of metal pipe kicked up by another vehicle flew threw his windshield, striking him in the head and killing him instantly before his car swerved off the road. He was 70 years old."}, {"url": "https://www.songhall.org/profile/freddie_mercury", "page_content": "Freddie Mercury was born Farrokh Bulsara on September 5, 1946 in Zanzibar.\n\nAfter the 1964 revolution, the Bulsara family left the country and settled in England. After attending English boarding schools, Mercury enrolled in the Ealing College of Art where he studied music and art. Inspired by the music of Jimi Hendrix and local bands, including Smile, which included guitarist Brian May and drummer Roger Taylor, Mercury began performing around London. He joined Smile in 1971 when the lead singer left, and quickly changed his name to Freddie Mercury.\n\nJohn Deacon soon joined Mercury, May and Taylor and the new group became known as Queen. Queen’s debut album was released in 1973 with the self titled Queen. The album featured songs written by all four members of the band. The over the top, operatic style of the songs and performances built a cult following throughout Europe and eventually overseas and the 1974 releases of Queen II and Sheer Heart Attack were successful.\n\nQueen was soon one of rock music’s elite bands. Over the next 10 years, Queen would write, tour and produce memorable albums. 1975’s A Night at the Opera reached #4 on the pop charts; 1977’s A Day at the Races reached #5; 1977’s News of the World reached #3. The band’s greatest success came with the 1980 release of The Game, which reached #1 on the pop charts. Mercury’s songwriting would hold the same resonance as his performances. Some of his most successful songs include ”Crazy Little Thing Called Love” (#1 in 1980), “Somebody to Love” (#13 in 1977) and “We Are the Champions” (#4, 1978). Queen’s last album, Made in Heaven was released on November 25, 1995, four years to the day after Freddie Mercury died of AIDS.\n\nAs a member of Queen, Mercury was inducted into the Rock N’ Roll Hall of Fame in 2001 and into the Songwriters Hall of Fame in 2003."}, {"url": "https://www.pbs.org/wnet/americanmasters/blog/7-things-didnt-know-hollywood-star-inventor-hedy-lamarr/", "page_content": "by Elisa Lichtenbaum\n\nHollywood star Hedy Lamarr was –for a time– known as the most beautiful woman in the world. She graced the cover of every magazine, and inspired women everywhere to part their hair down the middle and darken their makeup to achieve her iconic look.\n\nBut the Austrian-born starlet was also an inventor whose pioneering work — a frequency-hopping communications system created to help defeat the Nazis during World War II — is the basis for today’s WiFi, GPS and Bluetooth technologies. Lamarr’s beauty stood in the way of her getting the credit she deserved for this groundbreaking invention.\n\nHere are 7 fascinating facts about this iconic movie star-turned-inventor.\n\n1) Her first film was banned by the Pope and Hitler.\n\nLamarr soared to international stardom at age 18 when she appeared in the 1933 Czech film Ecstasy. While some critics today have declared Ecstasy an arthouse classic, its nudity and sexual nature were considered scandalous when it was originally released. The Pope denounced the film in the Vatican newspaper, the Catholic Legion of Decency condemned it, and Hitler banned it in Germany – because Lamarr (then Hedy Kiesler) was Jewish.\n\n2) She was the model for Snow White and Catwoman.\n\nInk-black tresses. Cherry-red lips. Porcelain doll complexion. Lamarr’s beauty was simultaneously classic and exotic, making her the perfect model for Disney’s Snow White. Lamarr was also the inspiration for Catwoman in the original Batman comics. More recently, actress Anne Hathaway told The Washington Post that she studied Lamarr’s voice while preparing for the role of Catwoman in the 2012 film The Dark Knight Rises.\n\n3) She’s a rock star at Google.\n\nGoogle paid tribute to Lamarr in a smart and stylish 2015 Google Doodle celebrating her 101st birthday. According to Jennifer Hom, who designed the Doodle, Lamarr has “a kind of mythical status” at Google. “Within the nerd community at Google, Hedy Lamarr is a beloved figure,” she remarked in a blog. “We love highlighting stories about women’s achievements in science and technology. When the story involves a 1940s Hollywood star-turned-inventor who helped develop technologies we use with our smartphones today, we have to share it with the world.”\n\n4) She’s in the Mel Brooks film Blazing Saddles…sort of.\n\nForget the campfire flatulence. One of our favorite moments in Mel Brooks’ uproarious comedy Blazing Saddles is when Harvey Korman says, “It’s not Hedy, it’s Hedley. Hedley Lamarr.” Brooks, the subject of the popular American Masters documentary Mel Brooks: Make a Noise, named Korman’s conniving character Hedley Lamarr as an affectionate tongue-in-cheek homage to the actress – but she was not amused. She sued Warner Bros. and was awarded a small out-of-court settlement and an apology from Brooks for “almost using her name.” Don’t miss Brooks’ interview in Bombshell.\n\n5) She received a patent for her invention.\n\nLamarr teamed up with avant-garde composer George Antheil (Ballet Mécanique) to create her frequency-hopping technology, basing its functionality on player pianos. They received a patent from the National Inventors Council for their idea in 1942 and shared it with the Navy — but Lamarr was told to sell kisses for war bonds instead. Their technology was used decades later during the Cuban Missile Crisis, but they never earned any money from it as the patent had expired.\n\n6) She produced her own movies.\n\nLamarr was often frustrated by the limited roles she was offered while under contract at MGM, such as the sarong-clad seductress Tondelayo in White Cargo (1942). When her contract lapsed, she produced her own films, including The Strange Woman (1946), Dishonored Lady (1947) and the epic The Loves of Three Queens (1954). “I don’t recall anybody except Hedy who went out and actually produced a movie. It was very unusual in 1946,” Robert Osborne, longtime TCM host and Lamarr’s close friend, observes in Bombshell. “The system didn’t welcome it. They didn’t want movie stars producing their own films – especially the women.”\n\n7) She was inducted into the National Inventors Hall of Fame.\n\nWhile Lamarr didn’t receive the widespread recognition she deserved for the groundbreaking technology she invented, she was inducted into the National Inventors Hall of Fame posthumously in 2014. And in 1997, at age 84, she was honored with the American Electronic Frontier Foundation’s Pioneer Award. According to Richard Rhodes, author of Hedy’s Folly: The Life and Breakthrough Inventions of Hedy Lamarr, when the Foundation called to tell her about the award, she replied, “Well, it’s about time.” Rhodes is interviewed in Bombshell.\n\nLearn more about Bombshell: The Hedy Lamarr Story.\n\nElisa Lichtenbaum | @ElisaVonTap\n\nElisa Lichtenbaum is Senior Writer at WNET, editor of its monthly program guide, a tap dancer, and theater geek."}]}