{"A. P. J. Abdul Kalam was born and raised in Rameswaram, Tamil Nadu.": [{"url": "https://www.britannica.com/biography/A-P-J-Abdul-Kalam", "page_content": "A.P.J. Abdul Kalam won many awards, both from the Indian government and from the international community. His most notable awards were the Padma Vibhushan, won in 1990, and the Bharat Ratna, won in 1997, for his contributions to science and engineering and service to the government.\n\nA.P.J. Abdul Kalam created the Technology Vision 2020 project in 1998. The project sought to develop India’s economy through technology, particularly as applied to agriculture, and increase the availability of health care and education. In recognition of Kalam’s services to the country and broad popularity, the National Democratic Alliance nominated him for president in 2002.\n\nA.P.J. Abdul Kalam attended the Madras Institute of Technology, where he received a degree in aeronautical engineering in 1960. After graduation he joined the Defence Research and Development Organisation (DRDO)—an Indian military research institute—and later the Indian Space Research Organisation (ISRO). Kalam’s associations were not limited to research organizations: he was also associated with political groups, such as the National Democratic Alliance (NDA).\n\nA.P.J. Abdul Kalam served as president of the Republic of India from 2002 to 2007. As president, Kalam promoted the advancement of the national nuclear weapons program. Kalam also devised a 20-year action plan to achieve economic growth through technological development in India.\n\nA.P.J. Abdul Kalam, in full Avul Pakir Jainulabdeen Abdul Kalam, (born October 15, 1931, Rameswaram, India—died July 27, 2015, Shillong), Indian scientist and politician who played a leading role in the development of India’s missile and nuclear weapons programs. He was president of India from 2002 to 2007.\n\nKalam earned a degree in aeronautical engineering from the Madras Institute of Technology and in 1958 joined the Defence Research and Development Organisation (DRDO). In 1969 he moved to the Indian Space Research Organisation, where he was project director of the SLV-III, the first satellite launch vehicle that was both designed and produced in India. Rejoining DRDO in 1982, Kalam planned the program that produced a number of successful missiles, which helped earn him the nickname “Missile Man.” Among those successes was Agni, India’s first intermediate-range ballistic missile, which incorporated aspects of the SLV-III and was launched in 1989.\n\nBritannica Quiz Explore India Quiz\n\nFrom 1992 to 1997 Kalam was scientific adviser to the defense minister, and he later served as principal scientific adviser (1999–2001) to the government with the rank of cabinet minister. His prominent role in the country’s 1998 nuclear weapons tests solidified India as a nuclear power and established Kalam as a national hero, although the tests caused great concern in the international community. In 1998 Kalam put forward a countrywide plan called Technology Vision 2020, which he described as a road map for transforming India from a less-developed to a developed society in 20 years. The plan called for, among other measures, increasing agricultural productivity, emphasizing technology as a vehicle for economic growth, and widening access to health care and education.\n\nIn 2002 India’s ruling National Democratic Alliance (NDA) put forward Kalam to succeed outgoing President Kocheril Raman Narayanan. Kalam was nominated by the Hindu nationalist (Hindutva) NDA even though he was Muslim, and his stature and popular appeal were such that even the main opposition party, the Indian National Congress, also proposed his candidacy. Kalam easily won the election and was sworn in as India’s 11th president, a largely ceremonial post, in July 2002. He left office at the end of his term in 2007 and was succeeded by Pratibha Patil, the country’s first woman president.\n\nUpon returning to civilian life, Kalam remained committed to using science and technology to transform India into a developed country and served as a lecturer at several universities. On July 27, 2015, he collapsed while delivering a lecture at the Indian Institute of Management Shillong and was pronounced dead from cardiac arrest soon afterward.\n\nKalam wrote several books, including an autobiography, Wings of Fire (1999). Among his numerous awards were two of the country’s highest honours, the Padma Vibhushan (1990) and the Bharat Ratna (1997)."}, {"url": "https://learn.culturalindia.net/a-p-j-abdul-kalam.html", "page_content": "Avul Pakir Jainulabdeen Abdul Kalam, better known as APJ Abdul Kalam, was an Indian scientist and statesman who served as the 11th President of India\n\n11th President of India (July 25, 2002 – July 25, 2007)\n\nDate of Birth: October 15, 1931\n\nPlace of Birth: Rameswaram, Ramnad District, Madras Presidency, British India\n\nParents: Jainulabdeen (Father) and Ashiamma (Mother)\n\nSpouse: Remained Unmarried\n\nEducation: St. Joseph’s College, Tiruchirappalli; Madras Institute of Technology\n\nProfession: Professor, Author, Scientist\n\nDied: July 27, 2015\n\nPlace of Death: Shillong, Meghalaya, India\n\nAwards: Bharat Ratna (1997), Padma Vibhushan (1990), Padma Bhushan (1981)\n\nAvul Pakir Jainulabdeen Abdul Kalam, better known as APJ Abdul Kalam, was an illustrious scientist turned statesman who served as the 11th President of India from 2002 to 2007. Kalam spent more than forty years as a science administrator and scientist mainly at the Indian Space Research Organization (ISRO) and Defence Research and the Development Organization (DRDO). He was closely associated with the military missile development efforts and civilian space programme of India. For his work on launch vehicle technology and development of ballistic missile, he was given the pseudonym of ‘The Missile Man of India.’ In 1998, he played a prominent role in Pokhran-II Nuclear Tests.\n\nIn 2002, he was elected the 11th President of the country and became widely known as the ‘People’s President.’ After serving his presidential term he pursued what he loved most – teaching, writing and reading. For his achievements and contributions as a scientist, he was honoured with the ‘Bharat Ratan Award,’ India’s highest civilian honour.\n\nHe left for the heavenly abode on July 27, 2015, while delivering a lecture at the Indian Institute of Management (IIM) Shillong. He was laid to rest with full state-honours and his funeral was attended by thousands of people including national-level dignitaries.\n\nEarly Life\n\nAPJ Abdul Kalam was born into a poor Tamil Muslim family in the pilgrimage town of Rameswaram, Tamil Nadu, on October 15, 1931. His mother, Ashiamma, was a housewife and his father, Jainulabdeen, was an imam of a local mosque and a boat owner. He was the youngest in the family with four elder brothers and a sister.\n\nThough, the family was not financially affluent yet all the children were raised in an atmosphere that was full of love and compassion. In order to add to the family’s income, Kalam had to sell newspapers during his early years.\n\nHe was an average student during his school, but possessed a strong desire to learn and was very hard working. He loved mathematics and spent hours studying the subject. He pursued his education from ‘Schwartz Higher Secondary School,’ and then graduated from ‘Saint Joseph’s College, Tiruchirappalli,’ in 1954. He wanted to become a fighter pilot but his dream could not be fulfilled as here were only eight positions available in the IAF and he secured the ninth place.\n\nCareer\n\nAs A Scientist\n\nIn 1960, he graduated from the ‘Madras Institute of Technology,’ and joined as a scientist at the ‘Aeronautical Development Establishment,’ after becoming a member of the ‘Defence Research and Development Service.’ Kalam also worked under the eminent space scientist Vikram Sarabhai while he was a part of ‘INCOSPAR’ committee. Kalam was transferred to the ‘Indian Space Research Organization (ISRO)’ in 1969. He became the project head of the country’s foremost Satellite Launch Vehicle (SLV-III). In July 1980, SLV-III deployed the ‘Rohini’ satellite successfully near-earth orbit under Kalam’s leadership.\n\nKalam was a part of a number of projects, including ‘Project Devil,’ in 1970. Though the project was not successful, yet it laid the foundation for the development of the ‘Prithvi Missile,’ in 1980. He was also associated with ‘Project Valiant.’\n\nIn 1983, Kalam returned to DRDO as its chief as he was asked to lead the ‘Integrated Guided Missile Development Program’ (IGMDP).\n\nIn May 1998, he played a key role in carrying out ‘Porkhran-II’ nuclear tests by India. The success of these nuclear tests made Kalam a national hero and his popularity went skyrocketing.\n\nAs a technical visionary, he made several recommendations in the fields of technological innovations, agriculture, and nuclear energy to make India a developed nation by 2020.\n\nAs President\n\nIn 2002, Kalam was chosen the Presidential nominee by the ruling National Democratic Alliance (NDA), and he was elected the President. He became the 11th President of India on July 25, 2002 and served the position till July 25, 2007.\n\nHe also became the third President of India to have received ‘Bharat Ratna’ before assuming the office of the President.\n\nDue to his style of working and interaction with common people, especially the youth, he was affectionately called ‘The People’s President.’ According to Dr. Kalam, the most arduous decision he had taken during his tenure was that of signing the ‘Office of Profit Bill.’\n\nDuring his tenure as President, he faced criticism for his inaction in deciding the fate of mercy petitions that were submitted to him. Out of the 21 mercy petitions, he acted only on one mercy plea. In 2005, he recommended for President’s rule in Bihar, which also became a controversial decision.\n\nAs An Academician\n\nAfter the end of his presidential term, he became a visiting professor at the ‘Indian Institute of Management (IIM), Ahemdabad,’ ‘Indian Institute of Management ((IIM), Indore,’ and the ‘Indian Institute of Management (IIM), Shillong.’ He served as a professor of Aerospace Engineering at Anna University, as chancellor at the ‘Indian Institute of Space Science and Technology Thiruvananthapuram,’ an honorary fellow of ‘Indian Institute of Science (IISc), Bangalore,’ and an adjunct at a number of other research and academic institutes across the country. He also taught technology at ‘Anna University,’ and ‘Banaras Hindu University,’ and taught information technology at the ‘International Institute of Information Technology (IIIT), Hyderabad.’\n\nWith an aim to defeat corruption and bring efficiency, Kalam launched a program for the youth, called ‘What Can I Give Movement,’ in 2012.\n\nAwards and Achievements\n\nKalam was honoured with the prestigious ‘Bharat Ratan,’ ‘Padma Vibhushan,’ and ‘Padma Bhushan’ from the Government of India.\n\nHe was bestowed upon the ‘Indira Gandhi Award for National Integration’ by the Government of India in 1997.\n\nHe was the recipient of Veer Savarkar Award.\n\nIn 2000, he was bestowed with ‘Ramanujan Award’ by the ‘Alwars Research Centre.’\n\nIn 2007, he received the ‘Kings Charles II Medal’ from the Royal Society.\n\nThe ASME Foundation, USA, honoured Kalam with the Hoover Medal.\n\nHe also received honorary doctorate from 40 universities.\n\nThe United Nations recognized Kalam’s 79 th birthday as World Students’ Day.\n\nbirthday as World Students’ Day. In 2003 and 2006, he was nominated for the ‘MTV Youth Icon of the Year.’\n\nDeath\n\nKalam went to IIM Shillong to deliver a lecture on ‘Creating a Livable Planet Earth,’ on July 27, 2015. While climbing a flight of stairs, he expressed some discomfort, but made his way to the auditorium. Only five minutes into the lecture, around 6:35pm IST, he collapsed in the lecture hall. He was taken to ‘Bethany Hospital’ in a critical condition. He was kept in the intensive care unit but lacked signs of life. At 7:45pm IST, he was declared dead due to cardiac arrest.\n\nKalam’s body was airlifted in an Indian Air Force helicopter and was flown to New Delhi on July 28. Numerous dignitaries and masses paid homage to him at his residence at 10 Rajaji Marg. Kalam’s body, wrapped in the national flag, was then flown to the town of Mandapam, from where an army truck took it to his home town of Rameswaram. His body was displayed at Rameswaram in front of a bus station to allow people to pay their last respect to the departed soul. On July 30, 2015, the former President was laid to rest with full state honours at Rameswaram’s Pei Karumbu Ground. Kalam’s last rites were attended by more than 350,000 people.\n\nDr. APJ Abdul Kalam and the Youth\n\nDestiny was seen being benevolent when death beseeched Kalam while he was doing what he wanted to do throughout his life – sharing knowledge. Kalam took the final gasp doing what he loved most, and amongst those whom he loved the most – the youth. His life became a paradigm for the youth of the country. He became a role model and inspiration for the younger generation due to his humble nature, simple and easy going personality, and his ability to connect with young minds.\n\nHis Writings\n\nDr Kalam authored and co-authored a number of instructional and inspirational books, including ‘India 2020: A Vision for the New Millennium,’ ‘Wings of Fire,’ ‘The Luminous Sparks: A Biography in Verse and Colours,’ ‘Mission of India: A Vision of Indian Youth,’ ‘You Are Born To Blossom,’ ‘Ignited Minds: Unleashing the Power within India,’ ‘Guiding Souls,’ ‘Inspiring Thoughts,’ ‘Turning Points: A Journey Through Challenges,’ ‘Transcendence My Spiritual Experiences,’ ‘Beyond 2020: A Vision for Tomorrow’s India,’ and various others.\n\nInteresting Facts About Dr. APJ Abdul Kalam"}, {"url": "https://www.jagranjosh.com/general-knowledge/apj-abdul-kalam-questions-and-answers-1571144999-1", "page_content": "Avul Pakir Jainulabdeen Abdul Kalam was an Indian aerospace scientist who served as the 11th President of India from 2002 to 2007. He was born and raised in Rameswaram, Tamil Nadu, and studied Physics and aerospace engineering.\n\nThe birth anniversary of Dr. APJ Abdul Kalam is observed as World Students' Day which was declared by the United Nations Organisation in 2010.\n\nThe “Missile Man of India” and “People's President of India” are the nicknames of the former President of India and Indian scientist Dr. A.P.J. Abdul Kalam. His association with India's Space and Missile Development Program gave him the identity of \"Missile Man of India\". Take this quiz on Dr. A.P.J. Abdul Kalam to know more about him.\n\nDr. APJ Abdul Kalam death anniversary is observed every year on July 27. He passed away in 2015 while giving a lecture at the Indian Institute of Management, Shillong at the age of 83 after suffering from cardiac arrest.\n\n1. What is the full name of Dr. Abdul Kalam?\n\n(a) Avul Jakir Jalaluddin Kalam\n\n(b) Avul Pakir Jainulabdeen Abdul Kalam\n\n(c) Abdul Sakir Jainulabdeen Kalam\n\n(d) None of the above\n\nAnswer: b\n\nExplanation: The full name of Dr. Abdul Kalam was Avul Pakir Jainulabdeen Abdul Kalam.\n\n2. When was Dr. A.P.J. Abdul Kalam born?\n\n(a) 15 October 1931\n\n(b) 2 September 1929\n\n(c) 15 August 1923\n\n(d) 29 February 1936\n\nAnswer: a\n\nExplanation: Dr. A.P.J. Abdul Kalam was born in Dhanushkodi, Rameswaram, Tamil Nadu, India on 15 October 1931. He was born in a Muslim Family.\n\nREAD| Dr. A.P.J. Abdul Kalam – The Missile Man of India\n\n3. Which island is named after Dr. A.P.J. Abdul Kalam?\n\n(a) Wheeler Island, Odisha\n\n(b) Landfall Island\n\n(c) Bhavani Island\n\n(d) Sriharikota\n\nAnswer: a\n\nExplanation: Wheeler Island, located in Odisha, is currently known as Dr. Abdul Kalam Island. The island is located off the coast of Odisha, approximately 150 kilometers east of the state capital Bhubaneshwar.\n\n4. Which of the following book is not written by Dr. A.P.J. Abdul Kalam?\n\n(a) Failure to Success: Legendary Lives\n\n(b) You Are Born to Blossom\n\n(c) Ignited Minds\n\n(d) A House for Mr. Biswas‎\n\nAnswer:d\n\nExplanation: A House for Mr. Biswas was written by V. S. Naipaul in 1961. The rest of the books mentioned above were written by Dr. A.P.J. Abdul Kalam.\n\n5. Which of the following statement is NOT correct about Dr. A.P.J. Abdul Kalam?\n\n(a) Dr. Abdul Kalam received the Bharat Ratna in 2007\n\n(b) Dr. Abdul Kalam died on 17 July 2015 (aged 83) in Assam, India\n\n(c) India 2020: A Vision for the New Millennium was written in 1998.\n\n(d) Kalam worked at the Defence Research and Development Organisation\n\nAnswer: b\n\nExplanation: Dr. Abdul Kalam died on 27 July 2015 (aged 83) in Shillong, Meghalaya, India while delivering a lecture at the Indian Institute of Management Shillong. Dr. A.P.J. Abdul Kalam collapsed and died due to cardiac arrest.\n\n6. Which of the following award is not given to Dr. A.P.J. Abdul Kalam?\n\n(a) Padma Bhushan\n\n(b) Padma Vibhushan\n\n(c) Shanti Swaroop Bhatnagar\n\n(d) Bharat Ratna\n\nAnswer:c\n\nExplanation: Shanti Swaroop Bhatnagar award is not given to Dr. A.P.J. Abdul Kalam. Kalam received Bharat Ratna (1997), Padma Vibhushan (1990), and Padma Bhushan (1981).\n\n7. Dr. A.P.J. Abdul Kalam was the ......President of India.\n\n(a) 9th\n\n(b) 10th\n\n(c) 11th\n\n(d) 12th\n\nAnswer: c\n\nExplanation: Dr. A.P.J. Abdul Kalam was the 11th President of India. He remained in the office from 25 July 2002 to 25 July 2007.\n\n8. Dr. A.P.J. Abdul Kalam in the Presidential election in 2002 succeeded:\n\n(a) K. R. Narayanan\n\n(b) Lakshmi Sahgal\n\n(c) Krishan Kant\n\n(d) Bhairon Singh Shekhawat\n\nAnswer: b\n\nExplanation: Abdul Kalam defeated Lakshmi Sahgal in the Presidential election held in 2002. He won the 2002 Presidential election with an electoral vote of 922,884 while Lakshmi Sahgal got just 107,366 votes.\n\n9. What is the birthplace of Dr. APJ Abdul Kalam?\n\n(a) Kanyakumari\n\n(b) Ramanathapuram\n\n(c) Rameshwaram\n\n(d) Madurai\n\nAnswer: c\n\nExplanation: Dr. APJ Abdul Kalam was born on October 15, 1931, in Rameswaram, Tamil Nadu.\n\n10. Where is 'Dr. APJ Abdul Kalam National Memorial'?\n\n(a) Pei Karumbu\n\n(b) Krusadai Island\n\n(c) Kattupalli Island\n\n(d) Quibble Island\n\nAnswer: a\n\nExplanation: The Dr. A. P. J. Abdul Kalam National Memorial was built in memory of Kalam by the DRDO in Pei Karumbu, in the island town of Rameswaram, Tamil Nadu. It was inaugurated by Prime Minister Narendra Modi in July 2017.\n\nAPJ Abdul Kalam Death Anniversary 2022: Motivational Quotes and facts about the Missile Man of India"}, {"url": "https://ramanathapuram.nic.in/tourist-place/dr-apj-abdul-kalams-memorial/", "page_content": "Avul Pakir Jainulabdeen Abdul Kalam, better known as A. P. J. Abdul Kalam who was the 11th president of India. Kalam was born and brought up in Rameswaram and became a scientist and worked for DRDO and ISRO. After his sudden demise at Shillong on 27th July 2015, he was laid to rest at Pei Karumbu, Rameswaram on 30th July 2015. A memorial has been built at the burial site. Inside, the memorial, one can see the selected photos, paintings and miniature models of misssiles etc.,. The memorial is less than 1 km from Rameswaram.\n\nPhoto Gallery View All Dr APJ Abdul Kalam's Memorial\n\nDr APJ Abdul Kalam's Memorial Picture 2\n\nDr APJ Abdul Kalam's Memorial Picture 1\n\n\n\n"}, {"url": "https://www.4to40.com/biographies-for-kids/a-p-j-abdul-kalam/", "page_content": "A. P. J. Abdul Kalam — Avul Pakir Jainulabdeen Abdul Kalam (born 15 October 1931 – died 27 July 2015) is an Indian scientist and administrator who served as the 11th President of India from 2002 to 2007. Kalam was born and raised in Rameswaram, Tamil Nadu, studied physics at the St. Joseph’s College, Tiruchirappalli, and aerospace engineering at the Madras Institute of Technology, Chennai.\n\nBefore his term as President, he worked as an Aerospace engineer with Defence Research and Development Organisation (DRDO) and Indian Space Research Organisation (ISRO). Kalam is popularly known as the Missile Man of India for his work on the development of ballistic missile and launch vehicle technology. He played a pivotal organisational, technical and political role in India’s Pokhran-II nuclear tests in 1998, the first since the original nuclear test by India in 1974.\n\nKalam was elected the President of India in 2002, defeating Lakshmi Sahgal, was nominated by Bharatiya Janata Party and supported by opposition Indian National Congress, the major political parties of India. He is currently a visiting professor at Indian Institute of Management Shillong, Indian Institute of Management Ahmedabad and Indian Institute of Management Indore, honorary fellow of Indian Institute of Science, Bangalore, Chancellor of the Indian Institute of Space Science and Technology Thiruvananthapuram, a professor of Aerospace Engineering at Anna University (Chennai), JSS University (Mysuru) and an adjunct/visiting faculty at many other academic and research institutions across India.\n\nKalam advocated plans to develop India into a developed nation by 2020 in his book India 2020. He has received several prestigious awards, including the Bharat Ratna, India’s highest civilian honour. Kalam is known for his motivational speeches and interaction with the student community in India. He launched his mission for the youth of the nation in 2011 called the What Can I Give Movement with a central theme to defeat corruption in India.\n\nEarly Life and Education:\n\nAvul Pakir Jainulabdeen Abdul Kalam was born on 15 October 1931 in a Tamil Muslim family to Jainulabudeen, a boat owner and Ashiamma, a housewife, at Rameswaram, Ramanathapuram District, located in the Indian state of Tamil Nadu. He came from a poor background and started working at an early age to supplement his family’s income. After completing school, Kalam distributed newspapers to financially contribute to his father’s income. In his school years, he had average grades, but was described as a bright and hardworking student who had a strong desire to learn and spend hours on his studies, especially mathematics. He was just a simple man with a great fierceful heart in his childhood. After completing his school education at the Ramanathapuram Schwartz Matriculation School, Kalam went on to attend Saint Joseph’s College, Tiruchirappalli, then affiliated with the University of Madras, from where he graduated in physics in 1954. Towards the end of the course, he was not enthusiastic about the subject and would later regret the four years he studied it. He then moved to Madras in 1955 to study aerospace engineering. While Kalam was working on a senior class project, the Dean was dissatisfied with the lack of progress and threatened revoking his scholarship unless the project was finished within the next three days. He worked tirelessly on his project and met the deadline, impressing the Dean who later said, “I [Dean] was putting you [Kalam] under stress and asking you to meet a difficult deadline”. He narrowly missed achieving his dream of becoming a fighter pilot, as he placed ninth in qualifiers, and only eight positions were available in the IAF.\n\nA. P. J. Abdul Kalam: Career as a scientist\n\nAfter graduating from the Madras Institute of Technology in 1960, Kalam joined the Aeronautical Development Establishment of the Defence Research and Development Organisation (by Press Information Bureau, Government of India) as a scientist after becoming a member of the Defence Research & Development Service (DRDS). He started his career by designing a small hovercraft, but remained unconvinced by his choice of a job at DRDO.Kalam was also part of the INCOSPAR committee working under Vikram Sarabhai, the renowned space scientist.In 1969, Kalam was transferred to the Indian Space Research Organisation (ISRO) where he was the project director of India’s first Satellite Launch Vehicle (SLV-III) which successfully deployed the Rohini satellite in near-earth orbit in July 1980; Kalam had first started work on an expandable rocket project independently at DRDO in 1965.In 1969, Kalam received the government’s approval and expanded the programme to include more engineers.\n\nIn 1963 to 1964, he visited NASA’s Langley Research Center in Hampton, Virginia; Goddard Space Flight Center in Greenbelt, Maryland; and Wallops Flight Facility.Between the 1970s and 1990s, Kalam made an effort to develop the Polar Satellite Launch Vehicle (PSLV) and SLV-III projects, both of which proved to be successful.\n\nKalam was invited by Raja Ramanna to witness the country’s first nuclear test Smiling Buddha as the representative of TBRL, even though he had not participated in its development. In the 1970s, Kalam also directed two projects, Project Devil and Project Valiant, which sought to develop ballistic missiles from the technology of the successful SLV programme. Despite the disapproval of the Union Cabinet, Prime Minister Indira Gandhi allotted secret funds for these aerospace projects through her discretionary powers under Kalam’s directorship. Kalam played an integral role convincing the Union Cabinet to conceal the true nature of these classified aerospace projects.His research and educational leadership brought him great laurels and prestige in the 1980s, which prompted the government to initiate an advanced missile programme under his directorship. Kalam and Dr V S Arunachalam, metallurgist and scientific adviser to the Defence Minister, worked on the suggestion by the then Defence Minister, R. Venkataraman on a proposal for simultaneous development of a quiver of missiles instead of taking planned missiles one after another. R Venkatraman was instrumental in getting the cabinet approval for allocating ₹ 3.88 billion for the mission, named Integrated Guided Missile Development Programme (IGMDP) and appointed Kalam as the chief executive. Kalam played a major part in developing many missiles under the mission including Agni, an intermediate range ballistic missile and Prithvi, the tactical surface-to-surface missile, although the projects have been criticized for mismanagement and cost and time overruns.\n\nA. P. J. Abdul Kalam served as the Chief Scientific Adviser to the Prime Minister and Secretary of the Defence Research and Development Organisation from July 1992 to December 1999. The Pokhran-II nuclear tests were conducted during this period in which he played an intensive political and technological role. Kalam served as the Chief Project Coordinator, along with Rajagopala Chidambaram, during the testing phase. Media coverage of Kalam during this period made him the country’s best known nuclear scientist.\n\nIn 1998, along with cardiologist Soma Raju, Kalam developed a low cost coronary stent, named the “Kalam-Raju Stent”. In 2012, the duo designed a rugged tablet computer for health care in rural areas, which was named the “Kalam-Raju Tablet”.\n\nPresidency:\n\nKalam served as the 11th President of India, succeeding K. R. Narayanan. He won the 2002 presidential election with an electoral vote of 922,884, surpassing the 107,366 votes won by Lakshmi Sahgal. His term lasted from 25 July 2002 to 25 July 2007. During his term as president, he was affectionately known as the People’s President.\n\nDeath:\n\nOn 27 July 2015, Kalam travelled to Shillong to deliver a lecture on “Creating a Livable Planet Earth” at the Indian Institute of Management Shillong. While climbing a flight of stairs, he experienced some discomfort, but was able to enter the auditorium after a brief rest. At around 6:35 p.m. IST, only five minutes into his lecture, he collapsed. He was rushed to the nearby Bethany Hospital in a critical condition; upon arrival, he lacked a pulse or any other signs of life. Despite being placed in the intensive care unit, Kalam was confirmed dead of a sudden cardiac arrest at 7:45 p.m IST."}, {"url": "https://www.makerstimeline.com/a-p-j-abdul-kalam-former-president/", "page_content": "Avul Pakir Jainulabdeen (APJ) Abdul Kalam was an Indian aerospace scientist in ISRO and he was the 11th President of India. He was born and raised in Rameswaram, Tamil Nadu , India. He studied physics and aerospace engineering. He Wrote many books.\n\nHe was keen on encouraging the students in India to take active interest in the emerging Technologies, including Space Tech, as these significantly impact our daily lives.\n\nDr. A. P. J. Abdul Kalam, better known as “The Missile Man of India”.\n\nAPJ. Abdul Kalam Timeline"}, {"url": "https://www.legalbites.in/categories/more/book-review/book-review-wings-of-fire-apj-abdul-kalam-895513", "page_content": "'Wings of Fire' is the autobiography of Dr A.P.J. Abdul Kalam and contains the story of Dr Kalam’s rise from a middle-class family with great determination and his unparalleled career as a defence scientist, culminating in the highest civilian award in India, the Bharat Ratna. The story also contains his journey as the 11th President of India in 2002. The story inspires every individual to achieve dreams with a proper vision towards his/her goal. Ananya Kukreti reviews the book.\n\nOverview\n\nBook Name: Wings of Fire\n\nAuthors Name: A P J Abdul Kalam, Arun Tiwari\n\nFirst Published: 1999\n\n\n\nGenre: Autobiography\n\nLanguage: English\n\nOne of the best habits a person may have is reading. Reading is a healthy habit. Wings of Fire by Dr A.P.J Abdul Kalam, a former Indian president, wrote an autobiography. He wrote it and Mr Arun Tiwari, a well-known missile scientist who was Dr A.P.J Abdul Kalam's colleague. Dr Kalam explores his upbringing, struggles, perseverance, good fortune, and chance events that ultimately led him to take charge of India's nuclear and missile programmes and its space exploration efforts.\n\nAbout the Author\n\nHis full name is \"Avul Pakir Jainulabeen Abdul Kalam,\" and he was born and raised in Rameswaram, Tamil Nadu, on Mosque Street. From 2002 to 2007, he presided as India's eleventh president.\n\n\n\nHe was a scientist by trade and was highly esteemed throughout India. He was instrumental in the creation of India's missile programme. From modest beginnings in Rameswaram, Tamil Nadu. In his motivational autobiography \"The Wings of Fire,\" Dr Kalam describes his ascent to success and his life's journey. After the publication of Wings of Fire, a book he co-wrote with Dr A.P.J. Abdul Kalam, Arun Tiwari became well-known as a writer. He has co-authored five books with Dr A.P.J Abdul Kalam and has written several other publications. He contributed to the missile design. The Cardiovascular Technologies Institute in Hyderabad has had Tiwari as its director. He created the Kalam-Raju stent, for which he was given the Defense Technology Spinoff Award.\n\nAbout the Book\n\n\n\nThe life of a straightforward but tenacious person is depicted in this novel. This book contains a wealth of information and positive qualities that everybody can benefit from. It's a comforting and lovely experience to read this book.\n\n\n\nThis book gives a very thorough explanation of how lofty goals can be realised with straightforward concepts. The writers' advice to always maintain your dream high, and your goal distinct, plan meticulously, and work hard is conveyed in this book.\n\n\n\nThe protagonist of the tale is the son of a common boat owner who has grown to be India's most illustrious living technocrat. He is warm and fiercely passionate. This book discusses a wide range of topics, including unwavering confidence in God, profound kindness, dealing with life positively, scientific and technical breakthroughs, love for one's nation, and many others. Dr A.P.J Kalam's life experiences, insights, and private moments are all included in the book. It enables us to comprehend his successful career path.\n\n\n\nThe boy in this tale was born into a typical middle-class family. He was interested in the field of aeronautical engineering. He encountered a lot of difficulties while launching the satellite known as the SLV [Satellite Launching Vehicle], but he managed to show that everything is possible if you keep trying since every failure brings you that much closer to success.\n\n\n\nBecause he was adamant that every one of us was born with the strength and potential to make a real difference in the world, the author encourages the reader to identify with their inner fire and potential by telling his or her own life experience. The book does a good job of capturing how he motivated himself to pursue his dream and how he went about achieving so much.\n\nThe book recalls several tales and anecdotes from his early years, his days in school and college, He claimed that the time spent at the Wallops Flying Facility, NASA, and Langley Research Center attracted a lot of attention.\n\n\n\nTragic personal events have not been overlooked. He has written extensively on the moment he lost his father and how he felt after receiving numerous honours including the Padma Bhushan.\n\nThe author, a scientist who significantly aided in the development of the nation's guided missile programme, a ground-breaking effort for the country's security, is the subject of the book's second part. He was given the moniker \"Missile Man of India\" for good cause.\n\n\n\nMy Opinion\n\nI hope young people can read this book and be inspired to dream and take risks. It demonstrates how a person with a humble upbringing becomes the first citizen of a country with a billion people.\n\n\n\nEveryone may learn something from this book, and it deserves to be read by every Indian. A really thorough explanation of how great things may be accomplished with the help of basic thinking. Constantly keep your dream high, establish clear goals, make meticulous plans, and collaborate with others. If you haven't already, I urge you not to skip reading this fantastic book.\n\n\n\nQuote from Wings of Fire,\n\n“We are all born with a divine fire in us. Our efforts should be to give wings to this fire and fill the world with the glow of its goodness.”\n\nImportant Links\n\nLaw Library: Notes and Study Material for LLB, LLM, Judiciary, and Entrance Exams"}, {"url": "https://amirshaikh02.github.io/TRIBUTE-PAGE/", "page_content": "The Life of Hedy\n\n15 October 1931 A star is born.\n\nA. P. J. Abdul Kalam\n\nAvul Pakir Jainulabdeen Abdul Kalam 15 October 1931 – 27 July 2015) was an Indian aerospace scientist who served as the 11th president of India from 2002 to 2007. He was born and raised in Rameswaram, Tamil Nadu and studied physics and aerospace engineering. He spent the next four decades as a scientist and science administrator, mainly at the Defence Research and Development Organisation (DRDO) and Indian Space Research Organisation (ISRO) and was intimately involved in India's civilian space programme and military missile development efforts. He thus came to be known as the Missile Man of India for his work on the development of ballistic missile and launch vehicle technology. He also played a pivotal organisational, technical, and political role in India's Pokhran-II nuclear tests in 1998, the first since the original nuclear test by India in 1974.\n\nKalam was elected as the 11th president of India in 2002 with the support of both the ruling Bharatiya Janata Party and the then-opposition Indian National Congress. Widely referred to as the \"People's President\", he returned to his civilian life of education, writing and public service after a single term. He was a recipient of several prestigious awards, including the Bharat Ratna, India's highest civilian honour.\n\nWhile delivering a lecture at the Indian Institute of Management Shillong, Kalam collapsed and died from an apparent cardiac arrest on 27 July 2015, aged 83. Thousands, including national-level dignitaries, attended the funeral ceremony held in his hometown of Rameswaram, where he was buried with full state honours.\n\nEarly life and education\n\nAvul Pakir Jainulabdeen Abdul Kalam was born on 15 October 1931 to a Tamil Muslim family in the pilgrimage centre of Rameswaram on Pamban Island, then in the Madras Presidency and now in the State of Tamil Nadu. His father Jainulabdeen Marakayar was a boat owner and imam of a local mosque; his mother Ashiamma was a housewife.\n\nHis father owned a ferry that took Hindu pilgrims back and forth between Rameswaram and the now uninhabited Dhanushkodi. Kalam was the youngest of four brothers and one sister in his family. His ancestors had been wealthy Marakayar traders and landowners, with numerous properties and large tracts of land. Even though his ancestors had been wealthy Marakayar traders, the family had lost most of its fortunes by the 1920s and was poverty-stricken by the time Kalam was born.\n\nMarakayar are a Muslim ethnic found in coastal Tamil Nadu and Sri Lanka who claim descendance from Arab traders and local women. Their business had involved trading groceries between the mainland and the island and to and from Sri Lanka, as well as ferrying pilgrims between the mainland and Pamban. As a young boy he had to sell newspapers in order to add to the family's meager income. With the opening of the Pamban Bridge to the mainland in 1914, however, the businesses failed and the family fortune and properties were lost over time, apart from the ancestral home.\n\nCareer as a scientist\n\nThis was my first stage, in which I learnt leadership from three great teachers—Dr Vikram Sarabhai, Prof Satish Dhawan and Dr Brahm Prakash. This was the time of learning and acquisition of knowledge for me.\n\nAfter graduating from the Madras Institute of Technology in 1960, Kalam joined the Aeronautical Development Establishment of the Defence Research and Development Organisation (by Press Information Bureau, Government of India) as a scientist after becoming a member of the Defence Research & Development Service (DRDS). He started his career by designing a small hovercraft, but remained unconvinced by his choice of a job at DRDO. Kalam was also part of the INCOSPAR committee working under Vikram Sarabhai, the renowned space scientist. In 1969, Kalam was transferred to the Indian Space Research Organisation (ISRO) where he was the project director of India's first Satellite Launch Vehicle (SLV-III) which successfully deployed the Rohini satellite in near-earth orbit in July 1980; Kalam had first started work on an expandable rocket project independently at DRDO in 1965. In 1969, Kalam received the government's approval and expanded the programme to include more engineers.\n\nIn 1963 to 1964, he visited NASA's Langley Research Center in Hampton, Virginia; Goddard Space Flight Center in Greenbelt, Maryland; and Wallops Flight Facility. Between the 1970s and 1990s, Kalam made an effort to develop the Polar Satellite Launch Vehicle (PSLV) and SLV-III projects, both of which proved to be successful.\n\nOn 27 July 2015, Kalam travelled to Shillong to deliver a lecture on \"Creating a Livable Planet Earth\" at the Indian Institute of Management Shillong. While climbing a flight of stairs, he experienced some discomfort, but was able to enter the auditorium after a brief rest. At around 6:35 p.m. IST, only five minutes into his lecture, he collapsed. He was rushed to the nearby Bethany Hospital in a critical condition; upon arrival, he lacked a pulse or any other signs of life.[85] Despite being placed in the intensive care unit, Kalam was confirmed dead of a sudden cardiac arrest at 7:45 p.m. IST. His last words, to his aide Srijan Pal Singh, were reportedly: \"Funny guy! Are you doing well?\n\n27 July 2015 Dies"}, {"url": "https://pantheon.world/profile/person/A._P._J._Abdul_Kalam/", "page_content": "A. P. J. Abdul Kalam\n\nAvul Pakir Jainulabdeen Abdul Kalam BR ( (listen); 15 October 1931 – 27 July 2015) was an Indian aerospace scientist and statesman who served as the 11th president of India from 2002 to 2007. He was born and raised in Rameswaram, Tamil Nadu and studied physics and aerospace engineering. He spent the next four decades as a scientist and science administrator, mainly at the Defence Research and Development Organisation (DRDO) and Indian Space Research Organisation (ISRO) and was intimately involved in India's civilian space programme and military missile development efforts . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of A. P. J. Abdul Kalam has received more than 40,817,894 page views. His biography is available in 80 different languages on Wikipedia (up from 75 in 2019) . A. P. J. Abdul Kalam is the 171st most popular politician (up from 220th in 2019), the 9th most popular biography from India (down from 7th in 2019) and the 4th most popular Indian Politician.\n\nA. P. J. Abdul Kalam is most famous for being the 11th President of India, and for his contributions to the development of India's missile and space programs."}, {"url": "https://www.jagranjosh.com/general-knowledge/apj-abdul-kalam-biography-1658908435-1", "page_content": "APJ Abdul Kalam Biography: Dr. APJ Abdul Kalam was an Indian aerospace scientist who served as the 11th President of India from 2002 to 2007. He was born on October 15, 1931, raised in Rameswaram, Tamil Nadu, and studied Physics and aerospace engineering. APJ Abdul Kalam was elected as the 11th President of India in 2002 with the support of both the ruling Bharatiya Janata Party and the then opposition Indian National Congress party. Also referred to as ‘People’s President’, APJ Abdul Kalam returned to his civilian life of education, writing, and public service after serving only one term.\n\nRead APJ Abdul Kalam’s Biography and learn more about his education, achievement, inventions, full name, quotes, and other important details.\n\nAPJ Abdul Kalam Biography\n\nFull Name Avul Pakir Jainulabdeen Abdul Kalam Birth Date October 15, 1931 Birth Place Rameswaram, Madras Presidency, British India Parents Jainulabdeen Marakayar and Ashiamma Death July 27, 2015 Political Affiliations National Democratic Alliance (NDA) Profession Aerospace Scientist, Author Awards Padma Bhushan, Padma Vibhushan, Bharat Ratna, Indira Gandhi Award for National Integration, Veer Savarkar Award, SASTRA Ramanujan Prize Field Aerospace Engineering Institutions Defence Research and Development Organisation (DRDO), Indian Space Research Organisation (ISRO) Alma Mater St Joseph’s College, Tiruchirappalli (BEng), Madras Institute of Technology (MEng) Office Former President of India\n\nAPJ Abdul Kalam Early Life, Education\n\nDr. APJ Abdul Kalam was born on October 15, 1981, to a Tamil Muslim family in the pilgrimage center of Rameswaram on Pamban Island. It was then in the Madras Presidency under British India and is now in the State of Tamil Nadu.\n\nAPJ Abdul Kalam’s father Jainulabdeen Marakayar was a boat owner and imam of a local mosque while his mother Ashiamma was a housewife. His father also owned a ferry that took Hindu pilgrims back and forth between Rameswaram and the now uninhabited Dhanushkodi.\n\nAPJ Abdul Kalam was the youngest of four brothers and one sister in his family. His family had been wealthy Marakayar traders and landowners, with numerous properties and large tracts of land. With the opening of the Pamban Bridge to the mainland in 1914, however, the businesses failed and the family fortune and properties were lost over time, apart from the ancestral home.\n\nAs a young boy Kalam had to sell newspapers in order to support his family which was poverty-stricken and was surviving on a meager income.\n\nAPJ Abdul Kalam Education\n\nAPJ Abdul Kalam in his school years had average grades, however, he was described as a bright and hardworking student who had a strong desire to learn. He spent hours on his studies, particularly mathematics. After completing his education at Schwartz Higher secondary school, Abdul Kalam went to attend St. Joseph’s College and graduated in Physics in 1954. He then moved to Madras in 1955 to study aerospace engineering in the Madras Institute of Technology.\n\nAPJ Abdul Kalam as a Scientist\n\nAfter graduating from the Madras Institute of Technology in 1960, APJ Abdul Kalam joined the Aeronautical Development Establishment of the Defence Research and Development Organisation (DRDO) as a scientist after becoming a member of the Defence Research and Development Service. He started his career by designing a small hovercraft, however, remained unconvinced by his job at DRDO.\n\nIn 1969, APJ Abdul Kalam was transferred to the Indian Space Research Organisation (ISRO) where he was the project director of India’s first Satellite Launch Vehicle which successfully deployed the Rohini satellite in near-earth orbit in July 1980.\n\nAPJ Abdul Kalam was also invited by Raja Ramanna to witness the country’s first nuclear test, Smiling Buddha, as the representative of TBRL, even though he had not participated in its development.\n\nGK Questions and Answers on Dr. A.P.J. Abdul Kalam"}], "A. P. J. Abdul Kalam studied physics and aerospace engineering.": [{"url": "https://www.britannica.com/biography/A-P-J-Abdul-Kalam", "page_content": "A.P.J. Abdul Kalam won many awards, both from the Indian government and from the international community. His most notable awards were the Padma Vibhushan, won in 1990, and the Bharat Ratna, won in 1997, for his contributions to science and engineering and service to the government.\n\nA.P.J. Abdul Kalam created the Technology Vision 2020 project in 1998. The project sought to develop India’s economy through technology, particularly as applied to agriculture, and increase the availability of health care and education. In recognition of Kalam’s services to the country and broad popularity, the National Democratic Alliance nominated him for president in 2002.\n\nA.P.J. Abdul Kalam attended the Madras Institute of Technology, where he received a degree in aeronautical engineering in 1960. After graduation he joined the Defence Research and Development Organisation (DRDO)—an Indian military research institute—and later the Indian Space Research Organisation (ISRO). Kalam’s associations were not limited to research organizations: he was also associated with political groups, such as the National Democratic Alliance (NDA).\n\nA.P.J. Abdul Kalam served as president of the Republic of India from 2002 to 2007. As president, Kalam promoted the advancement of the national nuclear weapons program. Kalam also devised a 20-year action plan to achieve economic growth through technological development in India.\n\nA.P.J. Abdul Kalam, in full Avul Pakir Jainulabdeen Abdul Kalam, (born October 15, 1931, Rameswaram, India—died July 27, 2015, Shillong), Indian scientist and politician who played a leading role in the development of India’s missile and nuclear weapons programs. He was president of India from 2002 to 2007.\n\nKalam earned a degree in aeronautical engineering from the Madras Institute of Technology and in 1958 joined the Defence Research and Development Organisation (DRDO). In 1969 he moved to the Indian Space Research Organisation, where he was project director of the SLV-III, the first satellite launch vehicle that was both designed and produced in India. Rejoining DRDO in 1982, Kalam planned the program that produced a number of successful missiles, which helped earn him the nickname “Missile Man.” Among those successes was Agni, India’s first intermediate-range ballistic missile, which incorporated aspects of the SLV-III and was launched in 1989.\n\nBritannica Quiz Explore India Quiz\n\nFrom 1992 to 1997 Kalam was scientific adviser to the defense minister, and he later served as principal scientific adviser (1999–2001) to the government with the rank of cabinet minister. His prominent role in the country’s 1998 nuclear weapons tests solidified India as a nuclear power and established Kalam as a national hero, although the tests caused great concern in the international community. In 1998 Kalam put forward a countrywide plan called Technology Vision 2020, which he described as a road map for transforming India from a less-developed to a developed society in 20 years. The plan called for, among other measures, increasing agricultural productivity, emphasizing technology as a vehicle for economic growth, and widening access to health care and education.\n\nIn 2002 India’s ruling National Democratic Alliance (NDA) put forward Kalam to succeed outgoing President Kocheril Raman Narayanan. Kalam was nominated by the Hindu nationalist (Hindutva) NDA even though he was Muslim, and his stature and popular appeal were such that even the main opposition party, the Indian National Congress, also proposed his candidacy. Kalam easily won the election and was sworn in as India’s 11th president, a largely ceremonial post, in July 2002. He left office at the end of his term in 2007 and was succeeded by Pratibha Patil, the country’s first woman president.\n\nUpon returning to civilian life, Kalam remained committed to using science and technology to transform India into a developed country and served as a lecturer at several universities. On July 27, 2015, he collapsed while delivering a lecture at the Indian Institute of Management Shillong and was pronounced dead from cardiac arrest soon afterward.\n\nKalam wrote several books, including an autobiography, Wings of Fire (1999). Among his numerous awards were two of the country’s highest honours, the Padma Vibhushan (1990) and the Bharat Ratna (1997)."}, {"url": "http://www.museum.mitindia.edu/abdul%20kalam.html", "page_content": "Dr.A.P.J.Abdul Kalam\n\nAvul Pakir Jainulabdeen Abdul Kalam ( 15 October 1931 – 27 July 2015) was an Indian scientist who served as the 11th President of India from 2002 to 2007. He was born and raised in Rameswaram, Tamil Nadu and studied physics and aerospace engineering. An India Scientist and administrator he became the 11th President of India. He studied Aerospace Engineering at the Madras Institute of Technology (MIT). He played a pivotal organizational, technical and political rile in India's Pokhran-ll nuclear tests in 1998, the first since the original nuclear test by India in 1974. APJ Abdul Kalam was perhaps the most illustrious among the alumni of the Madras Institute of Technology. Kalam earned a degree in aeronautical engineering from the Madras Institute of Technology and in 1958 joined the Defence Research and Development Organisation (DRDO). He soon moved to the Indian Space Research Organisation, where he was project director of the SLV-III, India’s first indigenously designed and produced satellite launch vehicle. Rejoining DRDO in 1982, Kalam planned the program that produced a number of successful missiles, which helped earned him the nickname “Missile Man.”\n\nFrom 1992 to 1997 Kalam was scientific adviser to the defense minister, and he later served as principal scientific adviser (1999–2001) to the government with the rank of cabinet minister. His prominent role in the country’s 1998 nuclear weapons tests established Kalam as a national hero, although the tests caused great concern in the international community. In 1998 Kalam put forward a countrywide plan called Technology Vision 2020, which he described as a road map for transforming India from a less-developed to a developed society in 20 years. The plan called for, among other measures, increasing agricultural productivity, emphasizing technology as a vehicle for economic growth, and widening access to health care and education.\n\nIn 2002 India’s ruling National Democratic Alliance (NDA) put forward Kalam to succeed outgoing President Kocheril Raman Narayanan. Kalam was nominated by the Hindu nationalist (Hindutva) NDA even though he was Muslim, and his stature and popular appeal were such that even the main opposition party, the Indian National Congress, also proposed his candidacy. Kalam easily won the election and was sworn in as India’s 11th president, a largely ceremonial post, in July 2002. He remained committed to using science and technology to transform India into a developed country. In 2007, Kalam left office and was succeeded by Pratibha Patil, the country’s first woman president.\n\nKalam wrote several books, including an autobiography, Wings of Fire (1999). Among his numerous awards were two of the country’s highest honours, the Padma Vibhushan (1990) and the Bharat Ratna (1997). He thus came to be known as the Missile Man of India for his work on the development of ballistic missile and launch vehicle technology. He also played a pivotal organisational, technical, and political role in India's Pokhran-II nuclear tests in 1998, the first since the original nuclear test by India in 1974."}, {"url": "https://leverageedu.com/blog/apj-abdul-kalam-education/", "page_content": "Avul Pakir Jainulabdeen Abdul Kalam, popularly known as APJ Abdul Kalam was born in a Tamil Muslim family on October 15th, 1931. Who knew that a lad who was born to poverty-stricken parents would one day become a millennial aerospace scientist and step up to be the 11th President of India? Being on a constant quest to learn and gain as much knowledge as he can, his educational journey was full of challenges. Let us walk you through APJ Abdul Kalam’s education to inspire a large number of students across the world.\n\nEarly Schooling Rameshwaram Elementary School Secondary Schooling Schwartz Higher Secondary School Undergraduate Saint Joseph’s College Postgraduate Madras Institute of Technology Awards Veer Savarkar\n\nBharat Ratna\n\nDistinguished Fellow and Honorary Fellow\n\nPadma Vibhushan\n\nPadma Bhushan\n\nKing Charles II Medal Achievements India’s First SLV (Satellite Launch Vehicle)\n\nNuclear Tests in Pokhran\n\nKalam-Raju Stent (Universal Healthcare Plan)\n\nKalam-Raju tablet\n\nBallistic missiles project Books Ignited Minds\n\nWings of Fire\n\nIndia 2020\n\nTurning Points\n\nForge Your Future\n\nYou are Born to Blossom\n\nAPJ Abdul Kalam’s Education\n\nCourtesy: ALT News\n\nEven though APJ Abdul Kalam was an average student, his desire to read and spend hours studying and learning Mathematics, proved to create a strong foundation in his initial stage of education. Upon completing his schooling at Rameshwaram Elementary School and Schwartz Higher Secondary School, he continued his graduation in Physics from Saint Joseph’s College and later in 1955, he studied Aerospace Engineering at Madras Institute of Technology.\n\nAPJ Abdul Kalam Education\n\nWhen we talk about APJ Abdul Kalam’s education, it is quite prominent that he always wanted to make a successful career in Aviation. Becoming a fighter pilot was once his dearest dream, which was not fulfilled as he couldn’t reach the final merit of IAF. After completing his higher education, Kalam joined the DRDO (Aeronautical Development Establishment of the Defence Research and Development Organisation) as a scientist and late in the early 1960s, worked with the INCOSPAR (Indian National Committee for Space Research) under Vikram Sarabhai, a renowned space scientist.\n\nCourtesy: Hindustan Times\n\nEven though he got immense opportunities to design hovercrafts and small helicopters, he was never convinced and always aimed for something bigger and there was no failure in this world that could stop him. Later, Abdul Kalam started independently working on expandable rocket projects at DRDO. Things took a magnificent turn when he received transfer orders to the ISRO (Indian Space Research Organization) where he started as a project director of SLV-III, India’s first indigenous Satellite Launch Vehicle, which deployed the Rohini satellite into orbit the earth in July 1980.\n\n“Dream is not that which you see while sleeping it is something that does not let you sleep.”\n\nHis dedication led to the development of 4 missile projects namely Prithvi, Trishul, Akash and Nag. And due to this contribution, he earned the title of the ‘Missile Man of India’. Later in 1992, Kalam was appointed as the Scientific Adviser to the Defence Minister and promoted to Principal Scientific Adviser to the Government of India in 1999.\n\nAPJ Abdul Kalam’s education has immensely added to his valuable role in conducting the Pokhran-II, a series of 5 nuclear test explosions in 1998. His status as a national hero made India to be recognised as a full-fledged nuclear state. This is not the end, in the same year, Kalam proposed a countrywide plan called ‘Technology Vision 2020’ to develop nuclear empowerment, and improve agricultural productivity and various technological innovations, to name a few.\n\nDo You Know: Named after him, Abdul Kalam Scholarship is an initiative undertaken by various state governments and educational organisations for Indian students who belong to a minority group and are planning to pursue higher education. This scholarship is available to enrol in various institutions in India and abroad.\n\nAPJ Abdul Kalam’s Education: Lessons to Remember\n\nA leader who contributed to the youth skilling and development initiative, working tirelessly in his field and directing several projects, APJ Abdul Kalam has always been an inspiration to people in this world. Amongst the great personalities, his struggles and passion have always given the power to dream to millions of others. There will always be an indelible impression not only on adults but also children aiming to become successful in life.\n\nBeyond his work on developing India’s ballistic missile and nuclear programs, let us see how exactly the former president has played a crucial role in our knowledge and growth:\n\n“You cannot change your future, but you can change your habits, and surely your habits will change your future.”\n\n1. Be Prepared For Life: It isn’t always necessary that your life will exactly be like you want it to be, instead let your life take its course and go with the flow. Do not forget, everything that happens happens for a reason. APJ Abdul Kalam’s education always taught us to never allow our failure to take over our lives but rather always have a ‘Plan B’ approach.\n\n2. Leadership: A good leader acknowledges the contribution, shoulders the responsibility and never blames for failures and gives credit for success. Taking undue credit for something you haven’t done or achieved does not make you better and may influence bad qualities in your juniors.\n\n3. A Vision of your Own: One of the most influential factors that greatly accelerates civilization is people having a vision about everything they do, what matters to them the most, how well can they reap their rewards and giving them a definition in their lives.\n\n4. Humbleness: In an era where egoism is at its peak and humility is at its downfall, legends would never fail to show their modesty and greatly influence the masses.\n\nBest Books By APJ Abdul Kalaam\n\nNot only was APJ Abdul Kalaam a great human being and politician, but he was also a great writer. He was able to pen down his ideas and views beautifully and could share his thoughts with the rest of the world in the most uncomplicated manner. Here is a list of the best books by APJ Abdul Kalaam.\n\nIgnited Minds\n\nWritten in the year 2002, this book shares wonderfully the accounts and interactions Dr Kalaam had with students from all over the country. The excellent feature of this book is that through his many interactions with different children, he realised the true potential of the youth of our country. Hence the name Ignited Minds. Dr Kalaam, through this book, gave the message that we should try to look beyond what only our eyes can see. You can buy the book here.\n\nWings Of Fire\n\nOne of the best autobiographies written ever, Wings of Fire, describes Dr Kalaam’s incredible journey of a simple boy from a humble background to a chief scientist who had a major hand behind the Indian Space Research innovations and then later how became the President of India. You can buy the book here.\n\nIndomitable Spirit\n\nBringing together the thoughts, values and ideals of our former President APJ Abdul Kalaam, Indomitable Spirit is an ode to womanhood. Dr Kalaam says that women are beautiful creations of God and deserve respect, love and attention. This book also gives a detailed description of Dr Kalaam’s journey from the shores of Rameswaram to the Rashtrapati Bhawan. You can buy this splendid book here.\n\nTurning Points\n\nA sequel to the book Wings of Fire, Turning Points takes us through an in-depth journey of what happened after Dr Kalaam became the President. It is a blueprint vision for 2020. Dr Kalaam stresses the importance and acceptance of technology in our lives to move forward. You can buy the book here.\n\nAlso Read: Greatest Scientist of all Times\n\nAPJ Abdul Kalam’s Educational Quotes\n\nHere are some of the most popular quotes by APJ Abdul Kalam:\n\nCourtesy: The Indian Express\n\n“You have to dream before your dreams can come true.”\n\n“The best brains of the nations may be found on the last benches of the classrooms.”\n\n“Don’t read success stories, you will only get messages. Read failure stories, you will get some ideas to get success.”\n\n“Don’t take rest after your first victory because if you fail in the second, more lips are waiting to say that your first victory was just luck.”\n\nCourtesy: Twitter\n\n“If you salute your duty, you no need to salute anybody, but if you pollute your duty, you have to salute everybody.”\n\n“One best book is equal to hundred good friends, but one good friend is equal to a library.”\n\nCourtesy: Scrolldroll\n\n“Unless India stands up to the world, no one will respect us. In this world, fear has no place. Only strength respects strength.”\n\n“Your best teacher is your last mistake.”\n\nCourtesy: The Education Magazine\n\n“I’m not a handsome guy, but I can give my hand to someone who needs help. Beauty is in the heart, not in the face.”\n\n“Be active! Take on responsibility! Work for the things you believe in. If you do not, you are surrendering your fate to others.”\n\nCourtesy: The Education Magazine\n\nHopefully, this blog has helped you in giving an insight into APJ Abdul Kalam’s education and what makes him honoured with India’s highest civilian award “Bharat Ratna” in 1997. Those planning to take their career to new heights, and looking forward to pursuing courses abroad, can reach out to Leverage Edu. We will surely help you choose the right career and the best university according to your chosen field of interest."}, {"url": "https://pantheon.world/profile/person/A._P._J._Abdul_Kalam/", "page_content": "A. P. J. Abdul Kalam\n\nAvul Pakir Jainulabdeen Abdul Kalam BR ( (listen); 15 October 1931 – 27 July 2015) was an Indian aerospace scientist and statesman who served as the 11th president of India from 2002 to 2007. He was born and raised in Rameswaram, Tamil Nadu and studied physics and aerospace engineering. He spent the next four decades as a scientist and science administrator, mainly at the Defence Research and Development Organisation (DRDO) and Indian Space Research Organisation (ISRO) and was intimately involved in India's civilian space programme and military missile development efforts . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of A. P. J. Abdul Kalam has received more than 40,817,894 page views. His biography is available in 80 different languages on Wikipedia (up from 75 in 2019) . A. P. J. Abdul Kalam is the 171st most popular politician (up from 220th in 2019), the 9th most popular biography from India (down from 7th in 2019) and the 4th most popular Indian Politician.\n\nA. P. J. Abdul Kalam is most famous for being the 11th President of India, and for his contributions to the development of India's missile and space programs."}, {"url": "https://successstory.com/people/avul-pakir-jainulabdeen-abdul-kalam", "page_content": "He was also hailed as the ‘Missile Man of India’ because of his tremendous effort in missile development. He was bestowed with many prestigious honours among which Bharat Ratna is also included.\n\nFormer President of India, Avul Pakir Jainulabdeen Abdul Kalam was hailed as an Indian scientist who served the President’s term from 2002 to 2007. He studied aerospace engineering and physics and his last four decades were spent as an administrator of science.\n\nA.P.J Abdul Kalam (15th October 1931- 27 July 2015) born in Rameswaram into a Tamil Muslim family in Tamil Nadu itself. He came from a humble background where his father, a boat owner and mother, a housewife brought him up. He used to distribute newspaper after the completion of his school so that he could support his father. What he had was a yearning to learn more. He was in Ramanathapuram Schwartz Matriculation School and later he went to Saint Joseph’s College from where he became a physics graduate. In 1955 he went to Madras to pursue his studies further in Madras.\n\nFamous Inspirational Quotes By Abdul Kalam\n\nCareer As a Scientist\n\nFor the Indian army, A.P.J Abdul Kalam designed a mini helicopter. Major breakthrough came when he was transferred to ISRO catering to the project of SLV-III. Being the representative of TBRL, he acted as the representative of Smiling Buddha which was the first nuclear test to be conducted. In 1980s, his extensive research work and development brought many accolades and laurel to his name. From July 1992 onwards he served as the Chief Scientific Adviser to the then Prime Minister. His role in the field of technological and political field is remarkable during the nuclear tests of Pokhran-II.\n\nDon’t take rest after your first victory because if you fail in second, more lips are waiting to say that your first victory was just luck.\n\nCareer as the President of India\n\nA.P.J Abdul Kalam won the election of President in 2002 by surpassing mammoth votes. His term as President was from 25 July 2002 to 25 July 2007. He was backed by the parties of National Congress and Samajwadi Party. It was an easy victory for him and he became the 11th President of India. He received the highest civilian honour Bharat Ratna and the third person to do so. Occupying the seat of Rashtrapati Bhavan he was indeed the first bachelor and the first scientist as well. However, in 2012 he declined for the role of President for the second term.\n\nA.P.J Abdul Kalam with Narendra Modi\n\nFondness for Education and Students\n\nAfter retiring from the post of scientific adviser in 1999, his main mission was to interact with as many as 100,000 students. He felt the joy in meeting with the youth of the country particularly the high school students. He found a way to ignite their mind for the development of India.\n\nExcellence is a Continuous Process and not an Accident.\" - Abdul Kalam\n\nDeath\n\nHe was delivering a lecture on 27th July 2015 at IIM Shillong where at 6:30 pm he suffered a heart attack massively and critical his condition was, he was shifted to Bethany Hospital where thereafter, he died of cardiac arrest.\n\nAwards 2014 Doctor of Science Edinburgh University 2013 Von Braun from the National Space Society 2012 Doctor of Laws Simon Fraser University 2011 IEEE Honorary Membership IEEE 2009 Hoover Medal ASME Foundation, USA 2008 Doctor of Engineering Nanyang Technological University, Singapore 2007 King Charles II Medal from Royal Society, UK 2007 Doctorate of Science from University of Wolverhampton, UK 2000 Ramanujan Award from Alwars Research Centre, Chennai 1998 Veer Savarkar Award from Government of India 1997 Indira Gandhi Award for National Integration from Indian National Congress 1997 Bharat Ratna from Government of India 1990 Padma Vibhushan from Government of India 1981 Padma Bhushan from Government of India\n\nAbdul Kalam's Excellent Speech at European Parliament"}, {"url": "https://www.makerstimeline.com/a-p-j-abdul-kalam-former-president/", "page_content": "Avul Pakir Jainulabdeen (APJ) Abdul Kalam was an Indian aerospace scientist in ISRO and he was the 11th President of India. He was born and raised in Rameswaram, Tamil Nadu , India. He studied physics and aerospace engineering. He Wrote many books.\n\nHe was keen on encouraging the students in India to take active interest in the emerging Technologies, including Space Tech, as these significantly impact our daily lives.\n\nDr. A. P. J. Abdul Kalam, better known as “The Missile Man of India”.\n\nAPJ. Abdul Kalam Timeline"}, {"url": "https://amitesh2304.github.io/apj/", "page_content": "Dr. A.P.J Abdul Kalam\n\nA.P.Abdul kalam\n\nEarly life\n\nAs a Scientist\n\nAs a President\n\nAs a Writter\n\nAwards\n\nAvul Pakir Jainulabdeen Abdul Kalam (/ˈɑːbdəl kəˈlɑːm/ (listen); 15 October 1931 – 27 July 2015) was an Indian aerospace scientist and statesman who served as the 11th President of India from 2002 to 2007. He was born and raised in Rameswaram, Tamil Nadu and studied physics and aerospace engineering. He spent the next four decades as a scientist and science administrator, mainly at the Defence Research and Development Organisation (DRDO) and Indian Space Research Organisation (ISRO) and was intimately involved in India's civilian space programme and military missile development efforts.[1] He thus came to be known as the Missile Man of India for his work on the development of ballistic missile and launch vehicle technology.[2][3][4] He also played a pivotal organisational, technical, and political role in India's Pokhran-II nuclear tests in 1998, the first since the original nuclear test by India in 1974.[5] Kalam was elected as the 11th president of India in 2002 with the support of both the ruling Bharatiya Janata Party and the then-opposition Indian National Congress. Widely referred to as the \"People's President\",[6] he returned to his civilian life of education, writing and public service after a single term. He was a recipient of several prestigious awards, including the Bharat Ratna, India's highest civilian honour. While delivering a lecture at the Indian Institute of Management Shillong, Kalam collapsed and died from an apparent cardiac arrest on 27 July 2015, aged 83.[7] Thousands, including national-level dignitaries, attended the funeral ceremony held in his hometown of Rameswaram, where he was buried with full state honours.[8]\n\nContact us"}, {"url": "https://www.4to40.com/biographies-for-kids/a-p-j-abdul-kalam/", "page_content": "A. P. J. Abdul Kalam — Avul Pakir Jainulabdeen Abdul Kalam (born 15 October 1931 – died 27 July 2015) is an Indian scientist and administrator who served as the 11th President of India from 2002 to 2007. Kalam was born and raised in Rameswaram, Tamil Nadu, studied physics at the St. Joseph’s College, Tiruchirappalli, and aerospace engineering at the Madras Institute of Technology, Chennai.\n\nBefore his term as President, he worked as an Aerospace engineer with Defence Research and Development Organisation (DRDO) and Indian Space Research Organisation (ISRO). Kalam is popularly known as the Missile Man of India for his work on the development of ballistic missile and launch vehicle technology. He played a pivotal organisational, technical and political role in India’s Pokhran-II nuclear tests in 1998, the first since the original nuclear test by India in 1974.\n\nKalam was elected the President of India in 2002, defeating Lakshmi Sahgal, was nominated by Bharatiya Janata Party and supported by opposition Indian National Congress, the major political parties of India. He is currently a visiting professor at Indian Institute of Management Shillong, Indian Institute of Management Ahmedabad and Indian Institute of Management Indore, honorary fellow of Indian Institute of Science, Bangalore, Chancellor of the Indian Institute of Space Science and Technology Thiruvananthapuram, a professor of Aerospace Engineering at Anna University (Chennai), JSS University (Mysuru) and an adjunct/visiting faculty at many other academic and research institutions across India.\n\nKalam advocated plans to develop India into a developed nation by 2020 in his book India 2020. He has received several prestigious awards, including the Bharat Ratna, India’s highest civilian honour. Kalam is known for his motivational speeches and interaction with the student community in India. He launched his mission for the youth of the nation in 2011 called the What Can I Give Movement with a central theme to defeat corruption in India.\n\nEarly Life and Education:\n\nAvul Pakir Jainulabdeen Abdul Kalam was born on 15 October 1931 in a Tamil Muslim family to Jainulabudeen, a boat owner and Ashiamma, a housewife, at Rameswaram, Ramanathapuram District, located in the Indian state of Tamil Nadu. He came from a poor background and started working at an early age to supplement his family’s income. After completing school, Kalam distributed newspapers to financially contribute to his father’s income. In his school years, he had average grades, but was described as a bright and hardworking student who had a strong desire to learn and spend hours on his studies, especially mathematics. He was just a simple man with a great fierceful heart in his childhood. After completing his school education at the Ramanathapuram Schwartz Matriculation School, Kalam went on to attend Saint Joseph’s College, Tiruchirappalli, then affiliated with the University of Madras, from where he graduated in physics in 1954. Towards the end of the course, he was not enthusiastic about the subject and would later regret the four years he studied it. He then moved to Madras in 1955 to study aerospace engineering. While Kalam was working on a senior class project, the Dean was dissatisfied with the lack of progress and threatened revoking his scholarship unless the project was finished within the next three days. He worked tirelessly on his project and met the deadline, impressing the Dean who later said, “I [Dean] was putting you [Kalam] under stress and asking you to meet a difficult deadline”. He narrowly missed achieving his dream of becoming a fighter pilot, as he placed ninth in qualifiers, and only eight positions were available in the IAF.\n\nA. P. J. Abdul Kalam: Career as a scientist\n\nAfter graduating from the Madras Institute of Technology in 1960, Kalam joined the Aeronautical Development Establishment of the Defence Research and Development Organisation (by Press Information Bureau, Government of India) as a scientist after becoming a member of the Defence Research & Development Service (DRDS). He started his career by designing a small hovercraft, but remained unconvinced by his choice of a job at DRDO.Kalam was also part of the INCOSPAR committee working under Vikram Sarabhai, the renowned space scientist.In 1969, Kalam was transferred to the Indian Space Research Organisation (ISRO) where he was the project director of India’s first Satellite Launch Vehicle (SLV-III) which successfully deployed the Rohini satellite in near-earth orbit in July 1980; Kalam had first started work on an expandable rocket project independently at DRDO in 1965.In 1969, Kalam received the government’s approval and expanded the programme to include more engineers.\n\nIn 1963 to 1964, he visited NASA’s Langley Research Center in Hampton, Virginia; Goddard Space Flight Center in Greenbelt, Maryland; and Wallops Flight Facility.Between the 1970s and 1990s, Kalam made an effort to develop the Polar Satellite Launch Vehicle (PSLV) and SLV-III projects, both of which proved to be successful.\n\nKalam was invited by Raja Ramanna to witness the country’s first nuclear test Smiling Buddha as the representative of TBRL, even though he had not participated in its development. In the 1970s, Kalam also directed two projects, Project Devil and Project Valiant, which sought to develop ballistic missiles from the technology of the successful SLV programme. Despite the disapproval of the Union Cabinet, Prime Minister Indira Gandhi allotted secret funds for these aerospace projects through her discretionary powers under Kalam’s directorship. Kalam played an integral role convincing the Union Cabinet to conceal the true nature of these classified aerospace projects.His research and educational leadership brought him great laurels and prestige in the 1980s, which prompted the government to initiate an advanced missile programme under his directorship. Kalam and Dr V S Arunachalam, metallurgist and scientific adviser to the Defence Minister, worked on the suggestion by the then Defence Minister, R. Venkataraman on a proposal for simultaneous development of a quiver of missiles instead of taking planned missiles one after another. R Venkatraman was instrumental in getting the cabinet approval for allocating ₹ 3.88 billion for the mission, named Integrated Guided Missile Development Programme (IGMDP) and appointed Kalam as the chief executive. Kalam played a major part in developing many missiles under the mission including Agni, an intermediate range ballistic missile and Prithvi, the tactical surface-to-surface missile, although the projects have been criticized for mismanagement and cost and time overruns.\n\nA. P. J. Abdul Kalam served as the Chief Scientific Adviser to the Prime Minister and Secretary of the Defence Research and Development Organisation from July 1992 to December 1999. The Pokhran-II nuclear tests were conducted during this period in which he played an intensive political and technological role. Kalam served as the Chief Project Coordinator, along with Rajagopala Chidambaram, during the testing phase. Media coverage of Kalam during this period made him the country’s best known nuclear scientist.\n\nIn 1998, along with cardiologist Soma Raju, Kalam developed a low cost coronary stent, named the “Kalam-Raju Stent”. In 2012, the duo designed a rugged tablet computer for health care in rural areas, which was named the “Kalam-Raju Tablet”.\n\nPresidency:\n\nKalam served as the 11th President of India, succeeding K. R. Narayanan. He won the 2002 presidential election with an electoral vote of 922,884, surpassing the 107,366 votes won by Lakshmi Sahgal. His term lasted from 25 July 2002 to 25 July 2007. During his term as president, he was affectionately known as the People’s President.\n\nDeath:\n\nOn 27 July 2015, Kalam travelled to Shillong to deliver a lecture on “Creating a Livable Planet Earth” at the Indian Institute of Management Shillong. While climbing a flight of stairs, he experienced some discomfort, but was able to enter the auditorium after a brief rest. At around 6:35 p.m. IST, only five minutes into his lecture, he collapsed. He was rushed to the nearby Bethany Hospital in a critical condition; upon arrival, he lacked a pulse or any other signs of life. Despite being placed in the intensive care unit, Kalam was confirmed dead of a sudden cardiac arrest at 7:45 p.m IST."}, {"url": "https://artsandculture.google.com/entity/a-p-j-abdul-kalam/m0gy3f", "page_content": "Avul Pakir Jainulabdeen Abdul Kalam was an Indian aerospace scientist who served as the 11th president of India from 2002 to 2007. He was born and raised in Rameswaram, Tamil Nadu and studied physics and aerospace engineering. He spent the next four decades as a scientist and science administrator, mainly at the Defence Research and Development Organisation and Indian Space Research Organisation and was intimately involved in India's civilian space programme and military missile development efforts. He thus came to be known as the Missile Man of India for his work on the development of ballistic missile and launch vehicle technology. He also played a pivotal organisational, technical, and political role in India's Pokhran-II nuclear tests in 1998, the first since the original nuclear test by India in 1974.\n\nKalam was elected as the 11th president of India in 2002 with the support of both the ruling Bharatiya Janata Party and the then-opposition Indian National Congress. Widely referred to as the \"People's President\", he returned to his civilian life of education, writing and public service after a single term.\n\nShow less Read more Wikipedia"}, {"url": "https://www.topperment.com/blog/apj-abdul-kalam-first-scientist-president-of-india", "page_content": "APJ Abdul Kalam was one of the most popular presidents of India. Even today he continues to be an inspiration to many people of all ages. His commitment to technology and service to the country is an inspiration. Today we are going to discuss more APJ Abdul Kalam's life and his inspirational works.\n\nDr. APJ Abdul Kalam Birth\n\nAvul Pakir Jainulabdeen Abdul Kalam was born on 15th October 1931, Rameshwaram to Jainulabdeen, and Imam. Kalam had four brothers and a sister. Kalam's family went through a tough time and Kalam had to sell newspapers as a child to help his family's financial status.\n\nEducation: Kalam completed his schooling in Ramanathapuram and earned a physics degree from Saint Joseph's College. In the year 1955, he went to Madras Institute of Technology to study Aerospace engineering because it was his dream to become a fighter pilot. But that dream was shattered when he missed the qualifier for the fighter pilot by a small margin. Kalam always believed that the significance of three key players in society - mother, father, and teacher. He believed that all these three played their part correctly, India can become a nation with beautiful minds.\n\nCareer: But that didn't stop him to work for the country. He got a job as a scientist at the Aeronautical Development Establishment of the Defense Research and Development Organization, where he worked under Vikram Sarabhai. Then he transferred to ISRO(Indian Space Research Organization) as the project director of the SLV. With his sheer commitment and passion, he successfully deployed the satellite Rohini in 1980. Rohini is first India's SLV. Later on, Kalam worked to develop the PSLV as well.\n\nHis research on SLV technology led him to the advanced missile development program. APJ Abdul Kalam was the chief executive of the Integrated Guided Missile Development program when R Venkataraman was the Defense Minister of the country.\n\nBecause of his excellent work and commitment to the project. He was given the title \" Missile Man of India\"\n\nKalam valued friendship and during his lifetime he had some wonderful friends who helped him. Kalam says “ One best book is equal to hundred good friends but one good friend is equal to a library.”\n\n11th President of India: In the year 2002, Abdul Kalam was elected as the 11th President of India and he won the election by a huge margin. Kalam became the first scientist to become India's president and the first bachelor too. Kalam had a wonderful way of defining a leader. He believed that a person who has vision and passion is not afraid of obstacles that come his way is a leader. He believed firmly that only a person who knows how to overcome obstacles in his life can be a leader and he proved it with his full-term rule.\n\nHis quote “ Winners are not those who never fail but those who never quit” describes his determination and his passion for his work.\n\nHe completed his full term till 2007 and became the people's president. His popularity grew amongst the people, especially with the school children. His speeches, his novels, and his quotes gave immense motivation to the youth of the country. For his contribution to the country, Kalam was awarded Padma Bhushan in 1981, Padma Vibhushan in 1990, Bharat Ratna in 1997, Indira Gandhi Award for National Integration in 1997, Veer Savarkar Award in 1998, King Charles II Medal in 2007, and doctor of science given by Edinburgh University, the UK in 2014.\n\nBooks which are written by APJ Abdul Kalam\n\n1. Wings of Fire\n\n2. India 2020: A Vision for the New Millennium\n\n3. Ignited Minds: Unleashing the Power within India\n\n4. Transcendence: My Spiritual Experiences with Pramukh Swamiji\n\n5. A Manifesto for change: A sequel to India 2020.\n\nDeath: While giving a lecture at the IIM Shillong on 27th July 2015, Kalam died of cardiac arrest. The government of India declared a 7-day state mourning and he was laid to rest with full honors at his native Rameswaram.\n\nAPJ Abdul Kalam's life is an inspiration to many. He was a man who believed in dreams and inspired the youth to make those dreams into action. His famous quote says \" Dream, dream, dream. Dreams transform into thoughts and thoughts result into action.\"\n\nHe never believed in failure and he mentioned in one of his quotes which says \" Failure will never overtake me if my definition is to succeed is strong enough\"\n\nHis amazing work, his love for technology, science, and his passion to win anything in life is inspirational to many."}]}