{"John Reed Jr. was born in Portland, Oregon.": [{"url": "https://www.britannica.com/biography/John-Reed", "page_content": "John Reed, (born Oct. 22, 1887, Portland, Ore., U.S.—died Oct. 19, 1920, Moscow), U.S. poet-adventurer whose short life as a revolutionary writer and activist made him the hero of a generation of radical intellectuals.\n\nReed, a member of a wealthy Portland family, was graduated from Harvard in 1910 and began writing for a Socialist newspaper, The Masses, in 1913. In 1914 he covered the revolutionary fighting in Mexico and recorded his impressions in Insurgent Mexico (1914). Frequently arrested for organizing and defending strikes, he rapidly became established as a radical leader and helped form the Communist Party in the United States.\n\nHe covered World War I for Metropolitan magazine; out of this experience came The War in Eastern Europe (1916). He became a close friend of Lenin and was an eyewitness to the 1917 Bolshevik Revolution in Russia, recording this event in his best known book, Ten Days That Shook the World (1919).\n\nWhen the U.S. Communist Party and the Communist Labor Party split in 1919, Reed became the leader of the latter. Indicted for treason, he escaped to the Soviet Union and died of typhus; he was subsequently buried with other Bolshevik heroes beside the Kremlin wall. Following his death the Communist Party formed many John Reed clubs, associations of writers and artists, in U.S. cities."}, {"url": "https://www.oregonencyclopedia.org/articles/reed_john_jack_1887_1920_/", "page_content": "Almost ninety years after his burial on Red Square in Moscow, John Silas “Jack” Reed remains among the most controversial of Oregon’s native sons. During his brief life, he earned his celebrity by reporting on U.S. labor strikes, the Mexican revolution, World War I, and by being a founder of and international delegate for the Communist Labor Party. Early in Reed's career, Walter Lippman cautioned New Republic readers that he “is many men at once, and those who have tried to . . . regard him as a writer, a correspondent, a poet, a revolutionist, or a lover, lose him.” In 1981, younger generations were introduced to Reed in Warren Beatty’s epic film Reds, and in 1999 a New York University panel of experts ranked his Ten Days That Shook the World seventh among the hundred best works of American twentieth-century journalism.\n\nReed was born on October 22, 1887, in Cedar Hill, his grandfather Henry Dodge Green’s five-acre mansion near today’s Washington Park in Portland. Although Green’s widow sold the estate when Jack Reed was only three years old, he later remembered Cedar Hill as “something fantastic. . . . A lordly grey mansion modeled on a French Chateau.”\n\nReed’s father, Charles “C.J.” Reed, was a U.S. marshal with an office in the Pioneer Courthouse in Portland. The family moved off the hill into town in 1890, and Reed’s early education included the Friday Evening Dancing Class for West Hill society and the Portland Academy. He preferred expeditions to less elevated neighborhoods, such as Skid Row, the waterfront, and Chinatown. For Reed, the Industrial Workers of the World hall was the “liveliest intellectual center in town.”\n\nReed published his first work when he was fifteen, a poem called “The Columbia River,” in the Troubadour, the literary magazine of the Portland Academy. Looking back in his most personal memoir, Almost Thirty, first published in the New Republic in 1936, Reed saw himself as “neither one thing or another . . . that is why my impression of my childhood is an unhappy one and why I have so few close friends in Portland and why I don’t want ever to live there again.”\n\nAt sixteen, Reed was sent to boarding school in New Jersey and then on to Harvard, where much of his writing drew on his experiences in Oregon. He spent most summers in Portland, where he attended parties in the West Hills, charmed several local women, and wrote two of his most famous poems, “The Day in Bohemia” (1913) and “Sangar” (1913).\n\nHis final visit to Portland in 1914, to spend Christmas with his widowed mother Margaret, was the most memorable. Writer and activist Louise Bryant asked their mutual friends, Carl and Helen Walters, to introduce her to Reed. Within weeks, he had left Oregon and was living with Bryant on Washington Square in New York.\n\nReed was a central figure in America’s cultural Bohemia and a political activist, and he spent the remainder of his career writing for radical publications such as The Masses and for magazines such as The Metropolitan. His best-known book was Ten Days That Shook the World, an eyewitness account of the Russian revolution published in 1919. Reed’s enthusiasm for the revolution led to his death from typhus in October 1920 in a Moscow hospital. He is buried in the graveyard of revolutionary heroes near the Kremlin Wall.\n\nWhile Reed frequently expressed his contempt for Portland’s conservatism, he revealed a familiarity with and affection for Portland in the Oregon Journal in 1914: “Portlanders understand and appreciate how differently beautiful is this part of the world—the white city against the deep evergreen of the hills, the snow mountains to the east, the ever-changing river and its boat life, the dusty oriental brilliancy of Chinatown—and the grays, blues and greens, the smoke-dimmed sunsets and pearly hazes of August, so characteristic of the Pacific Northwest. You don’t have to point out those things to our people.” The words are inscribed on a bench in Washington Park, the only memorial to John Reed in his hometown, near where he was born."}, {"url": "https://www.thefamouspeople.com/profiles/john-reed-4897.php", "page_content": "He graduated from Harvard College in 1910, and that summer he set out to see more of the \"dull outside world,\" visiting England, France, and Spain before returning home to America the following spring.\n\nHe entered Harvard College in 1906, and excelled in swimming and water polo, served the editorial boards of Lampoon and The Harvard Monthly, and wrote music and lyrics for the Hasty Pudding Theatricals show.\n\nHe attended Portland Academy, a private school with younger brother Harry. He was bright enough to pass his courses but would not work for top marks, as he found school dry and tedious.\n\nHe was a sickly child with a weak kidney. For much of his teenage years, he suffered recurrent attacks of pain that kept him bedridden for periods of a week or more.\n\nJohn Reed was born on October 22, 1887, in Portland, Oregon to Margaret Green Reed, the daughter of a leading Portland citizen and, Charles Jerome Reed, the representative of an agricultural machinery manufacturer from the East.\n\nRecommended Lists:\n\nCareer\n\nWanting to be a freelance journalist, he circulated essay and short stories about his six months in Europe which were accepted in The Saturday Evening Post, Collier's, The Forum, and The Century Magazine.\n\nOne of his poems was set to music by composer Arthur Foote, and the editors at ‘The American’ came to see him as a contributor and begun to publish his work.\n\nIn 1913, he joined ‘The Masses’, a magazine of socialist politics. He was arrested for the first time in Paterson, New Jersey for speaking on behalf of strikers in the silk mills.\n\nIn 1913, he was deputed to Mexico by the Metropolitan Magazine to report the Mexican Revolution and covered Pancho Villa’s—one of the most prominent Mexican Revolutionary generals—victory over Federal forces at Torreón.\n\nWhen The Ludlow Massacre happened in April 1914, he arrived at the scene in Colorado and reported on the event, siding with the miners and seeing it as an example of class conflict.\n\nOn the outbreak of the First World War, Reed went to Europe where he covered the battle fronts in France, Germany, Russia, Serbia, Romania and Bulgaria for The Masses and the Metropolitan Magazine.\n\nHe saw World War I as a “Clash of Traders” and showed little sympathy for any of the participants and observed with dismay that working-class solidarity was being replaced by militarism and nationalism.\n\nIn 1915, he returned to Portland where he met Louise Bryant. They rented a home in Provincetown, in Massachusetts and acted in, Bound East for Cardiff, a play written by Eugene O'Neill.\n\nIn 1917, accompanied by his wife Louise Bryant who was also provided foreign correspondent accreditation, he left for Petrograd. He interviewed Alexander Kerensky, head of Russian Provisional Government just before Kerensky went into hiding.\n\nContinue Reading Below\n\nIn November 1917, he spent time with Lenin and saw in him, “the power of explaining profound ideas in simple terms, of analyzing a concrete situation. And combined with shrewdness, the greatest intellectual audacity.\"\n\nHe returned to New York City in April, 1918 and was immediately arrested and charged for violating the Espionage Act by publishing anti-war articles and cartoons in The Masses that undermined the war effort.\n\nHe was released on bail and he published a series of articles on the Russian Revolution in The Liberator. He was arrested many times on charges of violating the Sedition Act.\n\nIn September 1919, Reed and several others, decided to form the Communist Party of the United States. Within a few weeks it had 60,000 members whereas the Socialist Party of America had only 40,000.\n\nIn 1920, he attended the Second Congress of the Communist International in Moscow and sought official recognition of the American Communist Party. The Comintern declared that a decision would be arrived after deliberation."}, {"url": "https://cs.odu.edu/~salam/wsdl/inforet/wikihtml/John_Reed_(journalist)_b4ef.html", "page_content": "From Wikipedia, the free encyclopedia\n\nFor other persons of the same name, see John Reed\n\nJohn \"Jack\" Silas Reed (October 22, 1887 – October 19, 1920) was an American journalist, poet, and communist activist, famous for his first-hand account of the Bolshevik Revolution, Ten Days that Shook the World. He was the husband of the writer and feminist Louise Bryant.\n\nedit] Early life and education\n\nReed was born in Portland, Oregon, the son of Charles Jerome and Margaret (Green) Reed. His mother was the daughter of a leading Portland citizen who had made a fortune in pig iron manufacturing. His father, who had recently come from the East when they married in 1886, represented an agricultural machinery manufacturer and with his ready wit quickly won acceptance in Portland’s business community.[1]\n\nThe young John, universally called Jack, was born in his mother’s mansion and baptized in the fashionable Trinity Episcopal Church (later abandoning religion).[2] He grew up surrounded by nurses and servants, his upper-class playmates carefully selected. He had a brother, Harry, two years his junior.[3] A sickly child, he was sent to the recently-established Portland Academy, a private boarding school where he was unhappy, at the age of nine.[4] In September 1904, he was sent to Morristown School, New Jersey, to prepare for college (his father had not gone to college and wanted his sons to attend Harvard).[5] There, he made the football team and although he did poorly in most subjects, showed literary promise. Around this time his father’s social standing fell due to his muckraking activities in exposing the timber industry’s corruption.[6]\n\nReed entered Harvard College in September 1906 (passing the entrance examination on his second try – something he was allowed to do despite having earned a C in English, a D in history and French, a pass in Chemistry, and failing Latin and geometry).[7] Tall, handsome, and light-hearted, he threw himself into all manner of student activities. He was a member of the cheerleading team, the swimming team and the dramatic club; he served on the editorial boards of the Lampoon and the Harvard Monthly; he served as president of the Harvard Glee Club; he wrote a play produced by the Hasty Pudding Club, and was made ivy orator and poet. He attended meetings of the Socialist Club, which his friend Walter Lippmann founded in May 1908, but never joined – his social conscience was still dormant and there were too many contradictions involved.[8] He failed to make football and crew, but participated in low-prestige sports like swimming and water polo, at which he excelled.[9] He was frustrated by the dismissive attitude the Eastern aristocracy showed the energetic young man, passing him over for membership in the waiting clubs (which one joined in preparation of the final clubs) despite his having broken a friendship with a Jewish classmate for the purpose of social advancement.[10] Still, his mentor, literature professor Charles Copeland, helped develop his talents.[11] Graduating in 1910, he visited England, France, and Spain before moving to New York City in March 1911.\n\nedit] Journalism\n\nHe grew to love New York, relentlessly exploring it and writing poems about it; he enjoyed the independence he now had from his parents, from Portland (which he hated), and from Harvard snobbery. Although living in Greenwich Village, he kept somewhat apart from its myriad intense, hostile cliques.[12] He joined the staff of the American Magazine in 1911 with Lincoln Steffens' invaluable help,[13] and in 1912 published “Sangar”, probably his finest poem[14] (Poetry, December 1912; also privately printed), besides producing the first of the Dutch Treat Club shows, \"Everymagazine\". The following year he issued privately The Day in Bohemia.\n\nHis central, tortuous, relationship in New York was with Mabel Dodge, a married woman eight years his senior. They met in early spring 1913. She dominated, suffocated him; she threatened suicide several times when he seemed to neglect her.[15] Visiting Europe later that year, they consummated their relationship in Paris and friction clearly developed (he was very interested in the sights the continent had to offer; she was mainly preoccupied with him).[16] Upon their return she continued to attempt to keep his mind off politics.[17]\n\nHis serious interest in social problems was first aroused, at about this time, by Lincoln Steffens and Ida Tarbell, and once aroused it quickly led him to a far more radical position than theirs. In 1913 he joined the staff of The Masses, edited by Max Eastman; he contributed over fifty articles, reviews and shorter pieces. The first of Reed’s many arrests came in Paterson, New Jersey, in 1913, for attempting to speak on behalf of the strikers in the silk mills. He spent four days in prison, helping to radicalize him and allying him with the IWW (though he was still not a socialist);[18] his brilliant account of his experiences appeared in June as “War in Paterson”. During the same year, following a suggestion made by Bill Haywood, picked up by Dodge and enthusiastically endorsed by Reed, he put on “The Pageant of the Paterson Strike” in Madison Square Garden for the benefit of the strikers. [19]\n\nIn the autumn of 1913 he was sent to Mexico by the Metropolitan Magazine to report the Mexican Revolution; Dodge followed him to El Paso but returned several days later.[20] He participated for four months in the perils of Pancho Villa’s army, while his articles brought him national reputation as a war correspondent. They were republished in book form as Insurgent Mexico (1914). He was with Villa's Constitutionalist Army when it defeated Federal forces at Torreón, opening the way for its advance on Mexico City.[21] He adored Villa; Carranza left him cold; he deeply sympathized with the plight of the peons; and vehemently opposed American intervention, which came shortly after he left. On April 30, he arrived in Colorado, scene of the recent Ludlow massacre; there he spent a little more than a week and investigated the events, spoke on behalf of the miners, wrote an impassioned article on the subject (“The Colorado War”, published in July), and came to believe much more clearly in class conflict.[22] That summer he spent in Provincetown, Massachusetts with Dodge and her son, putting together Insurgent Mexico and interviewing President Wilson on the subject (the resulting report, much watered down at White House insistence, was not a success).[23]\n\nOn August 14, 1914, shortly after Germany declared war on France and set World War I into full swing, he set sail for Italy, having been sent by the Metropolitan. He met Dodge in Naples; they made their way to Paris. They were uneasy with each other and she was depressed, knowing she could never fully possess him. He saw the war as emerging from imperialist commercial rivalries, showing little sympathy for Great Britain; in an anonymous piece (“The Traders’ War”, The Masses, September 1914), he famously wrote, “This is not Our War.” In France he was frustrated by wartime censorship and the difficulty of accessing the front; they went to London and she left for New York, leaving him relieved. The rest of 1914 he spent drinking, with French prostitutes, and with a German woman;[24] the two went to Berlin in early December but then broke off the affair. While there he interviewed Karl Liebknecht, who had, stunningly, voted against war credits; Reed was deeply disappointed by the general collapse in working-class solidarity promised by the Second International, and by its replacement with militarism and nationalism and their participation in what he saw as a meaningless war. On a visit to the German side of the Front south of Ypres on January 12, 1915, he probably fired two shots in the direction of the French, which earned him widespread condemnation.[25]\n\nReturning to New York in the middle of that month, he for the most part failed to reconcile with Dodge, and spent time writing about the war until going on a three-month visit to Eastern Europe later that year with Canadian Boardman Robinson. Going up from Thessaloniki, they met scenes of profound devastation in Serbia (including a bombed-out Belgrade), also going through Bulgaria and Romania. They passed through the Jewish Pale of Settlement in Bessarabia, and in Chełm they were arrested, incarcerated for several weeks and liable to be shot for espionage had not the American ambassador shown some interest. Going to Petrograd, an outraged Reed found the ambassador inclined to believe they were spies, and they were re-arrested when they tried to slip into Romania; it was the British ambassador (Robinson being a British subject) who finally secured permission for them to leave, but not before all their papers were seized in Kiev. It was at this time that his hatred for the Tsarist regime and love for the Russian people began to develop. In Bucharest they spent time piecing together their journey (Reed at one point traveling to Constantinople, hoping to see action at Gallipoli, but being rebuffed), from which Reed’s The War in Eastern Europe (April 1916) would emerge. He sailed for New York in October.\n\nAfter returning to New York, he paid a visit to his mother in Portland, where he fell in love with Louise Bryant, who joined him east in January 1916. Bryant was less domineering than Dodge, and both had affairs rather freely. Early in 1916 Reed met Eugene O’Neill, and beginning that May the three rented a cottage in Provincetown, where Bryant and O’Neill, who fascinated her, began a romance. At one point during this love triangle, Dodge showed up in Provincetown but Reed told her firmly that he was not interested in renewing their relationship.[26] He opposed the March 1916 intervention of General Pershing into Mexico, seeing it as futile.[27] That summer Reed covered the Presidential nominating conventions, showing pity for the Progressives, whose nomination Theodore Roosevelt, now an inveterate war agitator, declined.[28] Reed himself endorsed Wilson, hoping he would keep America out of the war.[29] He married Bryant in Peekskill in November before heading for an operation at Johns Hopkins Hospital resulting in the removal of one kidney (he wanted her as a beneficiary), staying in hospital until mid-December. One of his doctors was Carl Binger, the Jewish friend he had dropped at Harvard, but nothing was said of the matter.[30] The operation rendered him ineligible for conscription and saved him from the fate of a conscientious objector. During 1916 he published privately Tamburlaine and Other Poems.\n\nAs the country drifted toward war, Reed was marginalized: his relationship with the Metropolitan was over, he pawned his late father’s watch and sold his Cape Cod cottage to Margaret Sanger. [31] Germany's Kaiser was a strong critic of American and Western capitalism, and this appealed to Reed. When Wilson asked for a declaration of war on April 2, 1917, Reed shouted at a hastily-convened People’s Council in Washington: “This is not my war, and I will not support it. This is not my war, and I will have nothing to do with it.”[32] In July and August Reed continued to write very strong articles for The Masses, which the Post Office now refused to mail, and for Seven Arts, which as a result of an article by Reed and one earlier in the summer by Randolph Bourne, had its financial backing cut off and ceased publication.[33] Reed was stunned by the nation’s pro-war fervor, and his career lay in ruins.[34]\n\nedit] Communism\n\nedit] First trip to Russia\n\nReed and Bryant traveled via Finland to Russia in August-September 1917; she stayed until January 20, 1918 and he until early February. Upon his arrival he was greatly excited by the fervor of revolution, and the American Ambassador placed him under close surveillance. Reed sensed that power was draining away from the Provisional Government to the Soviets,[35] something which was confirmed by an October 10 visit to the Latvian Front, where he observed the troops’ usual deference had been replaced by defiance to their officers.[36] However, unlike Trotsky and other Bolsheviks, who would later claim that their party had planned and guided events leading up to the October Revolution (of which Reed and Bryant were enthusiastic observers), Reed saw a much more chaotic version of events that lacked inevitability.[37] He wrote much of the Bolshevik propaganda dropped over the German lines. He met Trotsky and was introduced to Lenin during a break of the Constituent Assembly on January 18, 1918. By December, his initial $2000 grant (donated by a wealthy American radical[38]) was nearly exhausted and, desperate for cash, he took employment with an American, Raymond Robins of the Red Cross, who wished to set up a newspaper promoting American interests; Reed complied, but in the dummy issue he prepared he included a warning beneath the masthead: “this paper is devoted to promoting the interests of American capital.”[39] The dissolution of the Constituent Assembly left Reed unmoved, and two days later, armed with a rifle, he joined a patrol of Red Guards prepared to defend the Foreign Office from counter-revolutionary attack.[40] Reed then attended the opening of the Third Congress of Soviets, where he gave a short speech promising to bring the news of the revolution to America, where he hoped it would “call forth an answer from America’s oppressed and exploited masses.” American journalist Edgar Sisson told Reed that he was being used by the Bolsheviks for their propaganda, a rebuke he accepted.[41] In January, Trotsky, responding to Reed's concern about the safety of his substantial archive, offered Reed the post of Soviet Consul in New York; as the United States did not recognize the Bolshevik government, his credentials would almost certainly have been rejected and he faced prison (which would have given the Bolsheviks some propaganda material). The appointment was viewed as a massive blunder by most Americans in Petrograd, and the businessman Alex Gumberg directly approached Lenin, showing him a prospectus in which Reed called for massive American capital support for Russia and for the setting up of a newspaper to express the American viewpoint on the negotiations at Brest-Litovsk. Lenin found the proposal unsavory and withdrew the nomination; thereafter, Reed only mentioned Gumberg’s name with a string of epithets attached.[42] Ten Days that Shook the World would emerge from these experiences, being published early in 1919 and subsequently translated into numerous languages.\n\nedit] Back in the USA\n\nOn his away back to USA Reed travelled from Russia to Finland Reed, didn't have a visa or passport while crossing to Finland. In Turku harbor when Reed was on boarding a ship on his way to Stockholm Finnish police arrested Reed and took him to a prison in Suomenlinna coast of Helsinki until he was released. From Finland Reed travelled to Kristiania, Norway via Stockholm until April; during this period and after, US government surveillance of his activities and correspondence remained intense. His papers were not returned to him until November. Back in America, he took pains to defend the Bolsheviks and oppose American intervention, but a hyper-patriotic public incensed at Russia’s departure from the war gave him a generally cold reception. While he was in Russia, his articles in The Masses and particularly a headline, “Knit a straight-jacket for your soldier boy”, had been largely instrumental in bringing an indictment against that magazine for sedition. The first Masses trial ended the day before he arrived in a hung jury; the defendants, including himself, were to be retried, so after returning, he immediately posted $2000 bail on April 29.[43] The second trial also ended in a hung jury. In Philadelphia, he stood outside a closed hall on May 31, harangued a crowd of 1,000 until police dragged him away, was charged with inciting a riot, and posted $5000 bail. He was now more aggressively political, intolerant, and self-destructive;[44] his third arrest since his return from Russia came on September 14, when he was charged with violating the Sedition Act and freed on $5000 bail. This was a day after possibly the largest demonstration for Bolshevik Russia held in the United States (in The Bronx), when Reed passionately defended the revolution, which he seemed to think was coming to America as well.[45] He tried to prevent Allied intervention, arguing that the Russians were contributing to the war effort by checking German ambitions in the Ukraine and Japanese designs on Siberia, but this came to naught.[46] On February 21-22, 1919, Bryant was fiercely grilled before a Senate committee exploring Bolshevik propaganda activities in the US, but emerged resilient; Reed followed on the 22nd, delivering quick, subtle testimony which was, however, savagely distorted by the press.[47] Later that day he went to Philadelphia to stand trial for his May speech; despite a hostile judge, press, and patriotic speech by the prosecutor, Reed’s lawyer convinced the jury the case was about free speech, and he was acquitted.[48] Returning to New York, Reed continued speaking widely and participating in the various twists of socialist politics that year.\n\nAffiliated with the Left Wing of the Socialist Party, Reed with the other radicals was expelled from the National Socialist Convention in Chicago on August 30, 1919. The radicals then split into two bitterly hostile groups, forming the Communist Labor Party (Reed’s, in the creation of which he had been indispensable) and, the next day, the Communist Party. Reed was the international delegate of the former, wrote its manifesto and platform, edited its paper, The Voice of Labor, and was denounced as “Jack the Liar” in the Communist Party organ, The Communist. Reed’s writings from 1919 display doubts about Western-style democracy and defend the dictatorship of the proletariat, which he saw as a necessary step that would prefigure the true democracy “based upon equality and the liberty of the individual.”[49]\n\nedit] Second trip to Russia\n\nIndicted for sedition and hoping to secure Comintern backing for the CLP, he escaped from America in early October on board a Scandinavian frigate by means of a forged passport, working his way to Bergen as a stoker. Given shore leave, he disappeared to Kristiania, crossed into Sweden on October 22, passed through Finland and made his way to Moscow by train. In the cold winter of 1919-1920, he traveled in the region around Moscow, observing factories, communes, and villages; filling notebooks; and carrying on an affair with a Russian girl.[50] His feelings about the revolution were now ambiguous: on the one hand, he told Emma Goldman, who had recently arrived aboard The Buford and especially complained about the Cheka, that the enemies of the revolution deserved their fate. However, he suggested that she see Angelica Balabanoff, a critic of the current situation, indicating he wanted Goldman to hear the other side.[51]\n\nReed, although facing arrest in Illinois, tried to go back after February 1920, when the Soviets called for a merger convention to create a United Communist Party of America.[52] He first tried to leave through Latvia that month but his train never came and he returned in the boxcar of an eastbound military train, appearing frozen and exhausted in Petrograd.[53] In March, he crossed into Helsinki, where he had radical friends including a future polician and SDKL member of parliament Hella Wuolijoki, and was hidden in the hold of a freighter; on the 13th, customs officials found him in a coal bunker. Taken to the police station, he maintained that he was the seaman “Jim Gormley”, until his jewels, photographs, letters, and fake documents made him give his real name. Although beaten several times and threatened with torture, he refused to give the names of his local contacts. Because of his silence, he could not be tried for treason, instead being convicted of smuggling and having his jewels (102 small diamonds worth $14000) confiscated. The US Secretary of State was satisfied with his arrest and pressured the Finns for his papers, which were eventually delivered; otherwise, American authorities remained indifferent to his fate.[54] Although he paid the fine for smuggling, he was still detained illegally, and his physical condition and state of mind deteriorated sharply. He suffered from depression and insomnia, wrote alarming letters to Bryant, and threatened a hunger strike on May 18.[55] He was finally released in early June, sailing for Tallinn on the 5th. Two days later he traveled to Petrograd, recuperating from malnourishment and scurvy (having been fed dried fish almost exclusively) but in high spirits.[56]\n\nAt the end of June he went to Moscow and after discussing with Bryant the possibility of her joining him, she sailed on a Swedish tramp steamer on July 30, arriving in Gothenburg on August 10.[57] In July, Reed attended the second Comintern congress. There, although he was as jovial and boisterous as ever with other delegates, he appeared much thinner, weak and sallow, his face lined.[58] He bitterly objected to the meek submission that other revolutionaries showed to Russian wishes, which assumed the tide of revolutionary fervor that had marked the end of the war had now ebbed and it was the duty of communists to work within existing institutions – a policy he thought disastrous.[59] He was contemptuous of the bullying tactics displayed during the congress by Karl Radek and Grigory Zinoviev, who ordered Reed to attend the Congress of the Peoples of the East to be held at Baku on August 15. It was a long journey, five days by train through countryside devastated by civil war and infected by typhus. Reed was reluctant to go and asked to arrive later, as he had planned to go first to Petrograd, where Bryant was traveling from Murmansk. Zinoviev insisted Reed take the official train: “the Comintern has made a decision. Obey.” Reed would normally have rebelled at being spoken to with such contempt, but he needed Soviet good-will at the moment and was not prepared for a final break with the Comintern, so he made the trip with great reluctance.[60]\n\nJohn Reed's funeral in Moscow 1920\n\nWhat Reed did and thought on the way to the congress, while there, and returning is a matter of speculation, but years after abandoning Communism, his friend Benjamin Gitlow asserted that after the treatment he received from Zinoviev, Reed died in bitter disillusionment with the Communist movement.[61] While in Baku, Reed received a telegram announcing Bryant’s arrival in Moscow, where he impatiently came on September 15 and was able to tell her something of the preceding eight months, now looking older and wearing rags. He took her to meet Lenin, Trotsky, Lev Kamenev, and other leading Bolsheviks, and to visit Moscow’s ballet and art galleries.\n\nedit] Death\n\nReed was determined to return home, but fell ill on September 25. At first diagnosed with influenza, he was hospitalized five days later and was found to have spotted typhus. Bryant spent all her time with him, but there were no medicines to be obtained due to the Allied blockade. His mind started to wander, and then he lost the use of the right side of his body and could no longer speak. His wife was holding his hand when he died.[62] After a hero’s funeral, his body was buried in the Kremlin Wall Necropolis.\n\nedit] Legacy\n\nReed, allowed to occupy the roles of \"romantic revolutionary\" and \"playboy\" in American culture,[63] was also used as a symbol by the Communist movement to which he belonged. He was the only American buried in the Kremlin, although half of Bill Haywood's ashes are there as well. By the 1930s, John Reed Clubs, affiliated with the Communist Party, existed in his honor in nearly all the large cities of the United States.\n\nThe 1981 film Reds, starring Warren Beatty, Diane Keaton, and Jack Nicholson and based on his life, won three Academy Awards, and was nominated for nine more. Other film portrayals of Reed include the 1982 two-part Soviet production Red Bells, starring Franco Nero; and the 1973 film Reed: Mexico Insurgente, based on his accounts of the Mexican Revolution.\n\nA perennial urban legend in Reed's hometown states that Reed College was named for him. Despite the college's reputation for leftist politics, there is no truth to this rumor.\n\nedit] Bibliography\n\nInsurgent Mexico (1914)\n\n(1914) The War in Eastern Europe (1916)\n\n(1916) Ten Days that Shook the World (1919)\n\n(1919) Daughter of the Revolution and Other Stories (1927)\n\nedit] References\n\nedit] Further reading\n\nHomberger, Eric. John Reed : Manchester University Press, Manchester, 1990.\n\n: Manchester University Press, Manchester, 1990. Dictionary of American Biography , vol. 15, pp. 450-51. New York, Charles Scribner's Sons, 1935.\n\n, vol. 15, pp. 450-51. New York, Charles Scribner's Sons, 1935. Rosenstone, Robert A. (1990), Romantic Revolutionary: A biography of John Reed, Harvard University Press, ISBN 0-674-77938-X"}, {"url": "https://www.newworldencyclopedia.org/entry/John_Reed", "page_content": "John \"Jack\" Silas Reed (October 22, 1887 – October 17, 1920) was an American journalist, poet, and communist activist. Reed first gained prominence as a war correspondent during the first World War. He and his wife, fellow journalist Louise Bryant, were in Petrograd, Russia when the October Revolution broke out. He catalogued those events in his book Ten Days That Shook the World.\n\nReed was not only a witness to the revolution, but an enthusiastic supporter as well. He offered his services translating decrees, and even took up arms, joining a patrol against counterrevolutionaries. He fell ill and died in Russia during the fall of 1920. He was given a state funeral and was one of three Americans buried at the Kremlin.\n\nEarly life\n\nJohn Silas Reed was born on October 22, 1887, in his maternal grandparents' mansion in what is now the Goose Hollow neighborhood of Portland, Oregon. His grandmother's household had Chinese servants.[1] Reed wrote of paying a nickel to a \"Goose Hollowite\" (young toughs in a gang in the working-class neighborhood below King's Hill) to keep from being beaten up. In 2001 a memorial bench dedicated to Reed was installed in Washington Park, which overlooks the site of Reed's birthplace (the mansion no longer exists).[2]\n\nHis mother, Margaret (Green) Reed, was the daughter of Portland industrialist Henry Dodge Green,[3] who had made a fortune founding and operating three businesses: the first gas & light company, the first pig iron smelter on the West Coast, and the Portland water works (he was its second owner).[4] SW Green Avenue was named in his honor.[5]\n\nJohn's father, Charles Jerome Reed, was born in the East and came to Portland as the representative of an agricultural machinery manufacturer. With his ready wit, he quickly won acceptance in Portland's business community.[6] The couple had married in 1886, and the family's wealth came from the Green side, not the Reed side.\n\nA sickly child, young Jack grew up surrounded by nurses and servants. His mother carefully selected his upper-class playmates. He had a brother, Harry, who was two years younger. Jack and his brother were sent to the recently established Portland Academy, a private school.[7] Jack was bright enough to pass his courses but could not be bothered to work for top marks, as he found school dry and tedious.[8] In September 1904, he was sent to Morristown, a New Jersey prep school, to prepare for college. His father, who did not attend college, wanted his sons to go to Harvard.[9] At Morristown Jack continued his poor classroom performance, but made the football team and showed some literary promise.[10]\n\nThe Harvard Monthly Vol. 44 (1907) Vol. 44 (1907)\n\nReed failed his first attempt at Harvard College's admission exam but passed on his second try, and enrolled in the fall of 1906.[11] Tall, handsome, and lighthearted, he threw himself into all manner of student activities. He was a member of the cheerleading team, the swimming team, and the dramatic club, served on the editorial boards of the Lampoon and The Harvard Monthly, and was president of the Harvard Glee Club. In 1910 he held a position in the Hasty Pudding Theatricals, and also wrote music and lyrics for their show Diana's Debut. Reed failed to make the football and crew teams, but excelled in swimming and water polo.[12] He was also made \"Ivy orator and poet\" in his senior year.\n\nReed attended meetings of the Socialist Club, over which his friend Walter Lippmann presided, but never joined. The group introduced legislation into the state legislature, attacked the university for failing to pay its servants living wages, and petitioned the administration to establish a course on socialism.[13] Reed later recalled:\n\nAll this made no ostensible difference in the look of Harvard society, and probably the club-men and the athletes, who represented us to the world, never even heard of it. But it made me, and many others, realize that there was something going on in the dull outside world more thrilling than college activities, and turned our attention to the writings of men like H.G. Wells and Graham Wallas, wrenching us away from the Oscar Wildian dilettantism which had possessed undergraduate litterateurs for generations.[14]\n\nReed graduated from Harvard College in 1910. That summer he set out to see more of the \"dull outside world,\" visiting England, France, and Spain before returning home to America the following spring.[15] Reed worked as a common laborer on a cattle boat to pay his fare to Europe. His travels were encouraged by his favorite professor, Charles Townsend Copeland (\"Copey\"), who told him he must \"see life\" if he wanted to write about it successfully.[16]\n\nCareer\n\nJournalist\n\nReed had determined to become a journalist, and set out to make his mark in New York, a center of the industry. Reed made use of a valuable contact from Harvard, Lincoln Steffens, who was establishing a reputation as a muckraker. He appreciated Reed's skills and intellect at an early date. Steffens landed his young admirer an entry-level position on The American Magazine, where he read manuscripts, corrected proofs, and later helped with the composition. Reed supplemented his salary by taking an additional job as the business manager of a new short-lived quarterly magazine called Landscape Architecture.[17]\n\nA native of Oregon , John Reed made New York City the base of his operations.\n\nReed made his home in Greenwich Village, a burgeoning hub of poets, writers, activists, and artists. He came to love New York, relentlessly exploring it and writing poems about it. His formal jobs on the magazines paid the rent, but it was as a freelance journalist that Reed sought to establish himself. He collected rejection slips, circulating an essay and short stories about his six months in Europe, eventually breaking through in The Saturday Evening Post. Within a year, Reed had other work accepted by Collier's, The Forum, and The Century Magazine. One of his poems was set to music by composer Arthur Foote. The editors at The American came to see him as a contributor and began to publish his work.[18]\n\nReed's serious interest in social problems was first aroused about this time by Steffens and Ida Tarbell. He moved beyond them to a more radical political position than theirs. In 1913 he joined the staff of The Masses, edited by Max Eastman. Reed contributed more than 50 articles, reviews, and shorter pieces to this socialist publication.\n\nThe first of Reed's many arrests came in Paterson, New Jersey, in 1913, for attempting to speak on behalf of strikers in the New Jersey silk mills. The harsh treatment meted out by the authorities to the strikers and the short jail term he served further radicalized Reed. He allied with the general socialist union, the Industrial Workers of the World. His account of his experiences was published in June as an article, \"War in Paterson.\" During the same year, following a suggestion made by IWW leader Bill Haywood, Reed put on \"The Pageant of the Paterson Strike\" in Madison Square Garden as a benefit for the strikers.[19]\n\nIn the autumn of 1913, Reed was sent to Mexico by the Metropolitan Magazine to report the Mexican Revolution.[20] He shared the perils of Pancho Villa's army for four months and was with Villa's Constitutional (Constitutionalist) Army (whose \"Primer Jefe\" political chief was Venustiano Carranza) when it defeated Federal forces at Torreón, opening the way for its advance on Mexico City.[21] Reed adored Villa, but Carranza left him cold.\n\nReed's reporting on the Villistas in a series of outstanding magazine articles gained him a national reputation as a war correspondent. Reed deeply sympathized with the peons and vehemently opposed American intervention. Reed's reports were collected and published as the book Insurgent Mexico (1914).\n\nOn April 30, 1914, Reed arrived in Colorado, scene of the recent Ludlow massacre, which was part of the Colorado Coalfield War between the John D. Rockefeller, Jr.-owned Colorado Fuel & Iron Company and United Mine Workers union supporters. There he spent a little more than a week, during which he investigated the events, spoke on behalf of the miners, and wrote an impassioned article on the subject (\"The Colorado War\", published in July). He came to believe much more deeply in class conflict.[22]\n\nReed spent summer 1914 in Provincetown, Massachusetts with Mabel Dodge and her son, putting together Insurgent Mexico and interviewing President Wilson on the subject. The resulting report, much watered down at White House insistence, was not a success.[23]\n\nWar correspondent\n\nOn August 14, 1914, shortly after Germany declared war on France, Reed set sail for neutral Italy, on assignment for the Metropolitan. He met his lover Mabel Dodge in Naples, and the pair made their way to Paris. Reed believed the war was the result of imperialist commercial rivalries and felt little sympathy for any of the parties.\n\nIn an unsigned piece titled \"The Traders' War,\" published in the September 1914 issue of The Masses, Reed wrote:\n\nThe real War, of which this sudden outburst of death and destruction is only an incident, began long ago. It has been raging for tens of years, but its battles have been so little advertised that they have been hardly noted. It is a clash of Traders... What has democracy to do in alliance with Nicholas, the Tsar? Is it Liberalism which is marching from the Petersburg of Father Gapon, from the Odessa of the pogroms?... No. There is a falling out among commercial rivals.... We, who are Socialists, must hope—we may even expect—that out of this horror of bloodshed and dire destruction will come far-reaching social changes—and a long step forward towards our goal of Peace among Men. But we must not be duped by this editorial buncombe about Liberalism going forth to Holy War against Tyranny. This is not Our War.[24]\n\nIn France, Reed was frustrated by wartime censorship and the difficulty of reaching the front. Reed and Dodge went to London, and Dodge soon left for New York, to Reed's relief. The rest of 1914 he spent drinking with French prostitutes and pursuing an affair with a German woman. The pair went to Berlin in early December. While there, Reed interviewed Karl Liebknecht, one of the few socialists in Germany to vote against war credits. Reed was deeply disappointed by the general collapse in working-class solidarity promised by the Second International, and by its replacement with militarism and nationalism.[25]\n\n1917 c. 1917 Reedc. 1917\n\nHe returned to New York in December and wrote more about the war. In 1915 he traveled to Central Europe, accompanied by Boardman Robinson, a Canadian artist and frequent Masses contributor. Traveling from Thessaloniki, they saw scenes of profound devastation in Serbia (including a bombed-out Belgrade), also going through Bulgaria and Romania. They passed through the Jewish Pale of Settlement in Bessarabia. In Chełm they were arrested and incarcerated for several weeks. At risk of being shot for espionage, they were saved by the American ambassador.\n\nTraveling to Russia, Reed was outraged to learn that the American ambassador in Petrograd was inclined to believe they were spies. Reed and Robinson were rearrested when they tried to slip into Romania. This time the British ambassador (Robinson being a British subject) finally secured permission for them to leave, but not until after all their papers were seized in Kiev. In Bucharest, the duo spent time piecing together more of their journey. At one point Reed traveled to Constantinople in hopes of seeing action at Gallipoli. From these experiences he wrote the book, The War in Eastern Europe, published in April 1916.\n\nAfter returning to New York, Reed visited his mother in Portland. There he met and fell in love with Louise Bryant, who joined him on the East coast in January 1916. Though happy, both also had affairs with others, in accordance with their bohemian circle and ideas about sexual liberation. Early in 1916 Reed met the young playwright Eugene O'Neill. Beginning that May, the three rented a cottage in Provincetown, Massachusetts, a summer destination on Cape Cod for many artists and writers from Greenwich Village. Not long after, Bryant and O'Neill began a romance.\n\nThat summer Reed covered the Presidential nominating conventions. He endorsed Woodrow Wilson, believing that he would make good on his promise to keep America out of the war.[26] In November 1916 he married Bryant in Peekskill, New York. The same year, he underwent an operation at Johns Hopkins Hospital to remove a kidney. He was hospitalized until mid-December.[27] The operation rendered him ineligible for conscription and saved him from registering as a conscientious objector, as had been his intention. During 1916 he privately published Tamburlaine and Other Verses, in an edition of 500 copies.\n\nAs the country raced towards war, Reed was marginalized: his relationship with the Metropolitan was over. He pawned his late father's watch and sold his Cape Cod cottage to the birth control activist and sex educator Margaret Sanger.[28]\n\nWhen Wilson asked for a declaration of war on April 2, 1917, Reed shouted at a hastily convened meeting of the People's Council in Washington: \"This is not my war, and I will not support it. This is not my war, and I will have nothing to do with it.\"[29] In July and August Reed continued to write vehement articles against the war for The Masses, which the United States Post Office Department refused to mail, and for Seven Arts. Due to antiwar articles by Reed and Randolph Bourne, the arts magazine lost its financial backing and ceased publication.[30] Reed was stunned by the nation's pro-war fervor, and his career lay in ruins.\n\nWitness to the Russian Revolution\n\nWorker of the American labor movement, internationalist writer, John Reed. Stamp of USSR, 1987.\n\nOn August 17, 1917, Reed and Bryant set sail from New York to Europe, having first provided the State Department with legally sworn assurances that neither would represent the Socialist Party at a forthcoming conference in Stockholm.[31] The pair were going as working journalists to report on the sensational developments taking place in the fledgling republic of Russia. Traveling by way of Finland, the pair arrived in the capital city of Petrograd immediately after the failed military coup of monarchist General Lavr Kornilov. This was an attempt to topple the Provisional Government of Alexander Kerensky by force of arms. Reed and Bryant found the Russian economy in shambles. Several of the subject nations of the old empire, such as Finland and Ukraine, had gained autonomy and were seeking separate military accommodations with Germany.\n\nReed and Bryant were in Petrograd for the October Revolution, in which the Bolsheviks, headed by Vladimir Lenin, toppled the Kerensky government; the Bolsheviks believed this was the first blow of a worldwide socialist revolution.\n\nFood shortages made the situation dire in the capital, and social disorder reigned. Reed later recalled:\n\nThe last month of the Kerensky regime was marked first by the falling off of the bread supply from 2 pounds a day to 1 pound, to half a pound, to a quarter of a pound, and, the final week, no bread at all. Holdups and crime increased to such an extent that you could hardly walk down the streets. The papers were full of it. Not only had the government broken down, but the municipal government had absolutely broken down. The city militia was quite disorganized and up in the air, and the street-cleaning apparatus and all that sort of thing had broken down—milk and everything of that sort.[32]\n\nA mood for radical change was in the air. The Bolsheviks, seeking an all-socialist government and immediate end to Russian participation in the war, sought the transfer of power from Kerensky to a Congress of Soviets, a gathering of elected workers' and soldiers' deputies to be convened in October. The Kerensky government considered this a kind of coup, and moved to shut down the Bolshevik press. It issued warrants of arrest for the Soviet leaders and prepared to transfer the troops of the Petrograd garrison, believed to be unreliable, back to the front. A Military Revolutionary Committee of the Soviets, dominated by the Bolshevik Party, determined to seize power on behalf of the future Congress of Soviets. At 11 pm on the evening of November 7, 1917, it captured the Winter Palace, the seat of Kerensky's government.[33] Reed and Bryant were present during the fall of the Winter Palace, the symbolic event that started the Bolshevik Revolution.[34]\n\nThe cover of this 1919 British pamphlet emphasizes Reed's short-lived status as Soviet consul.\n\nReed was an enthusiastic supporter of the new revolutionary socialist government. He went to work for the new People's Commissariat for Foreign Affairs, translating decrees and news of the new government into English. \"I also collaborated in the gathering of material and data and distributing of papers to go into the German trenches,\" Reed later recalled.[35]\n\nReed was close to the inner circle of the new government. He met Leon Trotsky and was introduced to Lenin during a break of the Constituent Assembly on January 18, 1918. By December, his funds were nearly exhausted, and he took a job with American Raymond Robins of the International Red Cross. Robins wanted to set up a newspaper promoting American interests; Reed complied. But in the dummy issue he prepared, he included a warning beneath the masthead: \"This paper is devoted to promoting the interests of American capital.\"[36]\n\nThe dissolution of the Constituent Assembly left Reed unmoved. Two days later, armed with a rifle, he joined a patrol of Red Guards prepared to defend the Foreign Office from counter-revolutionary attack. Reed attended the opening of the Third Congress of Soviets, where he gave a short speech promising to bring the news of the revolution to America, saying he hoped it would \"call forth an answer from America's oppressed and exploited masses.\" American journalist Edgar Sisson told Reed that he was being used by the Bolsheviks for their propaganda, a rebuke he accepted.[37]\n\nIn January, Trotsky, responding to Reed's concern about the safety of his substantial archive, offered Reed the post of Soviet Consul in New York. As the United States did not recognize the Bolshevik government, Reed's credentials would almost certainly have been rejected and he would have faced prison (which would have given the Bolsheviks some propaganda material). Most Americans in Petrograd considered Reed's appointment a massive blunder. Businessman Alexander Gumberg met with Lenin, showing him a prospectus in which Reed called for massive American capital support for Russia and for setting up a newspaper to express the American viewpoint on the negotiations at Brest-Litovsk. Lenin found the proposal unsavory and withdrew Reed's nomination. Learning of Gumberg's intervention, Reed always denigrated him afterward.[38]\n\nReed and Bryant wrote and published books about their Russian experiences. Bryant's Six Red Months in Russia appeared first, but Reed's 10 Days That Shook the World (1919) garnered more notice.\n\nBryant returned to the United States in January 1918, but Reed did not reach New York City until April 28.[39] On his way back, Reed traveled from Russia to Finland; he did not have a visa or passport while crossing to Finland. In Turku harbor, when Reed was boarding a ship on his way to Stockholm, Finnish police arrested him; he was held at Kakola prison in Turku until he was released. From Finland, Reed traveled to Kristiania, Norway via Stockholm.\n\nBecause he remained under indictment in the Masses case, federal authorities immediately met Reed when his ship reached New York, holding him on board for more than eight hours while they searched his belongings. Reed's papers, the material from which he intended to write his book, were seized. He was released upon his own recognizance after his attorney, Morris Hillquit, promised to make him available at the Federal Building the next day.[40] His papers were not returned to him until November.\n\nRadical political activist\n\nVoice of Labor, October 1919 Cover of Reed'sOctober 1919\n\nBack in America, Reed and Bryant defended the Bolsheviks and opposed the American intervention. Incensed at Russia's departure from the war against Germany, the public gave Reed a generally cold reception. While he was in Russia, his articles in The Masses, particularly one headlined \"Knit a straight-jacket for your soldier boy,\" had been instrumental in the government gaining an indictment for sedition against the magazine (antiwar agitation was considered sedition and treason).\n\nThe first Masses trial ended in a hung jury the day before Reed reached New York. The defendants, including him, were to be retried. He immediately posted $2,000 bail on April 29.[41] The second Masses trial also ended in a hung jury.\n\nIn Philadelphia, Reed stood outside a closed hall on May 31, and harangued a crowd of 1,000 about the case and the war until police dragged him away. He was arrested for inciting a riot, and posted $5,000 bail. Reed became more aggressively political, intolerant, and self-destructive. On September 14, he was arrested for the third time since returning from Russia, charged with violating the Sedition Act and freed on $5,000 bail. This was a day after possibly the largest demonstration for Bolshevik Russia was held in the United States (in The Bronx). Reed had passionately defended the revolution, which he seemed to think was coming to America as well. He tried to prevent Allied intervention in Russia, arguing that the Russians were contributing to the war effort by checking German ambitions in the Ukraine and Japanese designs on Siberia, but this argument had no traction with the people.[42]\n\nOn February 21–22, 1919, Bryant was fiercely grilled before a Senate committee exploring Bolshevik propaganda activities in the U.S., but emerged resilient. Reed followed her. According to Homberger, his testimony was \"savagely distorted\" by the press. Later that day Reed went to Philadelphia to stand trial for his May speech; despite a hostile judge, press, and patriotic speech by the prosecutor, Reed's lawyer convinced the jury the case was about free speech, and he was acquitted.[43] Returning to New York, Reed continued speaking widely and participating in the various twists of socialist politics that year. He served as editor of The New York Communist, the weekly newspaper issued by the Left Wing Section of Greater New York.\n\nAffiliated with the Left Wing of the Socialist Party, Reed with the other radicals was expelled from the National Socialist Convention in Chicago on August 30, 1919. The radicals split into two bitterly hostile groups, forming the Communist Labor Party of America (Reed's group, which he helped create) and, the next day, the Communist Party of America. Reed was the international delegate of the former, wrote its manifesto and platform, edited its paper, The Voice of Labor, and was denounced as \"Jack the Liar\" in the Communist Party organ, The Communist. Reed's writings of 1919 displayed doubts about Western-style democracy and defended the dictatorship of the proletariat. He believed this was a necessary step that would prefigure the true democracy \"based upon equality and the liberty of the individual.\"[44]\n\nComintern functionary\n\nIndicted for sedition and hoping to secure Comintern backing for the CLP, Reed fled America with a forged passport in early October 1919 on a Scandinavian frigate; he worked his way to Bergen, Norway as a stoker. Given shore leave, he disappeared to Kristiania, crossed into Sweden on October 22, passed through Finland and made his way to Moscow by train. In the cold winter of 1919–20, he traveled in the region around Moscow, observing factories, communes, and villages. He filled notebooks with his writing and had an affair with a Russian woman.[45]\n\nReed's feelings about the revolution became ambivalent. Activist Emma Goldman had recently arrived aboard the Buford, among hundreds of aliens deported by the United States under the Sedition Act. She was especially concerned about the Cheka. Reed told her that the enemies of the revolution deserved their fate, but suggested that she see Angelica Balabanoff, a critic of the current situation. He wanted Goldman to hear the other side.[46]\n\n10 Days That Shook The World, published by the Comintern in Hamburg in 1922 German edition of, published by the Comintern in Hamburg in 1922\n\nThough facing the threat of arrest in Illinois, Reed tried to return to the United States in February 1920. At that time, the Soviets organized a convention to establish a United Communist Party of America. Reed attempted to leave Russia through Latvia, but his train never arrived, forcing him to hitch a ride in the boxcar of an eastbound military train to Petrograd.[47] In March, he crossed into Helsinki, where he had radical friends, including Hella Wuolijoki, the future politician and member of parliament. With their help, he was hidden in the hold of a freighter.\n\nOn March 13, Finnish customs officials found Reed in a coal bunker on the ship. He was taken to the police station, where he maintained that he was seaman \"Jim Gormley\". Eventually, the jewels, photographs, letters, and fake documents he had in his possession forced him to reveal his true identity. Although beaten several times and threatened with torture, he refused to surrender the names of his local contacts. Because of his silence, he could not be tried for treason. He was charged and convicted of smuggling and having jewels in his possession (102 small diamonds worth $14,000, which were confiscated).\n\nThe US Secretary of State was satisfied with Reed's arrest and pressured the Finnish authorities for his papers. American authorities, however, remained indifferent to Reed's fate. Although Reed paid the fine for smuggling, he was still detained. His physical condition and state of mind deteriorated rapidly. He suffered from depression and insomnia, wrote alarming letters to Bryant, and on May 18 threatened a hunger strike. He was finally released in early June, and sailed for Tallinn, Estonia, on the 5th. Two days later, he traveled to Petrograd, recuperating from malnutrition and scurvy caused by having been fed dried fish almost exclusively. Still, his spirits were high.[48]\n\nAt the end of June, Reed traveled to Moscow. After he discussed with Bryant the possibility of her joining him, she gained passage on a Swedish tramp steamer and arrived in Gothenburg on August 10. At the same time, Reed attended the second Comintern congress. Although his mood was as jovial and boisterous as ever, his physical appearance had deteriorated.[49]\n\nDuring this congress, Reed bitterly objected to the deference other revolutionaries showed to the Russians. The latter believed the tide of revolutionary fervor was ebbing, and that the Communist party needed to work within the existing institutions—a policy Reed felt would be disastrous. He was contemptuous of the bullying tactics displayed during the congress by Karl Radek and Grigory Zinoviev, who ordered Reed to attend the Congress of the Peoples of the East to be held at Baku on August 15.\n\nThe journey to Baku was a long one, five days by train through a countryside that was devastated by civil war and typhus. Reed was reluctant to go. He asked for permission to travel later, as he wanted to meet Bryant in Petrograd after she arrived from Murmansk. Zinoviev insisted that Reed take the official train: \"the Comintern has made a decision. Obey.\"[50] Reed, needing Soviet goodwill and unprepared for a final break with the Comintern, made the trip with reluctance. Years after having abandoned Communism himself, his friend Benjamin Gitlow asserted that Reed became bitterly disillusioned with the Communist movement because of his treatment by Zinoviev.\n\nDuring his time in Baku, Reed received a telegram announcing Bryant's arrival in Moscow. He followed her there, arriving on September 15, and was able to tell her of the events of the preceding eight months. He appeared older and his clothes were in tatters. While in Moscow, he took Bryant to meet Lenin, Trotsky, Lev Kamenev, and other leading Bolsheviks, and also to visit Moscow's ballet and art galleries.\n\nDeath\n\nReed's body lying in state in Moscow\n\nReed was determined to return to the United States but fell ill on September 25. At first thought to have influenza, he was hospitalized five days later and diagnosed with spotted typhus. Bryant spent all her time with him, but there were no medicines to be obtained because of the Allied blockade. Reed's mind started to wander; eventually he lost the use of the right side of his body and could no longer speak. His wife was holding his hand when he died in Moscow on October 17, 1920.[51] After a hero's funeral, Reed's body was buried at the Kremlin Wall Necropolis. He remains one of only three Americans who were honored by being buried there, the other two being C. E. Ruthenberg, the founder of [[Communist Party USA, and Bill Haywood, a founding member and leader of the Industrial Workers of the World.\n\nLegacy\n\nReed's interpretation in popular culture has varied. Some, such as biographer Robert A. Rosenstone, have called him a romantic, while Upton Sinclair derided him as a \"playboy of the revolution.\"[52] For the Communist movement to which he belonged, Reed became a symbol of the international nature of the Bolshevik revolution, a martyr buried at the Kremlin wall amid solemn fanfare, his name to be uttered reverently as a member of the radical pantheon. By the 1930s, the height of the communist movement in the United States, literary John Reed Clubs, affiliated with the Communist Party, existed in his honor in many large cities of the United States. Others, such as his old friend and comrade Benjamin Gitlow, claimed that Reed had begun to shun the bureaucracy and violence of Soviet Communism toward the end of his life. They sought to posthumously enlist Reed in their own anti-communist cause.\n\nRepresentation in other media\n\nSoviet director Sergei Eisenstein's influential 1927 silent film October: Ten Days That Shook the World was based on Reed's book.\n\nwas based on Reed's book. John Dos Passos included a highly stylized, brief biography of Reed in his 1932 novel/history work 1919, the second part of his U.S.A. trilogy.\n\nthe second part of his U.S.A. trilogy. The 1958 Soviet film In October Days (Russian: В дни Октября ), directed by Sergei Vasilyev, featured Reed and Bryant.\n\n(Russian: ), directed by Sergei Vasilyev, featured Reed and Bryant. Actor and director Warren Beatty made the film Reds (1981), based on Reed's life. Beatty starred as Reed, Diane Keaton as Louise Bryant. and Jack Nicholson as Eugene O'Neill. The movie won three Academy Awards and was nominated for nine others.\n\nTwo films are based on Reed's accounts of the Mexican Revolution, one with two parts released a year apart. Mexican director Paul Leduc made Reed: Insurgent Mexico (1973).[53] A Mexican–Soviet-Italian co-production released Red Bells (1982) and Red Bells II (1983), both directed by Sergei Bondarchuk, with Franco Nero as Reed.[54]\n\nPublications\n\nDiana's Debut. Lyrics by J.S. Reed, music by Walter S. Langsham. Privately printed, Cambridge, 1910\n\nLyrics by J.S. Reed, music by Walter S. Langsham. Privately printed, Cambridge, 1910 Sangar: The Mad Recreant Knight of the West. Dedicated to Lincoln Steffens. Frederick C. Bursch, Hillacre Riverside, CT, 1913\n\nDedicated to Lincoln Steffens. Frederick C. Bursch, Hillacre Riverside, CT, 1913 The Day in Bohemia, of Life Among the Artists. Privately printed Riverside, CT 1913\n\nPrivately printed Riverside, CT 1913 Everymagazine, An Immortality Play . Words by John Reed, music by Bill Daly. Privately printed, New York, 1913\n\n. Words by John Reed, music by Bill Daly. Privately printed, New York, 1913 Insurgent Mexico. D. Appleton & Co., New York, 1914. Retrieved December 14, 2021.\n\nD. Appleton & Co., New York, 1914. Retrieved December 14, 2021. The War in Eastern Europe. Charles Scribner's Sons, New York, 1916\n\nCharles Scribner's Sons, New York, 1916 Freedom: A Prison Play , 1916\n\n, 1916 Tamburlaine and Other Verses. Frederick C. Bursch, Hillacre Riverside, CT, 1917\n\nFrederick C. Bursch, Hillacre Riverside, CT, 1917 The Sisson Documents . Liberator Publishing Co., New York, 1918\n\n. Liberator Publishing Co., New York, 1918 Ten Days that Shook the World. Boni and Liveright, New York, 1919\n\nBoni and Liveright, New York, 1919 Red Russia: The Triumph of the Bolsheviki. Workers' Socialist Federation, London 1919. – pamphlet collecting journalism from The Liberator . Retrieved December 14, 2021.\n\nWorkers' Socialist Federation, London 1919. – . Retrieved December 14, 2021. Red Russia : Book II. Workers' Socialist Federation. Retrieved December 14, 2021.\n\nWorkers' Socialist Federation. Retrieved December 14, 2021. The Structure of the Soviet State , 1919\n\n, 1919 Daughter of the Revolution and Other Stories. Floyd Dell, editor. Vanguard Press, New York, 1927\n\nFloyd Dell, editor. Vanguard Press, New York, 1927 The Education of John Reed: Selected Writings. John Stuart, editor. International Publishers, New York, 1955\n\nJohn Stuart, editor. International Publishers, New York, 1955 Adventures of a Young Man: Short Stories from Life. Seven Seas, Berlin 1966. City Lights, San Francisco, 1975\n\nSeven Seas, Berlin 1966. City Lights, San Francisco, 1975 Collected Poems. Corliss Lamont, editor. Lawrence Hill & Co., Westport, CT, 1985\n\nNotes\n\nReferences ISBN links support NWE through referral fees\n\nAll links retrieved August 3, 2022."}, {"url": "https://www.oregonhistoryproject.org/articles/biographies/john-reed-biography/", "page_content": "1887-1920\n\nFor John Silas “Jack” Reed, the conservative, early twentieth-century city of Portland could never be “prepared to understand his dreams” of social revolution and change. Born in 1887, Reed grew up in a stately Portland mansion, attended the Portland Youth Academy and later, boarding school. Fascinated with the travels of his uncle and the unfamiliar habits of his family's Chinese servant Lee Sing, Reed's early writings were inspired by his desire to see the world.\n\nPraised for his poetry and writing skills, Reed graduated from Harvard in 1910 and began a career in journalism in New York. He wrote predominantly for leftist magazines and was celebrated among Greenwich Village radicals. Reed first gained prominence when he covered the 1911 Mexican revolution alongside revolutionary Pancho Villa. The event inspired his romanticized chronicle, Insurgent Mexico. In 1915, Reed toured Eastern Europe reporting on the atrocities and injustices of World War I. He became especially captivated with Russia and its potential for revolution, writing that Russians “are perhaps the most interesting human beings that exist.”\n\nReturning home in December 1915, Reed was lonely and tired of war, but on a visit to Portland he met Louise Bryant. In Bryant, Reed found his intellectual match. They married in 1916 and, after living for a time in New York City and Massachusetts, departed for Russia in 1917 to witness the revolution. Reed's 1919 book Ten Days That Shook the World was an account of the Bolshevik seizure of power. In 1920, Reed traveled back to the U.S. to coordinate a domestic Communist party. Upon his return to Russia he was imprisoned and held in solitary confinement in Finland. Later released, a sickly Reed reunited with Bryant in Russia, but was tragically stricken with typhus.\n\nJohn Reed died in October 1920. The only American ever buried at the Kremlin, Reed's idealism, intellect, and spirit would inspire radicals to form John Reed Clubs across the United States."}, {"url": "https://www.oregonhistoryproject.org/articles/historical-records/john-reed-1887-1920/", "page_content": "John Reed (1887-1920)\n\nFor John Silas “Jack” Reed, the conservative, early twentieth-century city of Portland could never be “prepared to understand his dreams” of social revolution and change. Born in 1887, Reed grew up in a stately Portland mansion, attended the Portland Youth Academy and later, boarding school. Fascinated with the travels of his uncle and the unfamiliar habits of his family’s Chinese servant Lee Sing, Reed’s early writings were inspired by his desire to see the world.\n\n\n\nPraised for his poetry and writing skills, Reed graduated from Harvard in 1910 and began a career in journalism in New York. He wrote predominantly for leftist magazines and was celebrated among Greenwich Village radicals. Reed first gained prominence when he covered the 1911 Mexican revolution alongside revolutionary Pancho Villa. The event inspired his romanticized chronicle, Insurgent Mexico. In 1915, Reed toured Eastern Europe reporting on the atrocities and injustices of World War I. He became especially captivated with Russia and its potential for revolution, writing that Russians “are perhaps the most interesting human beings that exist.”\n\n\n\nReturning home in December 1915, Reed was lonely and tired of war, but on a visit to Portland he met Louise Bryant. In Bryant, Reed found his intellectual match. They married in 1916 and, after living for a time in New York City and Massachusetts, departed for Russia in 1917 to witness the revolution. Reed’s 1919 book Ten Days That Shook the World was an account of the Bolshevik seizure of power. In 1920, Reed traveled back to the U.S. to coordinate a domestic Communist party. Upon his return to Russia he was imprisoned and held in solitary confinement in Finland. Later released, a sickly Reed reunited with Bryant in Russia, but was tragically stricken with typhus.\n\n\n\nJohn Reed died in October 1920. The only American ever buried at the Kremlin, Reed’s idealism, intellect, and spirit would inspire radicals to form John Reed Clubs across the United States.\n\n\n\nFurther reading:\n\n\n\nEdwin R. Bingham. “Oregon's Romantic Rebels: John Reed and Charles Erskine Scott Wood.” Pacific Northwest Quarterly 50:3 (1959), 77-90.\n\n\n\nDavid C. Duke. John Reed. Boston, Mass., Twayne Publishers, 1987.\n\n\n\nBarbara Gelb. So Short a Time: A Biography of John Reed and Louise Bryant. New York, Norton, 1973.\n\n\n\nGranville Hicks. John Reed: The Making of a Revolutionary (2nd ed.). New York, B. Blom, 1968.\n\n\n\nMichael Munk. “The Romance of John Reed and Louise Bryant: New Documents Clarify How They Met.” Oregon Historical Quarterly 109:3 (Fall 2008), 461-477.\n\n\n\nRobert A. Rosenstone. Romantic Revolutionary: A Biography of John Reed (2nd ed.). New York: Vintage Books, 1981.\n\n\n\n© 2002 Oregon Historical Society"}, {"url": "https://pdxsocialhistory.org/stories/john-reed-in-portland.html", "page_content": "A bench in Washington Park is the only memorial in the United States dedicated to journalist John Reed who reported on the Bolshevik Revolution. Reed's book is called \"Ten Days That Shook the World\" and it talks about the experience. The book was made into the film called \"Reds\" in the 1980s.\n\nAs Told By...\n\nMichael Munk\n\nRetired Political Scientist\n\nMichael Munk was born in Prague in 1934 and escaped the Nazi occupation of Czechoslovakia to Portland in 1939. His political activity began in the 1950s, when he became a local opponent of nuclear testing as well as a promoter of a Portland concert from Paul Robeson. He received his PhD in Politics from New York University, taught political science for more than twenty-five years at the State University of New York at Stony Brook, Roosevelt University in Chicago and Rutgers University before retiring in Portland. He is author of The Portland Red Guide (Ooligan Press, 2007), as well as articles in Oregon Historical Quarterly, Pacific Northwest Quarterly, Portland Alliance and more."}, {"url": "https://www.sunsigns.org/famousbirthdays/profile/john-reed/", "page_content": "John Silas Reed was born on October 22, 1887, in Portland, Oregon. His mother Margaret Green Reed came from a prominent Portland family. Her father owned the first gas works in Oregon, the first pig iron smelter and was the second owner of Portland waterworks. Reed’s father Charles Jerome was agricultural machinery manufacturing representative. As a child, Reed was often sick and grew up surrounded by nurses and servants. His playmates were also selected for him from other upper-class families. He attended the Portland Academy and in 1904 was sent to Morristown School in New Jersey. Reed was not good with his school work, but got accepted in the football team and showed literary talents.\n\nReed’s father never attended college and wanted his son to go to Harvard. However, John Silas Reed failed his first admission exam but passed it for the second time. Reed got enrolled in Harvard in 1906. He threw himself in several student activities, like the cheerleading team, swimming team and drama club. He was also on the editorial board of the Lampoon and The Harvard Monthly, as well as the president of Harvard Glee Club. In his senior year, Reed was made the Ivy orator and poet. Reed graduated in 1910 and went to visit England, France, and Spain.\n\nBeginning Of Career\n\nUpon returning to the United States, John Silas Reed set out to become a journalist. He went to live in New York and used his Harvard connection with Lincoln Steffens, who helped him get an entry-level position in The American Magazine. He began working there reading manuscripts, proofreading and helping with the composition. Additionally, Reed also worked as business manager on the magazine Landscape Architecture. During this time, Reed lived in Greenwich Village and wanted to establish himself as a freelance journalist. He wrote essays and short stories about his time in Europe and was eventually accepted by The Saturday Evening Post. Subsequently, his work was accepted by Collier’s, The Forum and The Century Magazine.\n\nJohn Silas Reed began to become increasingly interested in social problems, and in 1913 he joined the newspaper The Masses. Reed wrote more than 50 articles and reviews for the publication. The same year, Reed attempted to speak on behalf of the strikers in New Jersey silk mills and was arrested. He allied himself with the trade union Industrial Workers of the World and put on The Pageant of the Paterson Strike in Madison Square Garden, to raise money for the strikers. Later that year, Reed was sent to Mexico to report on the Mexican Revolution for the Metropolitan Magazine. His articles about the problem established Reed as a war correspondent.\n\nadvertisement advertisement\n\n\n\n\n\n\n\nWar Correspondent\n\nIn 1914, when Germany declared war on France, John Silas Reed was sent by the Metropolitan magazine to Italy. In Naples, he met his Mabel Dodge, and the couple made their way to Paris together. His article “The Traders’ War” was published in the September issue of The Masses. Reed had trouble accessing the front in France, and he became increasingly frustrated by the wartime censorship. He and Dodge went to London together, but then she decided to leave for New York to his relief. He spent most of the 1914 drinking and pursuing various affairs. Reed later went to Berlin and met with Karl Liebknecht, a German socialist who voted against the war credits.\n\nAt the end of 1914, John Silas Reed returned to New York and began writing about the war. In mid-1915, Reed once again traveled to Europe together with the Canadian artist Boardman Robinson. They encountered the devastation in Serbia, Bulgaria, and Romania. Reed and Robinson also traveled to Russia, where they were arrested since the Russian ambassador considered them to be spies. They were also arrested upon trying to slip in Romania. All these experiences later became Reed’s book The War in Eastern Europe. In 1916, Reed met Louise Bryant and married her at the end of the year. He also underwent a kidney removal operation and published Tamburlaine and Other Poems. The United States were getting closer towards war, and Reed's views led to ending his relationship with the Metropolitan. He wrote several aggressive articles for The Masses, expressing his views against the war. The United States Postal Service refused to mail the magazine.\n\nadvertisement advertisement\n\nRussian Revolution\n\nIn 1917, John Silas Reed and his wife went to Europe to work as journalist and report on the developments of the political situation in Russia. They found out that Russian economy was devastated and that Ukraine and Finland were seeking to forge a military union with Germany. Reed and Bryant were at the ground zero of the October Revolution, where Vladimir Lenin and his Russian Social-Democratic Labor Party took over the government and struck the worldwide socialist revolution. During this time there was a shortage of food, and crime rates increased.\n\nJohn Silas Reed was an active supporter of the socialist government revolution and began working for the People’s Commissariat for Foreign Affairs. He was close to the new Russian leadership and met Leon Trotsky, who introduced him to Lenin. Reed published the book 10 Days That Shook the World in 1919 about the events in Russia.\n\nadvertisement advertisement\n\nPolitical Activism\n\nWhen John Silas Reed returned to America, he and Bryant began defending the Bolshevik government and opposed American intervention in the affair. Reed organized a gathering of 1000 people in Philadelphia and was arrested for inciting a riot. He began to become more and more political, aggressive and destructive. In September 1918, he organized a demonstration in the Bronx to defend the Russian revolution.\n\nIn 1919, Bryant went before the Senate committee for exploring Bolshevik propaganda, and John Silas Reed was also shortly after questioned. He also stood a trial in Philadelphia for his pro-Bolshevik speeches but was acquitted after convincing the jury that the case was about free speech. He began serving as the editor for The New York Communist. Reed also joined the Communist Labor Party of America.\n\nadvertisement advertisement\n\nLater Actions\n\nIn 1919, John Silas Reed fled America since he was indicted for sedition. He went to Sweden, then Finland and finally arrived in Moscow by train. He tried to return to the United States in 1920 in a coal bunker on a ship but was discovered and take into custody. He was beaten severely, but never gave up the names of his local contacts. Therefore he was not tried for treason. Reed had to pay a fine for smuggling jewels, but he was still detained. His physical and mental health deteriorated rapidly. Reed was finally released in June and traveled to Petrograd.\n\nJohn Silas Reed further traveled to Moscow and attended the Communist International Congress. He was ordered by Grigory Zinoviev to attend the Congress of the Peoples of the East in Baku. The journey on the official train was five days long and went through the devastated countryside. In Baku, he learned that Bryant had arrived in Moscow and went to see her, but during his trip home he fell ill with typhus. He died in Moscow on October 17, 1920."}, {"url": "https://www.wsws.org/en/articles/2020/12/03/reed-d03.html", "page_content": "Mid-October marked the 100th anniversary of the untimely death of American revolutionary socialist journalist John Reed. The author of Ten Days That Shook the World, a magnificent firsthand account of the Russian Revolution, Reed died in Moscow of typhus on October 17, 1920, five days shy of his 33rd birthday.\n\nAbout Ten Days That Shook the World, V.I. Lenin, the co-leader of the 1917 October Revolution, commented in an introduction written in 1919, “Unreservedly do I recommend it [Reed’s book] to the workers of the world. Here is a book which I should like to see published in millions of copies and translated into all languages.” The book has had a special place in the hearts and minds of class-conscious workers ever since its appearance. It can still be recommended “unreservedly.”\n\nMany people may be familiar with the name of John “Jack” Reed from the 1981 movie Reds, in which Warren Beatty portrayed the intrepid and principled journalist and for which Beatty won the Academy Award for best director.\n\nWhat the film cannot convey, among other things, however, is the vital, muscular and poetic quality that made Reed’s writing so influential in his time and to later generations. Reds only hints at the full complexity of the man who, more than any American writer of his generation, followed the demands of his political conscience to their revolutionary conclusions.\n\nJohn Reed was born in Portland, Oregon on October 22, 1887 into an upper-middle-class family. His mother’s father, Henry Dodge Green, was a wealthy Portland industrialist and his house a center of Portland’s genteel social gatherings.\n\nReed came of age during the era of the full-blown development of American capitalism. In the 30 years following the Civil War, the US emerged as a modern industrial power. The decades saw the enrichment of the infamous Robber Barons, and the US launched its first imperialist war in 1898, seizing the Philippines and Cuba from Spain.\n\nThe urban population swelled in this period, also a time of large-scale immigration, and the working class emerged as a powerful force, expressing—in a series of bitter strike struggles—its determination to fight the omnivorous ruling class.\n\nReed’s father, C.J. Reed, was a crusader against political corruption in Oregon, helping to take on the logging interests in his capacity as a U.S. marshal. Not having gone to college himself, C.J. was determined that Jack should attend Harvard, interceding for his son when he failed his entrance exam. Jack passed the second time. Working on and contributing to several Harvard publications, Reed honed his journalistic and editing skills. He also wrote and published a good deal of poetry and became a member of the newly formed Harvard Socialist Club.\n\nEstablishing himself in Greenwich Village in 1911, Reed was at the center of the neighborhood’s bohemian culture. The Village was home to such figures as poet Hart Crane, “scandalous” novelist Henry Miller (who, not long before his death, describes Reed’s milieu in Reds) and dramatist Eugene O’Neill.\n\nIt was here, as a working writer and an editor at The American Magazine (founded in 1906), that Reed grappled with the challenge of earning a living under conditions where serious art does not pay the rent. For Reed, “serious art” still meant his poetry, which does not make much of an impression after more than a century, and also supplementing his income from The American by selling short stories, which, in some cases genially give a flavor of life at that time.\n\nAs Reed came to know Manhattan, however, its palaces and its squalor, he came to realize that something was fundamentally wrong with American society. In a later essay written in the months before his journey to Russia that would result in his witnessing the October Revolution, titled “Almost Thirty,” he would recall the political awakening of his early twenties:\n\nOn the whole, ideas alone didn’t mean much to me. I had to see. In my rambles about the city I couldn’t help but observe the ugliness of poverty and all its train of evil, the cruel inequality between rich people who had too many motor cars and poor people who didn’t have enough to eat. It didn’t come to me from books that the workers produced all the wealth of the world, which went to those who did not earn it.\n\nHearing of a new arts and features magazine with a decidedly socialist orientation, called The Masses (founded in 1911), Reed quickly introduced himself to its editor Max Eastman, who would later translate many of Leon Trotsky’s works into English, and climbed on board as both an editor and contributor.\n\nThough the new magazine could not pay him, Reed would find his work for this important publication his most fulfilling. The Masses was to publish the first stories of Sherwood Anderson in 1916, later to be collected in the groundbreaking Winesburg, Ohio. It published works by figures such as Jack London, the novelist Floyd Dell, and the poets Carl Sandburg and Amy Lowell. Painters John Sloan, George Bellows and Pablo Picasso contributed illustrations.\n\nBy 1913, Reed would prove a more than receptive audience member when—in a Greenwich Village apartment—he met William “Big Bill” Haywood, leader of the Industrial Workers of the World (IWW), the left-wing syndicalist movement. Reed listened as Haywood described the developing situation in nearby Paterson, New Jersey, where silk workers were on strike and being beaten and jailed by police. Reed, perhaps for the first time, reacted to a major story not only as a journalist but as a partisan, determined to publicize the strike and help the workers.\n\nSoon after arriving in Paterson, a naturally defiant Reed goaded a belligerent police officer into arresting him. In the county jail, overcrowded with immigrant strikers, he befriended the workers—“gentle, alert, brave men, ennobled by something greater than themselves”—and drew out their stories. That “something greater,” the class struggle, can be seen at work in the article Reed wrote for The Masses (“War in Paterson”), which opens:\n\nThere’s war in Paterson, New Jersey. But it’s a curious kind of war. All the violence is the work of one side—the mill owners. Their servants, the police, club unresisting men and women and ride down law-abiding crowds on horseback. Their paid mercenaries, armed detectives shoot and kill innocent people. Their newspapers ... publish incendiary and crime-inciting appeals to mob violence against the strike leaders ... They control absolutely the police, the press, the courts.\n\nSo moved was Reed by the condition of the silk workers that he organized a dramatic pageant, held at Madison Square Garden, in which the actual workers demonstrated their onerous work and their treatment as strikers at the hands of the police.\n\nReed’s best known work is Ten Days That Shook the World (1919), but he did produce other outstanding works of reportage, one of which is his account of his experiences riding with Pancho Villa’s army in the Mexican Revolution, titled Insurgent Mexico (1914). The compelling work immerses the reader in the harsh, violent life of La Tropa, Villa’s army, and its camp followers.\n\nAs was the case in Paterson, Reed not only sympathized politically with the peasant revolutionaries but came quickly to admire them and want their respect, which he was proud to earn. At one point in Insurgent Mexico, he writes of an initiation into La Tropa over a bottle of sotol:\n\n“Drink it,” yelled the chorus as the Tropa crowded up to see. I drank it. A howl of laughter and applause went up. Fernando leaned over and gripped my hand. “Good for you, companero!” he bellowed, rolling with mirth ... Captain Fernando leaned over and patted my arm. “Now you are with the men (los hombres.) When we win the Revolucion it will be a government by the men,—not by the rich. We are riding over the lands of the men. They used to belong to the rich, but now they belong to me and to the compañeros.”\n\nThe material Reed sent back to the US, published in The Metropolitan magazine, established him as America’s foremost war correspondent. The writing was at once impressionistic and clear-eyed, imagistic and frank.\n\nCertainly, no more stark instance of brutal oppression could have presented itself to Reed or the world than the Ludlow Massacre of April, 1914, the culminating atrocity of the protracted southern Colorado coal miners’ strike of the winter of 1913-14. Reading of the massacre, Reed immediately left for Las Animas County.\n\nThere he made a detailed search of the scene of the massacre, in which National Guard militiamen rented by John D. Rockefeller’s Colorado Fuel and Iron Company killed an estimated 26 miners, their wives and children, some shot with machine guns and some deliberately burned to death in tents the miners had been living in during the strike.\n\nReed wrote a lengthy, scathing article for The Metropolitan, “The Colorado War,” in July 1914, which detailed the murderous violence of the Rockefeller interests. “I got into Trinidad [Colorado, 15 miles from Ludlow] about ten days after the massacre at Ludlow,” Reed wrote. Later in the article, he explained:\n\nI went to Ludlow next day to see the Federal troops come in and the militia leave. The tent colony, or where the tent colony had been, was a great square of ghastly ruins. Stoves, pots and pans still half full of food that had been cooking that terrible morning, baby-carriages, piles of half-burned clothes, children’s toys all riddled with bullets, the scorched mouths of the tent cellars, and the children’s toys that we found at the bottom of the “death hole”—this was all that remained of the entire worldly possessions of 1,200 poor people. At the railroad station about fifty militiamen waited for the train—boys with the stupid, vicious faces of saloon-corner loafers. Only a few were in uniform, for many of them were mine-guards hastily mustered in. As the regulars left their train one militiaman said loudly, in the hearing of the militia officers: “I hope these red-necks kill a regular so they will go in and wipe out the whole bunch. We certainly done a good job on that tent colony.”\n\nIn August of that year, the world was struck by the greatest upheaval to that point in modern times. The First World War broke out in Europe. Reed sailed to Italy as a correspondent for The Metropolitan. He went to France, where he attempted twice to reach the front but was arrested and turned back both times. He then went to London, where he wrote a long article on England in wartime, showing that patriotism was limited to the upper classes. The Metropolitan rejected the article.\n\nIn “The Traders War,” written from London and published in The Masses in September, Reed outlined the history of the imperialist commercial rivalries between Britain, France and Germany and stated that the war was nothing more than a continuation of these conflicts. (In a noteworthy scene in Reds, Reed [Beatty], asked at a meeting of the Liberal Club in Portland, Oregon what he thinks “this war is about,” gets to his feet and replies with one word, “Profits.”)\n\nReed returned to France and in December made his way to Germany via Switzerland. In Berlin, he was able to conduct an interview with the revolutionary socialist Karl Liebknecht, who alone in the German Reichstag had refused to vote to fund the war. When Reed asked him about “the chances of World Revolution,” “‘To my mind’ [Liebknecht] responded serenely, ‘nothing else can come out of this war.’”\n\nReed and other American correspondents were able, after long delays, to secure permission to visit the German front in Northern France. Along the way they were feted by German officers and saw the horrors of trench warfare. He wrote articles on these experiences for The Metropolitan and returned to the US in January 1915.\n\nReed only stayed home a few months. By March, since he was unable to get permission to visit France again, The Metropolitan asked him to report on the war in Eastern Europe. With the artist Boardman Robinson, he visited Serbia, Romania, Bulgaria and Russia.\n\nAlmost half the articles he wrote, although Reed could not know this at the time, were about the final days of the tsarist empire with its drunkenness, abuse, and corruption organized into armies. In one article, “An Optimistic Pilgrimage” that still moves the reader 105 years later, Reed passes through a Jewish village near Rovno in what is now Ukraine, and observes the filth and poverty of the Jews and their oppression by the Russians. One of his guides, a Russian army officer, complains that all Jews are traitors to Russia.\n\nThe scenes from Serbia are shocking. The first country to be invaded by the Austro-Hungarian Empire in response to the assassination of its Archduke Ferdinand in 1914, Serbia was in the middle of a typhus epidemic. Reed visited one hospital for those stricken with disease:\n\nWe entered a barrack, along whose walls cots lay touching each other, and with the feeble light of two lanterns we could see the patients writhing in their dirty blankets, five and six crowded into two beds. Some sat up, apathetically eating; others lay like the dead; still others gave short, grunting moans, or shouted suddenly in the grip of delirium.\n\nWhen Reed returned from Europe in late 1915, the official political atmosphere in the US had shifted to the right: a pro-war “preparedness” campaign was underway and middle-class public opinion had become anti-German. He moved back to Greenwich Village with the woman he would marry, also from Oregon, journalist Louise Bryant. It was at this time he befriended Eugene O’Neill. Reed, O’Neill, Bryant and some of their circle wrote and performed plays in Provincetown, Massachusetts in the summer of 1916.\n\nThe Metropolitan refused to return him to Europe because of his antiwar views. But in the spring of 1917, two more world-shaking events occurred. In March, the Russian tsar, Nicholas II, was overthrown, and in April the United States entered the world war.\n\nThroughout the spring and summer of 1917, Reed wrote antiwar articles for The Masses. By August, he had decided he had to see the revolution in Russia for himself. Reed arrived in Petrograd on September 13, just after the attempted coup against the bourgeois Provisional Government by tsarist General Lavr Kornilov. The coup melted away largely because of the Bolsheviks’ mobilization of workers and soldiers.\n\nThrough connections in New York, including Bolsheviks such as V. Volodarsky, Reed became acquainted with that party’s leaders, who were now preparing the overthrow of the Provisional Government and its replacement by a government of Soviets.\n\nHe hastened from place to place in Petrograd, saving leaflets and proclamations and documenting the positions of each party. He interviewed leaders of the frightened capitalist parties, and he saw Lenin and Trotsky give speeches to thousands of workers. Reed himself spoke to countless other Bolshevik leaders, workers, soldiers and sailors, as they applied themselves to the historical task of establishing a government of the working class. He was a witness to the Bolshevik seizure of power and was present at the famous storming of the Winter Palace, as well as the struggle afterwards by the new Soviet government against counterrevolution.\n\nFor the remainder of the year Reed remained in the new Soviet Russia. He worked for the People’s Commissariat of Foreign Affairs and was briefly appointed consul to the US. In early 1918, he had his first long discussions with Lenin and Trotsky. He left for home soon after, but was detained in Finland until April by the nationalist government.\n\nOn his return to New York, he was met on the dock by government agents who seized his papers and summoned him to court the next day. Reed was indicted under the Espionage Act for a 1917 article, published in The Masses, “Knit a strait-jacket for your soldier boy,” which describes what we now call post-traumatic stress disorder.\n\nReed took up the task of defending the revolution to an American audience in such articles as “Soviets in Action” and “The Structure of the Soviet State” published in T he Liberator (the successor to The Masses), in the autumn of 1918.\n\nIt was at this time that be took up a fight for the ideas of Bolshevism in the left wing of the American Socialist Party, along with Louis Fraina and other supporters of the Russian Revolution in the journal The Revolutionary Age. His papers from Russia were returned to him, and he worked feverishly on his description of the events he had lived through in October-November 1917. Eastman later reported that Reed wrote the book in a remarkably short period of time, sequestered in a room in Greenwich Village, seeing no one and coming out only for meals.\n\nIn March 1919, the product of this effort, Ten Days That Shook the World, was published. It was the peak of Reed’s development as a journalist. He combined his own observations and conversations with the scrupulous publication of the documents of the revolution itself he had collected.\n\nHere is how Reed describes the Bolshevik headquarters, the Smolny Institute, a former upper-class girls school in tsarist times (only eight months previously!) on the day of the insurrection, November 7:\n\nThe massive facade of Smolny blazed with lights as we drove up, and from every street converged upon it streams of hurrying shapes dim in the gloom. Automobiles and motorcycles came and went; an enormous elephant-colored armored automobile, with two red flags flying from the turret, lumbered out with screaming siren. It was cold, and at the outer gate the Red Guards had built themselves a bonfire. At the inner gate, too, there was a blaze, by the light of which the sentries slowly spelled out our passes and looked us up and down. … A crowd came pouring down the staircase, workers in black blouses and round black fur hats, many of them with guns slung over their shoulders, soldiers in rough dirt-colored coats and grey fur shapkas [hats] pinched flat.\n\nOn this occasion Reed encounters the Bolshevik leader Lev Kamenev. Kamenev reads out to him, translating from Russian into French, effectively the first proclamation, just passed in session, of the new Soviet government: “The new Workers’ and Peasants’ Government will propose immediately a just and democratic peace to all the belligerent countries … The Soviet is convinced that the proletariat of the countries of Western Europe will aid us in conducting the cause of Socialism to a real and lasting victory.”\n\nAnd Reed’s description of Lenin stands out:\n\nDressed in shabby clothes, his trousers much too long for him. Unimpressive, to be the idol of a mob, loved and revered as perhaps few leaders in history have been. A strange popular leader—a leader purely by virtue of intellect: colorless, humorless, uncompromising and detached, without picturesque idiosyncrasies—with the power of explaining profound ideas in simple terms, of analyzing a concrete situation. And combined with shrewdness, the greatest intellectual audacity.\n\n(An insightful description, aside from the characterization of Lenin as “colorless” and “humorless,” which was anything but the case!)\n\nTen Days That Shook the World is one of the artistic achievements not only of the Russian Revolution, but of American and world literature. The fact that it inspired another great work, Soviet filmmaker Sergei Eisenstein’s October (1928), gives it a unique place in human culture.\n\nReed discovered the drama of the revolution in its own action, in the rapid and intense response of classes to one other in the pursuit of their social goals, expressed not only by force of arms, but by the most profound political thought. He was able to translate this into narrative and description.\n\nTen Days That Shook the World was the first time the revolution spoke in its full eloquence to the world. Lenin in his famous preface to the book, noted above, commented: “With the greatest interest and with never slackening attention I read John Reed’s book, Ten Days That Shook the World. … It gives a truthful and most vivid exposition of the events so significant to the comprehension of what really is the Proletarian Revolution and the Dictatorship of the Proletariat. These problems are widely discussed, but before one can accept or reject these ideas, he must understand the full significance of his decision. John Reed’s book will undoubtedly help to clear this question, which is the fundamental problem of the international labor movement.”\n\nIn the summer of 1919, Reed helped to launch the Communist Labor Party (one of the forerunners of the Communist Party, founded in May 1921), as it split from the opportunist Socialist Party. In October he left again for Soviet Russia and participated as an American delegate to the Second Congress of the Communist International, held from July 19 to August 7, 1920. Following that, Reed attended the Congress of the Peoples of the East in Baku in Soviet Azerbaijan, an assembly of 1,900 delegates from across Asia and Europe organized by the Communist International, which opened September 1.\n\nFrench leftist Alfred Rosmer, in Moscow Under Lenin, has a well-known description of Reed speaking at the Congress in Baku, a city famous for its petroleum industry. Rosmer noted that Reed, who had learned a few words of Russian, “was a great success. He shouted a question to his audience: ‘Don’t you know how Baku is pronounced in American? It’s pronounced oil!’ The solemn faces were suddenly shaken with laughter.”\n\nReed returned to Moscow on September 15, fell sick with typhus and died on October 17. It is said that he might have survived if the American government had not had an embargo on medications to Soviet Russia.\n\nRosmer explained in his book that when he and others returned from Moscow, “a sad piece of news greeted us. John Reed, who had returned in advance of us, was in hospital, ill with typhus. No effort was spared to save him, but it was all in vain and a few days later he died. His body was displayed in the great hall of the House of Trade Unions. On the day of the funeral, winter had already arrived and snow was falling. We were overwhelmed.”\n\nRosmer continued, “A burial place was found for him in the Kremlin wall, in the section reserved for heroes who had fallen in the revolutionary battle. The words of farewell were spoken by [Nikolai] Bukharin, for the central committee of the Communist Party, by [Alexandra] Kollontai, and by his comrades from the Executive Committee. Louise Bryant, who had arrived only to see him die, was there, completely shattered by grief. The whole scene was indescribably sad.”\n\nReed’s reputation after his death has been closely tied to the fate of the Russian Revolution. The Stalinist regime that usurped the Soviet state in the next decade could not abide the truth about the revolution, and Trotsky’s role in October 1917, as Reed had depicted it. Stalin is mentioned only in passing because he played virtually no role in the seizure of power. The work was banned, at Stalin’s insistence, in the Soviet Union for decades.\n\nEqually, anticommunist commentators in Europe and America have sought to make Ten Days That Shook the World into a mere literary accomplishment. Some have alleged, falsely, that after disagreements over Communist tactics in 1920, Reed became disillusioned with Marxism.\n\nDespite the Stalinist and anticommunist treatment of Reed and his work, for millions of workers and young people Ten Days That Shook the World remains an indispensable introduction to the most momentous event in world history. In a time when the question of socialist revolution has been placed before millions and millions, a new generation must discover his work.\n\nTen Days That Shook the World is currently on sale at Mehring Books for $14.40."}]}