{"John Reed Jr. attended Harvard University in Cambridge, Massachusetts.": [{"url": "https://www.thecrimson.com/article/2016/3/31/john-reed-scrut/", "page_content": "John S. Reed, class of 1910, was in it for the money.\n\n“I recall his telling me that he had two ambitions when he came to college,” a classmate of Reed’s said in the Academy Award-winning 1981 biopic “Reds.” “One was to be elected president of his class. He didn’t know anyone in his class. No one knew him. The other was to make a million dollars by the time he was 25.”\n\nThat would change. By Reed’s senior year of college, he would reject the narrow-minded Harvard aristocracy. He would take over club meetings and ruin dinner parties, overflowing with passionate rants about equality and the worker. Consumed with radicalism, he would dedicate his college career to sparking “an influx of discontent, of revolutionary ideas, of criticism and revolt.”\n\nLess than 10 years after that, Reed would become one of the most prominent American communist leaders and writers of the early 20th century. In fact, he spent the decade after college in a propaganda-writing, labor-organizing, revolution-inciting frenzy. In 1913, he rode with Pancho Villa’s army, reporting on the Mexican Revolution. In 1917 he travelled to the USSR as an independent journalist, joining Lenin in the October Revolution. In 1919 he helped form the Communist Labor Party of America, serving as its international delegate.\n\nBy that time, John Reed had become a household name. His account of the Russian Revolution, “Ten Days that Shook the World”, was being taught in schools across the USSR. Those who had known him praised him as “the pulse of the young lion,” mourned him as “a Soviet Russian hero,” and pitied him as a victim of “the damned Bolsheviki.” When he died of typhus on Oct. 17, 1920, his body was buried in the Kremlin.\n\nReed wasn’t born a socialist, though. In fact, he was born into a typical upper middle-class family in Portland, Oregon on Oct. 22, 1887. Though he would eventually grow into a tall, broad-shouldered athlete—hazel eyes intense even in laughter—as a child he was sickly and bullied by his peers.\n\n\n\n\n\n“I wasn’t much good at the things other boys were, and their codes of honor and conduct didn’t hold me. They felt it too, and had a sort of good-natured contempt,” Reed recalled in his memoir, “Almost Thirty.” “One time, when I was on the editorial board of the school paper, a boy I was afraid of warned me not to publish a joking paragraph I had written about him—and I didn’t…” From a young age, Reed wanted nothing more than acceptance.\n\nBefore Reed was a fearless revolutionary, he was a lonely Harvard student. Before he wrote satire for “The Masses,” he wrote plays for the Hasty Pudding. Before he aspired to the Executive Committee of the Comintern, he tried to get punched by the Porcellian.\n\nBefore Reed denounced the aristocracy, he desperately wanted to join it.\n\nAdvertisement\n\nRich Men's Sons\n\nJohn Reed was not born into the proletariat. He spent his earliest years mixing with Portland high society in his wealthy grandmother’s home, which he later described as “... a lordly grey mansion modelled on a French chateau, with its immense park, its formal gardens, lawns, stables, green-houses and glass grape-arbor, the tame deer among the trees…” His grandfather, Henry D. Green, had founded the Portland Gas-light Company, and purchased the estate in 1873 for $28,000 (equivalent to about half a million dollars today).\n\nThat prosperity was short-lived: Reed’s grandmother had expensive taste and a love of travel, and after her husband’s death she quickly spent the majority of the family fortune. Reed’s financial situation became even more precarious after a severe economic depression shook the United States in 1893. When Reed was only nine years old, his parents moved from the Green mansion to an apartment downtown. A few years later, Reed’s father became embroiled in a political scandal that provoked the ire of the Portland aristocracy—the final nail in the Reed family’s social coffin.\n\nStill, Reed attended some of the most expensive schools on the East Coast. At 16, he left Portland for a New Jersey boarding school, and in the fall of 1906 he enrolled at Harvard College. A few years later, his brother, Harry, followed. This prestigious education came at both a financial and an emotional cost: as Reed reminisced a decade later, “We never knew until later how much our mother and father denied themselves that we might go, and how [my father] poured out his life that we might live like rich men’s sons.”\n\nReed might have been able to afford the cost of tuition, but he could not hide his Western, middle-class roots: Harvard had an excellent nose for those masquerading as “rich men’s sons.”\n\nWilliam James described students like Reed in his 1903 essay “The True Harvard.” Those who arrived “from the remotest outskirts of our country, without introductions, without school affiliations,” had no place in Harvard’s social spaces, he said. “They seldom or never darken the doors of the Pudding or the Porcellian.”\n\nAs John M. Brown ’23 wrote in the Harvard Alumni Bulletin, the Harvard of 1906 was a place of “poor boys and rich boys; those favored because they were Brahmin-born and others penalized because they were not.” Most of Reed’s new peers had attended elite East Coast prep schools, and considered “new money”—or, worse, no money—beneath them. A boisterous nobody from Portland hardly stood a chance.\n\nThis never deterred Reed. A childhood on the (relative) social margins had conditioned him to value popularity, and a natural competitive instinct drove him to compete for it. He developed a fascination with Harvard’s aristocracy, and when he arrived on campus in the fall of 1906 he sought to join it.\n\n“A furious energy drove me to all kinds of bodily and mental exercise, without any particular direction,” he wrote in his memoir. “I was increasingly active and restless, more ambitious of place and power, less exalted, scattering myself in a hundred different directions…” He wanted to be a poet. He wanted to be a novelist. He wanted to be a lover, and a fighter, and a rebel. More than anything else, he wanted to be accepted.\n\n“During my freshman year I used to pray to be liked, to have friends, to be popular with the crowd,” Reed wrote.\n\nAdvertisement\n\nThe Waiting Game\n\nTo a lonely Harvard freshman at the turn of the twentieth century, popularity meant joining a Final Club.\n\nThe punch process began with admission to the Institute of 1770, an exclusive social organization which selected 100 men from the sophomore class each year and named them “the socially elect.” Becoming a member of the Institute meant prestige; it meant status; most of all, it meant eligibility for the next tier of exclusive social organizations, the Waiting Clubs. After election to a Waiting Club, juniors and seniors were eligible for an invitation to a Final Club—the apex of the whole system, and the playground of Harvard’s elite.\n\n“To the ordinary freshman before whose eyes the plum of the Institute is dangled,” Reed wrote, “a Final Club seems the end of earthly ambitions.”\n\nIt all hinged on the Institute. For Reed, though, getting in was easier said than done. When the Class of 1910 entered Harvard, it had nearly 700 members. The Institute would select only 100. Reed’s odds were bad from the start.\n\nIn search of a niche, Reed tried to join the freshman crew team. He committed a significant portion of his freshman year to the task, even staying on campus during holidays to row by himself, but he was the last rower eliminated before the end-of-year Harvard-Yale crew regatta and never technically made the team.\n\nReed’s initial forays into the arts community ended similarly fruitlessly. Though he’d later write books and articles hailed by nations, by the end of his freshman year he hadn’t been granted entry to a single campus publication.\n\n“I got to know many fellows to nod to, and a very few intimately; but most of my friends were whirled off and up into prominence, and came to see me no more,” he reminisced in “Almost Thirty,” “Athletes and musicians and writers and statesmen were emerging from the ranks of the class. The Freshman clubs were forming. And I was out of it all.”\n\nReed was never invited to join the Institute of 1770. He never joined a Waiting Club, he never joined a Final Club, and he never really reached the upper echelons he’d aspired to as a freshman.\n\nThis exclusion was partially the product of class. Reed hadn’t been born into the eastern elite, and the eastern elite knew it.\n\nAdvertisement\n\nReed knew it, too. When he was rejected sophomore year for two posts for which he felt he “qualified easily”—an editorial position at The Harvard Crimson and the assistant managership of the Varsity Crew team—he chalked it up to snobbery and walked away bitter.\n\nIt wasn’t only Reed’s class, though: When Reed’s brother arrived to Harvard two years later, he was invited to join the same organizations that had overlooked his older sibling. The snub was also personal.\n\n“There is a clue to his lack of acceptance, his lack of the quality the British call ‘clubable,’” wrote his classmate, Edward E. Hunt, class of 1910. “Through everything he did there ran a strand of the grotesque which turned the most serious event into laughter.”\n\nRegardless of its cause, Reed took rejection hard. “The thought that he could be considered inferior, unworthy of their attention no matter what he did, came as a numbing shock to him,” wrote Richard O’Connor in his biography of Reed, “The Lost Revolutionary.”\n\nThe Athlete, the Scholar, and the Activities Man\n\nBy sophomore year, Reed recalibrated. Rejected by the elites and no longer willing to measure personal success by class or wealth, he found a new strategy for social acceptance: joining as many extracurricular activities as possible. As he saw it, the class was divided into three neat groups: the athlete, the scholar, and the “activities man.” Reed knew which he wanted to join.\n\nReed speaks to several supporters. In \"One of Us: The Story of John Reed in Lithographs.\" By Courtesy of the Harvard Archives at Pusey Library\n\nIn Reed’s model, athletes represented the pinnacle of the social hierarchy. “The average undergraduate would rather win his “H” than get Phi Beta Kappa,” he wrote in an essay. He wasn’t wrong: by 1907-08, Reed’s sophomore year, campus athletics had become such a dominant social force that President Eliot became concerned that sports were exhausting players, keeping fans from their studies, and encouraging “the betting evil.”\n\nDespite his initial setbacks on the river, Reed enjoyed moderate athletic success on the field and in the pool. He was a member of the swimming team, captain of the water polo team, and song-leader of the cheerleading squad.\n\nA former classmate, the Pulitzer prize-winning left-wing journalist Walter Lippmann, class of 1910, remembered Reed as the star of the cheerleading squad. “He would stand up alone before a few thousand undergraduates and demonstrate without a quiver of self-consciousness just how a cheer should be given,” Lippmann wrote in the New Republic in 1914. “If he didn’t like the way his instructions were followed he cursed at the crowd, bullied it, sneered at it. It was a sensational triumph for [John] Reed but wasn’t altogether good form at college.”\n\nIn the Russian Revolution, the ability to rouse a crowd would serve him well.\n\nAdvertisement\n\nStill, Reed saw the athlete’s position in the campus hierarchy as that of an empty figurehead with no real power. He thought that the student that embodied Harvard’s most traditional values was really “the scholar:” “He is studying what the great Harvard men of the past have studied—he is really seeking what Harvard has stood for for three hundred years—Veritas.”\n\nReed himself barely scraped past Harvard’s entrance exams, and he left an undergraduate record dotted with C’s, D’s, and E’s (modern F’s). A self-confessed “indifferent student,” he found the classroom dry and lifeless. “Why should I have been interested in the stupid education of our time?” he asked. “We take young soaring imaginations, consumed with curiosity about the life they see all around, and feed them with dead technique.” He wrote a number of his essays on club or scrap stationary, perhaps as a deliberate snub.\n\nThough Reed respected Harvard’s undergraduate scholars, he never wanted to befriend or become one. “Long lack of comradeship with any but those of his kind have made him intolerant of frivolity, have dried in him the natural desires and exaltations of youth, and therefore he is misunderstood and despised,” he wrote.\n\nThat left the “activities man.” Students active in extracurriculars had the social clout lacked by athletes and the social graces lacked by scholars. They embodied all the virtues a turn-of-the-20th-century ‘Harvard Man.’ “They are a community of enthusiasts, men of all trades,” he wrote. “They are dreamers and often poets. Their grades are often very poor mediocre and they subordinate college work to their “activities”.... They talk a great deal among themselves, exchanging ideas and thoughts, strengthening friendships and learning what real standards there are by which to judge a man.” The activities man was busy, plugged in, a member of all the clubs, an insider.\n\nBy the time of his graduation, Reed had joined so many extracurriculars that his class bio was longer than his (nonexistent) senior thesis. He managed the Glee Club; he joined the Debating Club; he was a member of such mysteriously named organizations as the Memorial Society, the Round Table, the Symposium, and the Oracle. At various points, Reed was a member of some 16 organizations and teams—an impressive number even by Harvard’s contemporary standard.\n\nReed was the activities man.\n\nA Seat at the Table\n\nAmongst these many organizations were a few campus publications. Despite his failed start at the Crimson, Reed became an editor at the Harvard Monthly, a literary magazine where his poems and stories, “juvenile and imitative though they were, won respect and praise and inspired enthusiastic prophecies,” according to Granville Hicks ’23. He was also a writer and “Ibis”—second-in-command—at the Lampoon.\n\nJohn Reed is seized by policemen. \"One of Us: The Story of John Reed in Lithographs. Lithographs by Lynd Ward\" published by Equinox Press Inc., Pusey Library, Harvard University. By Courtesy of the Harvard Archives at Pusey Library\n\nReed was a leader as well as a writer. He had a gift for organizing people and executing visions—and he had no shortage of ideas.\n\nStill struggling to reconcile his Portland upbringing with his Cambridge education, he became president of the Western Club. A casual eating club created to defy Harvard’s puritanical social norms, the organization became known for mischief and outrageous practical jokes. As President, Reed sat at the head of every table and introduced diners in increasingly ludicrous ways.\n\nAdvertisement\n\n“Gentlemen, the future President of the United States!” he cried when Lippmann joined him one evening.\n\n“Where have you bean?” he shouted at another friend, throwing a handful of beans.\n\nReed didn’t confine his antics to the Western Club. As Hicks reported, over the spring break of his junior year, a debacle involving a series of bars, “a resort of dubious reputation,” and a spontaneous trip to Bermuda resulted in Reed’s “rustication”—an archaic punishment based on exile to Concord, Mass. Reed spent the rest of the semester in time-out.\n\nWhen not in Concord, Reed served as President of the Cosmopolitan Club. Founded by Reed on Feb. 12, 1908, the club united Harvard’s international students, entertained foreign dignitaries, and discussed world affairs. It was wildly successful: 53 students joined at its inception, and by Reed’s graduation in the spring of 1910 that number had grown to roughly 200.\n\nReed called it “one of the most important organizations ever formed among the students at Harvard.”\n\nThen again, Reed had a taste for hyperbole. It showed up in his rhetoric, marked his prose, and, in the fall of his junior year, inspired the creation of the Dramatic Club.\n\nThe club provided Harvard’s budding playwrights with a stage. The school offered few opportunities to produce original student theater, and students taking playwriting courses—including Reed and his two co-founders, Edward Sheldon and Hans V. Kaltenborn—chafed at the limitation. Rather than trying to convince an existing troupe to produce student work, they decided to make their own.\n\nThe Dramatic Club was novel for another reason: it became the first theater group on campus to admit women to its ranks. The decision provoked controversy. Members felt that “if we expected to achieve any social distinction at Harvard with our newly organized club, we simply could not permit the participation of Radcliffe girls,” Kaltenborn recalled in his memoir, “Fifty Fabulous Years.” Eventually, these protests were eventually overlooked “in the interest of better drama,” and the Dramatic Club (antecedent of the contemporary Harvard-Radcliffe Dramatic Club) went co-ed.\n\nIt’s easy to see traces of Reed’s later persona in his early college activities. By junior year, Reed was already an iconoclast, defying social mores and laughing at Harvard authority. He was an idealist, uniting his peers and planning to bring labor justice to the world. He was a leader, screaming at crowds in stadiums and theaters and pitting himself against the status quo.\n\nBut while he’d turned his eyes from the elites and become the “activities man” he’d always wanted to be, he was still searching for his cause. “John Reed was not a fiery left-winger in those days,” wrote Kaltenborn. “He was a nonconformist.”\n\nAdvertisement\n\nSenior year, that changed.\n\nInfiltrating the Ranks\n\nIn his final year of college, Reed discovered the Harvard Socialist Club. Founded by two freshmen in 1908, the club’s stated goal was to use the study and spread of socialism to correct the “fundamentally imperfect” state of society. At inception, it had nine members.\n\nJohn Reed speaks to a crowd. In \"One of Us: The Story of John Reed in Lithographs. Lithographs by Lynd Ward\" published by Equinox Press Inc., Pusey Library, Harvard University. By Courtesy of the Harvard Archives at Pusey Library\n\nDespite its modest size, the Club pledged to permeate the college. As Reed put it, “They sat not in lofty contempt above the ignorant student body, but mingled with it, learning its sympathies and weakness, used its machinery...” While club members held frequent discussions of their own, often continuing hours after midnight, they attempted to recruit and effect change by infiltrating other campus organizations.\n\nThis turned out to be an effective strategy. After less than five years, the Socialist Club had between 30 and 50 members. Two years after Reed’s graduation, a senior named Gerard C. Henderson, class of 1912, told the Harvard Graduates’ Magazine that the club’s “...fringes merge imperceptibly into a half-dozen political clubs, some adherents of such leaders as Wilson and La Follette, and others more vaguely representative of insurgency and progressivism.”\n\nReed was never officially a member, but the club still radicalized him. “It made me, and many others, realize that there was something going on in the dull outside world more thrilling than college activities,” he wrote.\n\nReed’s newfound politics were first evident in his writing. Reed had been writing for the Lampoon for a few years already, but during his senior year his sketches gained a biting political edge they’d lacked before.\n\nIn one Lampoon editorial, Reed mocked Harvard’s old money and gave advice to young men seeking to boost their pedigrees. “Hyphens are of immense value—remember that anyone will always be glad to lend money to an Endicott-Sears-Cabot, a Wendell-Wendell, or a Trumbull-Peabody,” he wrote. “If a child is too late to corral a Back Bay Brahman for a progenitor, let him seize upon a self-made man who has made a good job of it. Money will finally land anyone among the Captains of Society.”\n\nThough Reed mocked them, the elite were beginning to notice him.\n\nIn the spring of Reed’s senior year, he was offered membership in the Hasty Pudding. The Pudding was one of the most exclusive social organizations on campus, made up almost entirely of members of Waiting and Final Clubs, and to Reed the invitation must have seemed like a baffling reversal on the part of the aristocracy. Certainly, he had distinguished himself in the years since he’d first been overlooked, but he was still the same brash Westerner he’d always been.\n\nAdvertisement\n\nIn truth, the Hasty Pudding didn’t have much of an option. It was nearly time for the club’s annual musical, and none of its existing members—who had been selected on the basis of social status—felt capable of writing lyrics. Reed was a necessary outside hire, and he knew it.\n\nThe Hasty Pudding put on an uncharacteristically subversive show that year.\n\n“Just insist that your aunt was a Cabot,\n\nAnd your grandmother’s real name was Weld.\n\nTry hard to make rudeness a habit,\n\nAnd be careful with whom you’re beheld.”\n\nRevolution in the Yard\n\nSuddenly, Reed was a “club man.” A critical one, certainly, but a club man all the same. And as much as he tried to suppress it, he found satisfaction in the title. That satisfaction became evident at the end of his senior year.\n\nJohn Reed sits in a prison cell. In \"One of Us: The Story of John Reed in Lithographs. Lithographs by Lynd Ward\" published by Equinox Press Inc., Pusey Library, Harvard University. By Courtesy of the Harvard Archives at Pusey Library\n\nIn 1910, Harvard’s rich lived in glamorous private apartments on Mt. Auburn Street; the poor lived in dorms in Harvard Yard. This dichotomy influenced more than sleeping arrangements: Residents of the Street controlled most aspects of undergraduate life, and overwhelmingly filled class offices at graduation. That year, Reed was their nominee for Ivy Orator.\n\nThen, the Yard revolted. In an explosion of resentment that had been brewing since freshman fall, the Yard refused to accept the Street’s nominations for class office. Residents of the Yard circulated petitions and submitted their own nominees instead.\n\nAdvertisement\n\nReed was stuck. He already considered himself a man of the people, but aligning himself with the Yard would undo all of his recent social progress. So he ran on behalf of the Street, and like almost every other Street candidate, he lost.\n\nThere had been a revolution, and he was on the wrong side.\n\nReed realized his mistake once it was already too late. Shortly after his graduation, he wrote a sweeping 73-page tract called “The Harvard Renaissance,” in which he describes the rise of socialism at the college. In that text, he calls the victory of the Yard “a vote of the unrepresented majority against its traditional leaders.” It is the story of the Marxist struggle in all but name.\n\nCollege was Reed’s first introduction to the vapid nature of the privileged class. “The more I met the college aristocrats, the more their cold cruel stupidity repelled me,” he wrote in his memoir. “I began to pity them for their lack of imagination, and the narrowness of their glittering lives—clubs, athletics, society.\n\n“College is like the world; outside there is the same class of people, dull and sated and blind.”\n\nThree years later, Reed spoke on behalf of silk workers in Paterson, N.J., earning himself his first jail term and a reputation as a radical communist. Frustrated but not deterred, he allied himself with the trade union International Workers of the World and organized thousands of workers into a strike benefit in Madison Square Garden. By the late 1910s, the American government feared him. The USSR hailed him as a genius and taught his name in schools.\n\nRichard M. Nixon didn’t call Harvard “the Kremlin on the Charles” for nothing. John Reed might have practiced socialism in New York City and St. Petersburg, but he learned it in the Yard.\n\nClub Man at Last\n\nReed’s life was prime martyr material, and Harvard’s later left-wingers ate it up—“John Reed Clubs” began popping up across the United States only shortly after the man’s death.\n\nHarvard had a branch, too. Calling itself a Marxist study and action group, the Harvard John Reed Society was founded in 1932 by “a group of undergraduates attracted by the personality of John Reed and interested in studying sciettific [sic] socialism, the cause for which he gave his life.” Though it was never widely popular, the club lingered for years. In 1943, it even published several issues of a magazine, The Harvard Vanguard.\n\nJohn Reed speaks to supporters. In \"One of Us: The Story of John Reed in Lithographs. Lithographs by Lynd Ward\" published by Equinox Press Inc., Pusey Library, Harvard University. By Courtesy of the Harvard Archives at Pusey Library\n\nAdvertisement\n\nReed’s mother did not approve. Charlotte J. Reed was always upset by John Reed Clubs—she found them exploitative.\n\nReed might have felt the same way. “In view of what has happened in Russia since the Revolution, I am certain that he would not have tolerated the use of his name as a means of ensnaring idealistic American youth into the Communist party,” Reed’s old friend and Dramatic Club co-founder Hans V. Kaltenborn, class of 1909, reflected in “Fifty Fabulous Years.” “That is what is being done at Harvard today. The John Reed Society has been little more than a cover for Communist party activities at Harvard since its inception.”\n\nIt wasn’t safe to join a club with such a reputation in McCarthy-era America. In 1950, the John Reed Society went underground.\n\nAccording to The Boston Herald, the club had applied for a meeting room in the spring of 1950, and the administration had accepted. But when Dean Robert A. Watson reached out the following fall, he got crickets. No one would come forward to take the key.\n\n“Last year’s president, Donald M. Long of New York, is no longer at Harvard, for academic reasons,” wrote the Herald. “Last year’s vice-president, Philip H. Ennis, said he is no longer associated with the club. Nobody else admits association.”\n\nHarvard assured the public that it had not shut down the club, but students were suspicious. Arthur J. Sockol ’51, a senior who “identified himself as spokesman for the group,” wrote to The Boston Traveler. Though the university had allowed the club to continue functioning, he said, students feared retaliation.\n\nThe club was dead. And despite a smattering of radical left-leaning organizations that popped up throughout the ’60s and later—the Young Socialist Alliance, the Young People’s Socialist League, the Democratic Socialists of America—it stayed dead.\n\nSigns of Life\n\nIn 2016, the radical left has re-entered the conversation. Bernie Sanders, a presidential nominee who calls himself a “democratic socialist,” is experiencing widespread success, particularly among young voters. In the Iowa primary, 84 percent of Democratic voters aged 17-29 supported Sanders. In the New Hampshire primary, that number was 83 percent. In a recent Chegg study of 1,363 college students, 6 percent self-identified as socialists.\n\nIs John Reed’s crusade experiencing a revival?\n\nIn \"One of Us: The Story of John Reed in Lithographs. Lithographs by Lynd Ward\" published by Equinox Press Inc., Pusey Library, Harvard University. By Courtesy of the Harvard Archives at Pusey Library\n\nAdvertisement\n\nHe Li ’16, president of Harvard Students for Bernie, considers it a question of semantics. “Obviously Bernie calls himself a democratic socialist, [but] what’s more important to everybody I’ve talked to are his specific policies and what he stands for,” Li said. “The label of socialist, that comes second.”\n\nOthers feel differently. “One of the long-lasting impacts of Bernie Sanders’ campaign is the way that… he’s been able to change the conversation around “the s-word,” Tyrik LaCruise ’17, an avid Sanders supporter, said. “Running as a democratic socialist, people are like ‘Whoa, wait a second. It’s not as dirty as I thought. The post office is socialism. Public schools? Socialism. We have roads. That’s socialism.’”\n\nPaul Adler, a lecturer in Harvard’s History and Literature concentration, is intrigued by that reclamation. “The Sanders phenomenon is blowing my mind.... He calls himself a socialist. According to the polls of Democratic party voters, a lot of people are OK calling themselves socialists,” he said. “Maybe it’s been enough time since the Cold War that there can be a renewed attempt at all this.”\n\nIf the Cold War and the Red Scare really are beginning to fade from cultural memory, then contemporary students might find themselves facing a form of socialism in some ways analogous to the one that faced Reed. After all, Reed grew up in a pre-Soviet world. As Adler pointed out, “People were scared of socialism and said negative things about it, but it had more a connotation of scary anarchy than totalitarianism.” The same could be said today.\n\nIn that case, perhaps we should take a close look at John Reed. His life reads like a short novel, gripping in its intensity and poignant in its brevity. He believed in an ideal, and it drove him through college, across Europe, and into the ground before he turned 33.\n\nAdler suggests that we view the revolutionary as simultaneous warning and inspiration.\n\n“I think the most truthful interpretation is that [Reed] encompasses both,” said Adler. “He’s a warning about the dangers of political idealism, about having a philosophy that the ends justify the means. But he’s also an inspiration about getting down in the muck and trying to create some sort of better society.”"}, {"url": "https://www.thecrimson.com/article/1958/10/24/john-reed-the-eternal-cheerleader-pon/", "page_content": "On a cold morning in Moscow, 38 years ago today, a mixture of snow and rain soaking the mourners, John Reed's coffin was laid to rest next to the Kremlin Wall--alongside those who had given their lives for the Bolshevik Revolution.\n\nAs a Red Guard band played the funeral dirge, a large Red banner was nailed upon the wall with the letters in gold, \"The leaders die, but the cause lives on.\"\n\nBut these words would have had little meaning for John Reed. As poet, war correspondent, Communist, and Harvardman, John Reed saw life as one Big Game. You could lose the game, but it wasn't worth dying for. Life was too exciting.\n\nGraduate of the Class of 1910, world famous by the age of 26, and dead at 32, Reed lived hard, and it was only when he was fatally stricken with typhus that he gave up fighting for the Bolsheviks as he had fought for Harvard, Pancho Villa, and the Socialists.\n\nReed was impetuous--a romantic who saw a beauty in fighting for something even if everyone else was against him. But at the same time, he craved popularity.\n\nHis friends had expected his impulsiveness to vanish, but he always cherished the memory of those moments, when, in front of the Harvard stands, Cheerleader Jack Reed could summon help to \"dash old Eli's hopes.\"\n\n\"As song leader of the cheering section,\" Reed wrote at the age of 29, \"I had the supreme blissful sensation of swaying 2000 voices in great crashing choruses during the big football games.\"\n\nIt was this spirit which impelled Reed, at the end of the Second Communist international in Moscow in August, 1920, to lift his team captain--in this case Lenin--on top of his shoulders.\n\nWith two friends, Paul Freeman and Owen Penney, Reed boosetd the Bolshevik leader up. Granville Hicks reported:\n\nBefore he knew what was happening, Lenin found himself high on Reed's and Freeman's shoulders, gazing down on a bewildered crowd. Ignorant of American customs, or perhaps disapproving, he protested, and, when protests did no good, kicked. They let him down, Reed, unabashed, joking at the bump on Penney's forehead.\n\nAdvertisement\n\nWhen John Reed, son of an Oregon liberal, reached Cambridge in the fall of 1906, Charles W. Eliot was to serve only two more years as president of Harvard and would turn over to A. Lawrence Lowell a tradition of freedom and excellence that has characterized Harvard this whole century.\n\n\"Freedom is the condition necessary to the progress of society,\" Eliot told Reed's assembled class. \"A striking phenomenon of our day is the distrust of freedom that is manifesting itself in all walks of life.\"\n\nThe class of 1910 produced a number of individuals whose use of this freedom was to develop into diverse, but highly articulated philosophies. In addition to Reed, there was Walter Lippman, T.S. Eliot, Heywood C. Broun, Alan Seeger, and Hamilton Fish, Jr.\n\nLooking back on his college days, Reed wrote\n\nThere was talk of the world and daring thought and intellectual insurgency; heresy has always been a Harvard and New England tradition. Students themselves criticized the faculty for not educating them, attacked the sacred institution of intercollege athletics, sneered at undergradaute clubs so holy that no one dared mention their name.\n\nBut for all his high-minded talk about \"hersey,\" in 1917 Jack Reed was definitely a minor league rebel while he was at Harvard.\n\nComing from a small, respectable prep school in New Jersey, Reed hoped to throw himself into Harvard life with the same success that had made him Big Man at Morristown Prep.\n\nWhen he had been at Harvard only a few days, for instance, he walked up to classmate Bob Hallowell. \"I hear you draw,\" he said. \"Why don't we do a book about Harvard? I'll do the text and you do the pictures.\" When Hallowell protested that they knew nothing about the college, Reed replied, \"Hell, we'll find out doing the thing.\"\n\nBut Harvard was not so easily conquered. Desiring to be accepted by what he called \"the aristocracy\"--those who lived along the Gold Coast of Mt. Auburn St. and belonged to the Final Clubs--Reed felt pangs of loneliness and bitterness when no club opened its doors to him.\n\nOn paper, Reed had the right qualifications--an ancestry dating back to Patrick Henry, and a \"good\" prep school diploma--but apparently his personality clashed too often with the ruling lords.\n\nAdvertisement\n\n\"Large, athletic, exuberant and humorous, he seemed to be on earth for the motion he got out of it,\" a classmate remarked later. \"Big, brisk, and breezy,\" his impetuous cordiality which would later win him many admirers alienated those whose friendship he sought.\n\nRejected by the \"gentlemen,\" Reed turned next to Harvard's vast number of extracurricular activities--this time with success.\n\nActivity men, Reed wrote, were \"the realest expression of what Harvard means today.... They are dreamers and often poets.\" And so, in his undergraduate years, Jack Reed joined the Christian Association, St. Paul's Society, the Memorial Society, Debating Club, Oracle, Round Table, Dramatic Club, Symposium, Hasty Pudding--and became captain of the water polo team, Ibis of the Lampoon, Editor of the Monthly, manager of the Banjo, Glee, Guitar and Mandolin Clubs, and President of the Western and Cosmopolitan Clubs.\n\nConspicuously absent from the above list is the Socialist Club, formed by Reed's friend Walter Lippman. Several of Reed's biographers, in tracing his political development, have given him undeserved credit for helping organize the club. The Socialist Club itself was more interested in promoting discussion than political activity.\n\nReed, later one of the first leaders of the Communist Party in the United States, showed little political intrest in college. He was interested mainly in creative writing, and his \"rebellion\" took the form of practical jokes rather than that of radical thought.\n\nFor this training in writing, Reed was to study under two of the great names in Harvard history--Charles T. Copeland, known as \"Copey,\" and George P. Baker, known for his \"47 Workshop.\" In addition, Reed studied literature with such giants as George L. Kittridge, and Bliss Perry.\n\nAlthough he later would be quoting Marxist dogma to lecture halls throughout the country, at college Reed took only one course in the social sciences--that in medieval history.\n\nCopeland, after Reed had become famous, said that he was \"a brilliant character. His prose was lively, and his poetry adventurous.\"\n\nHowever much the swaggering Reed may have impressed Copeland, his poetry is only an expression of a somewhat sentimental and romantic college youth, with no lasting literary merit. His college prose was somewhat better, and several of his Lampoon articles showed a keen sense of satire. His short stories in the Harvard Monthly"}, {"url": "https://id.lib.harvard.edu/ead/hou00136/catalog", "page_content": "John Read was born in Cambridge, Massachusetts on May 19, 1840, the fifth of nine children of William Read and Sarah Goodwin Atkins Read. He prepared at the Cambridge Latin High School and received an A.B. from Harvard College in 1862 and an A.M. in 1865.\n\n\n\nUpon graduating from Harvard, he enlisted in the U.S. Navy on November 7, 1862 and first served as a Union naval recruiting officer in Harvard Square. On April 7, 1863 he became the paymaster aboard the \"Keokuk,\" a turreted ironclad ram ship that was later sunk during an attack on Charleston Harbor, South Carolina. His next service was in the West Gulf Squadron as paymaster on the gunboat \"Granite City.\" This ship was involved in a blockade of the Louisiana and Texas coasts and eventually was captured during an engagement at the Calcasieu Pass, Louisianna. John Read and the other survivors were taken prisoner by the Confederate forces on May 6, 1864.\n\n\n\nFor seven and a half months Read was confined in the Confederate prison camps of Camp Felder and Camp Groce in Texas. The rate of mortality in the stockade prison camps in Texas was among the worst in the entire South. Of the 111 men captured with him, only 32 survived. He was released with the other naval prisoners on December 19, 1864, when the Confederate forces closed the camp and sent the survivors back to Union lines at Galveston, then on to New Orleans. After release, Read was assigned to the United States sloop of war \"Kearsarge,\" but he resigned from military service on March 18, 1865 due to poor health caused by the imprisonment.\n\n\n\nAfter his return from the war, Read entered his father's military and sporting goods firm in Boston and eventually became a partner with his brother under the firm name of William Read & Sons. In 1865 he married Elise Welch of Boston (d. October 22, 1913) and had three sons, J. Bertram Read, William Read II, and Harold W. Read.\n\n\n\nRead was also active in public life. He was a Republican member of the Cambridge Common Council in 1880 and 1881, Board of Cambridge Aldermen in 1882 and 1883, Massachusetts House of Representatives in 1888, and the Massachusetts Senate in 1892 and 1893. He was also on the Board of Overseers of Harvard College in 1895, was a state commissioner of the Nautical Training School of Massachusetts from 1899 to 1913, a trustee of the National Sailor's Home, president of the Cambridge Civil Service Association from 1901 to 1906, and commander of the Massachusetts Commandery of the Naval Order of the U.S. He died in Cambridge on July 29, 1915."}, {"url": "https://www.britannica.com/biography/John-Reed", "page_content": "John Reed, (born Oct. 22, 1887, Portland, Ore., U.S.—died Oct. 19, 1920, Moscow), U.S. poet-adventurer whose short life as a revolutionary writer and activist made him the hero of a generation of radical intellectuals.\n\nReed, a member of a wealthy Portland family, was graduated from Harvard in 1910 and began writing for a Socialist newspaper, The Masses, in 1913. In 1914 he covered the revolutionary fighting in Mexico and recorded his impressions in Insurgent Mexico (1914). Frequently arrested for organizing and defending strikes, he rapidly became established as a radical leader and helped form the Communist Party in the United States.\n\nHe covered World War I for Metropolitan magazine; out of this experience came The War in Eastern Europe (1916). He became a close friend of Lenin and was an eyewitness to the 1917 Bolshevik Revolution in Russia, recording this event in his best known book, Ten Days That Shook the World (1919).\n\nWhen the U.S. Communist Party and the Communist Labor Party split in 1919, Reed became the leader of the latter. Indicted for treason, he escaped to the Soviet Union and died of typhus; he was subsequently buried with other Bolshevik heroes beside the Kremlin wall. Following his death the Communist Party formed many John Reed clubs, associations of writers and artists, in U.S. cities."}, {"url": "https://www.thefamouspeople.com/profiles/john-reed-4897.php", "page_content": "He graduated from Harvard College in 1910, and that summer he set out to see more of the \"dull outside world,\" visiting England, France, and Spain before returning home to America the following spring.\n\nHe entered Harvard College in 1906, and excelled in swimming and water polo, served the editorial boards of Lampoon and The Harvard Monthly, and wrote music and lyrics for the Hasty Pudding Theatricals show.\n\nHe attended Portland Academy, a private school with younger brother Harry. He was bright enough to pass his courses but would not work for top marks, as he found school dry and tedious.\n\nHe was a sickly child with a weak kidney. For much of his teenage years, he suffered recurrent attacks of pain that kept him bedridden for periods of a week or more.\n\nJohn Reed was born on October 22, 1887, in Portland, Oregon to Margaret Green Reed, the daughter of a leading Portland citizen and, Charles Jerome Reed, the representative of an agricultural machinery manufacturer from the East.\n\nRecommended Lists:\n\nCareer\n\nWanting to be a freelance journalist, he circulated essay and short stories about his six months in Europe which were accepted in The Saturday Evening Post, Collier's, The Forum, and The Century Magazine.\n\nOne of his poems was set to music by composer Arthur Foote, and the editors at ‘The American’ came to see him as a contributor and begun to publish his work.\n\nIn 1913, he joined ‘The Masses’, a magazine of socialist politics. He was arrested for the first time in Paterson, New Jersey for speaking on behalf of strikers in the silk mills.\n\nIn 1913, he was deputed to Mexico by the Metropolitan Magazine to report the Mexican Revolution and covered Pancho Villa’s—one of the most prominent Mexican Revolutionary generals—victory over Federal forces at Torreón.\n\nWhen The Ludlow Massacre happened in April 1914, he arrived at the scene in Colorado and reported on the event, siding with the miners and seeing it as an example of class conflict.\n\nOn the outbreak of the First World War, Reed went to Europe where he covered the battle fronts in France, Germany, Russia, Serbia, Romania and Bulgaria for The Masses and the Metropolitan Magazine.\n\nHe saw World War I as a “Clash of Traders” and showed little sympathy for any of the participants and observed with dismay that working-class solidarity was being replaced by militarism and nationalism.\n\nIn 1915, he returned to Portland where he met Louise Bryant. They rented a home in Provincetown, in Massachusetts and acted in, Bound East for Cardiff, a play written by Eugene O'Neill.\n\nIn 1917, accompanied by his wife Louise Bryant who was also provided foreign correspondent accreditation, he left for Petrograd. He interviewed Alexander Kerensky, head of Russian Provisional Government just before Kerensky went into hiding.\n\nContinue Reading Below\n\nIn November 1917, he spent time with Lenin and saw in him, “the power of explaining profound ideas in simple terms, of analyzing a concrete situation. And combined with shrewdness, the greatest intellectual audacity.\"\n\nHe returned to New York City in April, 1918 and was immediately arrested and charged for violating the Espionage Act by publishing anti-war articles and cartoons in The Masses that undermined the war effort.\n\nHe was released on bail and he published a series of articles on the Russian Revolution in The Liberator. He was arrested many times on charges of violating the Sedition Act.\n\nIn September 1919, Reed and several others, decided to form the Communist Party of the United States. Within a few weeks it had 60,000 members whereas the Socialist Party of America had only 40,000.\n\nIn 1920, he attended the Second Congress of the Communist International in Moscow and sought official recognition of the American Communist Party. The Comintern declared that a decision would be arrived after deliberation."}, {"url": "https://hollisarchives.lib.harvard.edu/repositories/24/resources/1316", "page_content": "Part of the Houghton Library Repository\n\nHoughton Library is Harvard College's principal repository for rare books and manuscripts, archives, and more. Houghton Library's collections represent the scope of human experience from ancient Egypt to twenty-first century Cambridge. With strengths primarily in North American and European history, literature, and culture, collections range in media from printed books and handwritten manuscripts to maps, drawings and paintings, prints, posters, photographs, film and audio recordings, and digital media, as well as costumes, theater props, and a wide range of other objects. Houghton Library has historically focused on collecting the written record of European and Eurocentric North American culture, yet it holds a large and diverse number of primary sources valuable for research on the languages, culture and history of indigenous peoples of the Americas, Africa, Asia and Oceania.\n\nHoughton Library’s Reading Room is free and open to all who wish to use the library’s collections."}, {"url": "https://archive.org/details/biographicalske01shipgoog", "page_content": "Book digitized by Google from the library of Harvard University and uploaded to the Internet Archive by user tpb.\n\n\n\nvolumes :\n\n\n\nVols. 4-17 were done by Clifford Kenyon Shipton\n\n\n\nVolumes 4-17 are written by Clifford K. Shipton\n\n\n\nVolumes 4-17 have title: Biographical sketches of those who attended Harvard College in the classes ... with bibliographical and other notes\n\n\n\nVolumes 1-3 published by Charles William Sever; volumes 4-6 published by Harvard University Press; volumes 7-17 published by Massachusetts Historical Society\n\n\n\n\"With an appendix containing an abstract of the steward's accounts, and notices of non-graduates, from 1649-50 to 1659\"--Volume 1 title page\n\n\n\nIncludes bibliographical references and indexes\n\n\n\nNLM copy, volume 1, inscription, Library of the Surgeon General's Office, U.S.A., from the estate of the late John Langdon Sibley by Samuel A. Green, one of the executors Boston May 10, 1887, on inserted leaf at front\n\n\n\nWill not digitize 20131028\n\n\n\nVol. 1. 1642-1658 -- v. 2. 1659-1677 -- v. 3. 1678-1689\n\nAddeddate 2008-06-06 15:34:01 Associated-names Shipton, Clifford Kenyon, 1902-1973, author; Massachusetts Historical Society Copyright-region US Foldoutcount 0 Identifier biographicalske01shipgoog Identifier-ark ark:/13960/t6m046z0k Isbn 0384552404\n\n9780384552401\n\n0934909776\n\n9780934909778 Lccn 07001440 Ocr_converted abbyy-to-hocr 1.1.11 Ocr_module_version 0.0.14 Openlibrary_edition OL20492586M Openlibrary_work OL17774232W Page_number_confidence 95.68 Pages 579 Possible copyright status NOT_IN_COPYRIGHT Scandate 20060929000000 Scanner google Source http://books.google.com/books?id=Vcbt3PeI9SAC&oe=UTF-8 Worldcat (source edition) 14830598 Year 1881 Show More Show Less\n\nFull catalog record MARCXML"}, {"url": "https://www.thecrimson.com/article/1935/5/24/john-reed-pjohn-reeds-portrait-now/", "page_content": "John Reed's portrait now hanging in Adams House in another testimonial that Harvard is ready to house any of her sons who show themselves to have honorably lived up to her standards of truth and courage and devotion.. This principle war firmly and happily established when the names of the graduates who died fighting on the side of the central powers in the World War were placed in the Memorial Church alongside of those who fought for the allies.\n\nHad the reactionaries then triumphed, and these names been excluded, Harvard would have been long in living down the just accusation that she hated her enemies more than she hated needless human slaughter. Similarly when redbaiters, more fanatical than any red, forget that they are first men, and that only second are they Liberal, Conservative, Red, Republican, or Democrat, then those immoderate haters only show the shallowness of their own humankind-ness.\n\nHappy is it indeed that the wide comment occasioned by the hanging of this portrait of a Harvard graduate, painted by a Harvard graduate, and presented by a Harvard graduate, should be almost unanimously in praise of its acceptance by the University. As the Boston Herald puts it in an editorial quoted elsewhere in full in this issue. \"A university as large as Harvard, with graduates scattered throughout the world and attached to all manner of political religions, and economic causes, cannot draw strict lines as to whom it will and will not cherish,\" on any basis of dogma.\n\nThe jealous insistence of the press on the justice and liberality of Harvard's action, and its insistance that this action does not imply any dogmatic bias is a good omen for the future of liberal universities in this country."}, {"url": "https://encyclopedia.ushmm.org/content/en/article/john-reed", "page_content": "Excerpt\n\nWe intend to be arrogant, impertinent, in bad taste, but not vulgar...to attack old systems, old morals, old prejudices...to set up new ones in their places....Bound by no creed or theory of social reform, we will express them all, providing they be radical.\n\n—The Masses, John Reed, 1913\n\nWhich of John Reed's Works were Burned?\n\nTen Days that Shook the World (10 Tage, die die Welt erschütterten)\n\nWho was John Reed?\n\nJohn Reed (1887-1920) was born to a wealthy family in Oregon in 1887. He attended Harvard University, where he began his writing career by serving on the editorial boards of Lampoon and Harvard Monthly. Reed joined the staff of the leftist periodical The Masses in New York City in 1913. The following year he participated in the uprising of Pancho Villa in Mexico. In 1917, Reed, a Leninist sympathizer, interviewed the leaders of the Bolshevik Revolution in Russia. The resulting work, Ten Days that Shook the World, was his most well known.\n\nAfter his return to the United States, Reed helped found the Communist US Labor Party in 1919 and served as its first chairman. Reed, who had been charged with sedition in the United States for articles written for The Masses, was indicted as a Communist leader during the post-World War I \"Red Scare.\" He returned to Russia, where he died from typhus in 1920. Reed was honored as a Soviet hero and buried under the Kremlin wall. Some 13 years later, the Nazis burned his account of the Bolshevik Revolution for its Communist sympathies."}, {"url": "https://id.lib.harvard.edu/ead/hou00071/catalog", "page_content": "Part of the Houghton Library Repository\n\nHoughton Library is Harvard College's principal repository for rare books and manuscripts, archives, and more. Houghton Library's collections represent the scope of human experience from ancient Egypt to twenty-first century Cambridge. With strengths primarily in North American and European history, literature, and culture, collections range in media from printed books and handwritten manuscripts to maps, drawings and paintings, prints, posters, photographs, film and audio recordings, and digital media, as well as costumes, theater props, and a wide range of other objects. Houghton Library has historically focused on collecting the written record of European and Eurocentric North American culture, yet it holds a large and diverse number of primary sources valuable for research on the languages, culture and history of indigenous peoples of the Americas, Africa, Asia and Oceania.\n\nHoughton Library’s Reading Room is free and open to all who wish to use the library’s collections."}], "John Reed Jr. joined the Communist Party of America in 1920.": [{"url": "http://www.chinatoday.com.cn/english/society/2015-11/10/content_708020.htm", "page_content": "Ineradicable Memory: In Memoriam of Dr. Norman Bethune and the Medical Aid Team to China\n\nBy LIN SHENG\n\nTHIS year marks the 70th anniversary of the victory of the World Anti-Fascist War and the Chinese People’s War of Resistance Against Japanese Aggression. It also commemorates the 125th anniversary of the birth of Norman Bethune, legendary international physician and communist, and the 45th anniversary of the establishment of diplomatic relations between the PRC and Canada. For the last seven decades, the image of Dr. Bethune, the internationally renowned thoracic surgeon who operated while wearing straw sandals and the white battlefield medical officer’s apron of the Eighth Route Army, has been deeply engraved on the hearts of the Chinese people. He selflessly adopted the cause of the Chinese people’s liberation as his own, and exerted unremitting efforts in achieving this end. Never will the Chinese people forget him, or his dedication and sacrifice.\n\nDr. Bethune performs a surgical operation in Sunjiazhuang Village, Laiyuan County of Hebei Province. Lin Jinliang, the author’s late father, is second left in the picture.\n\nRequiem Aeternum in Chinese Soil\n\nHenry Norman Bethune was born in Gravenhurst, Ontario, Canada on March 3, 1890. He enrolled at the University of Toronto in 1909. At the breakout of World War I he enlisted in the Canadian Army, serving as a stretcher-bearer. During one of the battles at Ypres in northern Belgium, a shard of German shrapnel struck him in his left leg, almost killing him. After this incident, he left the front line and returned to the University of Toronto to complete his studies, and graduated with a medical degree. He then took up his practice in Detroit, Michigan, U.S. for some years, during which time he invented over 30 types of surgical instruments that today bear his name. He gained three doctoral degrees in medicine, and his sophisticated medical skills and numerous inventions made him an internationally known thoracic expert, and one of the four most famous doctors in North America.\n\nIn November 1935 Bethune joined the Communist Party of Canada. This was a major turning point in his life. In October 1936, when he rallied to the aid of the Spanish in their struggle against fascism, he organized the world’s first mobile blood transfusion unit in Madrid. This enabled immediate administration of blood transfusions to wounded soldiers just behind front lines, and was a pioneering contribution to the world’s field surgery.\n\nHaving taken up arms against the fascist foe, Bethune found no shortage of battlefields among which to pick and choose. Although Spain and China were both campaigns to fight fascism, Bethune deemed China to have the greater need for his aid. Accordingly, after the Chinese People’s War of Resistance Against Japanese Aggression erupted, he contacted the Committee on International Aid to China and decided to head the Canadian-American Medical Aid Team to China.\n\nHistorical materials show that during his time in the Shanxi-Chahar-Hebei base area, Bethune never hesitated to respond to the rattle of gunfire at the front. Altogether, he engaged in relief work in 11 battles, operated on 1,290 wounded soldiers and 10 Japanese prisoners, and treated tens of thousands of other soldiers and civilians in the base area. His introduction of advanced Western medical science and technology ameliorated health and medical conditions in China’s anti-Japanese aggression base, Bethune also initiated and established the Model Hospital of the Eighth Route Army (namely the Rear Hospital of Shanxi-Chahar-Hebei Military Region), and set up the Hospital for Special Surgery for civilians based on his past experiences and the lessons he gleaned from them. He moreover helped establish the Volunteer Blood Transfusion Team. Bethune aided the founding of the Shanxi-Chahar-Hebei Military Region Medical School, lectured to students, and wrote many course materials, such as Initial Procedures for Treating Wounds, Amputation Techniques, Techniques for Excising Necrotic Bone Tissue, and the Handbook on the Organization of and Technologies for Battlefield Hospitals in Guerrilla Warfare that enabled adaptation to the special conditions of asymmetrical warfare. In short, Bethune contributed to an extraordinary degree to the development of the medical and health care cause in the anti-Japanese aggression base.\n\nIn the last third of October, 1939, 20,000 Japanese troops stationed in North China deployed to launch a ferocious attack on the Shanxi-Chahar-Hebei base area, supported by planes and columns of cannons and armored vehicles.\n\nOn the evening of October 27, during his inspection tour in rear-area hospitals, Bethune received word that 40 soldiers wounded in the Motianling Battle were being transported to the rear. In order to ensure their speedy treatment, Bethune immediately decided to take charge of a makeshift medical team deployed to the front line.\n\nHis team met the liaison staff for frontline troops in Sunjia Village, Wang’an Town, Laiyuan County, a mere three kilometers from a Japanese army base. The village offered no suitable operating space, so they resorted to a small temple outside the village, which they turned into an extemporized operating theater. One after another, the wounded were brought into this impromptu operating room, underwent their surgical procedures, and were then relayed to the rear. By ill luck, Bethune accidentally slit his finger with a bone chisel during one operation, and this started to inflame on his way back to the hospital. Rather than attending to this gash, he continued with his rescue work. Several days later, as he was operating on a patient with erysipelas of the neck and cellulitis of the head, this wound became fatally infected.\n\nNovember 7, 1939 witnessed the second anniversary of the founding of the Shanxi-Chahar-Hebei base area, and the famous Hangtuling Battle had also broken out on that same day. Although by this time he was seriously ill, Bethune insisted on leading his medical team to the frontline. Due to a delay in treatment and a lack of adequate antibacterial medications, his septicemia worsened. Even so, the dying doctor was still very much concerned with his work and patients, “The soldiers bleeding at the front are my chief concern. I would elect to stay with them even to the extremity of my breath and strength, but I’m not even able to stand up.”\n\nBethune died in Huangshikou Village, Tangxian County, Hebei Province on the morning of November 12, 1939, his life tragically cut short before the age of 50.\n\nThe good doctor now rests in the eternal embrace of the soil of his beloved adopted land.\n\nOn December 21, 1939, Mao Zedong published his famous essay In Memory of Norman Bethune, in which he offered a summary of and eulogy to Bethune’s spirit. “No one who returned from the front failed to express admiration for Bethune whenever his name was mentioned, and no one remained unmoved by his spirit. In the Shanxi-Chahar-Hebei base area, no soldier or civilian who Dr. Bethune treated, or who had seen how he worked remained unaffected.”\n\n“Everyone envies me my opportunity”\n\nNorman Bethune, Jean Ewen – a Canadian nurse – and Falade, an American doctor established the Canadian-American Medical Aid Team to China. Falade backed out, however, and another American doctor, Parsons, took his place at departure. By the end of January, 1938, the team had traveled to Hankou via Hong Kong and there made contact with Zhou Enlai, then working at the Wuhan office of the Eighth Route Army. Bethune and Ewen volunteered to go to Yan’an, while Parsons insisted on remaining in Wuhan, so their paths diverged at this juncture. After the separation, Bethune retained the name Canadian-American Medical Aid Team to China, with the obvious purpose of gaining as much support as possible from both Canada and the U.S.\n\nAt the end of March, 1938, Bethune and Ewen reached Yan’an after a long and arduous journey. Soon after arriving they met Richard Brown, who shared their faith and vision, and who had arrived in Yan’an just afterwards.\n\nBrown was born in the U.K. in December 1898, and moved to Canada with his parents at age 11. He graduated from the University of Toronto with a doctoral degree in medicine in 1928. Two years later, he came to China at the invitation of the Henan Anglican Church to work at St. Paul’s Hospital – first built in Kaifeng, Henan and later moved to Shangqiu, Henan with a donation from St. Paul’s Cathedral in Toronto. This hospital offered the highest-level medical skills in eastern Henan Province at that time. Before coming to China, Brown especially furthered his study in ophthalmology, and thus became the first specialist to operate on cataracts in central China. He learned, moreover, to speak fluent Chinese in Henan in a relatively short time.\n\nIn February 1938, while applying for a visa extension in Wuhan, Brown learned that Bethune and Ewen had just left Wuhan, bound for Yan’an. He lost no time in returning to Shangqiu, where he decided to head for Yan’an in order to contribute to the Chinese people’s struggle against Japanese aggression during his three-month vacation.\n\nOn April 6, Brown left St. Paul’s Hospital in Shangqiu for Xi’an, where he drew medicaments and medical instruments from the International Red Cross, before making his way on up to Yan’an. He wrote in a letter to his wife, “Everyone envies me my opportunity. I’m so thrilled and excited!”\n\nBrown arrived in Yan’an on April 17. When he met up with Bethune and Ewen, it was as if the three Canadians had been lifelong pals. Brown unhesitatingly joined their medical team, and together they proceeded to the frontline in the Shanxi-Chahar-Hebei base area.\n\nBrown thereafter went to Hankou, where he called for the Red Cross to set up an International Peace Hospital in Liaoxian County (now Zuoquan County) in southeastern Shanxi Province. He also traveled to Shanghai and Hong Kong to raise money to buy drugs and medical instruments for the Eighth Route Army. In February 1945 Brown gave speeches aired by the Canadian Broadcasting Corporation, calling for medical support and aid for the Eighth Route Army. In a 1963 letter replying to a query by famous film director John Kenny about Bethune’s stories in China, Brown expressed his deep respect and love for the Chinese people. In September that same year, Brown died of illness in Vancouver.\n\nDr. Bethune and his colleague Dr. Brown leave Yan’an for another battlefield.\n\nA Graveside Companion\n\nThe historical record attests that Ewen and Brown were both international communists who actively devoted themselves to the Chinese People’s War of Resistance Against Japanese Aggression. Unlike Bethune, however, their heroism went unsung. As Ewen recalled, Mao Zedong met Bethune twice, holding long talks with him on both occasions. Ewen and Brown were both present at these meetings. On one occasion, Bethune dispatched Ewen to Xi’an to buy medicine. When she returned, Bethune and Brown had already left Yan’an for Wutai County, Shanxi Province where the Shanxi-Chahar-Hebei military command was stationed. After this, the Canadian-American Medical Aid Team to China had only two members: Bethune and Brown. Ewen went to work for the 120th Division in northwestern Shanxi, and then the rear area hospital of the New Fourth Army. She never saw Bethune again.\n\nJean Ewen returned to Canada via Shanghai in June 1939. In August 1976, she traveled far to attend the opening ceremony of the Bethune Memorial House in Gravenhurst. In May 1985, the 74-year-old Ewen visited Beijing, accompanied by her daughter. She passed away the following year. In accordance with her late mother’s will, Ewen’s daughter carried her ashes to China and interred them close to Bethune’s grave in the Shanxi-Chahar-Hebei Martyrs’ Cemetery in Tangxian County, Hebei Province."}, {"url": "https://world.huanqiu.com/article/9CaKrnJEUQH", "page_content": "人民网5月2日讯 据美国《侨报》报道，美国共产党和世界其他国家的共产主义运动组织一样，1991年前苏联解体后受到沉重打击。但它至今仍健在;为数不多的几名信念坚定的美共党员为它的生存作出了不懈努力。今年6月，美共将召开全体会议。\n\n美共(Communist Party USA)总部在纽约曼哈顿西23街一幢八层楼房里。这栋楼是1970年代这片街区尚未红火、房价仍较低的时候买下作为党总部的。在装潢现代、整洁明亮的办公室里，白色的墙上挂着党的历史上重要领袖人物的肖像，书架上整齐码放着马恩列斯著作。\n\n现任秘书长兼财务总管罗伯塔·伍德介绍说，当初买这楼确实划算;这些年下来，也对资本主义的现实作了些让步，把楼里的两层出租，租金收入用来办网上刊物：人民的世界(People's World)。\n\n这份网刊的前身是很久以前就停刊的美共报纸《每日工人》(Daily Worker)。\n\n美共自己的数据显示全国有2000-3000名党员，领工资的干部只有两名，包括党主席山姆·韦伯和他的副手哈维斯·泰纳。泰纳在1970年代曾是副总统候选人。\n\n美共坚持认为，社会主义将开启美国历史新纪元;美国巨大的财富将有史以来首次用于为全体民众谋福利。韦伯说，党的长远目标是实现共产主义，实现没有阶级之分、人人平等的社会，以及国家政权的逐步消亡。\n\n美国历史上，共产党曾经是政坛的重要一分子。上个世纪三、四十年代是美共的鼎盛时期，网络一度遍布全国，还在一些地方选举中夺得议席。有三位民主党众议员同时也是共产党员，但没有公开。\n\n虽然美共党员人数从未超过10万，但其影响却相当广泛。冷战爆发后，美国麦卡锡当局开始清洗共产党及其同情者。那段时间，美共“十分艰难”。蒙大拿州大瀑布大学历史教授弗农·佩德森说，即便如此，对美共的打压之甚，反过来也使他们更团结，同仇敌忾，凝聚力更强。而且，当时的恐怖气氛也让美共成员感到自己的预言正在成为现实，革命即将到来，而这只是共产党早就预见到会出现的无数次迫害的第一波。\n\n冷战期间，美共建立了一个平行的地下组织，部分成员曾为莫斯科当间谍。到了1980年代，美共得到来自莫斯科的大笔资金。亚特兰大的艾默里大学政治学教授哈维·克莱尔说，美国联邦调查局(FBI)知道这些钱的走向，一直盯着。\n\n1956年苏联在匈牙利搞大清洗大迫害，1968年又在捷克斯洛伐克清党，导致许多美国共产党员退党。美共当时坚持与莫斯科保持一致。\n\n1991年苏联解体前，1959-2000年任美共党主席的格斯·霍尔选择支持戈尔巴乔夫的敌人。佩德森说，对于美共能够从共产阵营解体的大震荡中存活下来，这令他“略感惊讶”，但承认这应归功于美共的几名核心骨干，无论前途多么黑暗，他们就是不放弃。\n\n现任党主席韦伯今年68岁，他背微驼，温和的声音略带沙哑。他更愿意谈论当前的政治气候，不大愿意讨论意识形态。他说，美共的首要任务是与广泛的左翼团体联合，为它们抗议经济不平等、为少数族裔维权的努力提供支持，由此来击败美国的“极右”势力。\n\n不过，党面临的重大挑战是党员年事渐高，候补力量不足的问题。一名前纽约支部的负责人记得，进入二十一世纪后的头几年，他参加了100多场葬礼。\n\n2008年金融危机爆发后，美共发现党员人数和党费缴纳金额略有上扬。除了金融危机导致一部分人信仰发生转变，美共认为另一个原因是右翼政客对“社会主义”民主党人的攻击也把一些人推向左翼阵营。\n\n韦伯提到近年来一些较重大的事件，比如各国主要城市发生的“占领”行动(如占领华尔街、占领伦敦金融城等)，西雅图市议会选举中一名社会主义人士当选。就连共和党人现在也开始谈论贫困问题了。“这个国家的气氛正在改变，人们正在思考经济不平等问题”，而美共的目标是在“可预见的未来”争取在美国实现社会主义。\n\n当然，共产主义可能还十分遥远，他承认。不过，一直关注美共旅程的批评人士并不客气。\n\n匈牙利事件后脱离美共的学者罗恩·拉多什认为，美共目前的立场跟其他左翼社会民主团体难以区分，现在还有人加入这个党，令他不解。较年轻的一代则不这么认为。在堪萨斯、密苏里和田纳西州活动的36岁的美共干部，托尼·佩西诺夫斯基说，冷战记忆逐渐被淡忘，美共现在又采取务实的、草根活动路线，使得它的形象正在改观。\n\n当然，现实中的偏见很难消除。他说，有人曾把他叫做土生土长的恐怖分子，有人给他打威胁电话，甚至上门恫吓。反共还是真实的现实。“我们只是努力让行动来代言，不过多在‘共’字上做文章，”他说。\n\n韦伯的遭际略好。他告诉别人自己是共产党员时，别人的反应并不那么敌对。一些年轻人甚至觉得他“很酷”。他认为，随着美共逐渐与美国政坛其他左翼力量结成联盟，党背负的部分历史包袱也将悄悄地被甩脱。\n\n今年6月，美共将召开全体会议。韦伯希望创造一个鼓励“同志们”畅所欲言、自由发表观点和建议的气氛。他说改党名的建议也可以提。6月份的会议上，他将设法安排支持和反对美共改名的两派有充分的对话交流。"}, {"url": "http://en.youth.cn/RightNow/202106/t20210622_13041925.htm", "page_content": "Photo taken on June 22, 2021 shows an exterior view of the Museum of the Communist Party of China in Beijing, capital of China. (Xinhua/Ju Huanzong)\n\n-- The Museum of the Communist Party of China (CPC), a site devoted to permanent and comprehensive exhibitions of the Party's history, was inaugurated on Friday with its first visitors, including Xi Jinping, general secretary of the CPC Central Committee.\n\n-- Believing that the Party's history is the most vivid and convincing textbook, the CPC Central Committee, with Xi Jinping at its core, decided to build a museum of the CPC's history in late 2017.\n\n-- On May 5, 2021, after nearly 1,000 days of construction, the Museum of the CPC was officially completed. Details of the museum are full of historic connotations.\n\nAhead of the 100th anniversary of the Communist Party of China (CPC), the Museum of the CPC has opened in Beijing, capturing the attention of the country.\n\nThe museum, a site devoted to permanent and comprehensive exhibitions of the Party's history, was inaugurated on Friday with its first visitors, including Xi Jinping, general secretary of the CPC Central Committee.\n\nWhy is the new landmark museum described as the Party's \"spiritual home\"? Why is it so important to the centennial CPC?\n\nScattered throughout China, revolutionary sites such as the memorial of the first National Congress of the CPC in Shanghai, the memorial hall marking the start of the Long March by the Central Red Army in Jiangxi Province, the venue of the 1935 Zunyi Meeting in Guizhou Province, and the Fragrant Hills memorial site in suburban Beijing, map out the contours of the CPC's 100-year history.\n\nSince the 18th National Congress of the CPC, Xi, also Chinese president and chairman of the Central Military Commission, has been reflecting on the Party's founding mission during his inspections of revolutionary memorials across China in a bid to lead the Party and the country to create the future.\n\nPeople wait to visit the memorial of the first National Congress of the Communist Party of China, in Shanghai, east China, June 6, 2021. (Xinhua/Liu Ying)\n\nBelieving that the Party's history is the most vivid and convincing textbook, the CPC Central Committee, with Xi Jinping at its core, decided to build a museum of the CPC's history in late 2017.\n\nThe first issue is to select a site.\n\nA piece of land reserved for cultural sites near Beijing Olympic Park was chosen, taking into consideration its location, the height of the building and the surrounding environment.\n\nShao Weiping, chief architect of the Beijing Institute of Architectural Design (Group) Co., Ltd., was informed about the museum project at the beginning of 2018.\n\n\"As an architect as well as a Party member, I was very excited to have the chance to participate in such an important project,\" said Shao.\n\nA design team was soon established by the company to draft the proposal.\n\nSeven top-level domestic architectural design institutes bid for the commission.\n\nShao's company, renowned for designing the Great Hall of the People more than 60 years ago, emerged victorious and became the museum's leading design institute.\n\nThe museum's groundbreaking ceremony was held on Aug. 26, 2018, and construction began on Sept. 10 of the same year.\n\nPhoto taken on May 20, 2019 shows a memorial hall marking the start of the Long March by the Central Red Army in Yudu County, east China's Jiangxi Province. (Xinhua/Hu Chenhuan)\n\n\"We turned our love of the Party into motivation for the construction work, regardless of the heat of summer and the cold of winter,\" said Wang Heng, project manager of the Beijing Urban Construction Group Co., Ltd.\n\nThe museum's construction involved nearly 50,000 people.\n\nXi himself has been following the construction process.\n\nOn the afternoon of Sept. 29, 2020, Xi listened to a work report on engineering construction and museum exhibitions, and outlined clear requirements for the next step.\n\nXi stressed the importance of demonstrating the theme of \"staying true to the founding mission\" to show that the CPC strives for the well-being of the people and national rejuvenation.\n\nThe museum should be a sacred hall, a spiritual home for Party members, an educational center to guide the public to follow the Party's instructions, and an authoritative institute for Party history research and publicity, Xi said.\n\nOn Feb. 8, 2021, Xi also presided over a meeting to review the Party history exhibition plan.\n\nThe meeting stressed that representative and convincing elements should be used to clearly explain the historical background of the founding of the CPC, the historical inevitability of the Chinese people choosing the leadership of the CPC, and the Party's adherence to integrity, innovation and progressing with the times.\n\nPeople visit the venue of the 1935 Zunyi Meeting in southwest China's Guizhou Province, Jan. 28, 2021. (Xinhua/Ou Dongqu)\n\nOn May 5, 2021, after nearly 1,000 days of construction, the Museum of the CPC was officially completed.\n\nDetails of the museum are full of historic connotations.\n\nThe museum is in the shape of the Chinese character \"gong,\" which looks like a horizontal H. \"Gong\" means workers or labor in Chinese. The design implies that the CPC is the vanguard of the Chinese working class, the Chinese people, and the Chinese nation.\n\nThe museum adopts a traditional colonnade structure, fully representing the essence of Chinese architecture: upright and foursquare, simple but grand.\n\nThere are 28 colonnades on the eastern and western sides of the exhibition hall, symbolizing that after 28 years of struggle, the CPC established New China.\n\nFive magnificent sculptures stand in the museum's square, with the huge CPC flag sculpture aptly named \"Flag\" denoting that the CPC flag offers direction and is a source of strength. In the four other sculptures, a total of 276 figures tell the story of the CPC's 100-year struggle for the well-being of the Chinese people and national rejuvenation.\n\nNearly two-thirds of the main building area, or about 150,000 square meters, has been designed as exhibition space.\n\nIn the exhibition hall, a special post office is set up to serve visitors and tell CPC history through its services, using a special postcode \"100100\" that not only symbolizes that the museum was completed upon the 100th anniversary of the founding of the Party, but also that the CPC is marching forward toward its two centenary goals."}, {"url": "https://en.youth.cn/RightNow/202107/t20210706_13075408.htm", "page_content": "Two scholars with Cornell University in the United States recently observed that over the last two decades, the Communist Party of China (CPC) has built contacts with more than 400 political parties in over 160 countries, and that such exchanges reflect pull factors rather than an outward push by the century-old party.\n\nThomas Pepinsky and Jessica Chen Weiss, both experts on governance, noted in a joint article published in June by Foreign Affairs, a leading U.S. magazine on international relations, that there are ruling parties seeking counsel from the CPC on governance issues.\n\nAmong the enormous successes of the CPC, which celebrated its centenary on Thursday, the one that has perhaps provoked the most thought is the unparalleled support it enjoys from the Chinese people. In a Harvard University survey published in July last year, as many as 93.1 percent of Chinese citizens expressed approval for their central government.\n\nTherefore, for representatives of political parties and organizations worldwide who will attend a high-level dialogue with the CPC on Tuesday, one of the most riveting subjects would be: What right things has the CPC done to make itself the unvarying choice of the Chinese people?\n\nA ceremony marking the centenary of the Communist Party of China (CPC) is held at Tian'anmen Square in Beijing, capital of China, July 1, 2021. (Xinhua/Yin Gang)\n\nPEOPLE CENTERED\n\nTwo years ago in Rome, as his meeting with visiting Chinese President Xi Jinping was coming to a close, Roberto Fico, Italian lower house speaker, popped a question.\n\n\"What did you feel when you were elected Chinese president?\" asked Fico, curious about Xi's feelings when he was elected to lead China, a country much bigger than Italy.\n\nGoverning such a huge country requires a strong sense of responsibility and hard work, replied Xi, also general secretary of the CPC Central Committee. \"For the good of my people, I will put aside my own well-being. I am willing to be selfless and devote myself to China's development.\"\n\nServing the people wholeheartedly has been the fundamental purpose of the CPC -- a party taking pride in coming from the people and being rooted in the people.\n\n\"The Party has always represented the fundamental interests of all Chinese people; it stands with them through thick and thin and shares a common fate with them,\" Xi said at Thursday's centenary ceremony at Tian'anmen Square, the symbolic political heart of China. \"The Party has no special interests of its own -- it has never represented any individual interest group, power group, or privileged stratum.\"\n\n\"Looking back over the one hundred years of history, always staying with the people is the secret of the CPC's great achievements in the annals of history,\" said former Japanese Prime Minister Yukio Hatoyama.\n\n\"China has suffered many misfortunes and difficulties, including the aggression caused by Japan, but the CPC has always worked with the people to overcome many difficulties,\" he added.\n\nStaff members clean up a makeshift hospital converted from a sports venue following its closure as its last batch of cured COVID-19 patients were discharged in Wuhan, central China's Hubei Province, March 8, 2020. (Xinhua/Xiao Yijiu)\n\nThe latest of such misfortunes struck around the turn of 2020, when the deadly COVID-19 epidemic broke out, claiming lives and sinking economies around the world.\n\nIt is also this people-centered philosophy that enabled the Chinese leadership to carry out what the World Health Organization dubbed \"perhaps the most ambitious, agile and aggressive disease containment efforts in history\" and make China the first country to control the pandemic.\n\n\"We are willing to save lives at all costs,\" Xi said. \"No matter how old the patients are and how serious their conditions have become, we never give up.\"\n\nIn China's central Hubei Province alone, where the disease was first reported, more than 3,600 COVID-19 patients aged over 80 have escaped the clutches of death.\n\nThe CPC \"is a people's party, which is rooted in people,\" said Jawad Anani, Jordan's former deputy prime minister.\n\nAerial photo taken on Feb. 4, 2020 shows medical workers walking into isolation wards at Huoshenshan Hospital in Wuhan, central China's Hubei Province. (Xinhua/Xiao Yijiu)\n\nDEVELOPMENT ORIENTED\n\n\"Though our Party's founding mission is easy to define, ensuring that we stay true to this mission is a more difficult task,\" Xi remarked at the CPC centenary ceremony.\n\nIn May 2019, the CPC launched a campaign among all its members themed \"staying true to the original aspiration and founding mission,\" which is to seek happiness for the Chinese people and rejuvenation for the Chinese nation.\n\nCommitted to promoting people's well-being, the CPC has enabled China to make remarkable economic leaps in a very short period of time, said Fabien Roussel, national secretary of the French Communist Party.\n\nA little more than four decades ago, the policy of reform and opening up was adopted under the leadership of late Chinese leader Deng Xiaoping in 1978, unleashing the creativity and entrepreneurial potential of the Chinese people and laying the foundation for what has now become a vibrant socialist market economy open to the outside world.\n\nTej Bunnag, former Thai foreign minister and ambassador to China during 1986-1990, has borne witness to China's transformation from an impoverished backwater to a major contributor to the world economy.\n\nHe recalled his first trip to China in 1973, when Shenzhen was \"just a small fishing village.\" \"Now it's an international city of more than 10 million residents and a high-tech hub,\" said the 77-year-old China observer.\n\nFrom 1978 to 2020, China's GDP rocketed from 367.9 billion yuan (56.67 billion U.S. dollars) to 101.6 trillion yuan (15.7 trillion dollars), upgrading the country from a low-income to a middle-income one.\n\nFast economic growth lifted most people in China out of poverty, yet the CPC was not satisfied. It vowed to eliminate poverty and complete the building of a moderately prosperous society in all respects.\n\nAerial photo taken on May 11, 2020 shows residential houses built for farmers in Lyuliang Township of Jinhu County, east China's Jiangsu Province. (Xinhua/Li Bo)\n\n\"This is a society to be enjoyed by each and every one of us,\" Xi has said. \"On the march toward common prosperity, no one must be left behind.\"\n\nSince 2012, the Chinese leadership has treated poverty alleviation as a major priority, putting forward new thoughts and ideas, and making new policies and arrangements.\n\nEight years later, the number of Chinese people living under the poverty line had been reduced from 100 million to zero in 2020, which means more than 10 million people out of poverty every year on average, or one person lifted above the poverty line every three seconds.\n\n\"Through the continued efforts of the whole Party and the entire nation,\" Xi declared at Thursday's ceremony, \"we have realized the first centenary goal of building a moderately prosperous society in all respects.\"\n\n\"This means that we have brought about a historic resolution to the problem of absolute poverty in China,\" he said.\n\nChina's success in poverty reduction is a \"miracle,\" said Khuon Sodary, second vice-president of the Cambodian National Assembly and a member of the standing committee of the Cambodian People's Party.\n\n\"This success has clearly reflected the CPC's goal that has prioritized the Chinese people's well-being and livelihoods,\" she said.\n\nPupils attend a class at Bulenggou Primary School of Bulenggou Village in Dongxiang Autonomous County of Linxia Hui Autonomous Prefecture, northwest China's Gansu Province, Nov. 9, 2020. Bulenggou Village used to be a severely impoverished area. The poverty alleviation work has made villagers access to drink water, roads, health center and well-equipped primary school. (Xinhua/Ma Xiping)\n\nSELF REFORM\n\n\"The rise of something may be fast, but its downfall is equally swift,\" educator Huang Yanpei said to late Chinese leader Mao Zedong during a visit to Yan'an, the CPC's revolutionary base, in 1945.\n\n\"Has any person, family, community, place, or even nation ever manage to break free of this cycle?\" Huang asked.\n\nThis conversation has been repeatedly invoked by Xi as a warning of complicated and long-term risks faced by the governing CPC.\n\nFor him, a common denominator that leads to the decay of political power is internal erosion, especially corruption.\n\nHe highlighted \"self-reform\" or \"turning the blade inward and scraping the poison off the bones\" as a prime means to forestall the vicious circle and maintain good health and strong vitality of the party.\n\n\"I believe the one who can defeat us is ourselves, no one else,\" Xi warned when addressing senior officials at a seminar at the Party School of the Central Committee of the CPC in January 2018.\n\nAccordingly, it has been made a priority to crack down on malpractice by party officials, particularly those losing faith in the party, taking bribes, leading extravagant lives, or being autocratic.\n\nSince 2012, the CPC has taken comprehensive and zero-tolerance policies to fight corruption, noted Dmitry Novikov, deputy chairman of the Central Committee of the Communist Party of Russia.\n\n\"It is important that the very conditions leading to corruption are destroyed,\" Novikov said, citing the CPC's practices such as strict internal party management, steady discipline, and a stern struggle against formalism, bureaucracy, hedonism and extravagance.\n\nSerbian President Aleksandar Vucic pointed out that anti-corruption forms the precondition for development and is essential to leading the world's biggest political party.\n\nCPC members \"symbolize the future of all other people\" in China and \"need to be a role model to all the others,\" said Vucic.\n\nThe CPC's battle against corruption, he added, has given \"significant strength\" to the party's leadership to show the nation and the world that \"China is very resolute\" in the rule of law and in bringing higher living standards to the people.\n\nFITTING SHOES\n\n\"Only the wearer of the shoes knows if they fit or not,\" Xi said at Russia's Moscow State Institute of International Relations in March 2013 on his first overseas trip as Chinese head of state.\n\n\"Only the people can best tell if the development path they have chosen for their country suits or not,\" he added.\n\nThrough decades of painstaking explorations and hard struggle, China, under the leadership of the CPC, has established that socialism with Chinese characteristics is the only path to rejuvenation and prosperity.\n\nThe CPC, observed Tej, the Thai diplomat, has been firmly marching on that path, flexibly adapting to changes and improving its policies.\n\nThis, he said, is a source of the party's strengths.\n\nJessie Duarte, deputy secretary-general of South Africa's ruling African National Congress, said \"it is important that nations adopt ideologies and developmental paths which are true to their own history, national identity, and unique circumstances instead of just following what others are doing.\"\n\nChina never copies others' models, neither does the country urge others to copy its own.\n\nInstead, China has consistently advocated that each country should choose a development path in accordance with its own circumstances and its people's needs, and all countries should respect and learn from each other.\n\n\"The world will be lifeless and dull, if there is only one single model and one single civilization,\" Chinese State Councilor and Foreign Minister Wang Yi has said.\n\n\"Democracy is not Coca-Cola, which, with the syrup produced by the United States, tastes the same across the world,\" he said.\n\nPeople were told that the Western system of democracy is the best way for social progress, yet what the CPC has achieved proves that there is another feasible model, said Pakistani Prime Minister Imran Khan, who is also chairman of the country's ruling Pakistan Tehreek-e-Insaf party.\n\nDogu Perincek, chairman of Turkey's Patriotic Party, said the CPC is truly admirable for respecting other parties' choices of path in line with each country's unique conditions.\n\n\"It does not impose its position,\" he said. \"When telling its stories, it always says 'these are our experiences.'\" (Video reporters: Wang Jian, Zheng Yihan, Zhang Baoping, Yuan Liang, Wu Danni, Yang Yiran, Yu Fuqing, Wang Tian; video editor: Fu Jing)"}, {"url": "http://www.chinatoday.com.cn/ctenglish/2018/commentaries/202109/t20210916_800258433.html", "page_content": "Recently the Publicity Department of the Communist Party of China (CPC) released a detailed report on the achievements and contributions of the CPC in the growth and development of China and the world.\n\nThe report entitled “The CPC: Its Mission and Contributions” fleshes out the party’s 100-year unwavering commitment to leading China towards heights of glory and the path China will embark on. This report is important as it can help clear the misunderstanding and rebut unfounded accusations overseas about the CPC, one of the largest political parties in the world. After a century of struggle, the CPC has gone from victory to victory in its relentless quest for the rejuvenation of the Chinese nation.\n\nEstablished by few dedicated people in a small house and then on a small boat with a dream a century ago, the party set out its journey towards national rejuvenation despite difficulties and tribulations. These 100 years were not easy but brave members of the CPC guided by the ideals of Marxism, by virtue of their innovative spirit and firm belief, vowed to march for prosperity. There were risks on the way, however, the CPC has demonstrated its prowess to deal with all the internal and external enemies and challenges since its inception. This was a defining trait of the CPC. The Chinese people envisioned their rejuvenation long ago and today the CPC has made remarkable strides in meeting that lofty goal.\n\nThe CPC puts the Chinese people at the center of its policies and reforms and thus makes them the ultimate beneficiaries of the nation’s growth. One can tell their commitment to people’s wellbeing from the determination of the Chinese leadership to move the country forward. In retrospect, it was the CPC’s major focus on people’s well-being that drove the party to initiate the reforms starting from 1978 which brought forth China’s economic takeoff. Since then, China has managed to lift 800 million people out of poverty, which is certainly unparalleled in world history. This feat is well explained in the report of “The CPC: Its Mission and Contributions”. And the recent vision of building a community with a shared future has allowed all Chinese people to benefit from the gains of reform and development. On top of that, through the Belt and Road Initiative (BRI), China has reached millions of people’s hearts globally.\n\nAerial photo taken on Aug. 26, 2021 shows a view of Xincang Village of Haining City in Jiaxing, east China’s Zhejiang Province. (Photo/Xinhua)\n\nThere are two major elements mentioned in the report that are worth discussing. The first is the socialism with Chinese characteristics and the second is the CPC leadership’s strong conviction about their core beliefs and ideals. This publication illustrates how taking socialism with Chinese characteristics as core ideology has helped the nation rise to modern challenges. This ideology has instilled in the CPC vigor and vitality to reform and evolve itself. The report also identifies self-discipline, self-righteousness, and self-reliance of accountability as primary competences of the CPC.\n\nThe primary goal of the CPC is to put people’s wellbeing at the center of making policies and keep their actions in line with transparency, fairness, justice, peace, democracy and fundamental freedoms. It is true not only in the CPC’s history but also in its struggle to make China great today. The report acknowledges the contributions of its predecessors and expects the incumbent leadership to steer China towards national rejuvenation.\n\nThe CPC also plays the leading role in governance and administrative functions of the country. In a centralized government system, the CPC acts as a pivot to guide and lead statecraft in domestic and foreign policy. It actively engages in policy-making and implementation as the source of guiding fountain for the whole governance system. Since its founding, the CPC has played a crucial role in unifying all Chinese people, creating People’s Republic in 1949, and made the society cohesive. China has its own way of democracy which is different from the western way. It is amazing to see how this system has been proved successful for the people of the country. This system has not only helped the socio-economic progress of China but also unlocked the potential for better living in the future."}, {"url": "https://romanian.cri.cn/381/2015/09/02/1s162850.htm", "page_content": "What did people around the world do in support of China's war of resistance?\n\n1. Sympathy and assistance from people around the world\n\nAfter the nationwide War of Resistance began in China, communist parties, and progressive and peace-loving people around the world expressed their strong condemnation of the Japanese aggression and their ﬁrm support for China's resistance efforts.\n\nThe presidium of the Communist International's Executive Committee called on the proletariat and working people around the world to champion China's cause, speak out against imperialism, and take a stand against Japan by boycotting Japanese goods and opposing arms trade with Japan.\n\nIn Europe, the Central Committee of the Communist Party of Great Britain called on all parties and people of all classes to take action to participate in the movement to support China. Following this, a dozen or so organizations were established for providing support to China, including British United Aid to China. The people of Britain contributed in cash and kind, ﬁnding various ways to send medicines, clothes, and funds to China. In France, the France-China Friendship Society launched a campaign to support China by organizing conferences for the representatives of groups in support of China and opposed to Japanese aggression and anti-Japanese-aggression gatherings, which demanded that the French government work to stop Japanese aggression against China. Following the Lugou Bridge Incident, the Communist Party of Spain sent a telegram to the CPC, expressing its ﬁrm support for China's war of resistance.\n\nIn America, the Communist Party of the United States of America called on the people of America to offer as much help as possible to China, a call that received a warm response from Americans of all classes. The Communist Party of Canada also called for support for the Chinese resistance, and entrusted Dr. Norman Bethune, a renowned thoracic surgeon, to organize a medical team to travel to China to help.\n\nIn Asia, after the September 18th Incident in 1931, a number of people from Korea stepped up to organize an armed force to join the resistance. They engaged invading Japanese troops in bitter clashes in northeast China and over the border in Korea, making an important contribution to the fight against Japanese fascism. The Communist Party of Indochina headed by Ho Chi Minh, and the people of Vietnam offered strong support to China in its war of resistance. The people of the Philippines, Thailand, Malaya, Burma, the Dutch East Indies, and India united with Chinese communities in their countries, boycotted Japanese goods, and rejected cooperation with the Japanese, dealing a blow to Japan both politically and economically.\n\nThe Japanese Communist Party (JCP) and many peace-loving people in Japan also expressed their sympathy for, supported, and participated in the Chinese people's struggle against the aggression of Japanese fascists. JCP leader Sanzō Nosaka worked for some time in Yan'an, directly helping China in its war of resistance. A great number of well-known public ﬁgures, activists, and writers from Japan, including Wataru Kaji and his wife Sachiko Ikeda, Eiko Midorikawa, Kazuo Yamada and Susumu Narikura, lived in China for many years and joined the Chinese people in their struggle against Japanese aggression.\n\nMany friends from around the world actively supported and joined in the Chinese people's war of resistance. Among them, Norman Bethune, who had travelled to China with a Canadian-US medical team, Dwarkanath Kotnis, a member of the Indian team providing medical assistance in China, and Hans Shippe, a journalist and member of the Communist Party of Germany, all gave their lives in the war of resistance. International reporters, including progressive American writer Agnes Smedley, travelled to China to report from the war zone, following the Eighth Route Army and the New Fourth Army, writing a great number of reports on the Chinese resistance. Rewi Alley from New Zealand, and US journalist Edgar Snow and his wife established the International Committee for the Promotion of Chinese Industrial Cooperatives (ICCIC), known as Gung Ho. It set up various cooperatives throughout China to help refugees and support the country in its protracted war of resistance. Gung Ho organizations in Britain, New Zealand, and Australia also offered assistance to China's Gung Ho organizations. The moving stories of international friends supporting the Chinese in their war of resistance will always be remembered by the people of China.\n\n2. Assistance from the USSR, the US, and other countries\n\nDuring the early years of China's nationwide resistance, the Soviet Union was one of China's main sources of support. Japan's full-scale war against China posed a serious threat to the Soviet Union, and thus prompted it to increase its assistance to China. As well as making its condemnation of Japan's acts of aggression known internationally, the Soviet Union also signed a treaty of mutual non-aggression with China, and offered significant material assistance to the country for its war of resistance.\n\nThe Soviet Union also sent a large number of military advisors and technical experts to China. Soviet generals M. I. Dratvin, A. I. Cherepanov, K. M. Kachanov and V. I. Chuikov served consecutive terms in China as chief military advisor to the Chinese government. They acted as contacts to facilitate the Soviet Union's military assistance to China, helped with military planning, and even played a role in commanding major battles.\n\nAfter the war of resistance entered a stage of strategic stalemate, the US gradually increased its assistance to China. In December 1938, following a series of negotiations between the two countries, the US government for the first time announced it was to provide a loan of $25 million to China, which was to be used to purchase American materials and would be paid back in tung oil. In February 1939, the two sides formally signed the Tung Oil Loan Agreement, marking the beginning of American assistance to China during the war. In April, Roosevelt signed a directive to allow American ex-servicemen to join the American Volunteer Group (known as the \"Flying Tigers\") organized by Claire Lee Chennault to help the Chinese air force to ﬁght the Japanese military.\n\nAfter the start of the Pacific War, the US further increased its assistance to China. According to incomplete statistics, the US provided a total of $845.7 million in the form of loans and leases to China throughout the course of the war, all but $20 million of which took the form of grants. The US delivered arms, airplanes, tanks, auto vehicles, vessels, and other military supplies in total worth $520 million to China in support of its war of resistance.\n\nIn April 1938, France signed a contract with China on a loan for the Nanning-Zhennanguan Railway totaling 150 million francs and GBP£144,000, to which a further loan of 30 million francs was added in March 1939. In December 1939, China and France reached another agreement, this time for a loan of 480 million francs for a railway between Xufu and Kunming. However, as the tide of war began to take a turn for the worse for France, the two contracts were suspended. France maintained a positive attitude toward the efforts of the Chinese government to seek military assistance and cooperation, yet its own plans for military assistance and cooperation were suspended due to the defeat and surrender of France in 1940.\n\nThe support of the international community for China gave great encouragement to the Chinese people who had for many years been ﬁghting the Japanese independently in the East. It boosted their morale and their confidence that they would prevail over Japanese fascism. At the same time, China kept fighting its protracted war of resistance, and in spite of the tremendously tough conditions in China at that time, provided a large amount of the agricultural, animal, and mineral products to the Soviet Union, the US, Britain, and France that they urgently needed for their war efforts, supporting, and helping others around the world in the ﬁght against fascism."}, {"url": "http://chinaplus.cri.cn/news/politics/11/20180317/104414.html", "page_content": "Share this with Close\n\nThe following is the biographical sketch of Li Zhanshu:\n\nLi Zhanshu, male, Han ethnicity, was born in August 1950 and is from Pingshan, Hebei Province. He began his first job in December 1972 and joined the Communist Party of China (CPC) in April 1975. Li graduated from Department of Political Education, Night College, Hebei Normal University where he completed an in-service undergraduate program. He holds an executive MBA degree.\n\nLi is currently a member of the Standing Committee of the 19th CPC Central Committee Political Bureau and chairman of the Standing Committee of the 13th National People's Congress.\n\nFile photo of Li Zhanshu [File photo: Xinhua]\n\n2018- Member, Standing Committee of the CPC Central Committee Political Bureau\n\nChairman, Standing Committee of the 13th National People's Congress\n\n2017-2018 Member, Standing Committee of the CPC Central Committee Political Bureau\n\nDirector, Office of the National Security Commission of the CPC Central Committee\n\n2014-2017 Member, CPC Central Committee Political Bureau\n\nMember, CPC Central Committee Secretariat\n\nDirector, CPC Central Committee General Office\n\nDirector, Office of the National Security Commission of the CPC Central Committee\n\nSecretary, Working Committee of the Organs Directly under the CPC Central Committee\n\n2012-2014 Member, CPC Central Committee Political Bureau\n\nMember, CPC Central Committee Secretariat\n\nDirector, CPC Central Committee General Office\n\nSecretary, Working Committee of the Organs Directly under the CPC Central Committee\n\n2012 Deputy Director (minister level) in charge of routine work and Director, CPC Central Committee General Office\n\nSecretary, Working Committee of the Organs Directly under the CPC Central Committee\n\nChairman, Standing Committee of the Guizhou Provincial People's Congress\n\n2010-2012 Secretary, CPC Guizhou Provincial Committee\n\nChairman, Standing Committee of the Guizhou Provincial People's Congress `\n\n2008-2010 Deputy Secretary, CPC Heilongjiang Provincial Committee\n\nGovernor, Heilongjiang Province\n\n2007-2008 Deputy Secretary, CPC Heilongjiang Provincial Committee\n\nActing Governor, Heilongjiang Province\n\n2004-2007 Deputy Secretary, CPC Heilongjiang Provincial Committee\n\nVice Governor, Heilongjiang Province\n\nStudied executive business administration at Harbin Institute of Technology and received an executive MBA degree (2005-2007)\n\n2003-2004 Deputy Secretary, CPC Heilongjiang Provincial Committee\n\n2002-2003 Deputy Secretary, CPC Shaanxi Provincial Committee\n\nSecretary, CPC Xi'an Municipal Committee\n\nChairman, Standing Committee of the Xi'an Municipal People's Congress\n\n2002 Member, Standing Committee of the CPC Shaanxi Provincial Committee\n\nSecretary, CPC Xi'an Municipal Committee\n\nChairman, Standing Committee of the Xi'an Municipal People's Congress\n\n2000-2002 Member of Standing Committee and Head of Organization Department, CPC Shaanxi Provincial Committee\n\n1998-2000 Member of Standing Committee; Deputy Head of Leading Group for Rural Work and its Office Director, CPC Shaanxi Provincial Committee\n\nAttended an in-service graduate program in business economics at Department of Finance and Trade, Graduate School, Chinese Academy of Social Sciences (1996-1998)\n\n1997-1998 Member of Standing Committee and Deputy Head of Leading Group for Rural Work, CPC Hebei Provincial Committee\n\n1993-1997 Member of Standing Committee and Secretary-General, CPC Hebei Provincial Committee\n\nStudied economics through Correspondence School of the Central Party School (1992-1994)\n\n1990-1993 Deputy Secretary, CPC Chengde Prefectural Committee; Hebei Province Commissioner, Chengde Prefecture, Hebei Province\n\n1986-1990 Secretary, CYL Hebei Provincial Committee\n\nTook a training course in Party building theory at the Central Party School (Feb-Aug 1988)\n\n1985-1986 Deputy Secretary, CPC Shijiazhuang Prefectural Committee; Hebei Province Commissioner, Shijiazhuang Prefecture, Hebei Province\n\n1983-1985 Secretary, CPC Wuji County Committee, Hebei Province\n\n1976-1983 Administrative secretary and Chief, Information Section, Office of the CPC Shijiazhuang Prefectural Committee, Hebei Province\n\nStudied at Department of Political Education, Night College, Hebei Normal University (1980-1983) 1972-1976 Administrative secretary and deputy head, Office of the Shijiazhuang Prefecture Commercial Bureau, Hebei Province\n\n1971-1972 Studied commodity prices at Shijiazhuang Prefecture Finance and Trade School, Hebei Province\n\nAlternate member, 16th and 17th CPC Central Committees\n\nMember, 18th and 19th CPC Central Committees\n\nMember, Political Bureau and Secretariat, 18th CPC Central Committee\n\nMember, Political Bureau and its Standing Committee, 19th CPC Central Committee\n\nChairman, Standing Committee of the 13th National People's Congress."}, {"url": "http://en.youth.cn/RightNow/202108/t20210831_13196881.htm", "page_content": "Editor's Note: The Publicity Department of the Communist Party of China (CPC) Central Committee on Thursday released a key publication titled \"The CPC: Its Mission and Contributions.\" Full text below:\n\nContents\n\nPreamble\n\nI. Serving the People Wholeheartedly\n\n1. Putting the People First\n\n2. From Victory to Victory with the People\n\n3. The People as Masters of the Country\n\n4. A Good Life for the People\n\nII. Realizing the Ideals of the Party\n\n1. Upholding Marxism\n\n2. Firm Ideals and Convictions\n\n3. Breaking New Ground\n\n4. Defusing Risks and Overcoming Challenges\n\nIII. Robust Leadership and Strong Governance\n\n1. A Strong Central Committee\n\n2. Sound Guidelines and Strategies\n\n3. Effective Implementation of Decisions and Plans\n\n4. Pooling the Efforts of All Sectors\n\n5. Fostering High-Caliber Party Officials\n\nIV. Maintaining Vigor and Vitality\n\n1. Upholding Intra-Party Democracy\n\n2. Correcting Mistakes\n\n3. Protecting the Party's Health\n\n4. Promoting Study and Review\n\nV. Contributing to World Peace and Development\n\n1. Safeguarding World Peace\n\n2. Pursuing Common Development\n\n3. Following the Path of Peaceful Development\n\n4. Building a Global Community of Shared Future\n\nConclusion\n\nPreamble\n\nThe Communist Party of China (CPC), founded in 1921, has just celebrated its centenary.\n\nThese hundred years have been a period of dramatic change－enormous productive forces unleashed, social transformation unprecedented in scale, and huge advances in human civilization. On the other hand, humanity has been afflicted by devastating wars and suffering.\n\nThese hundred years have also witnessed profound and transformative change in China. And it is the CPC that has made this change possible.\n\nThe Chinese nation is a great nation. With a history dating back more than 5,000 years, China has made an indelible contribution to human civilization. After the Opium War of 1840, however, China found itself plunged into a semi-feudal and semi-colonial society. It endured intense humiliation, its people were pushed into darkness, and the ancient Chinese civilization lost its way.\n\nThe Chinese people fought with indomitable spirit against repeated setbacks to save the nation from subjugation.\n\nThe salvoes of Russia's October Revolution in 1917 sent Marxism-Leninism to China, and the CPC came into being. The Chinese people were awakened, and a torch was lit for the rejuvenation of the Chinese nation.\n\nThe founding of the CPC was an epoch-making event which profoundly changed the course of China's history, delivered a new future for the Chinese people and nation, and had an enormous impact on the rest of the world.\n\nDuring its endeavors over the past century, the CPC has developed a great spirit and carried it forward－upholding truth and ideals, staying true to its founding mission, fighting without fear of danger, and meeting the people's expectations.\n\nThis spirit has continuously inspired the CPC to forge ahead.\n\nAs a Marxist party, the CPC, unlike previous political forces, has no special interests of its own to pursue. From the outset, the CPC has made happiness for the Chinese people and the rejuvenation of the Chinese nation its abiding goals. Like a beacon, it has illuminated the way forward for the Chinese people.\n\nOver the past hundred years, the CPC has grown from a small party with just over 50 members into the largest governing party in the world, with more than 95 million members in a country of more than 1.4 billion people. It is a party of major international standing.\n\nIt has governed the world's largest socialist country for more than seven decades. It has led the Chinese people onto the path towards national rejuvenation and modernization, and it enjoys extensive support from the Chinese people.\n\nOver the past hundred years, all the struggles, sacrifices and efforts made by the CPC and by the Chinese people under its leadership have been directed to one goal－the rejuvenation of the Chinese nation.\n\nChina's Communists, with Mao Zedong, Deng Xiaoping, Jiang Zemin, Hu Jintao and Xi Jinping as their chief representatives, have adapted the basic tenets of Marxism to China's realities and its traditional culture, and they have gone from victory to victory on their journey towards national rejuvenation.\n\nTo realize national rejuvenation, the CPC led the Chinese people in fighting with unyielding determination, achieving great success in the New Democratic Revolution (1919-1949).\n\nFighting as armed revolutionaries through the Northern Expedition, the Agrarian Revolutionary War, the War of Resistance Against Japanese Aggression, and the War of Liberation, they defeated the counterrevolutionaries, shattered the three mountains of imperialism, feudalism, and bureaucrat-capitalism, and founded the People's Republic of China (PRC) in 1949. They secured the independence of the nation, liberated the Chinese people, and put their future in their own hands.\n\nVictory in the New Democratic Revolution brought an end to China's semi-feudal and semi-colonial status and the disunity that plagued the country. All the unequal treaties imposed on China by imperialist powers and all the privileges they had accorded themselves were abolished. This created the fundamental conditions for realizing national rejuvenation.\n\nBy engaging in this tenacious struggle, the CPC and the Chinese people sent a powerful message to the world: The Chinese people had stood upright. The time of oppression and humiliation was over, and it would never return.\n\nTo realize national rejuvenation, the CPC led the Chinese people in a dedicated effort to build a strong China, and they achieved great success.\n\nBy carrying out the socialist revolution in China, they brought to an end several thousand years of feudalism－a system exploitative and repressive by its very nature－and established socialism as China's fundamental political system. In the course of building socialism, they overcame subversion, sabotage, and armed provocation by imperialist and hegemonic powers, and brought about the most extensive and profound social changes in the history of the Chinese nation. This great transformation of a poor, backward and populous country in the East into a modern socialist China created the fundamental political conditions and laid down the institutional foundations necessary for realizing national rejuvenation.\n\nBy succeeding in their tenacious struggle, the CPC and the Chinese people showed the world that they were equally capable of changing the old China and building a new one. They showed the world that only socialism could save China, and that socialism could deliver development to China.\n\nTo realize national rejuvenation, the CPC led the Chinese people in freeing their minds and forging ahead, achieving great success in reform, opening up, and socialist modernization.\n\nThe CPC led the people in making a great transition after the founding of the People's Republic by laying down its general guidelines for the primary stage of socialism. It advanced reform and opening up with resolve, overcame risks and challenges from every direction, and founded, upheld, and developed socialism with Chinese characteristics.\n\nThis enabled China to transform itself from a highly centralized planned economy into a socialist market economy full of vitality, and from a largely closed country to one that is open to the world on all fronts. It also enabled China to achieve a historic leap－from a country constrained by backward productive forces to the world's second largest economy－and to make a historic transformation by raising the living standards of its people from bare subsistence to general prosperity.\n\nThese achievements fueled the push towards national rejuvenation by providing robust institutional conditions and the material base for rapid development.\n\nBy succeeding in their tenacious struggle, the CPC and the Chinese people showed the world that reform and opening up has been critical in making China what it is today. China has made great strides and caught up with the times.\n\nTo realize national rejuvenation, the CPC has led the Chinese people in carrying out their great struggle, launching a great initiative, advancing their great cause, fulfilling their great dream, and achieving great success for socialism with Chinese characteristics in the new era.\n\nThe 18th National Congress of the CPC in 2012 marked a new era for socialism with Chinese characteristics. In this new era, the Party has strengthened its overall leadership, coordinated the implementation of the Five-sphere Integrated Plan [This is China's overall plan for building socialism with Chinese characteristics, that is, to promote coordinated progress in the economic, political, cultural, social and eco-environmental fields] and the Four-pronged Comprehensive Strategy [This is China's strategic plan for building socialism with Chinese characteristics, that is, to make comprehensive moves to complete a moderately prosperous society in all respects, to further reform, to advance the rule of law, and to strengthen Party self-governance. After the Fifth Plenary Session of the 19th CPC Central Committee, \"finishing the building of a moderately prosperous society in all respects\" was turned into \"building a modern socialist country in an all-round way\" in accordance with the actual conditions], upheld and improved the system of socialism with Chinese characteristics, and modernized China's system and capacity for governance.\n\nIt has adopted a full range of intra-Party regulations and exercised rule-based internal management. It has overcome significant risks and challenges, achieved the First Centenary Goal [This is the goal set by the CPC at its 18th National Congress, to finish building a moderately prosperous society in all respects by the centenary of the CPC in 2021], and adopted a strategic plan to fulfill the Second Centenary Goal [This is the goal set by the CPC at its 18th National Congress to build China into a modern socialist country that is prosperous, strong, democratic, culturally advanced, and harmonious by the centenary of the PRC in 2049. This goal was further defined by the CPC at its 19th National Congress in October 2017 as to develop China into a great modern socialist country that is prosperous, strong, democratic, culturally advanced, harmonious, and beautiful by the middle of the 21st century]. All these efforts have provided robust institutional conditions, strong material foundations, and a source of inspiration for advancing the cause of national rejuvenation.\n\nBy succeeding in their tenacious struggle, the CPC and the Chinese people have shown the world that the Chinese nation has achieved the tremendous transformation from standing upright to becoming prosperous and growing in strength, and that China's rejuvenation is an unstoppable historical force.\n\nAt the ceremony marking the centenary of the CPC held on July 1, 2021, General Secretary Xi Jinping declared that thanks to the continued efforts of the whole Party and the entire nation, China has realized the First Centenary Goal of building a moderately prosperous society in all respects. This means that it has put an end to absolute poverty in China, and is now marching in confident strides towards the Second Centenary Goal of building China into a great modern socialist country. This is a glorious achievement for the Chinese nation, for the Chinese people, and for the Communist Party of China.\n\nFinishing the building of a moderately prosperous society in all respects means realizing a millennia-old dream and a century-old hope of the Chinese nation and fulfilling the solemn promise the CPC made to the people and history. In substantially reducing the world's poverty-stricken population, China has made an outstanding contribution to human progress.\n\nOver the past hundred years, the CPC has led the Chinese people in ending the humiliation and misery inflicted on them in the modern era. Without the CPC, there would be no new China and no national rejuvenation. This is a fact that is clear to the Chinese people based on China's achievements in revolution, reconstruction, and reform.\n\nThe leadership of the CPC is the choice of history and the people. This leadership is vital for the future of the country, the nation, and the Party itself.\n\nOver the past hundred years, through its dauntless efforts to create a new China, the CPC has led the Chinese people in writing the most magnificent chapter in the millennia-long history of the Chinese nation. The great path they have embarked upon, the great cause they have undertaken, and the great achievements they have made over the past century will go down in the annals of the Chinese nation and humanity.\n\nI. Serving the People Wholeheartedly\n\nThe Communist Party of China is the vanguard of China's working class, the Chinese people, and the Chinese nation. Serving the people wholeheartedly is its abiding mission. The country is the people and the people are the country. The Party's struggle to found a new China and develop it is for the people. Of the people, by the people, for the people－this is what has guided the CPC from victory to victory over the past century.\n\n1. Putting the People First\n\nThe CPC is dedicated to the people and forever puts their interests first. It follows the underlying trends of social development and respects the people's principal role in making history. It pursues the lofty goal of working for the wellbeing of the Chinese people; and does everything in the interests of the people.\n\nThe CPC is rooted in the people. It was born in 1921 in the great struggle against feudal rule and foreign aggression, at a time when Marxism-Leninism became integrated with China's workers movement. From the very day of its creation, the CPC has represented China's working class, the Chinese people, and the Chinese nation. It has no special interests of its own, nor does it represent any interest group, establishment group, or privileged social group. Its only goals are to deliver happiness for the people and achieve national rejuvenation.\n\nThe CPC shares the same goals as the people, and it shares a common stake with the people. Drawing support and strength from the people, the Party has grown in strength in the fight to overcome every challenge.\n\nMembers of the CPC are ordinary people. They love life and are hard working. They are sincere, open and compassionate. But they are also vanguards and role models in daily life, work, and public activities. They are the first to step forward in case of challenges and dangers, fearless and ready to give their all for the country and the people. They emerge from the people and lead them to go forward. They are Communists－citizens of China both ordinary and extraordinary at the same time.\n\nFrom its very beginning, the CPC has striven to serve the people and won their support and endorsement. It represents the fundamental interests of all the Chinese, and everything it does is to realize, safeguard and advance their interests. Meeting the people's expectation for a better life is its goal.\n\nThe people's interests are behind everything the Party does－leading revolution, building the armed forces, developing political institutions, boosting the economy, carrying out reform and opening up, developing culture, and exploring better ways of running society.\n\nIn China, the state founded by the people under CPC leadership is called the People's Republic of China; its government is called the people's government, the armed forces are called the People's Liberation Army; and Party officials are people's servants. The Party Central Committee's newspaper is the People's Daily, and China's central bank is called the People's Bank. The people are the lifeblood of the Party; indeed, they are the inexhaustible source of inspiration giving the Party all the strength it needs to fulfill its mission.\n\nThe CPC makes decisions and adopts policies in the fundamental interests of the people. At different stages of China's revolution, reconstruction and reform, and at historical junctures critical to the future of the Party and the country, the Party has always acted to advance the people's interests and oppose any action that harms them.\n\nThe Party has taken sound development as its top priority in governance. It has unleashed and developed the productive forces to meet the people's expectation for a better life.\n\nSince its 18th National Congress, the CPC has followed a people-centered philosophy; it has launched a full range of initiatives to achieve common prosperity and uphold fairness and justice.\n\nIt has delivered initial prosperity for all. It has fought Covid-19 and saved lives no matter the cost. It has eradicated absolute poverty in the country, implemented the rural revitalization strategy, and promoted a new people-focused urbanization strategy. The vision that lucid waters and lush mountains are invaluable assets inspires the drive to protect the environment.\n\nDetermined that housing is for living in, not for speculation, the CPC has taken clear steps to keep the housing market under control. It sees that the capital market is properly regulated. It also sees that justice is served in every judicial case. All of this has enabled the people to fully share the country's development gains.\n\nOver the past century, through all the changes in the domestic and international environment, whether in good times or bad, the CPC has always put the people first. It has never wavered in fulfilling this commitment.\n\nThe CPC has made great sacrifices for the people. From the founding of the CPC in 1921 to the founding of the People's Republic in 1949, more than 3.7 million identified members of organizations under Party leadership gave their lives to liberate the country. Of the six family members of Mao Zedong who died for the revolution, five were Party members.\n\nIn peaceful times, too, during disaster relief efforts after earthquakes, floods and other emergencies, Party members have rushed to the scene and risked their own lives to save the lives of others. Since the Covid-19 outbreak, close to 400 Party members and officials have lost their lives in the line of duty. More than 1,800 Party members and officials also gave their lives in the battle against absolute poverty.\n\nAmong all those who have died were rank and file Party members, senior officials, and family members of top Party leaders.\n\nPanel 1 The Fight Against Covid-19\n\nAfter China was struck by Covid-19, the CPC and the Chinese government responded swiftly, putting people's lives before all else. It organized massive nucleic acid testing and inoculation, made every effort to identify every case of infection and did everything possible to save patients and protect the people's health.\n\nTreatment of Covid-19 patients is free of charge in China. All Covid-19 patients, both confirmed and suspected, have received government financial aid to pay for any medical bills not covered by basic medical insurance, serious disease insurance, or the medical assistance fund. As of June 2021, all medical expenditure of inpatients with confirmed infections had reached a total of RMB 2.8 billion (with RMB 1.6 billion paid by basic medical insurance), or RMB 20,000 per person. The average cost of treating each Covid-19 patient in critical condition was more than RMB 150,000. The individual cost for some patients in critical condition exceeded RMB 1 million, all covered by the government.\n\nFree nucleic acid testing and inoculation have been conducted nationwide. As of July 25, 2021, tests have been conducted on 2.2 billion nucleic acid samples, and more than 1.5 billion Covid-19 vaccines had been injected, with all costs covered by the government.\n\n2. From Victory to Victory with the People\n\nThe CPC works in the service of the people. It trusts and relies on the people and mobilizes them to fight for their interests. It follows the mass line, a principle of \"from the people, to the people\". It has shared good times and hard times with the people, and it has led them in surmounting all obstacles and making great strides forward.\n\nBy relying on the people, the CPC rose and grew strong. It gained the strength it needed to beat powerful enemies, both inside and outside China, and to win victory in the New Democratic Revolution.\n\nDuring this revolution, in the Agrarian Revolutionary War, the CPC galvanized extensive public support and defeated the first four Kuomintang (KMT) encirclement and suppression campaigns. During the War of Resistance Against Japanese Aggression, the Party mobilized the people and overwhelmed the enemy with a vast people's war. During the War of Liberation, with supplies transported in wheelbarrows and on people's shoulders, the People's Liberation Army (PLA) secured decisive victories against the KMT troops in the three major campaigns.\n\nIn these contests between progressives and reactionaries and between justice and injustice, the KMT forces shielded themselves in ironclad fortresses, and the Japanese invaders put their faith in their military superiority. However by relying on the people, the CPC defeated them all.\n\nBy relying on the people, the CPC founded the People's Republic, carried out socialist revolution, and engaged in rebuilding the country from scratch. The founding of the People's Republic marked the ultimate moment of freedom for the Chinese people from the yoke of slavery and oppression. Now masters of their own country, the people threw themselves into reconstruction to create a bright future for the country and the nation.\n\nIn just a few years, an independent and substantial industrial and economic system took shape in China. Groundbreaking successes were achieved in nuclear technology, satellites, carrier rockets and other cutting-edge technologies, and major advances were made in China's overall development.\n\nBy relying on the people, the CPC carried out reform, opening up and socialist modernization, pioneering a path of socialism that is distinctively Chinese.\n\nThe reform and opening-up initiative launched by the CPC in 1978 freed people's minds, inspiring them to boldly explore new frontiers. The household contract system was introduced in rural areas, and village and township businesses flourished. The setting up of special economic zones connected China to the world, enabling it to introduce foreign technology and capital and export Chinese products. Waves of reform swept across the country, powering China's development. With dedication and resolve, the Chinese people achieved great success in modernization, completing the greatest social and economic transformation the world has ever seen.\n\nBy relying on the people, the CPC has ushered Chinese socialism into a new era. Since its 18th National Congress, the Party has galvanized the whole nation to realize the Chinese Dream of national rejuvenation and boosted economic vitality with further reform. Its successful internal initiatives to improve Party conduct have boosted public morale.\n\nThe Chinese people have given of their best and fully released their power of creation in pursuit of their shared dreams. They have carried out further reform and achieved all-round initial prosperity. They have eradicated absolute poverty. They have fought side by side in the battle against Covid-19. They have reined in environmental pollution. And they have succeeded in keeping systemic risks at bay. Their hard work has made it possible for China to turn its blueprint for development into reality. Together, the Chinese people are creating miracles that stun the world. Proud and confident, they are pressing ahead on the path of Chinese socialism.\n\nOver the past century, hundreds of millions of Chinese have dedicated themselves to realizing the rejuvenation of the Chinese nation. Their contribution will go down in the annals of history; their epic deeds will be remembered by posterity. The people have created history, and they are the source of the Party's strength. The Chinese are a great, glorious, and heroic people－this is a fact fully borne out by the 100-year history of the CPC.\n\nPanel 2 Whole-Process Democracy\n\nWhole-process democracy, including democratic election, consultation, decision-making, management and scrutiny, operates across all of China's governance mechanisms.\n\nBy April 2021, more than 2.6 million people from various ethnic groups, sectors, social groups, and political parties, including a large number of workers and farmers, had served as deputies to people's congresses at all levels. Since 2016, more than one billion registered voters have elected close to 2.5 million deputies to county and township level people's congresses.\n\nSince the 18th National Congress of the CPC, public opinion has been solicited on 187 draft laws. Over 3 million submissions have been made by 1.1 million people, and many important proposals from these submissions have been adopted. During the compilation of the Civil Code, ten rounds of public opinion were solicited, and more than one million proposals were collected from 425,000 people.\n\nSince 2012, the CPC Central Committee has held or entrusted its relevant departments to convene more than 170 consultative meetings to hear views and proposals from the eight non-CPC political parties and from public figures with no party affiliation (non-affiliates) on major issues, such as the 14th Five-year Plan, and the formulation of the reports to be delivered by the general secretary to the CPC National Congress and plenary sessions of the CPC Central Committee.\n\nNon-affiliates and the central committees of the other parties have submitted more than 730 written proposals, many of which have been incorporated into major policy decisions. From its first session in March 2018 to April 2021, the 13th CPPCC National Committee received 23,049 various proposals.\n\nDuring the critical battle against poverty, the CPC Central Committee asked the central committees of the other political parties to each supervise poverty alleviation efforts in one of eight poor provinces and autonomous regions in central and western China. More than 36,000 people from these parties were involved in this work. They made more than 2,400 proposals to the Party committees and governments of these provinces and autonomous regions, and submitted more than 80 reports to the CPC Central Committee and the State Council.\n\n3. The People as Masters of the Country\n\nThe people should run their own country－this is an abiding commitment of the CPC. Over the past hundred years, it has led the people in realizing people's democracy in China, a country with a feudal history dating back several thousand years that descended into a semi-feudal and semi-colonial society after the Opium War.\n\nUnder the CPC's leadership, democracy has been practiced in the whole process of the country's revolution, reconstruction and reform, in all aspects of governance, and in every field of economic and social life. Democracy, a shared value, has taken root in China as a political institution and mechanism of governance, and the Chinese people now truly hold in their own hands the future of the country, society and themselves.\n\nThe CPC has made unremitting efforts to explore new ways of realizing people's democracy.\n\nDuring the New Democratic Revolution, the Party committed to developing workers 'and peasants' democracy and people's democracy, and set up Soviet congresses of workers, peasants and soldiers, assemblies of representatives, and representative conferences of people from all sectors.\n\nWhen the People's Republic of China was founded, the people's democratic dictatorship was adopted as the governing system, and the system of people's congresses was instituted as the governing structure, thus enabling the people to run their own country.\n\nSince the launch of reform and opening up, the CPC has worked to ensure the Party's leadership, the people's position as the masters of the country, and law-based governance, which have become fundamental principles of democratic socialism with distinctive Chinese features.\n\nSince its 18th National Congress, the CPC has set Eight Criteria [At the meeting marking the 60th anniversary of the National People's Congress in 2014, President Xi Jinping said the following: The best way to judge whether a country's political system is democratic and works is to see whether the succession of its leaders is conducted in an orderly way in accordance with the law, whether government affairs and social, economic and cultural affairs are managed by all the people in accordance with the law, whether the public freely voice demands to advance their interests, whether all stakeholders in society are fully involved in the country's political process, whether government decisions are made in a sound and democratic way, whether outstanding individuals in all sectors can enter government leadership teams and the governance system through fair competition, whether the governing party exercises leadership over government affairs in accordance with the Constitution and the law, and whether the exercise of power is kept under effective checks and supervision] to ensure that China's political system is a democratic one that delivers, and these criteria underpin the path of socialism with Chinese characteristics. The Party takes the development of democracy as a matter of comprehensive and far-reaching significance. To ensure the people's principal position, improve the performance of the Party and the state, and arouse the people's enthusiasm, the Party has expanded socialist democracy, advanced electoral democracy, and developed consultative democracy.\n\nInstituted by the CPC, the system of people's congresses is China's fundamental political system. The Party fully solicits the views of the people and heeds their voices, and formulates its policies accordingly.\n\nIn a framework under which the Party exercises leadership over the law-making process, and the National People's Congress (NPC) and its Standing Committee exercise the power of legislation, the Party's core beliefs have, through proper legal procedures, been written into the Constitution, the law, and codes of conduct for all the people, state institutions, the armed forces, political parties, social organizations, enterprises and public institutions. The system of people's congresses ensures the CPC's leadership, the people's position as masters of the country, and law-based governance, and it gives full expression to the guidelines of the CPC, the will of the state, and the expectations of the people. This system has been further consolidated and developed since the 18th National Congress of the CPC. The mechanism to ensure that deputies to people's congresses engage with the people has been strengthened, enabling them to better perform their duties, and enabling the people's congresses and their standing committees to better play their roles.\n\nIn addition to practicing and improving the system of people's congresses, the CPC has led the people in establishing and developing a number of other political systems, including the system of multiparty cooperation and political consultation under the leadership of the CPC, the system of regional ethnic autonomy, and the system of community-level self-governance. These systems ensure that the people run their country.\n\nConsultative democracy is a distinctive feature of China's socialist democracy. It means consultation among political parties, people's congresses, government departments, committees of the Chinese People's Political Consultative Conference (CPPCC), people's organizations, communities, and social organizations. It has enriched democracy by expanding its forms and channels.\n\nThe system of regional ethnic autonomy provides an institutional base for all ethnic groups to run the country together. It fully protects the equal rights of all 56 ethnic groups and the power of self-governance in ethnic autonomous areas, underpins development in ethnic minority areas, and reinforces ethnic unity.\n\nUnder the system of community-level self-governance, urban and rural residents directly exercise their democratic right to manage community affairs and programs for public benefit. Community-level governance in China is a dynamic, harmonious and orderly process.\n\nThe system of democratic management by employees congresses in enterprises and public institutions plays an active role in protecting the lawful rights and interests of the employees. It ensures they run their own affairs, enhances vitality of these organizations, and helps them to flourish and prosper.\n\nThe CPC conducts whole-process democracy. This practice is supported by public consultation, under which public issues are discussed by all those involved to reach extensive consensus.\n\nUnder whole-process democracy, the people exercise their democratic rights through a variety of channels－in regular elections, and through involvement in decision-making on major public affairs that are important to the economy and people's lives. This democracy is conducted not only by means of elections, but also through democratic consultation, decision-making, management, scrutiny, and other mechanisms of governance. It is not only a political activity; it also relates to economic, cultural, social and other fields. Indeed, it has become an integral part of daily life and work.\n\nThe Chinese people enjoy extensive democratic rights. The days of isolation are gone in China, and democracy is the order of the day. The Chinese people now live in contentment, and Chinese society is full of vitality.\n\nDemocracy is a shared value; it is not something to be claimed by any one country. There is no fixed model of democracy; it comes in many forms. In judging whether a particular form of democracy works, one needs to see whether it is adapted to a country's history and culture, whether it conforms to its conditions, whether it can deliver political stability and social progress, whether it can improve people's lives, whether it can win public support, and whether it can contribute to advancing the progressive cause of humanity. Democracy as practiced in China is rooted in China's history and culture. It fits the country's conditions and enjoys popular support. The CPC is committed to developing socialist democracy with distinctive Chinese features. It will continue to enrich China's model of democracy and ensure its sound development.\n\n4. A Good Life for the People\n\nEverything the CPC has done in revolution, reconstruction and reform is designed to ensure a good life for the people. Over the past century, China has undergone tremendous changes turning itself from a poor and war-torn country into a dynamic and prosperous one. It is now the world's second largest economy, growing in composite strength and international standing. It has thriving cosmopolitan cities, beautiful and harmonious countryside, advanced infrastructure, a safe and convenient transport network, a dynamic market, and a stable and orderly society. Its people are leading a comfortable life to which they have aspired for several thousand years, and they are working towards common prosperity.\n\nThe people's lives have greatly improved. They have shaken off absolute poverty and achieved moderate prosperity in all respects. Their rights to existence and development are well protected, and they feel happier, safer and more secure. With a per capita gross national income surpassing US$10,000, China has joined the ranks of upper-middle income economies, and is on its way to become a high-income country. The urban-rural income gap is steadily shrinking, and China has a middle-income group of 400 million people, the biggest in the world.\n\nThe employment market in China is stable. At the end of 2020, almost 751 million people in China were in employment.\n\nChina has built the world's largest social security network, with basic medical insurance covering 1.3 billion people by the end of June 2021. During the same period, one billion people were covered by basic old-age insurance, 222 million by unemployment insurance, and 274 million by work-related injury insurance. The people have better access to childcare, education, employment, medical services, elderly care, housing, and social assistance.\n\nThe cultural sector is flourishing, and the Chinese people enjoy colorful and enriching cultural activities. China has done much to protect its environment; across the country there are more blue skies, lush mountains and lucid waters. China maintains long-term social harmony and stability, and its people live in peace and contentment in a country widely recognized as one of the safest in the world.\n\nThe mindset of the Chinese people has changed profoundly. They have strong faith in the path, theory, system and culture of Chinese socialism. They now view themselves as the equals of any other in the world. They celebrate the CPC, socialism, reform and opening up, the motherland, and the unity of all ethnic groups in China. Patriotism, reform, innovation, and hard work have taken root in their minds. Core Socialist Values [The Core Socialist Values: Prosperity, democracy, civility and harmony are values that underpin the Chinese nation; freedom, equality, justice and the rule of law are values that hold society together; patriotism, dedication, good faith and amity are values that underlie individual conduct] are practiced, and traditional Chinese culture is full of vitality. All of this fills Chinese society with positive energy and confidence.\n\nThe Chinese people value and uphold freedom. They enjoy true, comprehensive and extensive freedom. While pursuing their own individual freedoms, they also work to promote common prosperity, development, social harmony and stability. United as one, they face difficulties head-on, rise to challenges, and strive for success. They regard all the world's peoples as one big family, and wish peace and a better life for everyone.\n\nEnergetic, passionate young Chinese are dedicating themselves to the cause of the CPC and the people, and they are at the forefront in working to rejuvenate the Chinese nation.\n\nWhile China has achieved remarkable successes as a result of a dedicated effort made over many years, it is still in the primary stage of socialism and will long remain so. China is still the largest developing country in the world. There is still a long way to go before China can resolve the principal challenge it faces－the gap between unbalanced and inadequate development and the growing expectation of the people for a better life－and deliver prosperity to all its 1.4 billion people.\n\nOver the past hundred years, the CPC has won the heartfelt support of the people, not with rhetoric, but with actions and outcomes and by meeting repeated challenges. This support has never wavered since the Chinese people first chose the CPC to lead them. The Party and the people work together and share weal and woe, and there is an inseparable bond between them. No attempt to sever that bond will ever succeed, and any attempt to shake the people's faith in the Party's leadership is doomed to fail.\n\nII. Realizing the Ideals of the Party\n\nStruggle is a distinctive attribute of the CPC. In a complex domestic and international environment, China has encountered unprecedented difficulties and challenges in its revolution, reconstruction, and reform. Since it was founded a hundred years ago, the Party has never given up on the struggle, whatever hardships, existential trials, or bitter sacrifices it faced. These hundred years have seen the Party fight on, guided by Marxism, and buttressed by firm convictions, an enterprising spirit, and unyielding determination.\n\n1. Upholding Marxism\n\nMarxism is the single guiding ideology, the very soul of the CPC, and the banner under which it strives. Fundamentally, the strength of the Party and the strength of socialism with Chinese characteristics are attributable to the fact that Marxism works. The Party's history of struggle is a process of continuing to adapt Marxism to the Chinese context and to explore creative and innovative ideas.\n\nInscribing Marxism on its own banner. Marxism reveals the universal laws of the natural world, human society, and the human mind, pointing the direction for humanity and human civilization to progress. The communist and socialist ideals expounded in Marxism tally with Chinese cultural values such as a people-centered orientation, harmony, and unity in diversity. They are consistent with the dream pursued by noble and idealistic Chinese for generations－to build a strong and prosperous nation. And they accord with the aspiration of Chinese progressives, dating back to the Opium War, to rescue the nation from subjugation. A key feature of Marxism is that it not only defines the ideals of communism, but also specifies the ways and means by which they can be achieved.\n\nWhen Marxism was introduced to China, the founders of the CPC first reflected on it and conducted careful analysis, then gained hands-on experience, and finally chose to embrace it wholeheartedly. Since China's Communists chose Marxism, they have remained firm in upholding and developing it. Never have they wavered in their commitment, deviated from its goals, or abandoned it in favor of other options.\n\nUsing Marxism as a powerful ideological weapon to seek the truth, understand the world and its laws, and transform it, rather than applying rigid dogma. Respecting reality and combining with the people are the characteristics and strengths of the CPC.\n\nOver the past hundred years, the CPC has continued to adapt Marxism to the Chinese context and the needs of the times. Mao Zedong Thought, Deng Xiaoping Theory, the Theory of Three Represents, the Scientific Outlook on Development, and Xi Jinping Thought on Socialism with Chinese Characteristics for a New Era are the results. The Party has thus devised well-conceived theories for its own and the people's guidance, and made an enormous and original contribution to enriching Marxism.\n\nAt the fundamental level, the CPC's successes can be attributed to its mastery of powerful theoretical weapons to correctly understand, scientifically analyze, and effectively solve problems by applying the Marxist stance, viewpoint and methodology. Experience has proved that the CPC's choice of Marxism is correct. On the journey ahead, considering China's realities in contemporary times the Party will continue to adapt the basic tenets of Marxism to the best of China's traditional culture, and use Marxism to observe, understand, and steer the trends of our times in the 21st century.\n\n2. Firm Ideals and Convictions\n\nFrom the outset, the CPC has championed the cause of socialism and communism. Over the past hundred years, standing firm in its ideals and convictions, it has led the people to press forward towards these goals. It has established, upheld and developed socialism, upheld the principles of socialism with Chinese characteristics, and demonstrated the vitality and bright prospects of socialism. The Party has remained true to socialism, and socialism has proved its worth to China.\n\nRising through adversity and failures. In the years of revolutionary war, the CPC was repeatedly confronted with difficulties and setbacks, to the extent that its very survival was threatened. After the failure of the Great Revolution (1924-1927), the membership of the Party fell from around 60,000 to just over 10,000. After defeat in the fifth encirclement and suppression campaign by the KMT in 1934, [This refers to the Central Red Army's fight against the fifth encirclement and suppression campaign launched by the KMT troops in the Central Revolutionary Base Area from September 1933 to October 1934. From 1930 to 1934, the KMT troops launched five large-scale onslaughts against the Central Revolutionary Base Area headquartered in Ruijin, Jiangxi Province. The Red Army overcame the KMT forces in the first four campaigns, but after defeat in the fifth campaign, it made a strategic withdrawal.] the Party and the Red Army were seriously weakened. The Battle of Xiangjiang soon after the beginning of the Long March[This was the strategic retreat of the main Red Army forces under the leadership of the CPC, and the trek from the Soviet Area south of the Yangtze River to the Shaanxi-Gansu border area during the period from October 1934 to October 1936, marking a great transition from defeat to victory for the Party and the Chinese revolution.] cost the Central Red Army more than 50,000 of its 86,000 troops. But for all that the situation was bleak, the CPC remained unshaken in its convictions. It shook off its pursuers, rose above adversity, and emerged stronger from the setbacks.\n\nAfter the founding of the PRC, the country faced testing military and economic challenges and hostility from abroad. Led by the CPC, and fearless of hardship and death, the people overcame these challenges. A new socialist China soon stood firm in the East.\n\nFrom the late 1980s to early 1990s, when the tide of world socialism was on the ebb, the CPC led the people to press forward on the path of Chinese socialism, heedless of all obstacles.\n\nIn the new era, faced with the formidable tasks of reform, development and stability, and confronted by an unpromising external environment, the Party has led the people to continue the great historic struggle and to champion the cause of socialism with Chinese characteristics.\n\nDifficulties, failures and setbacks in the past hundred years have never prevented the CPC from forging ahead; they have only made it stronger and helped it mature. At critical historical junctures and in times of crisis, the Party has stood firm in ideals and convictions, rising undaunted to face challenges. This has demonstrated its strength, increased the people's trust and confidence, transformed its own prospects and those of the country, and advanced the cause of socialism.\n\nFighting in both favorable and unfavorable circumstances. After securing victory in its military campaigns, the CPC maintained its fighting spirit and strove to avoid complacency. After becoming the governing party of China, it continued to remain modest and prudent, never arrogant or impetuous. In leading reconstruction in the cities in peace time, it preserved the style of plain living and hard struggle and never fell victim to the desire for creature comforts. In the process of reform and opening up, the CPC endeavors to guard against the erosive influence of feudalist and capitalist decadence.\n\nEntering the new era, the CPC has never allowed itself to be carried away by the successes the Party and the state have achieved. It has warned all its members that they must never surrender to complacency or sclerotic thinking, never falter, never waver; rather, they must remain alert to dangers in times of peace and keep fighting.\n\nOver the past hundred years the Party has never rested on its laurels, slackened its efforts, or allowed flattery and praise to dilute its spirit and will to fight.\n\nBeing firmly grounded while aiming high for the future. Every generation of Party members has fulfilled its respective missions and kept pressing forward. The ideals of communism can only be realized by the Party based on fully developed and highly advanced socialism. Communists in China believe that if they keep fighting for this with sufficient effort over generations it can be achieved. In the battle to realize national rejuvenation, the Party and the people will pass on the torch from one generation to the next, with each generation fulfilling its duties for the benefit of the next.\n\nForging a fighting spirit in hard work and working hard to keep that spirit. Carrying forward its founding spirit, the CPC has fought hard and persevered. It has developed a set of inspiring principles which are manifested in the ranks of its revolutionary martyrs defiant in the face of death, its hardworking heroes, and its selfless and devoted models. This invaluable spirit has been distilled into the lifeblood of the Chinese nation, boosting the Chinese people's morale, and creating longer, fuller and stronger support for the rejuvenation of the Chinese nation. Over the past hundred years, led by the CPC, the Chinese people have changed the face of the country through their arduous efforts, and more importantly, reshaped China's national psyche.\n\n3. Breaking New Ground\n\nChina's revolution, reconstruction and reform are unprecedented undertakings, with no previous examples to serve as a guide. Facing new situations and new problems on the way forward, and employing indomitable courage and determination, the CPC has succeeded in blazing a new trail from the unknown to the realms of freedom. All its endeavors have advanced the cause of socialism in China.\n\nRecognizing the prevailing trends in the world, seizing and making the most of historic opportunities. There is an essential logic to the progress of human history. Over the past hundred years, the CPC has developed with this logic and kept pace with the trends of the times, constantly adjusting its strategies and policies in accordance with changing circumstances.\n\nThe founding of the CPC, the founding of a socialist people's republic, and the launch of reform and opening up all followed underlying global trends. Based on its belief that peace and development were the themes of the times, the CPC pressed ahead with its plans for reform, opening up and modernization. It seized the opportunity of rapid advances in science and technology around the world, and applied the important proposition that \"science and technology constitute a primary productive force\". It mobilized the resources of the whole country in a series of key national science and technology research and development programs such as the 863 Program and the 973 Program. [The codename 863 refers to the National High-tech R&D Program implemented in accordance with a guideline issued by the CPC Central Committee and the State Council on November 18, 1986, while that of 973 is for the National Key Basic Research Program implemented in accordance with a decision by the National Science, Technology and Education Leading Group on June 4, 1997.] All of this strengthened China's capacity for original innovation and resulted in significant progress in high-tech and key industries.\n\nThe CPC followed the trend of economic globalization and initiated a set of major reform and opening-up measures, for example, creating special economic zones, opening up Shanghai Pudong New Area, implementing the strategies of \"bringing in\" and \"going global\", and acceding to the World Trade Organization, all of which helped the Chinese economy to integrate with the international economy.\n\nAt the turn of the century, the CPC seized the first two decades as an important period of strategic opportunity to focus on development and promote more rapid growth.\n\nIn the new era, the CPC has implemented the strategy of national rejuvenation within the context of global changes of a scale unseen in a century. It has judged that \"China remains in an important period of strategic opportunity for development\", and that \"both opportunities and challenges are unprecedented in scale, with more opportunities than challenges in general\".\n\nTo tap into the trends of peace, cooperation, multi-polarity, economic globalization, and democracy in international relations, the Party places greater emphasis on the quality of growth. To this end, it has introduced and is implementing a new development philosophy and a new development dynamic as the country enters a new development stage. In external relations, the CPC pursues high-standard opening up and promotes win-win cooperation with more countries in more areas, on a larger scale, and in greater depth. The CPC is willing to contribute more to the world while promoting China's own development.\n\nFollowing an independent path. To carry out revolution, reconstruction and reform in a poor and backward country with a large population, it is fundamental to choose the right path.\n\nDuring the New Democratic Revolution, the CPC initially opted to follow the Soviet example of insurrection in key cities. But that proved unsuccessful. It then reviewed the lessons learned, summarized the experience gained, and embarked on the correct path of encircling the cities from the countryside and seizing state power with military force.\n\nAfter the founding of the People's Republic, the CPC applied itself to learning from the Soviet Union. Encountering problems with the Soviet model, it began to explore its own path for building socialism. Since the beginning of reform and opening up, it has led the people in identifying, upholding, broadening, and committing to the path best suited to China's actual conditions－socialism with Chinese characteristics.\n\nIn economic development, the Party has always adhered to the principle of self-reliance. To ensure that robust development continues amid mounting instability and uncertainties in the international environment, the Party has made the major strategic decision to accelerate the fostering of a double development dynamic, with the domestic economy and international engagement reinforcing each other, and the former as the mainstay.\n\nIn the field of science and technology, the Party has led the people in independent and self-reliant development. With their own strength, the Chinese people have put in place a complete and independent system of academic disciplines and a comprehensive program of scientific research, paving the way for independent innovation with Chinese characteristics.\n\nAll of this has carried forward the country's scientific and technological strength and capacity for innovation in leaps and bounds. In the early days of the People's Republic, even matches and iron nails had to be imported. China now leads the world in quantum communication, artificial intelligence and 5G technology. Its Shenzhou manned spacecraft and Tiangong space lab are orbiting the earth. The rover Zhurong has landed on Mars and is engaged in scientific exploration. Its manned submersible, Jiaolong, dived to the deep sea. All of these serve to demonstrate how China has significantly improved its independent scientific and technological capabilities.\n\nIn the process of socialist modernization, the Party has led the people in realizing coordinated material, political, cultural, social and eco-environmental progress, pioneering a new and distinctively Chinese path to modernization, creating a new model for human progress, and refuting the myth that modernization can be achieved only by following the capitalist model.\n\nOne of the basic reasons for the Party's success is its adherence to the principles of independence and self-reliance. It follows its own path in managing China's affairs in accordance with the country's own realities and characteristics. The Chinese people have the courage, confidence, and ability to manage their own affairs well.\n\nEmancipating the mind, seeking truth from facts and moving forward with unrelenting courage. In all of its endeavors in revolution, reconstruction and reform, the CPC has always proceeded from reality rather than placing its faith in books or established authority. It has constantly explored new paths, free from hidebound restrictions and proscriptive models.\n\nIn its long-term leadership of economic development, the Party has adopted the basic principles of Marxist political economics and applied them in China's realities, shifting from a model of pure public ownership to a model where public ownership plays the dominant role alongside economic entities under diverse forms of ownership. It is committed to consolidating and developing the public sector of the economy, and to encouraging, supporting, and guiding the non-public sector of the economy. The economic system has been reformed from a traditional planned economy to a socialist market economy, so that the market can play a decisive rather than a supportive role in resource allocation, while the government can fulfill its role better. This has ensured that the lifelines of the Chinese economy remain firmly in the hands of the Party and the people, and that economic development serves the interests of the people and the country. Market entities can be more innovative, and the productive forces have been unleashed and allowed to develop.\n\nSince the 18th National Congress of the CPC, China's reform has entered uncharted waters and encountered new problems. The Party has shown tremendous political courage, enacting more than 2,400 measures to remove deep-rooted obstacles, and promoting further comprehensive reform. This has achieved decisive results in key areas and boosted the driving forces of development. In pursuing reform, the Party encourages bold experiments and innovation while making sure that progress continues in the right direction. The basis of reform has always been upholding and improving socialism with Chinese characteristics and modernizing the country's system and capacity for governance. Pressing ahead with reform and development while maintaining the stability of the country, it has rejected both the old and rigid closed-door policy, and any attempt to abandon socialism in favor of some erroneous path.\n\nUnderstanding, grasping and following the laws of development. The ability to grasp and follow the objective laws of development is an important skill for a progressive Marxist party. The CPC has continued to expand its understanding of governance by a communist party, the development of socialism, and the evolution of human society, and to apply them in practice as a guide for action.\n\nIn developing socialism, the Party has constantly asked and answered a series of key questions, such as:\n\n・\"What is socialism?\"\n\n・\"How should we build socialism?\"\n\n・\"What kind of a political party should the CPC be?\"\n\n・\"How should we build the CPC?\"\n\n・\"What kind of development should we pursue?\"\n\n・\"How should we pursue this development?\"\n\n・\"What is socialism with Chinese characteristics in the new era?\"\n\n・ \"How should we uphold and develop this socialism?\"\n\nIt has given a series of new answers that have enriched and developed scientific socialism, and gained a much deeper understanding of the essence and nature of socialism, such as:\n\n・\"Poverty is not socialism. Development that is too slow is not socialism, either.\"\n\n・\"The nature of socialism is to release and develop the productive forces, eliminate exploitation and polarization, and achieve common prosperity.\"\n\n・\"Achieving common prosperity is the essential requirement of socialism.\"\n\nThe CPC has also gained a much deeper understanding of the process of building a socialist system, from establishing the basic socialist system in the early days of the PRC, through creating socialism with Chinese characteristics after the introduction of the reform and opening-up policy, to upholding and improving socialism with Chinese characteristics since the 18th CPC National Congress. Socialism with Chinese characteristics has matured with the completion of an overall framework of systems for state governance.\n\nThe CPC has also come to a deeper understanding of the laws of economic and social development, as reflected by its shift from \"fast and sound growth\" to \"sound and fast growth\", from \"economic growth\" to \"economic development\", from \"high-speed growth\" to \"high-quality development\", from \"accelerating development\" to \"equal emphasis on development and security\", from \"the vision of comprehensive, coordinated and sustainable development\" to \"the vision of innovation-based, coordinated, green, open and shared development\". Since its 18th National Congress, the CPC has initiated the Five-sphere Integrated Plan, the Four-pronged Comprehensive Strategy, the Eight Clarifications [The Eight Clarifications: ・that the overarching task of upholding and developing socialism with Chinese characteristics is to realize socialist modernization and national rejuvenation, and on the basis of completing the building of a moderately prosperous society in all respects, a two-step approach should be taken to build China into a great modern socialist country that is prosperous, strong, democratic, culturally advanced, harmonious, and beautiful by the middle of the 21st century.・that the principal challenge facing Chinese society in the new era is the gap between unbalanced and inadequate development and the growing expectation of the people for a better life, which requires further commitment to the people-centered philosophy of development, well-rounded human development, and common prosperity for everyone. ・that the overall plan for building socialism with Chinese characteristics is the Five-sphere Integrated Plan, and the overall strategy is the Four-pronged Comprehensive Strategy, with an emphasis on stronger confidence in the path, theory, system and culture of socialism with Chinese characteristics.・that the overall goal of in-depth reform in every field is to improve and develop the system of socialism with Chinese characteristics and modernize China's system and capacity for governance.・that the overall goal of comprehensively advancing law-based governance is to establish a system of socialist rule of law with Chinese characteristics and build a country of socialist rule of law.・that the Party's goal of building a strong military in the new era is to build the armed forces of the people into world-class forces that obey the Party's command, can fight and win, and maintain excellent conduct. ・that major-country diplomacy with Chinese characteristics aims to foster a new type of international relations and build a global community of shared future.・that the defining feature of socialism with Chinese characteristics is the leadership of the CPC; the greatest strength of the system of socialism with Chinese characteristics is the leadership of the CPC; the Party is the highest force for political leadership, setting forth the general requirements for strengthening the Party in the new era and underlining the importance of reinforcing the Party's political foundations.] and the Fourteen Imperatives, [The Fourteen Imperatives are: ・ensuring Party leadership over all endeavors, ・people-centered development, ・comprehensive and in-depth reform, ・a new vision for development, ・the people running the country, ・law-based governance, ・core socialist values, ・improvement of the people's lives through development, ・harmony between humanity and nature, ・a holistic approach to national security, ・absolute Party leadership over the people's forces, ・the principle of One Country, Two Systems for national reunification, ・the building of a global community of shared future, ・the full and rigorous implementation of the Party's discipline. The Fourteen Imperatives form the fundamental guideline that underpins the endeavors to uphold and develop socialism with Chinese characteristics in the new era.] which exemplify the Party's new understanding of the nature of governance by a communist party, the development of socialism, and the evolution of human society.\n\nSocialism can solve problems that other social systems cannot, and can achieve sustained, well-rounded human development and common prosperity. After several decades, socialism in China is still at the primary stage. The Party's understanding and practical experience of socialism with Chinese characteristics is still very limited, with many more questions to answer and many more problems to solve. The Party will continue to explore how best to advance socialism with Chinese characteristics in the new era by building a deeper understanding of its nature and laws.\n\n4. Defusing Risks and Overcoming Challenges\n\nChina has carried out its revolution, reconstruction and reform against a backdrop of both conventional and exceptional risks and challenges, from both inside and outside the Party, from both within China and abroad, and from both human society and nature. The CPC has led the people in defusing these risks and meeting these challenges with courage, confidence and resilience, while promoting the cause of socialism. It has secured and consolidated its position as the governing party, guaranteed national security, and ensured continuous and consistent development.\n\nThe Party is always ready to protect against potential dangers even in times of peace. Founded in years of trial and tribulation and maturing in adversity, the CPC always keeps in mind the ancient wisdom that \"One should be mindful of potential danger in times of peace, the risk of downfall in times of rise, and potential chaos in times of stability.\"\n\nIn the years of revolutionary war, the CPC maintained a high level of vigilance during a life-and-death struggle, and grew in size and strength despite being menaced by formidable enemies.\n\nDuring reform and opening up, faced with frequent social conflicts and disputes, and major setbacks to world socialism, the CPC made it a priority to increase its ability to fend off threats, and successfully dealt with various risks and challenges.\n\nAfter its 18th National Congress, the CPC was fully aware of the major changes in the domestic and international environment. One of its major principles of governance is to be always on guard against potential dangers in times of peace. It has made national security its top priority in upholding and developing socialism with Chinese characteristics. Always alert to the worst possible scenarios, the Party adopts proactive strategies and strives for the best results.\n\nIn every historical period, the CPC has remained vigilant and clearheaded about the situation, seizing the initiative on every occasion and ensuring success in defusing risks and overcoming challenges.\n\nThe Party meets major risks and challenges head-on. It never hesitates in taking resolute action to address risks and challenges that threaten its position as the governing party, or endanger the stability of state power, the core interests of the country, the fundamental interests of the people, or the rejuvenation of the Chinese nation.\n\nShortly after the founding of the PRC, in the face of threats and provocation by American imperialism, the CPC had the courage to resist US aggression and aid Korea, in defense of the motherland and at the cost of its own economic development. Victory in this war foiled the aggressors' attempt to suffocate the new-born PRC, and established a firm foothold for the country.\n\nAfter the launch of reform and opening up, the Party led the people through the political turbulence in 1989, the Asian financial crisis in 1997, the global financial crisis in 2008, and a succession of unprecedented natural disasters. It emerged victorious from the fight against the SARS epidemic in 2002 and the Wenchuan earthquake in 2008. It adopted resolute and lawful measures to quell the riots, robbery, arson and vandalism in Lhasa and Urumqi. It also resisted attempts to isolate, suppress and contain China by external political forces.\n\nSince 2012, faced with a sensitive and volatile international situation, and challenging tasks related to domestic reform, development and stability, the Party has placed equal emphasis on development and security, pursued a holistic approach to national security, and led the people in an effective response to major risks, challenges, obstacles and conflicts by exploring new opportunities and breaking new ground.\n\nIt has promoted supply-side reform to stave off economic risks. It has implemented effective countermeasures in the economic and trade friction provoked by the US. It has won a strategic victory in the battle against the Covid-19 pandemic. It has taken a series of resolute measures to restore order in Hong Kong and ensure a turn for the better in the region. All of these actions have contributed to social stability in China and sound and sustained economic development.\n\nThe rejuvenation of the Chinese nation will not be easily achieved. It cannot be achieved merely by beating drums and clanging gongs. There will be all kinds of foreseeable and unforeseeable difficulties on the way forward. The CPC is a major political party that has accumulated rich experience in the long-term struggle over the last hundred years, which has enabled it to withstand risks and address complex issues. No matter the difficulties, the Party will lead the people to final victory.\n\nOn its centennial journey, the CPC has tempered its character with the courage to vanquish formidable enemies, defuse risks, and overcome challenges. This has become the Party's defining quality. All of its achievements are the results of the hard work of generations of Party members, and the base on which the cause will continue to prosper. The success of the Party in the past equips it to face the future with full confidence.\n\nIII. Robust Leadership and Strong Governance\n\nChina is a huge country with a large population and complex national conditions. In order to achieve independence, development, and prosperity it must have robust and decisive leadership. It is the CPC's solidarity and unity, its firm leadership, and its strong governance capability that have rallied and united hundreds of millions of the Chinese people and overcome a multitude of difficulties and crises.\n\n1. A Strong Central Committee\n\nThe CPC is a mature Marxist political party organized in accordance with the principle of democratic centralism. [This is a principle that combines centralism built on the basis of democracy with democracy under centralized guidance. Democratic centralism is the Party's fundamental organizational principle and leadership system.] Upholding the authority of the Central Committee and its centralized leadership has always been one of the Party's fundamental operational principles. Democratic centralism involves Party members deferring to Party organizations, the minority deferring to the majority, lower-level Party organizations deferring to higher-level organizations, and the whole Party deferring to the Central Committee. This and upholding the authority of the Central Committee and its centralized leadership are strengths the Party has built from valuable experience gained during revolution, reconstruction and reform.\n\nUpholding the Central Committee's authority and its centralized leadership has led to smooth and steady progress in China, and ensures the CPC's position as the governing party and the country's long-term stability.\n\nThe first generation of the CPC central collective leadership with Mao Zedong at the core united the whole Party and the people and led them on the revolutionary path, using rural areas to encircle the cities and seizing state power with military force. It was under its centralized leadership that the Party and the people completed the New Democratic Revolution, founded the People's Republic of China, succeeded in socialist revolution, established socialism as the country's basic system, and advanced socialist development. All of this led to success in the broadest and most profound social transformation in the history of the Chinese nation. It also laid down the political and institutional groundwork for all future progress and provided invaluable experience, a theoretical base, and the material conditions for Chinese socialism in the new historical period.\n\nAfter the Third Plenary Session of the 11th CPC Central Committee in 1978, the second generation of the Party's central collective leadership with Deng Xiaoping at the core led the Party and the people in a historic shift of focus to economic development and reform and opening up. Based on its keen understanding of the essence of socialism, the Party established its basic line for the primary stage of socialism, made it clear that China must define its own approach in building socialism, and provided answers to a series of basic questions. This marked the creation of socialism with Chinese characteristics.\n\nAfter the Fourth Plenary Session of the 13th CPC Central Committee in 1989, the third generation of the Party's central collective leadership with Jiang Zemin at the core led the Party and the people in defending socialism with Chinese characteristics in a complex domestic and international situation and in the face of serious setbacks experienced by socialism worldwide. It established the objectives and framework of reform for developing the socialist market economy, and put in place basic economic and distribution systems in the primary stage of socialism, advancing Chinese socialism into the 21st century.\n\nAfter the 16th CPC National Congress in 2002, the Central Committee with Hu Jintao as general secretary led the Party and the people in promoting innovation in theory, practice, and systems in the course of building a moderately prosperous society in all respects, with a focus on people-centered, all-round, coordinated, and sustainable development, and upholding and building socialism with Chinese characteristics, at a new historical point.\n\nSince the 18th CPC National Congress in 2012, the Central Committee with Xi Jinping at the core has led the Party and the people in pursuing a great struggle, a great project, a great cause, and a great dream, upholding and improving the Party's overall leadership, and implementing the Five-sphere Integrated Plan and the Four-pronged Comprehensive Strategy. The Party has made greater efforts to improve Chinese socialism, modernize the system and capacity for governing the country, and uphold socialism with Chinese characteristics. All of this has prompted historic shifts and led to historic achievements in the cause of the Party and the country, ushering Chinese socialism into a new era. The prospects of national rejuvenation are ever brighter.\n\nSince 2012, the CPC Central Committee has taken a series of effective measures to strengthen the overall leadership by the Party and uphold the authority of the Central Committee and its centralized leadership. The central leadership has emphasized that:\n\n(1) The Party exercises leadership over all areas of endeavor across the country and is the highest force for political leadership;\n\n(2) Upholding overall Party leadership means first and foremost upholding the authority of the Central Committee and its centralized leadership, which is the highest principle of the Party's leadership and the fundamental political discipline and rule;\n\n(3) It is important to strengthen the consciousness of the need to maintain political commitment, think in terms of the broader picture, follow the core leadership of the CPC Central Committee, and act in accordance with its requirements; to enhance confidence in the path, theory, system and culture of Chinese socialism; and to resolutely uphold General Secretary Xi Jinping's core position in the CPC Central Committee and in the Party as a whole.\n\nThe 19th CPC National Congress in 2017 emphasized: \"Leadership by the CPC is the defining feature of Chinese socialism and the greatest strength of this system. The Party is the highest force for political leadership.\" The congress confirmed this principle as a significant element of Xi Jinping Thought on Socialism with Chinese Characteristics for a New Era, and this major political principle has been enshrined in the CPC Constitution. In 2018 the 13th National People's Congress adopted at its first session an amendment to the Constitution of the People's Republic of China. In addition to providing for the CPC's leading position in its Preamble, the amended Constitution explicitly stipulates in its General Principles that leadership by the Party is the defining feature of socialism with Chinese characteristics.\n\nTo uphold the CPC Central Committee's authority and its centralized leadership through concrete actions, the CPC has improved its leadership system and its working mechanism. The Central Committee has issued a series of regulations to this end:\n\n・ensuring Party organizations and initiatives cover all areas;\n\n・improving the system by which the Central Committee exercises leadership over major tasks;\n\n・strengthening the roles and functions of relevant Central Committee offices in decision-making, deliberation and coordination, and improving the mechanism by which the Central Committee's major decisions are implemented;\n\n・strictly enforcing the system by which all important issues are promptly reported;\n\n・developing practical measures and making institutional arrangements to implement the principle of upholding the Central Committee's authority and its centralized leadership.\n\nIn recent years, the Standing Committee of the Political Bureau of the CPC Central Committee has held dedicated meetings to hear annual work reports of CPC leadership groups of the NPC Standing Committee, the State Council, the CPPCC National Committee, the Supreme People's Court, the Supreme People's Procuratorate, and the report of the CPC Central Committee Secretariat. Each member of the Political Bureau has submitted a written work report to the Central Committee and General Secretary Xi Jinping every year. This has been one of the institutional arrangements for strengthening and upholding the Central Committee's centralized leadership.\n\nTo uphold the Central Committee's authority and its centralized leadership, a robust leadership core is the top priority. During the New Democratic Revolution, it was at the Zunyi Conference in 1935 that Mao Zedong was confirmed as the de facto leader of the Party Central Committee and the Red Army, and the Party's first central collective leadership with Mao Zedong at the core took shape. This move circumvented a serious threat to China's revolution and resulted in positive progress. Since the 18th CPC National Congress, with Xi Jinping at the core of the Central Committee, the Party, the country, the people, the military, and the whole Chinese nation have made unprecedented headway.\n\nOver the past hundred years since its founding in 1921, the CPC has been able to build consensus among its members on the way forward and take concerted actions; the fundamental reason for this is its robust leadership core, which has played a unique and irreplaceable role in leading the Party to grow stronger despite all the difficulties it has encountered.\n\nBoth history and reality have shown to us that only with a firm and effective leadership core can the Central Committee exert authority and the Party remain strong.\n\nUpholding the leadership core of the CPC in no way involves the creation of any kind of personality cult－something the CPC has resolutely opposed ever since it was first founded. The Party's Constitution explicitly stipulates that \"The Party proscribes all forms of personality cult.\" The Party leadership core never wields unlimited power or engages in decision-making at will; instead, it takes on heavy responsibilities in steering the Party and the country. The CPC is organized on the basis of democratic centralism, so its leadership core functions by that principle, observes the system of collective leadership, and acts within the scope of the country's Constitution and the law. The Party leadership core does not emerge through entitlement; it is not self-proclaimed. It comes into being through long-term experience under sound leadership and as a common choice of the whole Party and the whole country.\n\nChina's history, which dates back thousands of years, and its revolution, reconstruction and reform have fully demonstrated that only with a robust centralized authority to maintain unity of the whole country and rally the people can the nation achieve long-term peace, stability, and prosperity, and the people work and live in contentment. Centralized leadership by the Party serves the best interests of the Chinese people, suits China's national conditions, and conforms to traditional Chinese culture. This is an invaluable understanding that the Chinese people have gained through years of CPC leadership. There is a common purpose behind the conscious commitment of the Party and the Chinese people to uphold the authority of the Central Committee and its centralized leadership, and to protect and be loyal to the leadership core.\n\n2. Sound Guidelines and Strategies\n\nRobust leadership comes from sound leadership; sound leadership comes from rational policymaking. For a party as large as the CPC, policymaking is its lifeline. Over the past hundred years, at every historic juncture, the CPC has been able to analyze the situation from an overall, objective and forward-looking perspective, and set forth practical goals, tasks, policies and roadmaps. It is the Party's sound guidelines that have enabled it to carry out its work in a well-organized and systematic manner.\n\nThe CPC is adept at formulating sound guidelines, principles and policies. At different historical stages, the Party has succeeded in devising the right policies based on an accurate analysis of domestic and international developments.\n\nIn the early years of the CPC, at its Second National Congress in 1922, the Party set forth its primary platform of achieving national independence and establishing a democratic republic, and its ultimate goal of realizing socialism and communism, pointing out the direction for a two-step Chinese revolution.\n\nDuring the War of Resistance Against Japanese Aggression, the Party identified the correct path towards ultimate success, adopting the strategy of total resistance and protracted war.\n\nDuring the Socialist Revolution, the Party devised the general guideline for the transition period, [In 1953, the CPC Central Committee adopted the Party's general guideline for the transition period from the founding of the PRC in 1949 to the completion of socialist transformation. The master plan was to realize socialist industrialization and transformation of agriculture, craft industries, and capitalist industry and commerce step by step over a considerable period of time.]mapping out the road towards socialism.\n\nAfter the adoption of reform and opening up, at its 13th National Congress in 1987, the Party formulated the basic guidelines for the primary stage of socialism－One Central Task, Two Basic Points [In 1987, at its 13th National Congress, the CPC specified its basic guidelines for building socialism with Chinese characteristics in the primary stage－to unite with and lead the people of all ethnic groups, take economic development as the central task, uphold the Four Cardinal Principles (the socialist road, the people's democratic dictatorship, the CPC's leadership, and Marxism-Leninism and Mao Zedong Thought), and uphold the policy of reform and opening up, be self-reliant, hard working and enterprising, to build China into a prosperous, strong, democratic, culturally advanced and modern socialist country.]－to keep socialism with Chinese characteristics progressing on the right track.\n\nAfter its 18th National Congress, in accordance with its basic theories, guidelines and policies, the Party specified the measures for upholding and developing Chinese socialism in the new era, proposing the Five-sphere Integrated Plan for coordinating economic, political, cultural, social and eco-environmental progress, and the Four-pronged Comprehensive Strategy for achieving moderate prosperity, furthering reform, advancing the rule of law and strengthening Party self-governance.\n\nIt is due to sound policymaking that the great cause of the CPC has remained on the right course, the CPC has rational guidelines to follow, the Chinese people have been able to enjoy tangible benefits, and the entire Chinese nation has forged a strong synergy to pursue shared dreams and aspirations.\n\nThe CPC is adept at formulating time-phased development goals and strategies. To achieve its long-range goals, the Party has adopted progressive tactics－defining time-phased objectives and roadmaps and achieving successes in steps.\n\nIn the 1960s, after the Socialist Revolution had been completed and initial success in socialist development had been made, the Party set the goal of achieving the Four Modernizations－of industry, agriculture, national defense, and science and technology－by the end of the 20th century, and to this end devised a Two-stage Plan on Economic Development. [In the 1960s, the CPC Central Committee issued a Two-stage Plan on Economic Development, effective since 1966, the first year of the Third Five-year Plan (1966-1970) period: The first stage was to build an independent and relatively comprehensive industrial and economic system by 1980; and the second stage was to achieve modernization of agriculture, industry, national defense, and science and technology by the end of the 20th century, bringing China to the forefront of the global economy.]\n\nIn the early stages of reform and opening up, the Party set the goal of providing a relatively comfortable life for the people by the end of the 20th century.\n\nIn the mid-1980s, the Party formulated a Three-step Strategy for Economic Development[In 1987, at its 13th National Congress, the CPC put forward a Three-step Strategy for Economic Development: The first step was to double the 1980 GNP by the end of the 1980s, to ensure the people have adequate food and clothing; the second step was to quadruple the 1980 GNP by the end of the 20th century, to ensure the people live a relatively comfortable life; and the third step was to increase the per capita GNP to the level of moderately developed countries by the mid-21st century, to ensure the people live a well-off life and basically achieve modernization.] to meet this goal.\n\nIn the mid-1990s, the Party proposed a New Three-step Strategy for Economic Development [In 1997, at its 15th National Congress, the CPC proposed a New Three-step Strategy for Economic Development: The first step was to double the 2000 GNP by 2010, to ensure the people live a better-off life and form a relatively complete system of socialist market economy; the second step was to achieve greater economic growth and establish more complete systems and institutions by 2020; and the third step was to realize basic modernization and build China into a prosperous, strong, democratic and culturally advanced socialist country by the mid-21st century, when the PRC would celebrate its centenary in 2049.] to meet this goal.\n\nEntering the new century, the Party proposed to build a well-off society of a higher standard in an all-round way to the benefit of well over one billion people in the first two decades of the 21st century.\n\nIn 2012, at its 18th National Congress, the Party set the goal of achieving moderate prosperity in all respects by 2021 when the CPC would celebrate its centenary.\n\nIn 2017, at its 19th National Congress, the Party set the goals of building on moderate prosperity in all respects to realize basic socialist modernization by 2035, and turning China into a strong, prosperous and modern socialist country by the mid-21st century.\n\nThe CPC has worked to see that the above goals and plans remain consistent, but are always adaptable to changing realities and new developments.\n\nCentralized leadership by the Party is one of China's political strengths. It enables the Party to formulate time-phased objectives based on long-range plans. It makes it possible to balance overall with particular interests, and long-term with immediate interests, to forge unity among all social forces to achieve common goals, and to ensure consistency in the implementation of state laws and policies. A step-by-step approach to policymaking has for many years brought China ever closer to the goals of socialist modernization.\n\nThe CPC is adept at spearheading development and overcoming challenges through systematic planning. The mechanism of Five-year Plans on National Economic and Social Development has proven successful. Five years is an appropriate time span to ensure consistency in policymaking and to plan and accomplish major programs and projects. Since the implementation of the First Five-year Plan (1953-1957), the CPC has introduced a total of 14 such plans, with the 14th Five-year Plan (2021-2025) now under way.\n\nIn the 1990s, the Party launched a mechanism of Ten-year Outline Programs to anticipate general trends of economic development in the next decade or the foreseeable future. The purpose is to set long-range goals, provide a framework for the Five-year Plans, and make the plans more future-oriented. In preparing Five-year Plans, the Party conducts in-depth research and many rounds of extensive consultations.\n\nTo implement its time-phased plans and programs, a system of national planning guided by the country's overall development strategies has been established. This system divides overall goals into sub-goals in different categories and at various levels to ensure coordinated nationwide development.\n\nThe system has expanded from social and economic fields to other areas of state governance. With proactive plans and feasible measures, the Party has succeeded in eliminating both \"grand words and no concrete action\" on long-range goals, and blinkered carthorses feverishly dragging their loads with no real idea of where they are heading.\n\nThe CPC is adept at conducting pilot programs before launching nationwide reform measures. In addressing issues vital to the economy, development and people's wellbeing, the Party opposes both conservative thinking and impetuous actions, preferring to seek practical, balanced and steady progress while encouraging bold experiments and breakthroughs. Confirming long-term development goals and implementing related policies is always preceded by small-scale pilot programs. Within the policy framework of the central government, regional pilot programs are conducted to work out specific methods, through testing, modifying and then wider application, for the implementation of a particular national policy. These specific methods, if successful, will be gradually replicated by other localities.\n\nThe Party's reform initiatives are implemented through national legislation so as to ensure their legal basis and assist their smooth and effective application. The Party attaches great importance to the rule of law and considers it a guarantee for consolidating the foundations of the Party's governance, meeting people's expectations, and maintaining long-term development. Successful reform measures are codified into state laws and policies in a timely manner.\n\nTo mitigate the risks of any social instability or other problems that might arise from the ill-judged nationwide rollout of a pilot program, the Party conducts timely analysis of the results of the pilot and makes the appropriate policy adjustments.\n\nThe Party has launched a series of major reform initiatives through pilot programs, including:\n\n・special economic zones,\n\n・China (Shanghai) Pilot Free Trade Zone,\n\n・Xiong'an New Area,\n\n・Shenzhen Pilot Demonstration Zone for Chinese Socialism,\n\n・Pudong Leading Pilot Zone for Socialist Modernization Through High-level Reform and Opening Up,\n\n・Zhejiang Demonstration Zone for Common Prosperity Through High-quality Development.\n\nThe pilot approach has ensured that vigorous reform can make steady progress. It has made national policies more creative and adaptable, and facilitated positive interaction between the policymaking of central government and the innovative initiatives of local government.\n\nThrough constant experiment and practice, China has created a positive cycle－promoting reform through pilot programs, propelling development through reform, maintaining stability through development, and winning public support for reform by sharing the fruits of development achievements with the people.\n\n3. Effective Implementation of Decisions and Plans\n\nIf there were no strong organizational support and disciplinary restraints, the CPC would become fragmented and remain weak in spite of its massive size. Over the past hundred years, the Party has been consistent in building its organization, tightening its discipline and strengthening the rule of law. It has united tens of millions of Party members and organized hundreds of millions of Chinese people, thereby ensuring that its decisions and plans are implemented in a timely, resolute and forceful manner.\n\nThe CPC has built an organizational system featuring unimpeded communication and effective policy implementation at all levels. Prior to and during the creation of the CPC, its founders aimed to establish a strong and tightly-knit organization. Over the years, the Party has established a sound and complete structure consisting of the central, local and grassroots units.\n\nThe highest leading bodies of the Party are the National Congress, and the Central Committee which it elects. The Central Committee, the Political Bureau of the Central Committee, and the Standing Committee of the Political Bureau are like the brain and nerve center of a body. The Central Committee is responsible for formulating the Party's policies and guidelines. Therefore, it has the authority to make the final decisions.\n\nLocal Party organizations are responsible for implementing the Central Committee's decisions and plans in their respective areas, and for reporting feedback and suggestions from grassroots Party organizations and Party members to the Central Committee. Hence they are important intermediate links helping realize the smooth transmission and implementation of policies.\n\nThere are more than 4.86 million grassroots Party organizations, widely distributed in enterprises, villages, Party and government institutions, schools, research institutes, sub-districts, communities, social organizations, military units and other grassroots entities. They are like the nerve endings of the Party, responsible for implementing, at the relevant level, the decisions and plans of the Central Committee and the Party organizations at each successive level up. They also collect and report the concerns and suggestions of Party members and the people. More than 95 million Party members also play an exemplary role in grassroots organizations.\n\nWith such an extensive, well-knit and strong organizational system, the Central Committee can command with flexibility and efficiency the subordinate Party organizations just as the brain employs the arms and the arms employ the fingers. This is why the Party's policies, guidelines, decisions and plans are implemented fully and rapidly at the grassroots. This is why the Party's organizations and members keep close ties with the people and constantly reinforce the foundations of the Party's governance.\n\nThe CPC has strict discipline and rules. Discipline is the lifeline of the Party. Without strict discipline, there would be no unity and solidarity in the Party, policies would not be communicated and implemented smoothly, and the Party's cohesiveness and leadership would be seriously weakened.\n\nIn the years of revolutionary war, convinced that \"the army will win all battles in revolution as long as discipline is strengthened\", the Party issued the Three Main Rules of Discipline and the Eight Points for Attention. [The Three Main Rules of Discipline and the Eight Points for Attention were formulated by Mao Zedong and other Party and military leaders for the Chinese Workers' and Peasants' Red Army during the Agrarian Revolutionary War (1927-1937). Later, they were applied to the Eighth Route Army, the New Fourth Army and the People's Liberation Army (PLA). The contents varied slightly in different military units and different periods of history. In October 1947, they were unified and reissued by the General Headquarters of the PLA. The Three Main Rules of Discipline are as follows: (1) Obey orders in all your actions; (2) Do not take a single needle or piece of thread from the people; (3) Turn in everything that is captured. The Eight Points for Attention are as follows: (1) Speak politely; (2) Pay fairly for what you buy; (3) Return everything you borrow; (4) Pay for anything you damage; (5) Do not hit or swear at people; (6) Do not damage crops; (7) Do not take liberties with women; (8) Do not ill-treat captives.] It used these to reinforce its internal unity and win popular support.\n\nAfter the beginning of reform and opening up, in response to the adverse impact of bourgeois liberalization and the decadent Western lifestyle, the Party proposed that unity depends on ideals and discipline, and made great efforts to strengthen discipline.\n\nSince its 18th National Congress, the CPC has employed the enforcement of discipline as an essential tool in its full and rigorous self-governance. It has prioritized its efforts to enforce strict political discipline and rules, and is committed to running itself with rigor by forming a sound system of Party regulations. It has strengthened guidance and management of Party members, and strictly investigated and punished violations of discipline and rules. As a result, the principle of observing the Party's constitution, discipline and rules has become more firmly established.\n\nStrict discipline and rules and a sound organizational system ensure that the sophisticated machine of the Party runs efficiently, with all its parts well-coordinated, generating a powerful force.\n\nThe CPC ensures that its leadership is followed in all aspects of state governance. As a governing party, the CPC exercises governance and realizes its goals by establishing and improving the state governance system. By exercising leadership over departments running state power, and embodying its leadership in the design, setup and functioning of state power systems and institutions, the Party has effectively integrated its views with the will of the state.\n\nThe Party actively supports the work of the government in accordance with the Constitution and other laws. With the Party supervising officials and exercising leadership over staff, the CPC selects talented people of integrity and ability, and recommends candidates for leadership positions in government in accordance with statutory procedures. The Party exercises leadership over the state and society through the agencies of state power, and thus ensures that its decisions are implemented in the governance of the country.\n\nThe Party establishes Party committees or Party leadership groups in government agencies, public institutions, people's organizations, social groups, enterprises and other entities, and places them under the unified leadership of the Party organizations at the next level up. The Party sets up and improves Party organizations in nonpublic economic entities and social organizations, to ensure that its leadership reaches all social undertakings.\n\nSince its 18th National Congress, the CPC has further reformed Party and government institutions, and conducted thorough and systematic restructuring of the organization and management of the Party and the government. As a result, the Party's leadership system and the government's administrative system have improved, and the leadership of the Party and the government's capacity to deliver have been strengthened.\n\nThe integration of the Party leadership's political strengths and the government's institutional strengths unites the Party, the government and the people behind shared goals, interests and aspirations. This generates a huge cohesive force, keeps internal differences to a minimum, and significantly raises the efficiency of state governance. This is a clear manifestation of the institutional strengths of socialism with Chinese characteristics.\n\nThe CPC ensures effective implementation of its policies through the rule of law. Respectin"}, {"url": "http://www.chinatoday.com.cn/ctenglish/2018/hotspots/jdbn/202106/t20210629_800251281.html", "page_content": "Israel Epstein (1915-2005) was born in Poland and spent most of his life in China. In his decades-long career as a journalist and author, he witnessed the Chinese revolution and the founding and rise of the People’s Republic of China.\n\n\n\n\n\nBorn in Poland, Raised in China\n\nIsrael Epstein was born in 1915 in Warsaw to a Jewish family. His parents were members of a Jewish organization against the Russian Czar, which was part of the Russian Social Democratic Labor Party, a Marxist party. The socialist and Marxist views of his parents had a profound influence on young Epstein.\n\nAt two, Epstein moved with his family to Harbin, a city in Northeast China, and then to Tianjin, a city 140 km from Beijing, three years later. They lived in a foreign concession there, and the boy attended schools run by British and American residents. Fluent in Russian (taught by his mother), young Epstein read books of celebrated Russian thinkers and writers, which exposed him to sophisticated thinking and prepared him for a later career in writing.\n\nFrom a very young age, he had witnessed foreign powers occupying Chinese territory and inflicting untold suffering on the Chinese people. When he was in the fourth grade, Kuomintang started the first cooperation with the Communist Party of China under the policy of “alliance with Russia, cooperation with the Communist Party, and assistance to peasants and workers,” a move the Epsteins thought was just and necessary. However, few foreign families in Tianjin thought so at the time.\n\nIn 1931, 16-year-old Epstein became a reporter with the Beijing-Tianjin Times. In the same year Japan invaded Northeast China. Shocked and indignant, Epstein reported on Chinese people’s courageous resistance to Japanese invaders, informing the rest of the world of developments in the Chinese theater of the world's anti-Fascist war. In 1937 and 1938, Epstein, serving as a correspondent for the United Press, commuted between the battlefield and the rear of the war, recording major events of the time, including the Lugouqiao Incident, the Tianjin battle, victory of the Taierzhuang battle, and the fall of Guangzhou, in addition to the military and political affairs in Nanjing and Wuhan.\n\n\n\n\n\nGoing to Yan’an\n\nWhen recalling his experiences in the 1930s and 1940s, Epstein said that his coverage of the Chinese People's War of Resistance against Japanese Aggression enabled him to break free from the West-centric education he received as a child, and inspired him to view the known and unknown in the historical context.\n\nA group picture of Israel Epstein (first left) and Soong Ching Ling (fourth left) with other members of China Defense League in Hong Kong in 1938.\n\nWhen doing interviews in Guangzhou, Epstein met the woman who changed his life, Soong Ching Ling (Mme. Sun Yat-sen). At Soong’s invitation, he joined the English-language Newsletter published by the China Defense League she established in Hong Kong. While working at the journal, he translated CPC documents into English and published them in the Newsletter. It was during this period that he translated On Protracted War by Mao Zedong and introduced the book to the rest of the world.\n\nIn 1939, Epstein published his first book The People’s War in London. Based on his first-hand observations and reports, it told the world of the Chinese people’s heroic resistance against Japanese invaders and firm confidence in winning the war. Soong thought highly of it, saying that it was different from other books about the war by foreign writers, as it combined first-hand reporting with a review of the past and forecast of the future.\n\nMao Zedong (first right, back row) and a group of journalists including Epstein (second right, front row) who broke through the Kuomintang blockage to visit Yan’an in 1944.\n\nIn the summer of 1944, Epstein broke the Kuomintang blockade and headed for the revolutionary base Yan’an, to see what was really happening there. In his cave residence, Mao had a two-hour conversation with him, during which Epstein was deeply impressed by the CPC leader’s ability to express complex strategic ideas in a simple yet unforgettable manner. The visit to Yan’an gave Epstein a better understanding of the CPC. He decided to write a book about what he saw and heard during the trip and publish it globally. To work on it, he and his wife Elsie Fairfax-Cholmeley had to leave China for the U.S.\n\nBefore leaving the country, Epstein had a talk with Zhou Enlai, which left a lasting influence on him. “Borne out by what did happen between 1944 and 1949, it helped us, and our audiences abroad, to see the main trend in the intervening complex of events, culminating in the birth and growth of a China no longer, as for a century past, a football in the world arena but one of its leading players,” Epstein recalled later.\n\nHis book The Unfinished Revolution in China was published in 1947 in the U.S. It introduced the CPC and the Chinese revolution to more people around the world, and announced the upcoming creation of a new republic. It brought more international attention to China.\n\n\n\n\n\nAfter the Founding of the People’s Republic\n\nEpstein in the early years of China Reconstructs.\n\nIn the summer of 1951, Epstein and his wife returned to China at the invitation of Soong, and become dedicated to the cause of introducing the new China to the international community. At first Epstein worked as a consultant for the People’s Republic’s first English-language bi-weekly, People’s China. In 1952 he joined the English-language magazine China Reconstructs (now China Today) founded by Soong, and worked there in various positions including editor-in-chief for the following 50-plus years. During these years he dedicated himself to the mission of reporting China’s reality to the rest of the world, helping Western readers gain a correct understanding of the country. With a historical and international vision, Epstein wrote a large volume of articles about people from all walks of life and development in various sectors of the Chinese society.\n\nEpstein during a reporting journey to Tibet. Epstein and some American journalists revisit Yan’an in March 1985.\n\nHe also participated in the translation of many important documents and books including Selected Works of Mao Zedong and Selected Works of Deng Xiaoping, and became a key figure in China’s international publication sector of the time.\n\nEpstein became a Chinese citizen in 1957 and a member of the CPC in 1964. He also served as a standing committee member of the sixth to 10th National Committee of the Chinese People's Political Consultative Conference (CPPCC).\n\nEpstein felt a deep bond with China and the Chinese people. He called China home as he had numerous friends and a career in the country. He said he had watched the Chinese people emerge victorious in their revolution and would join them in building the new China.\n\nThe media is a recorder of history. As a journalist, Epstein observed what was happening in front of his eyes from a historical perspective, and gave insightful analysis. He made extensive research for every article and book he wrote. When working on Soong Ching Ling's biography, he spent 10 years to study relevant records and conduct interviews at home and abroad, exploring her presence in the major domestic and international events of her time and the multiple dimensions of her extraordinary character. When writing Tibet Transformed, he made four trips to Tibet, 10 years apart. In the 1976 visit alone he interviewed 700-800 people of various backgrounds all over the region, including many far-flung corners, and took 5,000 pages of notes. It took him 30 years to complete the 200,000-word book on Tibet.\n\nEpstein kept writing during his retirement. He completed his book My China Eye: Memoirs of a Jew and a Journalist at 89."}, {"url": "http://en.youth.cn/RightNow/202107/t20210702_13066155.htm", "page_content": "A member of a Communist Party of China volunteer group instructs farmers to graft and cultivate camellia seedlings in Yongfeng county, Ji’an, east China’s Jiangxi province, May 18, 2021. (People’s Daily Online/ Liu Haojun)\n\nAs the Communist Party of China (CPC) is about to celebrate its 100th anniversary, the international society is also closely observing the world’s biggest Marxist ruling party that has gone through 100 glorious years, governed the world’s largest socialist country for over 70 years and owned 91 million members, trying to find an answer to why and how the CPC works there.\n\nMore and more international personages are realizing that remaining committed to serving the people and relying on them in all endeavors, and putting them at the very center is the key to the CPC’s success, as well as a source of vitality for this 100-year-old party.\n\nThe CPC’s efforts to seek happiness for the Chinese people are lauded by foreign political parties and dignitaries, as well as people from all walks of life. They believe the journey of the CPC proves that a political party can achieve anything when it takes people’s interests as its top priority. Speaking for and working with the Chinese people, protecting their fundamental interests, and practically solving the problems of their top concerns, the CPC is sincerely recognized and supported by the Chinese people. That’s why it is able to unite and lead the Chinese people to achieve great strides of national development.\n\nIt was written in the Manifesto of the Communist Party by Karl Marx and Friedrich Engels that the proletarian movement is the self-conscious, independent movement of the immense majority, in the interest of the immense majority. That explains why the matters of people are a touchstone for the quality of a political party and a regime.\n\nSince the birth of the CPC, it has been a proletarian party. It was born for the people and prospers for the people. It always stays with the people and fights for their interests, which is a fundamental goal of the party’s development. General secretary Xi Jinping of the CPC Central Committee said the CPC has no special interests of its own, and puts the interests of the people at first at any time.\n\nIn early 20th century, American journalist Jack Belden predicted that the CPC would succeed as the party completely won the support of the people. Since the People’s Republic of China was founded in 1949, the CPC has taken striving for the wellbeing of the people as its ultimate mission, and constantly enhanced people’s sense of fulfillment, happiness and security. Robert Griffiths, General Secretary of the Communist Party of Britain noted that the CPC is a party that’s always close to the people.\n\nCPC hears the voices of the people and draws wisdom from them before making every policy and reform measure. Martin Albrow, fellow of the British Academy of Social Sciences pointed out that one of the secrets to the CPC leading Chinese people to achieve development is that the political party has always been serving the people whole-heartedly. The success of poverty alleviation, as well as the major strategic result of epidemic control came from the CPC’s people-centered development philosophy. Kishore Mahbubani, a distinguished fellow of the National University of Singapore believes that the 1.4 billion Chinese people are embracing a new peak of the Chinese civilization under the leadership of the CPC.\n\nThe increasingly closer relationship between the CPC and the Chinese people is boosting the confidence of China to overcome all challenges and risks. It is a source of ceaseless energy for the great rejuvenation of the Chinese nation.\n\nThe CPC will always make it its fundamental mission to strive for people’s wellbeing and its fundamental purpose to serve the people whole heartedly, and rely on them for its historic cause, so as to make more contributions to the progress of human civilization.\n\nMembers of the Communist Party of China check water pipelines for drinking water security in Erdengyan village, Xiaping township, Hefeng county, Enshi Tujia-Miao autonomous prefecture, central China’s Hubei province, June 9, 2021. (People’s Daily Online/Yang Shunpi)"}]}