{"John Reed Jr. wrote for The New Masses, a Communist magazine.": [{"url": "https://www.britannica.com/biography/John-Reed", "page_content": "John Reed, (born Oct. 22, 1887, Portland, Ore., U.S.—died Oct. 19, 1920, Moscow), U.S. poet-adventurer whose short life as a revolutionary writer and activist made him the hero of a generation of radical intellectuals.\n\nReed, a member of a wealthy Portland family, was graduated from Harvard in 1910 and began writing for a Socialist newspaper, The Masses, in 1913. In 1914 he covered the revolutionary fighting in Mexico and recorded his impressions in Insurgent Mexico (1914). Frequently arrested for organizing and defending strikes, he rapidly became established as a radical leader and helped form the Communist Party in the United States.\n\nHe covered World War I for Metropolitan magazine; out of this experience came The War in Eastern Europe (1916). He became a close friend of Lenin and was an eyewitness to the 1917 Bolshevik Revolution in Russia, recording this event in his best known book, Ten Days That Shook the World (1919).\n\nWhen the U.S. Communist Party and the Communist Labor Party split in 1919, Reed became the leader of the latter. Indicted for treason, he escaped to the Soviet Union and died of typhus; he was subsequently buried with other Bolshevik heroes beside the Kremlin wall. Following his death the Communist Party formed many John Reed clubs, associations of writers and artists, in U.S. cities."}, {"url": "https://www.wsws.org/en/articles/2020/12/03/reed-d03.html", "page_content": "Mid-October marked the 100th anniversary of the untimely death of American revolutionary socialist journalist John Reed. The author of Ten Days That Shook the World, a magnificent firsthand account of the Russian Revolution, Reed died in Moscow of typhus on October 17, 1920, five days shy of his 33rd birthday.\n\nAbout Ten Days That Shook the World, V.I. Lenin, the co-leader of the 1917 October Revolution, commented in an introduction written in 1919, “Unreservedly do I recommend it [Reed’s book] to the workers of the world. Here is a book which I should like to see published in millions of copies and translated into all languages.” The book has had a special place in the hearts and minds of class-conscious workers ever since its appearance. It can still be recommended “unreservedly.”\n\nMany people may be familiar with the name of John “Jack” Reed from the 1981 movie Reds, in which Warren Beatty portrayed the intrepid and principled journalist and for which Beatty won the Academy Award for best director.\n\nWhat the film cannot convey, among other things, however, is the vital, muscular and poetic quality that made Reed’s writing so influential in his time and to later generations. Reds only hints at the full complexity of the man who, more than any American writer of his generation, followed the demands of his political conscience to their revolutionary conclusions.\n\nJohn Reed was born in Portland, Oregon on October 22, 1887 into an upper-middle-class family. His mother’s father, Henry Dodge Green, was a wealthy Portland industrialist and his house a center of Portland’s genteel social gatherings.\n\nReed came of age during the era of the full-blown development of American capitalism. In the 30 years following the Civil War, the US emerged as a modern industrial power. The decades saw the enrichment of the infamous Robber Barons, and the US launched its first imperialist war in 1898, seizing the Philippines and Cuba from Spain.\n\nThe urban population swelled in this period, also a time of large-scale immigration, and the working class emerged as a powerful force, expressing—in a series of bitter strike struggles—its determination to fight the omnivorous ruling class.\n\nReed’s father, C.J. Reed, was a crusader against political corruption in Oregon, helping to take on the logging interests in his capacity as a U.S. marshal. Not having gone to college himself, C.J. was determined that Jack should attend Harvard, interceding for his son when he failed his entrance exam. Jack passed the second time. Working on and contributing to several Harvard publications, Reed honed his journalistic and editing skills. He also wrote and published a good deal of poetry and became a member of the newly formed Harvard Socialist Club.\n\nEstablishing himself in Greenwich Village in 1911, Reed was at the center of the neighborhood’s bohemian culture. The Village was home to such figures as poet Hart Crane, “scandalous” novelist Henry Miller (who, not long before his death, describes Reed’s milieu in Reds) and dramatist Eugene O’Neill.\n\nIt was here, as a working writer and an editor at The American Magazine (founded in 1906), that Reed grappled with the challenge of earning a living under conditions where serious art does not pay the rent. For Reed, “serious art” still meant his poetry, which does not make much of an impression after more than a century, and also supplementing his income from The American by selling short stories, which, in some cases genially give a flavor of life at that time.\n\nAs Reed came to know Manhattan, however, its palaces and its squalor, he came to realize that something was fundamentally wrong with American society. In a later essay written in the months before his journey to Russia that would result in his witnessing the October Revolution, titled “Almost Thirty,” he would recall the political awakening of his early twenties:\n\nOn the whole, ideas alone didn’t mean much to me. I had to see. In my rambles about the city I couldn’t help but observe the ugliness of poverty and all its train of evil, the cruel inequality between rich people who had too many motor cars and poor people who didn’t have enough to eat. It didn’t come to me from books that the workers produced all the wealth of the world, which went to those who did not earn it.\n\nHearing of a new arts and features magazine with a decidedly socialist orientation, called The Masses (founded in 1911), Reed quickly introduced himself to its editor Max Eastman, who would later translate many of Leon Trotsky’s works into English, and climbed on board as both an editor and contributor.\n\nThough the new magazine could not pay him, Reed would find his work for this important publication his most fulfilling. The Masses was to publish the first stories of Sherwood Anderson in 1916, later to be collected in the groundbreaking Winesburg, Ohio. It published works by figures such as Jack London, the novelist Floyd Dell, and the poets Carl Sandburg and Amy Lowell. Painters John Sloan, George Bellows and Pablo Picasso contributed illustrations.\n\nBy 1913, Reed would prove a more than receptive audience member when—in a Greenwich Village apartment—he met William “Big Bill” Haywood, leader of the Industrial Workers of the World (IWW), the left-wing syndicalist movement. Reed listened as Haywood described the developing situation in nearby Paterson, New Jersey, where silk workers were on strike and being beaten and jailed by police. Reed, perhaps for the first time, reacted to a major story not only as a journalist but as a partisan, determined to publicize the strike and help the workers.\n\nSoon after arriving in Paterson, a naturally defiant Reed goaded a belligerent police officer into arresting him. In the county jail, overcrowded with immigrant strikers, he befriended the workers—“gentle, alert, brave men, ennobled by something greater than themselves”—and drew out their stories. That “something greater,” the class struggle, can be seen at work in the article Reed wrote for The Masses (“War in Paterson”), which opens:\n\nThere’s war in Paterson, New Jersey. But it’s a curious kind of war. All the violence is the work of one side—the mill owners. Their servants, the police, club unresisting men and women and ride down law-abiding crowds on horseback. Their paid mercenaries, armed detectives shoot and kill innocent people. Their newspapers ... publish incendiary and crime-inciting appeals to mob violence against the strike leaders ... They control absolutely the police, the press, the courts.\n\nSo moved was Reed by the condition of the silk workers that he organized a dramatic pageant, held at Madison Square Garden, in which the actual workers demonstrated their onerous work and their treatment as strikers at the hands of the police.\n\nReed’s best known work is Ten Days That Shook the World (1919), but he did produce other outstanding works of reportage, one of which is his account of his experiences riding with Pancho Villa’s army in the Mexican Revolution, titled Insurgent Mexico (1914). The compelling work immerses the reader in the harsh, violent life of La Tropa, Villa’s army, and its camp followers.\n\nAs was the case in Paterson, Reed not only sympathized politically with the peasant revolutionaries but came quickly to admire them and want their respect, which he was proud to earn. At one point in Insurgent Mexico, he writes of an initiation into La Tropa over a bottle of sotol:\n\n“Drink it,” yelled the chorus as the Tropa crowded up to see. I drank it. A howl of laughter and applause went up. Fernando leaned over and gripped my hand. “Good for you, companero!” he bellowed, rolling with mirth ... Captain Fernando leaned over and patted my arm. “Now you are with the men (los hombres.) When we win the Revolucion it will be a government by the men,—not by the rich. We are riding over the lands of the men. They used to belong to the rich, but now they belong to me and to the compañeros.”\n\nThe material Reed sent back to the US, published in The Metropolitan magazine, established him as America’s foremost war correspondent. The writing was at once impressionistic and clear-eyed, imagistic and frank.\n\nCertainly, no more stark instance of brutal oppression could have presented itself to Reed or the world than the Ludlow Massacre of April, 1914, the culminating atrocity of the protracted southern Colorado coal miners’ strike of the winter of 1913-14. Reading of the massacre, Reed immediately left for Las Animas County.\n\nThere he made a detailed search of the scene of the massacre, in which National Guard militiamen rented by John D. Rockefeller’s Colorado Fuel and Iron Company killed an estimated 26 miners, their wives and children, some shot with machine guns and some deliberately burned to death in tents the miners had been living in during the strike.\n\nReed wrote a lengthy, scathing article for The Metropolitan, “The Colorado War,” in July 1914, which detailed the murderous violence of the Rockefeller interests. “I got into Trinidad [Colorado, 15 miles from Ludlow] about ten days after the massacre at Ludlow,” Reed wrote. Later in the article, he explained:\n\nI went to Ludlow next day to see the Federal troops come in and the militia leave. The tent colony, or where the tent colony had been, was a great square of ghastly ruins. Stoves, pots and pans still half full of food that had been cooking that terrible morning, baby-carriages, piles of half-burned clothes, children’s toys all riddled with bullets, the scorched mouths of the tent cellars, and the children’s toys that we found at the bottom of the “death hole”—this was all that remained of the entire worldly possessions of 1,200 poor people. At the railroad station about fifty militiamen waited for the train—boys with the stupid, vicious faces of saloon-corner loafers. Only a few were in uniform, for many of them were mine-guards hastily mustered in. As the regulars left their train one militiaman said loudly, in the hearing of the militia officers: “I hope these red-necks kill a regular so they will go in and wipe out the whole bunch. We certainly done a good job on that tent colony.”\n\nIn August of that year, the world was struck by the greatest upheaval to that point in modern times. The First World War broke out in Europe. Reed sailed to Italy as a correspondent for The Metropolitan. He went to France, where he attempted twice to reach the front but was arrested and turned back both times. He then went to London, where he wrote a long article on England in wartime, showing that patriotism was limited to the upper classes. The Metropolitan rejected the article.\n\nIn “The Traders War,” written from London and published in The Masses in September, Reed outlined the history of the imperialist commercial rivalries between Britain, France and Germany and stated that the war was nothing more than a continuation of these conflicts. (In a noteworthy scene in Reds, Reed [Beatty], asked at a meeting of the Liberal Club in Portland, Oregon what he thinks “this war is about,” gets to his feet and replies with one word, “Profits.”)\n\nReed returned to France and in December made his way to Germany via Switzerland. In Berlin, he was able to conduct an interview with the revolutionary socialist Karl Liebknecht, who alone in the German Reichstag had refused to vote to fund the war. When Reed asked him about “the chances of World Revolution,” “‘To my mind’ [Liebknecht] responded serenely, ‘nothing else can come out of this war.’”\n\nReed and other American correspondents were able, after long delays, to secure permission to visit the German front in Northern France. Along the way they were feted by German officers and saw the horrors of trench warfare. He wrote articles on these experiences for The Metropolitan and returned to the US in January 1915.\n\nReed only stayed home a few months. By March, since he was unable to get permission to visit France again, The Metropolitan asked him to report on the war in Eastern Europe. With the artist Boardman Robinson, he visited Serbia, Romania, Bulgaria and Russia.\n\nAlmost half the articles he wrote, although Reed could not know this at the time, were about the final days of the tsarist empire with its drunkenness, abuse, and corruption organized into armies. In one article, “An Optimistic Pilgrimage” that still moves the reader 105 years later, Reed passes through a Jewish village near Rovno in what is now Ukraine, and observes the filth and poverty of the Jews and their oppression by the Russians. One of his guides, a Russian army officer, complains that all Jews are traitors to Russia.\n\nThe scenes from Serbia are shocking. The first country to be invaded by the Austro-Hungarian Empire in response to the assassination of its Archduke Ferdinand in 1914, Serbia was in the middle of a typhus epidemic. Reed visited one hospital for those stricken with disease:\n\nWe entered a barrack, along whose walls cots lay touching each other, and with the feeble light of two lanterns we could see the patients writhing in their dirty blankets, five and six crowded into two beds. Some sat up, apathetically eating; others lay like the dead; still others gave short, grunting moans, or shouted suddenly in the grip of delirium.\n\nWhen Reed returned from Europe in late 1915, the official political atmosphere in the US had shifted to the right: a pro-war “preparedness” campaign was underway and middle-class public opinion had become anti-German. He moved back to Greenwich Village with the woman he would marry, also from Oregon, journalist Louise Bryant. It was at this time he befriended Eugene O’Neill. Reed, O’Neill, Bryant and some of their circle wrote and performed plays in Provincetown, Massachusetts in the summer of 1916.\n\nThe Metropolitan refused to return him to Europe because of his antiwar views. But in the spring of 1917, two more world-shaking events occurred. In March, the Russian tsar, Nicholas II, was overthrown, and in April the United States entered the world war.\n\nThroughout the spring and summer of 1917, Reed wrote antiwar articles for The Masses. By August, he had decided he had to see the revolution in Russia for himself. Reed arrived in Petrograd on September 13, just after the attempted coup against the bourgeois Provisional Government by tsarist General Lavr Kornilov. The coup melted away largely because of the Bolsheviks’ mobilization of workers and soldiers.\n\nThrough connections in New York, including Bolsheviks such as V. Volodarsky, Reed became acquainted with that party’s leaders, who were now preparing the overthrow of the Provisional Government and its replacement by a government of Soviets.\n\nHe hastened from place to place in Petrograd, saving leaflets and proclamations and documenting the positions of each party. He interviewed leaders of the frightened capitalist parties, and he saw Lenin and Trotsky give speeches to thousands of workers. Reed himself spoke to countless other Bolshevik leaders, workers, soldiers and sailors, as they applied themselves to the historical task of establishing a government of the working class. He was a witness to the Bolshevik seizure of power and was present at the famous storming of the Winter Palace, as well as the struggle afterwards by the new Soviet government against counterrevolution.\n\nFor the remainder of the year Reed remained in the new Soviet Russia. He worked for the People’s Commissariat of Foreign Affairs and was briefly appointed consul to the US. In early 1918, he had his first long discussions with Lenin and Trotsky. He left for home soon after, but was detained in Finland until April by the nationalist government.\n\nOn his return to New York, he was met on the dock by government agents who seized his papers and summoned him to court the next day. Reed was indicted under the Espionage Act for a 1917 article, published in The Masses, “Knit a strait-jacket for your soldier boy,” which describes what we now call post-traumatic stress disorder.\n\nReed took up the task of defending the revolution to an American audience in such articles as “Soviets in Action” and “The Structure of the Soviet State” published in T he Liberator (the successor to The Masses), in the autumn of 1918.\n\nIt was at this time that be took up a fight for the ideas of Bolshevism in the left wing of the American Socialist Party, along with Louis Fraina and other supporters of the Russian Revolution in the journal The Revolutionary Age. His papers from Russia were returned to him, and he worked feverishly on his description of the events he had lived through in October-November 1917. Eastman later reported that Reed wrote the book in a remarkably short period of time, sequestered in a room in Greenwich Village, seeing no one and coming out only for meals.\n\nIn March 1919, the product of this effort, Ten Days That Shook the World, was published. It was the peak of Reed’s development as a journalist. He combined his own observations and conversations with the scrupulous publication of the documents of the revolution itself he had collected.\n\nHere is how Reed describes the Bolshevik headquarters, the Smolny Institute, a former upper-class girls school in tsarist times (only eight months previously!) on the day of the insurrection, November 7:\n\nThe massive facade of Smolny blazed with lights as we drove up, and from every street converged upon it streams of hurrying shapes dim in the gloom. Automobiles and motorcycles came and went; an enormous elephant-colored armored automobile, with two red flags flying from the turret, lumbered out with screaming siren. It was cold, and at the outer gate the Red Guards had built themselves a bonfire. At the inner gate, too, there was a blaze, by the light of which the sentries slowly spelled out our passes and looked us up and down. … A crowd came pouring down the staircase, workers in black blouses and round black fur hats, many of them with guns slung over their shoulders, soldiers in rough dirt-colored coats and grey fur shapkas [hats] pinched flat.\n\nOn this occasion Reed encounters the Bolshevik leader Lev Kamenev. Kamenev reads out to him, translating from Russian into French, effectively the first proclamation, just passed in session, of the new Soviet government: “The new Workers’ and Peasants’ Government will propose immediately a just and democratic peace to all the belligerent countries … The Soviet is convinced that the proletariat of the countries of Western Europe will aid us in conducting the cause of Socialism to a real and lasting victory.”\n\nAnd Reed’s description of Lenin stands out:\n\nDressed in shabby clothes, his trousers much too long for him. Unimpressive, to be the idol of a mob, loved and revered as perhaps few leaders in history have been. A strange popular leader—a leader purely by virtue of intellect: colorless, humorless, uncompromising and detached, without picturesque idiosyncrasies—with the power of explaining profound ideas in simple terms, of analyzing a concrete situation. And combined with shrewdness, the greatest intellectual audacity.\n\n(An insightful description, aside from the characterization of Lenin as “colorless” and “humorless,” which was anything but the case!)\n\nTen Days That Shook the World is one of the artistic achievements not only of the Russian Revolution, but of American and world literature. The fact that it inspired another great work, Soviet filmmaker Sergei Eisenstein’s October (1928), gives it a unique place in human culture.\n\nReed discovered the drama of the revolution in its own action, in the rapid and intense response of classes to one other in the pursuit of their social goals, expressed not only by force of arms, but by the most profound political thought. He was able to translate this into narrative and description.\n\nTen Days That Shook the World was the first time the revolution spoke in its full eloquence to the world. Lenin in his famous preface to the book, noted above, commented: “With the greatest interest and with never slackening attention I read John Reed’s book, Ten Days That Shook the World. … It gives a truthful and most vivid exposition of the events so significant to the comprehension of what really is the Proletarian Revolution and the Dictatorship of the Proletariat. These problems are widely discussed, but before one can accept or reject these ideas, he must understand the full significance of his decision. John Reed’s book will undoubtedly help to clear this question, which is the fundamental problem of the international labor movement.”\n\nIn the summer of 1919, Reed helped to launch the Communist Labor Party (one of the forerunners of the Communist Party, founded in May 1921), as it split from the opportunist Socialist Party. In October he left again for Soviet Russia and participated as an American delegate to the Second Congress of the Communist International, held from July 19 to August 7, 1920. Following that, Reed attended the Congress of the Peoples of the East in Baku in Soviet Azerbaijan, an assembly of 1,900 delegates from across Asia and Europe organized by the Communist International, which opened September 1.\n\nFrench leftist Alfred Rosmer, in Moscow Under Lenin, has a well-known description of Reed speaking at the Congress in Baku, a city famous for its petroleum industry. Rosmer noted that Reed, who had learned a few words of Russian, “was a great success. He shouted a question to his audience: ‘Don’t you know how Baku is pronounced in American? It’s pronounced oil!’ The solemn faces were suddenly shaken with laughter.”\n\nReed returned to Moscow on September 15, fell sick with typhus and died on October 17. It is said that he might have survived if the American government had not had an embargo on medications to Soviet Russia.\n\nRosmer explained in his book that when he and others returned from Moscow, “a sad piece of news greeted us. John Reed, who had returned in advance of us, was in hospital, ill with typhus. No effort was spared to save him, but it was all in vain and a few days later he died. His body was displayed in the great hall of the House of Trade Unions. On the day of the funeral, winter had already arrived and snow was falling. We were overwhelmed.”\n\nRosmer continued, “A burial place was found for him in the Kremlin wall, in the section reserved for heroes who had fallen in the revolutionary battle. The words of farewell were spoken by [Nikolai] Bukharin, for the central committee of the Communist Party, by [Alexandra] Kollontai, and by his comrades from the Executive Committee. Louise Bryant, who had arrived only to see him die, was there, completely shattered by grief. The whole scene was indescribably sad.”\n\nReed’s reputation after his death has been closely tied to the fate of the Russian Revolution. The Stalinist regime that usurped the Soviet state in the next decade could not abide the truth about the revolution, and Trotsky’s role in October 1917, as Reed had depicted it. Stalin is mentioned only in passing because he played virtually no role in the seizure of power. The work was banned, at Stalin’s insistence, in the Soviet Union for decades.\n\nEqually, anticommunist commentators in Europe and America have sought to make Ten Days That Shook the World into a mere literary accomplishment. Some have alleged, falsely, that after disagreements over Communist tactics in 1920, Reed became disillusioned with Marxism.\n\nDespite the Stalinist and anticommunist treatment of Reed and his work, for millions of workers and young people Ten Days That Shook the World remains an indispensable introduction to the most momentous event in world history. In a time when the question of socialist revolution has been placed before millions and millions, a new generation must discover his work.\n\nTen Days That Shook the World is currently on sale at Mehring Books for $14.40."}, {"url": "https://www.marxists.org/history/etol/newspape/atc/4467.html", "page_content": "John Reed Clubs and Proletarian Art—Part I\n\n— Andrew Hemingway\n\nI WANT TO address the theme of Proletarian and Revolutionary Art in the United States between 1928 and 1935; that is to say in the years of the so-called Third Period line in the tactics of the international Communist movement. Although the terms “Proletarian Art” and “Revolutionary Art” were often used seemingly interchangeably at this time — or even used in combination — they are not synonymous, and I will argue that the distinction points up tensions between different forms of art practice produced in the Communist Party’s orbit and to important intellectual confusions.\n\nBefore analyzing the theory and practice of this art and the reasons for its emergence and decline, something needs to be said about its genealogy.\n\nThe writings of Marx and Engels provide no support for the idea, frequently associated with Marxism, that the movement of the working class to emancipate itself from capitalism and build a classless society requires a proletarian or revolutionary art as an aid to its struggles. (In any case, the first compilation of Marx and Engels statements on literature and art wasn’t published until 1933 [in Russian] and the first systematic attempt to extract an aesthetic theory from their writings did not appear until two years later as the period I’m dealing with was ending).(1) Although they were interested in the propagandist uses of Tendenzkunst or Tendenzliteratur in spreading revolutionary ideas — that is, in didactic forms of art and literature that pointed to a desired historical outcome – Marx and Engels distinguished such work from true realist art; and, while they admired some of the great works of 19th-century realist literature, neither were committed to the idea of realism as a transcendental aesthetic.\n\nHaving said this, the most prominent Marxists who sought to develop a theory of the arts consonant with Second International Marxism in the late 19th and early 20th centuries — Franz Mehring and Georgii Plekhanov — were critical of modernist tendencies and favored forms of realism. Thus Plekhanov — whose famous 1912 articles on “Art and Social Life” were often cited by American communist critics even before the appearance of the English translation in pamphlet form in 1937(2) — decried “art for art’s sake” as a phenomenon of bourgeois decay and recommended a utilitarian conception of art. Impressionism and literary Naturalism demonstrated that without meaningful content “realism collapses”;(3) while Cubism was just a degenerate form of “art for art’s sake” that reduced the tendency to “complete absurdity.”(4)\n\nThis kind of thinking was found more widely within the Second International and particularly within its largest member organization, the German Social Democratic Party. Over the years 1910-12 an intense debate over Tendenzkunst took place in the pages of the SPD’s central organ, Die Neue Zeit, sparked off by an article by the Dutch dramatist Herman Heijermans (pseudonym Heinz Sperber). Heijermans argued that the leading Social Democratic intellectuals were too passive and uncritical in the face of the increasing commercialization of bourgeois art production and in their assumption that a socialist art was impossible under capitalism. By contrast, he called for an actualized socialist art that would be spread through workers’ organizations. Such art would have a “proletarian Tendenz.” Terms such as “Tendenz,” “Klassenkunst,” and “proletarische Kunst” were invoked again and again in SPD debates on art and cultural politics in the years up to 1914.(5)\n\nThe American Scene\n\nAlthough there was certainly considerable interest in German Social Democracy in the much smaller Socialist Party of America — which had 118,000 members at its largest in 1912 compared with the SPD’s 970,112 — as far as I know the “Tendenzkunst-Debatte” was not reported in the United States. Discussion of art in The Masses (1911-17), the premier cultural magazine associated with the Socialist Party, took place at a much lower theoretical level; after all the SPA did not have Marxism as its official doctrine and many of its leaders regarded Marx’s writings as overly theoretical.\n\nThe Bolshevik Revolution of 1917 associated Marxism not only with a new model of the revolutionary party and of revolutionary politics; it also offered a laboratory of socialist culture in the making. Almost from the outset this was reported positively in The Liberator, the successor to The Masses, which ran from 1918-24 and carried not just eye-witness accounts of the revolution by John Reed but also an astonishing conspectus of reporting on the revolutionary wave that swept Europe at the end of the War.(6)\n\nHowever, although the color covers and numerous cartoons make The Liberator visually rich (figures 1 and 2), it was not primarily a cultural magazine. Much of the most authoritative reporting on the Soviet arts in this period was by the young Russian-American artist Louis Lozowick, who published a string of articles and reviews in magazines such as Broom, Little Review, Theatre Arts Monthly, and the Menorah Journal, which fed into his short 1925 book Modern Russian Art — the first book-length treatment of the theme published in the United States. By 1924, if not earlier, Lozowick was communist aligned.(7)\n\nIn these years the American Communist Party was still in the process of formation. Rent by ethnic differences and disagreements over strategy, the two communist groupings that emerged from the Socialist Party in 1919 were not united as a single party (the Workers’ Party) until 1921, by which point it was reduced to 12,000 members, the majority of whom were Finnish-Americans. It was hardly in a position to spearhead a broad cultural movement.\n\nIndeed, the American Communist Party never became a truly mass party. Although its General Secretary Earl Browder claimed in 1939 that membership had reached 100,000, he admitted privately it was somewhat less than that.(8) And in any case that was at the height of the Popular Front. In the 1920s and early 1930s the membership was much smaller. The imposition of a top-down leadership on the American Party in 1925 — a process known as “Bolshevization”(9) — led to a drop in membership to 7,213 in October 1925. By 1927 membership had grown again to around 9,500 and stayed there until 1930.(10)\n\nTo put these figures in perspective, while the population of Germany was around half that of the United States, its Communist Party had a membership of 350,000 in early 1921.(11) Membership of the CPUSA finally rose above 10,000 in 1932 – hitting more than 18,000 after the presidential election in November. But it shrank to under 15,000 the following year.(12) These figures do not represent the extent of Communist influence in the labor unions and in culture, but they are a necessary backdrop to the rest of my argument.(13)\n\nThe Communist Party began to emerge as a political force in 1925-26, when its members helped organize a number of bitter strikes in the fur, textile, garment, and coal industries. Although it lost to the employers and AFL bureaucracies in most of these struggles, through them the party established a record of militancy and showed its willingness to organize amongst types of worker the AFL craft unions generally ignored.(14)\n\nIn January 1924 the party launched its national daily paper, the Daily Worker — which carried cultural material from the outset — and some of its members were active in the group that set up the magazine New Masses, which had its first issue in May 1926. Joseph Freeman, one of the communists involved in launching New Masses, recalled in a 1934 retrospect that the board had been divided between “the mass of editors and contributors” who were liberals and “the small nucleus of revolutionary artists of whom only one or two were party members.” For “several years” the former were dominant, and the magazine “was not only against serious political discussion; it was also against serious theoretical discussion about art and literature.”(15)\n\nThis hardly does justice to the rich and interesting discourse of the magazine in these years, but it is true that discussions of art and literature made few references to Marxist theory and the magazine’s flavor was close to that of the pre-war Masses. In a report of 1932 Freeman admitted that “we have not in this country in the English language basic Marxian writings about art and literature.”(16)\n\nIn fact, the character of New Masses in the years after it first became a Communist organ was decidedly non-intellectual. As a result of a financial crisis, the magazine appeared intermittently in the first half of 1928. When the first number of volume 4 came out in June, the communist Mike Gold was announced as the editor with another communist, Hugo Gellert, as art editor. From this point onwards, New Masses began to propagate a distinctive proletarian aesthetic, inspired by a highly romanticized vision of the new workers’ culture of the Soviet Union. Gold — who seems to have dominated the magazine until the end of 1930 and remained an important voice in it until it changed from a monthly to a weekly in 1934 — set the tone.(17)\n\n“Towards Proletarian Art”\n\nBorn Itzok Granich on New York’s Lower East Side in 1893, Gold adopted his pseudonym during the Red Scare of 1919-20. He had discovered The Masses in 1914 and was reportedly so enthused by it that he moved to Greenwich Village. In 1921 he became an editor of The Liberator, which published his manifesto “Towards Proletarian Art” in February. This is an apocalyptic Whitmanesque outpouring that calls for “the masses,” the former children of the tenements, to replace the art of intellectuals, filled with “solitary pain” and “complexities,” with a new art, “primitive and clean,” filled with the breath of LIFE. It was not in the “hot-house air” of little magazines such as Seven Arts and Little Review that the “lusty great tree” of such art would grow; it was rather in “the fields, factories and workshops of America.”(18)\n\nGold’s call has been associated with the 1921 book Proletcult by the British Marxists Eden and Cedar Paul, which contained a brief account of the Russian Prolet’kult movement and called for the setting up of a “Red Proletcult International.” But if Gold thought Prolet’kult was the future of Soviet culture he had got things badly wrong.\n\nAlthough some Bolshevik leaders such as Lunacharsky and Bukharin were sympathetic to the movement, the party’s Central Committee was not prepared to tolerate a mass organization that sought autonomy from the party and by the end of 1920 it was subordinated to the Commissariat for Education. This was at the insistence of Lenin, who had engaged in a series of theoretical disputes with one of Prolet’kult’s leading figures, Aleksandr Bogdanov, before 1914 and who thought the idea of making a proletarian culture ex novo was nonsense.(19) Gold was seemingly unaware of all this. In an otherwise favorable review of Trotsky’s Literature and Revolution in October 1926, he took issue with Trotsky’s argument that there neither was nor could be a proletarian art: “It is not a matter of theory; it is a fact that a proletarian style is emerging in art. It will be as transitory as other styles; but it will have its day.”(20)\n\nGold’s efforts to promote an American proletarian art in the late 1920s and early 1930s may have found encouragement in the rhetoric of proletarianism and renewed class struggle that were part of the so-called Cultural Revolution that accompanied the launching of the First Five Year Plan in 1928 and of the Collectivization of Agriculture the following year.(21)\n\nOne aspect of the Cultural Revolution was a harsh stance towards non-party intellectuals, the beginnings of which was marked by the trial of engineers and technicians from the Shakhty area of the Donbass on charges of conspiracy and sabotage in May-June 1928, followed by purges in schools and universities and anti-bureaucratic campaigns in the government apparatus.(22)\n\nAnother was what Sheila Fitzpatrick has called the end of “NEP in culture,” and the dominance of a “coercive, ignorant or contemptuous” attitude to “inherited culture” and a valorization of so-called proletarian culture.(23) In literature the principle voice of this new “hard line” was the Russian Association of Proletarian Writers (or RAPP), which from 1928-32, without any official party mandate, assumed leadership in a campaign to unmask “the rightist danger” in the arts in the name of proletarian purity.(24) RAPP’s counterpart in the visual arts was the Association of Revolutionary Artists, or AKhRR.\n\nThe new turn in Soviet domestic policies was matched by a shift in interpretation of the international situation which was announced at the Sixth Comintern Congress in July-September 1928, where the so-called Third Period line was defined. This was premised on the view that the capitalist system was entering a new period of crisis that would issue in wars between the imperialist states and war against the USSR.\n\nIn the words of the “Theses and Program” adopted on the last day, “When the revolutionary tide is rising, when the ruling classes are disorganized and the masses in a state of revolutionary ferment, when the middle strata are inclined to turn towards the proletariat and the masses display their readiness of battle and for sacrifice, it is the task of the proletarian party to lead the masses to a frontal assault on the bourgeois State.”(25) The onset of the Great Depression at the end of 1929 seemed at least to confirm the thesis about capitalism entering a renewed phase of crisis.\n\nSeeking Worker Voices\n\nGold described the policy of New Masses under his editorship as to make “a non-literary, non-pretentious, non-intellectual magazine.”(26) At the start of 1919, after he had seen eight issues through the press, Gold wrote that New Masses had been slowly finding its way to a proletarian literature.\n\nA new writer has been appearing; a wild youth of about twenty-two, the son of working-class parents, who himself works in the lumber camps, coal mines, and steel mills, harvest fields and mountain camps of America… He writes in jets of exasperated feeling and has not time to polish his work… He is a Red but has few theories. It is all instinct with him. His writing is no conscious straining after proletarian art, but the natural flower of his environment. He writes that way because it is the only way for him.(27)\n\nUnderlying this was a confidence that a new style of art would emerge organically out of working-class experience.(28)\n\nIn some degree Gold’s call for workers to send in their writings and not worry about style — on the model of the worker correspondents in the Soviet Union — was answered.(29) The magazine showcased a small cadre of worker writers such as Joseph Kalar (“a paper-miller worker and timber handler”), Martin Russak (a Paterson textile worker), and Herman Spector, who had taken a whole array of jobs including shipping clerk, truck driver, soda jerker and factory hand.(30)\n\nAmong these was Gold himself, who from June 1928 began publishing autobiographical texts in New Masses under the general title “From a Book of East Side Memoirs.” In 1929 Gold’s sketches — which dated from as far back as 1917 and had in many cases been dramatically reworked — were gathered together in book form under the title of Jews Without Money.\n\nThis was Gold’s most substantial literary achievement, a mix of reminiscences and character sketches that suggest the irrepressible energy of working-class immigrants living in poverty and squalor. The episodes are by turns violent, brutal, and sentimental. There is scarcely a hint of politics in the book until the final page, where the desperate adolescent narrator hears a man on an East Side soap-box proclaim “that out of the despair, melancholy and helpless rage of millions, a world movement had been born to abolish poverty.” “O workers’ Revolution,” Gold writes, “You are the true Messiah. You will destroy the East Side when you come, and build there a garden for the human spirit.”(31)\n\nIn itself New Masses could not perform the role of building a proletarian culture. Communist organizing of culture required the same mechanisms as the party’s organizing in other fields, namely the setting up of fronts to serve as a transmission apparatus between the small vanguard of disciplined communists that made up the party and those sympathizers outside its ranks whose consciousness needed to be raised and energies channeled in useful directions.(32) The name of the main cultural front in the United States was the John Reed Clubs, the first of which was set up in New York by members of the New Masses circle in October 1929.(33)\n\nIt is hard to be sure of the scale of the clubs. The “Draft Manifesto of John Reed Clubs,” published in June 1932 claimed there were thirteen clubs “throughout the country”;(34) in May 1934 the leading Communist critic Joshua Kunitz claimed in New Masses that there were 30.(35) An internal memorandum of 1932 gives total membership of the clubs as 735, with the largest being in New York with 160 and the smallest being in Portland, Oregon, and Carmel, California, each with a mere 12. A later party memorandum gives membership of the New York club as approximately 250 and presumably the membership of other clubs had also grown.(36)\n\nOne thing that can be said with certainty is that the Clubs did not function satisfactorily from the party’s perspective. This was partly because they were set up haphazardly and proved hard to weld into a cohesive national organization. Many branches contained “very few writers and artists” and most members were “teachers, lawyers, dentists and other types of professional.”(37) A party memorandum from 1932 describes many members of the New York club as “uprooted bohemian elements” without abilities.(38) While a discussion document circulated in the New York Club in 1931 or 1932 described the clubs’ object as to provide “a functioning center of proletarian culture; to clarify and elaborate the point of view of proletarian as opposed to bourgeois culture; to extend the influence of the club and the revolutionary working class movement,”(39) this emphasis on proletarianism rubbed against the imperative to draw fellow travelers into the movement.\n\nIn late 1930, New Masses and the John Reed Clubs sent a six-man delegation to a Conference of Revolutionary and Proletarian Writers at Kharkov in the Ukraine, organized by the International Bureau of Revolutionary Literature. The Conference was dominated by RAPP (The Russian Association of Proletarian Writers, discussed above). But although the Program of Action that the delegation brought back emphasized that the American comrades should extend “the proletarian base” of the movement “by drawing in new proletarian elements,” they were also instructed to win over “radicalized intellectuals.” The delegates reported that this was not a perfunctory injunction: the Plenum had warned that the “straightjacket of sectarianism… must be fought in all countries.”(40) In fact, under this international instruction the clubs had been set a contradictory agenda.\n\n[Part II will conclude the essay in the following issue.]\n\nNotes\n\nJuly-August 2015, ATC 177"}, {"url": "https://publicseminar.org/2017/11/john-reed-romantic-revolutionary/", "page_content": "“This class struggle sure plays hell with your poetry.”\n\nThe words are those of John Reed, American poet, fiction writer, journalist, radical, socialist, and finally communist, whose biography I wrote more than four decades ago. He used that phrase in 1919 in conversation with Max Eastman, editor of the radical little magazine, The Masses, and its successor, The Liberator. Reed was then deeply involved in contentious and time-consuming leftist politics as one of the leaders of a group that broke away from the Socialist Party to form the Communist Labor Party. He had just completed writing Ten Days That Shook the World, a classic that is at once an eye-witness report and a history of the Bolshevik Revolution. Yet despite his radical activities and writings, to me Jack Reed is best understood as someone who lived and saw the world through the eyes of a poet.\n\nOctober 22, was the 130th anniversary of his birth. He only lived to the age of 33, but in those few years he accomplished the work of more than a single lifetime. For the next half century Ten Days would define how much of the world came to understand the shape and course of the Russian Revolution. It also — though I have never been able to find precise figures — must have been one of the most widely circulated books of the twentieth century. Translated into dozens of languages and promoted by every communist party in the world, it was in theory read by all party members as a roadmap for a twentieth-century revolution.\n\nReed was an early contributor to Harriet Monroe’s famed little magazine, Poetry, which began publishing in 1912 and continues to this day. During its first year of publication, Reed was one of ten award-winning poets. The competition for space in the journal was fierce. In its pages that year were some of the most formidable poets of the century: William Butler Yeats, Amy Lowell, Ezra Pound, William Carlos Williams, and Radbindranath Tagore.\n\nReed led what I would call a poetic, romantic, or even an epic life. He sought out the most intense experiences, threw himself into new and often dangerous situations — labor conflict, wars, revolutions — at home and abroad, the final one being the uprising he witnessed in Petrograd in 1917. To his contemporaries, as to us, he could seem to be a figure out of a novel, someone who was a little (a lot?) larger than life, and — it must be admitted — more than a touch ambitious and egocentric in his quest for truth, justice, art, and love. He was often in the news for being arrested at a strike or protest rally, directing an Industrial Workers of the World pageant at Madison Square Garden, having himself declared persona non grata in two countries for picking up a rifle and firing a shot from a German trench towards France, or pursuing an affair with the rich and famous salon hostess, Mabel Dodge, across two continents.\n\nJack Reed was born literally and figuratively at the top, on Cedar Hill overlooking Portland in 1887 at the home of his grandfather, Henry Green, one of the great pioneer capitalists of the Northwest. His businessman father was something of a maverick: a progressive in a conservative town, he played a role in Teddy Roosevelt’s prosecution of the timber barons who had been illegally seizing government forests. He was a sickly child with serious kidney problems. Confined to home for several years, he lived through books, particularly Arthurian tales of knights, dragons, and damsels in distress. Such notions of romance never fully left him. Among his papers when he died in 1920 were sketches of two novels that he had been working on while stuck for several months in a prison in Finland on his way home from the Russian Revolution. One was a romance titled The Ever Victorious, about the final battlefield struggles of an aged medieval king. The other, a kind of proletarian romantic epic of the sort that John Dos Passos would later write, was a partially autobiographical work that dealt with the rise of modern industry, and the labor and radical movements in the twentieth century.\n\nEarly in life, Jack knew he wanted to be a writer. Some of his first sketches are about camping trips he and friends took up the Willamette River. His parents sent him to a private high school, Morristown Academy, in New Jersey. He went on to Harvard as a member of the Class of 1910, which included Walter Lippmann and T.S. Eliot. Harvard in those years was a place of ferment in the arts and social thought, the early twentieth century’s equivalent of Berkeley or other campuses in the sixties. There Reed became involved in a multiplicity of activities — football cheerleader, Socialist Club member, writer for and editor of various campus papers, literary reviews, and the distinctly upper-class club, Hasty Pudding, for which he penned its annual play. Yet it was at Harvard that he began to see himself as a Westerner, which to him meant someone who lived large and outside the norms of polite society, someone who was free to indulge in unusual and forbidden activities. One good example: in 1910 a tour of the continent was de rigeur for Harvard grads (all men of course), but Reed did the tour his own way. Not in luxury, but by working on a cattle boat. And though he did have a formal suit made for him in London to attend some swanky affairs at the American Embassy, he walked and hitch-hiked his way across much of the continent, even marching across parts of Spain, not one of the normal destinations on such graduation tours.\n\nAfter returning to the US, there was only one place for an aspiring writer to live: Greenwich Village. In the decade prior to the World War, it was the center of that first great flourishing of American bohemia, an unstable but heady mixture of avant-garde art, lifestyle innovation, and radical politics. Reed was soon friends with major artistic and radical political figures of the day: artists John Sloan and George Bellows; writers Floyd Dell and Lincoln Steffens; anarchist Emma Goldman; activist Margaret Sanger; and labor leader Bill Haywood, president of the Industrial Workers of the World. He quickly became one of the editors of The Masses, the main underground (i.e., small circulation) organ of the Village. Sometime during this period an uptown feature writer labeled Reed the “Golden Boy of Greenwich Village.” The label stuck, though no doubt some villagers used it ironically. But already in his mid-twenties, he was a counter cultural hero.\n\nIn 1912 Reed was publishing in both the underground press and commercial magazines — sketches, short stories, and poems. He made his living as a freelance writer and a journalist, sometimes writing for large circulation, slick magazines. He covered events and people both trivial and important, on occasion interviewing or doing profiles of figures like William Jennings Bryan, Evangelist Billy Sunday, Socialist Eugene V. Debs, and President Woodrow Wilson. But the specialty that made him famous or notorious (take your pick) was his reporting from the site of major industrial upheavals. The first time he was arrested for talking back to a cop was during the strike of IWW silk workers in Paterson, New Jersey in 1913, a strike that was being totally blacked out in the New York City press. A year later he was in Ludlow, Colorado, reporting on how the National Guard had shot down in cold blood more than 25 striking coal miners in their encampment. Reed wrote about strikes with such power and identification with the workers — his favorites were the Wobblies — that he ended up in jail several more times for vocally defending their rights.\n\nIn mid-1914 the popular, mass circulation Metropolitan Magazine sent him off to cover the revolution that was unfolding in Mexico. Unlike other American reporters who sat in El Paso and interviewed refugees from the conflict, Reed waded across the Rio Grande, hitched a ride in a donkey car with an itinerant Arab peddler, and made his way to Chihuahua where he met and hung out for a while at the headquarters of the legendary Pancho Villa, who gave him a nickname, Chatito (Pug Nose). Then Jack went off and spent six weeks riding with a troop of Villa’s horseback soldiers, living with them and fleeing with them during a major retreat. His electric, visceral reporting, and especially his front-line stories from the crucial Battle of Torreon, turned him into the highest paid journalist in the country ($500 a week plus $500 for every article; $500 equaling $12,300 in 2017 currency). His weekly stories were advertised with a fanciful sketch of Reed, drawn by an artist, standing on a battlefield, sombrero on his head and bandoliers of cartridges across his chest.\n\nThough now a famous figure, Reed did not give up his attachment to the thriving culture of the Village. He continued to publish in and work as an editor of The Masses, backed Margaret Sanger in her campaign for birth control, and was one of the founding members of that avant-garde theater company, the Provincetown Players, which produced the first works of the great playwright Eugene O’Neill. His leftism was instinctual rather than theoretical, though towards the end of his life he did get around to reading a bit of Marx. When the First World War broke out, he wrote an essay in The Masses titled, “A Trader’s War.” This attitude was only strengthened after a 1914 tour as a reporter for the Metropolitan on both the Western and the Eastern Fronts in France and Germany. His writing suffered. He could not draw emotional creativity from the slaughter of the trenches. A year later he was in the Balkans, where he walked across endless fields of corpses, and denounced the struggle between Austria-Hungary and Serbia as dreadful and meaningless.\n\nI am here subordinating his love life, including his many affairs in the Village and abroad, and his love for Louise Bryant, who became his wife, to Reed as writer and activist. Louise has a major role in my book and in the film Reds, where their stormy days together go on way too long for my taste. But their relationship says something about Village culture in those days. When they got married because he was in danger a lot and wanted her to be his legal heir, they kept the act a secret from their friends, ashamed of having such a traditional sanction for their life together. Several times they separated, but she did accompany him to Russia and later wrote her own book, Six Months in Red Russia, about staying on in the new Soviet Union after his demise. I am also leaving out his many illnesses, including his repeated kidney troubles and eventual surgery. When he was in Russia, Reed was a man with only one kidney.\n\nAs the US edged towards and then entered the conflict in 1917, Jack, both in print and on the podium at mass rallies, denounced American involvement, and got himself arrested and jailed a couple of more times. These antiwar activities got him banned from all major US commercial publications, including the Metropolitan. By mid-1917 the highest paid reporter in the country was now out of work, his only outlets the newspaper, the Socialist Call, and The Masses. Soon even the latter was gone, banned from postal circulation by the U.S. government. In 1919 he stood trial twice with other editors under the Sedition Act, but they were not convicted. His offense: a headline he put over a medical report from the UK that talked about how many soldiers were suffering from Shell Shock, or what we would call PTSD. The headline read: “Knit a straightjacket for your boy.”\n\nIn the summer of 1917, Reed’s reportorial nose sniffed a major story brewing in Russia, which had gone through a “democratic” revolution a few months earlier. He borrowed money from a friend, got an assignment from two tiny leftist publications, and went off to Petrograd, a perilous journey in seas full of German submarines sinking American ships. He arrived just a few weeks before the October Revolution and went everywhere in Petrograd: to the cafes on the Nevsky Prospekt where writers gathered; factories in the Viborg district where workers debated which parties to support; the Winter Palace, where Prime Minister Kerensky lived in the Tsar’s old chambers; the Marinsky Palace, seat of the Provisional Government; Smolny Institute, where the Bolsheviks and Socialist Revolutionaries made their headquarters; the trenches on the front lines in nearby Latvia. He interviewed everyone from factory workers to Kerensky, Leon Trotsky, and the leader, Vladimir Ilyich Lenin. Through American government intervention, he was stopped in Finland on the way home and jailed in solitary confinement. Freed after two months, he returned to New York where officials met him on the docks and seized a trunk load of papers he had collected in Petrograd. It took influential friends almost a year to spring them free.\n\nDifficult as it is to believe, he wrote Ten Days That Shook the World in two months. Following its publication, he helped to organize the Communist Labor Party of the United States, then returned to Moscow as the tiny party’s representative to the Second Congress of the Communist International, where he argued with Bolshevik leaders over the tactics of how to bring the revolution to America. Annoyed at their support for the AFL rather than the IWW, he resigned when he was outvoted, then reconsidered and withdrew his resignation before going off to the Congress of the Peoples of the East in Baku. There he contracted the typhus that would kill him in 1920 just a few days short of his thirty-third birthday. Some three million Russians died of the same disease, in part because the Allies were blockading the ports of the new Russian regime and no supplies or medications could get through.\n\nOn the first page, Reed calls Ten Days “a slice of intensified history.” We might want to call it The New Journalism. Decades before Hunter Thompson began including himself in his reporting, Reed was doing the same thing. He is the observer participant in the days that he immortalized. But the book can be a difficult one to read because its narrative is slowed down, stuffed as it is with so much raw data (posters torn from walls, pages from newspapers, memos written by political factions, and resolutions from various groups of soldiers, workers, or committees jam the pages along with his firsthand reports and reflections.)\n\nEven so, anyone who makes the effort will find it to be an exciting book. The most diverse people have given it ringing endorsements. Lenin, of course, writing in an introduction: “Unreservedly do I recommend it to the workers of the world.” George Kennan, the conservative diplomat and father of the theory of Containment, the policy which governed American actions towards the Soviet Union for many decades: “Reed’s account of events . . . rises above every other contemporary record for its literary power, its penetration, its command of detail.” In 1999 a group of judges centered at New York University created a list of the top 100 works of American journalism of the twentieth century. Ten Days was number seven.\n\nJohn Reed should be remembered as a symbolic figure, the poet as radical and revolutionary. He was a man who took his beliefs, those of the counter culture of his era, all the way. Not many of his fellow Bohemian radicals followed. The anarchist George Bellows could go from drawing anti-war to pro-war posters after 1917, but Reed stayed true to his beliefs. What struck me when I was writing his biography in the early seventies, and what is true again today, is the absolute contemporaneity of the issues he wrote about: the implicit and then explicit critique of capitalism that runs like a thread through his writings; his support for immigrants (he knew mostly Italian, Polish, and Russians), and for the birth control movement; his exposures of exploitation in factories, opposition to involvement in foreign wars and to government censorship; his fervid support of the right to have one’s voice and opinions heard. Ultimately, with Reed one sees the growing realization that what was taught in high school and college about the way America functioned — the notion of a pure democracy, equality, liberty and justice for all –was as much (perhaps more?) a mythic ideology than a daily reality. The more things change the more they stay the same.\n\nRobert A. Rosenstone, Emeritus Professor of History at Caltech, is the author of more than a dozen books, including Romantic Revolutionary: A Biography of John Reed (Knopf, 1975) and, most recently, Adventures of a Postmodern Historian (Bloomsbury, 2016). He is the Founding Editor of the journal Rethinking History."}, {"url": "https://www.marxists.org/history/usa/pubs/new-masses/", "page_content": "New Masses\n\nIntroduction to the New Masses digital archive on Marxists Internet Archive\n\n\n\nThe Riazanov Library, partnered with Marxists.org, is delighted to present here every issue and every page of New Masses 1926 - 1948, scanned in relatively high resolution, art-preserving fashion. This project took me six years to complete. It's one of the biggest of the Riazanov Library digital archive projects.\n\nThe scans here I made from my personal collection, from the personal collection of Tim Davenport, from the personal collection of Ted Watts, and from the holdings of Holt Labor Library of San Francisco.\n\nEarly on in this project, Stanford’s Hoover Library gave us very kind assistance in supplying color scans of color covers of two issues (July 1926 and May 1927) and with a color 2 page center graphic art work in May 1927 where we did not have access to the original paper. May 1927 is an exceptionally rare issue: neither Tamiment Library nor Hatcher Labadie library had a copy of it. Two weeks after I received those scans, a copy of May 1927 became available from Lorne Bair rare books, enabling me to make scans of it entirely from the original paper I remain very grateful for the extremely kind and generous assistance provided by Stanford University's Hoover Library in this (and in some other) project(s).\n\nI also could not have made this digital archive without the help of John Durham of Bolerium Books of San Francisco, Daryl Van Fleet of Bibliomania books of Oakland, and Eugene Povirk of Southpaw Books of Massachusetts, who supplied me with large numbers of the issues I scanned.\n\nI began this archive project in late 2014. I originally intended to provide digital images of only the early, monthly New Masses issues of 1926 - 1933. But as time went by, and original paper complete runs of subsequent issues became available to me, the project gradually expanded, and now it is done. Complete through the last issue of New Masses in January of 1948.\n\nFor the years 1926 through 1936 we present here, with the very kind and generous permission of the author, Theodore Watt's three books of indexes and tables of contents to New Masses. Two that were published (1926-1933, and 1934-1935), and one unpublished work of his for 1936 New Masses. These are searchable PDF files. They should greatly facilitate finding specific material, authors, subjects, art, and artists in those years.\n\nContinue reading the full Introduction here. This can also be downloaded in PDF format here.\n\nSee the expanded essay How I Scanned Scanned New Masses for more information on scanning techniques.\n\nMartin H. Goodman MD\n\nSan Pablo, CA February 2020\n\nDirector, Riazanov Library digital archive projects\n\nIndex to New Masses\n\nTed Watts compiled a set of indexes for New Masses for the following years:\n\n1926-1933 | 1934-1935 | 1936\n\nJump to 1926 | 1927 | 1928 | 1929 | 1930 | 1931 | 1932 | 1933 | 1934\n\n1935 | 1936 | 1937 | 1938 | 1939 | 1940 | 1941 | 1942 | 1943 | 1944 | 1945 | 1946 | 1947 | 1948\n\n26 January 2020"}, {"url": "http://www.redwedgemagazine.com/online-issue/john-reed-clubs-proletarian-art-1", "page_content": "Born Itzok Granich on New York’s Lower East Side in 1893, Gold adopted his pseudonym during the Red Scare of 1919-20. He had discovered The Masses in 1914 and was reportedly so enthused by it that he moved to Greenwich Village. In 1921 he became an editor of The Liberator, which published his manifesto “Towards Proletarian Art” in February. This is an apocalyptic Whitmanesque outpouring that calls for “the masses,” the former children of the tenements, to replace the art of intellectuals, filled with “solitary pain” and “complexities,” with a new art, “primitive and clean,” filled with the breath of LIFE. It was not in the “hot-house air” of little magazines such as Seven Arts and Little Review that the “lusty great tree” of such art would grow; it was rather in “the fields, factories and workshops of America.” [19]\n\nGold’s call has been associated with the 1921 book Proletcult by the British Marxists Eden and Cedar Paul, which contained a brief account of the Russian Prolet’kult movement and called for the setting up of a “Red Proletcult International.” But if Gold thought Prolet’kult was the future of Soviet culture he had got things badly wrong.\n\nAlthough some Bolshevik leaders such as Lunacharsky and Bukharin were sympathetic to the movement, the party’s Central Committee was not prepared to tolerate a mass organization that sought autonomy from the party and by the end of 1920 it was subordinated to the Commissariat for Education. This was at the insistence of Lenin, who had engaged in a series of theoretical disputes with one of Prolet’kult’s leading figures, Aleksandr Bogdanov, before 1914 and who thought the idea of making a proletarian culture ex novo was nonsense. [19] Gold was seemingly unaware of all this. In an otherwise favorable review of Trotsky’s Literature and Revolution in October 1926, he took issue with Trotsky’s argument that there neither was nor could be a proletarian art: “It is not a matter of theory; it is a fact that a proletarian style is emerging in art. It will be as transitory as other styles; but it will have its day.” [20]\n\nGold’s efforts to promote an American proletarian art in the late 1920s and early 1930s may have found encouragement in the rhetoric of proletarianism and renewed class struggle that were part of the so-called Cultural Revolution that accompanied the launching of the First Five Year Plan in 1928 and of the Collectivization of Agriculture the following year. [21]\n\nOne aspect of the Cultural Revolution was a harsh stance towards non-party intellectuals, the beginnings of which was marked by the trial of engineers and technicians from the Shakhty area of the Donbass on charges of conspiracy and sabotage in May-June 1928, followed by purges in schools and universities and anti-bureaucratic campaigns in the government apparatus. [22]\n\nAnother was what Sheila Fitzpatrick has called the end of “NEP in culture,” and the dominance of a “coercive, ignorant or contemptuous” attitude to “inherited culture” and a valorization of so-called proletarian culture. [23] In literature the principle voice of this new “hard line” was the Russian Association of Proletarian Writers (or RAPP), which from 1928-32, without any official party mandate, assumed leadership in a campaign to unmask “the rightist danger” in the arts in the name of proletarian purity. [24] RAPP’s counterpart in the visual arts was the Association of Revolutionary Artists, or AKhRR.\n\nThe new turn in Soviet domestic policies was matched by a shift in interpretation of the international situation which was announced at the Sixth Comintern Congress in July-September 1928, where the so-called Third Period line was defined. This was premised on the view that the capitalist system was entering a new period of crisis that would issue in wars between the imperialist states and war against the USSR.\n\nIn the words of the “Theses and Program” adopted on the last day, “When the revolutionary tide is rising, when the ruling classes are disorganized and the masses in a state of revolutionary ferment, when the middle strata are inclined to turn towards the proletariat and the masses display their readiness of battle and for sacrifice, it is the task of the proletarian party to lead the masses to a frontal assault on the bourgeois State.” [25] The onset of the Great Depression at the end of 1929 seemed at least to confirm the thesis about capitalism entering a renewed phase of crisis.\n\nSeeking Worker Voices\n\nGold described the policy of New Masses under his editorship as to make “a non-literary, non-pretentious, non-intellectual magazine.” [26] At the start of 1919, after he had seen eight issues through the press, Gold wrote that New Masses had been slowly finding its way to a proletarian literature.\n\nA new writer has been appearing; a wild youth of about twenty-two, the son of working-class parents, who himself works in the lumber camps, coal mines, and steel mills, harvest fields and mountain camps of America… He writes in jets of exasperated feeling and has not time to polish his work… He is a Red but has few theories. It is all instinct with him. His writing is no conscious straining after proletarian art, but the natural flower of his environment. He writes that way because it is the only way for him. [27]\n\nUnderlying this was a confidence that a new style of art would emerge organically out of working-class experience. [28]\n\nIn some degree Gold’s call for workers to send in their writings and not worry about style — on the model of the worker correspondents in the Soviet Union — was answered. [29] The magazine showcased a small cadre of worker writers such as Joseph Kalar (“a paper-miller worker and timber handler”), Martin Russak (a Paterson textile worker), and Herman Spector, who had taken a whole array of jobs including shipping clerk, truck driver, soda jerker and factory hand. [30]\n\nAmong these was Gold himself, who from June 1928 began publishing autobiographical texts in New Masses under the general title “From a Book of East Side Memoirs.” In 1929 Gold’s sketches — which dated from as far back as 1917 and had in many cases been dramatically reworked — were gathered together in book form under the title of Jews Without Money.\n\nThis was Gold’s most substantial literary achievement, a mix of reminiscences and character sketches that suggest the irrepressible energy of working-class immigrants living in poverty and squalor. The episodes are by turns violent, brutal, and sentimental. There is scarcely a hint of politics in the book until the final page, where the desperate adolescent narrator hears a man on an East Side soap-box proclaim “that out of the despair, melancholy and helpless rage of millions, a world movement had been born to abolish poverty.” “O workers’ Revolution,” Gold writes, “You are the true Messiah. You will destroy the East Side when you come, and build there a garden for the human spirit.” [31]\n\nIn itself New Masses could not perform the role of building a proletarian culture. Communist organizing of culture required the same mechanisms as the party’s organizing in other fields, namely the setting up of fronts to serve as a transmission apparatus between the small vanguard of disciplined communists that made up the party and those sympathizers outside its ranks whose consciousness needed to be raised and energies channeled in useful directions. [32] The name of the main cultural front in the United States was the John Reed Clubs, the first of which was set up in New York by members of the New Masses circle in October 1929. [33]\n\nIt is hard to be sure of the scale of the clubs. The “Draft Manifesto of John Reed Clubs,” published in June 1932 claimed there were thirteen clubs “throughout the country”; [34] in May 1934 the leading Communist critic Joshua Kunitz claimed in New Masses that there were 30. [35] An internal memorandum of 1932 gives total membership of the clubs as 735, with the largest being in New York with 160 and the smallest being in Portland, Oregon, and Carmel, California, each with a mere 12. A later party memorandum gives membership of the New York club as approximately 250 and presumably the membership of other clubs had also grown. [36]\n\nOne thing that can be said with certainty is that the Clubs did not function satisfactorily from the party’s perspective. This was partly because they were set up haphazardly and proved hard to weld into a cohesive national organization. Many branches contained “very few writers and artists” and most members were “teachers, lawyers, dentists and other types of professional.” [37] A party memorandum from 1932 describes many members of the New York club as “uprooted bohemian elements” without abilities. [38] While a discussion document circulated in the New York Club in 1931 or 1932 described the clubs’ object as to provide “a functioning center of proletarian culture; to clarify and elaborate the point of view of proletarian as opposed to bourgeois culture; to extend the influence of the club and the revolutionary working class movement,” [39] this emphasis on proletarianism rubbed against the imperative to draw fellow travelers into the movement.\n\nIn late 1930, New Masses and the John Reed Clubs sent a six-man delegation to a Conference of Revolutionary and Proletarian Writers at Kharkov in the Ukraine, organized by the International Bureau of Revolutionary Literature. The Conference was dominated by RAPP (The Russian Association of Proletarian Writers, discussed above). But although the Program of Action that the delegation brought back emphasized that the American comrades should extend “the proletarian base” of the movement “by drawing in new proletarian elements,” they were also instructed to win over “radicalized intellectuals.” The delegates reported that this was not a perfunctory injunction: the Plenum had warned that the “straightjacket of sectarianism… must be fought in all countries.” [42] In fact, under this international instruction the clubs had been set a contradictory agenda.\n\nEndnotes\n\nAbbreviations: NM = New Masses; DW = Daily Worker\n\nMikhail Lifshitz [Lifshits], The Philosophy of Art of Karl Marx, tr. Ralph B. Winn (New York: Critics Group, 1938) — originally published in Russian in 1935. The first U.S. publication of a selection from the founders’ statements on the arts was Karl Marx and Friedrich Engels, Literature and Art: Selections from their Writings (New York: International Publishers, 1947). E.g., Joseph Freeman, “Literary Theories,” NM 4, no. 12 (May 1929), 13: “Since Plekhanoff little has been added to the general theory of art, but important specific applications have been made.” The bulk of these have come out of USSR, Freeman said, while making an exception for the German art historian Wilhelm Hausenstein. Freeman was reviewing Marc Ickowicz, La littérature à la lumière du matérialisme historique. See also A. Gurstein, “Art and Class,” NM 8, no. 5 (December 1932): 8-9. The first U.S. edition of Plekhanov’s text appeared under the title Art and Society: A Marxist Analysis, tr. Paul S. Leitner, Alfred Goldstein, and C.H. Crout (New York: Critics Group, 1937). G.V. Plekhanov, Art and Social Life (London: Lawrence and Wishart, 1953), 190-95, 215 Plekhanov 1953, 172, 177, 193, 218. Tanja Bürgel (ed.), Tendenzkunst-Debatte 1910-1912 (Berlin: Akademie-Verlag, 1987). Floyd Dell, “Art under the Bolsheviks,” Liberator 2, no. 6 (June 1919): 11-18. Louis Lozowick, “A Note on Modern Russian Art,” Soviet Russia Pictorial 9, no. 6. (June 1924): 164-45, 168. Review of Lozowick, Modern Russian Art, The Workers’ Monthly (August 1925): 470. Harvey Klehr, The Heyday of American Communism: The Depression Decade (New York: Basic Books, 1984), 367, 475 n. 4. Cf. “For the Bolshevization of the Communist Party of the United States,” DW, 5 August 1929. Theodore Draper, American Communism and Soviet Russia: The Formative Period (New York: Vintage Books, 1986), chapter 7, and 187-90. Cf. Klehr 1984, 91, 429 n. 15. Gordon Craig, Germany 1866-1945 New York: Oxford University Press), 461. The population of the U.S.A. in 1930 was 123 million plus; the population of Germany in 1925 was 62 million. Klehr 1984, 91. Draper’s two volumes on the history of the Communist Party in the 1920s have now been supplemented by Jacob A. Zumoff’s important study, The Communist International and U.S. Communism, 1919-1929 (Chicago: Haymarket Books, 2015). Albert Fried, Communism in America: A History in Documents New York: Columbia University Press, 1997), 19-21. Joseph Freeman, “Ivory Towers — White and Red,” NM 12, no. 11 (11 September 1934), 21. Freeman 1934, 22. The magazine got a new Executive Board at end of 1930 and “Notes of the Month” was attributed to “The Editors” and not to Gold solo. On the reorganization of New Masses in early 1931, see “Memorandum Concerning the Reorganization of the Literary and Professional Sections of the Movement” (Freeman Papers, Hoover Institute), 172-8, 5. Michael Gold, “Towards Proletarian Art,” in Michael Folsom (ed.) Mike Gold: A Literary Anthology (New York: International Publishers 1972), 70. Brandon Taylor, Art and Literature under the Bolsheviks, 2 vols. (London: Pluto Press, 1991, 1992) vol. 1, 85-85. The Pauls described Bogdanov as “the most uncompromising and unquestionably the most interesting, among the Russian theorists of Proletcult,” and quoted from a German translation of his essay Die Wissenschaft und die Arbeiterklasse (Die rote Fahne: Berlin, 1920). See Eden and Cedar Paul, Proletcult (Proletarian Culture) (Leonard Parsons: London, 1921), 94. Gold, “America Needs a Critic,” Folsom (ed.) 1972, 136-7. E.g., N. Stevens, “A Glance at Collective Farming in the Soviet Union, DW, 28 November 1930. Sheila Fitzpatrick, “Cultural Revolution as Class War,” in Fitzpatrick (ed.), Cultural Revolution in Russia, 1928-1931 (Bloomington: Indiana University Press, 1984), 9-10, 21-25. Cf. “Sabotagers Finish Story of How War Was to Start Against USSR, DW, 29 November 1920; Page Arnot, “What the Moscow Trial Reveals,” DW, 1 December 1930. For a cognate attack on intellectuals in the U.S. context, see “To John Dos Passos,” NM 10, no. 10 (6 March 1934), 8. Sheila Fitzpatrick, “‘The Soft’ Line on Culture and Its Enemies: Soviet Cultural Policy, 1922-1927,” Slavic Review 33 (June 1974), 285, 270. Fitzpatrick 1974, 28-30. In Fried (ed). 1997, 110. Michael Gold, “Brisbane, We Are Still Here!” NM 4, no. 3 (August 1928): 2. Michael Gold, “Go Left, Young Writers!” in Folsom (ed.), 1972, 188-89. On Gold’s proletarian aesthetic, see James F. Murphy, The Proletarian Moment: The Controversy over Leftism in Literature (Urbana and Chicago: University of Illinois Press, 1991), 64-68; Alan M. Wald, Exiles from a Future Time: The Forging of the Mid-Twentieth-Century Literary Left (Chapel Hill and London: University of North Carolina Press, 2002), chapter 2. After his return from a conference in the Ukraine in 1930 he wrote: “New art forms come into being, not as the result of some critic’s ratiocination, but as the result of a new universal feeling. I repeat, we here share this feeling. / What I am driving at very clumsily is this; there will surely be a new great proletarian style in all the arts, because at this congress, one can sense the reality of the new universal feeling at work in the minds of sensitive artists.” — Gold, “Notes form Kharkov,” NM 6, no. 10 (March 1931), 4. Cf. Gold on the international spread of Proletarian Literature in Michael Gold, 120 Million (New York: International Publishers, 1929), 7-8. This kind of position was criticized by Joshua Kunitz, writing as J.Q. Neets, in “Let Us Master Our Art,” NM 6, no. 2 (July 1930). Presumably this was the subject of the debate between Gold and Kunitz at the JRC in June 1930 — “John Reed Club to Hold Debate on Workers’ Art,” DW, 24 June 1930. Gold, “Write for Us!” NM (July 1928), 2; Gold, “Brisbane, We Are Still Here!” Cf. “Call for First Congress of Worker Correspondents,” DW, 31 May 1929 — the Congress was to be held in Cleveland. See Daniel Aaron, Writers on the Left: Episodes in American Literary Communism, intro. by Alan Wald (New York: Columbia University Press, 1992), 210-11. Michael Gold, Jews Without Money (London: Rita Searl, 1948) 209. On the reworking of the materials that went into the book, see Wald 2002, 55-6. On these structures, see Draper 1986, 171-85. Jacob Burck, “For a Proletarian Art,” American Mercury 34, no. 135 (March 1935), 335. “Draft Manifesto of John Reed Clubs,” NM 7, no. 12 (June 1932), 4; “JRC Data, First National Congress, May 28-29, 1932,” (Lozowick Papers, Archives of American Art, unfilmed) suggests this was an underestimate. Kunitz, “A Note on Max Eastman,” (review of Max Eastman’s Artists in Uniform: A Study of Literature and Bureaucratism [New York: Knopf, 1934]) NM 11, no. 6 (8 May 1934), 24-25. A second memo in the Lozowick Papers, “John Reed Clubs & Groups,” indicates there were certainly at some time clubs in other cities than those listed in “JRC Data.” “Memorandum Concerning the Reorganization of the Literary and Professional Sections of the Movement,” Freeman Papers), 1. This relates to correspondence between Joseph Freeman to Alexander Trachtenberg of 7 August 1933 and 10 August 1933; Alan Calmer to Joseph Freeman, 27 April 1934, 4 September 1934 and undated; Joseph Freeman to Alan Calmer, 10 September 1934. “Memorandum Concerning,” 1. The haphazardness of the organization is confirmed by Gold’s speech at Kharkov. See Literature of World Revolution (November 1931), 184-8. “memo,” probably by Freeman, in Freeman Papers, dated 1931, but datable to 1932 on internal evidence. “Proposals for Activities of John Reed Clubs” (Hugo Gellert Papers, Box 4, Archives of American Art). Fred Ellis et. al., “The Charkov Conference of Revolutionary Writers,” NM 6, no. 9 (February 1931), 7, 8. For Kharkov, and Max Eastman’s misrepresentation of it in Artists in Uniform, see Eric Homberger, American Writers and Radical Politics, 1900-39: Equivocal Commitments (Basingstoke and London: Macmillan, 1986), 132-40.\n\n\n\nThis article, the first of two parts, originally appeared in the July/August issue of Against the Current. The second part will appear at Red Wedge in December."}, {"url": "https://encyclopedia.ushmm.org/content/en/article/john-reed", "page_content": "Excerpt\n\nWe intend to be arrogant, impertinent, in bad taste, but not vulgar...to attack old systems, old morals, old prejudices...to set up new ones in their places....Bound by no creed or theory of social reform, we will express them all, providing they be radical.\n\n—The Masses, John Reed, 1913\n\nWhich of John Reed's Works were Burned?\n\nTen Days that Shook the World (10 Tage, die die Welt erschütterten)\n\nWho was John Reed?\n\nJohn Reed (1887-1920) was born to a wealthy family in Oregon in 1887. He attended Harvard University, where he began his writing career by serving on the editorial boards of Lampoon and Harvard Monthly. Reed joined the staff of the leftist periodical The Masses in New York City in 1913. The following year he participated in the uprising of Pancho Villa in Mexico. In 1917, Reed, a Leninist sympathizer, interviewed the leaders of the Bolshevik Revolution in Russia. The resulting work, Ten Days that Shook the World, was his most well known.\n\nAfter his return to the United States, Reed helped found the Communist US Labor Party in 1919 and served as its first chairman. Reed, who had been charged with sedition in the United States for articles written for The Masses, was indicted as a Communist leader during the post-World War I \"Red Scare.\" He returned to Russia, where he died from typhus in 1920. Reed was honored as a Soviet hero and buried under the Kremlin wall. Some 13 years later, the Nazis burned his account of the Bolshevik Revolution for its Communist sympathies."}, {"url": "https://s-usih.org/2017/12/john-reed-clubs/", "page_content": "Editor's Note This essay, by Nicholas Cox, is the third entry in our roundtable dedicated to John Reed’s classic book about the Russian Revolution, Ten Days That Shook the World. For the first and second contributions to the roundtable, check out the links below. Andrew Hartman, Everybody Knew That Something Was Going to Happen, but Nobody Knew Just What Nate Jones, Bolsheviki Appear to Control Everything Here Nicholas P. Cox is currently the Program Coordinator for the History Department of Houston Community College. He has authored instructional supplements for Oxford UP’s Texas history textbook, Gone to Texas, is revising his first manuscript, a political biography of Colonel Richard M. Johnson of Kentucky, and is currently researching Reconstruction in the black-majority counties of late 19th century Texas. He has given presentations on his research and teaching at the AHA, SHEAR, TXSHA, ETHA, and HASH; referees article submissions for the Journal of South Texas; and reviews books for a number of journals. You can easily find him on Twitter @npcox or by email at [email protected].\n\nIf the 100th anniversary is the opportunity for new readers to approach John Reed’s seminal Ten Days That Shook the World for the first time, or old lefties to revisit a classic, then I would certainly point them next to his journalism on the Mexican Revolution, World War One, and the Ludlow Massacre. Much of this writing appeared in the original The Masses (1912-1917) an essential journal of the Greenich Village bohemian left stifled and ultimately strangled by sedition charges during World War I. Writers like Reed and the editor Max Eastman sustained a pro-worker and avowedly Marxist editorial position in the successor, The Liberator. Issue are available online in cover-to-cover scans thanks to NYU and come highly recommended for understanding the old NYC left of the 1910s.\n\nAt this moment, we are living in an age of real anxiety about the future of mass audience magazines. Sure, The Atlantic or the New Yorker sustain wide spread support from readers of a certain non-confrontational, liberal intellectual and literary set, but broader, popular magazines that reach many more Americans are struggling to remain on the scene. Newsweek is long gone, and perhaps it’s too early to say, but how much longer can Time hold on? Conde-Nast and Hearst publishers are dropping titles, shedding their workforce, and this week’s sale of Time, Inc.’s properties including Time, Fortune, Sports Illustrated, and others raises concerns anew about both, their future viability as profitable ventures or as contributors to American culture in any significant way. For those of us more predisposed toward engaged or combative political news and thought we are regularly reminded that there is a boundless quantity of thoughtful writing by journalists, activists, and academics online in spaces like this one. We are reminded that we are in a flourishing age of small magazines with relatively new, fresh, smart, and substantial, as well as occasionally elegant, periodicals such as n+1 or Jacobin. Undoubtedly, in print or not, social media has gathered a larger audience for provocative and thoughtful writing.\n\nThe 1930s offer a fascinating parallel. Sure, the economic collapse of the Great Depression eviscerated much of the profitability and consumption of popular press magazines and newspapers in the 1930s. And yet, the Depression itself called for a radical reappraisal of America’s commitment to market capitalism as engaged, and often young journalists, novelists, and academics sought to push for increasingly radical reforms. Not surprisingly, John Reed’s activist journalism became a model for left-leaning, especially Communist-leaning or joining writers and artist. As Granville Hicks, Reed’s biographer and later director of the Yaddo artist colony, wrote in his introduction to the 1930s Modern Library edition of Ten Days That Shook the World, Reed “was a hero.” A self-described “out-of-town member of the John Reed Club of New York City,” Hicks would eventually abandon the Communist movement following the 1939 Nazi-Soviet Non-Aggression Pact and move further into the anti-Communist camp as Stalin consolidated power. My interest in these fellow travelers and John Reed Club of New York writers developed as a tangent to a larger project I began in grad school, and hope sometime to return to, on Theodore Dreiser, the Old Left, and the Great Depression. This reappraisal of Reed and Ten Days That Shook the World seems like a worthwhile opportunity to speak a bit about his posthumous impact on radical writing in the 1930s.\n\nWhen Reed died in Russia of typhus in October 1920 he was perhaps the best American representative of the international, cosmopolitan ambitions of global communism as imagined by the Comintern. He traveled to Russia in 1917 to report on the ongoing eastern front of the Great War, observed the Bolshevik Revolution, praised Lenin and Trotksy, and (like his opposition to American intervention in Mexico in 1914) sustained an anti-intervention position against any Allied attempts to roll back the Communist Revoluion. He saw no good could come of American participation in the Revolution. Reed joined the Red Guards, participated in the Second Comintern Congress, and began the active organization of an American communist party in NYC. Among the old left, his burial in the Kremlin with full Soviet honors seemed more than appropriate for an American who had made such a large effort to advance what Reed believed to be a necessary, revolutionary struggle for American workers.\n\nAlong the way Reed had the most interesting of friends. The Masses and other literary and journalistic “small magazines” cultivated an exceptional stable of talent including John Dos Passos, Langston Hughes, Ernest Hemingway, Richard Wright, Eugene O’Neill and many more literary lights of the 1920s. Radical reformers and activists including Margaret Sanger, Emma Goldman, Bill Haywood and others passed through the editorial offices and joined Eastman, Reed, and others in the cafes in the Village popular among the radical left.\n\nIn 1926 Joseph Freeman, Mike Gold, and Walt Carmon revived the The Masses. As the publication most significant to distributing John Reed’s reporting before his death in 1920, the New Masses explicitly drew on his example to establish its own tone and purpose in the Jazz Age. The New Masses offered a continued Marxist critique of politics and society in the Roaring Twenties, and by the 1930s promoted the injection of class conscious themes into popular art, music, and literature as part of the broader Popular Front cultural movement. Reed remained the model for engaged political writing central to The New Masses editorial view. In 1929 Carmon encouraged young writers in his journal’s orbit to found a John Reed Club to cultivate writing and art in Reed’s spirit. Many young writers did just that, and often their work appeared in The New Masses.\n\nThe most significant of the Clubs was centered, of course, in New York City and from 1929 to 1935 promoted a series of modern art exhibits. The Clubs spread to most major cities, most significantly Chicago, San Francisco, and Boston, but ultimately about thirty chapters have been identified by literary historians of the left such as Alan Wald. Club members and editors of The New Masses such as Gold and Freeman pushed established artists such as Theodore Dreiser to take more radical public positions alongside the communist movement on social crises such as the Scotttsboro case in 1931. Richard Wright, whose involvement in the Chicago John Reed Club paved the way for his earliest nonfiction writing in The New Masses, developed his earliest stories and wrote his first 1930s novel while engaged with Club politics. It dissolved shortly after Wright’s departure for New York. In New York, members of the Club such as Philip Rahv, William Philips, and Joseph Freeman founded The Partisan Review in 1934 with an explicit mission to make politics central, leaving The New Masses to continue focusing on literature, art, and culture. Needless to say, Partisan Review and The New Masses would remain central to Great Depression era radical writing and thinking.\n\nFrom the founding in 1929 onward to the establishment of chapters around the nation, the John Reed Clubs were always envisioned as a media effort subordinate to the Communist Party USA. In 1936 the John Reed Clubs dissolved, finding its literary and visual artists forwarded by the CPUSA into either the Communist League of American Writers or the American Artists’ Congress. Like The Partisan Review, the League and Congress embraced a broader, less sectarian Popular Front approach in the 1930s. Their commitment to anti-fascism was largely shared by past Club members. International communism’s broader effort to halt Franco in Spain led many of the John Reed Club writers and artists to advance the Soviet critique of fascism in the Spanish Civil War in their art and writing after 1936. The relationship of the American left and communist sympathizers was, as widely reported and memoired, deeply disturbed by Stalin’s conduct in the 1930s, the Soviet-Nazi non-aggression pact, as well as the Russian invasion of Finland. Many fellow travelers and supporters of Lenin or Trotsky fell away in the 1930s in response to Stalin’s rise. The Partisan Review, which had folded in 1936 after publishing only a few issues in its first two years, reemerged a year later energized by their disgust at the purges in Stalin’s Russia as the leading voice of the anti-Stalinist left. The Artists’ Congress folded in 1942 and the Writers’ League in 1943; with their dissolution any vestiges of the John Reed Clubs vanished as an organization within the Communist Party USA. The New Masses folded in 1948 leaving The Partisan Review as the single most important legacy of the Clubs, but during and after World War II it had embraced an explicitly anti-Stalinist editorial position.\n\nIn our era, there is enough of an interested audience of left-leaning readers to sustain several solid lefty magazines, small journals, and web spaces, and surely these fill a similar niche as The Masses or The Partisan Review as they sustain creative, thoughtful reporting about our moment. Yet it remains to be seen if a lasting coterie of seminal writers will match the constellation of journalists, novelists, and painters who found John Reed’s life inspiring enough to form their own literary-political movement. Often sheltered from the market for popular writing, increasingly contemporary left-leaning journals seem over-reliant on academics to be both the producers of content and the consumers of content. This blog certainly aspires to reach beyond an insular group of academics, surely, as do old and new lefty publications. Yet Reed believed, along with The Masses editor Max Eastman, that their work depended on centering the voices of working people along with a fidelity to the party line, perhaps two compulsions anathema to the left today, even if it finds itself increasingly marginalized to academia. Perhaps we can take a cue from The Masses and the Clubs and cultivate exceptionally talented artists, engage immediately with politics as it unfolds, break down divisions between scholarship, journalism, and literature. But if you’d like to know just how to do that, as soon as you’ve revisited Reed’s classic on the Russian Revolution, dive into Reed’s vast work beyond his magnificent Ten Days That Shook the World. But take some time to read his literary acolytes, too, especially during the tumultuous 1930s."}, {"url": "https://spartacus-educational.com/JmassesN.htm", "page_content": "New Masses\n\nIn 1922 the left-wing journal, The Liberator, was taken over by Robert Minor and the American Communist Party. Many of the people who contributed to the journal such as Michael Gold and John Sloan were unhappy with this development and in May 1926, they started their own journal, the New Masses. Rex Stout, contributed $4,000 to help the magazine get started.\n\nOver the years most of the well-known left-wing writers and artists produced material for the magazine. This included Max Eastman, Upton Sinclair, Sherwood Anderson, Erskine Caldwell, Richard Wright, Ernest Hemingway, Alvah Bessie, James Agee, Ralph Ellison, Joseph North, Langston Hughes, John Dos Passos, Josephine Herbst, Albert Maltz, Agnes Smedley, John L. Spivak, Meridel Le Sueur, Theodore Dreiser, Floyd Dell, Art Young, William Gropper, Albert Hirschfeld, Carl Sandburg, Waldo Frank, Granville Hicks and Eugene O'Neill.\n\nNew Masses (May, 1933)\n\nMichael Gold became editor but when he allowed the New Masses to become a strong supporter of the Soviet Union, non-communists such as Max Eastman, Rex Stout and Floyd Dell ceased to become involved in the journal. Gold produced a visually exciting journal by employing artists such as William Gropper, Art Young, Hugo Gellert and Reginald Marsh. By 1935 sales had reached 25,000.\n\nAccording to David Peck: \"The New Masses sponsored some of the decade's most important literary organizations (the John Reed Clubs in the early thirties, the first American Writers and Artists Congresses in 1935), provoked some of its most controversial literary discussions (on proletarian literature and Marxist literary criticism), and published some of the best radical literature to come out of the thirties (the reportage of Meridel Le Suer, John L. Spivak, Josephine Herbst, and Agnes Smedley).\"\n\nAfter the outbreak of the Spanish Civil War the New Masses was a strong supporter of the Popular Front government and tended to concentrate on the growing fascist threat and in order to achieve left-wing unity was far less critical of liberals and other non-communists.\n\nJoseph North was sent to report on events in Spain. Ernest Hemingway was highly critical of Joseph North's reporting of the Spanish Civil War. He did not like the way that his articles did not provide an objective account of the conflict. \"I like the Communists when they're soldiers; when they're priests, I hate them. Yes, priests, the commissars who hand down the papal bulls... That air of authority your leaders wear, like cassocks.\" Hemingway used to call North \"Stalin\" and on one occasion he told him: \"Listen, Comrade Stalin, we've (the journalists working for the North American Newspaper Alliance) filed more good stuff in one day than the Worker has printed in two years.\"\n\nVincent Sheean, who was working for the New York Herald Tribune, toured the front-line with North and was astonished that his fellow reporter took little interest in military operations or in verifying information until he realized that no matter what happened, North reported the conflict on the orders of the Communist Party of the United States (CPUSA). Milton Wolff agreed with Sheean's assessment and that he \"unfailingly underestimated casualties\" and seemed to \"believe everything he wrote in the Daily Worker\".\n\nThe New Masses ceased publication in March 1948."}, {"url": "https://www.encyclopedia.com/history/encyclopedias-almanacs-transcripts-and-maps/john-silas-reed", "page_content": "John Silas Reed\n\nJohn Silas Reed (1887-1920), American revolutionist, poet, and journalist, became a symbol in many American minds of the Communist revolution in Russia.\n\nJohn Reed was born in the mansion of his maternal grandparents outside Portland, Ore., on Oct. 22, 1887. His father sold agricultural implements and insurance. Reed was a frail youngster and suffered with a kidney ailment. He attended Portland public schools and graduated from Harvard in 1910. Although he felt like an outsider, Reed had been active at the university.\n\nReed went to work for American Magazine, of muckraking fame, and The Masses, a radical publication. Journalists Ida Tarbell and Lincoln Steffens awakened his liberal feelings, but he soon bypassed them as a radical. In 1914 Metropolitan Magazine sent Reed to Mexico, where he boldly walked within the lines of Pancho Villa's army. Villa reportedly made Reed a staff officer and called the journalist \"brigadier general.\" Reed next gave sympathetic coverage to striking coal miners in Colorado. He went to Europe for Metropolitan Magazine when World War I broke out in 1914. He covered the battle fronts in Germany, Russia, Serbia, Romania, and Bulgaria.\n\nReed and his wife, Louise Bryant, were in Russia during the October Revolution. In reporting the Bolshevik effort to gain control, Reed won V. I. Lenin's friendship. Here Reed gathered materials for his most noted work, Ten Days That Shook the World (1919). It is generally recognized that the book lacks factual accuracy, but Bertram Wolfe (1960) contends that \"as literature Reed's book is the finest piece of eyewitness reporting the revolution produced.\"\n\nIn 1918 Reed was named Russian consul general at New York, a status never recognized by the United States. In 1919, after he had been expelled from the National Socialist Convention, he formed the Communist Labor party in the United States. He was arrested several times for incendiary speeches and finally, after printing articles in the Voice of Labor, was indicted for sedition. He fled to the Soviet Union on a forged passport. The thing usually unreported about Reed among the Muscovites was his unrelenting contention that decisions should be made democratically and his opposition to a monolithic society under dictatorial control. Twice he tried to return to the United States but was unsuccessful. Stricken by typhus, he died on Oct. 19, 1920, in Moscow. He was given a state funeral and buried in the Kremlin.\n\nFurther Reading\n\nBertram D. Wolfe's brilliant introduction to the 1960 Modern Library edition of Ten Days That Shook the World takes note of Reed's inconsistencies in the epic, which is more literary than historical. The best work on Reed is Granville Hicks, John Reed: The Making of a Revolutionary (1936). A portrait of Reed is in the anecdotal-historical collection of essays of Bertram D. Wolfe, Strange Communists I Have Known (1965).\n\nAdditional Sources\n\nBaskin, Alex, John Reed: the early years in Greenwich Village, New York: Archives of Social History, 1990.\n\nDuke, David C., John Reed, Boston: Twayne Publishers, 1987.\n\nHomberger, Eric, John Reed, Manchester; New York: Manchester University Press; New York: Distributed exclusively in the USA and Canada by St. Martin's Press, 1990.\n\nRosenstone, Robert A., Romantic revolutionary: a biography of John Reed, Cambridge, Mass.: Harvard University Press, 1990, 1975.\n\nTuck, Jim, Pancho Villa and John Reed: two faces of romantic revolution, Tucson, Ariz.: University of Arizona Press, 1984. □"}], "John Reed Jr. was a founding member of the American Writers' Congress.": [{"url": "https://www.cpusa.org/article/happy-birthday-john-reed/", "page_content": "October 22 marked the birthday of John Reed, most famous for Ten Days that Shook the World, a breathless chronicle of the Russia October Revolution. Reed was a founding member of the Communist Party. He began a career in journalist by writing for New Masses in 1913. His early writings covered the Mexican revolution and Pancho Villa and the Ludlow miners massacre.\n\nIn 1917 he traveled to Russia and was present for the October Revolution. He died of typhus in 1920 was was buried in the Kremlin Wall. Reed’s life in Russia was captured by Warren Beatty’s “Reds” which won 3 Academy Awards.\n\nPhoto: Creative Commons 3.0\n\nComments"}, {"url": "https://s-usih.org/2017/12/john-reed-clubs/", "page_content": "Editor's Note This essay, by Nicholas Cox, is the third entry in our roundtable dedicated to John Reed’s classic book about the Russian Revolution, Ten Days That Shook the World. For the first and second contributions to the roundtable, check out the links below. Andrew Hartman, Everybody Knew That Something Was Going to Happen, but Nobody Knew Just What Nate Jones, Bolsheviki Appear to Control Everything Here Nicholas P. Cox is currently the Program Coordinator for the History Department of Houston Community College. He has authored instructional supplements for Oxford UP’s Texas history textbook, Gone to Texas, is revising his first manuscript, a political biography of Colonel Richard M. Johnson of Kentucky, and is currently researching Reconstruction in the black-majority counties of late 19th century Texas. He has given presentations on his research and teaching at the AHA, SHEAR, TXSHA, ETHA, and HASH; referees article submissions for the Journal of South Texas; and reviews books for a number of journals. You can easily find him on Twitter @npcox or by email at [email protected].\n\nIf the 100th anniversary is the opportunity for new readers to approach John Reed’s seminal Ten Days That Shook the World for the first time, or old lefties to revisit a classic, then I would certainly point them next to his journalism on the Mexican Revolution, World War One, and the Ludlow Massacre. Much of this writing appeared in the original The Masses (1912-1917) an essential journal of the Greenich Village bohemian left stifled and ultimately strangled by sedition charges during World War I. Writers like Reed and the editor Max Eastman sustained a pro-worker and avowedly Marxist editorial position in the successor, The Liberator. Issue are available online in cover-to-cover scans thanks to NYU and come highly recommended for understanding the old NYC left of the 1910s.\n\nAt this moment, we are living in an age of real anxiety about the future of mass audience magazines. Sure, The Atlantic or the New Yorker sustain wide spread support from readers of a certain non-confrontational, liberal intellectual and literary set, but broader, popular magazines that reach many more Americans are struggling to remain on the scene. Newsweek is long gone, and perhaps it’s too early to say, but how much longer can Time hold on? Conde-Nast and Hearst publishers are dropping titles, shedding their workforce, and this week’s sale of Time, Inc.’s properties including Time, Fortune, Sports Illustrated, and others raises concerns anew about both, their future viability as profitable ventures or as contributors to American culture in any significant way. For those of us more predisposed toward engaged or combative political news and thought we are regularly reminded that there is a boundless quantity of thoughtful writing by journalists, activists, and academics online in spaces like this one. We are reminded that we are in a flourishing age of small magazines with relatively new, fresh, smart, and substantial, as well as occasionally elegant, periodicals such as n+1 or Jacobin. Undoubtedly, in print or not, social media has gathered a larger audience for provocative and thoughtful writing.\n\nThe 1930s offer a fascinating parallel. Sure, the economic collapse of the Great Depression eviscerated much of the profitability and consumption of popular press magazines and newspapers in the 1930s. And yet, the Depression itself called for a radical reappraisal of America’s commitment to market capitalism as engaged, and often young journalists, novelists, and academics sought to push for increasingly radical reforms. Not surprisingly, John Reed’s activist journalism became a model for left-leaning, especially Communist-leaning or joining writers and artist. As Granville Hicks, Reed’s biographer and later director of the Yaddo artist colony, wrote in his introduction to the 1930s Modern Library edition of Ten Days That Shook the World, Reed “was a hero.” A self-described “out-of-town member of the John Reed Club of New York City,” Hicks would eventually abandon the Communist movement following the 1939 Nazi-Soviet Non-Aggression Pact and move further into the anti-Communist camp as Stalin consolidated power. My interest in these fellow travelers and John Reed Club of New York writers developed as a tangent to a larger project I began in grad school, and hope sometime to return to, on Theodore Dreiser, the Old Left, and the Great Depression. This reappraisal of Reed and Ten Days That Shook the World seems like a worthwhile opportunity to speak a bit about his posthumous impact on radical writing in the 1930s.\n\nWhen Reed died in Russia of typhus in October 1920 he was perhaps the best American representative of the international, cosmopolitan ambitions of global communism as imagined by the Comintern. He traveled to Russia in 1917 to report on the ongoing eastern front of the Great War, observed the Bolshevik Revolution, praised Lenin and Trotksy, and (like his opposition to American intervention in Mexico in 1914) sustained an anti-intervention position against any Allied attempts to roll back the Communist Revoluion. He saw no good could come of American participation in the Revolution. Reed joined the Red Guards, participated in the Second Comintern Congress, and began the active organization of an American communist party in NYC. Among the old left, his burial in the Kremlin with full Soviet honors seemed more than appropriate for an American who had made such a large effort to advance what Reed believed to be a necessary, revolutionary struggle for American workers.\n\nAlong the way Reed had the most interesting of friends. The Masses and other literary and journalistic “small magazines” cultivated an exceptional stable of talent including John Dos Passos, Langston Hughes, Ernest Hemingway, Richard Wright, Eugene O’Neill and many more literary lights of the 1920s. Radical reformers and activists including Margaret Sanger, Emma Goldman, Bill Haywood and others passed through the editorial offices and joined Eastman, Reed, and others in the cafes in the Village popular among the radical left.\n\nIn 1926 Joseph Freeman, Mike Gold, and Walt Carmon revived the The Masses. As the publication most significant to distributing John Reed’s reporting before his death in 1920, the New Masses explicitly drew on his example to establish its own tone and purpose in the Jazz Age. The New Masses offered a continued Marxist critique of politics and society in the Roaring Twenties, and by the 1930s promoted the injection of class conscious themes into popular art, music, and literature as part of the broader Popular Front cultural movement. Reed remained the model for engaged political writing central to The New Masses editorial view. In 1929 Carmon encouraged young writers in his journal’s orbit to found a John Reed Club to cultivate writing and art in Reed’s spirit. Many young writers did just that, and often their work appeared in The New Masses.\n\nThe most significant of the Clubs was centered, of course, in New York City and from 1929 to 1935 promoted a series of modern art exhibits. The Clubs spread to most major cities, most significantly Chicago, San Francisco, and Boston, but ultimately about thirty chapters have been identified by literary historians of the left such as Alan Wald. Club members and editors of The New Masses such as Gold and Freeman pushed established artists such as Theodore Dreiser to take more radical public positions alongside the communist movement on social crises such as the Scotttsboro case in 1931. Richard Wright, whose involvement in the Chicago John Reed Club paved the way for his earliest nonfiction writing in The New Masses, developed his earliest stories and wrote his first 1930s novel while engaged with Club politics. It dissolved shortly after Wright’s departure for New York. In New York, members of the Club such as Philip Rahv, William Philips, and Joseph Freeman founded The Partisan Review in 1934 with an explicit mission to make politics central, leaving The New Masses to continue focusing on literature, art, and culture. Needless to say, Partisan Review and The New Masses would remain central to Great Depression era radical writing and thinking.\n\nFrom the founding in 1929 onward to the establishment of chapters around the nation, the John Reed Clubs were always envisioned as a media effort subordinate to the Communist Party USA. In 1936 the John Reed Clubs dissolved, finding its literary and visual artists forwarded by the CPUSA into either the Communist League of American Writers or the American Artists’ Congress. Like The Partisan Review, the League and Congress embraced a broader, less sectarian Popular Front approach in the 1930s. Their commitment to anti-fascism was largely shared by past Club members. International communism’s broader effort to halt Franco in Spain led many of the John Reed Club writers and artists to advance the Soviet critique of fascism in the Spanish Civil War in their art and writing after 1936. The relationship of the American left and communist sympathizers was, as widely reported and memoired, deeply disturbed by Stalin’s conduct in the 1930s, the Soviet-Nazi non-aggression pact, as well as the Russian invasion of Finland. Many fellow travelers and supporters of Lenin or Trotsky fell away in the 1930s in response to Stalin’s rise. The Partisan Review, which had folded in 1936 after publishing only a few issues in its first two years, reemerged a year later energized by their disgust at the purges in Stalin’s Russia as the leading voice of the anti-Stalinist left. The Artists’ Congress folded in 1942 and the Writers’ League in 1943; with their dissolution any vestiges of the John Reed Clubs vanished as an organization within the Communist Party USA. The New Masses folded in 1948 leaving The Partisan Review as the single most important legacy of the Clubs, but during and after World War II it had embraced an explicitly anti-Stalinist editorial position.\n\nIn our era, there is enough of an interested audience of left-leaning readers to sustain several solid lefty magazines, small journals, and web spaces, and surely these fill a similar niche as The Masses or The Partisan Review as they sustain creative, thoughtful reporting about our moment. Yet it remains to be seen if a lasting coterie of seminal writers will match the constellation of journalists, novelists, and painters who found John Reed’s life inspiring enough to form their own literary-political movement. Often sheltered from the market for popular writing, increasingly contemporary left-leaning journals seem over-reliant on academics to be both the producers of content and the consumers of content. This blog certainly aspires to reach beyond an insular group of academics, surely, as do old and new lefty publications. Yet Reed believed, along with The Masses editor Max Eastman, that their work depended on centering the voices of working people along with a fidelity to the party line, perhaps two compulsions anathema to the left today, even if it finds itself increasingly marginalized to academia. Perhaps we can take a cue from The Masses and the Clubs and cultivate exceptionally talented artists, engage immediately with politics as it unfolds, break down divisions between scholarship, journalism, and literature. But if you’d like to know just how to do that, as soon as you’ve revisited Reed’s classic on the Russian Revolution, dive into Reed’s vast work beyond his magnificent Ten Days That Shook the World. But take some time to read his literary acolytes, too, especially during the tumultuous 1930s."}, {"url": "https://www.rbth.com/arts/history/2017/06/28/laid-to-rest-in-the-kremlin-why-was-us-hack-john-reed-buried-in-moscow_791567", "page_content": "\"Here is a book which I should like to see published in millions of copies and translated into all languages\" - V. Lenin about John Reed's book.\n\nHow did the son of a wealthy American entrepreneur and Harvard graduate become an ardent supporter of the proletarian revolution in Russia?\n\nThe life of American journalist John Reed (1887 - 1920) was so extraordinary that he inspired film directors on both sides of the Atlantic during the Cold War.\n\nWarren Beatty's 1981 movie about Reed - Reds - won three Oscars. In the USSR, director Sergey Bondarchuk made a two part epic, Red Bells (1982), that was also based on Reed’s life.\n\nSo why has the late hack’s life fueled so much interest?\n\n'Civilizing ’ em with a Krag'\n\nReed was raised in an upper-class environment in the Pacific Northwest during the turn of the 20th century. He graduated from Harvard and showed interest in social issues, attending socialist club meetings. Three years after completing his studies he landed a job with the New York-based leftist magazine The Masses, which published articles by prominent radicals of the time.\n\nAs a determined champion of social justice, Reed covered strikes by silk mill workers in New Jersey and coal miners in Colorado. He was then sent to report on the Mexican revolution (1910 - 1920). He was appalled by the exploitation of laborers and Washington’s policy towards Mexico. \"The United States Government is really headed toward the policy of ‘civilizing 'em with a Krag’ [a rifle used by American troops] - a process which consists in forcing upon alien races with alien temperaments our own Grand Democratic Institutions: I refer to Trust Government, Unemployment, and Wage Slavery,\" Reed wrote.\n\nHis series on Mexico, later published as a book titled Insurgent Mexico, enforced Reed's reputation as a war correspondent. When World War I broke out in Europe Reed traveled to the Continent on two occasions, resulting in his second book - The War in Eastern Europe.\n\n'New Russia was being born'\n\nHowever, his most famous work - Ten Days That Shook The World - was not about war, but rebellion. It was published in 1919 and described the events of the Russian revolution. Reed visited Russia in August 1917 and witnessed how the Bolsheviks seized power. He welcomed the uprising and was an enthusiastic supporter of the new socialist regime. \"So, with the crash of artillery, in the dark, with hatred, and fear, and reckless daring, new Russia was being born,\" he wrote.\n\nHe met the two main leaders of the Bolshevik uprising in person, Vladimir Lenin and Leon Trotsky, and was a big fan of the Bolshevik party. \"Instead of being a destructive force, it seems to me that the Bolsheviki were the only party in Russia with a constructive program and the power to impose it on the country,\" Reed wrote in Ten Days That Shook The World.\n\nPraised by Lenin and Kennan\n\nIt’s little wonder the book was well received by Lenin. \"Here is a book which I should like to see published in millions of copies and translated into all languages. It gives a truthful and most vivid exposition of the events so significant to the comprehension of what really is the Proletarian Revolution and the Dictatorship of the Proletariat,\" the Bolshevik leader wrote in the introduction of the 1922 edition.\n\nThe book was also widely praised by the public - even American diplomat George F. Kennan, who had no sympathy towards the Soviets - gave it a positive review: \"Reed’s account of the events of that time rises above every other contemporary record for its literary power, its penetration, its command of detail.\"\n\nReed died in 1920 in Moscow after contracting spotted typhus at the tender age of 32. He was given a state funeral and buried at the Kremlin Wall Necropolis. Remembered for both his brilliant writing and political activism, Reed was also instrumental in establishing the Communist Labor Party of America and took part in the Comintern congress in Moscow shortly before his death, an event advocating world communism. It’s no wonder he’s inspired film directors and writers - and he’ll forever be praised as a bastion of social justice and journalistic integrity. He truly was a man of the people.\n\nIf using any of Russia Beyond's content, partly or in full, always provide an active hyperlink to the original material."}, {"url": "https://www.britannica.com/biography/John-Reed", "page_content": "John Reed, (born Oct. 22, 1887, Portland, Ore., U.S.—died Oct. 19, 1920, Moscow), U.S. poet-adventurer whose short life as a revolutionary writer and activist made him the hero of a generation of radical intellectuals.\n\nReed, a member of a wealthy Portland family, was graduated from Harvard in 1910 and began writing for a Socialist newspaper, The Masses, in 1913. In 1914 he covered the revolutionary fighting in Mexico and recorded his impressions in Insurgent Mexico (1914). Frequently arrested for organizing and defending strikes, he rapidly became established as a radical leader and helped form the Communist Party in the United States.\n\nHe covered World War I for Metropolitan magazine; out of this experience came The War in Eastern Europe (1916). He became a close friend of Lenin and was an eyewitness to the 1917 Bolshevik Revolution in Russia, recording this event in his best known book, Ten Days That Shook the World (1919).\n\nWhen the U.S. Communist Party and the Communist Labor Party split in 1919, Reed became the leader of the latter. Indicted for treason, he escaped to the Soviet Union and died of typhus; he was subsequently buried with other Bolshevik heroes beside the Kremlin wall. Following his death the Communist Party formed many John Reed clubs, associations of writers and artists, in U.S. cities."}, {"url": "https://www.immigrantentrepreneurship.org/entries/john-reed/", "page_content": "Introduction\n\nJohn Reed (born April 14, 1759, in Salzberg, Landgraviate of Hesse-Kassel; died May 28, 1845, in Cabarrus County, NC), an illiterate Hessian deserter during the Revolutionary War, founded the first commercial gold mining operation in the United States around the year 1803.[1] By controlling costs and minimizing capital risk, Reed made his relatively small North Carolina mine a profitable venture. He invested the proceeds of his mine conservatively in land and slaves, and by the time of his death Reed had become one of the wealthiest men in western North Carolina.\n\nFamily and Ethnic Background\n\nJohn Reed (originally Johannes Ried) was born on April 14, 1759, the illegitimate son of Anna Elisabeth Ried of Salzberg and Johann Jakob Helmerich of nearby Niederneuenstein.[2] The Ried family had lived in the towns of Salzberg and the nearly contiguous Raboldshausen for several generations. The region was poor and rural, with tenant farming the main occupation. Johannes Ried appears to have had an upbringing typical of an impoverished family. He never learned to write and signed all legal documents with his mark. In contrast to Reid’s humble maternal line, Ried’s father was a man of some status, son of the rental agent and general manager (Herrschaftlicher Pächter) of lands belonging to the lords of the castle of Neuenstein. Johann Helmerich seems to have taken little interest in his son, making no effort to raise him from the station in which he was born. In 1764 Anna Ried married the widower Adam Henrich Hahn. Johannes was confirmed as a member of the Raboldshausen Lutheran church in 1773 but soon afterwards moved to the village of Appenfeld where his uncle Johann Henrich Ried lived. Johannes left few traces of his life in Appenfeld.\n\nIn January 1776 Landgraf Friedrich II of Hesse-Kassel began calling up local militia for service alongside the army of his brother-in-law, King George III of England, who needed additional troops to help put down a rebellion in the American colonies. Ried was probably not part of this initial militia requisition, being only sixteen years old, but he later either enlisted, or was drafted, into military service in Appenfeld. According to military records he stood five feet, four inches tall, below the official minimum height of five feet, six inches, but the Landgraf was paid by the head for soldiers he sent to America and was not scrupulous with respect to such details as conforming to the height qualifications.[3] Ried would have received three to four months training before being shipped overseas to augment the Wissenback Regiment. He probably served a tour of duty in New York City before sailing south to Savannah in November 1778 as part of the forces that captured the city the following month and held it against a Franco-American counterattack the next year.[4] What is certain is that on June 21, 1782, Johannes Ried deserted his regiment from a post outside of Savannah and made his way to North Carolina, where he changed his name to John Reed and began a new life as an American.[5]\n\nThe motivations for Reed’s desertion are not hard to imagine. He was an impoverished young man with few prospects at home who had been sent overseas to fight a war he cared nothing about. In America farmland was cheap and abundant, and there were many German settlements he might join. About one out of six Hessian soldiers took advantage of this opportunity for a better life, despite the risk of death if they were captured by a British or American loyalist patrol.[6] There was a substantial German presence in and around Savannah, including a German settlement at Ebenezer on the Savannah River, which was often visited by Hessian patrols. The leaders of the settlement were loyal to the British Crown, but the community as a whole was divided in sentiment concerning the American Revolution. Two other Hessian soldiers deserted from their post in Savannah on the same day as Reed, and all three men were from the same region of Hesse-Kassel. This suggests that they may have coordinated their desertions and traveled together, receiving aid from German-Americans in the area. When Reed arrived in the region of present day Cabarrus County, North Carolina (in central North Carolina north-east of Charlotte), presumably in the summer of 1782, he would have had no trouble finding work as a farm hand, since wartime conditions had created a shortage of manpower. Cabarrus County was known as the “most German” region of North Carolina, with a large majority of the residents being of German descent, which would have eased the transition to American customs and language.[7] Reed must have impressed the locals as a promising young man, since by the end of the year he had married Sarah Kiser, the twenty-one-year-old daughter of one of the more prominent families in the area. Her father, Peter Kiser, had owned a grist mill and several farms in the vicinity of Little Meadow Creek prior to his death in 1780. John and Sarah had nine children, born between September 1783 and February 1803. Soon after his marriage Reed began purchasing land, acquiring nearly 400 acres by the year 1800, and was seemingly content with his life as a farmer.\n\nBusiness Development\n\nThe transformation of John Reed from farmer to gold miner began in the spring of 1799. According to accounts first recorded fifty years after the event, one Sunday when John and his wife were attending church services, twelve-year-old son Conrad was playing with two of his siblings along the Little Meadow Creek, shooting fish with a bow and arrow.[8] Seeing a shiny yellow rock in the creek bed, he stopped to take a closer look and saw that it was wedge shaped, about the size of small smoothing iron, and unusually heavy, weighing about seventeen pounds. He took it home and showed it to his father, who was intrigued. Reed traveled to the nearby town of Concord and showed the odd stone to a silversmith, who could not identify what sort of metal it was. Reed used it as a doorstop at his home for the next three years. In 1802 he made a trip to Fayetteville, North Carolina, and showed the rock to a jeweler for a second opinion. The jeweler told Reed the rock was a gold nugget and fluxed it into a gold bar six to eight inches long. Asked to name his price for the bar Reed suggested $3.50, an amount equal to a week’s wages for a farm hand. Returning home to celebrate his windfall, Reed learned that the gold bar was worth $3,600 (approximately $78,000 in 2011$).[9] Some variations of the story have Reed returning to Fayetteville, demanding justice of the jeweler, and settling for an additional payment of about $1000 (approximately $22,000 in 2011$). Whatever the exact circumstances, gold was discovered in Little Meadow Creek, and Reed moved to exploit the resource.\n\nIn the development of his gold mine, John Reed was remarkable in his conservative approach. Unlike so many Californians in 1848, he did not become infected with gold fever, abandon his normal occupation, and become a full time miner. Reed continued to farm, but in 1802 or 1803 set up a partnership to exploit the minerals on his property. No documents exist that describe the terms of the partnership, and Reed may have operated his mine on the basis of an oral agreement, as he would do on a number of occasions in the future. His three partners were all substantial men in the neighborhood: Frederick Kiser, his brother-in-law; the Reverend James Love, a Baptist minister whose property included twelve slaves in the year 1800; and Martin Phifer Jr. a businessman and landowner of Swiss heritage, reputed to own more land than any other person in North Carolina at the time.[10] According to oral history, Reed gave his partners the right to mine the stream bed and banks of Little Meadow Creek, while his partners each supplied two slaves to work the mine as well as all of the tools and money needed for the operation. All four partners shared the profits equally. When one of the original three partners died, his share of the mine reverted back to Reed. Reed was therefore largely a silent partner in his mining venture, leaving the day-to-day work to his partners and receiving twenty-five percent of the profits without risking any of his capital. Initial placer mining was done on a seasonal basis, primarily during the summer months between planting and harvest when slave labor was readily available and a low water level in the creek made mining conditions favorable.[11] Little is known about the management of the work, but in 1803 a gold nugget was found, supposedly weighing twenty-eight pounds and worth more than $6600 (approximately $135,000 in 2011$). This spectacular find sparked a gold rush in Cabarrus and several adjacent counties and an influx of professional European miners. Some North Carolina gold mines grew large enough to employ hundreds of men and used steam power to crush ore, but the Reed operation continued as a small scale, part time operation, relying on manpower and horsepower. The Reed mine did become more efficient over time. By 1805 workers of Reed and his partners were no longer using crude half-barrel rockers to wash gold from streambed gravel. An improved model was adopted which featured sliding boxes with tin bottoms punched with holes, through which hand-powered pumps washed gravel.[12] As early as 1806 their miners were using mercury amalgamation to recover fine gold dust. Nevertheless, Reed considered himself a farmer first and restricted mining activities to areas in and around the creek bed, not allowing mining in his fields. In this he seems to have been something of a traditionalist, preferring the stability of farming to the uncertainty of gold mining, even if the latter held out the possibility of great wealth.\n\nIn 1821, James Love died and Reed evidently renegotiated his original partnership, bringing three Virginians into the operation.[13] It is not known how long the second Reed partnership operating the mining venture, but in 1824 the state geologist Denison Olmsted mentioned the Reed mine as an ongoing operation, reporting that the floodplain of the Little Meadow Creek was “nearly all dug over” and was honeycombed with pits three or four feet deep.[14] Olmsted considered the Reed miners skillful but their equipment rather primitive and suggested that “a company, with a large capital, led by men of system, aided by ingenious mechanics, would probably make this concern more profitable than it can be under its present management.”[15] Although Olmsted believed the output of the Reed mine was decreasing, other reports suggest that after the Virginians joined the partnership the fresh infusion of manpower and capital gave new impetus to gold production. Reed gold nuggets were exhibited in New York, prompting a newspaper article commenting on the 1823 surge in gold production at the mine.[16] The fame of the Reed mine reached London, where a British mining engineer wrote a letter to Reed in 1825, offering to lease his mine for ninety-nine years if he were interested in having it “explored in depth by scientific miners, at the expense of English capitalists.”[17] Reed evidently did not respond to this offer, and his partnership must have operated for several more years, since the will of Martin Phifer Jr., probated in 1828, specifies that his share in the mine should revert to Reed.[18]\n\nMuch anecdotal evidence testifies to the richness of the Reed mine, called “the bull of the gold mines.” In 1804 Reed workers were said to have found five nuggets weighing from two to nine pounds each.[19] That same year they were reputed to have collected more than $14,000 worth of gold in six weeks (approximately $275,000 in 2011$).[20] This account may be correct, since in 1804 the U.S. Mint in Philadelphia received $11,000 worth of gold from Cabarrus County, most if not all from Reed’s mine, and much of the North Carolina gold was not sent to the mint.[21] By 1824 the mining operations were said to have produced $100,000 worth of gold (approximately $2,300,000 in 2011$).[22] Although the mine was no doubt profitable to Reed, its rich reputation was likely exaggerated by the sensational finding of large nuggets at the site. Olmstead’s description of the mine indicates that it was about average in ore quality, although the unusual coarseness of the gold made it easier to recover, an advantage for a small scale operation such as Reed’s.[23]\n\nBy 1831 pot hole digging near the stream had evolved into crude shafts dug into the nearby hillside. Reed must have brought in additional partners by this time since three grandsons are mentioned as working the early shafts: Isaac Craton, John Craton, and Timothy Reed.[24] In 1832 Reed ore was shipped to the Mecklenburg Gold Mining Company in Charlotte for crushing.[25] Shipping ore twenty miles over bad roads for processing was probably a stopgap measure resorted to only until the Reed miners could erect their own crushing mills, which may have taken some time, since Reed had the reputation of being notoriously tight fisted, unwilling to spend any of his own money on capital improvements. However, to better exploit the finds Reed formed a new mining partnership in 1834. This partnership was a family affair composed of his two surviving sons, John Jr., and George; a grandson, James, son of the deceased Conrad Reed; and his five sons-in-law, Moses Kiser, Robert Motley, George Barnhardt, Andrew Hartsell, and William Craton. An oral agreement specified that each partner was to contribute his own labor and equipment and would share equally all gold found on days on which he was working the mine, less a one-third royalty paid to John Reed Sr.[26] If a partner was unable to appear at the mine in person, he was at liberty to “send one of his white family as a hand in his place.” Reed’s son-in-law George Barnhardt served as manager of the concern.\n\nThe new mine partnership got off to a brilliant start when a gold nugget weighing 13 pounds was found on the first day of work. With this success, however, came controversy. One of the partners, George Reed, had been unable to work that day and sent his son Arthur in his place. Arthur was allowed to work at the mine, but after the nugget was discovered some of the partners objected to George Reed sharing the proceeds, arguing that the sixteen-year-old Arthur had been unable to do a man’s share of the work. To clarify the rights and responsibilities of all parties, a written agreement was drawn up, reiterating the terms of the oral agreement and adding more detail, including the specification that “no children nor slave shall be received as a hand by the manager.”[27] Although all partners signed the agreement, controversy soon re-emerged. George Reed obviously thought the written agreement on substitutions referred only to future operations at the mine and would not be applied retroactively to mining work performed under the oral agreement. Other partners disagreed and George did not receive a share of the 13 pound gold nugget. Furious, he filed suit against four partners in 1835 and obtained an injunction shutting down the mine until the suit was settled.[28] John Reed Sr. attempted to mediate the squabble, offering to pay George’s share of the nugget out of his own pocket, but to no avail.[29] Ten years passed before the suit was finally decided by the Supreme Court of North Carolina in November 1844, which ruled in George Reed’s favor, awarding him a total of $533.88 in principal and interest (approximately $16,000 in 2011$).[30] Six months later, on May 28, 1845, John Reed Sr. died and was buried alongside his wife, who had predeceased him by barely a year.\n\nFollowing the terms of Reed’s last will and testament, the gold mine was sold at auction in February 1846 and was purchased by his son-in-law Andrew Hartsell and grandson Timothy Reed for $18,070.00 (approximately $500,000 in 2011$). The new partners hired as many as twenty workers and extended the shafts and tunnels but were unable to pay a mortgage taken out on the mine. The mortgage holder foreclosed on the mine in 1852 and sold it to George Barnhardt and Caleb White for $3005 (approximately $90,000 in 2011$), who sold the mine a year later for $10,000 (approximately $300,000 in 2011$) to James Osborne and Emmer Graham of Charlotte. In July 1853 the mine was sold for $25,000 (approximately $750,000 in 2011$) to New York residents Charles Gilbert and Samuel Jones as trustees for the Reed Gold and Copper Mining Company. The new owners put the mine under the direction of a mining expert, installed modern equipment, and greatly expanded operations. Yet the mine did not make a profit and within two years the company went bankrupt. Thereafter, the mine was sporadically operated by a succession of owners. Lucky strikes occurred now and then, the most dramatic being a nearly twenty-three-pound nugget in 1896, but consistent profits could not be obtained and by 1900 mining on the Reed property ceased. The abandoned mine was acquired by the state of North Carolina in 1971 and is now open for tours as a historic site.\n\nPersonality and Social Development\n\nAlthough the bare outlines of Reed’s life and activities are well documented, his personality remains elusive. He wrote no letters that might reveal his character, and until gold was found on his property there was no reason for anyone in his neighborhood to take particular notice of him. Even after the discovery, little was written about Reed the man. Few of his neighbors would have had any inclination to write letters or keep diaries, North Carolina being notorious for its backwardness in learning (“the Rip Van Winkle state”), with the western counties the most deficient in this regard. “Regretfully nine-tenths of the people of North Carolina are buried in brutish ignorance,” wrote a correspondent for the Raleigh Register in 1800.[31] Reed was evidently illiterate, signing all legal documents with his mark.[32] However, since his sons could sign their names, they must have received some education. The parochial schools in the area were too far away for the Reed children to attend easily, but an itinerant teacher may have taught school in the area or Reed may have engaged a neighbor as a tutor.\n\nAvailable evidence indicates that Reed was a solid citizen, a successful farmer, and a man of steady habits. He dismissed some of the fantastic stories about his mine as fables, but during his long life was said to enjoy regaling family members with the story of the gold mine’s beginnings.[33] As with most people, he was sometimes struck by the beauty of mineral specimens he found.[34] His illiteracy did not prevent him from buying and selling land, at least twenty-one transactions being recorded. He presumably relied on trusted advisors such as James Love to read documents for him and attest to their accuracy. Unlike some other North Carolina farmers who found gold on their land and promptly squandered their profits or sank into alcoholism and ruin, Reed invested his money wisely. He bought a total of 2,091 acres over the course of his life and owned 795 acres of farmland at the time of his death.[35] By comparison, in North Carolina in the year 1860 only two percent of the farms were larger than 500 acres.[36] After Reed’s death his estate was valued at $40,000, an amount comparable to approximately $1,380,000 in 2011 dollars. United States census records show that Reed owned no slaves in 1800, a few years before he started his mining business. By 1810 he owned thirteen slaves, and in 1840 he owned eighteen slaves. Possession of so many slaves marks Reed as almost one of the planter elite. In 1860 only one out of three farmers in North Carolina owned any slaves, and in the Piedmont region where Reed lived only one in fifty slave owners had as many as twenty.[37] There are hints that the presence of slaves at the Reed farm may have caused some strained relationships. In April 1830 the Cabarrus County Court Minutes states: “Sally Reed, a girl of color bound to Daniel Linker till age 18. He agrees to teach her sober and industrious habits; to give her freedom, a bed and bed clothing, [a spinning] wheel and cards and a good freedom suit.” Sally was another name for Sarah, Reed’s wife. Daniel Linker was the son of a Hessian deserter, Henrich Lincker, who lived in the neighborhood. There was a close relationship between the Reed and Linker family: Reed’s granddaughter Keziah Motley married Henry Linker, grandson of Henrich. Had Reed taken a mistress from among his slaves and found it desirable to move an illegitimate child out of his house? That such a situation was not uncommon is shown by the restriction of mine substitutes to members of a partner’s “white family.” Certainly Reed was no Quaker who refused to own slaves, but if the slave Sally Reed was indeed his daughter, neither was he a man indifferent to her plight. The girl was placed in the care of a neighbor as an indentured servant with the provision that she be freed and provided for upon reaching adulthood.\n\nThough confirmed in the Raboldshausen church in Hesse-Kassel, there is no evidence that Reed joined any church in America or had his own children baptized or married in one. Nevertheless, his obituary describes him as a religious man: “He was a good citizen, a kind parent and neighbor, and a helper of the poor. As a Christian he was exemplary, and died in the triumphs of faith; looking forward to the reward which await the faithful in heaven.”[38] Reed’s charitable nature towards his family is shown by his actions when his son Henry died intestate in 1827. As Henry’s father, Reed was the heir to his son’s estate, but he sold that right of inheritance to his eight surviving children for the token sum of $10. His mining venture in 1834 was also intended to benefit his children and grandchildren, and he tried to mediate the controversy that shut down the mine. Reed was no sentimentalist, however. Son-in-law William Craton was once among his favorites, often witnessing Reed’s land transactions, but when Craton failed to repay some debts he owed Reed, Reed cut him out of his will, specifying that his daughter Fanny would not receive her portion of the estate until her husband died.[39] The Craton family must have caused Reed considerable anguish. Grandson John Craton was apparently also a favorite of Reed’s, being a witness to Reed’s last will and testament in 1837.[40] Six months before Reed’s death, however, John Craton was charged with murder in a sensational sex scandal.[41] In his will Reed prudently appointed a trustee to manage his daughter Polly Kiser’s portion of his estate, because she had proven incapable of managing her affairs.[42]\n\nDespite his long residence in America, Reed did not become a citizen of the United States until April 1842, when at the age of eighty-two he made a thirty-six-mile round trip to the town of Concord to take the oath of allegiance to his adopted country and formally renounce his allegiance to William II, Elector and Prince of Hesse-Kassel. Why he took this action is a mystery. There was no hostility to Hessians in Reed’s neighborhood and no obvious legal reasons prompting him to become a citizen. His status as a Hessian deserter must have been well known and had caused no problems in his business dealings. As many as ten Hessian deserters lived in the area, and Reed was the only one to become a U.S. citizen. In fact, in the fifty years prior to Reed’s action, only one foreign-born resident of Cabarrus County had gone to the trouble and expense of formally swearing allegiance to the United States. Perhaps as Reed drew close to the end of his life, he felt the desire to make his attachment to his country a matter of public record. However, there is one tantalizing piece of evidence that suggests that Reed did not abandon all contact with Germany during his sojourn in America. In the church record book of Salzburg, Hesse-Kassel, beside the entry which recorded Reed’s birth there is the sign of the cross (indicating death) with the notation “6/3 45.” Reed died on May 28, 1845, and was presumably buried a few days later. John Reed may have become a celebrity in his hometown, a poor boy who struck it rich in America. Perhaps Reed had kept up some sort of communication with relatives in Hesse-Kassel, and after his death one of Reed’s children wrote to them with the news that Johannes Ried had died and that his funeral had taken place on June 3, 1845.\n\nImmigrant Entrepreneurship\n\nBecause of the paucity of evidence concerning Reed’s life and character, speculation must often take the place of hard facts when it comes to analyzing his entrepreneurship. However, at several points in his life there are indications of an entrepreneurial bent. His desertion from the army demonstrates boldness and initiative, and his success in making his way several hundred miles north to a friendly German enclave in North Carolina shows either good planning or great determination. Soon after arriving in Cabarrus County he married into the local elite, which indicates his ambition and shrewdness. Despite the handicap of being illiterate, Reed bought and sold many tracts of land during his life. His behavior after discovering gold on his land clearly shows him to be an entrepreneur, though a rather conservative one. He formed various partnerships to mine the gold, each of which was organized in such a way as to minimize his capital outlay and labor costs.\n\nBy the time he started his mining venture, Reed had been living in North Carolina for more than twenty years. All outward indications suggest that he became thoroughly Americanized: he settled in the area, married an American, bought a farm, and eventually took the unusual step of formally swearing allegiance to the United States. However, in his gold mining business he may have shown a preference for choosing partners with German connections. Of his first three partners, Frederick Kiser was almost certainly of German descent (Kiser being an English spelling of Kaiser), and Martin Phifer Jr. (an English spelling of Pfeifer), was descended from Swiss immigrants who identified themselves with the German community and were accepted into it. On the other hand, James Love, a partner and one of his closest confidants, was a Baptist minister with no apparent German family connections. His status as a clergyman and a relatively wealthy individual must have made him an attractive choice as a partner. Nothing is known of the ethnic identity of the three Virginians that joined the partnership upon the death of James Love.\n\nFamily relationships were probably more important than ethnicity in Reed’s choice of partners. Frederick Kiser was Reed’s brother-in-law, and two children of James Love married children of John Reed. Grandsons were working at Reed’s mine by 1831, and his final mining venture, organized in 1834, was strictly a family affair, each of the eight partners being a son, grandson, or son-in-law. Reed’s first partnerships seem to have operated smoothly and successfully for thirty years. In contrast, Reed’s final mining venture was a debacle. The working partners quickly fell out among themselves in a controversy over dividing the profits, and the mine was shut down for ten years during the ensuing lawsuit. Reed had initially attempted to run this operation on the basis of an oral agreement between the partners as he had done in his previous ventures. After the dispute arose, a written agreement supplanted the oral one, but this came too late to resolve the problem that had arisen. It is perhaps remarkable that Reed’s informal business arrangements, depending on mutual trust and cooperation, sufficed for so long, more than thirty years, which suggests that Reed was a good judge of character. Reed’s last, unsuccessful partnership had more members than any of his previous ones, which may have put a strain on the working arrangements, giving rise to more opportunities for differing interpretations of the oral agreement.\n\nConclusion\n\nReed’s mining businesses were small-scale affairs but highly profitable. During his life Reed was content to operate his mine in the simplest and most cost efficient manner, minimizing his capital investment while “skimming the cream” from those mineral deposits most easily recoverable and using the proceeds to augment and finance his farms. The subsequent failure of a well-financed corporation to make a profit by intensively developing Reed’s mine suggests that on this point the business instincts of the illiterate Hessian were sound.\n\nNotes"}, {"url": "https://www.pbs.org/wgbh/americanexperience/features/goldman-john-reed-1887-1920/", "page_content": "John Reed, 1910. Library of Congress\n\n\"Even as an undergraduate he betrayed what many people believe to be the central passion of his life, an inordinate desire to be arrested.\" — Walter Lippman, 1914\n\nJohn Reed — writer, reporter, activist and playboy — was a legend even to his contemporaries. Born to a well-to-do Oregon family, a graduate of Harvard, and a steadfast socialist, Reed lived what many would call a terrifying life of his own making and desire.\n\nAdventurer\n\nIn the innocent, hopeful years before World War I, and scarcely out of Harvard, Reed embarked on a rebellious course that led him to befriend the Wobblies (Industrial Workers of the World), to write for Max Eastman's The Masses, to ride with the guerrilla forces of Pancho Villa, and to rush into the maw of the Russian Revolution just as the Bolsheviks brought an end to Czarist rule.\n\nBohemian Figure\n\nHe was a knight of American Bohemia, and a habitué of its capital, New York City's Greenwich Village. There he communed with an eclectic array of intellectuals, writers, and artists -- including Emma Goldman. His acquaintances advocated free speech and free love, and were committed to the cause of anarchism. One of them, the journalist Louise Bryant, became his wife and followed him to Russia twice -- once to write about the revolution as it continued to unfold, and once more to join her husband after his arrest and imprisonment. Reed and Bryant were determined \"to smash through the hull of custom and tradition,\" the editor Max Eastman observed, \"and touch at all times and over the earth the raw current of life.\"\n\nWar Protester\n\nWhen World War I broke out in Europe, it cast a pall over the generally pacifist \"lyrical Left.\" Reed wrote an article for The Masses entitled \"The Trader's War,\" criticizing the hypocritical mincing-machine of a war whose aim was profits through the sale of armaments. Three years later, at Emma Goldman's trial in June 1917 for obstructing the draft, Reed said the war was an \"overture to the blackest month for free men our generation has known. With hideous apathy the country has acquiesced in a regime of judicial tyranny, bureaucratic suppression and industrial barbarism. In America, law is merely the instrument for good or evil of the most powerful interest, and there are no Constitutional safeguards worth the powder to blow them to hell.\"\n\nWitness to Revolution\n\nReed's reporting of the Russian Revolution in 1917 brought him lasting fame. He arrived in Petrograd in time to witness the Bolshevik seizure of power in October. His now famous book, Ten Days That Shook the World was the first major account of the revolution to appear in America. \"From his typewriter,\" the historian Robert Rosenstone wrote, \"would flow hundreds of thousands of words about the origins and workings of Soviets, Kerensky and the Provisional Government, workers' control of factories, the state of the army, the character of the Russian people, Bolshevism, the personalities of Lenin, Trotsky, Lunacharsky and other leaders, the tangled web of foreign affairs, the meaning of counterrevolution, the implications of the revolution for the rest of the world.\" Reed's politics had always been passionately left-wing. They were now socialist in spirit, and communist in practice, meaning that his socialism responded to the Kremlin's dictates. From 1917 on, Reed's positions -- and those of other American left-wingers -- were always formed in dialogue, either for or against, with Moscow's Comintern (Communist International).\n\nTheory and Practice\n\nIn the fall of 1919, Reed made his last trip to Russia. After several months of observing how unstable Russia had become -- the government was now suppressing its citizens with summary executions -- Reed made plans to leave. The first leg of Reed's long journey home took him to the Astoria Hotel in Petrograd. Learning that Emma Goldman had just arrived in Russia after her deportation from the U.S., wrote Rosenstone, \"Jack burst into her room 'like a sudden ray of light.' Over a steaming cup of coffee, they celebrated a reunion.\" Almost immediately, Goldman brought up the uncomfortable topic of state power and demanded to know about the Cheka (the Bolshevik secret police). \"Reminded of all the old Russian revolutionists who had broken with the Bolsheviks, Jack blurted, 'You are a little confused by the Revolution in action because you have dealt with it only in theory.'\"\n\nUp Against the Revolution\n\nReed's causes often put him at mortal risk. Such was the case in Russia in 1919, as he passed through regions torn by civil war as he traveled home. He was arrested and imprisoned in Finland, just before the ship on which he stowed away was to sail to America. After his release, Reed returned to Petrograd to recover. In July 1919, he attended Comintern's Second Congress in Moscow. His militancy on the question of trade unionism alienated him from Russian leaders who had in mind consolidating their power over a populace that had to learn \"compromise\" and subjugation of individualist concerns.\n\nHero in Russia\n\nIn September 1919, at Reed's request, Louise Bryant traveled to Moscow to join her husband. She found him \"older and sadder.\" Their reunion was short-lived. Weak from prison and suffering from a long battle with kidney disease, Reed succumbed to typhus. He died on October 17, 1920, in a Moscow hospital with his Bryant by his side. He was thirty-three years old. John Reed was buried at the base of the Kremlin Wall, a Hero of the Revolution.\n\nImmortalized On Film\n\nIn 1981 actor and director Warren Beatty made a three-and-a-half-hour film based on Ten Days That Shook the World, using documentary interviews with Reed's surviving contemporaries as interludes in the film. Beatty himself played the character of John Reed, and Diane Keaton played Louise Bryant. Maureen Stapleton played Emma Goldman, winning an Oscar for her performance."}, {"url": "https://helenrappaport.com/russia/lenin-stalin-revolution/john-reed-writing-the-russian-revolution/", "page_content": "Returning to New York in 1916 he continued writing inflammatory political articles in the radical press. That autumn he met and married the feminist journalist Louise Bryant. When revolution broke in Russia in February [OS] 1917 Reed was determined to be a witness of this great new Socialist utopia-in- the-making, and set about raising the money to fund his trip there with Bryant. The couple finally arrived in early September, somewhat late for the party, having missed the popular street protests of the very violent February Revolution; the struggles of the Provisional Government to hold on to power; the resumption of violence in early July; and the crisis of the Kornilov revolt at the end of August.\n\nReed had a lot of catching up to do and was at a distinct disadvantage from other foreign journalists already there, in that he arrived without any contacts or knowledge of the city. He went straight to the US Embassy on Furshtatskaya Ulitsa with a letter of recommendation for the US ambassador David R Francis, which, somewhat unconvincingly asserted that he and Bryant were ‘visiting Russia with a view to studying conditions’. The letter asked that the ‘gentlemen of the Embassy’ should extend any help and courtesy they could to them, but Francis was instantly suspicious. He was well aware that Reed was a notorious radical accredited to the New York left wing press. Here was no innocent ‘visitor’, but a reporter with a clear political agenda. Francis deemed him a ‘dangerous Red’ and had him watched.\n\nReed’s unrepentant sympathies for the revolutionary cause and his championing of the victory of the masses ensured that from the first he would be an outsider in the expatriate community of Petrograd. He and Bryant never became integral members of that closed and clannish world, which was highly suspicious of their politics. Nor for that matter did other American, British and French journalists already operating in the city welcome them with open arms. Seasoned reporters in the Allied press circle, such as Arthur Ransome of the Daily News and Harold Williams of the Daily Chonicle, had been in Petrograd for some time, spoke fluent Russian and knew their way around. Unlike Reed with his burning socialist passion, they were far more sanguine about the realities of the new revolutionary order and its political players."}, {"url": "https://www.thefamouspeople.com/profiles/john-reed-4897.php", "page_content": "He graduated from Harvard College in 1910, and that summer he set out to see more of the \"dull outside world,\" visiting England, France, and Spain before returning home to America the following spring.\n\nHe entered Harvard College in 1906, and excelled in swimming and water polo, served the editorial boards of Lampoon and The Harvard Monthly, and wrote music and lyrics for the Hasty Pudding Theatricals show.\n\nHe attended Portland Academy, a private school with younger brother Harry. He was bright enough to pass his courses but would not work for top marks, as he found school dry and tedious.\n\nHe was a sickly child with a weak kidney. For much of his teenage years, he suffered recurrent attacks of pain that kept him bedridden for periods of a week or more.\n\nJohn Reed was born on October 22, 1887, in Portland, Oregon to Margaret Green Reed, the daughter of a leading Portland citizen and, Charles Jerome Reed, the representative of an agricultural machinery manufacturer from the East.\n\nRecommended Lists:\n\nCareer\n\nWanting to be a freelance journalist, he circulated essay and short stories about his six months in Europe which were accepted in The Saturday Evening Post, Collier's, The Forum, and The Century Magazine.\n\nOne of his poems was set to music by composer Arthur Foote, and the editors at ‘The American’ came to see him as a contributor and begun to publish his work.\n\nIn 1913, he joined ‘The Masses’, a magazine of socialist politics. He was arrested for the first time in Paterson, New Jersey for speaking on behalf of strikers in the silk mills.\n\nIn 1913, he was deputed to Mexico by the Metropolitan Magazine to report the Mexican Revolution and covered Pancho Villa’s—one of the most prominent Mexican Revolutionary generals—victory over Federal forces at Torreón.\n\nWhen The Ludlow Massacre happened in April 1914, he arrived at the scene in Colorado and reported on the event, siding with the miners and seeing it as an example of class conflict.\n\nOn the outbreak of the First World War, Reed went to Europe where he covered the battle fronts in France, Germany, Russia, Serbia, Romania and Bulgaria for The Masses and the Metropolitan Magazine.\n\nHe saw World War I as a “Clash of Traders” and showed little sympathy for any of the participants and observed with dismay that working-class solidarity was being replaced by militarism and nationalism.\n\nIn 1915, he returned to Portland where he met Louise Bryant. They rented a home in Provincetown, in Massachusetts and acted in, Bound East for Cardiff, a play written by Eugene O'Neill.\n\nIn 1917, accompanied by his wife Louise Bryant who was also provided foreign correspondent accreditation, he left for Petrograd. He interviewed Alexander Kerensky, head of Russian Provisional Government just before Kerensky went into hiding.\n\nContinue Reading Below\n\nIn November 1917, he spent time with Lenin and saw in him, “the power of explaining profound ideas in simple terms, of analyzing a concrete situation. And combined with shrewdness, the greatest intellectual audacity.\"\n\nHe returned to New York City in April, 1918 and was immediately arrested and charged for violating the Espionage Act by publishing anti-war articles and cartoons in The Masses that undermined the war effort.\n\nHe was released on bail and he published a series of articles on the Russian Revolution in The Liberator. He was arrested many times on charges of violating the Sedition Act.\n\nIn September 1919, Reed and several others, decided to form the Communist Party of the United States. Within a few weeks it had 60,000 members whereas the Socialist Party of America had only 40,000.\n\nIn 1920, he attended the Second Congress of the Communist International in Moscow and sought official recognition of the American Communist Party. The Comintern declared that a decision would be arrived after deliberation."}, {"url": "https://www.oregonhistoryproject.org/articles/biographies/john-reed-biography/", "page_content": "1887-1920\n\nFor John Silas “Jack” Reed, the conservative, early twentieth-century city of Portland could never be “prepared to understand his dreams” of social revolution and change. Born in 1887, Reed grew up in a stately Portland mansion, attended the Portland Youth Academy and later, boarding school. Fascinated with the travels of his uncle and the unfamiliar habits of his family's Chinese servant Lee Sing, Reed's early writings were inspired by his desire to see the world.\n\nPraised for his poetry and writing skills, Reed graduated from Harvard in 1910 and began a career in journalism in New York. He wrote predominantly for leftist magazines and was celebrated among Greenwich Village radicals. Reed first gained prominence when he covered the 1911 Mexican revolution alongside revolutionary Pancho Villa. The event inspired his romanticized chronicle, Insurgent Mexico. In 1915, Reed toured Eastern Europe reporting on the atrocities and injustices of World War I. He became especially captivated with Russia and its potential for revolution, writing that Russians “are perhaps the most interesting human beings that exist.”\n\nReturning home in December 1915, Reed was lonely and tired of war, but on a visit to Portland he met Louise Bryant. In Bryant, Reed found his intellectual match. They married in 1916 and, after living for a time in New York City and Massachusetts, departed for Russia in 1917 to witness the revolution. Reed's 1919 book Ten Days That Shook the World was an account of the Bolshevik seizure of power. In 1920, Reed traveled back to the U.S. to coordinate a domestic Communist party. Upon his return to Russia he was imprisoned and held in solitary confinement in Finland. Later released, a sickly Reed reunited with Bryant in Russia, but was tragically stricken with typhus.\n\nJohn Reed died in October 1920. The only American ever buried at the Kremlin, Reed's idealism, intellect, and spirit would inspire radicals to form John Reed Clubs across the United States."}, {"url": "https://www.wsws.org/en/articles/2020/12/03/reed-d03.html", "page_content": "Mid-October marked the 100th anniversary of the untimely death of American revolutionary socialist journalist John Reed. The author of Ten Days That Shook the World, a magnificent firsthand account of the Russian Revolution, Reed died in Moscow of typhus on October 17, 1920, five days shy of his 33rd birthday.\n\nAbout Ten Days That Shook the World, V.I. Lenin, the co-leader of the 1917 October Revolution, commented in an introduction written in 1919, “Unreservedly do I recommend it [Reed’s book] to the workers of the world. Here is a book which I should like to see published in millions of copies and translated into all languages.” The book has had a special place in the hearts and minds of class-conscious workers ever since its appearance. It can still be recommended “unreservedly.”\n\nMany people may be familiar with the name of John “Jack” Reed from the 1981 movie Reds, in which Warren Beatty portrayed the intrepid and principled journalist and for which Beatty won the Academy Award for best director.\n\nWhat the film cannot convey, among other things, however, is the vital, muscular and poetic quality that made Reed’s writing so influential in his time and to later generations. Reds only hints at the full complexity of the man who, more than any American writer of his generation, followed the demands of his political conscience to their revolutionary conclusions.\n\nJohn Reed was born in Portland, Oregon on October 22, 1887 into an upper-middle-class family. His mother’s father, Henry Dodge Green, was a wealthy Portland industrialist and his house a center of Portland’s genteel social gatherings.\n\nReed came of age during the era of the full-blown development of American capitalism. In the 30 years following the Civil War, the US emerged as a modern industrial power. The decades saw the enrichment of the infamous Robber Barons, and the US launched its first imperialist war in 1898, seizing the Philippines and Cuba from Spain.\n\nThe urban population swelled in this period, also a time of large-scale immigration, and the working class emerged as a powerful force, expressing—in a series of bitter strike struggles—its determination to fight the omnivorous ruling class.\n\nReed’s father, C.J. Reed, was a crusader against political corruption in Oregon, helping to take on the logging interests in his capacity as a U.S. marshal. Not having gone to college himself, C.J. was determined that Jack should attend Harvard, interceding for his son when he failed his entrance exam. Jack passed the second time. Working on and contributing to several Harvard publications, Reed honed his journalistic and editing skills. He also wrote and published a good deal of poetry and became a member of the newly formed Harvard Socialist Club.\n\nEstablishing himself in Greenwich Village in 1911, Reed was at the center of the neighborhood’s bohemian culture. The Village was home to such figures as poet Hart Crane, “scandalous” novelist Henry Miller (who, not long before his death, describes Reed’s milieu in Reds) and dramatist Eugene O’Neill.\n\nIt was here, as a working writer and an editor at The American Magazine (founded in 1906), that Reed grappled with the challenge of earning a living under conditions where serious art does not pay the rent. For Reed, “serious art” still meant his poetry, which does not make much of an impression after more than a century, and also supplementing his income from The American by selling short stories, which, in some cases genially give a flavor of life at that time.\n\nAs Reed came to know Manhattan, however, its palaces and its squalor, he came to realize that something was fundamentally wrong with American society. In a later essay written in the months before his journey to Russia that would result in his witnessing the October Revolution, titled “Almost Thirty,” he would recall the political awakening of his early twenties:\n\nOn the whole, ideas alone didn’t mean much to me. I had to see. In my rambles about the city I couldn’t help but observe the ugliness of poverty and all its train of evil, the cruel inequality between rich people who had too many motor cars and poor people who didn’t have enough to eat. It didn’t come to me from books that the workers produced all the wealth of the world, which went to those who did not earn it.\n\nHearing of a new arts and features magazine with a decidedly socialist orientation, called The Masses (founded in 1911), Reed quickly introduced himself to its editor Max Eastman, who would later translate many of Leon Trotsky’s works into English, and climbed on board as both an editor and contributor.\n\nThough the new magazine could not pay him, Reed would find his work for this important publication his most fulfilling. The Masses was to publish the first stories of Sherwood Anderson in 1916, later to be collected in the groundbreaking Winesburg, Ohio. It published works by figures such as Jack London, the novelist Floyd Dell, and the poets Carl Sandburg and Amy Lowell. Painters John Sloan, George Bellows and Pablo Picasso contributed illustrations.\n\nBy 1913, Reed would prove a more than receptive audience member when—in a Greenwich Village apartment—he met William “Big Bill” Haywood, leader of the Industrial Workers of the World (IWW), the left-wing syndicalist movement. Reed listened as Haywood described the developing situation in nearby Paterson, New Jersey, where silk workers were on strike and being beaten and jailed by police. Reed, perhaps for the first time, reacted to a major story not only as a journalist but as a partisan, determined to publicize the strike and help the workers.\n\nSoon after arriving in Paterson, a naturally defiant Reed goaded a belligerent police officer into arresting him. In the county jail, overcrowded with immigrant strikers, he befriended the workers—“gentle, alert, brave men, ennobled by something greater than themselves”—and drew out their stories. That “something greater,” the class struggle, can be seen at work in the article Reed wrote for The Masses (“War in Paterson”), which opens:\n\nThere’s war in Paterson, New Jersey. But it’s a curious kind of war. All the violence is the work of one side—the mill owners. Their servants, the police, club unresisting men and women and ride down law-abiding crowds on horseback. Their paid mercenaries, armed detectives shoot and kill innocent people. Their newspapers ... publish incendiary and crime-inciting appeals to mob violence against the strike leaders ... They control absolutely the police, the press, the courts.\n\nSo moved was Reed by the condition of the silk workers that he organized a dramatic pageant, held at Madison Square Garden, in which the actual workers demonstrated their onerous work and their treatment as strikers at the hands of the police.\n\nReed’s best known work is Ten Days That Shook the World (1919), but he did produce other outstanding works of reportage, one of which is his account of his experiences riding with Pancho Villa’s army in the Mexican Revolution, titled Insurgent Mexico (1914). The compelling work immerses the reader in the harsh, violent life of La Tropa, Villa’s army, and its camp followers.\n\nAs was the case in Paterson, Reed not only sympathized politically with the peasant revolutionaries but came quickly to admire them and want their respect, which he was proud to earn. At one point in Insurgent Mexico, he writes of an initiation into La Tropa over a bottle of sotol:\n\n“Drink it,” yelled the chorus as the Tropa crowded up to see. I drank it. A howl of laughter and applause went up. Fernando leaned over and gripped my hand. “Good for you, companero!” he bellowed, rolling with mirth ... Captain Fernando leaned over and patted my arm. “Now you are with the men (los hombres.) When we win the Revolucion it will be a government by the men,—not by the rich. We are riding over the lands of the men. They used to belong to the rich, but now they belong to me and to the compañeros.”\n\nThe material Reed sent back to the US, published in The Metropolitan magazine, established him as America’s foremost war correspondent. The writing was at once impressionistic and clear-eyed, imagistic and frank.\n\nCertainly, no more stark instance of brutal oppression could have presented itself to Reed or the world than the Ludlow Massacre of April, 1914, the culminating atrocity of the protracted southern Colorado coal miners’ strike of the winter of 1913-14. Reading of the massacre, Reed immediately left for Las Animas County.\n\nThere he made a detailed search of the scene of the massacre, in which National Guard militiamen rented by John D. Rockefeller’s Colorado Fuel and Iron Company killed an estimated 26 miners, their wives and children, some shot with machine guns and some deliberately burned to death in tents the miners had been living in during the strike.\n\nReed wrote a lengthy, scathing article for The Metropolitan, “The Colorado War,” in July 1914, which detailed the murderous violence of the Rockefeller interests. “I got into Trinidad [Colorado, 15 miles from Ludlow] about ten days after the massacre at Ludlow,” Reed wrote. Later in the article, he explained:\n\nI went to Ludlow next day to see the Federal troops come in and the militia leave. The tent colony, or where the tent colony had been, was a great square of ghastly ruins. Stoves, pots and pans still half full of food that had been cooking that terrible morning, baby-carriages, piles of half-burned clothes, children’s toys all riddled with bullets, the scorched mouths of the tent cellars, and the children’s toys that we found at the bottom of the “death hole”—this was all that remained of the entire worldly possessions of 1,200 poor people. At the railroad station about fifty militiamen waited for the train—boys with the stupid, vicious faces of saloon-corner loafers. Only a few were in uniform, for many of them were mine-guards hastily mustered in. As the regulars left their train one militiaman said loudly, in the hearing of the militia officers: “I hope these red-necks kill a regular so they will go in and wipe out the whole bunch. We certainly done a good job on that tent colony.”\n\nIn August of that year, the world was struck by the greatest upheaval to that point in modern times. The First World War broke out in Europe. Reed sailed to Italy as a correspondent for The Metropolitan. He went to France, where he attempted twice to reach the front but was arrested and turned back both times. He then went to London, where he wrote a long article on England in wartime, showing that patriotism was limited to the upper classes. The Metropolitan rejected the article.\n\nIn “The Traders War,” written from London and published in The Masses in September, Reed outlined the history of the imperialist commercial rivalries between Britain, France and Germany and stated that the war was nothing more than a continuation of these conflicts. (In a noteworthy scene in Reds, Reed [Beatty], asked at a meeting of the Liberal Club in Portland, Oregon what he thinks “this war is about,” gets to his feet and replies with one word, “Profits.”)\n\nReed returned to France and in December made his way to Germany via Switzerland. In Berlin, he was able to conduct an interview with the revolutionary socialist Karl Liebknecht, who alone in the German Reichstag had refused to vote to fund the war. When Reed asked him about “the chances of World Revolution,” “‘To my mind’ [Liebknecht] responded serenely, ‘nothing else can come out of this war.’”\n\nReed and other American correspondents were able, after long delays, to secure permission to visit the German front in Northern France. Along the way they were feted by German officers and saw the horrors of trench warfare. He wrote articles on these experiences for The Metropolitan and returned to the US in January 1915.\n\nReed only stayed home a few months. By March, since he was unable to get permission to visit France again, The Metropolitan asked him to report on the war in Eastern Europe. With the artist Boardman Robinson, he visited Serbia, Romania, Bulgaria and Russia.\n\nAlmost half the articles he wrote, although Reed could not know this at the time, were about the final days of the tsarist empire with its drunkenness, abuse, and corruption organized into armies. In one article, “An Optimistic Pilgrimage” that still moves the reader 105 years later, Reed passes through a Jewish village near Rovno in what is now Ukraine, and observes the filth and poverty of the Jews and their oppression by the Russians. One of his guides, a Russian army officer, complains that all Jews are traitors to Russia.\n\nThe scenes from Serbia are shocking. The first country to be invaded by the Austro-Hungarian Empire in response to the assassination of its Archduke Ferdinand in 1914, Serbia was in the middle of a typhus epidemic. Reed visited one hospital for those stricken with disease:\n\nWe entered a barrack, along whose walls cots lay touching each other, and with the feeble light of two lanterns we could see the patients writhing in their dirty blankets, five and six crowded into two beds. Some sat up, apathetically eating; others lay like the dead; still others gave short, grunting moans, or shouted suddenly in the grip of delirium.\n\nWhen Reed returned from Europe in late 1915, the official political atmosphere in the US had shifted to the right: a pro-war “preparedness” campaign was underway and middle-class public opinion had become anti-German. He moved back to Greenwich Village with the woman he would marry, also from Oregon, journalist Louise Bryant. It was at this time he befriended Eugene O’Neill. Reed, O’Neill, Bryant and some of their circle wrote and performed plays in Provincetown, Massachusetts in the summer of 1916.\n\nThe Metropolitan refused to return him to Europe because of his antiwar views. But in the spring of 1917, two more world-shaking events occurred. In March, the Russian tsar, Nicholas II, was overthrown, and in April the United States entered the world war.\n\nThroughout the spring and summer of 1917, Reed wrote antiwar articles for The Masses. By August, he had decided he had to see the revolution in Russia for himself. Reed arrived in Petrograd on September 13, just after the attempted coup against the bourgeois Provisional Government by tsarist General Lavr Kornilov. The coup melted away largely because of the Bolsheviks’ mobilization of workers and soldiers.\n\nThrough connections in New York, including Bolsheviks such as V. Volodarsky, Reed became acquainted with that party’s leaders, who were now preparing the overthrow of the Provisional Government and its replacement by a government of Soviets.\n\nHe hastened from place to place in Petrograd, saving leaflets and proclamations and documenting the positions of each party. He interviewed leaders of the frightened capitalist parties, and he saw Lenin and Trotsky give speeches to thousands of workers. Reed himself spoke to countless other Bolshevik leaders, workers, soldiers and sailors, as they applied themselves to the historical task of establishing a government of the working class. He was a witness to the Bolshevik seizure of power and was present at the famous storming of the Winter Palace, as well as the struggle afterwards by the new Soviet government against counterrevolution.\n\nFor the remainder of the year Reed remained in the new Soviet Russia. He worked for the People’s Commissariat of Foreign Affairs and was briefly appointed consul to the US. In early 1918, he had his first long discussions with Lenin and Trotsky. He left for home soon after, but was detained in Finland until April by the nationalist government.\n\nOn his return to New York, he was met on the dock by government agents who seized his papers and summoned him to court the next day. Reed was indicted under the Espionage Act for a 1917 article, published in The Masses, “Knit a strait-jacket for your soldier boy,” which describes what we now call post-traumatic stress disorder.\n\nReed took up the task of defending the revolution to an American audience in such articles as “Soviets in Action” and “The Structure of the Soviet State” published in T he Liberator (the successor to The Masses), in the autumn of 1918.\n\nIt was at this time that be took up a fight for the ideas of Bolshevism in the left wing of the American Socialist Party, along with Louis Fraina and other supporters of the Russian Revolution in the journal The Revolutionary Age. His papers from Russia were returned to him, and he worked feverishly on his description of the events he had lived through in October-November 1917. Eastman later reported that Reed wrote the book in a remarkably short period of time, sequestered in a room in Greenwich Village, seeing no one and coming out only for meals.\n\nIn March 1919, the product of this effort, Ten Days That Shook the World, was published. It was the peak of Reed’s development as a journalist. He combined his own observations and conversations with the scrupulous publication of the documents of the revolution itself he had collected.\n\nHere is how Reed describes the Bolshevik headquarters, the Smolny Institute, a former upper-class girls school in tsarist times (only eight months previously!) on the day of the insurrection, November 7:\n\nThe massive facade of Smolny blazed with lights as we drove up, and from every street converged upon it streams of hurrying shapes dim in the gloom. Automobiles and motorcycles came and went; an enormous elephant-colored armored automobile, with two red flags flying from the turret, lumbered out with screaming siren. It was cold, and at the outer gate the Red Guards had built themselves a bonfire. At the inner gate, too, there was a blaze, by the light of which the sentries slowly spelled out our passes and looked us up and down. … A crowd came pouring down the staircase, workers in black blouses and round black fur hats, many of them with guns slung over their shoulders, soldiers in rough dirt-colored coats and grey fur shapkas [hats] pinched flat.\n\nOn this occasion Reed encounters the Bolshevik leader Lev Kamenev. Kamenev reads out to him, translating from Russian into French, effectively the first proclamation, just passed in session, of the new Soviet government: “The new Workers’ and Peasants’ Government will propose immediately a just and democratic peace to all the belligerent countries … The Soviet is convinced that the proletariat of the countries of Western Europe will aid us in conducting the cause of Socialism to a real and lasting victory.”\n\nAnd Reed’s description of Lenin stands out:\n\nDressed in shabby clothes, his trousers much too long for him. Unimpressive, to be the idol of a mob, loved and revered as perhaps few leaders in history have been. A strange popular leader—a leader purely by virtue of intellect: colorless, humorless, uncompromising and detached, without picturesque idiosyncrasies—with the power of explaining profound ideas in simple terms, of analyzing a concrete situation. And combined with shrewdness, the greatest intellectual audacity.\n\n(An insightful description, aside from the characterization of Lenin as “colorless” and “humorless,” which was anything but the case!)\n\nTen Days That Shook the World is one of the artistic achievements not only of the Russian Revolution, but of American and world literature. The fact that it inspired another great work, Soviet filmmaker Sergei Eisenstein’s October (1928), gives it a unique place in human culture.\n\nReed discovered the drama of the revolution in its own action, in the rapid and intense response of classes to one other in the pursuit of their social goals, expressed not only by force of arms, but by the most profound political thought. He was able to translate this into narrative and description.\n\nTen Days That Shook the World was the first time the revolution spoke in its full eloquence to the world. Lenin in his famous preface to the book, noted above, commented: “With the greatest interest and with never slackening attention I read John Reed’s book, Ten Days That Shook the World. … It gives a truthful and most vivid exposition of the events so significant to the comprehension of what really is the Proletarian Revolution and the Dictatorship of the Proletariat. These problems are widely discussed, but before one can accept or reject these ideas, he must understand the full significance of his decision. John Reed’s book will undoubtedly help to clear this question, which is the fundamental problem of the international labor movement.”\n\nIn the summer of 1919, Reed helped to launch the Communist Labor Party (one of the forerunners of the Communist Party, founded in May 1921), as it split from the opportunist Socialist Party. In October he left again for Soviet Russia and participated as an American delegate to the Second Congress of the Communist International, held from July 19 to August 7, 1920. Following that, Reed attended the Congress of the Peoples of the East in Baku in Soviet Azerbaijan, an assembly of 1,900 delegates from across Asia and Europe organized by the Communist International, which opened September 1.\n\nFrench leftist Alfred Rosmer, in Moscow Under Lenin, has a well-known description of Reed speaking at the Congress in Baku, a city famous for its petroleum industry. Rosmer noted that Reed, who had learned a few words of Russian, “was a great success. He shouted a question to his audience: ‘Don’t you know how Baku is pronounced in American? It’s pronounced oil!’ The solemn faces were suddenly shaken with laughter.”\n\nReed returned to Moscow on September 15, fell sick with typhus and died on October 17. It is said that he might have survived if the American government had not had an embargo on medications to Soviet Russia.\n\nRosmer explained in his book that when he and others returned from Moscow, “a sad piece of news greeted us. John Reed, who had returned in advance of us, was in hospital, ill with typhus. No effort was spared to save him, but it was all in vain and a few days later he died. His body was displayed in the great hall of the House of Trade Unions. On the day of the funeral, winter had already arrived and snow was falling. We were overwhelmed.”\n\nRosmer continued, “A burial place was found for him in the Kremlin wall, in the section reserved for heroes who had fallen in the revolutionary battle. The words of farewell were spoken by [Nikolai] Bukharin, for the central committee of the Communist Party, by [Alexandra] Kollontai, and by his comrades from the Executive Committee. Louise Bryant, who had arrived only to see him die, was there, completely shattered by grief. The whole scene was indescribably sad.”\n\nReed’s reputation after his death has been closely tied to the fate of the Russian Revolution. The Stalinist regime that usurped the Soviet state in the next decade could not abide the truth about the revolution, and Trotsky’s role in October 1917, as Reed had depicted it. Stalin is mentioned only in passing because he played virtually no role in the seizure of power. The work was banned, at Stalin’s insistence, in the Soviet Union for decades.\n\nEqually, anticommunist commentators in Europe and America have sought to make Ten Days That Shook the World into a mere literary accomplishment. Some have alleged, falsely, that after disagreements over Communist tactics in 1920, Reed became disillusioned with Marxism.\n\nDespite the Stalinist and anticommunist treatment of Reed and his work, for millions of workers and young people Ten Days That Shook the World remains an indispensable introduction to the most momentous event in world history. In a time when the question of socialist revolution has been placed before millions and millions, a new generation must discover his work.\n\nTen Days That Shook the World is currently on sale at Mehring Books for $14.40."}]}