{"John Reed Jr. died in Moscow in 1980.": [{"url": "https://www.rbth.com/arts/history/2017/06/28/laid-to-rest-in-the-kremlin-why-was-us-hack-john-reed-buried-in-moscow_791567", "page_content": "\"Here is a book which I should like to see published in millions of copies and translated into all languages\" - V. Lenin about John Reed's book.\n\nHow did the son of a wealthy American entrepreneur and Harvard graduate become an ardent supporter of the proletarian revolution in Russia?\n\nThe life of American journalist John Reed (1887 - 1920) was so extraordinary that he inspired film directors on both sides of the Atlantic during the Cold War.\n\nWarren Beatty's 1981 movie about Reed - Reds - won three Oscars. In the USSR, director Sergey Bondarchuk made a two part epic, Red Bells (1982), that was also based on Reed’s life.\n\nSo why has the late hack’s life fueled so much interest?\n\n'Civilizing ’ em with a Krag'\n\nReed was raised in an upper-class environment in the Pacific Northwest during the turn of the 20th century. He graduated from Harvard and showed interest in social issues, attending socialist club meetings. Three years after completing his studies he landed a job with the New York-based leftist magazine The Masses, which published articles by prominent radicals of the time.\n\nAs a determined champion of social justice, Reed covered strikes by silk mill workers in New Jersey and coal miners in Colorado. He was then sent to report on the Mexican revolution (1910 - 1920). He was appalled by the exploitation of laborers and Washington’s policy towards Mexico. \"The United States Government is really headed toward the policy of ‘civilizing 'em with a Krag’ [a rifle used by American troops] - a process which consists in forcing upon alien races with alien temperaments our own Grand Democratic Institutions: I refer to Trust Government, Unemployment, and Wage Slavery,\" Reed wrote.\n\nHis series on Mexico, later published as a book titled Insurgent Mexico, enforced Reed's reputation as a war correspondent. When World War I broke out in Europe Reed traveled to the Continent on two occasions, resulting in his second book - The War in Eastern Europe.\n\n'New Russia was being born'\n\nHowever, his most famous work - Ten Days That Shook The World - was not about war, but rebellion. It was published in 1919 and described the events of the Russian revolution. Reed visited Russia in August 1917 and witnessed how the Bolsheviks seized power. He welcomed the uprising and was an enthusiastic supporter of the new socialist regime. \"So, with the crash of artillery, in the dark, with hatred, and fear, and reckless daring, new Russia was being born,\" he wrote.\n\nHe met the two main leaders of the Bolshevik uprising in person, Vladimir Lenin and Leon Trotsky, and was a big fan of the Bolshevik party. \"Instead of being a destructive force, it seems to me that the Bolsheviki were the only party in Russia with a constructive program and the power to impose it on the country,\" Reed wrote in Ten Days That Shook The World.\n\nPraised by Lenin and Kennan\n\nIt’s little wonder the book was well received by Lenin. \"Here is a book which I should like to see published in millions of copies and translated into all languages. It gives a truthful and most vivid exposition of the events so significant to the comprehension of what really is the Proletarian Revolution and the Dictatorship of the Proletariat,\" the Bolshevik leader wrote in the introduction of the 1922 edition.\n\nThe book was also widely praised by the public - even American diplomat George F. Kennan, who had no sympathy towards the Soviets - gave it a positive review: \"Reed’s account of the events of that time rises above every other contemporary record for its literary power, its penetration, its command of detail.\"\n\nReed died in 1920 in Moscow after contracting spotted typhus at the tender age of 32. He was given a state funeral and buried at the Kremlin Wall Necropolis. Remembered for both his brilliant writing and political activism, Reed was also instrumental in establishing the Communist Labor Party of America and took part in the Comintern congress in Moscow shortly before his death, an event advocating world communism. It’s no wonder he’s inspired film directors and writers - and he’ll forever be praised as a bastion of social justice and journalistic integrity. He truly was a man of the people.\n\nIf using any of Russia Beyond's content, partly or in full, always provide an active hyperlink to the original material."}, {"url": "https://www.rferl.org/a/the-american-journalist-buried-at-the-walls-of-the-kremlin/30896862.html", "page_content": "12 The draft of a telegram Reed sent from Finland after being imprisoned on smuggling charges while en route to Russia.\n\n\n\nIn October 1919, facing charges of sedition after hearings in which Reed hinted at his support for a violent socialist revolution in America, Reed fled the United States with a forged passport and headed to Russia for the last time.\n\n\n\nArriving in Russia amid the political terror and obvious breakdown of the country, Reed’s once unshakable faith in revolutionary socialism faltered. His friend and fellow left-wing activist Emma Goldman, who had been deported by the United States to Russia, told Reed: \"I must be crazy, Jack, or else I never understood the meaning of revolution. I certainly never believed that it would signify callous indifference to human life and suffering, or that it would have no other method of solving its problems than by wholesale slaughter.\"\n\n"}, {"url": "https://www.magellantv.com/articles/john-reeds-fast-life-journalist-activist-and-eyewitness-to-the-russian-revolution", "page_content": "The foremost young journalist of his era, John Reed’s career spanned only eight years, from 1912 to 1920. In that time, he reported on landmark labor disputes in the United States and revolutions in Mexico and Russia. In doing so, the Harvard-educated Reed became intimately connected to the causes he covered, advocating for the rights of oppressed workers and speaking against America’s involvement in World War I. His coverage of the Russian Revolution drew him to what he believed was the hope that Communism offered working people, an ideal he finally died for.\n\n◊\n\nJohn Reed burned brightly for eight years, then burned out. Once America’s most famous journalist, he died in Moscow in 1920, not quite 33 years old. His eyewitness account of the 1917 Bolshevik Revolution, Ten Days that Shook the World, remains the definitive telling of the turbulent founding of the Soviet Union. By the end, Reed had become a true believer more than a passionate observer, committing himself to what he saw as the promise of Russian Bolshevism to overthrow worldwide capitalism.\n\nWatch In the Turmoil of the Russian Revolution now on MagellanTV.\n\nExactly a century after his death, American society is confronted by new forms of the domestic disruptions that Reed reported on: mass demonstrations, labor struggles, and repressive law enforcement.\n\nObservers may be excused for believing that these fractures are built into the national fabric. But in the century following Reed’s death, public and private American institutions have grown to respond, however imperfectly, to endemic problems of poverty, racism, violence, corruption, and censorship. And though great progress has been made, there is a long way still to go. Few pushed that early advance with their tireless work against injustice and inequity more than John Reed.\n\nOut of the West and Out-of-Place at Harvard\n\nReed was the son of a prominent Portland, Oregon civil engineer, and grandson of the man who owned the city’s water and gas companies. He was sent to Harvard University, where he wrote sketches for the vaunted Hasty Pudding Club, contributed to the Harvard Lampoon, sang in the Glee Club, and headed the football cheerleading squad. Nevertheless, Reed felt very much the Western outsider, ill-at-ease with the social customs of his very wealthy, Eastern establishment classmates.\n\nHeightening the strain, Reed’s father was suffering professional setbacks after leading an investigation into Portland’s municipal corruption. Working closely with him on the case was the era’s foremost investigative reporter, Lincoln Steffens, author of the landmark book The Shame of the Cities. (Steffens was one of the “muckraking journalists” whom President Theodore Roosevelt had in mind when he coined the phrase.) The two became friends, and Steffens was only too happy to meet with and advise young “Jack” Reed after his graduation from Harvard.\n\nProgressive campaigns against graft, bid-rigging, and election fraud in cities across the United States were launched around the turn of the century, and by 1910 had brought long overdue reforms to local governments.\n\n\n\n\n\n\n\nOut of school in 1910, Reed plunged into the life of New York City, leading a nearly round-the-clock existence in the radical and artistic circles of Greenwich Village. Between his Harvard connections and his curiosity about the lives of working people, Reed spent two years surveying the broad social landscape. He was as comfortable in exclusive artistic salons as he was in seamy waterfront dives. His experiences gradually resulted in a crusading passion for fairness and sympathy for workers condemned to poverty in the midst of the city’s colossal corporate and private wealth.\n\nEarly Professional Success, Then A Crucial Readjustment\n\nReed was clearly a born writer who thought of himself as a poet. With Steffens’ help, he soon found success contributing feature stories – everything from celebrity profiles to slice-of-life accounts of social inequity – to the leading magazines of the day: Collier’s, the Century, the Metropolitan, and The Saturday Evening Post.\n\nReed was an early advocate for two young friends who went on to distinguished writing careers. The journalist Walter Lippmann founded the New Republic magazine and was awarded a Pulitzer Prize in 1958. And the great dramatist Eugene O’Neill won four Pulitzers and received the Nobel Prize for Literature in 1936.\n\nBut after Reed’s father died in 1912, his health and finances shattered in the wake of his stand against Portland’s corrupt civic authority, young John became dissatisfied with his professional trajectory. In early 1913, he began contributing articles to The Masses, a vivid monthly magazine dedicated to socialist causes.\n\nJohn Reed at his desk, ca. 1914 (Image Credit: fronterad.com)\n\nReed was reporting on a textile workers’ strike in Paterson, New Jersey, for The Masses when he was arrested while attempting to speak at a rally. Hoping to spread news of their demands (mainstream newspapers, beholden to clothing advertisers, sat on the story), Reed helped produce possibly the first entertainment event of its kind, one pitched to a specific social cause. Drawing on his experience with Harvard’s theatrical Hasty Pudding Club, Reed put together a benefit pageant at New York’s Madison Square Garden that, using music and song, dramatically reenacted events from the strike.\n\nLater that year, he was in Mexico for the Metropolitan magazine, covering the ongoing revolution there. Reed spent four months with Pancho Villa's army as it successfully fought federal troops of the dictator Victoriano Huerta. His dispatches in sympathy with the landless peasants supporting Villa, and arguing against American intervention in favor of Huerta, were collected in his first book, Insurgent Mexico. Its 1914 publication solidified his status as America’s leading journalist.\n\nIn 1914, Reed went to remote Ludlow, Colorado, where, on April 20, troops of the Colorado National Guard and agents working for John D. Rockefeller’s mining company fired into a tent camp of striking miners, killing 20, including women and 12 children. In its immediate aftermath, fighting between troops and armed strikers left another 50 dead.\n\nReed interviewed witnesses, investigated conditions, and presented the strikers’ demands that led to what was called the Ludlow Massacre. An eight-hour day, the right to live outside of company housing, and recognition of the miners’ union seemed reasonable to an outraged public. A humiliated Rockefeller promptly agreed to needed reforms.\n\nRevolution in Russia, Infamy at Home\n\nWhen World War I erupted in August 1914, Reed departed for Italy, France, and Germany, where he reported on life in the trenches before America’s entry in the war. By now, Reed’s sympathies lay entirely with the soldiers on both sides of the horrible conflict, young working-class men conscripted to fight for kings, colonial empires, and industrialists. He was in the Balkans, on Russia’s doorstep, when a rebellion among Russian troops led to the March 1917 abdication of Czar Nicholas II in favor of a socialist government.\n\nReturning to the U.S., Reed undertook a series of public talks strongly advocating against American involvement in the war. But the national mood had shifted. Reed was arrested for the crime of advising young men to refuse Army service, and The Masses, denied distribution by U.S. postal authorities, was forced to close. Dissent was outlawed in a shameful nadir for American civil liberties. In the space of a year Reed had gone from celebrity writer to national pariah.\n\nReed’s short, intense life was the subject of Warren Beatty’s sweeping historical drama, Reds, which was nominated for 12 Academy Awards, winning three, in 1981.\n\nIn late 1917, Reed and his wife, Louise Bryant – considered the first female war correspondent for her own work during the Great War – journeyed to St. Petersburg to cover the turmoil still dividing Russia in the wake of the Czar’s abdication. The nation’s legislative bodies, headquartered in the city, were split among constitutional royalist, republican, and socialist parties, the latter ranging from center-left Mensheviks to radical Bolsheviks.\n\nOver the course of five frantic months, Bryant and Reed, who spoke rudimentary Russian, covered the fierce legislative debates, political rallies, strikes, demonstrations, and battles that erupted as the fragile government of the Menshevik socialist Alexander Kerensky staggered under cascading social and military failures. Racing around the city and countryside at all hours, and at occasional risk to their lives, Reed and Bryant interviewed people on all sides of the crisis, from ministers and politicians to transit workers and peasant soldiers.\n\nSoldiers of Kerensky’s provisional government in St. Petersberg’s Palace Square, 1917. (Image Credit: wikipedia)\n\nKerensky was in the field with the Army command when the Bolsheviks, supported by rebel brigades demanding long-promised land reform and an end to Russia’s disastrous involvement in the war, swept to power in St. Petersburg’s raucous legislative Duma. Vladimir Lenin and Leon Trotsky now led a government that immediately nationalized factories, abolished private land rights, and instituted a peace treaty with Germany.\n\nReed, recognized by Lenin and Trotsky as a celebrity reporter representing American socialists, was captivated by what he saw as a new hope for the working people of the world. Along with his notebooks, Reed collected a trove of documents – posters, flyers, manifestoes, and newspapers that he brought back to the United States in April 1918 – all of which was confiscated by federal agents who arrested Reed on charges of sedition after his ship docked in New York.\n\nReed Creates a Classic of Journalism\n\nFortunately for Reed, his mentor Lincoln Steffens used his Washington influence to have his protégé’s material returned six months later. With it now in hand, Reed worked around the clock for three weeks to write Ten Days That Shook the World.\n\nThe marathon effort, combined with the stress of his federal indictment, broke Reed’s already fragile health. And though a jury eventually found him not guilty of sedition by virtue of his right to freedom of speech, his career as a journalist was effectively over. Reed now worked full-time speaking and writing in support of the Communist Party of America, an organization he helped form.\n\nIn late 1919, Reed slipped out of the U.S. under an assumed name and forged passport, traveling to Moscow to gain official recognition for his political party (one of several claiming the Communist title) and to report on social conditions.\n\nBy then, there were indications that the Soviet regime was as oppressive as the autocratic system it replaced. Ten Days That Shook the World had reported the Bolsheviks’ suspension of a free press, as well as Trotsky’s explicit threats of violence toward political opponents. At the time, though, Reed considered them necessary measures a fledgling popular government had to take against fierce enemies.\n\nIn August 1920, party officials compelled Reed to make an exhausting trip to a Comintern conference in Baku, Azerbaijan. On his return, he confessed to Bryant, who had joined him in Moscow, his dismay with the casual corruption he witnessed on the journey. But it was too late for him to further investigate this subversion of the revolutionary ideal. A case of pneumonia led to a fatal bout of typhus. Reed died in a Moscow hospital, Bryant at his side. He was granted the Soviet honor of interment in the Kremlin wall, a memorial for Russian heroes.\n\nReed worked in a world at war, in the midst of unprecedented social unrest and violent revolutions, and brought to his reporting an equal force for change. If it seems he lost his way in an idealistic pursuit of justice, keep in mind that he died very young. There’s no telling what else he might have accomplished, where he would have gone, or how his views may have evolved in the ensuing years. Certainly, many of his American socialist contemporaries reacted with horror to Soviet atrocities in the decades to come. Whatever his path, we may assume that Reed would not have lost his passionate regard for truth, or his commitment to the well-being of the working people of the world.\n\nΩ\n\nTitle Image: A parade of striking soldiers in St. Petersberg, 1917. (Image Credit: fronterad.com)"}, {"url": "https://www.rbth.com/history/334512-foreigners-buried-kremlin-wall", "page_content": "You probably don’t think of Red Square as a cemetery, but part of it is. About 200 people are buried by the Kremlin Wall, including several Western politicians. Who are these people and why are they buried there?\n\nRed Square is the very heart of Russia, and it’s home to two of the country’s most important historical sites that probably everyone across the globe has at least seen a photo of: St. Basil’s Cathedral and Lenin’s Mausoleum.\n\nBuilt in 1924, shortly after Lenin’s death, the Mausoleum is just part (albeit the central one) of a large necropolis near the Kremlin Wall. This cemetery for communist dignitaries was founded after the 1917 Bolshevik Revolution.\n\nThe temporary wooden mausoleum in 1924 Public domain Public domain\n\nImportant figures in the Communist Party and prominent revolutionaries were buried here up until 1985. On both sides of the Mausoleum are several graves marked with busts. In addition, there are mass graves with the remains of soldiers who died for the revolutionary cause.\n\nAn early burial of cremated ash in the Kremlin wall, 1920s Bundesarchiv Bundesarchiv\n\nFrom the late 1920s, when a crematorium was built in Moscow, urns with the ashes of important Soviet figures were interred in the Kremlin Wall. These include writer Maxim Gorky, the Red Army’s Marshal Georgy Zhukov, cosmonaut Yuri Gagarin and pioneering space rocket engineer Sergei Korolev. Their ashes are interred in the columbarium in the Kremlin Wall.\n\nBusts and memorial plaques Legion Media Legion Media\n\nThe first foreigners were buried in the Kremlin Wall’s necropolis soon after the Revolution. For example, five foreign communists who died near Moscow in 1921 were buried in a mass grave near the Kremlin Wall. They are Oskar Helbrich and Otto Strupat from Germany, Ivan Konstantinov from Bulgaria, John Freeman from Australia and John William Hewlett from Great Britain; each had come to Russia to attend a congress of the Red International of Labor Unions. All were activists fighting for the rights of miners.\n\nOn the way to Moscow from Tula, where they had a meeting with miners, they participated in the test-run of an experimental high-speed railcar known as the Aerowagon, which crashed and killed seven of the 22 people on board.\n\nMemorial plaques of foreigners buried in the Kremlin Wall Tothkaroj (CC BY-SA 4.0) Tothkaroj (CC BY-SA 4.0)\n\nThere are many other foreigners among the nearly 200 people buried near the Kremlin Wall: most were leaders of labor movements in their home countries.\n\n1. Antal Horák (?-1918), Hungary\n\nAfter World War I, tens of thousands of Hungarian prisoners of war, including peasants, workers and other members of the lower classes, ended up in Russia. They decided to join the Bolsheviks and help in the struggle for power. (Click here to find out more about Hungarians' contribution to the Bolshevik Revolution.) Antal Horák joined the Red Army and was killed in the Civil War during the Bolshevik suppression of the Left Socialist-Revolutionaries' uprising. He was buried in a mass grave near the Kremlin Wall.\n\n2. Augusta Aasen (1878-1920), Norway\n\nAugusta Aasen Public domain Public domain\n\nThis Norwegian communist was one of the organizers of a movement of solidarity with Soviet Russia. In 1920, she was invited to Moscow to take part in the Second Congress of the Comintern and in the First International Conference of Communist Women. She was killed in an accident during an air show in Moscow when she was hit by the wing of a plane when it crashed. Aasen was buried in a mass grave with several other communists who died in 1920.\n\n3. John Reed (1887-1920), USA\n\nJohn Reed Public domain Public domain\n\nThis American journalist was perhaps the Bolsheviks' most favorite foreigner. Reed was personally acquainted with Vladimir Lenin and Leon Trotsky, witnessed the 1917 Revolution and chronicled it in his book Ten Days That Shook the World. After that, he even became one of the founders of the Communist Party of the United States. In 1919, he returned to Soviet Russia again, worked for the Comintern and traveled around the country to collect material for a new book. Reed died of typhus in Moscow in 1920 and was buried in a mass grave by the Kremlin Wall.\n\n4. Charles Emil Ruthenberg (1882-1927), USA\n\nCharles Emil Ruthenberg Public domain Public domain\n\nA former carpenter and a son of a loader, Ruthenberg became the general secretary of the newly established Communist Party USA. He admired the socialist revolution that had taken place across the ocean and even staged a workers' demonstration under the slogan \"Hands off Soviet Russia!\" Ruthenberg died in his homeland, but at the request of the Bolsheviks, his ashes were brought to Russia and buried by the Kremlin Wall.\n\n5. Arthur MacManus (1889-1927), Great Britain\n\nArthur MacManus Public domain Public domain\n\nThis Scottish metalworker took part in workers' strikes in the early 1910s and was a member of the Socialist Labor Party. He was also one of the leaders of a newly established organization - the council of shop stewards. He was very much inspired by the 1917 Revolution and began to campaign for the creation of a communist party in Great Britain that would unite all the left political forces. When that party was created, McManus visited the USSR in 1922 to attend the congresses of the Comintern. In 1925, he ran afoul of British authorities and spent several months in prison for inciting mutiny. He was released, but in early 1927 he died of influenza . His ashes were sent to the USSR and buried by the Kremlin Wall.\n\n6. William Dudley Haywood (1869-1928), USA\n\nWilliam Dudley Haywood Public domain Public domain\n\nHaywood, who worked as a miner, belonged to a regional federation of miners and was an active member of local leftist parties and workers' organizations, taking part in organizing strikes. Just like many other communists, he was against the U.S. entering the First World War. Haywood and his fellow activists were arrested on charges of espionage and incitement to desertion from the army. He was sentenced to 20 years in prison, but was soon released on bail.\n\nHe then fled to Soviet Russia: while in prison, he had developed great admiration for the Bolshevik Revolution of 1917. In the USSR, he did a lot of work for revolutionary workers' organizations, wrote an autobiography and a book on the history of the labor movement in the U.S. Both were published in Russian. He died in Moscow in 1928.\n\n7. Jenő Landler (1875-1928), Hungary\n\nJenő Landler Public domain Public domain\n\nAs a young man, this prominent Hungarian communist organized several workers' strikes. Later, he became one of the leaders of the short-lived Hungarian Soviet Republic and was in charge of the Hungarian Red Army. After the republic was defeated, he emigrated and cooperated with the Comintern. He died in 1928 in Cannes from an illness. His ashes were interred in the Kremlin Wall. Another Hungarian national and a fellow member of the Hungarian Communist Party, Jenő Hamburger, was also buried in the Kremlin Wall, in 1936. However, after World War II, his ashes were returned to Hungary.\n\n8. Clara Zetkin (1857-1933), Germany\n\nClara Zetkin Public domain Public domain\n\nThe name of this German communist and champion of women's rights was known to every Soviet citizen from childhood: many streets in Russian cities are still named after her, and one of Russia's favorite national holidays is International Women's Day on March 8, which she helped establish. Zetkin was expelled from Germany when Hitler came to power. She died near Moscow in 1933.\n\n9. Sen Katayama (1859-1933), Japan\n\nSen Katayama Public domain Public domain\n\nThis Japanese activist became a communist while studying in the United States. When he returned to his homeland, he began to set up trade unions and labor movements, as well as a left-wing party. When Russia was at war with Japan in 1904, he shook hands with the socialist Georgy Plekhanov - both were elected chairman of the Congress of the Workers' International. During reprisals for organizing workers' riots, he left Japan and in 1918 he moved to Soviet Russia, where he worked in the Comintern. He died in Moscow in 1933.\n\n10. Fritz Heckert (1884-1936), Germany\n\nFritz Heckert Loracco (CC BY-SA 4.0) Loracco (CC BY-SA 4.0)\n\nA prominent figure in the labor movement, Heckert was a member of the German Communist Party’s leadership. He knew Lenin well and admired the success of the revolution in Russia. Heckert, like Zetkin, was forced to leave Germany after the Nazis came to power. He then lived in Moscow and wrote for Soviet newspapers.\n\nIf using any of Russia Beyond's content, partly or in full, always provide an active hyperlink to the original material."}, {"url": "https://www.wsws.org/en/articles/2020/12/03/reed-d03.html", "page_content": "Mid-October marked the 100th anniversary of the untimely death of American revolutionary socialist journalist John Reed. The author of Ten Days That Shook the World, a magnificent firsthand account of the Russian Revolution, Reed died in Moscow of typhus on October 17, 1920, five days shy of his 33rd birthday.\n\nAbout Ten Days That Shook the World, V.I. Lenin, the co-leader of the 1917 October Revolution, commented in an introduction written in 1919, “Unreservedly do I recommend it [Reed’s book] to the workers of the world. Here is a book which I should like to see published in millions of copies and translated into all languages.” The book has had a special place in the hearts and minds of class-conscious workers ever since its appearance. It can still be recommended “unreservedly.”\n\nMany people may be familiar with the name of John “Jack” Reed from the 1981 movie Reds, in which Warren Beatty portrayed the intrepid and principled journalist and for which Beatty won the Academy Award for best director.\n\nWhat the film cannot convey, among other things, however, is the vital, muscular and poetic quality that made Reed’s writing so influential in his time and to later generations. Reds only hints at the full complexity of the man who, more than any American writer of his generation, followed the demands of his political conscience to their revolutionary conclusions.\n\nJohn Reed was born in Portland, Oregon on October 22, 1887 into an upper-middle-class family. His mother’s father, Henry Dodge Green, was a wealthy Portland industrialist and his house a center of Portland’s genteel social gatherings.\n\nReed came of age during the era of the full-blown development of American capitalism. In the 30 years following the Civil War, the US emerged as a modern industrial power. The decades saw the enrichment of the infamous Robber Barons, and the US launched its first imperialist war in 1898, seizing the Philippines and Cuba from Spain.\n\nThe urban population swelled in this period, also a time of large-scale immigration, and the working class emerged as a powerful force, expressing—in a series of bitter strike struggles—its determination to fight the omnivorous ruling class.\n\nReed’s father, C.J. Reed, was a crusader against political corruption in Oregon, helping to take on the logging interests in his capacity as a U.S. marshal. Not having gone to college himself, C.J. was determined that Jack should attend Harvard, interceding for his son when he failed his entrance exam. Jack passed the second time. Working on and contributing to several Harvard publications, Reed honed his journalistic and editing skills. He also wrote and published a good deal of poetry and became a member of the newly formed Harvard Socialist Club.\n\nEstablishing himself in Greenwich Village in 1911, Reed was at the center of the neighborhood’s bohemian culture. The Village was home to such figures as poet Hart Crane, “scandalous” novelist Henry Miller (who, not long before his death, describes Reed’s milieu in Reds) and dramatist Eugene O’Neill.\n\nIt was here, as a working writer and an editor at The American Magazine (founded in 1906), that Reed grappled with the challenge of earning a living under conditions where serious art does not pay the rent. For Reed, “serious art” still meant his poetry, which does not make much of an impression after more than a century, and also supplementing his income from The American by selling short stories, which, in some cases genially give a flavor of life at that time.\n\nAs Reed came to know Manhattan, however, its palaces and its squalor, he came to realize that something was fundamentally wrong with American society. In a later essay written in the months before his journey to Russia that would result in his witnessing the October Revolution, titled “Almost Thirty,” he would recall the political awakening of his early twenties:\n\nOn the whole, ideas alone didn’t mean much to me. I had to see. In my rambles about the city I couldn’t help but observe the ugliness of poverty and all its train of evil, the cruel inequality between rich people who had too many motor cars and poor people who didn’t have enough to eat. It didn’t come to me from books that the workers produced all the wealth of the world, which went to those who did not earn it.\n\nHearing of a new arts and features magazine with a decidedly socialist orientation, called The Masses (founded in 1911), Reed quickly introduced himself to its editor Max Eastman, who would later translate many of Leon Trotsky’s works into English, and climbed on board as both an editor and contributor.\n\nThough the new magazine could not pay him, Reed would find his work for this important publication his most fulfilling. The Masses was to publish the first stories of Sherwood Anderson in 1916, later to be collected in the groundbreaking Winesburg, Ohio. It published works by figures such as Jack London, the novelist Floyd Dell, and the poets Carl Sandburg and Amy Lowell. Painters John Sloan, George Bellows and Pablo Picasso contributed illustrations.\n\nBy 1913, Reed would prove a more than receptive audience member when—in a Greenwich Village apartment—he met William “Big Bill” Haywood, leader of the Industrial Workers of the World (IWW), the left-wing syndicalist movement. Reed listened as Haywood described the developing situation in nearby Paterson, New Jersey, where silk workers were on strike and being beaten and jailed by police. Reed, perhaps for the first time, reacted to a major story not only as a journalist but as a partisan, determined to publicize the strike and help the workers.\n\nSoon after arriving in Paterson, a naturally defiant Reed goaded a belligerent police officer into arresting him. In the county jail, overcrowded with immigrant strikers, he befriended the workers—“gentle, alert, brave men, ennobled by something greater than themselves”—and drew out their stories. That “something greater,” the class struggle, can be seen at work in the article Reed wrote for The Masses (“War in Paterson”), which opens:\n\nThere’s war in Paterson, New Jersey. But it’s a curious kind of war. All the violence is the work of one side—the mill owners. Their servants, the police, club unresisting men and women and ride down law-abiding crowds on horseback. Their paid mercenaries, armed detectives shoot and kill innocent people. Their newspapers ... publish incendiary and crime-inciting appeals to mob violence against the strike leaders ... They control absolutely the police, the press, the courts.\n\nSo moved was Reed by the condition of the silk workers that he organized a dramatic pageant, held at Madison Square Garden, in which the actual workers demonstrated their onerous work and their treatment as strikers at the hands of the police.\n\nReed’s best known work is Ten Days That Shook the World (1919), but he did produce other outstanding works of reportage, one of which is his account of his experiences riding with Pancho Villa’s army in the Mexican Revolution, titled Insurgent Mexico (1914). The compelling work immerses the reader in the harsh, violent life of La Tropa, Villa’s army, and its camp followers.\n\nAs was the case in Paterson, Reed not only sympathized politically with the peasant revolutionaries but came quickly to admire them and want their respect, which he was proud to earn. At one point in Insurgent Mexico, he writes of an initiation into La Tropa over a bottle of sotol:\n\n“Drink it,” yelled the chorus as the Tropa crowded up to see. I drank it. A howl of laughter and applause went up. Fernando leaned over and gripped my hand. “Good for you, companero!” he bellowed, rolling with mirth ... Captain Fernando leaned over and patted my arm. “Now you are with the men (los hombres.) When we win the Revolucion it will be a government by the men,—not by the rich. We are riding over the lands of the men. They used to belong to the rich, but now they belong to me and to the compañeros.”\n\nThe material Reed sent back to the US, published in The Metropolitan magazine, established him as America’s foremost war correspondent. The writing was at once impressionistic and clear-eyed, imagistic and frank.\n\nCertainly, no more stark instance of brutal oppression could have presented itself to Reed or the world than the Ludlow Massacre of April, 1914, the culminating atrocity of the protracted southern Colorado coal miners’ strike of the winter of 1913-14. Reading of the massacre, Reed immediately left for Las Animas County.\n\nThere he made a detailed search of the scene of the massacre, in which National Guard militiamen rented by John D. Rockefeller’s Colorado Fuel and Iron Company killed an estimated 26 miners, their wives and children, some shot with machine guns and some deliberately burned to death in tents the miners had been living in during the strike.\n\nReed wrote a lengthy, scathing article for The Metropolitan, “The Colorado War,” in July 1914, which detailed the murderous violence of the Rockefeller interests. “I got into Trinidad [Colorado, 15 miles from Ludlow] about ten days after the massacre at Ludlow,” Reed wrote. Later in the article, he explained:\n\nI went to Ludlow next day to see the Federal troops come in and the militia leave. The tent colony, or where the tent colony had been, was a great square of ghastly ruins. Stoves, pots and pans still half full of food that had been cooking that terrible morning, baby-carriages, piles of half-burned clothes, children’s toys all riddled with bullets, the scorched mouths of the tent cellars, and the children’s toys that we found at the bottom of the “death hole”—this was all that remained of the entire worldly possessions of 1,200 poor people. At the railroad station about fifty militiamen waited for the train—boys with the stupid, vicious faces of saloon-corner loafers. Only a few were in uniform, for many of them were mine-guards hastily mustered in. As the regulars left their train one militiaman said loudly, in the hearing of the militia officers: “I hope these red-necks kill a regular so they will go in and wipe out the whole bunch. We certainly done a good job on that tent colony.”\n\nIn August of that year, the world was struck by the greatest upheaval to that point in modern times. The First World War broke out in Europe. Reed sailed to Italy as a correspondent for The Metropolitan. He went to France, where he attempted twice to reach the front but was arrested and turned back both times. He then went to London, where he wrote a long article on England in wartime, showing that patriotism was limited to the upper classes. The Metropolitan rejected the article.\n\nIn “The Traders War,” written from London and published in The Masses in September, Reed outlined the history of the imperialist commercial rivalries between Britain, France and Germany and stated that the war was nothing more than a continuation of these conflicts. (In a noteworthy scene in Reds, Reed [Beatty], asked at a meeting of the Liberal Club in Portland, Oregon what he thinks “this war is about,” gets to his feet and replies with one word, “Profits.”)\n\nReed returned to France and in December made his way to Germany via Switzerland. In Berlin, he was able to conduct an interview with the revolutionary socialist Karl Liebknecht, who alone in the German Reichstag had refused to vote to fund the war. When Reed asked him about “the chances of World Revolution,” “‘To my mind’ [Liebknecht] responded serenely, ‘nothing else can come out of this war.’”\n\nReed and other American correspondents were able, after long delays, to secure permission to visit the German front in Northern France. Along the way they were feted by German officers and saw the horrors of trench warfare. He wrote articles on these experiences for The Metropolitan and returned to the US in January 1915.\n\nReed only stayed home a few months. By March, since he was unable to get permission to visit France again, The Metropolitan asked him to report on the war in Eastern Europe. With the artist Boardman Robinson, he visited Serbia, Romania, Bulgaria and Russia.\n\nAlmost half the articles he wrote, although Reed could not know this at the time, were about the final days of the tsarist empire with its drunkenness, abuse, and corruption organized into armies. In one article, “An Optimistic Pilgrimage” that still moves the reader 105 years later, Reed passes through a Jewish village near Rovno in what is now Ukraine, and observes the filth and poverty of the Jews and their oppression by the Russians. One of his guides, a Russian army officer, complains that all Jews are traitors to Russia.\n\nThe scenes from Serbia are shocking. The first country to be invaded by the Austro-Hungarian Empire in response to the assassination of its Archduke Ferdinand in 1914, Serbia was in the middle of a typhus epidemic. Reed visited one hospital for those stricken with disease:\n\nWe entered a barrack, along whose walls cots lay touching each other, and with the feeble light of two lanterns we could see the patients writhing in their dirty blankets, five and six crowded into two beds. Some sat up, apathetically eating; others lay like the dead; still others gave short, grunting moans, or shouted suddenly in the grip of delirium.\n\nWhen Reed returned from Europe in late 1915, the official political atmosphere in the US had shifted to the right: a pro-war “preparedness” campaign was underway and middle-class public opinion had become anti-German. He moved back to Greenwich Village with the woman he would marry, also from Oregon, journalist Louise Bryant. It was at this time he befriended Eugene O’Neill. Reed, O’Neill, Bryant and some of their circle wrote and performed plays in Provincetown, Massachusetts in the summer of 1916.\n\nThe Metropolitan refused to return him to Europe because of his antiwar views. But in the spring of 1917, two more world-shaking events occurred. In March, the Russian tsar, Nicholas II, was overthrown, and in April the United States entered the world war.\n\nThroughout the spring and summer of 1917, Reed wrote antiwar articles for The Masses. By August, he had decided he had to see the revolution in Russia for himself. Reed arrived in Petrograd on September 13, just after the attempted coup against the bourgeois Provisional Government by tsarist General Lavr Kornilov. The coup melted away largely because of the Bolsheviks’ mobilization of workers and soldiers.\n\nThrough connections in New York, including Bolsheviks such as V. Volodarsky, Reed became acquainted with that party’s leaders, who were now preparing the overthrow of the Provisional Government and its replacement by a government of Soviets.\n\nHe hastened from place to place in Petrograd, saving leaflets and proclamations and documenting the positions of each party. He interviewed leaders of the frightened capitalist parties, and he saw Lenin and Trotsky give speeches to thousands of workers. Reed himself spoke to countless other Bolshevik leaders, workers, soldiers and sailors, as they applied themselves to the historical task of establishing a government of the working class. He was a witness to the Bolshevik seizure of power and was present at the famous storming of the Winter Palace, as well as the struggle afterwards by the new Soviet government against counterrevolution.\n\nFor the remainder of the year Reed remained in the new Soviet Russia. He worked for the People’s Commissariat of Foreign Affairs and was briefly appointed consul to the US. In early 1918, he had his first long discussions with Lenin and Trotsky. He left for home soon after, but was detained in Finland until April by the nationalist government.\n\nOn his return to New York, he was met on the dock by government agents who seized his papers and summoned him to court the next day. Reed was indicted under the Espionage Act for a 1917 article, published in The Masses, “Knit a strait-jacket for your soldier boy,” which describes what we now call post-traumatic stress disorder.\n\nReed took up the task of defending the revolution to an American audience in such articles as “Soviets in Action” and “The Structure of the Soviet State” published in T he Liberator (the successor to The Masses), in the autumn of 1918.\n\nIt was at this time that be took up a fight for the ideas of Bolshevism in the left wing of the American Socialist Party, along with Louis Fraina and other supporters of the Russian Revolution in the journal The Revolutionary Age. His papers from Russia were returned to him, and he worked feverishly on his description of the events he had lived through in October-November 1917. Eastman later reported that Reed wrote the book in a remarkably short period of time, sequestered in a room in Greenwich Village, seeing no one and coming out only for meals.\n\nIn March 1919, the product of this effort, Ten Days That Shook the World, was published. It was the peak of Reed’s development as a journalist. He combined his own observations and conversations with the scrupulous publication of the documents of the revolution itself he had collected.\n\nHere is how Reed describes the Bolshevik headquarters, the Smolny Institute, a former upper-class girls school in tsarist times (only eight months previously!) on the day of the insurrection, November 7:\n\nThe massive facade of Smolny blazed with lights as we drove up, and from every street converged upon it streams of hurrying shapes dim in the gloom. Automobiles and motorcycles came and went; an enormous elephant-colored armored automobile, with two red flags flying from the turret, lumbered out with screaming siren. It was cold, and at the outer gate the Red Guards had built themselves a bonfire. At the inner gate, too, there was a blaze, by the light of which the sentries slowly spelled out our passes and looked us up and down. … A crowd came pouring down the staircase, workers in black blouses and round black fur hats, many of them with guns slung over their shoulders, soldiers in rough dirt-colored coats and grey fur shapkas [hats] pinched flat.\n\nOn this occasion Reed encounters the Bolshevik leader Lev Kamenev. Kamenev reads out to him, translating from Russian into French, effectively the first proclamation, just passed in session, of the new Soviet government: “The new Workers’ and Peasants’ Government will propose immediately a just and democratic peace to all the belligerent countries … The Soviet is convinced that the proletariat of the countries of Western Europe will aid us in conducting the cause of Socialism to a real and lasting victory.”\n\nAnd Reed’s description of Lenin stands out:\n\nDressed in shabby clothes, his trousers much too long for him. Unimpressive, to be the idol of a mob, loved and revered as perhaps few leaders in history have been. A strange popular leader—a leader purely by virtue of intellect: colorless, humorless, uncompromising and detached, without picturesque idiosyncrasies—with the power of explaining profound ideas in simple terms, of analyzing a concrete situation. And combined with shrewdness, the greatest intellectual audacity.\n\n(An insightful description, aside from the characterization of Lenin as “colorless” and “humorless,” which was anything but the case!)\n\nTen Days That Shook the World is one of the artistic achievements not only of the Russian Revolution, but of American and world literature. The fact that it inspired another great work, Soviet filmmaker Sergei Eisenstein’s October (1928), gives it a unique place in human culture.\n\nReed discovered the drama of the revolution in its own action, in the rapid and intense response of classes to one other in the pursuit of their social goals, expressed not only by force of arms, but by the most profound political thought. He was able to translate this into narrative and description.\n\nTen Days That Shook the World was the first time the revolution spoke in its full eloquence to the world. Lenin in his famous preface to the book, noted above, commented: “With the greatest interest and with never slackening attention I read John Reed’s book, Ten Days That Shook the World. … It gives a truthful and most vivid exposition of the events so significant to the comprehension of what really is the Proletarian Revolution and the Dictatorship of the Proletariat. These problems are widely discussed, but before one can accept or reject these ideas, he must understand the full significance of his decision. John Reed’s book will undoubtedly help to clear this question, which is the fundamental problem of the international labor movement.”\n\nIn the summer of 1919, Reed helped to launch the Communist Labor Party (one of the forerunners of the Communist Party, founded in May 1921), as it split from the opportunist Socialist Party. In October he left again for Soviet Russia and participated as an American delegate to the Second Congress of the Communist International, held from July 19 to August 7, 1920. Following that, Reed attended the Congress of the Peoples of the East in Baku in Soviet Azerbaijan, an assembly of 1,900 delegates from across Asia and Europe organized by the Communist International, which opened September 1.\n\nFrench leftist Alfred Rosmer, in Moscow Under Lenin, has a well-known description of Reed speaking at the Congress in Baku, a city famous for its petroleum industry. Rosmer noted that Reed, who had learned a few words of Russian, “was a great success. He shouted a question to his audience: ‘Don’t you know how Baku is pronounced in American? It’s pronounced oil!’ The solemn faces were suddenly shaken with laughter.”\n\nReed returned to Moscow on September 15, fell sick with typhus and died on October 17. It is said that he might have survived if the American government had not had an embargo on medications to Soviet Russia.\n\nRosmer explained in his book that when he and others returned from Moscow, “a sad piece of news greeted us. John Reed, who had returned in advance of us, was in hospital, ill with typhus. No effort was spared to save him, but it was all in vain and a few days later he died. His body was displayed in the great hall of the House of Trade Unions. On the day of the funeral, winter had already arrived and snow was falling. We were overwhelmed.”\n\nRosmer continued, “A burial place was found for him in the Kremlin wall, in the section reserved for heroes who had fallen in the revolutionary battle. The words of farewell were spoken by [Nikolai] Bukharin, for the central committee of the Communist Party, by [Alexandra] Kollontai, and by his comrades from the Executive Committee. Louise Bryant, who had arrived only to see him die, was there, completely shattered by grief. The whole scene was indescribably sad.”\n\nReed’s reputation after his death has been closely tied to the fate of the Russian Revolution. The Stalinist regime that usurped the Soviet state in the next decade could not abide the truth about the revolution, and Trotsky’s role in October 1917, as Reed had depicted it. Stalin is mentioned only in passing because he played virtually no role in the seizure of power. The work was banned, at Stalin’s insistence, in the Soviet Union for decades.\n\nEqually, anticommunist commentators in Europe and America have sought to make Ten Days That Shook the World into a mere literary accomplishment. Some have alleged, falsely, that after disagreements over Communist tactics in 1920, Reed became disillusioned with Marxism.\n\nDespite the Stalinist and anticommunist treatment of Reed and his work, for millions of workers and young people Ten Days That Shook the World remains an indispensable introduction to the most momentous event in world history. In a time when the question of socialist revolution has been placed before millions and millions, a new generation must discover his work.\n\nTen Days That Shook the World is currently on sale at Mehring Books for $14.40."}, {"url": "https://www.goodreads.com/book/show/11085310-ten-days-that-shook-the-world", "page_content": "Now that the dust has settled on the Soviet Union (though not, alas, on Russian expansionism) I think the status of the October Revolution of 1917 as the most extraordinary event of the 20th century has probably if anything been enhanced.\n\n\n\nHow in the name of Sergei Eisenstein did a small group of revolutionaries representing solely the needs of the proletariat where the population consisted of 80% peasantry and all the real power lay in the hands of the aristocracy gain the upper hand with barely a shot fired in anger?\n\n\n\nJohn Reed, an American socialist of all things, was on hand to witness just how, and this is his account of it, one which became an instant classic and Lenin himself approved of. I have had a copy hanging around for I don't know how long and finally got around to reading it.\n\n\n\nBefore you read it yourself, and I recommend you do if you are a keen student of history, take my advice and read Reed's notes and explanations section beforehand. Bless my sacred icons, there are enough political parties to occupy a hundred gulags, and that's just amongst the socialists! (Later, of course, they did occupy a hundred gulags.)\n\n\n\nAfter the weak Tsar Nicholas II hopped it in March the Provisional Government was led by Kerensky, a moderate socialist. He instigated an ill-judged military intervention by General Kornilov, who tried and failed to gain power for himself. The revolution survived, but the Bolsheviki were far from likely to rise to the top.\n\n\n\nReed had free access to many of the debates in the Russian houses of parliament and a favoured access to the Bolshevik headquarters at Smolny. He didn't get to talk to Lenin or Trotsky personally but he saw them up close and heard their speeches firsthand.\n\n\n\nHis description of Lenin is worth quoting at length:\n\n\n\n'A short, stocky figure, with a big head set down in his shoulders, bald and bulging. Little eyes, a snubbish nose, wide, generous mouth, and heavy chin; clean-shaven now, but already beginning to bristle with the well-known beard of his past and future. Dressed in shabby clothes, his trousers much too long for him. Unimpressive, to be the idol of a mob, loved and revered as perhaps few leaders in history have been. A strange popular leader—a leader purely by virtue of intellect; colourless, humourless, uncompromising and detached, without picturesque idiosyncrasies—but with the power of explaining profound ideas in simple terms, of analysing a concrete situation. And combined with shrewdness, the greatest intellectual audacity.'\n\n\n\nTrotsky cuts a much more impressive figure, with Reed describing him addressing the hall on the eve of the insurrection, where his 'thin, pointed face was positively Mephistophelian in its expression of malicious irony.'\n\n\n\nThe Bolsheviks were the extreme party, pretty much all the other parties, from their old allies the Mensheviks to the Cadets who represented the intelligentsia, were of a mind to work with capitalists and go slowly. The Bolsheviks acted, capturing the Winter Palace by merely occupying it with minimal resistance.\n\n\n\nAnd it still takes the breath away to read the proclamations they made upon assuming their shaky, largely undesired power in Petrograd. Try this for size, the first line of the first point of the Land Decree:\n\n\n\n1. The Right of private ownership of land abolished for ever\n\n\n\nJust like that!\n\n\n\nI've often asked myself, having lived my life in the first few decades of the 19th century, whether or not I would have been a socialist, concluding that the answer is probably yes. However, I like to think that I wouldn't have been convinced by Lenin and that mob.\n\n\n\nIt's not just the obvious lessons of hindsight that convinces me of that, though the paranoid brutally of Stalin (barely mentioned here so marginal a figure was he at the time) certainly besmirched the good name of communism for ever.\n\n\n\nNo, the signs of where this 'experiment' was going were there from the start in Lenin's immediate U-turn on the freedom of the press. Originally he promised that this was only a short-term measure for the duration of the civil war, then as soon as the Bolsheviks gained power we get this resolution:\n\n\n\n'The reëstablishment of the so-called “freedom of the press,” the simple return of printing presses and paper to the capitalists,—poisoners of the mind of the people—this would be an inadmissible surrender to the will of capital, a giving up of one of the most important conquests of the Revolution; in other words, it would be a measure of unquestionably counter-revolutionary character.'\n\n\n\nThe other socialists in the house could see where this was going and disagreed strongly, which Reed faithfully reported, despite being a clear supporter of the Bolshevik cause. Not long after, Russia became a one-party state.\n\n\n\nBut the revolution never spread across the rest of Europe, which was the Bolshevik's ultimate aim. Sure, Russia's sphere of influence soon grew into the Soviet Union, but this was only achieved by coercion and conquest.\n\n\n\nAs quoted here by Reed, Trotsky famously said of the revolution: 'There are only two alternatives; either the Russian Revolution will create a revolutionary moment in Europe, or the European powers will destroy the Russian Revolution.'\n\n\n\nAnd yet neither of those two things happened.\n\n\n\nThis is a fascinating account of an extraordinary event, brought to life by Reed's closeness to it all, his hearing the speeches and talking to some of the principle players and to ordinary people in the street.\n\n\n\nI would stop short of calling it an exciting account, however. The ten days of the October Revolution certainly shook the world, but the low-key ease in which the Bolsheviks took control barely shook the streets of Petrograd at the time; the shops and theaters stayed open, most people would have been unaware that anything was going on.\n\n\n\nReed wrote well, and with an even hand despite his own allegiances. Only once did I detect an attempt to lower his guard and wax lyrical, when he attended a mass funeral (called a Brotherhood Grave) on his one flying visit to see what was happening in Moscow:\n\n\n\n'I suddenly realised that the devout Russian people no longer needed priests to pray them into heaven. On earth they were building a kingdom more bright than any heaven had to offer, and for which it was a glory to die….'\n\n\n\nI can understand him thinking that at the time, but oh how wrong he proved to be."}, {"url": "https://www.theleftchapter.com/post/john-reed-s-final-dispatches-from-soviet-russia", "page_content": "\n\n\n\n\n\n\n\nToday is the anniversary of the death of John Reed, American communist and revolutionary journalist most famous for his magnificent chronicle of the Russian Revolution, Ten Days That Shook the World.\n\n\n\n\n\nReed died in Soviet Russia October 17, 1920 while travelling around to report on the Civil War and the birth of the world's first socialist state of which he was a full supporter.\n\n\n\n\n\nReed is one of only three Americans buried in the Kremlin Wall Necropolis.\n\n\n\n\n\nBelow are Reed's last two articles which appeared in the Liberator socialist magazine as well his poem Fog.\n\n\n\n\n\nIn the articles he speaks, among other things, of the revolutionary resolve of the people but also the terrible hardships due to the imperialist blockade; a blockade that led directly to his death as a result of a lack of medication to fight typhus. He also talks to both Lenin and Trotsky about the organization of and plans for the Red Army. The final article is left unfinished.\n\n\n\n\n\n\"We know what his crime was -- it is the oldest in all the codes of history, the crime of fighting loyalty to the slaves. And we pay our tribute to him now that he lies dead, only exactly as we used to pay it when he stood here making us laugh and feel brave, because he was so full of brave laughter. Our tribute to John Reed is a pledge that the cause he died for shall live\" - from a memorial speech in John Reed's honour, New York, 1920.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://helenrappaport.com/russia/lenin-stalin-revolution/john-reed-writing-the-russian-revolution/", "page_content": "Returning to New York in 1916 he continued writing inflammatory political articles in the radical press. That autumn he met and married the feminist journalist Louise Bryant. When revolution broke in Russia in February [OS] 1917 Reed was determined to be a witness of this great new Socialist utopia-in- the-making, and set about raising the money to fund his trip there with Bryant. The couple finally arrived in early September, somewhat late for the party, having missed the popular street protests of the very violent February Revolution; the struggles of the Provisional Government to hold on to power; the resumption of violence in early July; and the crisis of the Kornilov revolt at the end of August.\n\nReed had a lot of catching up to do and was at a distinct disadvantage from other foreign journalists already there, in that he arrived without any contacts or knowledge of the city. He went straight to the US Embassy on Furshtatskaya Ulitsa with a letter of recommendation for the US ambassador David R Francis, which, somewhat unconvincingly asserted that he and Bryant were ‘visiting Russia with a view to studying conditions’. The letter asked that the ‘gentlemen of the Embassy’ should extend any help and courtesy they could to them, but Francis was instantly suspicious. He was well aware that Reed was a notorious radical accredited to the New York left wing press. Here was no innocent ‘visitor’, but a reporter with a clear political agenda. Francis deemed him a ‘dangerous Red’ and had him watched.\n\nReed’s unrepentant sympathies for the revolutionary cause and his championing of the victory of the masses ensured that from the first he would be an outsider in the expatriate community of Petrograd. He and Bryant never became integral members of that closed and clannish world, which was highly suspicious of their politics. Nor for that matter did other American, British and French journalists already operating in the city welcome them with open arms. Seasoned reporters in the Allied press circle, such as Arthur Ransome of the Daily News and Harold Williams of the Daily Chonicle, had been in Petrograd for some time, spoke fluent Russian and knew their way around. Unlike Reed with his burning socialist passion, they were far more sanguine about the realities of the new revolutionary order and its political players."}, {"url": "https://www.britannica.com/biography/John-Reed", "page_content": "John Reed, (born Oct. 22, 1887, Portland, Ore., U.S.—died Oct. 19, 1920, Moscow), U.S. poet-adventurer whose short life as a revolutionary writer and activist made him the hero of a generation of radical intellectuals.\n\nReed, a member of a wealthy Portland family, was graduated from Harvard in 1910 and began writing for a Socialist newspaper, The Masses, in 1913. In 1914 he covered the revolutionary fighting in Mexico and recorded his impressions in Insurgent Mexico (1914). Frequently arrested for organizing and defending strikes, he rapidly became established as a radical leader and helped form the Communist Party in the United States.\n\nHe covered World War I for Metropolitan magazine; out of this experience came The War in Eastern Europe (1916). He became a close friend of Lenin and was an eyewitness to the 1917 Bolshevik Revolution in Russia, recording this event in his best known book, Ten Days That Shook the World (1919).\n\nWhen the U.S. Communist Party and the Communist Labor Party split in 1919, Reed became the leader of the latter. Indicted for treason, he escaped to the Soviet Union and died of typhus; he was subsequently buried with other Bolshevik heroes beside the Kremlin wall. Following his death the Communist Party formed many John Reed clubs, associations of writers and artists, in U.S. cities."}, {"url": "https://www.poetryfoundation.org/poets/john-reed", "page_content": "A journalist, historian, and poet, John Reed is best known for his Ten Days that Shook the World, an eyewitness account of the Russian Revolution. Though he thought of himself as a poet and fiction writer, it was as a journalist that Reed gained acclaim. Known for crossing over the line from objective reporting into advocacy for a cause, Reed’s work as both a war correspondent and an activist led Walter Lippmann, a contemporary reporter, to say that “with Jack Reed reporting begins.” As critic Elmer Bendiner of the Nation explained, “The name of John Reed is breathed nowadays like a sigh for lost innocence. He was a journalist of a sort that has gone out of style . . . a reporter on horseback seeking his story in the faces and gestures of the living warriors, not in word games of press handouts or news conferences.” The leader of the Communist Labor Party in the United States, Reed is the only American and one of the few foreigners to have ever been buried at the foot of the Kremlin wall.\n\n\n\nBorn and raised in a wealthy family in Oregon, Reed was educated at Harvard and began his writing career there, writing poetry and plays and serving on the editorial boards of the Lampoon and Harvard Monthly. After his graduation in 1910, he moved to Greenwich Village and joined the staff of the American Magazine as both a contributor and editor. It was during this time that Reed first became interested in social problems, and quickly became a radical. “John Reed was so active in radical politics as to have too little time left for poetry,” wrote Harriet Monroe in Poetry magazine, explaining why Reed’s poetry career had never reached its full potential. “Knowing himself for a poet, he hoped to prove his vocation by many poems worthy to endure; but life was so exciting, and the social struggle in these States and Mexico, in Finland, Russia—everywhere—so tempting to a fighting radical, that poetry had to wait for the leisure which—alas!—never came.” In 1913, Reed joined the staff of The Masses, a periodical that reflected his political views. For The Masses, he wrote an account of the silk workers’s strike in Paterson, New Jersey; during the writing of the article, he was arrested for his attempts to speak on behalf of the strikers. He went on to write a play about the strike, which he produced in Madison Square Garden, performed by the strikers themselves.\n\n\n\nIn 1914, Reed was hired as a war correspondent by Metropolitan magazine to cover the Mexican revolution. Reed followed Pancho Villa’s army and lived among his soldiers for four months, traveling with them across the desert, sleeping on the ground, celebrating in looted haciendas, and being with them in battle. The resulting series of articles, republished in book form as Insurgent Mexico, attracted more critical attention and earned Reed the reputation “the American Kipling.” Insurgent Mexico, divided into six sections, provides descriptions of the Desert War, the attack on Torreón, rebel leader Pancho Villa, and an interview with Carranza, another leader of the rebellion. “The articles he sent back from the border were as hot as the Mexican desert,” reported Walter Lippman, writing for the New Republic, “and Villa’s revolution, till then reported only as a nuisance, began to unfold itself into throngs of moving people in a gorgeous panorama of earth and sky.”\n\n\n\nRobert Rosenstone, in his biography of Reed, Romantic Revolutionary, noted that the book’s “artistically arranged scenes have a balance, coherence and integrity that daily experience lacks. Skies often turn blood-red after battles, simple peons speak with uncanny folk wisdom, the narrator has sudden flashing insights into the symbolic meanings of complex events—such things occur too often to be taken as a literal transcription of what Reed saw, heard and did.” Granville Hicks, in his biography John Reed: The Making of a Revolutionary, said of this quality in the work, Reed “was indifferent to the accuracy of the historian, but he had the integrity of a poet.”\n\n\n\nNot all critics were won over by Reed’s narrative style. A reviewer for the Nation commented, “The book is a lurid exaggeration of some few aspects, and the frenzied manner of the whole composition aims not so much at depicting sober truths as at shocking the reader by disgusting naturalism in describing an irregular assortment of horrors such as were to be found nowhere else in the world at the time that Reed wrote.” Critics in the late twentieth century, however, recognized the merits of Insurgent Mexico; a writer in History Today called it “a classic indeed,” and Richard Elman of the Nation claimed that the book was “Reed’s finest writing, a book of such vividness, empathy and daring that much of what passes for personal journalism today does seem callow by comparison.”\n\n\n\nReed himself described his travel to Mexico in his essay “Almost Thirty,” printed in the New Republic. “A terrible curiosity urged me on,” he described. “I felt I had to know how I would act under fire, how I would get along with these primitive folks at war. And I discovered that bullets are not very terrifying, that the fear of death is not such a great thing, and that the Mexicans are wonderfully congenial. . . . I loved them and I loved the life. I found myself again. I wrote better than I have ever written.”\n\n\n\nReed returned from Mexico a popular figure, but his acclaim soon faded due to his opposition to World War I and his participation in the Socialist Party. Many magazines would no longer print his work, and his next book, The War in Eastern Europe, was called by Harry Henderson in the Massachusetts Review a “dismal failure.” The articles for this book were again commissioned by Metropolitan, and Reed traveled to Europe, behind both Allied and German lines. Because of Reed’s socialist views, he was not granted the same insider’s view as he had been in Mexico. Though he used the same form as he had for Insurgent Mexico, without his being able to identify with a specific cause, according to Henderson, “Reed becomes entirely disoriented as a narrator.” Unable to recreate his earlier successes, Reed began co-writing and producing short plays for the Provincetown Players with Louise Bryant and Eugene O’Neill. Bryant became his wife in 1917.\n\n\n\nIn August of 1917, Reed and Bryant sailed to Russia to cover the coming revolution. As a supporter of communism, Reed quickly sided with Vladimir Lenin and his supporters, and was an enthusiastic witness to the Bolshevik revolution in Petrograd. Reed alone among the foreign correspondents was given an insider’s view and treated as a fellow to the cause. He kept a diary of his conversations with educated leaders and peasants alike. The book that recorded the events of the revolution, Ten Days that Shook the World, is, according to Henderson, “the great case in the history of eye-witness accounts of the right reporter being in the right place at the right time.” Ten Days that Shook the World was “the first major account in America of the revolution’s universal impact,” according to John Stuart in his introduction to The Education of John Reed, and is often considered by critics the finest first-hand account of the Russian revolution.\n\n\n\nBertram D. Wolfe, in his book Strange Communists I Have Known, explained that Reed “tried to see it all and put it all on paper. The dream of the Bolsheviks, the realities of their deeds, and the tension between the dream and reality are in his pages.” Stuart praised Reed, declaring, “What he wrote about the Russian Revolution in Ten Days that Shook the World, with its extraordinary weaving of significant detail into a triumphal theme, was a measure of the great leap forward he had made.” But the reception of the book in America at the time was not positive. Even before its publication, Reed had not been allowed to return to the United States due to a sedition charge against him for articles he had written for The Masses. When he was finally allowed entrance into the country, he turned from journalism to politics, and organized the Communist Labor Party, one of the two rival communist parties in the United States. When Ten Days that Shook the World was published in 1919, Reed was indicted as a communist leader during the “Red Scare” after World War I, due to his radical stance and obvious support of communism. He fled the country, eventually returning to Russia where he died of typhus. Reed was buried, honored as a Soviet hero, under the Kremlin wall facing the Red Square, the only American and one of the few foreigners to receive such an honor."}]}