{"Paul Elliott was elected to the House of Commons at the 2010 general election.": [{"url": "https://www.britannica.com/topic/British-general-election-of-2010/Background-and-context", "page_content": "Background and context\n\nThis section contains links to areas of Encyclopædia Britannica’s coverage of the United Kingdom, its politics, and its recent political history that readers will find useful for understanding the 2010 British general election. These sections were most recently revised or written by Peter Kellner, president of YouGov PLC, and Patrick Joyce, a history professor at the University of Manchester.\n\nConstitutional Framework provides an overview of the British constitution and government.\n\nPolitical Process describes the two-party system, as well as the role of women in British politics.\n\nLabour in Power Since 1997 offers detail on the Blair and Brown years.\n\nThe political systems and processes in England, Scotland, Wales, and Northern Ireland are described in detail in the following articles.\n\nReaders might also find the following articles useful."}, {"url": "https://www.britannica.com/topic/British-general-election-of-2010", "page_content": "On May 6, 2010, British voters delivered to the House of Commons a hung Parliament—the first time a single party had not achieved a majority since the February 1974 election. At 65 percent, turnout was up 4 percent over 2005, when Tony Blair had led his Labour Party to its third successive majority. In 2010, however, Blair was not a candidate, having turned over the reins of government to Gordon Brown, his longtime chancellor of the Exchequer. Sagging poll numbers for Labour and a resurgent Conservative Party under the youthful David Cameron brought the assumption that the Conservatives would cruise to a parliamentary majority for the first time since 1997.\n\nIn the months before the 2010 election, the Conservatives held a solid lead in the public opinion polls, but there were persistent lingering doubts about the readiness of Cameron and his team to govern, and, as election day neared, the Conservative lead declined. The 2010 campaign brought a novelty to the British general election campaign—televised debates between the leaders of the three main parties: Brown of Labour, Cameron of the Conservatives, and Nick Clegg of the Liberal Democrats. (The Plaid Cymru and the Scottish National Party protested their exclusion.) This brought great anticipation and introduced a wild card into the campaign. Clegg’s performance in the first debate brought a great surge to the Liberal Democrats, with some polls released in the days after the debate putting the Lib Dems in first or second place, ahead of Labour. Following the second and third debates, however, some of the surge by the Lib Dems receded, and the Conservative lead grew once again.\n\nOn election night the Lib Dems finished a distant third, with 57 seats (a net loss of 5 seats from 2005). The Conservatives, at 306 seats, emerged as the largest party by far but without a majority, gaining 97 seats over their notional 2005 total (i.e., basing the 2005 results on the 2010 constituency boundaries). The clear loser was Labour, which lost 91 of its seats and fared particularly poorly in the south of England. (One English seat, Thirsk and Malton, was uncontested on election day, because of the death of the United Kingdom Independence Party candidate.) Indeed, all but nine of the seats the Conservatives won were in England.\n\nThe election also brought some other surprises. The Alliance Party of Northern Ireland won its first seat ever in the House of Commons, ousting Democratic Unionist Party leader Peter Robinson. The Green Party also won its first seat, capturing the seat of Brighton Pavilion along the southern coast. And, surprisingly, though there was a strong swing away from Labour in much of the country, the Labour share of the vote held up rather well in Scotland and Wales.\n\nClegg indicated that the Conservatives, as the largest party, should have the right to attempt to form a government, but, with no party securing a majority and with most parties unlikely coalition partners for the Conservatives, it remained unclear who would become prime minister. Negotiations between Cameron and Clegg began in earnest on May 7, and on May 10 Brown announced his intention to resign as leader of the Labour Party. The following day Brown announced his resignation as prime minister and as leader of the Labour Party, and Cameron subsequently became prime minister.\n\nThe Conservatives and Liberal Democrats formed a coalition government—Britain’s first since World War II—with Clegg taking the post of deputy prime minister. Conservatives William Hague (foreign secretary) and George Osborne (chancellor of the Exchequer) were among the leading cabinet appointments. Several Liberal Democrats, including Chris Huhne (secretary of state for energy and climate change), also took cabinet posts. As part of the power-sharing agreement, the Conservatives and the Lib Dems agreed to set out a plan for deficit reduction in an emergency budget to be presented within 50 days of taking office. They also agreed to a fixed five-year Parliament that called for the next election to be held on the first Thursday in May in 2015, though dissolution of Parliament and a subsequent election could come earlier through the vote of 55 percent or more of the House of Commons. The coalition partnership called for a referendum on alternative vote, whereby voters indicate a first and second preference, with the second preference being counted only if no candidate receives a majority—which fell short of the Lib Dems’ goal of full proportional representation.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nThe results of the 2010 election results are provided in the table."}, {"url": "https://www.history.com/topics/british-history/british-parliament", "page_content": "Parliament is the legislative body of the United Kingdom and is the primary law-making institution in Great Britain’s constitutional monarchy. The history of the legislative body—which meets in the Palace of Westminster in London—shows how it evolved almost organically, partly in response to the needs of the country’s reigning monarch. Parliament traces its roots back to the earliest meetings of English barons and commoners in the 8th century.\n\nParliament’s Humble Beginnings\n\nThe present-day Parliament is a bicameral (“two chambers”) legislature with a House of Lords and a House of Commons. These two houses, however, weren’t always joined, and had their earliest beginnings in the Anglo-Saxon council governments of the 8th century.\n\nThe Witan was a small council of clergymen, land-owning barons and other advisors chosen by the king to discuss matters of state, taxation and other political affairs. As it expanded to include more advisors, the Witan evolved into the magnum concilium or Great Council.\n\nOn a local level, “moots” were meetings of local bishops, lords, sheriffs and, importantly, commoners who were representatives of their counties or “shires.”\n\nThese institutions functioned—with varying degrees of success—as law-making bodies and law enforcement agencies throughout England during the Middle Ages. The two bodies didn’t regularly convene, but they paved the way to the bicameral legislature that exists today.\n\nMagna Carta\n\nThe first English Parliament was convened in 1215, with the creation and signing of the Magna Carta, which established the rights of barons (wealthy landowners) to serve as consultants to the king on governmental matters in his Great Council.\n\nAs in the early Witans, these barons were not elected, but rather selected and appointed by the king. The Great Council was first referred to as “Parliament” in 1236.\n\nBy 1254, the sheriffs of the various counties in England were instructed to send elected representatives of their districts (knowns as “knights of the shire”) to consult with the king on issues related to taxation. Four years later, at the English university town of Oxford, the noblemen who served in Parliament at the time drafted the “Provisions of Oxford,” which called for regular meetings of the legislative body, composed of representatives from each of the counties.\n\nIn 1295, Parliament evolved to include nobles and bishops as well as two representatives from each of the counties and towns in England and, since 1282, Wales. This became the model for the composition of all future Parliaments.\n\nRichard II Deposed\n\nOver the course of the next century, the membership of Parliament was divided into the two houses it features today, with the noblemen and bishops encompassing the House of Lords and the knights of the shire and local representatives (known as “burgesses”) making up the House of Commons.\n\nDuring this time, too, Parliament began to take on more authority within the English government. In 1362, for example, it passed a statute decreeing that Parliament must approve all taxation.\n\nFourteen years later, the House of Commons tried and impeached a number of the king’s advisors. And, in 1399, after years of internal struggle for power between the monarchy and Parliament, the legislative body voted to depose King Richard II, enabling Henry IV to assume the throne.\n\nParliament’s Power Expands\n\nDuring Henry IV’s time on the throne, the role of Parliament expanded beyond the determination of taxation policy to include the “redress of grievances,” which essentially enabled English citizens to petition the body to address complaints in their local towns and counties. By this time, citizens were given the power to vote to elect their representatives—the burgesses—to the House of Commons.\n\nIn 1414, Henry IV’s son, Henry V, assumed the throne and became the first monarch to acknowledge that the approval and consultation of both houses of Parliament was required to make new laws. Still, all was not perfect in England’s fledgling democracy.\n\nMore than 100 years later, in 1523, philosopher and writer Sir Thomas More, a Member of Parliament (M.P. for short), was the first to raise the issue of “freedom of speech” for lawmakers in both houses during deliberations. A half-century hence, during the reign of Queen Elizabeth I in 1576, Peter Wentworth, M.P., made an impassioned speech arguing for the same right; he was sentenced to imprisonment in the Tower of London.\n\nWentworth, a Puritan, later clashed with Elizabeth I over issues related to freedom of religion during his time as an M.P., and he was jailed for these acts as well. It was this persecution that led the Puritans to leave England for the New World in the 1600s, helping to settle the 13 colonies that eventually became the United States.\n\nEnglish Civil War\n\nFor much of the 17th century, the United Kingdom experienced a great deal of change and political turmoil. Arguably, the one constant was Parliament.\n\nFrom 1603 to 1660, the country was mired in a drawn-out civil war and, for a time, military leader Oliver Cromwell assumed power under the title Lord Protector. The ruling monarch at the time, Charles I, was executed in 1649.\n\nCromwell is best known for conquering Scotland (1649) and Ireland (1651) and bringing them, unwillingly, under the dominion of the United Kingdom. Still, those two nations had their own Parliaments, made up of Cromwell supporters.\n\nParliament continued to retain some power during this period of change. However, M.P.s who were thought to be loyal to Charles I were excluded from the legislature in 1648, creating the so-called “Rump Parliament.”\n\nThe Monarchy Abolished\n\nIn 1649, the House of Commons took the unprecedented step of abolishing the monarchy and declaring England a commonwealth.\n\nFour years later, though, Cromwell disbanded the Rump Parliament and created the Nominated Assembly, a de facto legislature. Cromwell died in 1658 and was replaced by his son Richard. The son was deposed a year later, and Britain’s government effectively collapsed.\n\nCharles I’s son, Charles II, was restored to the throne in 1660, reaffirming the monarchy’s place in British history.\n\nNew Parliamentary elections were held. And the M.P.s elected effectively held their seats for the next 18 years, during which no general election was called.\n\nThe Stuart Kings\n\nThe so-called “Stuart Kings”—Charles II and his brother James II, who succeeded him in 1685—maintained a similar relationship with the legislature as their father had in the 1640s. However, religion was a major issue dividing English government and society.\n\nWhen Parliament passed the “Test Act,” which prevented Catholics from holding elected office, the legislature was at odds with King James II, himself a Catholic. After years of political in-fighting during the Glorious Revolution, Parliament deposed James II in 1689 and his eldest daughter Mary and her husband William of Orange ascended to the throne.\n\nDuring their brief rule, Parliament was once again elevated to having law-making powers. In fact, when Mary and William died (in 1694 and in 1702, respectively), the legislature established new protocols for succession, and named George of Hanover king.\n\nParliament in Recent History\n\nOver course of the 18th, 19th and 20th centuries, Parliament and its powers evolved—just as the United Kingdom itself did.\n\nScotland formally became a part of the United Kingdom in 1707, and thus sent representatives to the Parliament at Westminster. By the late 1700s, Ireland was also part of the United Kingdom (the six counties in the north of the island—known collectively as Ulster—remain part of the U.K. today), and land-owners there elected their own representatives to both houses of Parliament.\n\nThrough a series of legislative acts, known as the “Reform Acts,” a number of changes were made to the composition and legislative process in Parliament. The Reform Act of 1918 gave women the right to vote, and the first woman was elected to the body that same year.\n\nHowever, Countess Constance Markievicz of Ireland was a member of Sinn Fein, the political party seeking independence for the island nation, and thus refused to serve.\n\nMeanwhile, the Parliament Acts of 1911 and 1949 established greater powers for the House of Commons, which has 650 elected members, compared to the House of Lords, which has 90 members appointed via peerage (a system of titles for noblemen).\n\nHouse of Lords\n\nToday, the two houses of Parliament—the House of Lords and the House of Commons—meet in the Palace of Westminster in London, and are the only body in the United Kingdom’s constitutional monarchy government with the authority to create legislation and make laws.\n\nThe current monarch, King Charles III, still serves a ceremonial role as head of state, and the country’s executive branch is headed by the Prime Minister.\n\nWhile the House of Lords can debate all bills that don’t deal directly with financial matters for the country, it is the House of Commons that holds the ultimate sway when it comes to whether legislation ultimately becomes law.\n\nHowever, the House of Lords does play a role in government accountability, through its questioning of cabinet ministers and the formation of special committees to address important matters of state. Its members are now mostly appointees, not peers who inherit their seats in the House of Lords.\n\nHouse of Commons\n\nToday, all legislation must be approved by the House of Commons in order for it to become law. The House of Commons also controls taxation and the government’s purse strings.\n\nThe public in the United Kingdom elects each of the 650 members of the House of Commons. And in a system somewhat different from that of the United States, government ministers (including the Prime Minister) must regularly answer questions in the House of Commons.\n\nSources\n\nThe Birth of English Parliament. Parliament.uk.\n\nA brief history of the UK Parliament. BBC News.\n\nThe Civil War. HistoryofParliament.org.\n\nStuarts. HistoryofParliament.org.\n\nReform Era. HistoryofParliament.org.\n\nLegislative Procedure in the House of Commons. University of Leeds.\n\nTimeline: Constitutional crises in English and British history. Reuters."}, {"url": "https://www.britannica.com/topic/House-of-Commons-British-government", "page_content": "House of Commons , also called Commons , popularly elected legislative body of the bicameral British Parliament . Although it is technically the lower house, the House of Commons is predominant over the House of Lords , and the name “Parliament” is often used to refer to the House of Commons alone.\n\nappeals to political theorists, enables every individual or group to move round the centre, adopting various shades of pink according as the weather changes.…A chamber formed on the lines of the House of Commons should not be big enough to contain all its members at once without overcrowding, and there should be no question of every member having a separate seat reserved for him. If the House is big enough for all its members, nine-tenths of its debates will be conducted in the depressing atmosphere of an almost empty or half-empty Chamber.…[T]here should be on great occasions a sense of crowd and urgency.\n\nDespite its large membership, the chamber of the House of Commons seats only 427 persons. After it was destroyed by a German bomb during World War II , there was considerable discussion about enlarging the chamber and replacing its traditional rectangular structure with a semicircular design. Among those who argued against this proposal was Winston Churchill , who maintained that a semicircular chamber\n\nThe membership of the House of Commons stood at 658 from 1801—when Great Britain and Ireland were united by the Act of Union to form the United Kingdom—until 1885, when it was increased to 670. In 1918 it was increased to 707. It was also changed under subsequent acts. At the general election in May 2010, 650 members were returned—533 from England, 59 from Scotland, 40 from Wales, and 18 from Northern Ireland . Each constituency returns a single member.\n\nThe House of Lords was initially the more powerful of the two houses, but over the centuries its powers gradually diminished . By the late 17th century, the House of Commons had gained the sole right to initiate taxation measures. The House of Lords retained its veto power over bills passed by the Commons, however, and in 1832 the only recourse of the Liberal Party government was to threaten to flood the House of Lords with new Liberal peers in order to prevent it from rejecting that government’s Reform Bill . Eighty years later the same threat was used, again by a Liberal government, to compel the Lords to approve the Parliament Act of 1911 , which enabled a majority of the House of Commons to override the Lords’ rejection of a bill. Under this act, the House of Lords lost the power to delay legislation passed by the Commons for the raising and spending of revenue; it also lost the power to delay other legislation for a period beyond two years (reduced in 1949 to one year). The act also reduced the maximum duration of a parliamentary session to five years.\n\nThe origins of the House of Commons date from the second half of the 13th century, when landholders and other property owners in the counties and towns began sending representatives to Parliament to present grievances and petitions to the king and to accept commitments to the payment of taxes. In the 14th century the knights and burgesses chosen as representatives (i.e., the commons) began sitting in a separate chamber, or “house,” from that used by the nobles and high clergy (i.e., the lords).\n\nFunctions and operation\n\nLearn about the history and traditions of the House of Commons Chamber, also the functions of its members See all videos for this article\n\nThe House of Commons is the effective legislative authority in Great Britain. It alone has the right to impose taxes and to vote money to, or withhold it from, the various public departments and services. The House of Lords has only infrequently held up major legislation passed by the Commons, and the British sovereign almost automatically provides the Royal Assent to any bill passed. Indeed, the last bill to be rejected by a monarch was the Scottish Militia Bill of 1707, which was vetoed by Queen Anne. Acts of Parliament are not subject to judicial review.\n\nThe passage of legislation is the House of Commons’ primary function. Almost all legislation proceeds from the majority party in the Commons, which forms the government and the cabinet; the latter is composed of senior ministers chosen by, and belonging to the party of, the prime minister, nearly all of whom serve in the House of Commons. The government’s main work in the Commons is to implement the legislative program on which it fought and won the last general election.\n\nAt the beginning of each new session of Parliament, the House elects from its members the speaker, who presides over and regulates debates and rules on points of order and members’ conduct. The speaker does not participate in debates and votes only in order to break a tie, a case that compels the speaker to vote in favour of the status quo. The calling of members to speak in debate is entirely in the speaker’s hands, the main concern being to ensure that a variety of points of view is heard. By a convention of the constitution not established until the 20th century, the prime minister is always a member of the House of Commons, instead of a member of either house. The government party appoints the leader of the House of Commons, who manages the party’s legislative program. Except for occasional independents, members of both the government and opposition parties are under the control of party management within the Commons, whose discipline—particularly over voting—is exercised by members called “whips.”\n\nThe tradition that a bill must be read three times in the Commons (and also in the Lords) before it can be voted on is based on the need to allow members adequate time to investigate the principles on which the bill is based and the details of its provisions. The first reading is purely formal, but the second reading provides the occasion for debate on the principles involved. The bill then goes into committee, where it is examined clause by clause. Most bills are sent to standing committees, each of which deals with bills belonging to a particular range of topics, with the committees reflecting in their makeup the respective strength of parties in the House. Having examined the bill, the committee then reports back to the House, and after further amendments may have been proposed in the course of more debate, the bill is read a third time and is then voted on. In addition to bills proposed by the government, a limited number of bills sponsored by individual members are considered by the House each session.\n\nBeginning in 1999, power over a number of matters—including health, education, housing, transportation, the environment, and agriculture—was devolved from the British Parliament to the newly established Scottish Parliament, National Assembly of Wales, and (somewhat later) Northern Ireland Assembly. That reallocation of legislative responsibilities raised the issue of whether MPs from Scotland, Wales, and Northern Ireland should continue to vote on measures directed at England only. This so-called West Lothian question (so named because it was first posed in 1977 by the anti-devolutionist MP from West Lothian, Tam Dalyell) was addressed in 2015 by controversial legislation that established a new set of procedures known as English Votes for English Laws (EVEL). New stages were introduced into the standard lawmaking procedure during which legislation that was determined to affect England only was to be considered and voted upon by MPs from English constituencies (who were effectively granted veto power) before moving on to consideration by the House of Commons as a whole. (Similarly, legislation aimed at England and Wales only was to be addressed first by English and Welsh MPs only.) When it was not clear whether a measure was an England-only matter, the speaker of the House of Commons was tasked with making that determination.\n\nAside from passing legislation, the most important business of the full House is the question period, which is held on a regular basis. During this period, members can require government ministers to answer questions regarding their departments; it thus provides the opposition with an opportunity to attack government policy and to raise issues on which the government may be thought to have been negligent. It also generates regular policy debates between the prime minister and the leader of the opposition. These exchanges have been made more important by their public broadcast, first by radio in 1978, and then by television in 1989.\n\nMembers of the House of Commons must be 18 years of age or older. Peers of England, Scotland, or the United Kingdom may not be elected to the House of Commons, though Irish peers may be. Certain clergy, judicial officers, members of the armed forces, police officers, and civil servants are also ineligible for election. Women became eligible under an act of 1918. Members were paid beginning in 1911."}, {"url": "https://simple.wikipedia.org/wiki/2010_United_Kingdom_general_election", "page_content": "Colours show the winning party, as shown in the main table of results\n\n† excluding the Speaker\n\n‡ owing to electoral boundaries changing, this figure is notional\n\nComposition of the House of Commons after the election\n\nThe 2010 United Kingdom General Election was an election held on 6 May 2010 to elect 650 members to the House of Commons of the United Kingdom. The three party leaders are shown below.\n\nThe election resulted in a hung parliament, where no political party has an overall majority of seats. This is the first time this has happened since 1974.\n\nThe Conservative Party won 307 out of the 650 seats available making them the largest party in the House of Commons. A coalition was then formed between the Conservative Party and the Liberal Democrats who together had enough seats for a majority. This is the first coalition government in the United Kingdom since World War II.\n\nThe Leader of the Conservative Party David Cameron became Prime Minister of the United Kigdom on 11 May 2010 and the leader of the Liberal Democrats Nick Clegg became the Deputy Prime Minister. Before the election, the Leader of the Labour Party Gordon Brown was the Prime Minister.\n\nThis was the first British general election where the leaders of the three main parties took part together in a series of debates for television. The first debate was shown on ITV and was moderated by Alastair Stewart. It was on the subject of domestic affairs and polls taken after the debate showed that most people thought Liberal Democrat leader Nick Clegg had done the best and the Liberal Democrats then saw a large rise in support in opinion polls, even beating Labour for second place behind the Conservatives.\n\nThe second debate, on the subject of Foreign Affairs was shown on Sky News and was moderated by Adam Boulton. Polls after this debate showed that Nick Clegg and David Cameron had done best with Gordon Brown slightly behind. The third and final debate was shown on BBC One and was moderated by David Dimbleby. It was on the subject of the economy and taxes and most opinion polls indicated that David Cameron had performed the best out of the three leaders.\n\nThe Conservative Party gained support from the following newspapers: the Daily Express, the Daily Mail, the Sun, the Daily Telegraph, the Times, the Daily Star, the Evening Standard, the Financial Times, Sunday Express, the Mail on Sunday, the News of the World, the Sunday Telegraph and the Sunday Times. The Liberal Democrats were supported by: the Guardian, the Observer and the Independent. Only the Daily Mirror and the Sunday Mirror supported the Labour Party and the People newspaper favoured a coalition.\n\nThis election saw the Conservative Party return to government for the first time since 1997 and also saw the Liberal Democrats get their first ever representation in government. Peter Robinson, the First Minister of Northern Ireland and leader of the Democratic Unionist Party unexpectedly lost his seat to the Alliance Party. The Green Party of England and Wales gained its first ever seat in the House of Commons and the Alliance Party of Northern Ireland gained its first seat in the House of Commons since 1974. Former Labour Party Home Secretaries Jacqui Smith and Charles Clarke both lost their seats. The Ulster Unionist Party and the Respect Party won seats in the 2005 General Election but lost their seats in the 2010 Election.\n\nResults by party [ change | change source ]\n\nThe final results of the election were:\n\nThe seat of North Down was won by an Independent candidate and the seat of Buckingham was won by the Speaker of the House of Commons John Bercow, who is not considered to be of any political party.\n\n1.0 1.1 Reflects the notional winners of seats in light of boundary changes"}, {"url": "https://www.blackhistorymonth.org.uk/article/section/history-of-politics/the-first-black-parliamentarians-in-our-times/", "page_content": "The General Election of 1987 saw the historic election to the House of Commons of four Black Members of Parliament.\n\nThey all were Labour M.P.s and their names were Dianne Abbott, Paul Boateng, Bernie Grant, and Keith Vaz. At Westminster they joined the Labour peer, Lord Pitt, appointed to the House of Lords in 1975.\n\nSquare\n\nDianne Abbott\n\nDiane Abbott’s election to represent the London constituency of Hackney North and Stoke Newington made her Britain’s first Black woman MP. Born in London of Jamaican parents, Abbott was educated at Harrow County Girls’ Grammar School and Newnham College, M.A.Hons. History, Cambridge University.\n\nA journalist by profession, she had worked as an administrative trainee with the Home Office; Race Relations Officer for the National Council for Civil Liberties; a reporter with TV AM and Thames Television; Public Relations Officer with the GLC and Head of Lambeth Council’s Press Office.\n\nAbbott was active in the Black Sections movement within the Labour Party and in community politics, including OWAAD (Organisation of Women of African and Asian Descent); the “Scrap Sus” campaign to ban police stop-and-search tactics levelled at Black youth, and was a founder member of the Black Media Workers’ Organisation.\n\nActive for many years in the trade union movement, particularly on race equality issues, Ms Abbott served for a year as Britain’s first Black female Equality Officer in the Association of Cinematograph Television and Allied Technicians. She also served as an elected local councillor in the London Borough of Westminster for four years, during which she was a member of the Environment, Grants and Social Services Committees.\n\nPaul Boateng\n\nBorn in the Gold Coast (now Ghana), West Africa, Paul Boateng was educated at the Ghana International School and Accra Academy, and later at Apsley Grammar School and the University of Bristol, England. Boateng qualified as a solicitor in 1976, and was called to the Bar in 1989.\n\nHis political life began with membership in the Labour party in 1966 and he became a prominent member of the Greater London Council 1981-86, serving as chair of the Police Committee. Elected as M.P. for Brent South in 1987, he severed links with the Black Sections movement in 1988, and became Opposition spokesman on Treasury and economic affairs. He is now Parliarmentary UnderSecretary for Health in the Labour Government.\n\nBernie Grant\n\nBorn in Guyana, and resident in Britain since 1963, Bernie Grant worked as a British Railways clerk, National Union of Public Employees area officer, and as a partisan of the Black Trade Unionists Solidarity Movement. In the political sphere he joined the Labour Party in 1975 and was elected as Member of Parliament for Tottenham.\n\nGrant had served for a decade of service as local councillor in the London Borough of Haringey, of which he was elected Leader in 1985. He was the first ever Black Leader of a local authority in Europe, and in this capacity had responsibility for an annual budget of some £500 million, and the well-being of a quarter of a million people, many of them Black and ethnic minorities.\n\nBernie Grant brought to parliament a long and distinguished record as a leading campaigner against injustice and racism. He was a founder memebr of the Standing Conference of Afro-Caribbean and Asian Councillors and a member of the Labour Party Black Sections. Grant was a member of the National Executive of the Anti-Apartheid Movement in Britain, with a longstanding concern about the situation in Southern Africa. He also had a keen interest in the affairs of the Caribbean region, and of Central America, Ireland and Cyprus. He was also involved in efforts to tackle racism on a European wide level, in association with European Members of Parliament and European anti-racist groups.\n\nKeith Vaz\n\nKeith Vaz’ gaining of the Parliamentary Seat for Leicester East from the Conservative Party would have been a remarkable achievement in any year. But coming as it did in June 1987 when the national trend was overwhelmingly in the other direction, his arrival as a Black Member of Parliament was viewed as a major political feat. He was also, at 32, Labour’s youngest MP.\n\nKeith was born in Aden, South Arabia, his family originated from India. He was educated in Twickenham and Hammersmith schools and at Gonville and Caius College, Cambridge University, and gained BA Law Hons. and MA Hons. degrees. Before his election he was solicitor to the Highfields and Belgrave Law Centre in Leicester. He stood as a parliamentary candidate in Richmond, Surrey when he was just 25, and a year later contested Surrey West in the European election. His sister, Valerie Vaz, was at the time the Deputy Leader of the London Borough of Ealing, the first Black woman to hold the post.\n\nLord David Pitt\n\nLord Pitt of Hampstead, now deceased was the longest serving Black Parliamentarian, having been granted a life peerage in 1975. Born in Grenada, he came to Britain in 1933 to study medicine at Edinburgh University. His achievements in his two chosen careers of medicine and politics were considerable. In 1943, while practicing medicine in Trinidad and Tobago, he was founder member and leader of the Westindian National Party.\n\nUpon his return to live in Britain in 1947 he served as a Member of London County Council and a Chairperson of the Greater London Council and, from 1985-88, as President of the British Medical Association. He was Deputy Chairman of the Community Relations Commission from 1968-1977, and Chairman in 1977. Notably, Pitt was a member of black peoples’ and anti-discriminations organisations such as the Legue of Coloured Peoples and the Campaign Against Racial Discrimination which he chaired in 1965.\n\nAs a prominent member of the House of Lords, inner city issues were among his major concerns. He was Chairperson of the Shelter National Campaign for the Homeless; Chairperson of the Race Equality Unit of the Institute of Social Work; President of the Open Door Counseling Service for the Youth of North London; President of the African-Caribbean Medical Society and Co-Chairperson of the Urban Trust, which provided pump-priming finance for projects in inner city areas."}, {"url": "https://www.politics.co.uk/reference/elections/", "page_content": "Overview\n\nThe House of Commons is made up of 650 elected Members of Parliament, known as MPs. Each Member of Parliament represents a specific geographic area within the United Kingdom. These areas are known as Parliamentary constituencies.\n\nParliamentary Constituencies\n\nIn 2017, the average constituency was comprised of 56,000 voters in Wales, 68,300 voters in Northern Ireland, 67,200 voters in Scotland, and 72,200 votes in England. The largest constituency by population was the Isle of Wight (110,683).\n\nThe Boundary Commission is currently working on proposals to better standardise the electoral numbers within the UK’s 650 constituencies.\n\nBy area, the largest constituency is Ross, Skye and Lochaber in North West Scotland (918,319 hectares). The smallest by area is Islington North in London (727 hectares).\n\nWithin each constituency, Members of Parliament are elected by the first-past-the-post system, which is also known as the plural majority system. Simply put, this means the candidate with the highest number of votes wins.\n\nWho can stand for election\n\nAnyone over the age of 18, who is a British, Irish or Commonwealth citizen can stand for election to Parliament. The only exceptions are Peers, Bishops, undischarged bankrupts, prisoners and certain officeholders including judges, military personnel, police officers and other civil servants (persons holding offices of profit under the Crown).\n\nPeople convicted of certain corruption offences and members of non-Commonwealth legislatures may not stand.\n\nElection Cycles\n\nParliamentary elections must be held at least every five years. Unless they have lost a vote of no confidence in the House of Commons, the date for post war British elections within that period has typically been chosen by the Prime Minister. The sitting Prime Minister asks the Monarch to dissolve Parliament.\n\nThis convention was briefly interrupted by the introduction of the Fixed Term Parliament’s Act in 2010, albeit in both 2017 and 2019, the Parliament’s did not last the planed five year term. This has led to the Fixed Term Parliament’s Act coming under review.\n\nThe word ‘Parliament’ is used to refer to the time between two general elections.\n\nEach Parliament is made up of Sessions, which normally last about a year from November to October. A Session runs from the State Opening of Parliament (the Queen’s Speech) until prorogation or dissolution.\n\nAfter an election, the Monarch opens Parliament in the normal way through the State Opening of Parliament. Typically, the first Session after an election is normally longer than a year, running through to the October of the following year.\n\nElection Length\n\nThere are certain rules governing the timetable for elections themselves.\n\nA session of Parliament is prorogued on the day scheduled and dissolution normally follows on the same day, although it does not have to. It is normally accompanied by the proclamation calling a new Parliament. The election must normally then take place 17 days after this proclamation (not including weekends and public or bank holidays).\n\nElection campaigns – the time between dissolution and the election – normally last about three or four weeks.\n\nWhat is a by-election\n\nIf a Member of Parliament resigns or dies, then a by-election is held to elect a replacement in that constituency.\n\nThe date for the by-election is chosen by the Government but it is announced by the Speaker of House of Commons."}, {"url": "https://www.ucl.ac.uk/constitution-unit/explainers/what-does-house-lords-do", "page_content": "The House of Lords has three main functions: making laws, investigating public policy, and holding the government to account. The House of Lords is the less powerful partner in the Westminster parliamentary system: unlike the House of Commons, it cannot remove the government from office, and it can only delay, rather than veto, most bills.\n\nThe House of Lords once was more powerful than the House of Commons. Up to the passing of the Parliament Act 1911, the House of Lords held the power to veto bills passed by the Commons. The 1911 Act saw this power reduced to the delaying power the Lords has today— this was one of the most radical reforms to the House of Lords in its history.\n\nMembers of the House of Lords spend a lot of their time considering draft government bills before they become law. However, any proposed amendments to legislation must also be agreed by the Commons. Its primary function is therefore as a ‘revising’ chamber, asking the Commons to reconsider its plans.\n\nThrough the work of parliamentary select committees, peers investigate public policy covering a wide range of public policy, from justice and home affairs, to the long-term sustainability of the NHS. Committees produce reports which can often directly or indirectly influence the formulation of government policy.\n\nHolding the government to account is another function of the Lords. During question time and debates in the chamber members put questions to government ministers who must respond.\n\nIt is very rare for peers to try to overrule legislation passed by the House of Commons as a whole. Under the Salisbury Convention the House of Lords does not try to block bills that were promised in the governing party’s manifesto, and rarely blocks any bill in its entirety. In general, the unelected House of Lords defers to the Commons’ democratic mandate, but makes proposals for MPs to think again.\n\nAs it does not hold a majority, the government is defeated in the House of Lords quite often, generally on amendments to bills. Constitution Unit research shows that in recent years just under half of defeats have gone on to be accepted by the House of Commons, leaving a lasting impact on policy. A high-profile example under the Labour government occurred in 2006, when the House of Lords repeatedly voted against compulsory ID cards. The government chose to delay the implementation of ID cards until after the 2010 election. That election resulted in a Conservative-Liberal Democrat coalition government, which went on to scrap ID cards. This episode was highly adversarial, but more commonly members of the Lords propose changes which the government accepts, in order to improve the substance of legislation.\n\nThe House of Lords is equipped to perform this ‘revising’ role due to the wide range of expertise and experiences of its members, and its independence of thought—a large proportion of its members have no political affiliation. Some members are former politicians, while others are expert in business, education, science, and other public policy areas. Of the around 800 members, most have been appointed as 'life peers' by the Queen on advice of consecutive Prime Minsters; the rest comprise 92 hereditary peers and 26 Church of England Archbishops and Bishops.\n\nMany call for reform of the Lords, primarily due to it not being elected by popular vote. There are many options for reform but history demonstrates how tricky reform is. It is widely argued that one of the most urgent reforms needed is to contain the ballooning size of the Lords by restricting the Prime Minister’s power to appoint new peers.\n\nRelated explainers:\n\nWhat are constitutional conventions?\n\nFurther reading:"}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/house-of-commons", "page_content": "The House of Commons of Parliament Building, Ottawa. Photo taken on: August 23rd, 2011 (© Wangkun Jia | Dreamstime)\n\nRole of the House of Commons\n\nThe House of Commons is the elected lower house of Parliament. It consists of a Speaker (traditionally chosen from the party in power but now elected from the House by secret ballot), the prime minister and his or her Cabinet, members of the governing party, members of the opposition parties and the Official Opposition's shadow government, and backbenchers. There are sometimes a few independent members. The 338 members of the House (called Members of Parliament, or MPs) are elected in single-member constituency elections or by-elections.\n\nUnder the Constitution Act 1867, the Queen and the Governor General and the Queen's ministers and other public servants, not the House of Commons, govern Canada. Those ministers, however, are responsible to the House (see Responsible Government). The House, often incorrectly referred to as Parliament, is important constitutionally because no new statutes may be created except in response to bills that have been passed by the House. It is important politically because, unlike the Senate or upper house, it is an independent, elected body. Ministers are responsible to the House, not to the Senate.\n\nNon-financial bills may be introduced in the Senate as well as in the House, but under the Constitution Act, both taxation bills and appropriation bills must have passed the House before going to the Senate. Although private members may introduce taxation bills, under the Act (s54), only the Crown may initiate spending (supply) business.\n\nThe House’s constitutional function is to maintain a government for a reasonable time. To defeat one government after another in rapid succession would be anarchistic, a point which becomes highly relevant when no party wins a majority, as happened in six of the nine elections between 1957 and 1979, and again in the successive elections of 2004 and 2006. The political function of the House is to foster government acceptable to the people, and it has the power to insist that ministers account for their conduct and their bills and policies.\n\nQuestion Period and Accountability\n\nQuestions may be written down and placed on the Order Paper to receive a printed reply but during oral Question Period (45 minutes daily) ministers may be questioned directly (see Parliamentary Procedures). Usually, Opposition MPs ask the questions.\n\nThe House can bring down a government. Elections were held after the House defeated minority governments in 1963, 1974, 1979 and 2005. In recent years, the controversy over ministerial responsibility and the growth of executive power (sometimes referred to as \"Cabinet dictatorship\" or \"concentration of power in the hands of the Prime Minister's Office\") has generated considerable debate over the role, function and relevance of the House. The extent to which individual ministers should be held accountable for the actions of civil servants in their departments is also a subject of much debate in the highly partisan atmosphere that pervades the House of Commons.\n\nIn Canada, Parliament is expected to serve as an auditor of executive government, examining bills, policies and conduct. House Committees have become increasingly useful for these purposes. The role of the media in covering parliamentary debate and generating public opinion is of critical importance. The decision of the House to publish its debates in the form of a bilingual Hansard and, more recently, to allow continuous television coverage when the House is in session (on the publicly supported Cable Public Affairs Channel, or CPAC) were prompted in part by dissatisfaction with the news media.\n\nOpposition Parties\n\nIn order for a party to be recognized in the House, it must have 12 or more Members of Parliament. Such recognition entitles the party to committee assignments, research support and being called upon by the Speaker more frequently to ask questions of the government. Since 1974, election ballots have shown the candidates' party allegiances, if any, to voters. Members sometimes \"cross the floor\" to another party or leave their party, by choice, or after being removed from caucus by their leader, and will sit as independents. This does not happen often.\n\nThe Opposition is allotted up to twenty-five days in three supply periods to determine the subject of debate in the House. Supply periods occur when the government is seeking passage of spending bills (see Budgetary Process). The Opposition may also make motions to discuss an urgent, unexpected matter. The debate on the Speech from the Throne and the debate on the budget are general debates.\n\nParliamentary Privilege\n\nAt the beginning of each Parliament, the privileges of the House of Commons are confirmed by the governor general. This stems from the tradition at Westminster, where it was found that if the House was to participate effectively it had to have certain privileges and certain exemptions from ordinary law. For a long time, one of the foremost privileges at Westminster was that its members could not be imprisoned for debt. In Canada, members have the right to speak freely — without being liable to prosecution in the courts — in proceedings of the House and its committees. MPs cannot say anything they please; the House has a responsibility to control its members and to protect ordinary citizens from vilification.\n\nMPs may be accused of contempt and of misleading the House. In 1982, the Speaker considered a breach-of-privilege complaint against the minister of justice. The House may admonish or censure offenders and is empowered to imprison them for the balance of the session. Genuine questions of privilege and contempt are serious but very rare; however, many members use points of privilege, which take precedence over most other business, to get the floor merely to voice complaints or to make corrections.\n\nRole of the Speaker\n\nAll speeches in the House are addressed to the Speaker, although direct exchanges often break out in the heat of debate. Private members are referred to by the name of their constituencies (i.e., \"the Honourable Member for Peace River\") and ministers by office (i.e., \"the Honourable the Minister of Finance\"). The House does not permit members to use unparliamentary language because it fosters bitterness and reflects on the honour of the House but, in recent years, the Speaker has been under increasing pressure to keep things civilized. Some expressions deemed unparliamentary include \"sick animal,\" \"pompous ass,\" \"lies,\" \"Nazi\" and \"stinker.\" In 1971, A Conservative MP alleged that Prime Minister Pierre Trudeau told him to f--- off, but Trudeau famously denied swearing in the House, claiming he said “fuddle duddle.” And in 1985, Conservative MP John Crosbie caused an uproar after telling Liberal MP Sheila Copps, “Quiet down, baby.\"\n\nThe Speaker is the chief officer of the House and his election is the prime order of business when the House reassembles after a general election. The Speaker decides who has the floor, applies the rules of procedure, makes rulings, and manages the administration of the House and its employees. He must be impartial and does not participate in debates and will only vote when there is a tie. There have been unsuccessful attempts to make the position permanent — as it is at Westminster. The Deputy Speaker occupies the Speaker's chair if he is absent and chairs the committee of the whole. The Clerk of the House sits at a table in front of the Speaker, dressed in a black robe, and he and the other table officers supply the Speaker with advice and information.\n\nWhen the first parliaments were held at Westminster, the king sent a royal sergeant-at-arms, bearing a royal mace, to the House of Commons to show that the House was under the king's protection and was not to be threatened. In Ottawa, the sergeant-at-arms occupies a special chair in the centre aisle and he leads the procession when the Speaker enters the chamber or proceeds to the Senate chamber for speeches from the throne, royal assents and prorogations. The sergeant-at-arms carries the mace, a symbol of the authority of the House vested in the Speaker, and places it on the table when the Speaker takes his seat.\n\nThe Commons Chamber\n\nThe House of Commons meets in the Commons chamber at the west end of the Centre Block of the Parliament Buildings. The main doors of the chamber are at the south end — this is where the Gentleman Usher of the Black Rod raps when he comes to summon the Commons to the Senate chamber. There is a telescoping brass rail known as the Bar at the foot of the centre aisle of the chamber, just inside the main doors, which can be extended across the aisle. One of its original functions at Westminster was to keep strangers from mingling and perhaps voting with the members. Occasionally, strangers have been summoned to appear at the Bar of the House to be questioned or censured but otherwise the public and press do not go into the chamber and view proceedings instead from the galleries above.\n\nEvery member has an assigned seat in the chamber and must be in his place to speak and vote in the House. There are five rows of desks down each of the long sides of the room; these two banks of desks face each other across a wide centre aisle, with the Government on one side and the Opposition on the other. The Speaker's chair is at the north end of the centre aisle. This arrangement supposedly originated in the days when the English House met in St Stephen's Chapel, and it suits the adversarial nature of Canada’s responsible government system.\n\nThe prime minister occupies the 13th place in the front row on the west side, while the leader of the Opposition sits directly opposite. The other ministers are grouped in a block of seats around the prime minister. The leader of the Opposition also has key followers around him. Former ministers — styled \"the Honourable\" as members of the Privy Council, a title they retain for life — are given seats in the front rows, at either the north or south end. The leader of each party, through the Party Whip, fixes the party seating plan — invariably by class (year of first election) and alphabetically within classes.\n\nThe Commons convenes Monday through Friday and normally adjourns at 6:30 p.m, except for Fridays. Emergency debates, though, can run past midnight. In 1913, before there was a fixed time for adjournment, two different sittings extended throughout an entire week. A record was set in 1982, during the \"long-bell sitting,\" which began on 2 March and did not end until 17 March. The issue was the Opposition's concern with the Energy Security Bill proposed by the Trudeau government.\n\n© Library of Parliament.\n\nA Growing Chamber\n\nIn 2011, the House of Commons passed a bill to expand the chamber by 30 seats in time for the 2015 election. It was supported by the majority Conservative government — which introduced the bill to better represent the country’s fastest growing provinces — but opposed by the Liberals and New Democratic Party. The NDP was against giving Quebec more seats and the Liberals wanted to keep the same number of seats but reorganize the distribution more equitably. The change will expand the Commons to 338 seats, with Ontario getting 15 new MPs and BC and Alberta getting six more each. Québec will also get three more, although the province is already slightly overrepresented. It is expected to cost more than $34-million.\n\nDid you know? Enfranchised women in Canada first gained the right to stand for theHouse of Commons on 7 July 1919 (see Women’s Suffrage in Canada). In the 1921 general federal election, Agnes Campbell Macphail became the first woman elected to Parliament. She would remain the only female MP in the House of Commons until Martha Louise Black was elected in the 1935 federal general election.\n\nSummons and Prorogation\n\nSessions of Parliament begin with a summons and end with prorogation (suspension), both of which are issued by the governor general at the government’s request. Minority parliaments recently have lasted only one or two sessions. Between 1867 and 1938, the annual sessions lasted only a few months; now they normally run a full year, with three long adjournments. The main purpose of prorogation is to wipe clean the Order Paper of old or existing business, and to set a new legislative agenda. All business unfinished at the end of a session—unanswered questions and all orders relating to bills and motions — die on the Order Paper.\n\nProrogation has become a heated political issue in recent years. Controversy erupted in 2008 when Prime Minister Stephen Harper asked Governor General Michaëlle Jean to prorogue Parliament shortly before a confidence vote that could have defeated his minority Conservative government and replaced it with a coalition NDP-Liberal regime supported by the Bloc Québécois. Amid intense public and media scrutiny, Jean agreed to Harper's request, after consulting constitutional experts. The Conservative government survived.\n\nIn 2009 Harper again asked the governor general to prorogue Parliament for two months, arguing that his government needed to consult with Canadians and businesses as it dealt with economic issues. The move, however, was widely criticized as a tactic allowing the government time to gain a majority on Senate committees. It was also seen as a strategic move to avoid investigations into allegations that the government had ignored warnings about the torture of detainees in the Afghanistan war.\n\nThe 2009 episode led to a broader debate about whether or not governments were using prorogation as a political tool to further their own causes.\n\nCentre Block Renovation\n\nIn 2019, Parliament Hill’s Centre Block closed its doors for a major renovation that is expected to last at least a decade. The project to restore, upgrade and modernize the Centre Block includes the House of Commons and Senate chambers, as well as the Peace Tower, the Library of Parliament, and offices for MPs and party leaders. While the building will be closed to visitors during the construction, the Hill – including the Great Lawn - remains open and Parliament continues to function. MPs are operating out of a temporary House of Commons located in the West Block and the Senate is working out of temporary chambers in the Senate of Canada Building (formerly named the Government Conference Centre)."}, {"url": "https://www.bbc.com/news/uk-politics-49826655", "page_content": "The UK is gearing up to hold a general election on Thursday.\n\nThese national votes, to choose a government to run the country, are supposed to be held every five years.\n\nBut this would be the third since 2015.\n\nWhat is this election for?\n\nA total of 650 people will be chosen as members of Parliament (MPs), to decide laws and policies.\n\nSkip members of Parliament (MPs) Members of Parliament are elected by voters to represent the interests of their constituency in the House of Commons. Most belong to a political party, but some do stand as independents. There are 650 MPs in the House. End of members of Parliament (MPs)\n\nMPs are elected to the House of Commons, one of two chambers of Parliament in London, where the government is based.\n\nThe government passes laws that help it run the country. This compares with local governments which deal with issues such as bin collections and schools in each area.\n\nHow does voting work?\n\nIn a general election, the UK's 46 million voters are invited to choose an MP for their area - one of 650 constituencies.\n\nAnyone aged 18 or over can vote, as long as they are registered and a British citizen or qualifying citizen of the Commonwealth or Republic of Ireland.\n\nOlder people are more likely than younger ones to vote. At the 2017 general election, 59% of 20- to 24-year-olds voted, compared with 77% of 60- to 69-year-olds.\n\nHowever, about two-thirds of the more than 3.1 million people who registered to vote between the election being called and the registration deadline were under the age of 35, with more than a million of them under 25.\n\nVoting takes place at local polling stations, set up in places such as churches and school halls. Voters put a cross on the ballot paper beside the name of their chosen candidate and drop it into a sealed ballot box.\n\nWho can stand for Parliament?\n\nMost people over 18 on polling day can stand as a candidate - as long as they are a British citizen or a qualifying Commonwealth or Republic of Ireland citizen resident in the UK.\n\nThey must also pay a £500 deposit, which will be lost if they do not get at least 5% of the votes in their constituency.\n\nCandidates must meet certain conditions - prisoners, civil servants, judges and members of the police and armed forces cannot stand.\n\nA total of 3,322 candidates are standing across the 650 seats this year.\n\nThere are 91 Davids standing for election - the most popular name among the candidates - while the first female name on the list is Sarah in 18th place. There are 22 candidates with that first name standing.\n\nHow are the winners chosen?\n\nThe candidate with the most votes in each constituency is elected, even if they are chosen by less than half the electorate in their seat.\n\nMost MPs represent a political party but some stand for election as independent candidates.\n\nAny party with more than half the MPs (326) in the Commons usually forms the government. Parties with well below 50% of the national vote can take power as a result of the UK's voting system.\n\nSkip UK's voting system The UK uses a first past the post voting system. It means a local candidate who receives the most votes wins – and the party with the most winning candidates forms a government. So the overall number of votes parties get nationally does not have any bearing on who wins the election. End of UK's voting system\n\nIf no party has a majority of MPs, the one with the most can form a coalition - or partnership - with one or more other parties to gain control.\n\nThe prime minister is not directly voted for by the public. He or she is chosen by the winning party's MPs and appointed by the Queen, who is duty bound to follow their advice.\n\nSkip the Queen The Queen is the UK’s head of state, although she is not in charge of the government. Elizabeth II is the country’s longest-serving monarch, having ascended to the throne in 1952. She performs state duties, which include formally opening Parliament, representing the country at events such as the annual Remembrance Day parade, and making official visits overseas. She is also head of the armed forces and Church of England. End of the Queen\n\nWhat are the big issues at this election?\n\nDetailed proposals for everything from the economy to defence and policing are set out before any general election in manifestos.\n\nSkip manifestos A manifesto is basically a brochure containing all of a party's ideas and policies. Manifestos are usually published during the general election campaign. If a party wins the election, it is often judged by how many of its manifesto promises it manages to deliver as a government. End of manifestos\n\nThese come from the UK's political parties - groups of people with similar political beliefs who come together to try to win power.\n\nThe issues UK voters care most about have changed a lot, according to the polls.\n\nThe National Health Service (NHS) and immigration were the things that most concerned voters in 2015.\n\nSkip National Health Service (NHS) The National Health Service (NHS), which started in 1948, is the government-funded national healthcare service that provides free diagnosis and treatment for UK citizens. End of National Health Service (NHS)\n\nThe European Union (EU) was of far less interest.\n\nSkip European Union (EU) European Union: the political and economic union of 28 member states, which the UK is planning to leave. End of European Union (EU)\n\nNow, however, Brexit - the UK's departure from the EU - is a huge issue.\n\nSkip Brexit Short for British exit - refers to the UK leaving the European Union. End of Brexit\n\nWhat happened at the last election, in 2017?\n\nNeither the Conservative or Labour parties had enough votes to form a majority government after the 2017 election.\n\nSkip Labour The Labour Party was founded by the trade union movement in 1900 to give workers a voice in Parliament. It believes in the redistribution of wealth and opportunity, greater rights for working people and strong, state-run public services. End of Labour\n\nThe Conservatives were the bigger of the two parties and formed a partnership with the Democratic Unionist Party DUP in order to win votes in the Commons.\n\nSkip DUP The Democratic Unionist Party was founded in 1971, during the time of conflict in Northern Ireland, known as the Troubles. As unionists, the DUP support Northern Ireland being part of the UK and are known for their socially conservative beliefs on abortion and same-sex marriage. After the 2017 election, DUP MPs helped keep the Conservatives in power by agreeing to support them in Commons votes. End of DUP\n\nSince the election, the Conservatives and Labour have both lost MPs, while the Liberal Democrats have made gains.\n\nSkip Liberal Democrats Often called the Lib Dems, the Liberal Democrats were formed in 1988 by the merger of one of Britain's oldest political institutions, the Liberal Party, which stood for free trade and individual liberty, and the Social Democratic Party, a centrist offshoot of the Labour Party. The party likes to see itself as being on the centre ground of British politics. End of Liberal Democrats\n\nParliament's second chamber is the House of Lords.\n\nSkip House of Lords The House of Lords is the second chamber of the UK Parliament. It is independent from the House of Commons but shares with it the role of making laws, while it also checks the government’s work. Members are given a title, such as Lord, are not elected, do not represent constituencies and most do not belong to any party. End of House of Lords\n\nIts members are not elected but are appointed by the Queen, on the prime minister's advice.\n\nWhen do we find out the result?\n\nOn general election day, voting takes place between 07:00 and 22:00. The results are declared through the night and the following day.\n\nWhen the overall result is known, the leader of the winning party, if there is one, visits Buckingham Palace to ask the Queen for permission to form a new government.\n\nOnce they have that, which is a formality, they return to the traditional home of the prime minister 10 Downing Street.\n\nSkip 10 Downing Street This terraced house is the official residence and office of the UK prime minister. End of 10 Downing Street\n\nOften they will stand outside to deliver a speech about their party's plans for the coming years."}], "Paul Elliott succeeded the Labour MP Chris Mullin.": [{"url": "https://www.ft.com/content/5282ff46-7e8d-11e6-8e50-8ec15fb462f4", "page_content": "What is included in my trial?\n\nDuring your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages.\n\nStandard Digital includes access to a wealth of global news, analysis and expert opinion. Premium Digital includes access to our premier business column, Lex, as well as 15 curated newsletters covering key business themes with original, in-depth reporting. For a full comparison of Standard and Premium Digital, click here.\n\nChange the plan you will roll onto at any time during your trial by visiting the “Settings & Account” section.\n\nWhat happens at the end of my trial?\n\nIf you do nothing, you will be auto-enrolled in our premium digital monthly subscription plan and retain complete access for S$95 per month.\n\nFor cost savings, you can change your plan at any time online in the “Settings & Account” section. If you’d like to retain your premium access and save 20%, you can opt to pay annually at the end of the trial.\n\nYou may also opt to downgrade to Standard Digital, a robust journalistic offering that fulfils many user’s needs. Compare Standard and Premium Digital here.\n\nAny changes made can be done at any time and will become effective at the end of the trial period, allowing you to retain full access for 4 weeks, even if you downgrade or cancel."}, {"url": "https://www.theguardian.com/politics/2006/mar/07/past.comment", "page_content": "A Very British Coup was conceived in the first week of October 1980. I was on a train returning from the Labour party conference at Blackpool with Stuart Holland, the newly elected MP for Lambeth Vauxhall, and Tony Banks and Peter Hain, both of whom subsequently became MPs. We were discussing how the establishment would react to the election of a leftwing Labour government.\n\nIn those far-off days the proposition was not as fanciful as it now seems. Mrs Thatcher was in office, but had yet to consolidate her grip on power. Labour was high in the opinion polls. There was a real possibility that, come the election, the Labour party would be led by Tony Benn. The rightwing press was working itself into a frenzy at the prospect. \"No longer if, but when,\" screamed a Daily Mail headline over a full-page picture of Mr Benn. To cap it all, the news that the US was planning to install cruise missiles in its British bases had given the Campaign for Nuclear Disarmament a new lease of life. \"A good subject for a novel,\" said one of my companions.\n\nBy the time A Very British Coup was published, in 1982, the political climate was even more propitious. Prompted by the imminent arrival of cruise missiles, CND demonstrations were attracting crowds in excess of 200,000. The establishment was getting so twitchy that, as we later learned, Michael Heseltine had set up a special unit in the Ministry of Defence to counter the impact of CND.\n\nThe US was getting twitchy too. When A Very British Coup was published I was editor of the political weekly Tribune, and we were selling the book by mail order through the paper. A few days after the first advert appeared we were intrigued to receive an order from the US embassy. We duly dispatched a copy and waited to see what would happen next. We did not have to wait long. An invitation arrived to lunch with the minister, the most important man at the embassy after the ambassador. He even sent his bullet-proof Cadillac to Tribune's modest headquarters in Gray's Inn Road to convey me to his mansion in Kensington.\n\nAt first I assumed that I was one of a number of guests, but no: there was just the minister, two of his colleagues, an Asian butler and myself.\n\n\"Why are you interested in a minnow like me?\" I inquired.\n\n\"I reckon,\" he drawled, \"that you are among the top 1,000 opinion formers in the country.\"\n\n\"Well, I must be about number 999.\"\n\n\"The other 999 have been here too.\"\n\nA year or two later I received from an anonymous source an envelope posted in Brussels. It contained an internal US state department memorandum addressed to US diplomats in London listing a number of questions they were to put to \"authorised contacts\" in London regarding the balance of power within the Labour party and opinion regarding the US bases in general and the impending arrival of cruise missiles in particular. Although, in retrospect, we can see they had no cause for concern, there is no doubt that alarm bells were ringing in Washington.\n\nA Very British Coup attracted attention elsewhere too. It was helpfully denounced in the correspondence columns of the Times, and as a result sales in Hatchards of Piccadilly almost matched those at the leftwing bookshop Collets. (When it comes to selling books, a high-profile denunciation is worth half a dozen friendly reviews and I have always done my best to organise one).\n\nThereafter interest might have faded, but for events conspiring to make it topical. In August 1985 the Observer revealed that an MI5 officer, Brigadier Ronnie Stoneham, was to be found in room 105 at Broadcasting House. His job? Stamping upturned Christmas trees on the personnel files of BBC employees he deemed to be unsuitable for promotion. Students of A Very British Coup will know that my head of MI5, Sir Peregrine Craddock, was also vetting BBC employees. What's more, he also had a spy on the general council of CND - and in due course the MI5 defector Cathy Massiter revealed that there had indeed been such a spy. His name was Harry Newton.\n\nFinally, in 1987 Peter Wright, a retired MI5 officer, caused a sensationwith his claim that he and a group of MI5 colleagues had plotted to undermine the Wilson government. Suddenly the possibility that the British establishment might conspire with its friends across the Atlantic to destabilise the elected government could no longer be dismissed as leftwing paranoia.\n\nThe rest, as they say, is history. In due course the novel was translated into a brilliant television series. Harry Perkins, my prime minister, was brought to life by the wonderful actor Ray McAnally, who tragically died not long afterwards. The TV series was shown in more than 30 countries and showered with Bafta and Emmy awards. It was a particularly big hit in the US.\n\nCould it happen today? No, I am afraid not. The political landscape has changed beyond recognition. Cruise missiles are long gone. MI5 has been cleared of dead wood such as Peter Wright and his friends. A Labour government is in power - and on excellent terms with Washington.\n\n· Chris Mullin is a former Foreign Office minister. A Very British Coup is republished by Politicos at £7.99\n\nmullinc@parliament.uk"}, {"url": "https://socialistworker.co.uk/features/a-view-from-the-foothills-the-diaries-of-chris-mullin/", "page_content": "A View From The Foothills: The Diaries of Chris Mullin\n\nThis article is over 13 years, 9 months old\n\nIf A socialist prime minister was ever elected the establishment would do everything it could to prevent any real change. That was the sensible premise of A Very British Coup, the novel by Sunderland Labour MP Chris Mullin.\n\nBy Simon Basketter\n\n\n\n\n\n\n\nDownloading PDF. Please wait...\n\nCover of A View From The Foothills\n\nIf A socialist prime minister was ever elected the establishment would do everything it could to prevent any real change. That was the sensible premise of A Very British Coup, the novel by Sunderland Labour MP Chris Mullin.\n\nIt reflected what much of the left in the Labour Party thought about the world in the 1980s. They were pro-peace, pro-ordinary people and suspicious of the security services and the press.\n\nBut it also contained the conviction that things had to be done for, not by ordinary people.\n\nThe novel ends with the prime minister resigning after a set up tabloid scandal. As it turned out, no such “coup” was ever needed. The left’s desire to “make a difference” by being in power meant that eventually they went along with, and indeed promoted, the things they previously despised.\n\nAnd “making a difference” – or, more precisely, failing to but telling yourself that the latest shoddy comprise is OK – is the central thread of Chris Mullin’s recently published diaries, A View from the Foothills.\n\nMullin once wrote a guide on how to deselect your MP. Now he has written a lengthy book showing why you would want to.\n\nHe is by no means the worst of them and the diaries are informative and funny.\n\nThe usual gossip is there and much of it is entertaining. For instance, the Queen Mother leaning over to Neil Kinnock at a state banquet, saying, “May I say something in absolute confidence?” and whispering, “Don’t trust the Germans.”\n\nBut the politics are infuriating. Mullin’s half-hearted worries, but non-rebellion, over the anti-terror laws are simply saddening to read – particularly from the author of An Error Of Judgement, a book that was central to the release of the Birmingham Six, jailed for 15 years after being wrongly convicted for an IRA bombing.\n\nCold\n\nAs a former editor of the Labour magazine Tribune, when what it said still mattered, and a member of the Socialist Campaign Group, he is left cold by “New Labour claptrap about strategies, visions, challenges and opportunities”.\n\nForced to attend an event called “Listening to Old People,” he writes it off as “a classic New Labour wheeze designed to create the illusion of consultation,” and sits “quietly at the back, praying no one would spot me”.\n\nBlair is annoyingly referred to throughout as “The Man”, occasionally as “Our Great Leader”. Mullin both admires and sees through him.\n\nWhen Mullin is out of favour, he wants to be in, and when he is in, he wants to be out. He becomes what he calls “under-secretary for folding deckchairs” in John Prescott’s department of the environment.\n\nWith a predictable turn, the civil servants are unhelpful and the MPs behave as if they are in a public school dormitory – which is, of course, where most of them, including Mullin, were educated.\n\nHe recalls his job as involving little more than having to laugh at John Prescott’s jokes – but in fact Mullin was responsible for privatising air traffic control.\n\nBlair later makes him Africa minister. Mullin says he realised, “that there are many good men in Africa. It is a question of giving them a helping hand.” Bless.\n\nDespite his irritation with New Labour, much of his diary is in reality New Labour guff. “There are so many good things happening in Sunderland,” he writes. “A new shopping complex. A state of the art bus station. The metro on its way.”\n\nUnfortunately, many of his constituents don’t seem to appreciate just how much “better” things are under Labour.\n\nHis surgeries provide him with misery as the damaged and the distraught come to him for help.\n\nHe is upset for the worthy asylum seeker he can do absolutely nothing to help, while at the same time backing more draconian attacks on immigrants.\n\nMullin is saddened that factories are closing in Sunderland but can do nothing to save them. And he hates the firefighters’ strike with vitriol because they might encourage others to make demands on the government.\n\nTo his credit he was an opponent of the war in Iraq – just – and he did vote against it.\n\nBut the moral equivalence and the wringing of hands are painful. Describing Blair’s defence of the invasion, he writes, “The Man’s performance was flawless. He made his case calmly and without exaggeration. He met every argument head on and treated his critics with respect.”\n\nAdding, “I want The Man to be right. In the end that would be best for all of us.”\n\nHis belief that only with influence can something be done – but that next to nothing can actually be done – is not a matter for rage but for a resigned smugness.\n\nThere is one exception. Mullin takes leylandii – a type of fast growing hedge that he wants banned – very seriously.\n\nBy the end of the book I’d become in favour of planting leylandii in every garden in the land.\n\nMullin ultimately achieved his victory with the imposition of height restrictions on the hedges as a successful amendment to the anti-social behaviour bill.\n\nAh, so he did make a difference after all.\n\nA View From The Foothills\n\nby Chris Mullin\n\nProfile Books, £20\n\nGo to Bookmarks, the socialist bookshop » www.bookmarksbookshop.co.uk"}, {"url": "https://www.theguardian.com/politics/2009/mar/13/chris-mullin-quotes", "page_content": "On becoming a junior minister in the environment department: \"It is something of a humiliation. I have done what I always said I would never do, traded the little niche I had built for myself on the backbenches for the Department of Folding Deckchairs.\"\n\nOn John Prescott: \"A pleasant chat with Hilary Armstrong [Labour chief whip], who confirmed everything I already knew about the JP regime. She says John is hopelessly insecure, ever afraid of being shown up by one of his underlings, constantly interfering in matters best left to junior ministers … [He] has no concept of how to get the best out of people. His idea of conferring is to lie slumped in an armchair and deliver, at breakneck speed, a series of diatribes on whatever has hit him on the way into work in the morning.\"\n\nOn the 1999 party conference in Bournemouth: \"This year's conference symbol, a rising sun. Increasingly the proceedings come to resemble those that take place in Beijing's Great Hall of the People.\"\n\nOn New Labour-speak: Keith Hill [a fellow under-secretary at the environment department] and I amused ourselves over lunch compiling a New Labour lexicon … pathfinders, beacons, win-win, stakeholders, opportunities as well as challenges, joined-up government, partnership, best value. And, of course, 'new' as in New Partnership Company.\"\n\nOn Tony Blair, at a pep talk to the parliamentary Labour party in October 2000: \"We are no longer in awe of him as we used to be. The magic is fading. There are times when I think that he has become just another inadequate politician like the rest of us. Yet it was an impressive performance. With beautiful clarity he set out the dividing line between us and the Tories, on the economy, public services and Europe. By the end, one was left realising that there is still on one else to match him.\"\n\nOn Bush becoming president: \"George W Bush, an intellectually and morally deficient serial killer (he has spent years as governor of Texas signing death warrants), is to be the next US president. Just what the human race needs.\"\n\nOn the fall of Mandelson in January 2001: \"Derek Draper, once a friend of Peter's put his finger on the problem … 'Peter goes gaga in the presence of rich people.' Not only Peter's problem. New Labour's, too.\"\n\nOn the ego of Mandelson: \"Why can't Peter keep his trap shut? He can't bear not being the centre of attention. The only reason anybody listens to him is because they assume he is speaking for The Man [Mullin's pet name for Tony Blair], which these days at least [May 2003], is not very likely.\"\n\nOn the Millennium Dome: \"This wretched dome has become an albatross. A symbol of all that is wrong with New Labour: shallow, over-hyped, naff.\"\n\nOn Gordon Brown's office [when chancellor]: \"His private secretary seemed reluctant when I asked for a peep and I soon realised why: it's a complete tip. Paper everywhere. Stacked on seats, tables, the floor, everywhere. And in the inner sanctum, against the wall, three huge piles – two about four feet high and the other five feet. Gordon's filing system.\"\n\nOn Shaun Woodward's defection from the Tories: \"Shaun Woodward has been selected in St Helens. Hearing him on the radio this morning promising to be a champion of the poor and downtrodden made my flesh creep. This is one of New Labour's vilest stitch-ups.\"\n\nOn the House of Commons: \"The place is like a morgue. Odd, we fight so hard to get here and yet so many of us seem so reluctant to remain on the premises for a moment longer than we are obliged. The more we vote ourselves extra facilities, the less use we make of them.\"\n\nOn Yvette Cooper [now chief secretary to the Treasury]: \"Yvette is bright and pleasant, but a swot rather than a natural talent. Lacks the magic to reach the top, but she will get close.\"\n\nOn Keith Vaz's promotion to minister for Europe in 1999: \"The most inexplicable appointment is Keith Vaz … [He] is an utter lightweight. How on earth does he fit into the New Labour masterplan?\"\n\nOn the death of the Queen Mother: \"Parliament is to be recalled next week, which is a bit daft. What is there to say? … Joan Maynard [a former Labour MP] and I once encountered her at Fountains Abbey [a ruined Cistercian monastery and world heritage site in North Yorkshire]. Not wishing to tug our forelocks, but not wanting to seem churlish either, we hid behind a clump of shrubs until she had passed.\"\n\nOn the reaction to Robin Cook's resignation speech: \"The ovation continued for several minutes while the speaker called impotently for order … I was seated directly in front of Robin and, tempting though it was, I did not join in. On impulse, however, I turned and shook his hand; he grasped mine warmly, looking as though he were about to burst into tears.\"\n\nOn the decision to go to war in Iraq: \"The Man has taken a reckless, foolish gamble. He's bet the whole shop, not just his future, but that of the Labour party and everything we have achieved in government, on a single throw of the dice.\""}, {"url": "https://www.irishtimes.com/news/ireland/irish-news/corbyn-not-electable-as-prime-minister-says-mullin-1.2305800", "page_content": "Former Labour MP Chris Mullin saidJeremy Corbyn, who is currently leading the contest, is a close friend of his but he very much doubted that he would be able to lead Labour back into power if he is chosen at the party’s leader. Photograph: Justin Tallis/AFP/Getty\n\nNone of the candidates contesting the leadership of the British Labour Party is electable as prime minister and the party may be facing into a long period of opposition, former Labour MP Chris Mullin told a meeting in Cork at the weekend.\n\nMr Mullin said that veteran left-winger, Jeremy Corbyn, who is currently leading the contest, is a close friend of his but he very much doubted that he would be able to lead Labour back into power if he is chosen at the party's leader in the four week long poll due to start on August 14th.\n\n“Jeremy is a lovely fellow and a true socialist - if you get on a train with him, as I have done once or twice, he immediately gets out his vegetarian sandwich and cuts it in half and gives you half and I like him very much but, be under no illusion, he is not electable as prime minister,” he said.\n\nMr Mullin said that he didn't believe any of the other three candidates, Andy Burnham, Yvette Cooper and Liz Kendall offered Labour any better chance of wresting power from the Conservatives in the next general election.\n\nREAD MORE\n\n“Looking at the other three candidates, I’m not entirely convinced any of them are electable either so part of me is inclined to say ‘Go for it then (and vote for Mr Corbyn) - if we are going to spend a period in the wilderness, we might as well feel good about ourselves’ .”\n\nSpeaking at The Spirit of Mother Jones Festival in Cork where he gave a lecture on his close friend, the late Tony Benn, Mr Mullin said that he believed that Mr Corbyn was the closest of the four candidates to Mr Benn in terms of his political philosophy and his vision for Britain.\n\n\"Over the years, Labour has had a number of lost leaders and Tony Benn was certainly one and John Smith was another - they were very different people in that John Smith was a conservative with a small 'c' but he would have been a very successful leader who would have led Labour into power.\"\n\n“ I think Tony Benn would have supported Jeremy because they were very good friends for a very long time - he would have probably come down on the side (of Mr Corbyn) and say ‘Go with it’ and a little part of me says the same,” Mr Mullin said, who led the campaign for the release of the Birmingham Six.\n\n“Even if there was one of the other three candidates that I thought was capable of winning, even if they didn’t reflect my views necessarily, then I would go for them but I am not convinced and I fear we may be in for a long period of opposition which is not something I relish.”\n\nMr Mullin said one of the particular challenges facing Mr Corbyn if he is elected Labour leader when the ballot is announced on September 12th, is that he will not enjoy the support of a majority of the Parliamentary Labour Party and that will be a problem for him.\n\n“He’s got more support in the unions and he’s got more support amongst members but among MPs, he would have a relatively small following so he will have to find a way of reaching out to at least a majority of the Parliamentary Labour Party if he is elected leader.”\n\nMr Mullin said that whoever is elected leader of the party next month, they will face a major challenge in trying to make the party a serious contender for office given the very different trends emergent in different parts of the UK in this year’s general election.\n\n\"Labour is in a difficult spot because it's not left wing enough for Scotland and it's too left wing for the south of England where ,outside of the poorer parts of London, it has very few seats- it's between a rock and a hard place and I don't know how the new leadership is going to strike that balance.\n\n“I don’t think Labour lost this year’s general election because it was too left-wing - it lost because it lost Scotland to the Scottish Nationalists so it has to try and win back those seats while at the same time somehow win back middle class voters in the south and east of England.”\n\nends"}, {"url": "https://www.vice.com/en/article/4wm7ed/chris-mullin-ex-mp-voted-against-iraq-this-is-why-hed-vote-no-on-syria", "page_content": "Chris Mullin was the Labour MP for Sunderland South from 1987 to 2010. He was one of the 139 Labour MPs to vote against the invasion of Iraq. Here, he writes the speech he would deliver, were he still in parliament today.\n\n\"Mr Speaker, in the absence of any credible plan to retake the territory controlled by Isil, I am against taking part in the bombing of Syria. I am not a pacifist. I could be persuaded, but I have not been persuaded. I accept that the United Kingdom must play a part in helping to defeat Isil. There are many things we can do, short of bombing. I am not against the use of airpower in support of a just cause. I would have supported the use of airpower in support of any credible ground force. It was right last year to use of airpower to assist the defenders Kobani, on the Turkish border. It was right to use airpower recently in support of the Kurds fighting to recapture Sinjar. It makes makes sense, too, to isolate the Isil strongholds in Raqqa and Mosul and to cut them off from each other.\n\nAdvertisement\n\nThere are already quite enough people dropping bombs on Syria.\n\nBut there are already quite enough people dropping bombs on Syria and, in the absence of a plan, I remain to be convinced that more are needed. Listening to the prime minister and his colleagues in recently, one has the impression that their main motivation is that they can't bear to be left out. Or that bombing has become a substitute for more effective intervention.\n\nNor should we forget that there are a large number of civilians trapped in the Isil strongholds. At least 200,000 in Raqqa alone. Inevitably, there will be many casualties. Indeed, I would be surprised if the number of civilian dead from allied bombing has not already exceeded the number of victims of the recent atrocity in Paris. It is just that we don't see them and their families on our television screens at night. Indeed, to judge by some of the images on the news bulletins of late, one could be forgiven for thinking that bombing is some kind of video game. The point about bombing is that it looks utterly different from the ground looking up than it does from the sky looking down.\n\nSurely we have learned by now from our experience in Iraq, Afghanistan and Libya that, when you take the lid off one of these regimes you unleash the fires of hell.\n\nThere has been a lot of talk about precision bombing in recent days. I don't believe a word of it. Casualties of NATO's precision bombing of Belgrade during the last Balkan war included a train packed with civilians, the Chinese consulate, a radio station and, in Kosovo, a convoy of Albanian refugees. And when the Serbian regime finally capitulated and withdrew its tanks and armour from Kosovo it became clear that far fewer had been put out of action than had been claimed.\n\nAdvertisement\n\nThe Americans in particular have a shocking record when it comes to inflicting civilian casualties. Why, as recently as October, they bombed a Medicine Sans Frontieres hospital in Kunduz, northern Afghanistan killing at least 30 medical staff and patients. The Kunduz incident was only remarkable in that they owned up immediately; usually they obfuscate. In the first Iraq war they fired two laser guided bombs into the Amiriyah air raid shelter in a suburb of Baghdad, killing more than 400 people. In Afghanistan and Iraq they have bombed hospitals, schools and even wedding parties. Don't talk to me about precision bombing.\n\nOne final point, Mr Speaker. Ministers have repeatedly made the point that the removal of President Assad remains our objective. Were that to happen, I have no doubt that the result would be the disintegration of the few parts of Syria where there is still some sort of functioning government. We should be careful what we wish for. Surely we have learned by now from our experience in Iraq, Afghanistan and Libya that, when you take the lid off one of these regimes you unleash the fires of hell.\""}, {"url": "https://www.thetimes.co.uk/article/chris-mullin-how-i-transformed-my-walled-garden-62qp5m3rn", "page_content": "At last I’ve done it. After years of daydreaming, doodling and many disappointments, I have finally achieved that ambition of a lifetime and acquired a small walled garden in a remote part of Northumberland, where I intend to fade away growing vegetables and thinking great thoughts.\n\nAfter 40 years of inner-city living, in postal codes with some of the highest insurance costs in the country, I reckon I have served my time. In Brixton, two sets of riots passed my door, and in Sunderland — I was Labour MP for Sunderland South until 2010 — we lived happily for 27 years, but no day went by without the wailing of police, fire or ambulance sirens.\n\nSponsored\n\nNow I live in a place where the main threat"}, {"url": "https://www.theguardian.com/books/2011/nov/25/walk-on-part-chris-mullin-review", "page_content": "Who says that politics and politicians have become boring? The late Alan Clark's diaries were turned into TV drama; now, from the Labour side, Chris Mullin's have been adapted for the theatre, with the production currently running in London. They were not an obvious choice.\n\nClark's rampant lechery, his malice towards many supposed political allies, and his devil-may-care flamboyance (he once delivered a frontbench statement while palpably drunk) made his diaries compulsive reading. Mullin, though his diaries are consistently witty and include some very funny stories, is earnest, conscientious and (except towards Peter Mandelson) kindly. He would never write of anyone, as Clark did of Tom King, a senior Tory minister, that \"his balls are very weak\". Nor would he agree with Henry \"Chips\" Channon, a backbench Tory diarist of the 1930s and 40s, that \"the weaknesses of one's friends are more amusing to chronicle than their dignified conduct\". Where Clark punctuates his diaries with tales of seduction, Mullin records his struggles on behalf of asylum-seekers, his compassion for starving Africans, and his progress in extirpating masonic secrecy and MPs' September holidays. But Mullin, as much as Clark, deserves his place in the front rank of political diarists.\n\nThe best of these diarists, while they have a degree of access to the inner circles of power, are nevertheless detached. The diaries of Jock Colville, private secretary to Churchill during the second world war and the 1951-55 administration, are of immense value to historians and absorbing to political obsessives. But the diaries of Charles Moran, Churchill's doctor, provide far more illumination about the great man's opinions of ministerial colleagues. Other great 20th-century diarists such as Channon and Harold Nicolson tell us as much about English high society in the 30s and 40s as they do about Whitehall and Westminster.\n\nNicolson and Clark, it seems, were Mullin's models. Like them, he only briefly reached the lower echelons of government as, in his own self-deprecating description, \"minister for folding deckchairs\". Like them, he is a precise observer and attentive listener who records gestures, postures, tones of voice and turns of phrase (he notes that in his early years of office, Tony Blair was a serial name-dropper, reeling off the monarchs and presidents he had lately met). Like them, his maverick qualities often make his comments surprising. Though firmly on the Labour left, he repeatedly expresses exasperation with \"the benefit culture\" that seduces many of his Sunderland constituents. Indeed, for all his reputation as a man of the people, Mullin delivers harsher verdicts on the greed, idleness and ingratitude of visitors to his weekly surgeries than he does on political colleagues.\n\nMullin covers the entire New Labour era, from Blair's accession in 1994 to the regime's downfall in 2010. The latest volume – as often happens with political diaries and memoirs, they were not published in chronological order – covers the period up to the beginning of Mullin's \"four undistinguished years in government\" (his words) in July 1999. Paradoxically, Mullin's influence was probably at its greatest before he entered office. After the vindication of his long campaign to free the Birmingham Six, he is Labour's most admired backbencher, \"a sane leftwinger\" (the Financial Times's description) who, while sceptical of New Labour and its modish jargon, is prepared to give the leadership the benefit of the doubt. He is chosen to second the 1997 Queen's Speech, an honour which he hears about just in time to put on \"my one and only suit\" before he leaves home. Later, he secures the chairmanship of the Home Affairs select committee, which, he tells Blair, he prefers to a junior ministerial position. He tops elections for the parliamentary committee, and wins the Channel 4 award for Commons Questioner of the Year.\n\nYet he is eventually drawn to power in the more conventional sense. Resolved to accept nothing less than minister of state, he settles for the lowest rung, parliamentary under-secretary, only to discover, as the Observer's Andrew Rawnsley put it, that he \"has been buried as effectively as if he had been fitted with concrete overshoes and dropped into the Thames\". His job consists almost entirely of pointless activity and just about his only tangible achievement (at the environment department) is to impose a 10mph speed limit on Lake Windermere. The saddest part of the diaries recounts how, during an interval when he returns to the backbenches, still hoping for something better at ministerial level, he wonders how, in divisions on the Iraq war, he can find \"a loophole through which I can crawl, principles and job prospects intact\". In the end, he rebels on one vote, but troops \"pathetically into the government lobby\" on another. His modest prize is to become under-secretary of state for Africa, the only job that makes him at all happy.\n\nWhen Mullin, after much characteristic dithering, decides to step down as an MP at the 2010 election, he does so out of frustration and boredom. That is the unique value of these diaries: they show, ruefully and entertainingly, the sheer tedium that faces many MPs and junior ministers. Mullin, honest and self-aware, cannot disguise his own unimportance. The other diarists move effortlessly in elite circles: Channon in particular is forever attending London balls and the country-house parties where the big decisions were taken. Beyond politics, they enjoy a hinterland of business, writing and leisure interests. Mullin is too conscientious to deploy his undoubted talents extensively outside parliament. He may dote on his wife and children but he does not, like Clark, collect vintage cars or, like Nicolson, preside over castle gardens.\n\nAfter reading Mullin, one sees why most politicians will do almost anything to attain and hold on to high office. Mullin himself is not much attracted, as a select committee chairman, by overseas junkets; and, as a minister, he eschews the trappings of power, declining a chauffeured car because, he explains, a bus to Westminster passes the front door of his south London home. But he shows, all the same, why so many MPs are tempted, in the graphic phrase, to sink their snouts in the trough."}, {"url": "https://www.independent.co.uk/life-style/royal-family/meghan-markle-marriage-prince-harry-chris-mullin-mp-b2337547.html", "page_content": "Stay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Stay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nLifestyle Edit email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nMeghan Markle is a “cuckoo” in the royal nest and her “woke Californian hang-ups” are likely to destroy her marriage to Prince Harry, according to a senior Labour politician.\n\nIn an outspoken attack on the couple, former Labour minister and diarist Chris Mullin suggests the Duke of Sussex will “come limping home” when the marriage “ends in tears.”\n\nHe says Meghan is “clearly the main mover” in the couple’s relationship with “Harry very much second fiddle”.\n\nThe claims are contained in Mullin’s latest memoir, Didn’t You Use To Be Chris Mullin?, which is being serialised exclusively in The Independent.\n\nThe novelist, diarist and former MP, 75, played a key role in freeing the Birmingham Six, Irish men wrongly convicted and sentenced to life imprisonment for the 1974 pub bombings.\n\nHis new book, released this week, is full of his trademark wickedly indiscreet accounts of meetings and conversations with royals, politicians and celebrities.\n\nMullin dismisses the duchess’s now famous complaint that an unnamed royal speculated about the skin colour of her and Harry’s son, Archie.\n\nEXCLUSIVE: CHRIS MULLIN DIARIES Chris Mullin, who was a Labour MP for more than 20 years and a minister under Tony Blair, has won plaudits for the first three instalments of his political diaries, described as “wickedly indiscreet” and “a treat to be savoured”. The Independent is exclusively serialising the fourth volume.\n\nHe says people have often observed they can see Vietnamese blood in Sarah, his daughter by Vietnamese born wife Ngoc, and it is “not in the least offensive”.\n\nIt is not the first time he has sparked royal controversy.\n\nIn his 2020 memoir, he revealed the Queen sent a man to the gallows with the words “do you know, he even shot the dog?”. She turned down an appeal by a man convicted of murder in Bermuda, a story leaked to Mullin by a privy counsellor friend.\n\nMullin’s new diaries, which cover 2010–2022, claim the former Duke of Edinburgh once said “charm is a greatly overrated value”. He also describes Prince Philip as a “cantankerous old buffer” and says his reaction to media blanket coverage of the duke’s death was “thank f*** for Netflix”.\n\nAnd he revealed that, as a foreign office minister in Tony Blair’s government, a senior diplomat told him a trade mission led by Prince Andrew was “like a rugby club outing”."}, {"url": "https://www.newstatesman.com/politics/uk-politics/2016/10/bennite-blairite-chris-mullin-takes-us-inside-labours-struggles", "page_content": "(Photo By Getty)\n\nChris Mullin is one of an ever-growing number of figures in British politics who, by minutely recording an often turbulent or even failed career, have given themselves a fresh lease of public life. Mullin’s achievement is arguably greater than that of most, as he was never a major player at Westminster in the first place. His compelling diaries take advantage of his “being there” during most of the main political dramas of the past three decades or more. The success of these personal day-to-day records has secured him a later-life career treading the boards at literary festivals – the political meeting places of today’s middle classes.\n\nHinterland, a series of roughly chronological essays, is just as enjoyable as Mullin’s diaries but perhaps more serious in tone. He chooses to open this memoir with a chapter on his involvement, as a then left-leaning MP and journalist, in Labour’s struggles in the 1980s. As he was a Bennite who later became a Blairite, his nuanced and fair-handed account should be required reading for all those today who bandy about tired clichés about this period in Labour’s history.\n\nHere is a convincing portrait of party members – “the poor bloody infantry” – sidelined for decades by Labour’s leaders, complacent trade union bosses and the many MPs who behaved as if they had a seat for life. Mullin is equally clear-eyed about the hysteria and machinations of those who opposed reform, including some on the centre left (who emerge from this account very badly), the security services and the press, who worked in covert concert to smear the principal figures on the left.\n\nThe author concludes, “Although the campaign [for democracy inside the Labour Party] was widely portrayed as some sort of Trotskyite conspiracy, it was in reality a popular uprising, a reaction to the disappointments of Labour governments . . . Intolerance was by no means the exclusive preserve of the left.” In a typical Mullin footnote, he still delights in correcting those who accuse him of writing a pamphlet called How to Deselect Your MP. Wrong. He was the author of the carefully worded How to Select or Reselect Your MP, and he is no doubt currently negotiating the film rights to this “generally responsible” publication.\n\nRelated\n\nBut what of his “hinterland”? Mullin has had an extraordinarily varied life beyond Westminster and here he drops his usual wryly detached style, especially when writing about his lifelong love for south-east Asia. He exudes authentic outrage about the tragedy and waste of the Vietnam War, but also shares an unashamedly tender description of how he met, wooed and wedded his Vietnamese wife, Ngoc.\n\nSubscribe to the Saturday Read View all newsletters Your new guide to the best writing on ideas, politics, books and culture each weekend – from the New Statesman. Sign up here Select and enter your email address The Saturday Read Your new guide to the best writing on ideas, politics, books and culture each weekend - from the New Statesman. Morning Call A quick and essential guide to domestic politics from the New Statesman's Westminster team. The Crash A weekly newsletter helping you understand the global economic slowdown. Green Times The New Statesman’s weekly environment email. Events and Offers Stay up to date with NS events, subscription offers & updates. Your email address Job title Job title\n\nAdministration / Office\n\nArts and Culture\n\nBoard Member\n\nBusiness / Corporate Services\n\nClient / Customer Services\n\nCommunications\n\nConstruction, Works, Engineering\n\nEducation, Curriculum and Teaching\n\nEnvironment, Conservation and NRM\n\nFacility / Grounds Management and Maintenance\n\nFinance Management\n\nHealth - Medical and Nursing Management\n\nHR, Training and Organisational Development\n\nInformation and Communications Technology\n\nInformation Services, Statistics, Records, Archives\n\nInfrastructure Management - Transport, Utilities\n\nLegal Officers and Practitioners\n\nLibrarians and Library Management\n\nManagement\n\nMarketing\n\nOH&S, Risk Management\n\nOperations Management\n\nPlanning, Policy, Strategy\n\nPrinting, Design, Publishing, Web\n\nProjects, Programs and Advisors\n\nProperty, Assets and Fleet Management\n\nPublic Relations and Media\n\nPurchasing and Procurement\n\nQuality Management\n\nScience and Technical Research and Development\n\nSecurity and Law Enforcement\n\nService Delivery\n\nSport and Recreation\n\nTravel, Accommodation, Tourism\n\nWellbeing, Community / Social Services Job title Administration / Office Arts and Culture Board Member Business / Corporate Services Client / Customer Services Communications Construction, Works, Engineering Education, Curriculum and Teaching Environment, Conservation and NRM Facility / Grounds Management and Maintenance Finance Management Health - Medical and Nursing Management HR, Training and Organisational Development Information and Communications Technology Information Services, Statistics, Records, Archives Infrastructure Management - Transport, Utilities Legal Officers and Practitioners Librarians and Library Management Management Marketing OH&S, Risk Management Operations Management Planning, Policy, Strategy Printing, Design, Publishing, Web Projects, Programs and Advisors Property, Assets and Fleet Management Public Relations and Media Purchasing and Procurement Quality Management Science and Technical Research and Development Security and Law Enforcement Service Delivery Sport and Recreation Travel, Accommodation, Tourism Wellbeing, Community / Social Services Sign up Visit our privacy Policy for more information about our services, how New Statesman Media Group may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. THANK YOU Close\n\nThere are many sharp and funny passages on his life as a novelist (his best-known book, A Very British Coup, is still in print) and on his time as a laid-back junior minister and then as a seemingly more engaged member – later chair – of the home affairs select committee. A chapter titled “Loony MP Backs Bomb Gang”, about his fight to free the Birmingham Six, wrongly convicted in 1975 for two pub explosions that killed 21 people, has a noirish quality, as Mullin is led to meetings with the self-confessed real bomber at a remote location in Ireland.\n\nHe attractively underplays his heroism while being comically candid about his many failings. Asked to take a walk-on part as a vicar in a film adaptation of one of his own books (a good bit of casting), he agonises over his lines, only to find most of his performance discarded on the cutting-room floor. We can’t help but wince at his account of being summoned to support Tony Blair at the despatch box in 2003 after a joint visit to a Commonwealth conference in Nigeria. Mullin was too busy “soaking up the atmosphere” in the chamber to realise that Blair had asked him there specifically to provide help with MPs’ questions; he is ruefully honest about how his failure to do so almost certainly marked the beginning of the end of his ministerial career.\n\nOffering his verdict on Jeremy Corbyn’s surprise victory in 2015, he adopts the same mild tone as in his writing about the 1980s. Electing Corbyn was always going to be a “high-risk strategy” but, Mullin argues, his decisive majority should have secured him at least two years’ grace from his critics. He also gives backing to the increasingly fashionable idea that Labour should enter into an electoral pact with the Greens and the Liberal Democrats if the party is ever to come to power again.\n\nFor all its range and revelation, Hinterland does little to lessen the enigma of Mullin the human being: that baffling but engaging mixture of acuity and self-deprecation, application and apparent insouciance. The chapters on his family and school life offer no conclusive explanation for the unusual confidence of this “sickly child” who failed his eleven-plus exam – “a seminal event” in his life, from which he was saved only by his family’s ability to pay for him to go to a Catholic boarding school. In a rare resort to cliché, he ascribes most of his achievements in life to good luck.\n\nThe end of Hinterland assumes an elegiac air, with Mullin preparing for retirement from the public stage to tend his beloved walled garden in Northumberland. Don’t believe a word of it. You can’t keep a good politician down, especially not one who writes as well as this.\n\nMelissa Benn’s books include “School Wars: the Battle for Britain’s Education” (Verso)\n\nChris Mullin appears at Cambridge Literary Festival, in association with the New Statesman, on 27 November. See details and order tickets here."}]}