{"Paul Elliott was re-elected in 2015 and 2017.": [{"url": "https://www.onefc.com/features/how-a-dying-mans-words-reignited-paul-elliotts-fire-for-mma/", "page_content": "Paul “King Of The North” Elliott believes that fate has led him to ONE Championship. Now, it’s his job to capitalize on this life-changing opportunity.\n\nThis Friday, 28 January, the Englishman makes his promotional debut against Brazilian hard-hitter Anderson “Braddock” Silva in a light heavyweight mixed martial arts clash at ONE: ONLY THE BRAVE, and he knows a victory over the kickboxing star could change his life.\n\nAhead of this colossal showdown at the Singapore Indoor Stadium, learn about the 29-year-old’s fascinating journey to the global stage.\n\nKing Of Sports Day\n\nElliott was born and raised in the industrial town of Middlesbrough. The Brit lived with his parents – who were both in the army – and his older sister, and he thinks he had a pretty standard upbringing.\n\n“I grew up in an average sort of area. It wasn’t anything flashy. It was an average childhood, I guess,” he says.\n\nThe military careers of his parents gave Elliott a stable base, though it was the family’s penchant for sports that separated him from his peers.\n\n“My dad was a rugby player all his life, and he was a boxer in the army. My mum has been a keep-fit instructor all her life. My sister’s a professional hockey player as well,” he explains.\n\n“In school, at sports day, they would be like, ‘This is obviously the Elliotts’ day, so no one’s going to win apart from them.’\n\n“Sports were my thing. I had a lot of talent when it came to sports. I would play football, rugby, and [other] athletics.”\n\nElliott excelled at soccer and played in the academy sides for local professional teams Hartlepool and Middlesbrough.\n\nHis parents supported him all the way, driving him around the country for practices and matches. By all accounts, it looked as if the Englishman was destined for a career on the pitch.\n\n“I knew footballers were on a lot of money, and the fact I was very talented and my parents knew that it was good money too, they pushed me to do that,” he says.\n\n“They would take me to all the games at all the different stadiums to play. I could see that sort of life would be very good.”\n\nFollowing His Passion\n\nDespite the massive prospects Elliott had in soccer, something dragged him away.\n\n“I stumbled across kickboxing when I was 15 and it was on Eurosport, in the big Japanese arenas, with fighters like Remi Bonjasky and Jerome Le Banner fighting in the tournaments,” he recalls.\n\n“I was instantly hooked. I went to my first class when I was 15. I started picking up things really quickly.”\n\nElliott tried to juggle martial arts and soccer, but his motivation quickly waned for the latter.\n\nHe was on the cusp of a pro career, but he wanted to follow his passion. Even though his parents didn’t quite understand his choice, they let him follow his own path.\n\n“When I started doing kickboxing, it took over my life. I just enjoyed it that much,” he says.\n\n“I started doing judo along with it, and then just kind of slowly stopped being as interested in football. Even though I’d still go to the academy practices and the games, I ended up getting released because I wasn’t anywhere near as interested as I used to be.\n\n“My parents got a bit annoyed at me because it was the year where they decide if you get a scholarship. It was my decision. They could have forced me to change that and they didn’t, so I was thankful for that because I don’t regret anything I’ve done in my life so far.”\n\nA Stern Word To Relight The Fire\n\nIt wasn’t a constant upward trajectory for Elliott in his new endeavor, however.\n\nHe experienced an impressive run in the amateur kickboxing ranks and then moved to mixed martial arts training when he struggled to get matched, hoping to find more opportunities in the new code.\n\nBut everything came to a complete halt when he decided to retrain for a new career in instrumentation, and it took a stern word from an old friend to bring him back to martial arts.\n\n“I stepped away from the combat side of things and studied for three years. All I would do is go off to college, and then go to the gym and lift weights,” he says.\n\n“An older gentleman called Paul that used to go to all my fights was training in the gym and there’s this trolley next to him with medical supplies. We found out he had stomach cancer, unfortunately.\n\n“I always talked to him, explaining to him what I study, and then he said the doctors told him that he had six weeks to live. He said to me, raising his voice as well, ‘What on earth are you doing? Stop lifting all the weights. Go back to your fighting, something that you’re good at.’\n\n“The fact that he said that to me and in the situation that he was in, it meant a lot to him. It was a kick in the [butt], and the light bulb came on. I put myself back to work in the situation where I should have been all along.\n\n“That was probably November time. So I changed the whole training plan, put a new fight plan together, and then I fought that January. That was 2017 and since then, I’ve not been beaten.”\n\nPersevering To Reach The Top\n\nElliott has been on a tear since then. He made his amateur MMA debut in 2017, smashed through the regional circuit, and then moved swiftly into the pro ranks, where he has compiled a perfect 4-0 record with four first-round knockouts.\n\n“The King Of The North” was making a name for himself domestically and preparing to go international when a series of injuries sidelined him. First, a torn meniscus, followed by a pectoral tear, and then a blown ACL.\n\nIt was a tough time, but two surgeries later and back to full fitness, he got the call from ONE that made all the adversity seem worthwhile.\n\n“I’ll be honest – it’s not just physically challenging, it’s very mentally challenging as well. It’s probably taken me the longest in terms of trying to get back to full mental strength. The physical comes first, but the mental side of things takes a lot longer, surprisingly,” he offers.\n\n“For a while when I first came back, I wasn’t doing anywhere near as well as I should have been doing because of the ACL. Part of me was thinking, ‘Maybe this isn’t going to be the fairy-tale ending.’\n\n“But as time went on, I persevered and continued. Gradually, I started to get a bit better and more confident. And now, it’d be just over two years and I’m at a point where I’m the strongest I’ve ever been, the fastest I’ve ever been, and, skill-wise, I’m the best I’ve ever been.\n\n“When you’re injured and you haven’t fought in a while, and then ONE reaches out to you, let’s just say I was extremely happy. I may have shed a tear or two. I think things happen for a reason. I’m in touching distance of getting [to my ONE debut], and I feel like maybe this is all a blessing in disguise. Maybe this was meant to be.”\n\nElliott is now just days away from his debut in The Home of Martial Arts, and it’s all coming together. The Englishman has big aspirations for himself among the elite in the light heavyweight and heavyweight divisions, and he can’t wait to showcase what he’s all about in “The Lion City.”\n\n“I just want to try and take it all in, live in the moment and experience it firsthand,” he says.\n\n“And when it comes to the fight, don’t give up and keep punching and kicking until he stops.”\n\nRead more: ‘Braddock’ Expects Fireworks Against Fellow Slugger Paul Elliott"}, {"url": "https://www.imperial.ac.uk/people/p.elliott", "page_content": "Summary\n\nProfessor Paul Elliott, CBE, FMedSci, FRCP, FPH trained in clinical medicine and epidemiology as a Wellcome Trust Clinical Fellow at St Mary's Hospital London and the London School of Hygiene & Tropical Medicine. He studied for his PhD in Epidemiology on the INTERSALT Study under the mentorship of Professor Geoffrey Rose. He remained at the London School working as a lecturer, and subsequently as senior lecturer and reader in epidemiology before being appointed as Head of the Environmental Epidemiology Unit at LSHTM 1990. In 1995 he was appointed to the Chair in Epidemiology and Public Health Medicine at Imperial College London. Since then he has managed the transformation of the Department of Public Health into the present Department of Epidemiology and Biostatistics in the School of Public Health. The Department has expanded significantly during recent years to encompass a wide-ranging programme of health research and extensive collaborations with national and international research groups, hosting both honorary and visiting staff. Paul Elliott is also Director of the MRC Centre for Environment and Health, which was launched in 2009 (as the MRC-PHE Centre for Environment and Health in collaboration with King's College London) and forms a major part of the Department. The UK Small Area Health Statistics Unit (SAHSU) is also based in the department. Paul Elliott is an honorary consultant in public health medicine in the Directorate of Primary Care and Public Health of the Imperial College Healthcare NHS Trust. His contribution to public health research, most recently in response to the COVID-19 pandemic as director of the REACT community surveillance study was recognised with the award of a CBE in the 2021 Queen's Birthday Honours List.\n\nCurrent and Recent Leadership roles :\n\nHead of Department of Epidemiology and Biostatistics\n\nDirector of MRC Centre for Environment and Health\n\nDirector of UK Small Area Health Statistics Unit (SAHSU)\n\nDirector of Information Governance, Imperial College Academic Health Sciences Centre\n\nDirector of NIHR HPRU in Chemical and Radiation Threats and Hazards\n\nEmeritus National Institute for Health Research Senior Investigator\n\nVisiting Professor Nanyang Technological University Lee Kong Chian School of Medicine (since 2016)\n\nACCEA platinum award holder (original award 2008)\n\nChair of REF2021 Sub-panel Unit of Assessment 2 for Public Health, Health Services and Primary Care (2018-2022)\n\nMember of Management Committee, Imperial College Biomedical Research Centre, Social, Genetic & Environment theme\n\nKey Research Interests:\n\nEnvironmental epidemiology and small area health statistics\n\nGenetic and molecular epidemiology, gene-environment interactions\n\nNutritional epidemiology - focus on diet, high blood pressure and cardiovascular and cardiometabolic diseases\n\nPopulation cohort studies and population biobanks\n\nEpidemiologic surveillance methodology\n\nNon-ionising radiation and health\n\nKey Research projects:\n\nResearch collaboration\n\nAIRLESS - Prof Rod Jones (Cambridge), Prof Tong Zhu (Peking University), Prof Junfeng Zhang (Duke University), Prof Meiping Zhao and Yangfeng Wu (Peking University)\n\nAIRWAVE - Prof Kate Hunt and Dr Evangelia Demou (University of Glasgow), Prof M van Tongeren (University of Manchester), Prof A McIntosh, Prof J Allardyce (University of Edinburgh), Prof R Lyons (Swansea University)\n\nCOMBI-BIO - D Herrington (Wake Forest University), P Greenland (Northwestern University), R Tracy (University of Vermont), E Evangelou (Ioannina University), C Gieger (Helmholtz Munich)\n\nDeveloping Tools of Population Health Improvement - Prof N Wareham (Cambridge)\n\nDPUK - Prof J Gallacher, University of Oxford\n\nHealth Data Research UK (HDR UK) - H Hemingway, Ruth Gilbert, Pia Hardelid (UCL), Andy Boyd (Bristol), Chris Dibben (Edinburgh), Rich Fry (Swansea)\n\nHealth Protection Research Units - S Bouffler, T Gant, L Ainsbury, K Broom, R Hayward, N Boubia (UKHSA), David Phillips (KCL), A Willis (MRC Toxicology Unit)\n\nInternational Consortium on Blood Pressure (ICBP) consortium M Caulfield, P Munroe, Helen Warren, Michael Barnes (QMUL), L Wain (Leicester University)\n\nINTERMAP International collaborative study of dietary macro-and micro-nutrients and blood pressure. L van Horn (Northwestern University), M Daviglus (University of Illinois), J Nicholson (Murdoch University), E Holmes (Edith Cowan University/Imperial College London)\n\nLOLIPOP (London Life Sciences Prospective Population Cohort) Study - PI: J Kooner (Imperial College London) and J Chambers (NTU Singapore/Imperial). http://www.lolipopstudy.org/\n\nNorthern Finland Birth Cohorts - PI: Prof M-R Jarvelin\n\nMRC Centre for Environment and Health - Dr J Samet (Denver University USA), Prof Chris Holmes (Turing Institute Oxford), Dr D Greenbaum (HEI), Prof S Richardson (MRC Biostatistics Unit Cambridge)\n\nREACT - Prof Lord A Darzi (Imperial College London and Imperial College NHS Healthcare Trust), Prof G Cooke, Prof W Barclay, Prof G Taylor, Prof S Riley, Prof H Ward, Dr C Atchison (Imperial College London)i\n\nREACT-GE - Prof Sir Mark Caulfield (Genomics England)\n\nREACT-LC - Prof Markus Ralser (UCL Crick Institute), Prof Thomas Hankemeier (Leiden University), Dr David Wraith (Birmingham University), Prof Claire Bambra & Prof Lynne Corner (University of Newcastle)\n\nTeaching and Supervision:\n\nJoint course coordinator (2018-) for Masters in Health Data Analytics and Machine Learning (led by Dr Marc Chadeau-Hyam). Examinations Board member\n\nMSc in Data Analytics and Machine Learning\n\nContributor to online Global Masters in Public Health launched autumn 2019 Global Masters in Public Health\n\nRecent lectures contributed to these courses and modules at Imperial:\n\nModule lectures for:\n\nBSc in Global Health\n\nMBBS Epidemiology in Practice\n\nMSc in Epidemiology Principles of Global Epidemiology module and Social Epidemiology module and Disease Masterclass\n\nMasters in Public Health: Nutrition module\n\nMasters in Preventive Cardiology: Nutrition and Weight Management module\n\nMReS in Clinical Research: Human Nutrition module\n\nMasters in Health Data Analytics and Machine Learning\n\nShort courses including : International Nutritional Epidemiology (course director: Prof Elio Riboli); Global Health (course director Dr Daniela Fecht); Stat XP (course director Dr Marc Chadeau-Hyam).\n\nPostgraduate PhD Student Supervision:\n\nAllison Gaines Integrating health and greenhouse gas emission metrics for packaged foods to promote sustainable diets. Joint supervision: Prof Bruce Neal and Prof Paraskevi Seferidi\n\nBarbara Bodinier Advanced statistical and computational approaches for exposome profiling and integration: Applications to cancer and environmental epidemiology. Joint supervision: Prof Marc Chadeau-Hyam and Prof Roel Vermeulen\n\nIshminder Kaur Kooner Investigating metabolic disturbances underlying the increased risk of cardiovascular disease in South Asians compared to Europeans in the UK. Joint supervision: Prof John Chambers\n\nMatthew Whitaker Advanced Statistical modelling of the COVID-19 Epidemic -Integrating ecological, behavioural, and molecular data to predict disease severity and dynamics. Joint supervision: Prof Marc Chadeau-Hyam, Helen Ward\n\nPost-doctoral fellows under supervision:\n\nAntonio Berlanga-Taylor, PhD MRC Intermediate Research Fellowship in Computational Biology award working on GWAS and post-GWAS characterisation of inflammation and disease: integrative analysis of genomes and phenomes in large epidemiological studies.\n\nOliver Robinson, PhD MRC Centre for Environment and Health Early Career Research Fellowship working on Assessing the impact of the early life exposome on child growth and adiposity. Primary supervisor Prof Paolo Vineis.\n\nAssessor for Wellcome Trust clinical PhD 4i programme at Imperial.\n\n\n\nWellcome Trust clinical PhD 4i programme\n\nMentoring: academic mentor for the Academy of Medical Sciences mentorship scheme since 2012. Currently providing advice to 4 mid-career clinical scientists."}, {"url": "https://fortune.com/2017/12/07/elliott-management-hedge-fund-paul-singer/", "page_content": "If not for the watermelons, Elliott might have won in Korea.\n\nIn the summer of 2015, the activist hedge fund founded by Paul Singer had gone to war in the Republic of Samsung to stop the South Korean conglomerate from going through with what Singer considered to be an unfair deal. Elliott Management, the hedge fund that Singer launched 40 years ago and still leads today, was then a large investor in Samsung’s construction division. The trouble started when Jay Y. Lee, the son of the coma-bound chairman of the Samsung chaebol, started to consolidate power over Korea’s biggest company. When the younger Lee moved to have one part of the family empire buy the construction unit for $8 billion, Elliott balked at what it considered an absurdly low price and began lobbying other shareholders to reject it. Investing farther away from its New York home than ever before, the hedge fund faced a canny opponent with enormous influence in its home country. Samsung went so far as to publish illustrations online depicting Singer, with a vulture beak, accompanied by rhetoric that Singer perceived as anti-Semitic.\n\nIn the end, though, it was sugar that may have swayed the voters. As the meeting to approve the deal neared, Samsung representatives went door to door to meet shareholders, bearing watermelons and Korean walnut cakes, in a plea for their votes. The merger passed. Elliott, in a rare surrender, sold its shares a few weeks later.\n\nBut the story doesn’t end there. As South Korean authorities unraveled a corruption scandal that toppled the country’s President earlier this year, the trail traced back to Samsung. In August, Lee was convicted of bribery. Prosecutors said Samsung executives had provided a range of financial favors to a key political influencer—among them, a gift of a $830,000 dressage horse to the influencer’s daughter—in order to ensure that the merger was approved and Elliott was defeated. Lee is appealing the conviction, but for now, the Samsung heir is in jail, and Elliott has been vindicated. “I had no idea when we were in the midst of this, that this situation was going to lead to the impeachment of the President,” says Jonathan Pollock, co-CEO of Elliott, alongside Singer. It happens that in pursuing misbehaving companies, Elliott sometimes ends up sniffing out nefarious behavior: “Unfortunately, some of the people involved in these situations tend to ignore the rights of shareholders and creditors, and act entitled to do whatever they want.”\n\nThe Samsung outcome turned out to be a watershed moment not just for Elliott, but for shareholder activism. Activists use their ownership stakes in public companies to pressure them to change in order to boost returns—whether by restructuring their businesses, shaking up management, or even putting themselves up for sale. Such shareholder agitation has become more common in recent years as a widening pool of global investors seek a competitive edge. And in that world, the 40-year-old Elliott has emerged as both the largest and most active of activist hedge funds, and one that almost always seems to get its way.\n\n“The Elliott book of deals is probably the most instructive, and it’s also one of the most far, far reaching,” says Marty Lipton, founding partner of the law firm Wachtell Lipton Rosen & Katz and inventor of the poison-pill corporate defense strategy, who has lately faced Elliott more frequently and on more fronts than ever before. “They’ve been enormously successful, and they are a major factor in activism today.”\n\nIn the past five years, Elliott has launched activist campaigns at more than 50 companies—19 this year alone—in at least a dozen countries. During that span, the battle with Samsung is the only one that went all the way to a vote, and the only one in which the firm didn’t get what it wanted—a sign of just how effective Elliott is at pressuring management to agree to its demands. At the same time, Elliott’s assets have nearly doubled to roughly $39 billion, including $5 billion it raised in a 23-hour span in May, making it more than twice the size of the second-biggest activist hedge fund, Dan Loeb’s Third Point.\n\nNic Rapp\n\nThat war chest, along with Elliott’s 400-­person staff, has rendered the firm virtually impossible for adversaries—from industry titans to nation states—to beat in a fight. Warren Buffett learned that the hard way this summer, when Elliott used its financial might to successfully block Berkshire Hathaway’s bid for energy company Oncor, by buying up company debt and pledging to exercise its creditor veto right. And Elliott has lately sought to clone its winning strategy: It’s on track to launch about 50% more activist campaigns this year than in 2016—nearly three times as many as any other major activist fund—including, in October, two in a single day.\n\nElliott’s winning ways are in stark contrast to many of its activist peers, whose recent attempts to take on Fortune 500 companies have failed miserably, from Bill Ackman’s landslide loss in a proxy contest with ADP (ADP), to Greenlight Capital founder David Einhorn’s strikeout at General Motors (GM) earlier this year. Even Trian Partners’ Nelson Peltz, who narrowly won a blockbuster proxy campaign with P&G (PG) this fall, is still feuding with that company to accept him onto its board. And Elliott, whose 13.4% annual rate of return over its four-decade history is unmatched among hedge funds, has also outperformed at a time when that asset class has woefully lagged the market. The firm’s flagship fund, Elliott Associates, has returned more than 9.7% annualized over the past five years, compared with just 4.7% for hedge funds overall.\n\nAs Elliott ramps up its activism to an unprecedented scale, it is also accumulating a growing body count of deposed executives—not to mention ousted heads of state—who dared fight it. Just last year, Elliott finally prevailed in a 15-year battle to force Argentina to repay its bonds—a saga in which the hedge fund at one point seized an Argentine navy tall ship with the sailors still on it. A few months after Elliott finally collected its $2.4 billion windfall, Argentina indicted its former President, Cristina Fernández de Kirchner, who had led her country into default in 2014 rather than pay Elliott what it owed (a decision that had also cost her party reelection). “Elliott’s the only one that has effected regime change in two different sovereign countries,” says Chris Cernich, managing director of Strategic Governance Advisors, who counsels executives on proxy contests. “They were successful at being right, and very publicly right.”\n\nIn their conviction that they’re right, however, Elliott has become adept at wielding pressure on its opponents in ways their foes say can cross ethical boundaries. Through interviews with more than 40 people who have dealt with the hedge fund—including bankers, advisers, board members of various companies, and current and former employees of the firm—Fortune has learned previously unreported details that reveal just how far Elliott will go to win.\n\nTo many observers, Elliott appeared vindicated yet again this spring, when a soccer ball showed up at Paul Singer’s door. In January, the hedge fund had publicly called for the ouster of Klaus Kleinfeld, the CEO of aerospace manufacturer Arconic (ARNC), which split from Alcoa last year. Elliott objected to the company’s poor stock returns during his tenure, along with his generous compensation. Arconic refused to fire the CEO, and the stage was set for a proxy fight.\n\nFour months later, Kleinfeld responded in the form of that soccer ball, sent by courier directly to Singer’s office, across town from Arconic’s New York headquarters. He enclosed a letter on his personal stationery, in which he sardonically alluded to some “lastingly legendary” partying Singer had supposedly done while attending the 2006 World Cup in Berlin. In a postscript, Kleinfeld insinuated that the hedge fund manager’s alleged debauchery had included wearing Native American headgear and warbling “Singin’ in the Rain” in a public fountain. He pledged to send Singer a feathered headdress next.\n\nBy Elliott’s telling, it was the corporate equivalent of a bloody finger in a box. “We do understand Dr. Kleinfeld to be making veiled suggestions that he might intimidate or extort Mr. Singer,” Elliott’s general counsel, Richard Zabel, wrote to Arconic’s board. Less than a week later, Arconic’s board gave Kleinfeld no choice but to resign. Elliott, it seemed, had lucked into its desired outcome out of the blue, by way of its opponent’s unforced error.\n\nBehind the scenes, however, the hedge fund had been waging a sort of Cold War with Kleinfeld and Arconic, engaging in covert espionage ranging across the Eastern seaboard and all the way to Europe, Fortune has learned.\n\nFor Kleinfeld, it started when a pair of people who identified themselves as private investigators showed up at the door of his next-door neighbor in New York’s Westchester County about a year ago, inquiring about “loud parties” at his house. As Elliott ramped up its pressure on Arconic, friends and colleagues of Kleinfeld, along with board members of Arconic, reported more suspicious run-ins: Others who live near the CEO were followed to a local restaurant by strangers who then approached the couple; they claimed to be considering investing with Kleinfeld, but first had a few questions. The German-born executive declined to speak with Fortune, but five people familiar with the events confirmed this account. They all believed Elliott to be behind it: “We thought they crossed the line,” one of the people says.\n\nThe most unnerving incident was when one of Kleinfeld’s daughters, a student at Harvard Business School, was approached on campus by someone who asked to “friend” her on Facebook; the person also spoke to her friends, fishing for information about her family. While lawyers and advisers say it’s common to hire investigators to do opposition research in the context of a proxy campaign, executives’ kids—of any age—are typically considered off-limits.\n\nElliott does not seem to share those qualms: On at least three occasions, according to both court testimony and the accounts of seven people who spoke with Fortune, children of people facing the hedge fund’s attack have been pulled into the fray in some way, in an apparent bid to gain either information on or leverage against their parents. In an instance involving Norbert Essing, an Arconic PR consultant in Germany, neighbors of his children in London received visits from people asking about drug abuse by them or their father. This happened shortly after Elliott publicly blamed Essing for helping or encouraging Kleinfeld to write his soccer ball letter. (Essing denies the accusation.)\n\nElliott declined to comment on the use of private investigators in its activist campaigns. A person close to the firm denied that information from or about anyone’s kids was part of the scope of its Arconic research effort. Fortune reached out to Elliott to discuss those allegations and ask for its perspective on at least seven occasions, but the firm repeatedly declined to comment on the record.\n\nAfter the story was published, the firm responded with a letter—an excerpt of which follows. (For Elliott’s full letter, see “Elliott Management’s Response to Fortune.”)\n\n“In the Fortune article titled ‘Inside Elliott Management: How Paul Singer’s Hedge Fund Always Wins,’ Fortune relayed several instances in which unnamed people allege that the adult children of various executives were contacted by individuals that they assumed to be working for Elliott Management. This assumption and the implicit allegations that Elliott sent anyone to contact the children of these executives are completely false. “Elliott has always behaved ethically in its disputes with corporate managements and boards, and it is regrettable and disappointing that certain parties adverse to us would choose to promote false allegations about us rather than engage on the merits of our arguments in good faith.”\n\nBut in the insular world of activist hedge funds, Elliott appears to have a reputation for particularly hardball tactics, several sources say. Distaste for this no-holds-barred approach even led one prominent activist, Jeff Ubben, the CEO of hedge fund ValueAct, to stick up for Kleinfeld during a panel discussion on activism at the Milken Institute conference in May.\n\nStill, dirt-digging and other aggressive tactics, while controversial, have the benefit of exerting power beyond what money can buy. And they shed light on just what distinguishes Elliott from its less successful peers. “To do activism really, really well, you have to be not only smart and persistent, but you have to be willing,” says David Rosewater, who advises companies as the global head of Morgan Stanley’s shareholder activism and corporate defense group, and who has previously represented Elliott as an attorney. “Not everybody is willing to be the bad guy.”\n\nElliott Management was founded in 1977 by Paul Elliott Singer, a lawyer by training who found he could use the court system to great gain as an investor in bankruptcy situations and arbitrage. Conservative in almost every sense of the word, the billionaire Singer, now 73, insists on hedging all his investments to reduce the risk of loss, and prizes “manual efforts”—in other words, old-fashioned elbow grease—as the defining characteristic of his investment style.\n\nA powerful GOP donor who split with his party by funding the “Never Trump” movement—and by supporting same-sex marriage—Singer is also obsessed about his own and his employees’ physical safety, according to those who know him well. Elliott largely bans staff from social media; with few exceptions, employees cannot post pictures of themselves online—not even an official headshot—making them virtual ghosts in the digital age. The precaution is meant to protect them from anyone who might hold a grudge against the firm. “Paul has always been paranoid about security,” says one Elliott investor, who asked not to be identified for fear of offending Singer. In an extreme extension of that philosophy, Singer has even hedged his Manhattan headquarters, maintaining a backup version of the five-floor offices in New Jersey, just in case.\n\nIn the 1980s and ’90s, Elliott applied its acumen primarily to distressed debt and other more esoteric securities where relatively few Wall Street investors ventured. But the modern history of Elliott’s activism begins in 2004 with the arrival of Jesse Cohn. Now 37, Cohn is Elliott’s enfant terrible; a car fanatic and triathlete from Long Island who can talk so quickly it sometimes seems like he’s on fast-forward. A self-described computer-camp geek, Cohn spent two years as an M&A banker at Morgan Stanley before joining Elliott. That’s where he started writing letters to small tech companies, urging them to put themselves up for auction to garner big gains for their shareholders.\n\nCohn’s fanboy-meets-dealmaker affect earned him a reputation as a bit of a whippersnapper. In 2010, in a letter to the board of Novell, he boasted of earning one of the company’s IT certifications when he was 14—a charming bit of common ground that shared the pages with a hostile bid to buy the firm. The brash move worked—Novell was sold to private equity—and Cohn’s formula impressed his bosses enough that they promoted him to head all of its U.S. equity activism. Cohn’s campaigns have resulted in the takeouts or buyouts of more than a dozen companies, including BMC Software, Informatica, LifeLock and, biggest of all, EMC, which Dell acquired for $67 billion in 2015. “I don’t know if anyone has any more experience than he does prosecuting activist campaigns,” says Chris Young, head of contested situations at Credit Suisse, who has known Cohn since the latter started at Elliott.\n\nWhile Singer eschews sitting on corporate boards, Cohn sits on four, and has become so integral to the firm that some of Elliott’s investors mistakenly believe Cohn is Singer’s nephew. While Singer seldom appears in public (he declined to be interviewed for this article) and rarely takes part in negotiations with companies the firm targets, Cohn is often on the front lines. “Paul is the final decision maker on lots of these issues, but Jesse is the guy, and everyone in the activist community knows who he is,” says Marc Weingarten, a partner and cochair of the shareholder activism group at law firm Schulte Roth & Zabel who has represented Elliott.\n\nIn private, people sitting across the table from Cohn have seen another side of him, that of a maestro in the art of applying strategic pressure. That aspect of him bubbled into public view with Compuware, the Detroit-based business software maker that eventually sold to private equity firm Thoma Bravo for $2.4 billion in 2014 as a result of Elliott’s campaign.\n\nIn September 2013, a delegation from the Compuware board flew to New York to meet with Elliott about its demands for the company. Cohn opened the meeting by casually flipping through a six-inch-thick manila folder of purportedly embarrassing information on his guests, which included former GM CEO Fritz Henderson. Bill Grabe, an advisory director at private equity firm General Atlantic who sat on Compuware’s board at the time, would later testify in arbitration proceedings that Cohn unabashedly brought Henderson’s daughter into the conversation. “And you know, you have a daughter that’s doing this and whatnot,” Grabe recalled Cohn saying, paraphrasing the young fund manager. “You’re dealing with somebody whose tactics it is to intimidate, to splinter, to do everything they can to be disruptive,” Grabe testified. In the same case, then–Compuware CEO Bob Paul testified that in a follow-up phone call, Cohn dropped a “veiled threat” that he knew Paul kept an Aston Martin in his garage, saying, “By the way, love that English car you’re driving.”\n\nThese encounters, first disclosed during a wrongful termination dispute with Compuware cofounder Peter Karmanos Jr., have provided ammunition for Karmanos’s current suit in Michigan state court, accusing Elliott of “blackmailing” the directors into selling the company. “Elliott is taking advantage of the situation,” Karmanos tells Fortune, “and then when they wanted to push it a little harder, they bend the rules.” Karmanos started Compuware in 1973 with a few hundred dollars in tax refund checks. He had already announced his retirement from the board when Elliott launched its campaign, but was fired as a consultant a few months later for saying publicly that he “would tell the hedge fund to go fuck themselves”—comments he says he does not regret. “It’s hard to watch it just get torn apart by those jerks in New York,” he says.\n\nA person who was in the room when Cohn brought out the dossiers says the ploy had no influence on the board’s decisions, though it was unmistakably a threat to release damaging information. “There was no question as to what the intent was of that folder,” the person says. The directors had come to the meeting prepared, after their counterparts at rival BMC, which Elliott had come after a year earlier, warned them of similar tactics. That effort included a disturbing phone call to a BMC director’s daughter, the Compuware directors say.\n\nElliott declined to comment. But a person close to the firm says the shtick was designed “to be sort of funny, but sort of brutal,” a kind of shame game cataloging the board’s conflicts of interest, and conveying that the jig was up. The intel itself implicated the director, not his daughter, even if she was the source of it, the person adds: “We draw the line there. His daughter doesn’t sit on the board.”\n\nStill, such maneuvers are concerning to investors like ValueAct’s Ubben, who worry that Elliott may undermine the ability of other activists to work with companies in good faith, whether by its indifference to the human toll of its campaigns or because of its apparent affinity for knocking companies out of existence. “Our form of activism could not be more different than Elliott,” Ubben tells Fortune. Ubben’s hedge fund’s behind-closed-doors campaign at Microsoft (MSFT), now going on five years, is credited with expediting the tech giant’s turnaround under CEO Satya Nadella. “Elliott is single-handedly making the public markets less attractive to companies,” Ubben says, “and we see it in the shrinking number of public companies and the growth in private ownership.”\n\nWhile Cohn was in the trenches with Compuware, a sea change was taking hold inside Elliott. Elliott’s top brass saw Cohn’s strategy as an obvious extension of the firm’s bread-and-butter, labor-intensive investing, and five years ago they kicked it into high gear. Elliott had a generation of young managers eager to do what Cohn had done in their respective industries, from energy to metals and mining. Jonathan Pollock, who had practiced closed-end fund arbitrage in Europe and Asia, had returned to New York a few years earlier, and now fused the principles upon which Singer had built the firm into an equity strategy that could travel across Elliott and the globe.\n\nThe first big test was Hess. With a market cap of about $25 billion at the time, the family-run oil and gas empire was the largest company Elliott had ever gone after, and it occupied a nostalgic place in American culture thanks to the novelty toy trucks it released each year at Christmastime. Hess never saw Elliott coming. Elliott owned only 4% of Hess’s stock—not enough to necessitate an activist warning-shot 13D filing with the SEC—in January 2013 when the fund went public with a proxy campaign to replace five of the board’s directors. Elliott alleged that Hess was paying execs some of the highest compensation packages in the industry, while stock returns were near the bottom. It was “a sneak attack,” recalls Thomas Kean, the former Republican governor of New Jersey and one of the Hess directors in Elliott’s crosshairs.\n\nHess had an aura of impenetrability as one of America’s last dynastic corporations. But the hedge fund nominated an unimpeachable lineup of new directors (including former CEOs of BP and American Express), none of whom worked for Elliott, forcing shareholders to evaluate its arguments on merit. The Hess board “looked like the junior varsity B team when you compared them to the Elliott slate,” Cernich says. Elliott, Kean claims, told some institutional shareholders that failing to support its candidates would be tantamount to neglecting their fiduciary duty—an allegation with potential legal consequences.\n\n“Elliott is single-handedly making the public markets less attractive to companies.”\n\nJeff Ubben, activist investor and CEO of hedge fund ValueAct\n\nOn the eve of the proxy vote at the May 2013 annual meeting, representatives of Elliott and Hess holed up counting incoming votes in the Four Seasons hotel in Houston. It was only around 10 p.m., when the outcome was still too close to call, that the two sides came together, working through the night on a settlement: At 6:30 a.m., Hess announced that it would add three of Elliott’s nominees to its board. Kean, after 23 years of service, relinquished his seat. “By taking that on, they showed that they could move up the weight class to take on bigger companies, and that’s that,” Kean says. The Hess family’s defeat also reverberated beyond Elliott, says a banker who advises companies on facing activists: “Once that broke, I think everybody was like, party on.”\n\nInside Elliott, the mounting victories catalyzed the activist impulse. In October 2015, the hedge fund took on its first retail company with Cabela’s, which eventually sold itself to Bass Pro Shops. For Cohn, the moment of enlightenment came with American Capital. Elliott had originally invested in the obscure financial stock as part of an arbitrage trade, but when a colleague saw that the company was laying groundwork to shield itself from activist investors, he went across the hall to Cohn for the first time.\n\nRunning the company through Elliott’s activism checklist—Is the company undervalued? Can it be fixed? Can you convince other shareholders of the need for change?—Cohn brought the idea of a campaign to Pollock and Singer, who immediately signed off. In mid-November 2015, Elliott sent a public letter to American Capital while simultaneously revealing an 8.4% stake; the company caved just nine days later, announcing it was beginning a sale process. It was the quickest turnaround of any of Elliott’s public campaigns. (Ares Capital acquired the firm six months later for $3.4 billion.) “It showed that the process really works,” says Cohn. “And it’s scalable. That’s part of what I think we’ve proven—we’re not just a group of tech people doing just tech trades; we’re a team that’s able to take what we’ve built and do it over a long period of time, and roll it out to other industries and geographies, too.”\n\nStill, Cohn wasn’t quite satisfied with the machine he’d helped build. From his earliest days at Elliott, he’d harbored a dream that he’d frequently express over dinners with colleagues and advisers. For as many times as he’d pushed companies onto the block, as many sales as he’d secured, there was something missing: Jesse Cohn wanted to buy companies himself.\n\nTo hear Cohn tell it, he’d fallen in love. The time and effort Elliott put in to researching companies before launching campaigns often imbued the activists with an intimate knowledge of, and deep appreciation for, their targets. With EMC, for example, Elliott had spent months getting to know the data storage company, interviewing some 700 of its customers before launching a campaign urging it to pursue M&A opportunities. But when computing giant Dell, with financing from its private equity owner Silver Lake, bought EMC, Elliott was shut out of the deal. One day, Cohn hoped, Elliott would be big enough to afford whales of its own.\n\nCohn’s dream finally came true this fall, when Elliott acquired cybersecurity firm Gigamon for $1.6 billion, less than six months after unveiling a position in the stock. It was the first time Elliott had taken an entire public company private by itself, a major milestone for its relatively new Silicon Valley–based private equity arm, Evergreen Coast Capital.\n\nBut in a bit of high-finance irony, Elliott’s reputation for sharp elbows, Cohn realized, could be a liability in achieving these new goals. Cohn is now often sourcing leads for deals from the very bankers and lawyers who sat across from him during tough negotiations in the past. And with that adjustment, people who’ve worked with him say, has come a newfound sensitivity to how both he and Elliott are perceived.\n\nAt Athenahealth, for example, which Elliott targeted this spring, Cohn has been polite and even complimentary in his interactions with management, despite being a “regular drumbeat” of a presence, according to people close to the health IT company. On occasion, Cohn has been known to let a tinge of guilt creep in when he reflects on his more swashbuckling days. “Our tactics probably evolved over time,” says Pollock, who is Cohn’s boss. “We’re looking more toward this constructive engagement approach.”\n\n“Our tactics probably evolved over time. We’re looking more toward this constructive engagement approach.”\n\nJonathan Pollock, co-CEO, Elliott Management\n\nThat’s why Elliott’s attack on Arconic this year ruffled feathers inside and outside the firm. Led by 38-year-old portfolio manager Dave Miller, the campaign rhetoric packed more vitriol than any of Elliott’s campaigns in recent memory. Elliott’s 336-slide deck, distributed to Arconic shareholders and released publicly, depicted Kleinfeld as the Monopoly man, running away with money bags. It also alluded to Kleinfeld having personality abnormalities (a claim Arconic dismissed as an “unsubstantiated” ad hominem attack), prompting some to observe that Elliott could have a split personality of its own. “The problem is, I don’t know whether I’m going to get the mensch or the schmuck,” Joele Frank, of the eponymous public relations firm that has helped companies fight Elliott and other activists, commented at a panel at a Tulane law school event in March. (Miller, for his part, was promoted to head of U.S. restructuring at Elliott this spring.)\n\nThe Arconic campaign also illustrated Elliott’s power to deploy a seemingly bottomless amount of resources. In May, nearly a month after Kleinfeld resigned, Elliott did something no one has done before or since. Along with paper proxy-vote cards, the hedge fund mailed rechargeable video players, slightly smaller than an iPad, loaded with a four-minute attack ad—alleging Kleinfeld “has the worst track record of any CEO in the S&P 500 over his tenure”—that played automatically when investors opened the package. Sent to tens of thousands of large retail shareholders, the gimmick alone cost Elliott as much as $3 million, proxy contest advisers estimate. While Arconic disclosed it spent $58 million defending itself, it’s likely the hedge fund spent nearly as much if not more in the attack, according to people who worked on the campaign. After two failed rounds of settlement talks in which Singer made a rare personal appearance, Arconic ultimately agreed to add three of Elliott’s four picks to its board. “When Elliott shows up, it’s a completely different ball game,” says Weingarten, the Schulte lawyer. “They are relentless. They have the money, and they will spare no expense to ensure that they win.”\n\nJoshua Bright—The New York Times/Redux\n\nFrom Elliott’s perspective, the approach was warranted, given the resistance they’d encountered. Pollock notes that Arconic was one of just a handful of its campaigns, along with Hess and Samsung, where a true battle ensued. “I don’t count the three or four as a success, necessarily,” he says. (Adds someone close to Arconic, “We didn’t decide to take them on, we just said we disagree.”)\n\nBankers say the Arconic presentation has made the rounds in other companies’ board rooms, and looms large over Elliott’s subsequent campaigns, a warning of what can happen to those who resist its overtures. Whether it fits the firm’s ideals or not, Elliott’s ruthless legacy continues to color its endeavors. Unlike the activist firms run by Bill Ackman or Dan Loeb, the fund Paul Singer founded has raised an army of activists who can influence corporate fiefdoms everywhere. “There’s some sense that there’s an institution that survives the founder,” says Cernich, the governance adviser, “and that it expands and multiplies the power and effectiveness of the organization.”\n\nPromises Pollock, “We’ll be around for a while.” Boards, beware.\n\nUpdates: This article was updated on Dec. 13 to include a response that Elliott Management submitted after the article was published. It was updated on Dec. 15 to more clearly describe the allegations and verdict in the South Korean bribery case against Jay Y. Lee.\n\nCorrection: A graphic in an earlier version of this article incorrectly identified Lee’s title; he is the vice chairman of Samsung Electronics.\n\nA version of this article appears in the Dec. 15, 2017 issue of Fortune with the headline “Whatever It Takes to Win.”"}, {"url": "https://www.sportskeeda.com/mma/news-a-dying-man-s-words-served-reality-check-paul-elliott-led-martial-arts", "page_content": "ONE Championship newcomer Paul Elliott is on a dominant run that makes it look like he was born to do what he’s doing. However, that hasn’t always been the case for the 29-year-old Middlesbrough, England native.\n\nIn a recent interview, ‘The King of the North’ shared a time when he looked to do something different with his life:\n\n“I stepped away from the combat side of things and studied for three years. All I would do is go off to college, and then go to the gym and lift weights.”\n\nOne day, he saw an older gentleman named Paul, who went to all of his fights, training in the gym with a trolley of medical supplies beside him. It was then that he found out Paul had stomach cancer:\n\n“I always talked to him, explaining to him what I study, and then he said the doctors told him that he had six weeks to live. He said to me, raising his voice as well, ‘What on earth are you doing? Stop lifting all the weights. Go back to your fighting, something that you're good at.’”\n\nIt was a painful dose of reality seeing his friend go through something like that, but it helped re-ignite Paul Elliott's passion for combat sports:\n\n“The fact that he said that to me and in the situation that he was in, it meant a lot to him. It was a kick in the [butt], and the light bulb came on. I put myself back to work in the situation where I should have been all along. That was probably November time. So I changed the whole training plan, put a new fight plan together, and then I fought that January. That was 2017 and since then, I've not been beaten.”\n\nPaul Elliott to make his promotional debut at ONE: Only the Brave\n\nPaul Elliott will step into his first match on the global stage against veteran Anderson Silva at ONE: Only the Brave, which will be broadcast live on Friday, January 28.\n\nPaul Elliot has won all four of his bouts as a professional with a first-round knockout. He will look to prove that he’s the real deal by doing the same against a world-class opponent in Silva.\n\nMeanwhile, ‘Braddock’ is a well-decorated kickboxer who is looking for his maiden MMA victory in ONE Championship.\n\nThese two heavyweights will no doubt put on a striking clinic, and with their heavy hands and feet, it might not even go the distance.\n\nPoll : 0 votes"}, {"url": "https://www.businessinsider.com/paul-singers-elliott-2017-activist-hedge-fund-performance-2017-10", "page_content": "Elliott Management, the $34 billion investment firm led by Paul Singer, is barely beating its competition this year, according to a client update reviewed by Business Insider and industry indices.\n\nElliott deploys multiple investment strategies, ranging from real estate and private equity to distressed restructuring and activism.\n\nBillionaire Paul Singer's Elliott Management, one of Wall Street's most feared activist investors and one of the largest hedge funds around, is barely beating its competition this year.\n\nThe Elliott Associates LP fund is up 6.8% after fees and the Elliott International Limited fund is up 6% after fees this year through the third quarter, according to a September 30 client update that was reviewed by Business Insider.\n\nThat's compared to the average event-driven hedge fund, which gained 5.9% over the same period, according to data tracker HFR.\n\nElliott deploys multiple investment strategies, ranging from real estate and private equity to distressed restructuring and activism. Tenacious, litigious and cut-throat are terms often used to describe the iconic firm, which has been involved in some of the biggest plays in recent memory – from the Argentine debt crisis to more recently, Arconic.\n\nThe $34 billion firm doesn't benchmark itself to any index, according to client notes previously reviewed by Business Insider. Nonetheless, we can get a sense of how other hedge funds deploying similar strategies have performed this year by looking at industry indices. Here's a roundup from HFR for performance this year through September 30:\n\nEvent Driven Activist Index: 4.8%\n\nEvent Driven Distressed Restructuring: 4.4%\n\nEvent Driven Multistrategy: 5.4%\n\nTo be sure, Elliott has one of the better, and longest running, track records in the industry. The Elliott Associates fund, which launched in February 1977, has posted annualized gains of 13.4%, after fees.\n\nThe bulk of Elliott's gains this year have come from its equity oriented strategy (+4.1% gain before fees) and distressed debt (+3.6% before fees), according to the client update.\n\nThe firm managed $34.2 billion as of the end of the third quarter – a billion more than it did at mid-year, according to the Absolute Return Billion Dollar Club ranking.\n\nA spokesman for Elliott declined to comment."}, {"url": "https://www.ft.com/content/c73c82c4-12ac-11ea-a225-db2f231cfeae", "page_content": "What is included in my trial?\n\nDuring your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages.\n\nStandard Digital includes access to a wealth of global news, analysis and expert opinion. Premium Digital includes access to our premier business column, Lex, as well as 15 curated newsletters covering key business themes with original, in-depth reporting. For a full comparison of Standard and Premium Digital, click here.\n\nChange the plan you will roll onto at any time during your trial by visiting the “Settings & Account” section.\n\nWhat happens at the end of my trial?\n\nIf you do nothing, you will be auto-enrolled in our premium digital monthly subscription plan and retain complete access for HK$549 per month.\n\nFor cost savings, you can change your plan at any time online in the “Settings & Account” section. If you’d like to retain your premium access and save 20%, you can opt to pay annually at the end of the trial.\n\nYou may also opt to downgrade to Standard Digital, a robust journalistic offering that fulfils many user’s needs. Compare Standard and Premium Digital here.\n\nAny changes made can be done at any time and will become effective at the end of the trial period, allowing you to retain full access for 4 weeks, even if you downgrade or cancel."}, {"url": "https://www.businessinsider.com/paul-singers-elliott-on-trump-transition-quarterly-letter-2017-1", "page_content": "Paul Singer. Wikimedia\n\nElliott Management, the $31.6 billion New York hedge fund run by Paul Singer, sees a major change coming to the financial markets as a result of President Donald Trump's election.\n\n\n\nIt's just too soon to know exactly what will follow.\n\n\"Much of the contemplated agenda is supportive of growth (e.g., reforming the tax code, streamlining regulation and expanding natural resources production),\" the fund wrote in an unsigned fourth-quarter letter to investors. \"Other proposals could be harmful to growth depending on how they are implemented (e.g., more restrictive trade policies and tariffs).\"\n\nStocks have rallied to record highs since Trump's election, with the Dow Jones Industrial Average gaining more than 9%, in part as investors have focused on the growth-supportive aspects of Trump's presidential promises. Trump has promised to slash regulation on the environment as well as taxes.\n\n\n\nBut some are worrying that this sudden run-up has stocks looking expensive again. The cyclically adjusted price-to-earnings ratio, a valuation metric based on the last 10 years of average earnings and calibrated for inflation, is at the highest level since the early 2000s.\n\n\n\nIn the letter, Elliott also raises the risks that this run-up in shares poses.\n\n\"It is too early to determine, at what may be the dawn of a new era, whether stock prices are too far 'over their skis' or are actually on the verge of reflecting the opportunities posed by the low baseline for potentially much higher growth created by the reversal of eight years of growth-repressive and distorted fiscal and monetary policies.\n\n\n\nSimilarly, it is premature to conclude whether bond markets have been overly pessimistic these last few weeks or if the recent declines in prices are only the beginning of a sustained rise in interest rates. After all, even at current levels of bond prices, which are down several percent from their highs just a few months ago, bond prices do not provide a reasonable return after accounting for current inflation, much less the rate of inflation which could be expected if economic growth picked up meaningfully.\"\n\nElliott's flagship fund returned 4.4% for the fourth quarter and 13.1% last year, according to the letter."}, {"url": "https://www.businessinsider.com/elliotts-paul-singer-lays-out-why-the-us-needs-tax-reform-2017-11", "page_content": "Billionaire hedge-fund manager and GOP donor Paul Singer sent a letter to clients stressing the need for economic growth. He also laid out why the US needs tax reform.\n\nRepublican lawmakers are planning a vast overhaul of the US tax system.\n\nSinger was among the leading Republican critics of Trump during his campaign, and a website funded by Singer was reportedly involved in funding opposition research from a firm that later went on to produce the notorious Trump-Russia dossier.\n\nElliott Management, the hedge fund led by billionaire conservative donor Paul Singer, laid out in a private letter to clients why the developed world needs more growth to maintain social stability.\n\n\"The developed world needs more growth and a healthier balance between asset prices and middle-class employment opportunities and prospects,\" Elliott said in a quarterly letter to clients, which was seen by Business Insider.\n\nThe letter added:\n\n\"Only more development can generate a reasonable prospect of paying the ever-mounting bills, and lower the temperature of the growing societal edginess regarding economic security and “inequality.” Growth is essential to fostering the sense of community and buy-in that are needed for social stability, the acceptance of the notion of private property, and the marginalization of fringe political parties and leaders. The clock is ticking (or is it a time-bomb?).\"\n\nElliott cited a number of statistics on the US economy, saying that only 41% of high school dropouts are currently working, and that 15% of men aged 25 to 54 are out of work, versus 5% between 1945 and 1968.\n\n\"This has been an emergency for a long time, but it has not been addressed as such,\" the letter said. \"Many policymakers appear to feel that printing more money and keeping interest rates low, plus extending and enhancing benefits of all kinds (health care, student loan forgiveness, etc.), is good enough.\"\n\nThe letter makes a case for US corporate tax reform, saying the \"world is ever competitive\" and \"the historical assumption that customers will pay more for U.S. goods and services because they are 'better' is long gone.\"\n\n\"The case for domestic tax reform (really, tax cuts) is not quite as clear, but it is nonetheless powerful,\" the letter added.\n\n\"The tax cuts would be additionally helpful if they led to lower governmental spending, but good luck on that front,\" the letter added. \"Our view, considering the entire landscape, is that individual tax cuts would be an important catalyst of faster economic growth, and would help restore the balance between capital and labor.\"\n\nRepublican lawmakers have released a tax plan that, if enacted, would be the country's most sweeping tax change since the 1980s. Democrats charge that the plan would largely benefit the wealthy.\n\nElliott cautioned against raising government deficits, meanwhile. Here's the excerpt:\n\n\"At present it appears that both political parties in the U.S. are (more or less) in favor of, or at least willing to accept, increased federal spending and higher deficits. ... It is likely, based on the current state of play, that the tax legislation that may emerge from the Congressional “meat grinder” will deepen the spending/revenues deficit even after taking into account the expected increase in growth (and hence increased tax revenues) that tax rate cuts may create. While there is no “right time” to change profligate government spending, it is also true that kicking the can down the road (with ultimately unsustainable deficits) is a path to ruin.\"\n\nThese are issues that Elliott has previously brought up, particularly tax reform, which the firm has detailed in previous client letters.\n\nSinger was among the leading Republican critics of Trump during his campaign, though he later donated to the president's inaugural fund and has made multiple visits to the White House.\n\nA conservative website funded by Singer was reportedly involved in funding opposition research from a firm that later went on to produce the notorious Trump-Russia dossier. And Steve Bannon, the former White House chief strategist and current Breitbart News executive chairman, says he is now on a mission to destroy Singer, who runs $34 billion fund Elliott Management, according to Axios.\n\nAs of October 1, Elliott managed $34.1 billion, per the letter.\n\nA spokesman for Elliott declined to comment."}, {"url": "https://www.nytimes.com/2020/10/22/nyregion/paul-singer-florida.html", "page_content": "For more than 40 years, Paul E. Singer has helped cement New York City’s reputation as a global financial capital as the founder of Elliott Management, a hedge fund with $41 billion in assets whose offices overlook Central Park.\n\nBut on Wednesday, Mr. Singer, a billionaire who is one of the wealthiest people in the United States, revealed that he was moving his firm’s headquarters from Midtown Manhattan to West Palm Beach, Fla.\n\nThe decision to leave New York was prompted by the pandemic and the uncertainty over the future of Manhattan offices, a person familiar with the move said.\n\nMr. Singer himself, however, will remain in the Northeast, and Elliott will keep offices and some employees in New York, said the person, who was not authorized to publicly discuss the firm’s plans."}, {"url": "https://fortune.com/2017/12/07/elliott-management-hedge-fund-paul-singer/", "page_content": "If not for the watermelons, Elliott might have won in Korea.\n\nIn the summer of 2015, the activist hedge fund founded by Paul Singer had gone to war in the Republic of Samsung to stop the South Korean conglomerate from going through with what Singer considered to be an unfair deal. Elliott Management, the hedge fund that Singer launched 40 years ago and still leads today, was then a large investor in Samsung’s construction division. The trouble started when Jay Y. Lee, the son of the coma-bound chairman of the Samsung chaebol, started to consolidate power over Korea’s biggest company. When the younger Lee moved to have one part of the family empire buy the construction unit for $8 billion, Elliott balked at what it considered an absurdly low price and began lobbying other shareholders to reject it. Investing farther away from its New York home than ever before, the hedge fund faced a canny opponent with enormous influence in its home country. Samsung went so far as to publish illustrations online depicting Singer, with a vulture beak, accompanied by rhetoric that Singer perceived as anti-Semitic.\n\nIn the end, though, it was sugar that may have swayed the voters. As the meeting to approve the deal neared, Samsung representatives went door to door to meet shareholders, bearing watermelons and Korean walnut cakes, in a plea for their votes. The merger passed. Elliott, in a rare surrender, sold its shares a few weeks later.\n\nBut the story doesn’t end there. As South Korean authorities unraveled a corruption scandal that toppled the country’s President earlier this year, the trail traced back to Samsung. In August, Lee was convicted of bribery. Prosecutors said Samsung executives had provided a range of financial favors to a key political influencer—among them, a gift of a $830,000 dressage horse to the influencer’s daughter—in order to ensure that the merger was approved and Elliott was defeated. Lee is appealing the conviction, but for now, the Samsung heir is in jail, and Elliott has been vindicated. “I had no idea when we were in the midst of this, that this situation was going to lead to the impeachment of the President,” says Jonathan Pollock, co-CEO of Elliott, alongside Singer. It happens that in pursuing misbehaving companies, Elliott sometimes ends up sniffing out nefarious behavior: “Unfortunately, some of the people involved in these situations tend to ignore the rights of shareholders and creditors, and act entitled to do whatever they want.”\n\nThe Samsung outcome turned out to be a watershed moment not just for Elliott, but for shareholder activism. Activists use their ownership stakes in public companies to pressure them to change in order to boost returns—whether by restructuring their businesses, shaking up management, or even putting themselves up for sale. Such shareholder agitation has become more common in recent years as a widening pool of global investors seek a competitive edge. And in that world, the 40-year-old Elliott has emerged as both the largest and most active of activist hedge funds, and one that almost always seems to get its way.\n\n“The Elliott book of deals is probably the most instructive, and it’s also one of the most far, far reaching,” says Marty Lipton, founding partner of the law firm Wachtell Lipton Rosen & Katz and inventor of the poison-pill corporate defense strategy, who has lately faced Elliott more frequently and on more fronts than ever before. “They’ve been enormously successful, and they are a major factor in activism today.”\n\nIn the past five years, Elliott has launched activist campaigns at more than 50 companies—19 this year alone—in at least a dozen countries. During that span, the battle with Samsung is the only one that went all the way to a vote, and the only one in which the firm didn’t get what it wanted—a sign of just how effective Elliott is at pressuring management to agree to its demands. At the same time, Elliott’s assets have nearly doubled to roughly $39 billion, including $5 billion it raised in a 23-hour span in May, making it more than twice the size of the second-biggest activist hedge fund, Dan Loeb’s Third Point.\n\nNic Rapp\n\nThat war chest, along with Elliott’s 400-­person staff, has rendered the firm virtually impossible for adversaries—from industry titans to nation states—to beat in a fight. Warren Buffett learned that the hard way this summer, when Elliott used its financial might to successfully block Berkshire Hathaway’s bid for energy company Oncor, by buying up company debt and pledging to exercise its creditor veto right. And Elliott has lately sought to clone its winning strategy: It’s on track to launch about 50% more activist campaigns this year than in 2016—nearly three times as many as any other major activist fund—including, in October, two in a single day.\n\nElliott’s winning ways are in stark contrast to many of its activist peers, whose recent attempts to take on Fortune 500 companies have failed miserably, from Bill Ackman’s landslide loss in a proxy contest with ADP (ADP), to Greenlight Capital founder David Einhorn’s strikeout at General Motors (GM) earlier this year. Even Trian Partners’ Nelson Peltz, who narrowly won a blockbuster proxy campaign with P&G (PG) this fall, is still feuding with that company to accept him onto its board. And Elliott, whose 13.4% annual rate of return over its four-decade history is unmatched among hedge funds, has also outperformed at a time when that asset class has woefully lagged the market. The firm’s flagship fund, Elliott Associates, has returned more than 9.7% annualized over the past five years, compared with just 4.7% for hedge funds overall.\n\nAs Elliott ramps up its activism to an unprecedented scale, it is also accumulating a growing body count of deposed executives—not to mention ousted heads of state—who dared fight it. Just last year, Elliott finally prevailed in a 15-year battle to force Argentina to repay its bonds—a saga in which the hedge fund at one point seized an Argentine navy tall ship with the sailors still on it. A few months after Elliott finally collected its $2.4 billion windfall, Argentina indicted its former President, Cristina Fernández de Kirchner, who had led her country into default in 2014 rather than pay Elliott what it owed (a decision that had also cost her party reelection). “Elliott’s the only one that has effected regime change in two different sovereign countries,” says Chris Cernich, managing director of Strategic Governance Advisors, who counsels executives on proxy contests. “They were successful at being right, and very publicly right.”\n\nIn their conviction that they’re right, however, Elliott has become adept at wielding pressure on its opponents in ways their foes say can cross ethical boundaries. Through interviews with more than 40 people who have dealt with the hedge fund—including bankers, advisers, board members of various companies, and current and former employees of the firm—Fortune has learned previously unreported details that reveal just how far Elliott will go to win.\n\nTo many observers, Elliott appeared vindicated yet again this spring, when a soccer ball showed up at Paul Singer’s door. In January, the hedge fund had publicly called for the ouster of Klaus Kleinfeld, the CEO of aerospace manufacturer Arconic (ARNC), which split from Alcoa last year. Elliott objected to the company’s poor stock returns during his tenure, along with his generous compensation. Arconic refused to fire the CEO, and the stage was set for a proxy fight.\n\nFour months later, Kleinfeld responded in the form of that soccer ball, sent by courier directly to Singer’s office, across town from Arconic’s New York headquarters. He enclosed a letter on his personal stationery, in which he sardonically alluded to some “lastingly legendary” partying Singer had supposedly done while attending the 2006 World Cup in Berlin. In a postscript, Kleinfeld insinuated that the hedge fund manager’s alleged debauchery had included wearing Native American headgear and warbling “Singin’ in the Rain” in a public fountain. He pledged to send Singer a feathered headdress next.\n\nBy Elliott’s telling, it was the corporate equivalent of a bloody finger in a box. “We do understand Dr. Kleinfeld to be making veiled suggestions that he might intimidate or extort Mr. Singer,” Elliott’s general counsel, Richard Zabel, wrote to Arconic’s board. Less than a week later, Arconic’s board gave Kleinfeld no choice but to resign. Elliott, it seemed, had lucked into its desired outcome out of the blue, by way of its opponent’s unforced error.\n\nBehind the scenes, however, the hedge fund had been waging a sort of Cold War with Kleinfeld and Arconic, engaging in covert espionage ranging across the Eastern seaboard and all the way to Europe, Fortune has learned.\n\nFor Kleinfeld, it started when a pair of people who identified themselves as private investigators showed up at the door of his next-door neighbor in New York’s Westchester County about a year ago, inquiring about “loud parties” at his house. As Elliott ramped up its pressure on Arconic, friends and colleagues of Kleinfeld, along with board members of Arconic, reported more suspicious run-ins: Others who live near the CEO were followed to a local restaurant by strangers who then approached the couple; they claimed to be considering investing with Kleinfeld, but first had a few questions. The German-born executive declined to speak with Fortune, but five people familiar with the events confirmed this account. They all believed Elliott to be behind it: “We thought they crossed the line,” one of the people says.\n\nThe most unnerving incident was when one of Kleinfeld’s daughters, a student at Harvard Business School, was approached on campus by someone who asked to “friend” her on Facebook; the person also spoke to her friends, fishing for information about her family. While lawyers and advisers say it’s common to hire investigators to do opposition research in the context of a proxy campaign, executives’ kids—of any age—are typically considered off-limits.\n\nElliott does not seem to share those qualms: On at least three occasions, according to both court testimony and the accounts of seven people who spoke with Fortune, children of people facing the hedge fund’s attack have been pulled into the fray in some way, in an apparent bid to gain either information on or leverage against their parents. In an instance involving Norbert Essing, an Arconic PR consultant in Germany, neighbors of his children in London received visits from people asking about drug abuse by them or their father. This happened shortly after Elliott publicly blamed Essing for helping or encouraging Kleinfeld to write his soccer ball letter. (Essing denies the accusation.)\n\nElliott declined to comment on the use of private investigators in its activist campaigns. A person close to the firm denied that information from or about anyone’s kids was part of the scope of its Arconic research effort. Fortune reached out to Elliott to discuss those allegations and ask for its perspective on at least seven occasions, but the firm repeatedly declined to comment on the record.\n\nAfter the story was published, the firm responded with a letter—an excerpt of which follows. (For Elliott’s full letter, see “Elliott Management’s Response to Fortune.”)\n\n“In the Fortune article titled ‘Inside Elliott Management: How Paul Singer’s Hedge Fund Always Wins,’ Fortune relayed several instances in which unnamed people allege that the adult children of various executives were contacted by individuals that they assumed to be working for Elliott Management. This assumption and the implicit allegations that Elliott sent anyone to contact the children of these executives are completely false. “Elliott has always behaved ethically in its disputes with corporate managements and boards, and it is regrettable and disappointing that certain parties adverse to us would choose to promote false allegations about us rather than engage on the merits of our arguments in good faith.”\n\nBut in the insular world of activist hedge funds, Elliott appears to have a reputation for particularly hardball tactics, several sources say. Distaste for this no-holds-barred approach even led one prominent activist, Jeff Ubben, the CEO of hedge fund ValueAct, to stick up for Kleinfeld during a panel discussion on activism at the Milken Institute conference in May.\n\nStill, dirt-digging and other aggressive tactics, while controversial, have the benefit of exerting power beyond what money can buy. And they shed light on just what distinguishes Elliott from its less successful peers. “To do activism really, really well, you have to be not only smart and persistent, but you have to be willing,” says David Rosewater, who advises companies as the global head of Morgan Stanley’s shareholder activism and corporate defense group, and who has previously represented Elliott as an attorney. “Not everybody is willing to be the bad guy.”\n\nElliott Management was founded in 1977 by Paul Elliott Singer, a lawyer by training who found he could use the court system to great gain as an investor in bankruptcy situations and arbitrage. Conservative in almost every sense of the word, the billionaire Singer, now 73, insists on hedging all his investments to reduce the risk of loss, and prizes “manual efforts”—in other words, old-fashioned elbow grease—as the defining characteristic of his investment style.\n\nA powerful GOP donor who split with his party by funding the “Never Trump” movement—and by supporting same-sex marriage—Singer is also obsessed about his own and his employees’ physical safety, according to those who know him well. Elliott largely bans staff from social media; with few exceptions, employees cannot post pictures of themselves online—not even an official headshot—making them virtual ghosts in the digital age. The precaution is meant to protect them from anyone who might hold a grudge against the firm. “Paul has always been paranoid about security,” says one Elliott investor, who asked not to be identified for fear of offending Singer. In an extreme extension of that philosophy, Singer has even hedged his Manhattan headquarters, maintaining a backup version of the five-floor offices in New Jersey, just in case.\n\nIn the 1980s and ’90s, Elliott applied its acumen primarily to distressed debt and other more esoteric securities where relatively few Wall Street investors ventured. But the modern history of Elliott’s activism begins in 2004 with the arrival of Jesse Cohn. Now 37, Cohn is Elliott’s enfant terrible; a car fanatic and triathlete from Long Island who can talk so quickly it sometimes seems like he’s on fast-forward. A self-described computer-camp geek, Cohn spent two years as an M&A banker at Morgan Stanley before joining Elliott. That’s where he started writing letters to small tech companies, urging them to put themselves up for auction to garner big gains for their shareholders.\n\nCohn’s fanboy-meets-dealmaker affect earned him a reputation as a bit of a whippersnapper. In 2010, in a letter to the board of Novell, he boasted of earning one of the company’s IT certifications when he was 14—a charming bit of common ground that shared the pages with a hostile bid to buy the firm. The brash move worked—Novell was sold to private equity—and Cohn’s formula impressed his bosses enough that they promoted him to head all of its U.S. equity activism. Cohn’s campaigns have resulted in the takeouts or buyouts of more than a dozen companies, including BMC Software, Informatica, LifeLock and, biggest of all, EMC, which Dell acquired for $67 billion in 2015. “I don’t know if anyone has any more experience than he does prosecuting activist campaigns,” says Chris Young, head of contested situations at Credit Suisse, who has known Cohn since the latter started at Elliott.\n\nWhile Singer eschews sitting on corporate boards, Cohn sits on four, and has become so integral to the firm that some of Elliott’s investors mistakenly believe Cohn is Singer’s nephew. While Singer seldom appears in public (he declined to be interviewed for this article) and rarely takes part in negotiations with companies the firm targets, Cohn is often on the front lines. “Paul is the final decision maker on lots of these issues, but Jesse is the guy, and everyone in the activist community knows who he is,” says Marc Weingarten, a partner and cochair of the shareholder activism group at law firm Schulte Roth & Zabel who has represented Elliott.\n\nIn private, people sitting across the table from Cohn have seen another side of him, that of a maestro in the art of applying strategic pressure. That aspect of him bubbled into public view with Compuware, the Detroit-based business software maker that eventually sold to private equity firm Thoma Bravo for $2.4 billion in 2014 as a result of Elliott’s campaign.\n\nIn September 2013, a delegation from the Compuware board flew to New York to meet with Elliott about its demands for the company. Cohn opened the meeting by casually flipping through a six-inch-thick manila folder of purportedly embarrassing information on his guests, which included former GM CEO Fritz Henderson. Bill Grabe, an advisory director at private equity firm General Atlantic who sat on Compuware’s board at the time, would later testify in arbitration proceedings that Cohn unabashedly brought Henderson’s daughter into the conversation. “And you know, you have a daughter that’s doing this and whatnot,” Grabe recalled Cohn saying, paraphrasing the young fund manager. “You’re dealing with somebody whose tactics it is to intimidate, to splinter, to do everything they can to be disruptive,” Grabe testified. In the same case, then–Compuware CEO Bob Paul testified that in a follow-up phone call, Cohn dropped a “veiled threat” that he knew Paul kept an Aston Martin in his garage, saying, “By the way, love that English car you’re driving.”\n\nThese encounters, first disclosed during a wrongful termination dispute with Compuware cofounder Peter Karmanos Jr., have provided ammunition for Karmanos’s current suit in Michigan state court, accusing Elliott of “blackmailing” the directors into selling the company. “Elliott is taking advantage of the situation,” Karmanos tells Fortune, “and then when they wanted to push it a little harder, they bend the rules.” Karmanos started Compuware in 1973 with a few hundred dollars in tax refund checks. He had already announced his retirement from the board when Elliott launched its campaign, but was fired as a consultant a few months later for saying publicly that he “would tell the hedge fund to go fuck themselves”—comments he says he does not regret. “It’s hard to watch it just get torn apart by those jerks in New York,” he says.\n\nA person who was in the room when Cohn brought out the dossiers says the ploy had no influence on the board’s decisions, though it was unmistakably a threat to release damaging information. “There was no question as to what the intent was of that folder,” the person says. The directors had come to the meeting prepared, after their counterparts at rival BMC, which Elliott had come after a year earlier, warned them of similar tactics. That effort included a disturbing phone call to a BMC director’s daughter, the Compuware directors say.\n\nElliott declined to comment. But a person close to the firm says the shtick was designed “to be sort of funny, but sort of brutal,” a kind of shame game cataloging the board’s conflicts of interest, and conveying that the jig was up. The intel itself implicated the director, not his daughter, even if she was the source of it, the person adds: “We draw the line there. His daughter doesn’t sit on the board.”\n\nStill, such maneuvers are concerning to investors like ValueAct’s Ubben, who worry that Elliott may undermine the ability of other activists to work with companies in good faith, whether by its indifference to the human toll of its campaigns or because of its apparent affinity for knocking companies out of existence. “Our form of activism could not be more different than Elliott,” Ubben tells Fortune. Ubben’s hedge fund’s behind-closed-doors campaign at Microsoft (MSFT), now going on five years, is credited with expediting the tech giant’s turnaround under CEO Satya Nadella. “Elliott is single-handedly making the public markets less attractive to companies,” Ubben says, “and we see it in the shrinking number of public companies and the growth in private ownership.”\n\nWhile Cohn was in the trenches with Compuware, a sea change was taking hold inside Elliott. Elliott’s top brass saw Cohn’s strategy as an obvious extension of the firm’s bread-and-butter, labor-intensive investing, and five years ago they kicked it into high gear. Elliott had a generation of young managers eager to do what Cohn had done in their respective industries, from energy to metals and mining. Jonathan Pollock, who had practiced closed-end fund arbitrage in Europe and Asia, had returned to New York a few years earlier, and now fused the principles upon which Singer had built the firm into an equity strategy that could travel across Elliott and the globe.\n\nThe first big test was Hess. With a market cap of about $25 billion at the time, the family-run oil and gas empire was the largest company Elliott had ever gone after, and it occupied a nostalgic place in American culture thanks to the novelty toy trucks it released each year at Christmastime. Hess never saw Elliott coming. Elliott owned only 4% of Hess’s stock—not enough to necessitate an activist warning-shot 13D filing with the SEC—in January 2013 when the fund went public with a proxy campaign to replace five of the board’s directors. Elliott alleged that Hess was paying execs some of the highest compensation packages in the industry, while stock returns were near the bottom. It was “a sneak attack,” recalls Thomas Kean, the former Republican governor of New Jersey and one of the Hess directors in Elliott’s crosshairs.\n\nHess had an aura of impenetrability as one of America’s last dynastic corporations. But the hedge fund nominated an unimpeachable lineup of new directors (including former CEOs of BP and American Express), none of whom worked for Elliott, forcing shareholders to evaluate its arguments on merit. The Hess board “looked like the junior varsity B team when you compared them to the Elliott slate,” Cernich says. Elliott, Kean claims, told some institutional shareholders that failing to support its candidates would be tantamount to neglecting their fiduciary duty—an allegation with potential legal consequences.\n\n“Elliott is single-handedly making the public markets less attractive to companies.”\n\nJeff Ubben, activist investor and CEO of hedge fund ValueAct\n\nOn the eve of the proxy vote at the May 2013 annual meeting, representatives of Elliott and Hess holed up counting incoming votes in the Four Seasons hotel in Houston. It was only around 10 p.m., when the outcome was still too close to call, that the two sides came together, working through the night on a settlement: At 6:30 a.m., Hess announced that it would add three of Elliott’s nominees to its board. Kean, after 23 years of service, relinquished his seat. “By taking that on, they showed that they could move up the weight class to take on bigger companies, and that’s that,” Kean says. The Hess family’s defeat also reverberated beyond Elliott, says a banker who advises companies on facing activists: “Once that broke, I think everybody was like, party on.”\n\nInside Elliott, the mounting victories catalyzed the activist impulse. In October 2015, the hedge fund took on its first retail company with Cabela’s, which eventually sold itself to Bass Pro Shops. For Cohn, the moment of enlightenment came with American Capital. Elliott had originally invested in the obscure financial stock as part of an arbitrage trade, but when a colleague saw that the company was laying groundwork to shield itself from activist investors, he went across the hall to Cohn for the first time.\n\nRunning the company through Elliott’s activism checklist—Is the company undervalued? Can it be fixed? Can you convince other shareholders of the need for change?—Cohn brought the idea of a campaign to Pollock and Singer, who immediately signed off. In mid-November 2015, Elliott sent a public letter to American Capital while simultaneously revealing an 8.4% stake; the company caved just nine days later, announcing it was beginning a sale process. It was the quickest turnaround of any of Elliott’s public campaigns. (Ares Capital acquired the firm six months later for $3.4 billion.) “It showed that the process really works,” says Cohn. “And it’s scalable. That’s part of what I think we’ve proven—we’re not just a group of tech people doing just tech trades; we’re a team that’s able to take what we’ve built and do it over a long period of time, and roll it out to other industries and geographies, too.”\n\nStill, Cohn wasn’t quite satisfied with the machine he’d helped build. From his earliest days at Elliott, he’d harbored a dream that he’d frequently express over dinners with colleagues and advisers. For as many times as he’d pushed companies onto the block, as many sales as he’d secured, there was something missing: Jesse Cohn wanted to buy companies himself.\n\nTo hear Cohn tell it, he’d fallen in love. The time and effort Elliott put in to researching companies before launching campaigns often imbued the activists with an intimate knowledge of, and deep appreciation for, their targets. With EMC, for example, Elliott had spent months getting to know the data storage company, interviewing some 700 of its customers before launching a campaign urging it to pursue M&A opportunities. But when computing giant Dell, with financing from its private equity owner Silver Lake, bought EMC, Elliott was shut out of the deal. One day, Cohn hoped, Elliott would be big enough to afford whales of its own.\n\nCohn’s dream finally came true this fall, when Elliott acquired cybersecurity firm Gigamon for $1.6 billion, less than six months after unveiling a position in the stock. It was the first time Elliott had taken an entire public company private by itself, a major milestone for its relatively new Silicon Valley–based private equity arm, Evergreen Coast Capital.\n\nBut in a bit of high-finance irony, Elliott’s reputation for sharp elbows, Cohn realized, could be a liability in achieving these new goals. Cohn is now often sourcing leads for deals from the very bankers and lawyers who sat across from him during tough negotiations in the past. And with that adjustment, people who’ve worked with him say, has come a newfound sensitivity to how both he and Elliott are perceived.\n\nAt Athenahealth, for example, which Elliott targeted this spring, Cohn has been polite and even complimentary in his interactions with management, despite being a “regular drumbeat” of a presence, according to people close to the health IT company. On occasion, Cohn has been known to let a tinge of guilt creep in when he reflects on his more swashbuckling days. “Our tactics probably evolved over time,” says Pollock, who is Cohn’s boss. “We’re looking more toward this constructive engagement approach.”\n\n“Our tactics probably evolved over time. We’re looking more toward this constructive engagement approach.”\n\nJonathan Pollock, co-CEO, Elliott Management\n\nThat’s why Elliott’s attack on Arconic this year ruffled feathers inside and outside the firm. Led by 38-year-old portfolio manager Dave Miller, the campaign rhetoric packed more vitriol than any of Elliott’s campaigns in recent memory. Elliott’s 336-slide deck, distributed to Arconic shareholders and released publicly, depicted Kleinfeld as the Monopoly man, running away with money bags. It also alluded to Kleinfeld having personality abnormalities (a claim Arconic dismissed as an “unsubstantiated” ad hominem attack), prompting some to observe that Elliott could have a split personality of its own. “The problem is, I don’t know whether I’m going to get the mensch or the schmuck,” Joele Frank, of the eponymous public relations firm that has helped companies fight Elliott and other activists, commented at a panel at a Tulane law school event in March. (Miller, for his part, was promoted to head of U.S. restructuring at Elliott this spring.)\n\nThe Arconic campaign also illustrated Elliott’s power to deploy a seemingly bottomless amount of resources. In May, nearly a month after Kleinfeld resigned, Elliott did something no one has done before or since. Along with paper proxy-vote cards, the hedge fund mailed rechargeable video players, slightly smaller than an iPad, loaded with a four-minute attack ad—alleging Kleinfeld “has the worst track record of any CEO in the S&P 500 over his tenure”—that played automatically when investors opened the package. Sent to tens of thousands of large retail shareholders, the gimmick alone cost Elliott as much as $3 million, proxy contest advisers estimate. While Arconic disclosed it spent $58 million defending itself, it’s likely the hedge fund spent nearly as much if not more in the attack, according to people who worked on the campaign. After two failed rounds of settlement talks in which Singer made a rare personal appearance, Arconic ultimately agreed to add three of Elliott’s four picks to its board. “When Elliott shows up, it’s a completely different ball game,” says Weingarten, the Schulte lawyer. “They are relentless. They have the money, and they will spare no expense to ensure that they win.”\n\nJoshua Bright—The New York Times/Redux\n\nFrom Elliott’s perspective, the approach was warranted, given the resistance they’d encountered. Pollock notes that Arconic was one of just a handful of its campaigns, along with Hess and Samsung, where a true battle ensued. “I don’t count the three or four as a success, necessarily,” he says. (Adds someone close to Arconic, “We didn’t decide to take them on, we just said we disagree.”)\n\nBankers say the Arconic presentation has made the rounds in other companies’ board rooms, and looms large over Elliott’s subsequent campaigns, a warning of what can happen to those who resist its overtures. Whether it fits the firm’s ideals or not, Elliott’s ruthless legacy continues to color its endeavors. Unlike the activist firms run by Bill Ackman or Dan Loeb, the fund Paul Singer founded has raised an army of activists who can influence corporate fiefdoms everywhere. “There’s some sense that there’s an institution that survives the founder,” says Cernich, the governance adviser, “and that it expands and multiplies the power and effectiveness of the organization.”\n\nPromises Pollock, “We’ll be around for a while.” Boards, beware.\n\nUpdates: This article was updated on Dec. 13 to include a response that Elliott Management submitted after the article was published. It was updated on Dec. 15 to more clearly describe the allegations and verdict in the South Korean bribery case against Jay Y. Lee.\n\nCorrection: A graphic in an earlier version of this article incorrectly identified Lee’s title; he is the vice chairman of Samsung Electronics.\n\nA version of this article appears in the Dec. 15, 2017 issue of Fortune with the headline “Whatever It Takes to Win.”"}]}