{"Paul Elliott has served on the Work and Pensions Select Committee since 2015.": [{"url": "https://www.ioshmagazine.com/2021/03/23/hse-grilled-over-its-covid-response-select-committee-hearing", "page_content": "Unions and the UK Health and Safety Executive (HSE) leaders clashed over the enforcement of COVID guidance at work last week, as MPs on the Department of Work and Pensions Select Committee heard diametrically opposing views on the regulator's activities as the two sides gave their accounts of the last 12 months.\n\nTUC deputy general secretary Paul Nowak argued that the HSE had been 'found wanting' during the pandemic, where around 14,500 people of working age had lost their lives but the HSE had issued just two prohibition notices over COVID failures, plus a quoted figure of 235 improvement notices.\n\nIn 2019/20, the HSE issued 1,800 prohibition notices and 5,000 improvement notices across all risks. Prospect general secretary Mike Clancy set the figures in the light of the HSE’s shrinking budget, telling the committee that the enforcement agency currently had just 390 full-time, warranted inspectors, while £14 million from the DWP budget assigned last May and ring-fenced for its COVID response was 'less than 10% of the funding that’s been cut' over the past decade.\n\n'You can’t divorce the assessment of the HSE’s performance in the last year from the journey it’s been on in the previous ten years … it’s experienced a 54% real terms reduction in its funding,' Clancy told MPs.\n\nBoth unions argued that the HSE’s decision to categorise COVID-19 as a 'significant' occupational risk rather than a 'serious' one had dictated low enforcement levels.\n\nThe TUC also argued that there should have been a requirement for employers to publish their COVID risk assessments, with its own survey evidence finding that only half of workers were confident that their employer had carried out a risk assessment.\n\n'It's the opposite of complacent; we really have turned the organisation on its head to respond to COVID'\n\nBut HSE chief executive Sarah Albon countered that its approach – which included hiring two firms of COVID 'spot checkers' to boost presence on the ground while also relying on the soft power of policy and guidance – was broadly correct, with the relatively low number of notices explained by the fact that employers were far more aware of COVID-19 guidance than other workplace risks.\n\nSenior HSE executives, union leaders and representatives of the construction and manufacturing sectors gave evidence to a non-inquiry session of the DWP Select Committee, set up to revisit the committee’s 2020 inquiry on the DWP’s COVID response but not necessarily to produce a report.\n\nCommenting on the hearing, solicitor Rhian Greaves, director at Pannone Corporate, detected 'a clear disparity' between the perception of the regulator (and the industry representatives) and that of the unions, with polar opposite views on display.\n\n'The former talked about businesses trying to do the right thing, implementing familiar control measures in the workplace and with some success; Sarah Albon indicating that the level of compliance with COVID measures had been ‘significantly better’ than is routinely the case with typical health and safety risks.\n\nThe union representatives however felt the ‘lived experience’ of their members had not been reflected in the level of enforcement action taken and that there was an absence of any ‘realistic chance of enforcement’.\n\nCentral to the debate was the regulator’s categorisation of COVID-19 as a 'significant' workplace health risk in its Enforcement Management Model (EMM) – a decision the HSE defended but Clancy described as 'failing to read the room of civic opinion' while Nowak said that it 'sends entirely the wrong message to employers across the country'.\n\nThe EMM is a 46-page guide to inspectors designed to standardise responses to workplace hazards, advising when to ‘engage’ employers and when to escalate to enforcement action.\n\nThe union representatives told the inquiry this limited inspectors’ ability to enforce, and failed to create a deterrent effect. 'The reality is that employers need to know that if they breach that safe work guidance, there's a realistic chance of them being served an enforcement notice by the HSE,' Nowak said.\n\n'[The classification] limited the scope of the inspectors to issue prohibition notices, [as] there is a higher threshold to be met when issuing notices. Inspectors have raised this, through their own union, and it puts individual inspectors in a very difficult position.'\n\nHe added that the TUC was 'still seeing a significant numbers of workplace outbreak reports, just yesterday in terms of DHL facility in Trafford Park, in Greater Manchester'.\n\nHSE chief executive Sarah Albon countered that the regulator had 'surgically' targeted its resources at workplaces where it believed the risk was not controlled, and that inspectors were able 'elevate' the risk to serious if they thought that was justified.\n\n'The reality is that employers need to know that if they breach that safe work guidance, there's a realistic chance of them being served an enforcement notice by the HSE'\n\nShe defended the decision on 'significant' rather than 'serious' as based on the best endeavours of 'a group of very experienced inspectors and scientists and policy makers', pointing out that the HSE was 'not using these words in their normal English meaning' but to describe the likely outcomes for a typical, healthy worker of being exposed to the hazard.\n\nQuoting from HSE guidance, Clancy noted that a 'significant' risk might cause a 'non-progressive condition or temporary disability', while a 'serious' risk would cause a permanent, progressive or irreversible disability, lifelong restrictions on work capability or a major reduction to quality of life.\n\nClancy argued that COVID-19 matched the HSE’s definition of a 'serious' workplace risk, 'given the number of people suffering from ‘long COVID’, and the fact that 14,500 have lost their lives'.\n\nAlbon acknowledged that the classification – made in early summer 2020 then reviewed in the autumn –preceded emerging evidence on long COVID, and would be subject to further review.\n\nShe also suggested that it could have been too blunt an instrument. 'And I think with perfect hindsight, we could have said there's categories one, two, and three [of significant risk].'\n\nBut when Labour MP Debbie Abrahams suggested that the categorisation 'reflected a complacent attitude to the issue as a whole last year', Albon interjected heatedly.\n\n'It's the opposite of complacent; we really have turned the organisation on its head to respond to COVID.\n\n'We've put so much resource [into COVID], so much time from both our policymakers, our scientists, our inspectors, as well as a whole new set of people. Because we absolutely recognise the central importance of getting this right,' she told the panel.\n\nAbrahams then withdrew her comment on 'complacency'.\n\nQuoting from a letter from Albon to the committee that suggested the HSE had received 18,000 concerns on COVID at work but issued just 33 improvement notices as a result, Labour’s Stephen Timms MP, chair of the DWP Select Committee, asked why this number was so low.\n\nDirector of field operations Samantha Peace argued that enforcement figures were low as compliance levels with COVID-19 guidance were unusually high.\n\n'Employers are far more open and educated than we normally find because they're living that experience themselves. Whereas normally … they’re not actually living the risks themselves, they’re governing the workers who do, and it's a very different conversation.'\n\nAccording to Public Health England (PHE), there have been around 1,400 confirmed COVID-19 outbreaks in workplaces that were identified by the agency then referred to the HSE.\n\nProfessor John Simpson, PHE head of public health, guidance and expertise for the COVID-19 response, said that the interface between HSE and PHE on this issue could merit review.\n\nHe said: 'Some workplace issues were actually being picked up by the public health system, and then referred to HSE, rather than the other way around. And so that, again, is something else that may be worth thinking about [in terms of] future legislation.'\n\nProfessor Andrew Curran, chief scientific adviser to the HSE, said that it would 'take a while to understand the role of the workplace in the transmission of the virus' given the parallel roles of transmission on public transport, workers’ accommodation and in the community.\n\nHowever, the HSE was currently leading a 'hugely intensive' national study to investigate workplace transmission, where workers’ samples would be genomically tested to establish transmission routes.\n\nThe TUC also highlighted that the HSE guidance for workplaces had not been updated since March 2021 despite an evolving understanding of the risk. Albon confirmed that an update reflecting employers’ responsibilities as workers return to their workplaces was underway, and would cover ventilation strategies, vaccination and the use of workplace testing.\n\nFor more information on this and other topics raised at the hearing, visit our dedicated COVID section."}, {"url": "https://www.theguardian.com/commentisfree/2017/jul/12/the-guardian-view-on-select-committees-chairs-of-power", "page_content": "Theresa May and Jeremy Corbyn invariably make the big political headlines, even when they skip prime minister’s questions, as they did on Wednesday in order to be with the Spanish royal visitors, leaving Damian Green and Emily Thornberry to deputise capably. But a hung parliament is a backbenchers’ parliament as much as a party leaders’ parliament. It gives individual MPs and alliances an influence they would not have in a house with a working majority. It enriches the political texture. That’s why the most important event at Westminster on Wednesday was not something that centred on party leaders or manoeuvring ministers. It was the election of the select committee chairs.\n\nThe current select committee system is one of the best things about parliament. Ironically it takes the form it does because of the expenses crisis, when the stock of politicians plummeted to a new low. Public dismay about MPs meant there was political space to argue that backbenchers should have more power to shake some of the cosiness out of the system. As a result, MPs ramped up the departmental scrutiny system. Though the political complexion of the chairs was still divided between the parties on a pro rata basis, the power to elect each of them was extended to all backbench MPs. This means, for example, that when a particular committee gets a Conservative or Labour chair, the Tory or Labour candidates who compete for the post have to win votes – not just Tory or Labour votes but votes from MPs of other parties too.\n\nThe upshot has been that independence and experience are beginning to matter more in getting a chair than a record of party loyalism or the patronage of the whips. The quality of the chairs has improved, and so has the readiness of the committees to produce reports that cause problems for government. True, the independence of the committees should not be exaggerated or romanticised. But chairs like the Tories’ Andrew Tyrie on the treasury committee and Sarah Wollaston on health and Labour’s Iain Wright on the business committee and Frank Field on work and pensions all displayed tenacity and bold thinking that helped illuminate big policy issues in the last parliament.\n\nOn Wednesday MPs elected the chairs for the new parliament. Some of these were uncontested, a process that sees Ms Wollaston continue her good work on health and Labour’s Yvette Cooper carry on as the home affairs chair unopposed. Ten of the chairs, however, were decided by contests. These covered six Tory chairs, three Labour and the sole Liberal Democrat allocation. Many of these contests were fascinating, pitting one wing of the relevant party against another but requiring plausible candidates to canvass support and nominations from rival parties too. In most cases the winners were well qualified. The contest for the coveted Treasury chair, vacated by Mr Tyrie’s retirement, produced a six-way contest in which the liberal anti-Brexit former minister Nicky Morgan gratifyingly defeated the reactionary and pro-Brexit Jacob Rees-Mogg (whose proposers included the SNP’s Mhairi Black). There were significant new winners on the foreign affairs and education committees with Tom Tugendhat and Robert Halfon victorious. The race for the Labour chair of the business committee saw Rachel Reeves defeat Liam Byrne and two others.\n\nBritish politics is often nastily partisan and many feel it is going through a dark period. This was illustrated on Wednesday by the arid claim and counter-claim by each main party that the other was uniquely prone to abusing and vilifying opponents. The reality is that abuse is too prevalent in all politics and that all parties need to raise their game. But the committee contests and the work of the committees show politics on a much more worthy level. Along with lawmaking, scrutinising the executive is the key purpose of parliament. With the mammoth EU repeal bill scheduled for publication on Thursday, that role is more important than ever."}, {"url": "https://www.imperial.ac.uk/people/p.elliott", "page_content": "Summary\n\nProfessor Paul Elliott, CBE, FMedSci, FRCP, FPH trained in clinical medicine and epidemiology as a Wellcome Trust Clinical Fellow at St Mary's Hospital London and the London School of Hygiene & Tropical Medicine. He studied for his PhD in Epidemiology on the INTERSALT Study under the mentorship of Professor Geoffrey Rose. He remained at the London School working as a lecturer, and subsequently as senior lecturer and reader in epidemiology before being appointed as Head of the Environmental Epidemiology Unit at LSHTM 1990. In 1995 he was appointed to the Chair in Epidemiology and Public Health Medicine at Imperial College London. Since then he has managed the transformation of the Department of Public Health into the present Department of Epidemiology and Biostatistics in the School of Public Health. The Department has expanded significantly during recent years to encompass a wide-ranging programme of health research and extensive collaborations with national and international research groups, hosting both honorary and visiting staff. Paul Elliott is also Director of the MRC Centre for Environment and Health, which was launched in 2009 (as the MRC-PHE Centre for Environment and Health in collaboration with King's College London) and forms a major part of the Department. The UK Small Area Health Statistics Unit (SAHSU) is also based in the department. Paul Elliott is an honorary consultant in public health medicine in the Directorate of Primary Care and Public Health of the Imperial College Healthcare NHS Trust. His contribution to public health research, most recently in response to the COVID-19 pandemic as director of the REACT community surveillance study was recognised with the award of a CBE in the 2021 Queen's Birthday Honours List.\n\nCurrent and Recent Leadership roles :\n\nHead of Department of Epidemiology and Biostatistics\n\nDirector of MRC Centre for Environment and Health\n\nDirector of UK Small Area Health Statistics Unit (SAHSU)\n\nDirector of Information Governance, Imperial College Academic Health Sciences Centre\n\nDirector of NIHR HPRU in Chemical and Radiation Threats and Hazards\n\nEmeritus National Institute for Health Research Senior Investigator\n\nVisiting Professor Nanyang Technological University Lee Kong Chian School of Medicine (since 2016)\n\nACCEA platinum award holder (original award 2008)\n\nChair of REF2021 Sub-panel Unit of Assessment 2 for Public Health, Health Services and Primary Care (2018-2022)\n\nMember of Management Committee, Imperial College Biomedical Research Centre, Social, Genetic & Environment theme\n\nKey Research Interests:\n\nEnvironmental epidemiology and small area health statistics\n\nGenetic and molecular epidemiology, gene-environment interactions\n\nNutritional epidemiology - focus on diet, high blood pressure and cardiovascular and cardiometabolic diseases\n\nPopulation cohort studies and population biobanks\n\nEpidemiologic surveillance methodology\n\nNon-ionising radiation and health\n\nKey Research projects:\n\nResearch collaboration\n\nAIRLESS - Prof Rod Jones (Cambridge), Prof Tong Zhu (Peking University), Prof Junfeng Zhang (Duke University), Prof Meiping Zhao and Yangfeng Wu (Peking University)\n\nAIRWAVE - Prof Kate Hunt and Dr Evangelia Demou (University of Glasgow), Prof M van Tongeren (University of Manchester), Prof A McIntosh, Prof J Allardyce (University of Edinburgh), Prof R Lyons (Swansea University)\n\nCOMBI-BIO - D Herrington (Wake Forest University), P Greenland (Northwestern University), R Tracy (University of Vermont), E Evangelou (Ioannina University), C Gieger (Helmholtz Munich)\n\nDeveloping Tools of Population Health Improvement - Prof N Wareham (Cambridge)\n\nDPUK - Prof J Gallacher, University of Oxford\n\nHealth Data Research UK (HDR UK) - H Hemingway, Ruth Gilbert, Pia Hardelid (UCL), Andy Boyd (Bristol), Chris Dibben (Edinburgh), Rich Fry (Swansea)\n\nHealth Protection Research Units - S Bouffler, T Gant, L Ainsbury, K Broom, R Hayward, N Boubia (UKHSA), David Phillips (KCL), A Willis (MRC Toxicology Unit)\n\nInternational Consortium on Blood Pressure (ICBP) consortium M Caulfield, P Munroe, Helen Warren, Michael Barnes (QMUL), L Wain (Leicester University)\n\nINTERMAP International collaborative study of dietary macro-and micro-nutrients and blood pressure. L van Horn (Northwestern University), M Daviglus (University of Illinois), J Nicholson (Murdoch University), E Holmes (Edith Cowan University/Imperial College London)\n\nLOLIPOP (London Life Sciences Prospective Population Cohort) Study - PI: J Kooner (Imperial College London) and J Chambers (NTU Singapore/Imperial). http://www.lolipopstudy.org/\n\nNorthern Finland Birth Cohorts - PI: Prof M-R Jarvelin\n\nMRC Centre for Environment and Health - Dr J Samet (Denver University USA), Prof Chris Holmes (Turing Institute Oxford), Dr D Greenbaum (HEI), Prof S Richardson (MRC Biostatistics Unit Cambridge)\n\nREACT - Prof Lord A Darzi (Imperial College London and Imperial College NHS Healthcare Trust), Prof G Cooke, Prof W Barclay, Prof G Taylor, Prof S Riley, Prof H Ward, Dr C Atchison (Imperial College London)i\n\nREACT-GE - Prof Sir Mark Caulfield (Genomics England)\n\nREACT-LC - Prof Markus Ralser (UCL Crick Institute), Prof Thomas Hankemeier (Leiden University), Dr David Wraith (Birmingham University), Prof Claire Bambra & Prof Lynne Corner (University of Newcastle)\n\nTeaching and Supervision:\n\nJoint course coordinator (2018-) for Masters in Health Data Analytics and Machine Learning (led by Dr Marc Chadeau-Hyam). Examinations Board member\n\nMSc in Data Analytics and Machine Learning\n\nContributor to online Global Masters in Public Health launched autumn 2019 Global Masters in Public Health\n\nRecent lectures contributed to these courses and modules at Imperial:\n\nModule lectures for:\n\nBSc in Global Health\n\nMBBS Epidemiology in Practice\n\nMSc in Epidemiology Principles of Global Epidemiology module and Social Epidemiology module and Disease Masterclass\n\nMasters in Public Health: Nutrition module\n\nMasters in Preventive Cardiology: Nutrition and Weight Management module\n\nMReS in Clinical Research: Human Nutrition module\n\nMasters in Health Data Analytics and Machine Learning\n\nShort courses including : International Nutritional Epidemiology (course director: Prof Elio Riboli); Global Health (course director Dr Daniela Fecht); Stat XP (course director Dr Marc Chadeau-Hyam).\n\nPostgraduate PhD Student Supervision:\n\nAllison Gaines Integrating health and greenhouse gas emission metrics for packaged foods to promote sustainable diets. Joint supervision: Prof Bruce Neal and Prof Paraskevi Seferidi\n\nBarbara Bodinier Advanced statistical and computational approaches for exposome profiling and integration: Applications to cancer and environmental epidemiology. Joint supervision: Prof Marc Chadeau-Hyam and Prof Roel Vermeulen\n\nIshminder Kaur Kooner Investigating metabolic disturbances underlying the increased risk of cardiovascular disease in South Asians compared to Europeans in the UK. Joint supervision: Prof John Chambers\n\nMatthew Whitaker Advanced Statistical modelling of the COVID-19 Epidemic -Integrating ecological, behavioural, and molecular data to predict disease severity and dynamics. Joint supervision: Prof Marc Chadeau-Hyam, Helen Ward\n\nPost-doctoral fellows under supervision:\n\nAntonio Berlanga-Taylor, PhD MRC Intermediate Research Fellowship in Computational Biology award working on GWAS and post-GWAS characterisation of inflammation and disease: integrative analysis of genomes and phenomes in large epidemiological studies.\n\nOliver Robinson, PhD MRC Centre for Environment and Health Early Career Research Fellowship working on Assessing the impact of the early life exposome on child growth and adiposity. Primary supervisor Prof Paolo Vineis.\n\nAssessor for Wellcome Trust clinical PhD 4i programme at Imperial.\n\n\n\nWellcome Trust clinical PhD 4i programme\n\nMentoring: academic mentor for the Academy of Medical Sciences mentorship scheme since 2012. Currently providing advice to 4 mid-career clinical scientists."}, {"url": "https://www.gov.uk/government/publications/teacher-misconduct-panel-outcome-mr-paul-elliott", "page_content": "We use some essential cookies to make this website work. We’d like to set additional cookies to understand how you use GOV.UK, remember your settings and improve government services. We also use cookies set by other sites to help us deliver content from their services.\n\nYou have accepted additional cookies. You can change your cookie settings at any time.\n\nYou have rejected additional cookies. You can change your cookie settings at any time."}, {"url": "https://www.harriettbaldwin.com/about", "page_content": "Harriett in Parliament\n\nHarriett was elected as the Member of Parliament for West Worcestershire in May 2010, where she has lived since 2006. Between 2010 and 2015 she has served on the Work and Pensions Select Committee, and then Parliamentary Private Secretary to the Minister for Employment in the Department of Work and Pensions. She represented the UK on the NATO Parliamentary Assembly.\n\nIn 2014, Harriett was appointed to the role of Assistant Government Whip and then promoted within the Whips Office to the role of Lord Commissioner to HM Treasury.\n\nFollowing her re-election in 2015, Harriett became Economic Secretary to the Treasury (City Minister) and moved to become Parliamentary Under Secretary of State in the Ministry of Defence responsible for Defence Procurement in July 2016.\n\nBetween 2018 and 2019 Harriett served as Minister for Africa, having been appointed Minister of State at the Foreign and Commonwealth Office and Department for International Development.\n\nFollowing her re-election in 2019, Harriett joined the Treasury Select Committee and was elected to the post of chair of the committee in 2022. She also chairs the British Group Inter-Parliamentary Union, co-chairs the International Parliamentary Network for Education and in 2020, she re-joined the UK delegation of the NATO Parliamentary Assembly.\n\nPersonal Life\n\nHarriett was born in Hertfordshire and spent her early childhood in Cyprus. Harriett grew up in the village of Felsted in the heart of rural Essex, where her father, Tony Eggleston OBE, was headmaster of the local school. Harriett read Modern Languages (French and Russian) at Oxford, receiving First Class Honours and obtained an MBA from McGill University in Canada.\n\nHarriett is married to Jim Baldwin, a businessman and television producer. Jim is also a social and industrial historian whose interests include canals, bridges and steam trains. Between them, they have two daughters and a son, the youngest of whom was born in 1995. They live in the Teme Valley.\n\nHarriett’s Experience\n\nHarriett enjoyed a successful 20 year career in finance, specialising in currency markets for pension funds. She was on the National Council of Business for Sterling. She fought Stockton North for the Conservatives in 2005, gaining a 3.6% swing.\n\nShe was Vice Chair of the Board of the Social Investment Business and Chair of the Investment Committee from 2008-2012. The Social Investment Business helps charities and social enterprises with finance.\n\nHarriett supports many local charities. She has been a Home-Start volunteer, is a Friend of Community Action, the Nora Parsons Day Centre and the League of Friends of Malvern, Tenbury and Pershore hospitals to name a few. Harriett has always worked to encourage more women to get involved in politics and to work in financial services.\n\nWorking for West Worcestershire\n\nHarriett has been a strong voice for West Worcestershire in Parliament. She has pressed for better funding for the NHS and has helped to secure capital investment to build the new Malvern Community Hospital as well as the new Radiology Unit, Breast Unit and new birthing suite at Worcestershire Royal Hospital and helped to secure an extra £29 million to deliver much needed extra capacity at our local hospitals. Harriett successfully campaigned for six new flood defence schemes and continues to campaign for permanent flood protection in Severn Stoke and Tenbury Wells. She continues to support the efforts to deliver fairer funding for local schools and has supported the long running campaigns to improve the Carrington Road bridge and build a new Worcestershire Parkway train station.\n\nMPs declare their financial interests on a regular basis, the latest version can be found here."}, {"url": "https://www.conference-board.org/bio/index.cfm?bioid=5963", "page_content": "Philip is a solicitor of the Senior Courts of England and Wales (non practising). In December 2017 he retired from Slaughter and May after more than 30 years as a partner specialising in pensions law. Philip is a graduate of Durham University.\n\nHis experience included advising on some of the largest scheme mergers and restructurings, repayments of surplus and management of deficit issues (including benefit design changes and consultations with employees and their representatives over these changes) and “employer covenant” support measures.\n\nPhilip’s work included advising General Motors on the UK pension aspects of the sale of its Opel/Vauxhall Automotive business to Peugeot SA, including advising on the associated UK pensions reorganisation (2017); advising Pirelli on the impact of its post-agreed takeover by ChemChina, refinancing arrangements, including measures in respect of the \"employer covenant\" for its 5 UK pension funds (2016); advising Unilever on re-enrolment issues following the third anniversary of its auto-enrolment staging date (2016); advising Royal London on the closure of its defined benefit pension schemes to future accrual (2015).\n\nPhilip is listed as a leading individual in the Pensions section of Chambers UK, 2017 and in the Pensions Section Hall of Fame in The Legal 500 United Kingdom, 2017.\n\nPhilip has been a member of a number of PensionsEurope working groups, including its Defined Benefit Working Group. He is a member of the International Pension and Employee Benefits Lawyers Association (\"IPEBLA\"), and a past chair of IPEBLA. He is a former member of the main Committee of the Association of Pension Lawyers (the “APL”) and a past Chairman of the APL's Legislative and Parliamentary Sub-Committee. He is also a former member of the International Sub-Committee of the Association of Pension Lawyers.\n\nDuring 2018, Philip has provided expert evidence to the House of Commons Work and Pensions Select Committee Consultation on CDC Schemes, appeared as an expert witness before that Committee (and his evidence is referred in more than 10% of the footnotes in the Select Committee’s Report published on 16th July, 2018). He has spoken at a number of conferences, both within the UK and overseas, on Collective Defined Contribution Pension Schemes, published a joint paper comparing Dutch Collective Defined Contribution Pension Schemes with UK Defined Benefit Schemes, and provided a response to the Department for Work and Pensions June 2018 Consultation on clarifying and strengthening trustees’ investment duties.\n\nMore recently he has published an article, in Trust Law International (Volume 32, Part 4, 2019) on“ Must occupational pension schemes take into account ESG factors, even if there is a risk of financial detriment to the pension fund?” and responded to the UK Department of Work and Pensions public consultation on “ Delivering Collective Defined Contribution Pension Schemes”."}, {"url": "https://conservativehome.blogs.com/resources/2010/06/introducing-paul-goodman.html", "page_content": "Paul Goodman is Executive Editor of ConservativeHome. He was the Conservative MP for Wycombe for the best part of ten years - between 2001 and 2010.\n\nDuring that time, Paul served on the Conservative front bench as a Shadow Minister for Communities and Local Government, Shadow Minister for Childcare, Shadow Minister for Disabled People and Shadow Minister for Work and Pensions. He was also a member of the Work and Pensions Select Committee, and Parliamentary Private Secretary to David Davis MP when the latter was Party Chairman.\n\nIn 2009, he announced that he'd stand down at the forthcoming general election, declaring that the Commons was becoming \"a House in which professional politics predominates, entrenching and empowering a taxpayer-dependent political class distinct and separate from those who elect them...for better or worse, this future Commons isn't for me\".\n\nPaul is a long-standing contributor to ConservativeHome, and wrote for CentreRight regularly before joining full time during the 2010 General Election campaign.\n\nBefore entering Parliament, Paul was Comment Editor of the Daily Telegraph for six years - between 1995 and 2001. He thus saw the collapse of John Major's Government and the plight of William Hague's Opposition as a working journalist.\n\nBefore, joining the Daily Telegraph, he was a reporter on the Sunday Telegraph from 1992. Before that, he was briefly a leader writer on the Daily Telegraph - and News Editor of the Catholic Herald from 1991-1992.\n\nPaul has written for the Times, the Spectator, the Independent, the Daily Mail, Standpoint, and the Sunday Express as well as for Telegraph Newspapers, and has broadcast on programmes including Sky News, World at One, Newsnight. His essay \"Who do we want our MPs to be?\" was published recently by Policy Exchange.\n\nRaised in East Sheen, near Richmond, Surrey, Paul read English Literature at York University. He was Chairman of the Federation of Conservative Students between 1983-84, and was a member of the National Union of Students Executive during the two previous years.\n\nBetween 1985 and 1987 he worked as a researcher for Tom King, then Northern Ireland Secretary, and later in the Policy Unit for Westminster City Council. From 1988 until 1990 he was a novice at Quarr Abbey, Isle of Wight.\n\nPaul is married to Fiona, and they have one child, Daniel. His special interest is relations with Islam - when he was in Parliament, he had the largest number of Muslim constituents of any Conservative MP.\n\n\n\n> Paul's ConservativeHome colleagues are Jonathan Isaby and Tim Montgomerie."}, {"url": "https://www.theguardian.com/commentisfree/2017/jul/12/the-guardian-view-on-select-committees-chairs-of-power", "page_content": "Theresa May and Jeremy Corbyn invariably make the big political headlines, even when they skip prime minister’s questions, as they did on Wednesday in order to be with the Spanish royal visitors, leaving Damian Green and Emily Thornberry to deputise capably. But a hung parliament is a backbenchers’ parliament as much as a party leaders’ parliament. It gives individual MPs and alliances an influence they would not have in a house with a working majority. It enriches the political texture. That’s why the most important event at Westminster on Wednesday was not something that centred on party leaders or manoeuvring ministers. It was the election of the select committee chairs.\n\nThe current select committee system is one of the best things about parliament. Ironically it takes the form it does because of the expenses crisis, when the stock of politicians plummeted to a new low. Public dismay about MPs meant there was political space to argue that backbenchers should have more power to shake some of the cosiness out of the system. As a result, MPs ramped up the departmental scrutiny system. Though the political complexion of the chairs was still divided between the parties on a pro rata basis, the power to elect each of them was extended to all backbench MPs. This means, for example, that when a particular committee gets a Conservative or Labour chair, the Tory or Labour candidates who compete for the post have to win votes – not just Tory or Labour votes but votes from MPs of other parties too.\n\nThe upshot has been that independence and experience are beginning to matter more in getting a chair than a record of party loyalism or the patronage of the whips. The quality of the chairs has improved, and so has the readiness of the committees to produce reports that cause problems for government. True, the independence of the committees should not be exaggerated or romanticised. But chairs like the Tories’ Andrew Tyrie on the treasury committee and Sarah Wollaston on health and Labour’s Iain Wright on the business committee and Frank Field on work and pensions all displayed tenacity and bold thinking that helped illuminate big policy issues in the last parliament.\n\nOn Wednesday MPs elected the chairs for the new parliament. Some of these were uncontested, a process that sees Ms Wollaston continue her good work on health and Labour’s Yvette Cooper carry on as the home affairs chair unopposed. Ten of the chairs, however, were decided by contests. These covered six Tory chairs, three Labour and the sole Liberal Democrat allocation. Many of these contests were fascinating, pitting one wing of the relevant party against another but requiring plausible candidates to canvass support and nominations from rival parties too. In most cases the winners were well qualified. The contest for the coveted Treasury chair, vacated by Mr Tyrie’s retirement, produced a six-way contest in which the liberal anti-Brexit former minister Nicky Morgan gratifyingly defeated the reactionary and pro-Brexit Jacob Rees-Mogg (whose proposers included the SNP’s Mhairi Black). There were significant new winners on the foreign affairs and education committees with Tom Tugendhat and Robert Halfon victorious. The race for the Labour chair of the business committee saw Rachel Reeves defeat Liam Byrne and two others.\n\nBritish politics is often nastily partisan and many feel it is going through a dark period. This was illustrated on Wednesday by the arid claim and counter-claim by each main party that the other was uniquely prone to abusing and vilifying opponents. The reality is that abuse is too prevalent in all politics and that all parties need to raise their game. But the committee contests and the work of the committees show politics on a much more worthy level. Along with lawmaking, scrutinising the executive is the key purpose of parliament. With the mammoth EU repeal bill scheduled for publication on Thursday, that role is more important than ever."}, {"url": "https://www.politico.eu/article/uk-mps-reward-failure-post-election-payouts/", "page_content": "Frank Field has formed a new party to fight for his seat against Labour. If Field loses, his parliamentary payout will cushion the blow | Niklas Halle'n/AFP via Getty Images\n\nLONDON — British MPs worried — in some cases almost certain — that they will lose their seat in a general election have an incentive to stand anyway: lots of cash.\n\nWith the major parties on a war footing for an election that could come as soon as the day after October 31 — when Boris Johnson has promised the U.K. will leave the EU, \"do or die\" — a host of lawmakers face an uncertain future. But the humiliation of losing their seat could be soothed by a redundancy payment that's double the statutory payout given to members of the public who lose their jobs.\n\nWhile there's no suggestion that any MPs are standing just to get the money, the choice facing them is clear: Quit before the election and get nothing; or stand, and if they fail to get reelected, get a check. It's been called a “perverse incentive” to contest elections.\n\nFrank Field, who resigned from the Labour Party last year after almost 40 years as the MP for Birkenhead in the northwest of England, announced earlier this month that he would stand at the next general election.\n\nThe 77-year-old chair of the work and pensions select committee has formed a new party, Birkenhead Social Justice, to fight a seat that had a Labour majority in 2017 of more than 25,000 votes.\n\n“At a time when distrust in politics is running high, it seems odd that defeated MPs can get double the maximum redundancy available to ordinary voters\" — Willie Sullivan, senior director at the Electoral Reform Society\n\nIf the people of Birkenhead choose the new Labour candidate over Field, he would get a £31,500 “loss of office” payment, plus up to two months of his MP salary (worth £13,244) for the time spent winding up his office and any other administrative tasks needed to be done.\n\nWith the political climate being so volatile, the Independent Parliamentary Standards Authority (a House of Commons watchdog that makes the redundancy payments) could be writing a number of checks.\n\nIPSA rules say that MPs who have served for at least two years and lose their seats get double the statutory redundancy pay that members of the public get, as well as the two-month salary allowance, plus winding-up expenses for staff or removal costs.\n\nStatutory redundancy is calculated based on age and the number of years a person has held a job, up to a certain limit. Field’s payout would be the maximum possible for an MP.\n\nWillie Sullivan, a senior director at the Electoral Reform Society, a pressure group, said it is right that MPs put out of a job are compensated like any other public servant, “particularly if we want to see more diversity in politics.”\n\nHe added: “However, while there is no evidence the current situation is being abused, clearly it will need to be reassessed if there is a perverse incentive for MPs to always re-stand even if they do not wish to win.\"\n\n“At a time when distrust in politics is running high, it seems odd that defeated MPs can get double the maximum redundancy available to ordinary voters. There are many reasons people feel disenchanted, including a feeling of ‘one rule for us, another for them.’”\n\nIndependents' fears\n\nIndependent MPs might seem at risk — for having left a party and for being away from the election machines of the Tories and Labour — but they could still hold on.\n\nJoe Twyman, co-founder and director at Datapoll, pointed to research showing that “old, tribal loyalties to parties are not what they once were thanks to Brexit,” with more people ready to vote along Leave/Remain lines.\n\n“That could mean that in certain circumstances, MPs who have switched to become independents could hold on depending on the constituency profile and indeed their own position,” he said.\n\n“In normal circumstances you would expect an independent candidate to get absolutely nowhere at a general election” — Joe Twyman, co-founder and director at Datapoll\n\nTwyman said that Field — a pro-Brexit candidate in a pro-Brexit constituency he has represented since 1979 — “stands a very good chance of holding on.”\n\n“Frank Field is the obvious example because he’s been in so long and his margin of victory [in 2017] was so large,” he added. “For the other candidates it’s more difficult.”\n\nOther new independents are yet to confirm whether they will stand again.\n\nEx-Labour MPs Ian Austin (Dudley North), Ivan Lewis (Bury South) and Angela Smith (Penistone and Stocksbridge) are in line for redundancy payments worth £21,500, £26,800 and £23,000 respectively, plus the two months of salary, if an election comes before the end of the year.\n\nTheir former colleagues Luciana Berger (Liverpool, Wavertree), Gavin Shuker (Luton South) and John Woodcock (Barrow and Furness) are all in line for £9,400.\n\nMeanwhile, ex-Tory MP Heidi Allen (South Cambridgeshire) has racked up a £5,800 redundancy pot, while Nick Boles (Grantham and Stamford) has amassed £14,200.\n\nFormer Change UK then independent MP Sarah Wollaston joined the Lib Dems this week, but is highly unlikely to win her Totnes seat back. She would be due £14,200 in redundancy payments if she stands in the seat and loses.\n\nElsewhere, the MPs that make up the Independent Group for Change — the successor to Change UK, which performed dismally at the European Parliament election in May — are also facing possible defeat.\n\nFormer Labour MPs Mike Gapes (Ilford South) and Ann Coffey (Stockport) are in line for the maximum £31,500 loss-of-office payment if they stand in their existing seats and lose.\n\nChange leader and ex-Tory Anna Soubry (Broxtowe) has built up a £14,200 redundancy pot, while former Labour MPs Chris Leslie (Nottingham East) and Joan Ryan (Enfield) have £12,600 and £6,300 waiting in the IPSA bank.\n\n“In normal circumstances you would expect an independent candidate to get absolutely nowhere at a general election,” Twyman said. “Independents usually get about 100 votes and nobody pays very much attention to them.”\n\nBut, he added: “Obviously this is a different case because in a lot of instances what we are looking at are sitting MPs who are then running as independents or indeed as groups of independents or as minority parties and all that sort of thing.\n\n\"Even then you would expect them to have very little chance in normal circumstances, but these are far from normal circumstances.”\n\nThis article has been updated to reflect Sarah Wollaston's new party affiliation.\n\nThis article is part of POLITICO’s premium Brexit service for professionals: Brexit Pro. To test our our expert policy coverage of the implications and next steps per industry, email [email protected] for a complimentary trial."}, {"url": "https://transparencytaskforce.org/previous-events-2022/the-work-and-pensions-select-committees-report-on-pension-scams/", "page_content": "AGENDA\n\nInspired by the BBC Radio 4 programme, we have asked a selection of our attendees to spend just a minute sharing their thoughts on what has been covered during the symposium. But unlike the Radio 4 programme our speakers won’t be penalised for hesitation, repetition or deviation!\n\nWelcome to the symposium, introductions and initial exploration of the main issues; by\n\nMEET THE SPEAKERS\n\nBob Blackman MP\n\nChair, APPG on Pension Scams\n\nBob Blackman has been the Conservative Member of Parliament for Harrow East since the 2010 General Election.\n\nPrior to being elected to Parliament, Bob was employed by British Telecoms in various sales and management positions before becoming a sales tutor at the BT Training College. He was Regulatory Compliance Manager for BT from 1998 to 2010. Bob has also been employed in a variety of sales assignments for Unisys.\n\n_________________________________________________________________________________________________________________________________________\n\nSue Flood\n\nHead of Fundraising Strategy & Member of TTF’s Advisory Group\n\n\n\nSue Flood has worked in the Television Industry since 2001, starting out at Television Centre and progressing through a successful TV programme-making career that included various roles such as Researcher for Top of the Pops, Celebrity Guest Liaison, Location Sourcing, Production Budget, Sales and Promotions (including through BBC Worldwide with responsibility for selling all BBC Programmes to all 130 Global TV Stations Worldwide). More recently, Sue flood has become a key figure in helping to prevent people falling victim to pension fraudsters, having become a victim herself. Sue lost here entire pension fund; along with over 500 other victims of the Ark Pension Scandal. Her response was to set up a campaign group which she has tirelessly supported ever since. She is now also involved in supporting numerous other pension scam victims and pension scam support groups. She has unique insight and experience in the pensions scam prevention and support space and her relentless campaigning has led to interaction with the House of Commons, the House of Lords and the Financial Conduct Authority – watch this space. Sue is also highly supportive of the Transparency Task Force; for which she is a central figure in our Anti-Scams Special Interest Group, an Ambassador and a member of the Transparency Task Force Advisory Board.\n\n_________________________________________________________________________________________________________________________________________\n\nDiane Bentley\n\nDiane worked in the NHS for 30 years – as a registered children’s nurse and latterly as a Nurse and Project Manager at Rotherham District General Hospital. She moved to France in 2010 and now works within her husband’s business, plus manage their small camp site in summer.\n\nDiane has no background in finance and until now, no real interest. She naively believed that she should be able to trust the IFA that advised them about their pensions – an IFA from one of the world’s leading financial advisory organisations.\n\nHer aims and objectives are to ensure that other ex-pats are better informed than they were and less likely to make the same mistake. To reduce episodes of mis-selling and prevent misleading information being advertised at source.\n\n_________________________________________________________________________________________________________________________________________\n\nPrem Sikka\n\nMember of the House of Lord; Emeritus Professor of Accounting, University of Essex\n\nPrem Sikka is a member of the UK House of Lords, Professor of Accounting and Finance at the University of Sheffield and Emeritus Professor of Accounting at the University of Essex. Prem’s research on accounting, auditing, tax avoidance, tax havens, corruption, corporate governance, money laundering, insolvency and business affairs has been published in major international scholarly journals, books, newspapers and magazines.\n\nHe has appeared on domestic and international radio and television programmes to comment on business matters.\n\nHe has advised and given evidence to a number of UK and EU parliamentary committees. Most recently, he advised the UK House of Commons Work and Pensions Committee for its investigation into the collapse of BHS and Carillion.\n\nPrem is one of the few UK accounting academics to be honoured for his research by both the UK and the US academy. In 2006, he received the “Accounting Exemplar Award” from American Accounting Association (AAA). In 2014, he received the “Lifetime Achievement Award” from the British Accounting & Finance Association (BAFA). In 2008, he received “Working for Justice” Award from Tax Justice Network; “Lifetime Achievement Award” from PQ Magazine in 2009; and in 2017, the Abraham Briloff Award from The Accountant and The Accounting Bulletin for promoting business transparency and public accountability. In January 2019, Accountancy Age considered him to be one of 50 most influential people in UK accounting\n\n_________________________________________________________________________________________________________________________________________\n\nStephen Timms MP\n\nChair, Work and Pensions Select Committee\n\nThe Rt Hon Stephen Timms has been the Member of Parliament for East Ham from 1994 – 2019. He is also the Labour Party’s Faith Envoy. He was the Shadow Minister for Employment from 2010 until September 2015 and previously sat on the Exiting the European Union Select Committee.\n\nStephen entered Parliament in 1994 and held a number of ministerial posts under the previous Labour Government including Chief Secretary to the Treasury and Financial Secretary to the Treasury. Before entering Parliament, Stephen worked in the telecommunications industry for fifteen years, first for Logica and then for Ovum. He managed Ovum’s telecommunications reports business until his election in 1994. At the General Election in 2015, he was the only MP to poll more than 40,000 votes.\n\n_________________________________________________________________________________________________________________________________________\n\nMark Taber\n\nProfessional Fixed Income Investor, Campaigner, Researcher, Writer\n\nQualified Chartered Accountant turned consumer finance champion and campaigner, Mark has started and led several successful high profile campaign on behalf on tens of thousands of retail investors in recent years and is currently campaigning for the legal and regulatory changes and actions necessary to address the epidemic of pensions, savings and investment fraud.\n\n_________________________________________________________________________________________________________________________________________\n\nYvonne Fovargue MP\n\nChair, APPG on Debt & Personal Finance and APPG on Consumer Protection\n\nCutting her teeth as a Housing Officer on the Moss Side estate, Manchester in the early 1980s and later in her role as Chief Executive of St Helens Citizens Advice Bureau (1986-2010), Yvonne Fovargue has worked all her life to fight injustice and to speak up for those without a voice in society.\n\nBorn in Sale, Greater Manchester, Yvonne was educated locally before gaining a BA in English at Leeds University. She was an elected member of Warrington Council (2004-2010) and has served as a school governor and charity trustee.\n\nYvonne has held several shadow ministerial posts and her political interests include;\n\nWelfare\n\nDebt & Personal Finance (inc Payday loans)\n\nCredit Unions\n\nThe Advice Sector and Voluntary Sector\n\nYvonne is the Chair of the All Party Group (APPG) – Debt & Personal Finance and the APPG Consumer Protection.\n\nYvonne received the Citizens Advice Parliamentarian of the Year Award for 2011.\n\nYvonne is married with one adult daughter and lives in Wigan with her husband.\n\nShe is a member of MENSA, an avid reader of crime fiction and a fan of the music of David Bowie."}]}