{"Paul Elliott is a member of the Co-operative Party and the GMB union.": [{"url": "https://www.imperial.ac.uk/people/p.elliott", "page_content": "Summary\n\nProfessor Paul Elliott, CBE, FMedSci, FRCP, FPH trained in clinical medicine and epidemiology as a Wellcome Trust Clinical Fellow at St Mary's Hospital London and the London School of Hygiene & Tropical Medicine. He studied for his PhD in Epidemiology on the INTERSALT Study under the mentorship of Professor Geoffrey Rose. He remained at the London School working as a lecturer, and subsequently as senior lecturer and reader in epidemiology before being appointed as Head of the Environmental Epidemiology Unit at LSHTM 1990. In 1995 he was appointed to the Chair in Epidemiology and Public Health Medicine at Imperial College London. Since then he has managed the transformation of the Department of Public Health into the present Department of Epidemiology and Biostatistics in the School of Public Health. The Department has expanded significantly during recent years to encompass a wide-ranging programme of health research and extensive collaborations with national and international research groups, hosting both honorary and visiting staff. Paul Elliott is also Director of the MRC Centre for Environment and Health, which was launched in 2009 (as the MRC-PHE Centre for Environment and Health in collaboration with King's College London) and forms a major part of the Department. The UK Small Area Health Statistics Unit (SAHSU) is also based in the department. Paul Elliott is an honorary consultant in public health medicine in the Directorate of Primary Care and Public Health of the Imperial College Healthcare NHS Trust. His contribution to public health research, most recently in response to the COVID-19 pandemic as director of the REACT community surveillance study was recognised with the award of a CBE in the 2021 Queen's Birthday Honours List.\n\nCurrent and Recent Leadership roles :\n\nHead of Department of Epidemiology and Biostatistics\n\nDirector of MRC Centre for Environment and Health\n\nDirector of UK Small Area Health Statistics Unit (SAHSU)\n\nDirector of Information Governance, Imperial College Academic Health Sciences Centre\n\nDirector of NIHR HPRU in Chemical and Radiation Threats and Hazards\n\nEmeritus National Institute for Health Research Senior Investigator\n\nVisiting Professor Nanyang Technological University Lee Kong Chian School of Medicine (since 2016)\n\nACCEA platinum award holder (original award 2008)\n\nChair of REF2021 Sub-panel Unit of Assessment 2 for Public Health, Health Services and Primary Care (2018-2022)\n\nMember of Management Committee, Imperial College Biomedical Research Centre, Social, Genetic & Environment theme\n\nKey Research Interests:\n\nEnvironmental epidemiology and small area health statistics\n\nGenetic and molecular epidemiology, gene-environment interactions\n\nNutritional epidemiology - focus on diet, high blood pressure and cardiovascular and cardiometabolic diseases\n\nPopulation cohort studies and population biobanks\n\nEpidemiologic surveillance methodology\n\nNon-ionising radiation and health\n\nKey Research projects:\n\nResearch collaboration\n\nAIRLESS - Prof Rod Jones (Cambridge), Prof Tong Zhu (Peking University), Prof Junfeng Zhang (Duke University), Prof Meiping Zhao and Yangfeng Wu (Peking University)\n\nAIRWAVE - Prof Kate Hunt and Dr Evangelia Demou (University of Glasgow), Prof M van Tongeren (University of Manchester), Prof A McIntosh, Prof J Allardyce (University of Edinburgh), Prof R Lyons (Swansea University)\n\nCOMBI-BIO - D Herrington (Wake Forest University), P Greenland (Northwestern University), R Tracy (University of Vermont), E Evangelou (Ioannina University), C Gieger (Helmholtz Munich)\n\nDeveloping Tools of Population Health Improvement - Prof N Wareham (Cambridge)\n\nDPUK - Prof J Gallacher, University of Oxford\n\nHealth Data Research UK (HDR UK) - H Hemingway, Ruth Gilbert, Pia Hardelid (UCL), Andy Boyd (Bristol), Chris Dibben (Edinburgh), Rich Fry (Swansea)\n\nHealth Protection Research Units - S Bouffler, T Gant, L Ainsbury, K Broom, R Hayward, N Boubia (UKHSA), David Phillips (KCL), A Willis (MRC Toxicology Unit)\n\nInternational Consortium on Blood Pressure (ICBP) consortium M Caulfield, P Munroe, Helen Warren, Michael Barnes (QMUL), L Wain (Leicester University)\n\nINTERMAP International collaborative study of dietary macro-and micro-nutrients and blood pressure. L van Horn (Northwestern University), M Daviglus (University of Illinois), J Nicholson (Murdoch University), E Holmes (Edith Cowan University/Imperial College London)\n\nLOLIPOP (London Life Sciences Prospective Population Cohort) Study - PI: J Kooner (Imperial College London) and J Chambers (NTU Singapore/Imperial). http://www.lolipopstudy.org/\n\nNorthern Finland Birth Cohorts - PI: Prof M-R Jarvelin\n\nMRC Centre for Environment and Health - Dr J Samet (Denver University USA), Prof Chris Holmes (Turing Institute Oxford), Dr D Greenbaum (HEI), Prof S Richardson (MRC Biostatistics Unit Cambridge)\n\nREACT - Prof Lord A Darzi (Imperial College London and Imperial College NHS Healthcare Trust), Prof G Cooke, Prof W Barclay, Prof G Taylor, Prof S Riley, Prof H Ward, Dr C Atchison (Imperial College London)i\n\nREACT-GE - Prof Sir Mark Caulfield (Genomics England)\n\nREACT-LC - Prof Markus Ralser (UCL Crick Institute), Prof Thomas Hankemeier (Leiden University), Dr David Wraith (Birmingham University), Prof Claire Bambra & Prof Lynne Corner (University of Newcastle)\n\nTeaching and Supervision:\n\nJoint course coordinator (2018-) for Masters in Health Data Analytics and Machine Learning (led by Dr Marc Chadeau-Hyam). Examinations Board member\n\nMSc in Data Analytics and Machine Learning\n\nContributor to online Global Masters in Public Health launched autumn 2019 Global Masters in Public Health\n\nRecent lectures contributed to these courses and modules at Imperial:\n\nModule lectures for:\n\nBSc in Global Health\n\nMBBS Epidemiology in Practice\n\nMSc in Epidemiology Principles of Global Epidemiology module and Social Epidemiology module and Disease Masterclass\n\nMasters in Public Health: Nutrition module\n\nMasters in Preventive Cardiology: Nutrition and Weight Management module\n\nMReS in Clinical Research: Human Nutrition module\n\nMasters in Health Data Analytics and Machine Learning\n\nShort courses including : International Nutritional Epidemiology (course director: Prof Elio Riboli); Global Health (course director Dr Daniela Fecht); Stat XP (course director Dr Marc Chadeau-Hyam).\n\nPostgraduate PhD Student Supervision:\n\nAllison Gaines Integrating health and greenhouse gas emission metrics for packaged foods to promote sustainable diets. Joint supervision: Prof Bruce Neal and Prof Paraskevi Seferidi\n\nBarbara Bodinier Advanced statistical and computational approaches for exposome profiling and integration: Applications to cancer and environmental epidemiology. Joint supervision: Prof Marc Chadeau-Hyam and Prof Roel Vermeulen\n\nIshminder Kaur Kooner Investigating metabolic disturbances underlying the increased risk of cardiovascular disease in South Asians compared to Europeans in the UK. Joint supervision: Prof John Chambers\n\nMatthew Whitaker Advanced Statistical modelling of the COVID-19 Epidemic -Integrating ecological, behavioural, and molecular data to predict disease severity and dynamics. Joint supervision: Prof Marc Chadeau-Hyam, Helen Ward\n\nPost-doctoral fellows under supervision:\n\nAntonio Berlanga-Taylor, PhD MRC Intermediate Research Fellowship in Computational Biology award working on GWAS and post-GWAS characterisation of inflammation and disease: integrative analysis of genomes and phenomes in large epidemiological studies.\n\nOliver Robinson, PhD MRC Centre for Environment and Health Early Career Research Fellowship working on Assessing the impact of the early life exposome on child growth and adiposity. Primary supervisor Prof Paolo Vineis.\n\nAssessor for Wellcome Trust clinical PhD 4i programme at Imperial.\n\n\n\nWellcome Trust clinical PhD 4i programme\n\nMentoring: academic mentor for the Academy of Medical Sciences mentorship scheme since 2012. Currently providing advice to 4 mid-career clinical scientists."}, {"url": "https://icn22.org/bio/Paul_Elliott.html", "page_content": "Dr. Paul Elliott Imperial College London, UK\n\nPaul Elliott is Professor of Epidemiology and Public Health Medicine at Imperial College London, and Clinical Consultant in Public Health Medicine at the Imperial NHS Healthcare Trust. He is also Director of the UK Medical Research Council Centre for Environment and Health and Director of the National Institute of Health Research Health Protection Research Unit in Chemical & Environmental Threats and Hazards. He is a fellow of the UK Academy of Medical Sciences.\n\n\n\nProf Elliott has a career-long interest in nutritional epidemiologic research and did his PhD on the much-cited INTERSALT Study under Prof Geoffrey Rose. He has also collaborated closely with Prof Jeremiah Stamler and colleagues on the NIH-sponsored International Collaborative INTERMAP Study of dietary intake and blood pressure, which has a unique collection of clinical data and repeat 24-hour urinary samples from the USA, UK, China and Japan. Recent work has included research into how urinary metabolic phenotyping can be used as an alternative approach for obtaining information on dietary patterns. Posma et al Nature Food (2020), explored how investigation of nutriome-metabolome relationships can provide valuable insights into dietary intake and metabolism.||Prof Elliott is a founding member of the UK Biobank, a globally accessible resource containing in-depth genetic and health data from 500,000 participants for research into chronic diseases. He is also a member of the International Consortium on Blood Pressure and the International HundredK+ Cohorts Consortium. He has been a member of, and advisor to, numerous scientific advisory committees including the WHO Nutrition Guidance Expert Advisory Group Sub-Group on Diet and Health, and the UK Medical Research Council Multimorbidity Steering Group.\n\n\n\nDuring the past year, Prof Elliott established the REal time Assessment of Community Transmission (REACT) programme of home testing for COVID-19 to track the progress of SARS-CoV-2 viral infections across England. He is also PI of two recently launched studies: REACT-GE study “Multi-omics to identify biological pathways underlying severity of SARS-CoV-2 infection” working in collaboration with Genomics England; and the REACT-Long COVID (REACT-LC) study, which is recruiting participants from REACT for follow-up to investigate variations in health, symptoms and experiences and test samples for genetic and biological markers."}, {"url": "https://party.coop/about/frequently-asked-questions/", "page_content": "What is the Co-operative Party?\n\nThe Co-operative Party is a political party. Founded in 1917, we stand candidates at elections at all levels of government – including local councillors, metro mayors, MPs, Members of Scottish Parliament and Welsh Assembly Members. We have 26 MPs – making us the 4th largest party in Parliament. We also have over 1,300 councillors all across Britain.\n\nWait, you have 26 MPs? 1,300 councillors? How haven’t I heard of you?\n\nSince 1927, we have had an electoral agreement with Labour, meaning we only stand Labour and Co-operative joint candidates. Some ‘Co-operators’ you might recognise are Labour Party Chair Anneliese Dodds MP, Mayor of Greater Manchester Andy Burnham or the campaigning MP Stella Creasy.\n\nOur candidates come from across the broad church of the Labour Party, united by their belief in the co-operative values of sharing wealth and power. Co-op MPs have served on every Cabinet and Shadow Cabinet for a generation.\n\nIsn’t the Co-op a supermarket?\n\nWe aren’t the same as the Co-op supermarkets on your high street – but interestingly they played a role in starting the Party over a century ago and continue to support us. Like the Labour Party was founded by the trade union movement, we were founded in 1917 by the co-operative movement – who wanted representation and to defend itself against a government dominated by private business interests.\n\nCo-operative principles don't stop at the shopfront. As co-operators, we believe that the principles that lie behind successful co-operatives – democratic control by customers and workers, and a fair share of the wealth we create together – ought to extend to the wider economy and our society.\n\nSo what’s a co-operative then?\n\nA co-operative is a business – but instead of being owned by private shareholders it is owned and run jointly by its members. Members might be employees, customers, or members of the local community. Consumers owning the shops they buy from. Parents who run their own nursery. Fans who own their local football club. Each member, regardless of their stake, has an equal vote, and decisions are made democratically.\n\nWhat does the Co-operative Party stand for?\n\nWe believe in an economy where wealth and power are shared. This means a radical shake up of the way our economy functions and how it shares its rewards. We think that workers, not private shareholders, should own the businesses they work in – so that they have a vote on how it is run and a share in its profits.\n\nOur values and principles – like democracy, equality and community – shape our policies. Our policy platform includes:\n\nRebalance Britain's economy by doubling the size of the co-operative sector\n\nTackling the climate emergency with a Co-operative Green New Deal\n\nlntroducing a Right to Food so nobody goes hungry\n\nTaking utilities like water and energy into democratic public ownership\n\nEnsuring business pay their fair share of tax\n\nSupporting fan-owned football clubs\n\nExpanding community energy\n\nWhat if I’m already a supporter or member of the Labour Party? Why should I support the Co-operative Party as well?\n\nThis is an exciting time for the Co-operative Party. Over the past 18 months we elected a record number of Councillors, Mayors, MSs, MSPs and London Assembly members – winning seats from Chipping Norton to Preston and from the Welsh valleys to the Scottish Highlands.\n\nIn a time of increasing polarisation and ill-will in politics, co-operators are getting stuck in and transforming communities from the bottom up. If you’re looking for a radical, practical political movement with ideas and energy – that’s us. Working in partnership, the Co-op Party and the Labour Party are bringing together the best of our practical traditions of co-operation and trade unionism to change Britain for the better.\n\nAnd what if I don’t support the Labour Party at all?\n\nThe Co-operative Party is an independent political party with our own NEC, membership and policy platform. We’re a grassroots party that is making change on the ground all over the country, running successful campaigns on everything from safer shopworkers to food justice at local, regional and national levels.\n\nYou don’t need to support or be a member of the Labour Party to be a supporter or member of the Co-operative Party. However, because of our electoral agreement, you cannot join the Co-operative Party if you are a member of a political party other than the Labour Party or SDLP.\n\nOkay, I’m on board – how can I keep supporting your campaigns?\n\nThe best way of keeping up to date with our campaigns is to sign up to our email updates. You can do that here.\n\nIf you’d like to financially support our amazing campaigns by becoming a member, you can join now from just £2.25 a month. You’ll be part of a movement with historic roots, be able to join to local parties, and have an opportunity to shape the national agenda through campaigns and success in the wider Labour movement."}, {"url": "https://party.coop/2022/11/10/a-labour-government-will-unlock-the-full-potential-of-the-co-operative-sector/", "page_content": "Britain has a long tradition of fostering the principles of co-operation and mutual support, and the histories of the co-operative movement and the Labour Party in this country are closely entwined.\n\nThis relationship was institutionalised in 1927, when the Co-operative Party and the Labour Party entered an electoral agreement to stand joint candidates in elections. To this day, both parties continue to make the case for co-operatives, friendly and mutual societies, and as a long-standing Co-operative Party member I have always been proud to work with the Party to promote the co-operative businesses which are leading the way in improving equality and productivity at work.\n\nAs Shadow City Minister, I have had the privilege of meeting many of the inspiring people working in co-operatives and mutuals, such as building societies and credit unions, in the UK’s financial services sector. These British businesses play such an important role in supporting working people across the country to access affordable finance and gain greater control over their lives.\n\nBuilding societies provide people with a low risk, member focused banking alternative, and research has shown that trust in building societies is consistently high. Building societies are also typically well capitalised, making the sector more resilient to financial shocks and better able to lend and plan for the long-term.\n\nWhile credit unions serve an extraordinary 1.9 million members and 2.1 million depositors across the UK. There is currently around £1.7 billion in loans to credit union members, providing a crucial lifeline to the most financially vulnerable in society and preventing people from turning to loan-sharks and high interest loans.\n\nWith the right support, the co-operative sector has the potential to provide new ideas and the solutions to many of the crises and challenges we face as a country, such as the cost of living crisis or climate change.\n\nBut despite the distinctly British character and history of mutually and co-operatively owned companies, and the important role they play in promoting financial responsibility and resilience among their members, the sector’s needs have too often been ignored by this Conservative Government.\n\nWe have seen numerous building societies threatened with demutualisation in recent years, while the number of mutual credit unions has plummeted by more than 20% since 2016. Unlike the USA and many other European countries, the UK is also uniquely lacking in mutually or co-operatively owned regional banks, which could play a crucial in providing the affordable credit that small and medium sized businesses need to reach net zero.\n\nIt has been ordinary families who have paid the price, with many forced into the arms of unethical lenders. This is only going to get worse as the Conservative’s cost-of-living crisis deepens.\n\nThis is because credit unions, building societies and co-operative banks are working within an outdated regulatory regime – leaving them unable to compete on a level playing field with standard providers.\n\nIt’s time to radically reform the rules governing the sector to give greater flexibility and allow mutuals and co-operative financial services to grow.\n\nThe Financial Services and Markets Bill currently passing through the House of Commons does contain some welcome and long overdue provisions, such as enabling credit unions to offer a wider range of products. But the Treasury’s plans for the wider sector have lacked ambition.\n\nThat’s why I have tabled amendments to the Bill which would require the regulators – the FCA and PRA – to have an explicit remit to report on how they’ve considered specific business models, including mutuals and co-operatives, to ensure they’re given parity of esteem with standard providers.\n\nIf the Government is serious about supporting people to gain greater control of their personal finances, and supporting co-operatives to grow and reach their full potential, they should support my amendments. But so far, the Conservatives have rejected my attempts to engage with them on this important issue.\n\nThe Labour Party and the co-operative movement share a commitment to building a society in which power and wealth are fairly shared. That is why the Labour Party and the Co-operative Party has agreed an important ambition for government – we will double the size of the co-operative and mutual sector in the UK.\n\nOnly a Labour Government, made up of Labour and Co-operative Party MPs, can deliver on building the stronger, greener and fairer economy that Britain so desperately needs."}, {"url": "https://vmbuildingsociety.myvmgroup.com/leadership-team/paul-elliott/", "page_content": "Paul is a Results Focused member of the VM’s Executive Leadership team, having been promoted to the Group Leadership post in January 2022. Paul, who on January 1, 2023, was appointed CEO of VM Building Society, is unwavering in his commitment to transform lives. He had assumed the role of Deputy CEO – Building Society Operations in January 2021 and before that, had a successful stint as Vice President, Sales and Service.\n\nPaul joined VM in July 2016 having already accumulated more than 25 years of solid experience in the financial services industry both locally and regionally. He has vital expertise in corporate and commercial lending, retail banking, mortgage lending, bank assurance, investment sales and business development.\n\nPrior to joining VM, Paul was Senior Manager – Head of Personal Lending at Butterfield Bank; and before that, he served the same organisation as the Vice President – Retail Business Development Manager.\n\nPaul has held leadership roles in the Rotary Club both locally and internationally and is a past President of the Rotary Club of St George, Bermuda.\n\nHe holds a BSc from the University of the West Indies and an MBA from the University of London – Royal Holloway. Paul has also completed the Executive Leadership Programme at Harvard Business School"}, {"url": "https://www.thecaterer.com/archive/this-much-i-know-paul-elliott", "page_content": "Paul Elliott, executive chef of the Rag private members' club (also known as the Army and Navy Club) in London, tells Neil Gerrard the hard lessons he has learned as a chef, and why training is so important\n\nPeople often think that I am ex-military. I actually wanted to go into the Navy when I was young, so I did all my training courses and then the Falklands War happened. I asked myself, did I really want to be in the bottom of a boat cooking when it's struck by something.\n\nThen I thought I would join the RAF, but I was rejected becauseI had asthma as a child. I was fit and I used to do a lot of rugby, but because you have been classified as asthmatic, they won't touch you at all. It was upsetting, but then I had the chance to work as a chef. I wanted to go into the services as a youngster, but nowI have ended up in a services club.\n\nIt doesn't bother me that as a club chef I can't really get the same accolades and awards as restaurant chefs because I have had a varied career. I have managed a three-rosette restaurant and earned a Michelin Bib Gourmand in my own right. I have done development work and some of the products I developed are still on shelves today. Here, I get my personal satisfaction from the people we serve.\n\nIn my first session at the Ritz I was on the garnish section and I stuck a plastic ladle into the fryer. I got the bollocking of a lifetime and had to clean the fryer out, right in the middle of service. You learn quickly. I once worked at a place in Hertfordshire where on my first day I spent four hours cooking brunoise carrots. I thought I was the bee's knees because I was out of college and had done some time at the Ritz. The chef came to me and he said, \"What the bleep have you done?! What a load of bleep bleep bleep.\" He punched me to the floor then took four hours' worth of brunoise carrots and threw them in the bin.\n\nWe don't do that sort of beasting in our kitchens. We try to teach chefs the lessons I have learned the hard way. You need to explain to your younger chefs the reason for something before you can expect them to do it.\n\n\"Cook to your client base. If you ever want to do your own food, buy your own restaurant.\" That's what one of my old bosses used to tell me and it's very true. A lot of young chefs will use places that they work in as their own platform. But as you get older you will understand that you have to cook to your client base.\n\nHere at the Rag, they wantedto bring modern food into the club, which is sustainable with a good profit margin, but also to bring the glamour and the luxury of the Ritz.\n\nI would recommend this as a line of work for any chef so long as you get a good employer. Not all clubs are the same. The Army and Navy Club really sets itself out against all of them. The other clubs look at us for what we are doing, how the business runs and how the employer treats the employees.\n\nI have been here two years and I am still as passionate now about my food as I was when I won a Michelin Bib Gourmand. Having such a strong team and Tibor with me, we push all the time. We never stand still.\n\nPaul's CV\n\n2013 Executive chef, the Rag (Army and Navy Club), London\n\n2009 Personal chef to Damian Aspinall and family, Howletts Mansion, Kent\n\n2007 Head development chef, food development, Marks & Spencer, Waitrose and others\n\n2005 Head chef, Jackson Stops Inn, Rutland (gained and retained Michelin Bib Gourmand)\n\n2003 Sous chef, Fawsley Hall hotel, Daventry\n\n2001 Head chef, the Sun Inn hotel and restaurant, Northamptonshire (gained two AA rosettes)\n\n1992 Head chef, Brasted's restaurant, Norwich\n\n1990 Sous chef, the Barton Angler Lodge hotel, Norfolk\n\n1988 Demi chef de partie, the Ritz hotel, London\n\n1986 Commis chef, Le Talbooth restaurant and Dedham Vale hotel"}, {"url": "https://www.bach-cantatas.com/Bio/Elliott-Paul.htm", "page_content": "The English tenor, Paul Elliott, began his career as a choral singer at St. Paul’s Cathedral in London. There, as well as the King’s School Canterbury and Magdalen College at Oxford, he received his vocal training. His teachers were David Johnson and Peter Pears. The young tenor soon established himself as a leading representative in his field, above all as a soloist in oratorios and in the area of pre-classical music.\n\n\n\nPaul Elliott has worked together with, among others, the Academy of Ancient Music, the Deller Consort, the Early Music Consort of London, Pro Cantione Antiqua and the Consort of Musique. The artist was a founding member of the London Early Music Group and the Hilliard Ensemble. He has become especially well known for his interpretations of ancient music with ensembles such Musica Antiqua Cologne.\n\n\n\nPaul Elliott has participated in more than 90 recordings, including music from Perotin through Weber. Among the works recorded are George Frideric Handel’s Messiah with Ton Koopman and the Amsterdam Baroque Orchestra as well as Purcell’s King Arthur with John Eliot Gardiner. In addition, he has performed with many symphony orchestras, and also chamber ensembles such as the London Mozart Players or the English Chamber Orchestra. He participated in the television series ‘Music in Time’, moderated by James Galway, that is used today as a teaching tool for music history in many American Universities."}, {"url": "https://party.coop/faq-labour-and-the-co-operative-party/", "page_content": "The Co-operative Party is a political party. We stand candidates at elections at all levels of government – including local councillors, metro mayors, MPs, Members of Scottish Parliament and Welsh Assembly Members. We have 26 MPs – making us the 4th largest party in Parliament. We also have over 1,500 councillors all across Britain.\n\nSince 1927, we have had an electoral agreement with Labour, meaning we only stand Labour and Co-operative joint candidates. Some ‘Co-operators’ you might recognise are Andy Burnham, Stella Creasy, and Chair of the Labour Party Anneliese Dodds.\n\nOur candidates come from across the broad church of the Labour Party, united by their belief in the co-operative values of sharing wealth and power. We’re proud that 9 Co-operative MPs are in the current Shadow Cabinet, and indeed that Co-op MPs have served on every Cabinet and Shadow Cabinet for a generation."}, {"url": "https://www.theguardian.com/business/2015/apr/12/co-op-group-members-revolt-over-boardroom-elections", "page_content": "Tension between the Co-operative Group’s new management and its grassroots membership reignited at the weekend when members demanded the reinstatement of three candidates rejected by the group for election to the board.\n\n\n\nThe 100-strong national members’ council met on Friday and Saturday to discuss the board election and other matters before the Co-op’s annual meeting next month.\n\nAllan Leighton, the Co-op’s chairman, and his chief executive, Richard Pennycook, attended. The meeting was said to be professionally conducted but with feelings running high at times as members argued that the mutual group’s democratic principles were at risk.\n\n\n\nThe members’ main complaint was about the selection of candidates for election to the board. On Thursday, Co-op management announced three candidates for the three director posts: former Labour cabinet minister Hazel Blears; Ruth Spellman, chief executive of the Workers’ Educational Association; and Paul Chandler, former CEO of the fair trade group Traidcraft.\n\nThe group and its recruitment firm rejected three other candidates from a shortlist of six, including Dame Pauline Green, the president of the International Co-operative Alliance, and Nick Eyre, the Co-op’s former group secretary.\n\nOn Saturday, the council told the group to reinstate the three candidates and called for a fourth member-elected board director to ensure greater representation of members.\n\nA member of the council said: “Members have asked the board to go back to that decision to reinstate all six people on to the ballot paper to make sure members have the say they were meant to have,” said a member who attended the meeting.\n\n\n\nThe decision to present members with just three candidates for three positions was criticised last week by Sir Graham Melmoth, the respected former Co-op boss. Melmoth pointed out that vetoing Green and Eyre meant the board election would not be contested and claimed the three candidates selected had tenuous links to the Co-op. Each candidate needs a majority of votes to be elected.\n\nMembers also resisted an attempt by the Co-op Group to take a historic step back from direct involvement in politics, by calling on management to withdraw a motion concerning contributions to political parties.\n\nThat motion asks whether the Co-op should donate to parties, whether it should fund the Co-operative party and whether it should donate to various parties.\n\nFor the first time in almost a century, the board failed to back a members’ motion endorsing up to £1m of funding for the Co-operative party.\n\nThe members’ council argued that the board’s three questions were incoherent and unhelpful. They had previously called for continued funding to the Co-operative party – which is allied with Labour and had 30 MPs in the last parliament.\n\nThe council also asked the group to withdraw its revised description of the Co-op’s purpose in society: “Championing a better way of doing business, for you and your communities.” The council’s requests are not binding but the board has an obligation to try to reach agreement.\n\n\n\nLeighton, the former Royal Mail chairman who joined the Co-op in February, attended the meeting on Friday but was not there when the council made its demands. Pennycook and other officials were asked to leave the room while the council decided on its requests on Saturday.\n\n\n\nThe membership council will be revamped after the AGM. A transitional council was put in place to oversee governance changes recommended by Lord Myners, the former City minister, last year.\n\nVeteran Co-op members were unhappy about Myners’ changes but accepted most of them as a way to draw a line under the turmoil created by the near-implosion of the Co-op Bank in 2013.\n\n\n\nIn a statement, Leighton said: “The Co-operative Group operates under a unique governance model which ensures members have a direct say in the group’s future. After the reforms of last year, this remains a fledgling democracy and we are working to ensure it becomes firmly established so it can operate in the interests of all our members, colleagues and customers whilst avoiding the catastrophic events of our recent past.”"}, {"url": "https://www.policyforum.labour.org.uk/about/npf/chris-bain", "page_content": "Elected and party organisation\n\nCo-operative Party\n\nChris has been a member of the Labour Party and committed Trade Unionist for more than 35 years. He has served as an elected representative at Town, District and County councils, ending as a Cabinet Member at Warwickshire County Council. He was also the PPC in Teignbridge in 2001. Chris is currently a member of the National Policy Forum and is on the Regional Board in the West Midlands. He is chairing the Conference Arrangements Committee for the West Midlands Party Conference in 2020. He was the elected Chair of the Socialist Health Association in 2016/17, served as a Member of the Executive for 4 years, and remains a Member of the Central Council as he has been for more than 11 years. Chris is the elected West Midlands representative on the NEC of the Cooperative Party and is the Secretary of the Birmingham Solihull and Tamworth Branch of the Party. He is also Chief Executive of Healthwatch in Warwickshire, and is a Director on the Boards of two Housing Associations. He is a Trustee of the Equalities and Inclusion Partnership and is the elected Chair of the International Centre of Excellence for Community Schools."}]}