{"Moisés Kaufman was born on November 21, 1963.": [{"url": "https://www.britannica.com/biography/Moises-Kaufman", "page_content": "Moisés Kaufman, (born November 21, 1963, Caracas, Venezuela), Venezuelan-born playwright and director who is best known for perceptive and moving plays often rooted in issues of sexuality. He was cofounder in 1991 of Tectonic Theater Project, a company dedicated to examining the structure and language of theatre as well as addressing contemporary social issues.\n\nKaufman was born in Venezuela to Orthodox Jewish parents and was of Ukrainian and Romanian descent. He attended a yeshiva (Jewish religious school) as a child and was exposed to broader culture on family trips to New York City. A Caracas theatre festival he attended as a young teenager brought him exposure to the avant-garde plays of such artists as Peter Brook, Tadeusz Kantor, Pina Bausch, and Jerzy Grotowski, whom he cited as his early influences. While attending Metropolitan University in Caracas (B.A. in business administration, 1985), Kaufman joined a touring experimental theatre group as an actor. In 1987 he moved to New York City, where he studied theatre directing at the Tisch School of the Arts, New York University, meanwhile directing a variety of plays. It was at NYU that he honed his ideas about the purpose and most-effective means of presenting theatrical performances. Four years later Kaufman, together with his partner, Jeffrey LaHoste, established Tectonic Theater Project.\n\nKaufman’s writing debut, Gross Indecency: The Three Trials of Oscar Wilde (performed 1997–98, published 1997), illustrated his concerns as a writer-director. He was especially interested in what he termed “watershed historical moments,” events that reveal the foundations of society’s beliefs. A powerful and moving play that used actual trial testimony, Gross Indecency won an Outer Critics Circle Award for outstanding Off-Broadway play. Kaufman and his troupe then began work on The Laramie Project (performed 2000, published 2001, television movie 2002), interviewing numerous residents of the small Wyoming city in which gay college student Matthew Shepard had been brutally murdered. The play had particular resonance with Kaufman, who was gay, and it proved popular throughout the world.\n\nIn 2003 Kaufman directed a one-man show, Doug Wright’s I Am My Own Wife: Studies for a Play About Charlotte von Mahlsdorf (performed 2003–04), the story of a gay transvestite who survived life in Nazi Germany and Soviet East Berlin. It was critically acclaimed and resulted in a Tony Award nomination for Kaufman. In the next several years Kaufman directed a variety of plays, including Wilde’s Lady Windermere’s Fan and Shakespeare’s Macbeth. He also directed his own play 33 Variations (first performed 2007), starring Jane Fonda as a musicologist obsessed with Beethoven’s Diabelli Variations, and received another Tony nomination. In 2009 Kaufman and other Tectonic members arranged for 150 simultaneous readings in theatres across the globe of a sequel, The Laramie Project: Ten Years Later. He also directed Rajiv Joseph’s Bengal Tiger at the Baghdad Zoo (performed 2011), starring Robin Williams as the title character; a 2012–13 revival of Ruth and Augustus Goetz’s The Heiress, a play based on Henry James’s novel Washington Square; and a revival of Torch Song (2018–19), which was written by Harvey Fierstein. In 2016 Kaufman received the National Medal of Arts."}, {"url": "https://www.latimes.com/entertainment-arts/story/2022-08-09/review-moises-kaufman-here-there-are-blueberries-play", "page_content": "“Here There Are Blueberries,” a play conceived and directed by Moisés Kaufman, tells the true story of an album of photographs that was sent to the U.S. Holocaust Memorial Museum in 2007.\n\nThe sender, a retired United States Army intelligence officer, found the album shortly after the war when he was living in Frankfurt, Germany. Nearing the end of his life, he believed the collection of photos from the Auschwitz concentration camp would be of historical interest. He was right, though it took some impressive detective work to reveal the value of what had been gathering dust in his archives for more than 60 years.\n\nThe play, which is having its world premiere at La Jolla Playhouse in a co-production with Tectonic Theatre Project, meditates on the many aspects of this disturbingly resonant story. Kaufman, the artistic director of Tectonic, and Amanda Gronich, a charter member of the company, co-wrote the script, which hews to the factual record while taking artistic liberties for the sake of dramatic clarity, economy and force.\n\nThe authors worked closely together on “The Laramie Project,” the groundbreaking nonfiction drama about the 1998 murder of gay University of Wyoming student Matthew Shepard. In “Here There Are Blueberries,” they tackle with courage and compassion the nature of murderous complicity on an unfathomable scale.\n\nThe story of the album is told from the vantage of the researchers who are piecing together information about the figures in the photos. The images, which are integral to the play, received so much attention when the news broke of their discovery that the museum’s website crashed.\n\nAdvertisement\n\nRebecca Erbelding (Elizabeth Stahlmann), an archivist at the museum, is initially skeptical of the claim that the photos are from Auschwitz when she’s first contacted by the donor. But after the album arrives, her attention is seized by a photo of Josef Mengele, one of the most depraved doctors of the Third Reich.\n\nPreviously, she explains, there had been no photographic evidence of Mengele at Auschwitz. Sensing the import of what was sent to her, she consults with a senior colleague.\n\nA closer look at the photos by Judy Cohen (Rosina Reynolds), the director of the museum’s photographic collection, reveals a central figure in upholding the Nazi regime, Rudolf Höss. As Judy explains, “He built Auschwitz, and he ran it for years. He’s responsible for everything we think of as the camp: the barracks, the guard towers, the electrified fences, the extermination infrastructure ... the whole organization.”\n\nThe album contains 116 photos with captions in German. The figures in the photos aren’t the prisoners but the people who ran the camp. Ordinary Germans, bonding together on the job, taking part in official ceremonies and enjoying recreational activities. The pictures provide a haunting illustration of what the philosopher Hannah Arendt famously called “the banality of evil.”\n\nPhotographic analysis augmented by ingenious research leads to the conclusion that the album belonged to Karl Höcker (Scott Barrow). A former bank teller, he rose to become a top administrator of Auschwitz — motivated, it seems, not by ideology but by the career opportunism of a petty bureaucrat.\n\nKaufman and Gronich deliberate on the many historical and moral questions that the real-life Rebecca and her colleagues grappled with as they closely studied the album. The more information they uncover, the more they struggle to understand the reality before them.\n\nThere is particular interest in a lodge that was built to provide a place for Nazi officers to vacation with their families to relieve job stress. This rustic leisure stands in stark contrast to the grim reality of the crematoria blowing smoke a few miles away.\n\nA photo of women who worked in the camp as telephone, telegraph and radio operators captures them doing calisthenics with a look of relaxed bonhomie. Another shows them on a bridge in uniform exuberantly gathered as a man plays the accordion.\n\nWhat did these people know about their place of employment? Specialization of labor allowed the workers to deny any knowledge of what was happening at Auschwitz. But as the researchers reveal, their ignorance was a convenient ruse.\n\nA photo of Höcker at the lodge serving blueberries to female personnel (the caption provides the play’s title) is all the more horrifying for seeming so serene. The smiling faces suggest a utopia, but these are the managers and custodians of a living hell.\n\nThe United States Holocaust Memorial Museum was set up to remember the victims of the Nazi genocide. The staff is therefore forced to examine whether it is right to devote space to a collection of photos of perpetrators.\n\nHow should history be recalled? Should those who enabled atrocities have their names and faces blotted from the record? Ultimately, the museum staff deems it necessary to call attention to the way everyday citizens were corrupted by ideology, self-interest and a conspiracy of lies. How else can humanity be prevented from falling again into darkness?\n\n“Here There Are Blueberries” extends itself perhaps too far in following the stories of descendants of Nazis coming to terms with their heritage. The structure of the play assumes the elasticity of a PowerPoint presentation, scattering focus.\n\nAlthough this is not a verbatim drama, interviews are the source of the dramatic material. The editing hasn’t yet reached its optimal form. But the strength of the work is less in the dramatic writing than in the creation of a contemplative theatrical space.\n\nKaufman, who’s the son of a Holocaust survivor, infuses his company with a quiet moral purpose that had me shedding tears for much of the production’s 90-minute running time. An ensemble of eight, with each actor taking on multiple roles, majestically balances thought and feeling.\n\nPhotographs are projected onto Derek McLane’s set, which moves from the museum’s research office into a realm of fluid memory. The pictures are brought to life aurally as well as visually, with cast members contributing to the soundscape. But what is most powerful is the way silence is interwoven. Kaufman conducts this impeccable production with symphonic subtlety.\n\nThe sincerity of this collective effort powerfully communicates the grave significance of this trove of artifacts almost lost to time. History is once again knocking. Will we unstop our ears and learn from the mistakes of the past?"}, {"url": "https://www.celebsages.com/moises-kaufman/", "page_content": "Birth Name: Moises Kaufman Occupation: Playwright Born In: Venezuela Birthdate: November 21, 1963 Age: 59 years old (as of 2023) Ethnicity: Unknown Nationality: Venezuelan Sexuality: N/A\n\nMoises Kaufman was born on the 21st of November, 1963. He is famous for being a Playwright. He directed episodes of The L Word, starring Mia Kirshner. Moises Kaufman’s age is 59. Founder of the Tectonic Theater Project who wrote the plays The Laramie Project and Gross Indecency: The Three Trials of Oscar Wilde. The 59-year-old playwright was born in Venezuela. He was born and raised in Caracas, Venezuela and moved to New York City in 1987. He received a Tony Award nomination for Best Direction of a Play for his 2004 production of I Am My Own Wife.\n\nCountdown to Moises’s next birthday.\n\nMoises Kaufman is a Scorpio and his 60th birthday is in .\n\nJUMP TO: Moises Kaufman’s biography , facts , family , personal life , zodiac , videos , net worth , and popularity .\n\nChildhood\n\nMoises Kaufman was born in 1960s. The 1960s were an era of protests. The decade was dominated by the Vietnam War, Civil Rights Protests, Cuban Missile Crisis, antiwar protests and saw the assassinations of US President John F. Kennedy and Martin Luther King Jr. It also marked the first man landed on the moon. Discover what happened on this day.\n\nMoises Kaufman is part of the Baby boomers generation. Also known as \"boomers\", are the result of the end of World War II, when birth rates across the world spiked. They are associated with a rejection of traditional values. These hippie kids protested against the Vietnam War and participated in the civil rights movement.\n\nYou can also find out who is Moises Kaufman dating now and celebrity dating histories at CelebsCouples.\n\nWhile we don't know Moises Kaufman birth time, but we do know his mother gave birth to his on a Thursday. People born on a Thursday are naturally well-meaning and open. Luck is on their side.\n\n[fetch instagram=”” display=”posts” ]\n\nThe 59-year-old Venezuelan was born in the Baby Boomers Generation and the Year of the Rabbit\n\nEducation\n\nThe education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nMoises Kaufman’s mother’s name is unknown at this time and his father’s name is under review. We will continue to update information on Moises Kaufman’s parents.\n\nPersonal Life\n\nLike many famous people and celebrities, Moises Kaufman keeps his personal life private. Once more details are available on who he is dating, we will update this section.\n\nFast Facts\n\nREAL NAME: Moises Kaufman NICKNAME: Moises\n\nMARTIAL STATUS: Pending RELIGION: Unknown TATTOOS: N/A AGE GENERATION: Baby Boomers Generation BIRTH SIGN: Scorpio BIRTH DAY: Thursday DAYS SINCE BIRTH:\n\nNet Worth\n\nThe 59-year-old Venezuelan playwright has done well thus far. Majority of Moises’s money comes from being a playwright. CelebsMoney has recently updated Moises Kaufman’s net worth .\n\nVideos\n\nHoroscope\n\nZodiac Sign: Moises Kaufman is a Scorpio. People of this zodiac sign like truth, being right, longtime friends, teasing, and dislike dishonesty, revealing secrets, passive people. The strengths of this sign are being resourceful, brave, passionate, a true friend, while weaknesses can be distrusting, jealous, secretive and violent. The greatest overall compatibility with Scorpio is Taurus and Cancer.\n\nChinese Zodiac: Moises Kaufman was born in the Year of the Rabbit. People born under this sign are popular because they're sincere and avoid conflict. Though they're sensitive, they also hesitate, which makes them lose on chances.\n\n\n\n\n\nRuling Planet: Moises Kaufman has a ruling planet of Pluto and has a ruling planet of Pluto. Back the early 2,000 B.C. the outer planets, Uranus and Neptune were not yet discovered, since the telescope had not yet been invented. Astrologers and astronomers could only work with planets visible to the eye.\n\n[fetch instagram=”” display=”posts” show=”2″ ]\n\nMoises Kaufman’s birth sign is Scorpio and he has a ruling planet of Pluto.\n\nDon’t miss\n\n– Who’s the richest Playwright in the world?\n\n– Moises Kaufman Net Worth Stats\n\n– When is Moises Kaufman’s birthday?\n\nAssociated with\n\nFans also viewed"}, {"url": "https://catalogue.library.ulster.ac.uk/items/1302925?query=area&resultsUri=items%3Fquery%3Darea%26offset%3D10290", "page_content": "The Laramie Project\n\nAct I\n\nMoment: A Definition\n\nnarrator: On November 14, 1998, the members of Tectonic Theater Project traveled to Laramie, Wyoming, and conducted interviews with the people of the town. During the next year, we would return to Laramie several times and conduct over two hundred interviews. The play you are about to see is edited from those interviews, as well as from journal entries by members of the company and other found texts. Company member Greg Pierotti:\n\ngreg pierotti: My first interview was with Detective Sergeant Hing of the Laramie Police Department. At the start of the interview he was sitting behind his desk, sitting something like this (he transforms into Sergeant Hing):\n\nI was born and raised here.\n\nMy family is, uh, third generation.\n\nMy grandparents moved here in the early nineteen hundreds.\n\nWe've had basically three, well, my daughter makes it fourth generation.\n\nQuite a while. . . . It's a good place to live. Good people--lots of space.\n\nNow, all the towns in southern Wyoming are laid out and spaced because of the railroad came through.\n\nIt was how far they could go before having to refuel and rewater.\n\nAnd, uh, Laramie was a major stopping point.\n\nThat's why the towns are spaced so far apart.\n\nWe're one of the largest states in the country, and the least populated.\n\nrebecca hilliker: There's so much space between people and towns here, so much time for reflection.\n\nnarrator: Rebecca Hilliker, head of the theater department at the University of Wyoming:\n\nrebecca hilliker: You have an opportunity to be happy in your life here. I found that people here were nicer than in the Midwest, where I used to teach, because they were happy. They were glad the sun was shining. And it shines a lot here.\n\nsergeant hing: What you have is, you have your old-time traditional-type ranchers, they've been here forever--Laramie's been the hub of where they come for their supplies and stuff like that.\n\neileen engen: Stewardship is one thing all our ancestors taught us.\n\nnarrator: Eileen Engen, rancher:\n\neileen engen: If you don't take care of the land, then you ruin it and you lose your living. So you first of all have to take care of your land and do everything you can to improve it.\n\ndoc o'connor: I love it here.\n\nnarrator: Doc O'Connor, limousine driver:\n\ndoc o'connor: You couldn't put me back in that mess out there back east. Best thing about it is the climate. The cold, the wind. They say the Wyoming wind'll drive a man insane. But you know what? It don't bother me. Well, some of the times it bothers me. But most of the time it don't.\n\nsergeant hing: And then you got, uh, the university population.\n\nphilip dubois: I moved here after living in a couple of big cities.\n\nnarrator: Philip Dubois, president of the University of Wyoming:\n\nphilip dubois: I loved it there. But you'd have to be out of your mind to let your kids out after dark. And here, in the summertime, my kids play out at night till eleven and I don't think twice about it.\n\nsergeant hing: And then you have the people who live in Laramie, basically.\n\nzackie salmon: I moved here from rural Texas.\n\nnarrator: Zackie Salmon, Laramie resident:\n\nzackie salmon: Now, in Laramie, if you don't know a person, you will definitely know someone they know. So it can only be one degree removed at most. And for me--I love it! I mean, I love to go to the grocery store 'cause I get to visit with four or five or six people every time I go. And I don't really mind people knowing my business--'cause what's my business? I mean, my business is basically good.\n\ndoc o'connor: I like the trains, too. They don't bother me. Well, some of the times they bother me, but most times they don't. Even though one goes by every thirteen minutes out where I live. . . .\n\nnarrator: Doc actually lives up in Bossler. But everybody in Laramie knows him. He's also not really a doctor.\n\ndoc o'connor: They used to carry cattle . . . them trains. Now all they carry is diapers and cars.\n\napril silva: I grew up in Cody, Wyoming.\n\nnarrator: April Silva, university student:\n\napril silva: Laramie is better than where I grew up. I'll give it that.\n\nsergeant hing: It's a good place to live. Good people, lots of space. Now, when the incident happened with that boy, a lot of press people came here. And one time some of them followed me out to the crime scene. And uh, well, it was a beautiful day, absolutely gorgeous day, real clear and crisp and the sky was that blue that, uh . . . you know, you'll never be able to paint, it's just sky blue--it's just gorgeous. And the mountains in the background and a little snow on 'em, and this one reporter, uh, lady . . . person, that was out there, she said . . .\n\nreporter: Well, who found the boy, who was out here anyway?\n\nsergeant hing: And I said, \"Well, this is a really popular area for people to run, and mountain biking's really big out here, horseback riding, it's just, well, it's close to town.\" And she looked at me and she said:\n\nreporter: Who in the hell would want to run out here?\n\nsergeant hing: And I'm thinking, \"Lady, you're just missing the point.\" You know, all you got to do is turn around, see the mountains, smell the air, listen to the birds, just take in what's around you. And they were just--nothing but the story. I didn't feel judged, I felt that they were stupid. They're, they're missing the point--they're just missing the whole point.\n\njedadiah schultz: It's hard to talk about Laramie now, to tell you what Laramie is, for us.\n\nnarrator: Jedadiah Schultz:\n\njedadiah schultz: If you would have asked me before, I would have told you Laramie is a beautiful town, secluded enough that you can have your own identity. . . . A town with a strong sense of community--everyone knows everyone. . . . A town with a personality that most larger cities are stripped of. Now, after Matthew, I would say that Laramie is a town defined by an accident, a crime. We've become Waco, we've become Jasper. We're a noun, a definition, a sign. We may be able to get rid of that . . . but it will sure take a while.\n\nMoment: Journal Entries\n\nnarrator: Journal entries--members of the company. Andy Paris:\n\nandy paris: Mois?s called saying he had an idea for his next theater project. But there was a somberness to his voice, so I asked what it was all about and he told me he wanted to do a piece about what's happening in Wyoming.\n\nnarrator: Stephen Belber:\n\nstephen belber: Leigh told me the company was thinking of going out to Laramie to conduct interviews and that they wanted me to come. But I'm hesitant. I have no real interest in prying into a town's unraveling.\n\nnarrator: Amanda Gronich:\n\namanda gronich: I've never done anything like this in my life. How do you get people to talk to you? What do you ask?\n\nnarrator: Mois?s Kaufman:\n\nmois?s kaufman: The company has agreed that we should go to Laramie for a week and interview people.\n\nAm a bit afraid about taking ten people in a trip of this nature. Must make some safety rules. No one works alone. Everyone carries cell phones. Have made some preliminary contacts with Rebecca Hilliker, head of the theater department at the University of Wyoming. She is hosting a party for us our first night in Laramie and has promised to introduce us to possible interviewees.\n\nMoment: Rebecca Hilliker\n\nrebecca hilliker: I must tell you that when I first heard that you were thinking of coming here, when you first called me, I wanted to say, You've just kicked me in the stomach. Why are you doing this to me?\n\nBut then I thought, That's stupid, you're not doing this to me. And, more important, I thought about it and decided that we've had so much negative closure on this whole thing. And the students really need to talk. When this happened they started talking about it, and then the media descended and all dialogue stopped.\n\nYou know, I really love my students because they are free thinkers. And you may not like what they have to say, and you may not like their opinions, because they can be very redneck, but they are honest and they're truthful--so there's an excitement here, there's a dynamic here with my students that I never had when I was in the Midwest or in North Dakota, because there, there was so much Puritanism that dictated how people looked at the world that a lot of times they didn't have an opinion, you couldn't get them to express an opinion. And, quite honestly, I'd rather have opinions that I don't like--and have that dynamic in education.\n\nThere's a student I think you should talk to. His name is Jedadiah Schultz.\n\nMoment: Angels in America\n\njedadiah schultz: I've lived in Wyoming my whole life. The family has been in Wyoming, well . . . for generations. Now when it came time to go to college, my parents can't--couldn't afford to send me to college. I wanted to study theater. And I knew that if I was going to go to college I was going to have to get on a scholarship--and so, uh, they have this competition each year, this Wyoming state high school competition. And I knew that if I didn't take first place in, uh, duets that I wasn't gonna get a scholarship. So I went to the theater department of the university looking for good scenes, and I asked one of the professors--I was like, \"I need--I need a killer scene,\" and he was like, \"Here you go, this is it.\" And it was from Angels in America.\n\nSo I read it and I knew that I could win best scene if I did a good enough job.\n\nAnd when the time came I told my mom and dad so that they would come to the competition. Now you have to understand, my parents go to everything--every ball game, every hockey game--everything I've ever done.\n\nAnd they brought me into their room and told me that if I did that scene, that they would not come to see me in the competition. Because they believed that it is wrong--that homosexuality is wrong--they felt that strongly about it that they didn't want to come see their son do probably the most important thing he'd done to that point in his life. And I didn't know what to do.\n\nI had never, ever gone against my parents' wishes. So I was kind of worried about it. But I decided to do it.\n\nAnd all I can remember about the competition is that when we were done, me and my scene partner, we came up to each other and we shook hands and there was a standing ovation.\n\nOh, man, it was amazing! And we took first place and we won. And that's how come I can afford to be here at the university, because of that scene. It was one of the best moments of my life. And my parents weren't there. And to this day, that was the one thing that my parents didn't see me do.\n\nAnd thinking back on it, I think, why did I do it? Why did I oppose my parents? 'Cause I'm not gay. So why did I do it? And I guess the only honest answer I can give is that, well (he chuckles) I wanted to win. It was such a good scene; it was like the best scene!\n\nDo you know Mr. Kushner? Maybe you can tell him.\n\nMoment: Journal Entries\n\nnarrator: Company member Greg Pierotti:\n\ngreg pierotti: We arrived today in the Denver Airport and drove to Laramie. The moment we crossed the Wyoming border I swear I saw a herd of buffalo. Also, I thought it was strange that the Wyoming sign said: wyoming--like no place on earth instead of wyoming--like no place else on earth.\n\nnarrator: Company member Leigh Fondakowski:\n\nleigh fondakowski: I stopped at a local inn for a bite to eat. And my waitress said to me:\n\nwaitress: Hi, my name is Debbie. I was born in nineteen fifty-four and Debbie Reynolds was big then, so, yes, there are a lot of us around, but I promise that I won't slap you if you leave your elbows on the table.\n\nmois?s kaufman: Today Leigh tried to explain to me to no avail what chicken fried steak was.\n\nwaitress: Now, are you from Wyoming? Or are you just passing through?\n\nleigh fondakowski: We're just passing through.\n\nnarrator: Company member Barbara Pitts:\n\nbarbara pitts: We arrived in Laramie tonight. Just past the welcome to laramie sign--population 26,687--the first thing to greet us was Wal-Mart. In the dark, we could be on any main drag in America--fast-food chains, gas stations. But as we drove into the downtown area by the railroad tracks, the buildings still look like a turn-of-the-century western town. Oh, and as we passed the University Inn, on the sign where amenities such as heated pool or cable TV are usually touted, it said: hate is not a laramie value.\n\nnarrator: Greg Pierotti:\n\nMoment: Alison and Marge\n\ngreg pierotti: I met today with two longtime Laramie residents, Alison Mears and Marge Murray, two social service workers who taught me a thing or two.\n\nalison mears: Well, what Laramie used to be like when Marge was growing up, well, it was mostly rural.\n\nmarge murray: Yeah, it was. I enjoyed it, you know. My kids all had horses.\n\nalison mears: Well, there was more land, I mean, you could keep your pet cow. Your horse. Your little chickens. You know, just have your little bit of acreage.\n\nmarge murray: Yeah, I could run around the house in my all togethers, do the housework while the kids were in school. And nobody could see me. And if they got that close . . .\n\nalison mears: Well, then that's their problem.\n\nmarge murray: Yeah.\n\ngreg pierotti: I just want to make sure I got the expression right: in your all togethers?\n\nmarge murray: Well, yeah, honey, why wear clothes?\n\nalison mears: Now, how's he gonna use that in his play?\n\ngreg pierotti: So this was a big ranching town?\n\nalison mears: Oh, not just ranching, this was a big railroad town at one time. Before they moved everything to Cheyenne and Green River and Omaha. So now, well, it's just a drive-through spot for the railroad--because even, what was it, in the fifties? Well, they had one big roundhouse, and they had such a shop they could build a complete engine.\n\nmarge murray: They did, my mom worked there.\n\ngreg pierotti: Your mom worked in a roundhouse?\n\nmarge murray: Yep. She washed engines. Her name was Minnie. We used to, you know, sing that song for her, you know that song.\n\ngreg pierotti: What song?\n\nmarge murray: \"Run for the roundhouse, Minnie, they can't corner you there.\"\n\n(They crack up.)\n\nalison mears: But I'll tell you, Wyoming is bad in terms of jobs. I mean, the university has the big high whoop-de-do jobs. But Wyoming, unless you're a professional, well, the bulk of the people are working minimum-wage jobs."}, {"url": "https://www.msnbc.com/msnbc/america-the-day-msna216146", "page_content": "Like a lot of Americans, I remember November 22, 1963, but not November 21. If, as I was, you were very young—I was two months shy of my sixth birthday—there’s very little of your life before that date that you can remember. Of John F. Kennedy, I knew only two things when our kindergarten teacher told us, on the playground of Theodore Roosevelt Elementary School in New Rochelle, New York, that he’d been killed. He was the president, and his job was to send John Glenn into outer space. Now he wouldn’t.\n\nIf you were older, it’s still doubtful that whatever occupied you on the day before, or the day before that, was anywhere near so memorable as Nov. 22. And most people alive today have no memory of the run-up to Kennedy’s assassination in Dallas, for an even simpler reason: they had not yet been born.\n\nWhat was America like in 1963, before Lee Harvey Oswald and Jack Ruby became household names?\n\nThe price of a stamp, at five cents, was lower, after inflation, than it is today; the minimum wage, at $1.25 an hour, was higher.\n\nMedian family income was about $6,200, but for “nonwhite” (mainly black) families, it was $3,465. The black-white income gap is narrower today, but only by about six percentage points.\n\nMartin Luther King had given his “I Have A Dream” speech three months earlier; all the major civil rights laws had yet to be enacted.\n\nNew York City still had six daily newspapers. A seventh, the Hearst-owned Daily Mirror, had died the month before, the victim of a lengthy newspaper strike whose aftereffects would, over the next four years, kill off three more.\n\nDiane Sawyer, age 17, was America’s reigning Junior Miss--a competition since renamed “Distinguished Young Women,” probably in deference to the social movement that Betty Friedan helped create that same year by publishing \"The Feminine Mystique.\"\n\nRonald Reagan--having recently ended an eight-year stint with General Electric, for whom he’d been a TV host and speechmaker—accepted his final film role, that of mob boss Jack Browning in \"The Killers.\" It would be the only movie Reagan made after switching his registration from Democrat to Republican, and (coincidentally) the only one in which he played the bad guy.\n\nThe U.S. media was starting to take note of the Beatles phenomenon in Britain, though mainly to sneer. “The London Times has carried the sobering report that the Beatles may bring their Mersey sound to the United States,” Edwin Newman reported November 18 on NBC’s Huntley-Brinkley Report, “to which it may be rejoined, ‘Show us no Mersey.’”\n\nChronologically, 1963 marked a rough midpoint between the death of the last surviving veteran of the Civil War (1956) and the first moon landing (1969); between Hitler’s defeat (1945) and the first clinical recognition of the AIDS epidemic (1981); and between the Paris premiere of Stravinsky’s \"Rite of Spring\" (1913) and the final episode of \"Breaking Bad\" (2013).\n\nOn November 21, 1963, Robert Stroud, the “Birdman of Alcatraz” whose life was romanticized in a 1962 movie starring Burt Lancaster—Stroud’s ornithological enthusiasms did not, in fact, gentle his violent impulses—died at 73. (Stroud was never permitted to see the film.) That same day saw the births of the actress Nicollette Sheridan (\"The Sure Thing,\" \"Desperate Housewives\"), the playwright-director Moises Kaufman (\"The Laramie Project\"), and Tony McConkey, a conservative Republican member of Maryland’s House of Delegates.\n\nIt’s November 21, and you want to go to the movies. What’s playing? \"Under The Yum Yum Tree,\" \"The Incredible Journey,\" \"It’s A Mad, Mad, Mad, Mad World,\" John Wayne in \"McClintock!,\" Vincent Price in \"Twice-Told Tales,\" and James Stewart and Sandra Dee in \"Take Her, She’s Mine\" (remembered today solely because the Dee character was loosely based on the teenage Nora Ephron; her parents wrote it).\n\nHmm. Maybe you’ll stay in.\n\nIt’s Thursday, right? ABC’s got \"Donna Reed\" and \"My Three Sons,\" CBS has \"Rawhide,\" and NBC has something called \"Temple Houston\" (Perry Mason-goes-west drama starring Jeffrey Hunter; lasted only one season).\n\nOr maybe you’ll just catch up on your reading. Mary McCarthy’s racy \"The Group\" tops The New York Times best-seller list for fiction. The non-fiction list is headed by \"JFK: The Man and the Myth,\" a hatchet job by Victor Lasky, followed (somewhat ominously) by \"The American Way of Death,\" Jessica Mitford’s expose of the funeral industry, at number two.\n\nKennedy was on his way to Dallas, but on November 21 Richard Nixon was already there, to attend a meeting of the American Bottlers of Carbonated Beverages. After losing the 1960 presidential race to Kennedy, Nixon had lost the 1962 California gubernatorial race to Pat Brown. Now he was a partner in the New York law firm of Nixon, Mudge, Rose, Guthrie, Alexander, & Mitchell, where Nixon’s friend Donald Kendall, president of Pepsi, was a client. Also in attendance at the bottlers meeting was the actress Joan Crawford, widow of Pepsi’s former chairman.\n\nOn the morning of November 21, Nixon met with reporters at the Baker Hotel in downtown Dallas. He noted that Kennedy had lost support in Texas, which was true; indeed, that was Kennedy’s main reason for visiting the state with his Texan vice-president, Lyndon Johnson.\n\n“We were going to do something about Castro in Cuba,” Nixon told the reporters. “We were going to do something about American prestige abroad, and also about sort-of-permanent unemployment” (then 5.7%). “We find that on all of these issues there’s been no action.” Nixon added that Johnson’s “stock is not as high in Texas, at least from what I’ve seen, as it was. In 1960, Lyndon was a help. In 1964 he might not be.” A Dallas News headline the next day blared, “Nixon Predicts JFK May Drop Johnson.”\n\nThere was, in fact, much gossip about whether Kennedy might dump Johnson from the 1964 ticket, and Kennedy’s secretary, Evelyn Lincoln, later recalled that before he left for Dallas Kennedy told her he might replace Johnson with North Carolina Governor Terry Sanford. Of particular concern was the ethics investigation of Bobby Baker, Secretary of the Senate and a Johnson protégé when Johnson was Senate majority leader. Outrageous stories alleging that Baker paid bribes and hosted debauched parties in which naked young prostitutes poured champagne over each other were embarrassing the Kennedy administration, and the investigation was starting to suggest Johnson knew about them.\n\nAn article published in Life magazine on Nov. 18 quoted one anonymous source calling Baker (who eventually did jail time for larceny, fraud and tax evasion) “Lyndon’s bluntest instrument in running the show.” Two former Life magazine editors later told Johnson biographer Robert Caro that the magazine was preparing a more ambitious investigation into Johnson’s own extensive history of ethically questionable financial dealings. Life would scrub the project after November 22, first because the assassination was the only story, and later because it wanted to give the new president a chance to succeed.\n\nAnother journalistic casualty of the assassination was a special CIA issue of the short-lived satirical magazine Monocle, edited by Victor Navasky and dated November 19, 1963. Because of the assassination, Navasky would recall in his 2005 memoir, \"A Matter of Opinion,\" “most of the 75,000 copies never left the warehouse.” The decision not to distribute was a costly one, and within a couple of years Monocle was no more.\n\nDuring a Nov. 21 stopover with Kennedy in San Antonio, Johnson suffered another setback. Texas Senator Ralph Yarborough, a Democrat, was feuding with Texas Governor (and fellow Democrat) John Connally. Kennedy wanted Johnson to put an end to it; winning Texas in 1964 would be difficult enough without a Democratic party riven by conflict. To resolve the matter, Johnson had to talk to Yarborough. But Yarborough refused--in full view of reporters--to ride in a motorcade with Johnson. A headline in the next morning’s Dallas News would read, “Yarborough Snubs LBJ.” Connally, Johnson felt, was also treating him disrespectfully, and later, in a Houston hotel room, Caro writes in \"The Passage of Power,\" “there were, perhaps for the first time since Kennedy had been elected, loud, angry words directly between the president and the vice president.”\n\nAll of this—the investigations, the slights, Johnson’s fears about his political future—would evaporate on Nov. 22.\n\nIn San Antonio, Air Force One landed in Lackland Air Force Base, where the future playwright John Guare (\"Six Degrees of Separation\") had reported the previous month for basic training. November 21 marked the first interruption Guare recalls from “the endless calisthenics, aimless marching, learning to fire a rifle, kitchen duty, learning to take orders.” Guare’s platoon stood at attention and saluted the president, vice president, and their wives on a distant landing strip. Then it was time for a smoke. According to Guare (whose monologue about that day was included in a recent multimedia event at New York’s Symphony Space and reprinted in the Huffington Post) his “fellow airmen basics” used this precious free time to mutter one hateful thing after another about the visiting party: “We got to stand in this hot sun for a n----- lover?” “He don't belong in Texas.” “He ain’t my president.” “I’d like to show that wife of his what a man is.” And so on. When word came the next day that Kennedy was dead, Guare writes, “a cheer went up…. I have never felt so isolated in my life as I did that day.”\n\nKennedy’s own experience of November 21 is, like Kennedy himself, a bit of a cipher. His aide Kenny O’Donnell recalled him saying that morning, in the White House, “I feel great. My back feels better than it’s felt in years.” The historian William Manchester reported in his book \"Death of A President\" that Kennedy told Jackie he looked forward to riding that weekend at the Johnson ranch. But he was wearing a back brace, and at a speech later that day in Houston, Johnson aide Jack Valenti told Manchester, he observed Kennedy’s hands “vibrating so violently at times that they seemed palsied,” a symptom of Kennedy’s Addison’s disease.\n\nA helicopter flew the Kennedys to Andrew Air Force Base at 10:45 a.m.; on the flight to San Antonio, the president asked aides about his brother Bobby’s 38th birthday party the night before, which he hadn’t attended. (Bobby himself spent most of Nov. 21st in a Justice department meeting about targeting organized crime.) None of Kennedy’s public comments that day is particularly memorable. Kennedy spent much of the day trying to get aides to twist Yarborough’s arm into talking to Johnson. He and Jackie spent the night at Fort Worth’s Texas Hotel, in a suite decorated with paintings by Monet, Van Gogh, Picasso, and others, lent by local collectors. The splendor was lost on them, because they didn’t arrive at their hotel until after midnight and went straight to bed.\n\nNot quite one month before, on October 24, United Nations Ambassador Adlai Stevenson had given a speech in Dallas and been jeered by an angry right wing crowd shouting “Communist!” and “Traitor!” and “Kennedy will get his reward in hell.” Stevenson said to one heckler: “Surely, my dear friend, I don’t have to come here from Illinois to teach Texas manners, do I?” The protesters, egged on by a rally staged the night before by retired Army Major General Edwin Walker, a prominent, mentally unstable, and ultraconservative Dallas activist, had spat upon Stevenson and whacked him in the head with a placard that said “If You Seek Peace, Ask Jesus.” The bearer was Cora Lacey Frederickson, wife of a Dallas insurance executive; Dallas’ haters were drawn not from society’s fringes but from its pathologically angry haute bourgeoisie.\n\nThis was well known to the rest of the country. James McAuley argued in a recent New York Times essay on Dallas before the assassination that it was parodied by Carol Burnett and Julie Andrews in a (retrospectively creepy) TV production number of the song “Big D” that ended with Burnett pulling a gun on Andrews and saying, “What are ya, some kinda nut?”\n\nThe Stevenson incident left Dallas’s hard right feeling more aggrieved than ashamed. On the morning of November 22, an ad in the Dallas News read: “Welcome Mr. Kennedy to Dallas. A city so disgraced by a recent Liberal smear attempt that its citizens have just elected two more Conservative Americans to public office.” The ad, taken out by a group that called itself The American Fact-Finding Committee, continued: “A city that will continue to grow and prosper despite efforts by you and your administration to penalize it for its nonconformity to ‘New Frontierism.’”\n\nKennedy laughed it off, but the hatred in Dallas was real. A “Wanted For Treason” leaflet distributed in Dallas in the days before Kennedy’s visit accused Kennedy of (among other crimes) giving “support and encouragement to the Communist inspired racial riots” and appointing “anti-Christians to Federal office.”\n\nShortly after the Stevenson incident, a woman named Nelle Doyle had written White House Press Secretary Pierre Salinger to urge him not to send the president there because of “this ‘hoodlum mob’ here in Dallas… it is a dreadful thought, but all remember the fate of President McKinley.”\n\nStrangely, though, it wasn’t a right-wing extremist who would end Kennedy’s life, but a confused and angry Marxist—one who, seven months earlier, fired a shot not at Kennedy, nor Connolly, nor Johnson, nor Yarborough, but at Walker, whom he considered a fascist.\n\nThat time, Oswald missed."}, {"url": "https://glreview.org/article/the-curious-case-of-gordon-merrick/", "page_content": "The work of Kinsey, Hooker, and others all emboldened a new brand of post-Stonewall gay liberation activists ready to engage in dramatic and confrontational tactics, including disrupting APA meetings and demanding equal time to refute the theories of homosexual pathology.\n\nTHE FIRST GLIMPSE I had of Thom Gunn was his picture in a poetry anthology titled The Modern Poets, edited by John Malcolm Brinnin and William Read. It was assigned as a textbook in an English literature class I was taking at Emory University in 1963, with consequences for me that the teacher could not More\n\nBy Andrew Holleran: Who did read Merrick’s books? Not his agent, Merrick eventually realized, or even his editor at Avon Books. But thousands of fans did. Sales figures are sprinkled throughout Joseph M. Ortiz’ new biography, Gordon Merrick and the Great Gay American Novel.\n\nAS JACK KEROUAC’S centennial year draws to a close, I have been contemplating the open book of his sexuality. He married three times, had countless affairs with women, and was not above crude expressions of homophobia. However, he allied himself with his gay friends Allen Ginsberg and William S. Burroughs in the creation of the More\n\nThe main thrust of Ortiz’ book is to answer the question: Why did Merrick’s novels get so little respect from critics? The answer is to be found in the meticulous research he’s done. There is not, for anyone interested in the literary aspect of gay liberation, a page or paragraph without interest in this gracefully written study. “The purpose of this book,” Ortiz writes, “is not to argue that Gordon’s novels are masterpieces that have been unjustly banned from the upper echelon of gay literature.” Nor is it, strictly speaking, a biography of Gordon Merrick. It’s the story of a book; but because it’s this book, it is about gay liberation. It reminds us that the latter was not just Stonewall and Pride parades; it was a cultural battle, conducted via movies, TV shows, journalism, novels, and plays. And you could argue it really began in the theater.\n\nGore Vidal claimed that he’d been blackballed by the critics after publishing The City and the Pillar because of its subject matter. Whether or not that’s true, this is sort of what happened to Merrick after The Lord Won’t Mind. Until then, the theme of homosexuality in his novels had been a minor one, his lead characters always straight, but with The Lord Won’t Mind the struggle of a gay man to find happiness became the main subject. Writing about his own life liberated Merrick, as it would so many writers in the following decade. Four years after ignoring The Lord Won’t Mind, the Times reviewer praised Patricia Nell Warren’s The Front Runner as “the most moving, monumental love story ever written about gay life.” It was only the first in an efflorescence of gay novels in the late 1970s.\n\nWho did read Merrick’s books? Not his agent, Merrick eventually realized, or even his editor at Avon Books. But thousands of fans did. Sales figures are sprinkled throughout Joseph M. Ortiz’ new biography, Gordon Merrick and the Great Gay American Novel. One refers to over a million books sold. They did well in France and England. French critics considered Merrick a “serious” novelist. It helped that Merrick was fluent in French (one reason the OSS hired him), and so did the fact that he was critical of his own country’s shortcomings. His early books, which Ortiz calls “protest” novels, were about the cruelty of both sides in World War II, American racism, and class prejudice. The new ones were about sex, however, because Merrick felt it was important that people know what gay men did in the sack. Merrick took pains to get his sex scenes just right, as Ortiz discovered after going through Merrick’s papers in the Princeton library. This, of course, opened Merrick up to the charge of writing soft-core porn.\n\nThis article is only a portion of the full article. If you are already a premium subscriber please login . If you are not a premium subscriber, please subscribe for access to all of our content.\n\nGordon Merrick and The Great Gay American Novel\n\nby Joseph M. Ortiz\n\nLexington Books. 359 pages, $120. To continue reading this article, please LOGIN or SUBSCRIBE\n\nWho did read Merrick’s books? Not his agent, Merrick eventually realized, or even his editor at Avon Books. But thousands of fans did. Sales figures are sprinkled throughout Joseph M. Ortiz’ new biography, Gordon Merrick and the Great Gay American Novel. One refers to over a million books sold. They did well in France and England. French critics considered Merrick a “serious” novelist. It helped that Merrick was fluent in French (one reason the OSS hired him), and so did the fact that he was critical of his own country’s shortcomings. His early books, which Ortiz calls “protest” novels, were about the cruelty of both sides in World War II, American racism, and class prejudice. The new ones were about sex, however, because Merrick felt it was important that people know what gay men did in the sack. Merrick took pains to get his sex scenes just right, as Ortiz discovered after going through Merrick’s papers in the Princeton library. This, of course, opened Merrick up to the charge of writing soft-core porn.\n\nGore Vidal claimed that he’d been blackballed by the critics after publishing The City and the Pillar because of its subject matter. Whether or not that’s true, this is sort of what happened to Merrick after The Lord Won’t Mind. Until then, the theme of homosexuality in his novels had been a minor one, his lead characters always straight, but with The Lord Won’t Mind the struggle of a gay man to find happiness became the main subject. Writing about his own life liberated Merrick, as it would so many writers in the following decade. Four years after ignoring The Lord Won’t Mind, the Times reviewer praised Patricia Nell Warren’s The Front Runner as “the most moving, monumental love story ever written about gay life.” It was only the first in an efflorescence of gay novels in the late 1970s.\n\nThe main thrust of Ortiz’ book is to answer the question: Why did Merrick’s novels get so little respect from critics? The answer is to be found in the meticulous research he’s done. There is not, for anyone interested in the literary aspect of gay liberation, a page or paragraph without interest in this gracefully written study. “The purpose of this book,” Ortiz writes, “is not to argue that Gordon’s novels are masterpieces that have been unjustly banned from the upper echelon of gay literature.” Nor is it, strictly speaking, a biography of Gordon Merrick. It’s the story of a book; but because it’s this book, it is about gay liberation. It reminds us that the latter was not just Stonewall and Pride parades; it was a cultural battle, conducted via movies, TV shows, journalism, novels, and plays. And you could argue it really began in the theater.\n\nTo continue reading this article, please LOGIN or SUBSCRIBE"}, {"url": "https://openlibrary.org/books/OL3944009M/The_Laramie_project", "page_content": "On November 14, 1998, the members of Tectonic Theater Project traveled to Laramie, Wyoming, and conducted interviews with the people of the town. During the next year, we would return to Laramie several times and conduct over two hundred interviews. The play you are about to see is edited from those interviews, as well as from journal entries by members of the company and other found texts.\n\n\n\nPage 5, added by Alex Voytek . \"Opening speech\""}, {"url": "https://fr.wikipedia.org/wiki/Mois%C3%A9s_Kaufman", "page_content": "Cette section est vide, insuffisamment détaillée ou incomplète. Votre aide est la bienvenue ! Comment faire ?\n\nDans un entretien donné en 2005, Kaufman se décrit ainsi : « Je suis Vénézuélien, je suis Juif, je suis homosexuel, j'habite à New York. Je suis la somme de toutes mes cultures. Je ne pourrais rien écrire qui n'embrasserait pas tout ce que je suis »[1].\n\nAvec son groupe de théâtre Tectonic Theatre, il a écrit Le Projet Laramie, inspiré d'un fait divers qui a touché Moisés Kaufman : le meurtre de Matthew Shepard, un jeune homosexuel à Laramie en 1998.\n\nNotes et références [ modifier | modifier le code ]\n\n2009 : 33 Variations, pièce de théâtre"}, {"url": "https://www.spokeo.com/", "page_content": "BE IN THE KNOW\n\nStay Updated\n\nGet updates on the reports you purchase for the lifetime of your Spokeo account; even if you don’t find all the results you were looking for at first, just wait — as our data refreshes, so too can your report!"}, {"url": "https://www.history.navy.mil/research/library/research-guides/modern-biographical-files-ndl.html", "page_content": "Introduction\n\nThe Modern Biographical Files are located in the Navy Department Library's Rare Book Room. They are a combination of files collected by the Library and a ready reference collection of duplicate flag officer files formerly housed in the Archives Branch of the Naval History and Heritage Command.\n\nThese files have been accumulated since the early 20th century by the Navy Department Library to provide historical information to US Navy personnel and other researchers, both official and unofficial. The files are particularly noted for biographical coverage of senior U.S. Navy officers who served during the Second World War and the Cold War-era, though their contents range from the Interwar period (1919-1939) through the War on Terrorism. For biographical information from the late 18th through the early 20th centuries, see the Navy Department Library's ZB files and Officers of the Continental and U.S. Navy and Marine Corps 1775-1900 ]. Also see Navy Personnel: A Research Guide.\n\nMany of the files consist of individual officer biographies produced during the 1950s through the 1970s by the Navy Office of Information, Internal Relations Division; the Navy Office of Information, Biographies Branch; and the Division of Naval Records and History (OP 29). Additional material consists of newspaper clippings, journal articles, change of command/retirement brochures, and biographies printed from the websites of the Navy Chief of Information and Arlington National Cemetery. Materials continue to be added to these files. Although a majority of the files consist of between two to four pages, a few contain up to four linear inches of material."}], "Moisés Kaufman is Venezuelan-American.": [{"url": "https://www.britannica.com/biography/Moises-Kaufman", "page_content": "Moisés Kaufman, (born November 21, 1963, Caracas, Venezuela), Venezuelan-born playwright and director who is best known for perceptive and moving plays often rooted in issues of sexuality. He was cofounder in 1991 of Tectonic Theater Project, a company dedicated to examining the structure and language of theatre as well as addressing contemporary social issues.\n\nKaufman was born in Venezuela to Orthodox Jewish parents and was of Ukrainian and Romanian descent. He attended a yeshiva (Jewish religious school) as a child and was exposed to broader culture on family trips to New York City. A Caracas theatre festival he attended as a young teenager brought him exposure to the avant-garde plays of such artists as Peter Brook, Tadeusz Kantor, Pina Bausch, and Jerzy Grotowski, whom he cited as his early influences. While attending Metropolitan University in Caracas (B.A. in business administration, 1985), Kaufman joined a touring experimental theatre group as an actor. In 1987 he moved to New York City, where he studied theatre directing at the Tisch School of the Arts, New York University, meanwhile directing a variety of plays. It was at NYU that he honed his ideas about the purpose and most-effective means of presenting theatrical performances. Four years later Kaufman, together with his partner, Jeffrey LaHoste, established Tectonic Theater Project.\n\nKaufman’s writing debut, Gross Indecency: The Three Trials of Oscar Wilde (performed 1997–98, published 1997), illustrated his concerns as a writer-director. He was especially interested in what he termed “watershed historical moments,” events that reveal the foundations of society’s beliefs. A powerful and moving play that used actual trial testimony, Gross Indecency won an Outer Critics Circle Award for outstanding Off-Broadway play. Kaufman and his troupe then began work on The Laramie Project (performed 2000, published 2001, television movie 2002), interviewing numerous residents of the small Wyoming city in which gay college student Matthew Shepard had been brutally murdered. The play had particular resonance with Kaufman, who was gay, and it proved popular throughout the world.\n\nIn 2003 Kaufman directed a one-man show, Doug Wright’s I Am My Own Wife: Studies for a Play About Charlotte von Mahlsdorf (performed 2003–04), the story of a gay transvestite who survived life in Nazi Germany and Soviet East Berlin. It was critically acclaimed and resulted in a Tony Award nomination for Kaufman. In the next several years Kaufman directed a variety of plays, including Wilde’s Lady Windermere’s Fan and Shakespeare’s Macbeth. He also directed his own play 33 Variations (first performed 2007), starring Jane Fonda as a musicologist obsessed with Beethoven’s Diabelli Variations, and received another Tony nomination. In 2009 Kaufman and other Tectonic members arranged for 150 simultaneous readings in theatres across the globe of a sequel, The Laramie Project: Ten Years Later. He also directed Rajiv Joseph’s Bengal Tiger at the Baghdad Zoo (performed 2011), starring Robin Williams as the title character; a 2012–13 revival of Ruth and Augustus Goetz’s The Heiress, a play based on Henry James’s novel Washington Square; and a revival of Torch Song (2018–19), which was written by Harvey Fierstein. In 2016 Kaufman received the National Medal of Arts."}, {"url": "https://www.nbcnews.com/news/latino/legendary-playwright-mois-s-kaufman-talks-about-art-lgbtq-activism-n672736", "page_content": "NEW YORK — Growing up gay in Venezuela, Moisés Kaufman knew what it was like to feel like an outsider. The son of a Holocaust survivor, he was raised in an Orthodox Jewish family in a conservative, deeply Roman Catholic country – which led to profound feelings of isolation.\n\n“The difficulty was that there were no role models,” he told NBC News. “But I remember very vividly the first time I found the word ‘homosexual’ in the dictionary and being delighted, because I thought there must be one other person in the world who is homosexual because there is a word for it.”\n\nToday Moisés Kaufman, 52, is one of the most acclaimed playwrights and directors in the American theater.\n\nIn September, Kaufman was among a select group of Americans honored at the White House with the highly prestigious National Medal of the Arts. He termed the experience “exciting” because of his fellow honorees. “Some of those people are people I have admired all my life, like Mel Brooks, Sandra Cisneros,” he said. “There was really a great sense of camaraderie between all of the recipients. And I love President Obama, so it was really wonderful to receive it from him.”\n\nPresident Barack Obama presents director Moises Kaufman with the 2015 National Medal of Arts during a ceremony in the East Room of the White House on Sept. 22. SAUL LOEB / AFP - Getty Images\n\nKaufman's plays been produced everywhere from Broadway to public high schools. He has been nominated for Tony and Emmy awards. And as his theater group celebrates its 25th anniversary, he can reflect on a body of work that has impacted social and cultural norms worldwide.\n\nOn Thursday, September 22, in the East Room of the White House, President Barack Obama awarded the 2015 National Medal of Arts and the National Humanities Medal to distinguished recipients. First Lady Michelle Obama attended the ceremony. Cheriss May / (C)2016 Photo by Cheriss May, www\n\nAfter attending college in Venezuela, Kaufman moved to New York City to study directing. He founded his theater company, The Tectonic Theater Project, in 1991 with his now-husband Jeffrey LaHoste.\n\n“We started it in the dining room of our apartment. The first four years, we were performing in church basements,” Kaufman said. “Often there were more people onstage than in the house.”\n\nRELATED: These Latinos Were Honored with National Medals for Art, Humanities\n\nThe Tectonic Theater Project uses a unique process for conceiving and reimagining theater known as “Moment Work.” It enables actors, writers, designers, and directors to collaborate in creative storytelling.\n\nVenezuelan-born playwright/director. Moises Kaufman. The LIFE Images Collection/Getty Images\n\nUsing this technique, Kaufman wrote and directed Gross Indecency: The Three Trials of Oscar Wilde in 1997. This off-Broadway play, which The New York Times called “absolutely gripping,” utilized actual testimony and transcripts from the trials of the iconic Wilde. Kaufman won a Lambda Literary Award, an award given for works that explore LGBT themes, for \"Gross Indecency\" in 1998.\n\nThat same year, just three months after the brutal murder of gay student Matthew Shepard, Kaufman took his theater group to Laramie, Wyoming to interview people in the town where the killing had taken place. They conducted over 200 interviews, totaling 400 hours, and the company then used these oral histories to write The Laramie Project.\n\n“The community was in shock,” Kaufman recalled. “They never expected a murder like that to occur in their midst. We managed to capture, I think, something of the rawness and the experience the town was having at that time.”\n\nKaufman and his siblings. Moises Kaufman\n\nActress Mercedes Herrero, who collaborated in the creation of \"The Laramie Project,\" described the process as “pretty extraordinary.”\n\n“I came from the Stanislavski (acting) tradition,” Herrero said. “Moisés was using this experimental form, not only gathering interviews, but also literally writing current events as they were happening. This was a new kind of theater to me, and it was mind-blowing.” Herrero, who co-stars in House of Cards, added that working with Kaufman has made her “a more politically aware being.”\n\n\"The Laramie Project,\" about the town’s reaction to Shepard’s brutal killing, went on to become one of the most acclaimed plays of the year, and one of the most-produced works of the decade. It has been performed worldwide, and is often used to educate people about homophobia and anti-LGBT violence. It was also made into an HBO film written and directed by Kaufman.\n\nJudy Shepard, the mother of Matthew Shepard, told NBC News that \"The Laramie Project\" was very special to her. “I think everybody can relate to an actor who is on stage. The audience is seeing somebody who is like them,” she said. “It brings home how differently we all feel about things, and how we respond to things.”\n\n“It (the play) is not specifically about Matt,” Shepard pointed out. “But it shows how society looks when we don’t accept each other for who we are. It shows what happens when we are at odds with each other for no reason.”\n\nShepard said that she hears from people all over the country who have “come out” as LGBT after seeing or having been a part of the play.\n\n“People say to me, are you a Latino writer? Are you a gay writer? Are you a Jewish writer? And I say yes to all.\"\n\n“Moisés has absolutely moved the needle in terms of how people view bullying and hate crimes against LGBT people,” said Shepard.\n\nKaufman and his theater company revisited Laramie to produce The Laramie Project: Ten Years Later in 2008.\n\nIn 2003, Kaufman directed the Pulitzer Prize- and Tony Award-winning play I Am My Own Wife on Broadway. Also on Broadway, in 2009 he directed Jane Fonda in 33 Variations, and Robin Williams in Bengal Tiger at the Baghdad Zoo in 2011. Kaufman’s most recent Broadway show was a 2012-2013 revival of The Heiress, starring Jessica Chastain.\n\nGlenn Davis, Brad Fleischer, playwright Rajiv Joseph, Robin Willams, director Moises Kaufman, Arian Moayed & Hrach Titizian during the Broadway Opening Night Curtain Call for 'Bengal Tiger at the Baghdad Zoo' at the Richard Rodgers Theatre in New York City. (C) Walter McBride/WM Photography / Corbis via Getty Images\n\n“He is a lovely person, with a really nice energy,” said casting director James Calleri, who worked with Kaufman on \"33 Variations.\"\n\n“Actors seem to want to work with him a lot,\" said Calleri. \"And he has very strong feelings about what the work should be.”\n\nThe fact that Kaufman’s work has dealt with controversial themes, Calleri stated, has contributed to its success in regional productions.\n\n“His stuff has been very on-topic and present, which, if anything, has helped it have an impact outside New York, in colleges and in local productions. \"The Laramie Project\" has even been done in high schools.”\n\nKaufman’s plays have generated their share of controversy. When \"The Laramie Project\" was first being produced at colleges, there were protests from people who claimed it was being used to recruit students into homosexuality. Last year, Russia cut off funding for a production of \"Gross Indecency\" at the Moscow New Drama Theater because of its gay themes.\n\nBroadway writer/director Moises Kaufman as a young actor. Moises Kaufman\n\nKaufman is currently working on an adaptation of the opera \"Carmen,\" and has several events planned for this fall. On November 7, Jane Fonda will host the 25th anniversary gala for the Tectonic Theater Project. The event will feature celebrities reading excerpts from Tectonic’s plays, including The Laramie Project and 33 Variations.\n\nOn November 10, Kaufman will be presented with the American Artist Award by Arena Stage in Washington D.C.\n\nThe Artistic Director of Arena Stage, Molly Smith, said that she was proud to have known Kaufman for almost two decades. “I watched him in the initial stages of developing \"The Laramie Project.\" I have been so moved by his combination of theater, social commentary, and political fervor in the projects he has taken on,” Smith said. “He is a bold theater artist, and I think our audience loves that.”\n\nWhen Barack Obama signed the Matthew Shepard and James Byrd, Jr. Hate Crimes Prevention Act, Smith noted, the president had Kaufman there as a recognition of the impact of his work.\n\nSmith also mentioned that Kaufman was “one of the most gracious and warm individuals you could ever meet.”\n\nThroughout his career, Kaufman has dealt with issues of identity. “People say to me, are you a Latino writer? Are you a gay writer? Are you a Jewish writer? And I say yes to all,” he said. “If I am any good at what I do, then I’m a Latino writer and I am a Jewish writer and I’m a gay writer, and I’m a New York writer. And I’m a writer of all the things that I am as a human being.”\n\nStill, Kaufman said that LGBT youth continue to face challenging circumstances as they grow up. “Anyone who has ever had the experience of coming out will tell you that it is a process. It is a process for the person coming out, and for the people you are coming out to,” he said. In his case, he explained, because his work dealt so publicly with issues of gender and sexuality, his parents had to learn how to deal with it.\n\nA picture of Moises Kaufman and his father Jose. Moises Kaufman\n\nAlthough Kaufman describes his mother and late father as “very proud and supportive” of his work, he stressed that young LGBT kids often struggle with acceptance. “The question of whether things are getting better for LGBT youth is a complicated one,” he said.\n\n“On the one hand, yes, they are getting better. Having said that, there is an epidemic of bullying in high school, especially against LGBT kids,” Kaufman continued, mentioning the high rates of suicide and depression among LGBT youth.\n\n“So I think that yes, things are getting better,\" said the playwright. \"But there is still a lot of work to do.”\n\nFollow NBC News Latino on Facebook, Twitter and Instagram."}, {"url": "https://www.independent.co.uk/news/ap-immigration-q-a-broadway-new-york-b2093556.html", "page_content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nSeven years ago, Moisés Kaufman was approached to direct the Broadway musical “Paradise Square” and, after reading it, he immediately said yes.\n\n“I did this show because it spoke to me,” the Venezuelan theater director and playwright says. “So much of my work occurs at the intersection of the personal and the political. I like to look at history through the eyes of the other, through the eye of the person that doesn’t get to tell their story.”\n\nNow “Paradise Square” — about unity and racism in New York’s notorious Five Points neighborhood, where Irish immigrants and Black Americans jostled to survive in the years before the Civil War — is nominated for 10 Tony Awards, including best musical, best lead actress for Joaquina Kalukango, and best featured actor for both Sidney DuPont and A.J. Shively.\n\nDuring a recent interview with The Associated Press, Kaufman, himself an immigrant based in New York City, reflected on immigration and the roots of American divisions.\n\n“Immigration is a great fallacy, because you never leave the country where you were born, and you never arrive in the country where you land. Your being is always divided, part of you is there and part of you is here,” he said.\n\nThe founder of Tectonic Theater Project — best known for “The Laramie Project” and who has received awards including the National Medal of Arts — also spoke about the relevance of the show today and the powerhouse that is Kalukango as the courageous bar owner Nelly O’Brien.\n\nRemarks have been edited for brevity and clarity.\n\n___\n\nAP: You have directed plays on Broadway, but this is your first Broadway musical. Did you expect “Paradise Square” to get 10 nominations?\n\nKAUFMAN: No, I did not expect it. It was a great joy to hear that and to get that, and it's been really rewarding! I did this show because it spoke to me. I don't know, something about looking at America through the eyes of that community, a community where Irish immigrants and Black natives were getting married and living together and doing business together in 1863! When in the South, Black people were still slaves, here there was a community where people were living and loving together. It spoke to me.\n\nAP: You are also an immigrant directing a show about immigrants. How did this inform the process?\n\nKAUFMAN: Well, that was another way into the material. Like a lot of immigrants, we arrive here with a dream, with an expectation of what we want our lives to be like. And we have this whole mythology of what America provides and what one is able to do in America. And invariably, whether you succeed or you fail, you have to confront the reality of America. There's always a gap between the reality of America and the dream of America. I think that the poorer you are, the distance between that reality and that image widens. So, of course, it's much harder for a poor person to come to America and realize their dreams than it is for a wealthy person to come to America and realize their dreams. I don't know, there was something about these immigrants arriving in this country and then finding community with the least likely of partners that really spoke to me.\n\nAP: What was the biggest challenge of directing this show?\n\nKAUFMAN: The biggest challenge was that we knew that we wanted to tell an epic story. You don't see musicals of this size on Broadway anymore or on the West End. You know, they're un-producible — 36 actors on stage, 10 more actors off stage just being standbys, an orchestra of 50 people. It is a very big musical. At times we felt like, who do we want the audience to fall in love with and follow for the course of the play when you have so many characters? And how do you craft it in a way that you can follow all of them, and that you can follow the intricacies of this historical musical?\n\nAP: Joaquina Kalukango gets a standing ovation before the show even ends — after “Let It Burn.” What can you tell me about her? Do you ever worry she might get sick?\n\nKAUFMAN: We have two understudies for her, and they're both very good. But Joaquina — every so often a monster arrives at the theater and that's her, she's a theatrical monster. And in real life she's the most unassuming person in the world. She's a Juilliard graduate, she's a brilliant actor, and she can sing like that. It's just an astonishing thing to watch.\n\nAP: “Paradise Square” happens in the 1800s, but it is still very relevant. What is the most important message that people can get from this musical today?\n\nKAUFMAN: I'm always a little afraid of that question, because I feel that if I tell you the message that I want people to get, I am denying the audience part of the fun, which is for them to figure out what they see in the play. But what I can tell you is that what interested me is to see how deep the roots of our divisions are, and to see what are the forces that keep fueling those divisions. You know, America is a melting pot where nothing ever melted. So how do we aspire to a more perfect union? I think that the answer to that is by really understanding what are the things that tear us apart, and the play talks a lot about that.\n\n___\n\nSigal Ratner-Arias is on Twitter at https://twitter.com/sigalratner."}, {"url": "https://www.theatregold.com/content/moises-kaufman/", "page_content": "Let's Get Social\n\nMoisés Kaufman\n\nMoisés Kaufman (born November 21, 1963) is a playwright, director and founder of Tectonic Theater Project. He is best known for writing The Laramie Project with other members of Tectonic Theater Project. He is also the author of Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations. He was born and raised in Caracas, Venezuela and moved to New York City in 1987.[1]\n\nLife\n\nKaufman is of Romanian and Ukrainian Jewish descent.[2] He described himself in an interview by saying “I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.”[3]\n\nKaufman was awarded a Guggenheim Fellowship in 2002.[4] He made his Broadway directing debut in the 2004 production of I Am My Own Wife by Doug Wright, for which he received a Tony Award nomination for Best Direction of a Play. On September 22, 2016, Kaufman was the first Venezuelan awarded the National Medal of Arts in ceremony conducted by U.S. president Barack Obama. He is a graduate of NYU[5]\n\nAwards\n\nSteinberg/ATCA Best New Play Award—2008: “33 Variations”\n\nOuter Critics Circle Award\n\nGLAAD Media Award\n\nDrama Desk Award\n\nLucille Lortel Award, 1998 Outstanding Play Gross Indecency:The Trials of Oscar Wilde – Playwright\n\nCarbonell Award\n\nBay Area Theater Critics Circle Award\n\nLambda Book Award\n\nVenezuela’s Casa del Artista\n\n2004 Obie Award, Best Direction I Am My Own Wife – Director\n\nAmerican Library Association’s LGBT Literature Award\n\nMatthew Shepard Foundation’s “Making A Difference Award”\n\nArtistic Integrity Award from the Human Rights Campaign\n\nNational Board of Review Award for Outstanding Made for Television Movie\n\nGolden Bear Award from the Berlin Film Festival\n\nHumanitas Prize\n\nJoe A. Callaway Award – 1997 – Gross Indecency:The Trials of Oscar Wilde Director\n\nThe Tony Award\n\n2016 National Medal of Arts and Humanities\n\nTheatre Work\n\nDirecting Credits\n\nBengal Tiger at the Baghdad Zoo\n\nPuss in Boots (El Gato con Botas)\n\n33 Variations\n\nMacbeth (with Liev Schreiber) for The Public Theater’s Shakespeare in the Park\n\nLady Windermere’s Fan\n\nThis Is How It Goes\n\nInto The Woods\n\nMaster Class (with Rita Moreno)\n\nOne Arm by Tennessee Williams\n\nI Am My Own Wife\n\nThe Laramie Project\n\nGross Indecency: The Three Trials of Oscar Wilde\n\nMarlow’s Eye\n\nThe Nest\n\nWomen in Beckett\n\nMachinal\n\nCoxinga\n\nThe Nightingale\n\nThe Heiress\n\nTorch Song Trilogy\n\nParadise Square\n\nAuthor Credits\n\n1. Standing On Ceremony: The Gay Marriage Plays Minetta Lane Theatre 11/13/2011 Author 2. One Arm Acorn Theater 06/09/2011 Adapation 3. The Laramie Project Union Square Theatre 03/18/2000 Playwright 4. Gross Indecency:The Trials of Oscar Wilde Minetta Lane Theatre 06/05/1997 Playwright\n\nFilm Credits\n\nThe Laramie Project\n\nThe L Word (2 episodes)\n\nReferences\n\n1 Hurwitt, Robert (2001-05-20). “The ‘Laramie’ process”. San Francisco Chronicle.\n\n2 Robert Myers (25 May 1997). “‘Nothing Mega About It Except the Applause'”. The New York Times. Retrieved 6 July 2009.\n\n3 Orozco, Jose (March 21, 2005). “True To Reality: An Interview with Moises Kaufman”. Morphizm. Retrieved 6 August 2012. I am Venezuelan, I am Jewish, I am gay, I live in New 4 York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.\n\n5 “Moisés Kaufman”. John Simon Guggenheim Memorial Foundation. 2002. Archived from the original on 2011-06-22. Retrieved 2009-03-03.\n\n6 http://www.nyu.edu/about/news-publications/news/2016/september/ArtsAccoladesSeptember.html\n\n7 Full References at WIKI\n\nExternal Links\n\nMoisés Kaufman – Bio, Moisés Kaufman, theatre director, Tectonic Theater Project, The Laramie Project, Gross indecency the three trials of oscar wilder, Paradise Square, Torch Song, The Heiress, The Nightingale, Machinal, Women Beckett, Master Class, Into the Woods, 33 Variations"}, {"url": "https://stageagent.com/writers/3201/moises-kaufman", "page_content": "Moisés Kaufman is a playwright, director, and founder of the Tectonic Theater Project based in New York City.\n\nKaufman was born in Caracas, Venequela on November 21, 1963. His family is Orthodox Jewish of Romanian and Ukrainian descent. He attended a yeshiva (a Jewish religious school) as a child. While growing up, he was first exposed to theatre on family vacations to New York City. As a teenager, he attended a Caracas theatre festival which introduced him to the work of avant grade theater artists Peter Brook, Tadeusz Kantor, Pina Bausch, and Jerzy Grotowski, whom he cites as his earliest influences. He attended Metropolitan University in Caracas. During his time at university, he acted in a touring experimental theatre group.\n\nIn 1987, Kaufman moved to New York City to study directing at NYU's Tisch School of the Performing Arts. Four years later, he and his partner, Jeffrey LaHoste, created the Tectonic Theatre Project. The company is dedicated to addressing contemporary social issues, as well as to explore the structure and language of theatre.\n\nKaufman has stated that he is primarily drawn to moments in history that unintentionally reveal a society's views and belief systems. His first play, Gross Indecency: The Three Trials of Oscar Wilde, premiered in New York City in 1997. It won the Outer Critics Circle Award for Outstanding Off-Broadway play.\n\nFrom 1998-1999, Kaufman and the Tectonic Theater Project traveled to Laramie, Wyoming to interview those connected to the murder of gay college student Matthew Shepard. The ensuing work compiled from their interviews, The Laramie Project, premiered in 2000 and was made into a film for HBO on 2001. The play gathered a worldwide following and has become a seminole work for the LGBQT community and for professional theaters, universities, high schools, and community theaters.\n\nIn 2003, Kaufman directed Doug Wright's I Am My Own Wife: Studies for a Play About Charlotte von Mahlsdorf. The play follows a gay transvestite who survived life in Nazi Germany and Soviet East Berlin. Kaufman received a Tony Award nomination for his direction. In 2007, Kaufman directed for Broadway again, this time for his own play, 33 Variations starring Jane Fonda as a musicologist obsessed with Beethoven’s Diabelli Variations. This garnered him his second Tony nomination.\n\nIn 2009, Kaufman and other members of the Tectonic Theater Project reunited to create The Laramie Project: Ten Years Later, a sequel to the original piece. It was performed in staged readings around the globe.\n\nIn 2011, he directed Rajiv Joseph's Bengal Tiger At the Baghdad Zoo on Broadway starring Robin Williams. In 2012, he directed a revival of Ruth and Augustus Goetz's The Heiress on Broadway.\n\nMr. Kaufman has been honored with a Steinberg/ATCA Best New Play Award, a Dike Award, an Outer Critics Circle Award, a GLAAD Media Award, a Drama Desk Award, a Lucille Lortel Award, a Carbonell Award, a Bay Area Theater Critics Circle Award, a Lambda Book Award, Venezuela's Casa del Artista, American Library Association's GLBT Literature Award, the Matthew Shepard Foundation’s “Making A Difference Award\", the Artistic Integrity Award from the Human Rights Campaign, the National Board of Review Award for Outstanding Made for Television Movie, a Golden Bear Award from the Berlin Film Festival, the Humanitas Prize,the Joe A. Callaway Award, and two Tony Award nominations.\n\nFor more information on the Tectonic Theater Project, visit their website: http://tectonictheaterproject.org."}, {"url": "https://kids.kiddle.co/Mois%C3%A9s_Kaufman", "page_content": "Moisés Kaufman (born November 21, 1963) is a Venezuelan theater director, filmmaker, playwright, founder of Tectonic Theater Project, based in New York City, and co-founder of Miami New Drama at the Colony Theatre. He was awarded the 2016 National Medal of Arts by President Barack Obama. He is best known for creating The Laramie Project (2000) with other members of Tectonic Theater Project. He has directed extensively on Broadway and Internationally, and is the author of numerous plays, including Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations.\n\nBorn and raised in Caracas, Venezuela, he moved as a young man to New York City in 1987.\n\nBiography\n\nKaufman is of Romanian-Jewish and Ukrainian-Jewish descent, and was born in Caracas, Venezuela. He is an alumnus of Venezuela's Universidad Metropolitana, where he began to study theatre. After immigrating to the United States, he went to college in New York and graduated from NYU.\n\nIn 2005 he described himself in an interview by saying, \"I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn't write anything that didn't incorporate all that I am.\"\n\nKaufman was awarded a Guggenheim Fellowship in 2002, following the premiere of The Laramie Project, which was based on extensive interviews with residents and commentators in and around Wyoming who were involved with the aftermath of the murder of gay student Matthew Shepard.\n\nHe made his Broadway directing debut in the 2004 production of I Am My Own Wife by Doug Wright, for which he received a Tony Award nomination for Best Direction of a Play.\n\nOn September 22, 2016, Kaufman was awarded the National Medal of Arts and Humanities in a ceremony conducted by U.S. president Barack Obama. He is the first Venezuelan to receive the honor.\n\nAwards\n\n2016 National Medal of Arts given to him by President Barack Obama\n\nObie Award - (Best Director) I AM MY OWN WIFE\n\nGuggenheim Fellowship\n\nTony Award Nomination (Best Director) I AM MY OWN WIFE\n\nTony Award Nomination (Best Playwright) 33 VARIATIONS (with Jane Fonda)\n\nNational Board of Review Award for Outstanding Made for Television Movie - THE LARAMIE PROJECT FILM (HBO)\n\nHumanitas Prize\n\nEmmy Nomination (Dest Director) The Laramie Project Film (HBO)\n\nEmmy Nomination (Best Screenwriter - with the Members of Tectonic Theater) THE LARAMIE PROJECT FILM (HBO)\n\nGolden Bear Award from the Berlin Film Festival THE LARAMIE PROJECT FILM (HBO)\n\nSteinberg/ATCA Best New Play Award—2008: 33 Variations\n\nOuter Critics Circle Award BEST DIRECTOR: GROSS INDECENCY: THE THREE TRIALS OF OSCAR WILDE.\n\nLucille Lortel Award BEST DIRECTOR: GROSS INDECENCY: THE THREE TRIALS OF OSCAR WILDE.\n\nGLAAD Media Award\n\nBay Area Theater Critics Circle Award GROSS INDECENCY: THE THREE TRIALS OF OSCAR WILDE\n\nLambda Book Award\n\nVenezuela's Casa del Artista\n\nAmerican Library Association's LGBT Literature Award\n\nMatthew Shepard Foundation's \"Making A Difference Award\"\n\nArtistic Integrity Award from the Human Rights Campaign\n\nCarbonell Award\n\nJoe A. Callaway Award for excellence in directing, given by The Society of Stage Directors and Choreographers\n\nStage directing credits\n\nParadise Square (musical) . (Berkeley Rep, Chicago, Broadway).\n\n. (Berkeley Rep, Chicago, Broadway). TORCH SONG (Broadway) Tony Nomination - Best Revival of a Play.\n\nTHE HEIRESS - with Jessica Chastain (Broadway).\n\nBengal Tiger at the Baghdad Zoo starring Robin Williams.(Broadway)\n\nstarring Robin Williams.(Broadway) Puss in Boots (El Gato con Botas)\n\n33 Variations starring Jane Fonda. (Broadway)\n\nstarring Jane Fonda. (Broadway) Macbeth (starring Liev Schreiber) for The Public Theater's Shakespeare in the Park\n\n(starring Liev Schreiber) for The Public Theater's Shakespeare in the Park Lady Windermere's Fan\n\nThis Is How It Goes starring Ben Chaplin at the Donmar Warehouse.\n\nstarring Ben Chaplin at the Donmar Warehouse. Into The Woods\n\nMaster Class (with Rita Moreno)\n\n(with Rita Moreno) One Arm by Tennessee Williams\n\nby Tennessee Williams I Am My Own Wife (2004, his Broadway debut)\n\n(2004, his Broadway debut) The Laramie Project (2000)\n\n(2000) Gross Indecency: The Three Trials of Oscar Wilde\n\nMarlow's Eye\n\nThe Nest\n\nWomen in Beckett\n\nMachinal\n\nCoxinga\n\nThe Nightingale\n\nThe Heiress\n\nTorch Song Trilogy\n\nThe Album: Here There are Blueberries at the Colony Theatre (in collaboration with Miami New Drama)\n\nFilm credits\n\nThe Laramie Project\n\nTelevision credits\n\nThe L Word (2 episodes)\n\nSee also"}, {"url": "https://www.nbcnews.com/news/latino/theater-reflects-changing-america-venezuelan-michel-hausmann-doing-it-miami-n854441", "page_content": "MIAMI – Most producers aim to create theater that both resonates with and reflects its audience. That’s the mission that Venezuelan-born writer, director, and producer Michel Hausmann has taken on in this American city that is widely known as the “capital of Latin America.\"\n\n\"If America is changing as a whole, and by 2050 it's going to be a majority minority country, well Miami has been majority minority for years,” said Hausmann, 36, artistic director and co-founder of Miami New Drama, which launched its first full season this past fall. “We need to be a theater that creates work for a multilingual, diverse audience and paves the way for what the future of theater will look like in America.”\n\nHausmann has garnered attention and praise for his original work and his multicultural adaptations of traditional American and European plays, from Thornton Wilder's \"Our Town\" to August Strindberg's \"Miss Julie.\"\n\nVenezuelan-born playwright Michel Hausmann, founder and artistic director of Miami New Drama in Miami, Florida. Photo courtesy: Ana Sofia Pelaez\n\nLike a significant number of Miami’s residents, Hausmann left Venezuela’s political turmoil, albeit under uniquely dramatic circumstances. In 2010, when he was presenting a production of \"Jesus Christ Superstar\" in his native Caracas, masked assailants attacked the packed theater with tear gas. Firefighters advised against evacuating since there was no guarantee of what they would find outside.\n\n“Now I can talk about it with distance, but at the time it was the scariest thing that had ever happened to me,” he told NBC News. “Suddenly,I realized I had 2,000 people who were all my responsibility.”\n\nTo keep the audience calm, the show continued with actors sharing a gas mask in between scenes. Though it was impossible to determine who was behind the attack, it came after a fraught confrontation with the Venezuelan government, then under President Hugo Chávez. Shortly before the premiere, Hausmann was informed the show would lose key sponsorship if they placed advertisements with independent media outlets; Hausmann responded with a public letter to the proscribed outlets.\n\nFollowing the attack, Hausmann left for the U.S. to pursue a master's in theater directing at Columbia University in New York City. He went on to write and direct the critically-acclaimed musical, The Golem of Havana, about a Hungarian-Jewish family living in Cuba on the eve of the Cuban Revolution. It was inspired by his maternal grandmother, who lost most of her family after they were killed in Nazi concentration camps.\n\nAfter the musical’s success, Hausmann decided to move to Miami, a city that he used to visit as a child and that now is home to a large and growing Venezuelan community.\n\n“As an immigrant in a city of immigrants, both Hispanic and Jewish...this was as close to home as I could get,” said Hausmann.\n\nHe produced \"Golem\" at The Colony, then an underused event space in Miami, to much success. He then approached his friend, mentor and fellow Venezuelan Moisés Kaufman, about starting a new regional theater in Miami.\n\nFile photo of Venezuelan-American playwright Moises Kaufman, one of the founding members of Miami New Drama. Jemal Countess / Getty Images\n\nAt first, the acclaimed Tony and Emmy nominated Kaufman - whose works include \"The Laramie Project\" and \"Gross Indecency: The Three Trials of Oscar Wilde\" - said it was “the stupidest idea he’d heard in his life,\" recalled Hausmann laughing.\n\n“He called me two days later and said, 'Okay Michel, I thought of it, it’s brilliant, and I’m doing it with you,'” said Hausmann. Kaufman became the co-founder and will present the workshop version of his new play, \"The Album,\" inspired by real-life photographs depicting Auschwitz-Birkenau officers at a staff retreat, in partnership with Tectonic Theater Project this summer.\n\nAfter selling out the winter run of Golem, Hausmann approached the City of Miami Beach with an 80-page memo detailing how they could become the Colony’s resident theater company. City commissioners handed Hausmann the keys in October 2016.\n\nLast November, Miami New Drama premiered with a multilingual production of Thornton Wilder’s \"Our Town,\" the revered American play about life and death in a small New England town. Hausmann was granted permission by Wilder’s estate to directly translate portions of the text into Spanish by Pulitzer Prize winning Cuban-American playwright Nilo Cruz and into Creole by Jeff Augustin. In an otherwise traditional production, the Haitian and Latino families speak their own languages at home - much like the audience.\n\n“What do we lose when we do that to the text,” said Hausmann. “Nothing - we gain. Haitian families said you got the Haitian family right and Latinos said you got the Latino family was right. But Thornton Wilder got humanity right.”\n\nThis was followed up with \"The Elaborate Entrance of Chad Diety,\" a political satire set in the world of professional wrestling written by Obie-award winning playwright Kristoffer Diaz, presented with Asolo Repertory Theater. Written 10 years ago, it unnervingly resonates with the racial and cultural conflicts coming to a head in Trump’s America.\n\n“That man Kris Diaz understood where the country was heading in a way that none of us got,” said Hausmann.\n\nThis spring, the company takes on income inequality with \"Queen of Basel,\" an adaptation of the late acclaimed playwright August Strindberg’s \"Miss Julie.\" Often criticized for its misogynistic undertones, Hausmann entrusted Latina playwright Hillary Bettis, one of the writers for the hit FX show The Americans, to “write an adaptation that would make Strindberg roll in his grave.” Set during the carnival-like atmosphere of the swanky Art Basel Miami Beach art festival, the central conflict takes place between Julie, a hotel owner’s daughter, a Venezuelan waitress and her Afro-Cuban fiancé.\n\nHausmann’s approach to adapting classics may rankle theater purists, it might be the very thing that connects with contemporary audiences.\n\n“We can’t have a conversation if we’re not talking about what matters to our community and our country,” said Hausmann. “We have a responsibility by being an immigrant city and a diverse city to defend those values in a time of Trump.”\n\nFOLLOW NBC LATINO ON FACEBOOK, TWITTER AND INSTAGRAM"}, {"url": "https://wiki2.org/en/Mois%C3%A9s_Kaufman", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nMoisés Kaufman (born November 21, 1963) is a Venezuelan theater director, filmmaker, playwright, founder of Tectonic Theater Project, based in New York City, and co-founder of Miami New Drama at the Colony Theatre.[1] He was awarded the 2016 National Medal of Arts by President Barack Obama. He is best known for creating The Laramie Project (2000) with other members of Tectonic Theater Project. He has directed extensively on Broadway and Internationally, and is the author of numerous plays, including Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations.\n\nBorn and raised in Caracas, Venezuela, he moved as a young man to New York City in 1987.[2]\n\nYouTube Encyclopedic\n\n1 / 5 Views: 100 151 1 025 979 855 872 7 634\n\nThe Laramie Project (2001) Trailer | Moises Kaufman\n\nClassic Clips: Moises Kaufman (2009)\n\nQUIERO with Moisés Kaufman: How He Followed His Intuition and Built a Theater Legacy\n\nThe Laramie Project\n\nMoisés Kaufman Directs 'Bent' at the Mark Taper Forum | Center Theatre Group Transcription\n\nBiography\n\nKaufman is of Romanian-Jewish and Ukrainian-Jewish descent, and was born in Caracas, Venezuela.[3] He is an alumnus of Venezuela's Universidad Metropolitana, where he began to study theatre.[4] After immigrating to the United States, he went to college in New York and graduated from NYU.[5]\n\nIn 2005 he described himself in an interview by saying, \"I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn't write anything that didn't incorporate all that I am.\"[6]\n\nKaufman was awarded a Guggenheim Fellowship in 2002, following the premiere of The Laramie Project, which was based on extensive interviews with residents and commentators in and around Wyoming who were involved with the aftermath of the murder of gay student Matthew Shepard.[7]\n\nHe made his Broadway directing debut in the 2004 production of I Am My Own Wife by Doug Wright, for which he received a Tony Award nomination for Best Direction of a Play.\n\nOn September 22, 2016, Kaufman was awarded the National Medal of Arts and Humanities in a ceremony conducted by U.S. president Barack Obama. He is the first Venezuelan to receive the honor.[5]\n\nIn 2022, Kaufman was included in the book 50 Key Figures in Queer US Theatre, profiled in a chapter written by theatre scholar Bess Rowen.[8]\n\nAwards\n\nStage directing credits\n\nFilm credits\n\nTelevision credits\n\nSee also\n\nReferences"}, {"url": "https://www.advocate.com/arts-entertainment/2016/9/22/10-things-know-about-moises-kaufman", "page_content": "Moises Kaufman, known for writing and/or directing such plays as The Laramie Project, Gross Indecency: The Three Trials of Oscar Wilde, and I Am My Own Wife, today will receive the National Medal of Arts from President Obama at the White House. The medal recognizes outstanding contributions to the excellence, growth, support, and availability of the arts in the United States. Kaufman is in good company; among this year's other recipients are film director Mel Brooks, author Sandra Cisneros, actor Morgan Freeman, composer Philip Glass, and actress-singer Audra McDonald. (See the full list here.) Kaufman has had a long and varied career, and some facts about his life and work may surprise even devoted fans. Read on for 10 things you should know about Moises Kaufman.\n\nHe is the son of a Holocaust survivor.\n\nKaufman's father, Jose, was a Romanian Jew who survived the Holocaust. As a boy, Jose earned money by making and selling the yellow Stars of David that the Nazi regime forced Jews to wear. \"He spent most of the war alternately hiding in a small room and selling Stars of David,\" Moises Kaufman recalled in the book A Memory, a Monologue, a Rant, and a Prayer, edited by Eve Ensler. After World War II was over, Jose made his way to Caracas, Venezuela. There he worked in a grocery store and eventually bought one, and he married Dora Akerman, a Venezuelan-born woman of Ukrainian descent. Moises was born in Caracas in 1963. His parents brought him up in the Orthodox branch of Judaism, and he attended a yeshiva -- a Jewish religious school -- which made Moises quite the outsider in the heavily Catholic nation, as did his realization at age 11 that he was gay. Moises moved to New York City in 1987 to pursue his theatrical career, in which many of his projects have dealt with outsiders, and some have touched directly on the Holocaust. In 2015 he directed a revival of Bent, Martin Sherman's play about gay men in a concentration camp, at Los Angeles's Mark Taper Forum.\n\nThe Laramie Project was a massive undertaking.\n\nFor The Laramie Project, which deals with the brutal murder of gay college student Matthew Shepard and the reactions of the townspeople in Laramie, Wyo., Kaufman and his colleagues at the Tectonic Theater Project compiled 400 hours of interviews from over 200 people. Kaufman was in New York City when he heard about the attack on Shepard in October 1998. \"I started getting phone calls -- 'Did you hear what happened?' -- and then I read it in the newspaper and I saw it on television,\" he recalled to The Advocate in 2008. \"People have spoken about how we as gay people feel attacked, injured, constantly in our culture. And that image of that boy tied to the fence spoke to so many of us about our pain and about our sense of how we fit into the landscape of this country. The impact of seeing what this was doing to the country--that's when I decided to go to Laramie and do The Laramie Project.\" The Laramie Project premiered in 2000, has been performed widely, and was adapted into an HBO movie, directed by Kaufman, in 2002. And 10 years after Shepard's death Kaufman and his Tectonic collaborators returned to Laramie to compile a sequel, The Laramie Project: Ten Years Later, which premiered in 2009.\n\n[rebelmouse-image 32740833 expand=1 dam=1 alt=\"WATCH: True Life: \"I Have a Trans Parent\"\" site_id=25879312 is_animated_gif=false original_size=\"750x563\" crop_info=\"%7B%22image%22%3A%20%22https%3A//assets.rbl.ms/32740833/origin.jpg%22%2C%20%22thumbnails%22%3A%20%7B%22origin%22%3A%20%22https%3A//assets.rbl.ms/32740833/origin.jpg%22%2C%20%22300x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D300%22%2C%20%221500x2000%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1500%26height%3D2000%26coordinates%3D308%252C0%252C20%252C0%22%2C%20%22700x1245%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D700%26height%3D1245%26coordinates%3D361%252C0%252C73%252C0%22%2C%20%22600x200%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D200%26coordinates%3D0%252C178%252C0%252C135%22%2C%20%22600x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%22%2C%20%22300x300%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D300%26height%3D300%26coordinates%3D188%252C0%252C0%252C0%22%2C%20%221200x600%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1200%26height%3D600%26coordinates%3D0%252C116%252C0%252C73%22%2C%20%22600x600%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D600%26coordinates%3D188%252C0%252C0%252C0%22%2C%20%222000x1500%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D2000%26height%3D1500%26coordinates%3D0%252C1%252C0%252C0%22%2C%20%22600x300%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D300%26coordinates%3D0%252C116%252C0%252C73%22%2C%20%22750x1000%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D750%26height%3D1000%26coordinates%3D308%252C0%252C20%252C0%22%2C%20%221200x800%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1200%26height%3D800%26coordinates%3D0%252C53%252C0%252C10%22%2C%20%22210x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D210%22%2C%20%221200x400%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1200%26height%3D400%26coordinates%3D0%252C178%252C0%252C135%22%2C%20%221245x700%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1245%26height%3D700%26coordinates%3D0%252C93%252C0%252C50%22%2C%20%221000x750%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1000%26height%3D750%26coordinates%3D0%252C1%252C0%252C0%22%2C%20%22600x400%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D400%26coordinates%3D0%252C53%252C0%252C10%22%2C%20%22980x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D980%22%2C%20%2235x35%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D35%26height%3D35%22%7D%2C%20%22manual_image_crops%22%3A%20%7B%229x16%22%3A%20%7B%22sizes%22%3A%20%5B%22700x1245%22%5D%2C%20%22top%22%3A%200%2C%20%22height%22%3A%20563%2C%20%22width%22%3A%20316%2C%20%22left%22%3A%20361%7D%2C%20%22600x300%22%3A%20%7B%22sizes%22%3A%20%5B%22600x300%22%5D%2C%20%22top%22%3A%20116%2C%20%22height%22%3A%20374%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%223x1%22%3A%20%7B%22sizes%22%3A%20%5B%221200x400%22%2C%20%22600x200%22%5D%2C%20%22top%22%3A%20178%2C%20%22height%22%3A%20250%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%223x2%22%3A%20%7B%22sizes%22%3A%20%5B%221200x800%22%2C%20%22600x400%22%5D%2C%20%22top%22%3A%2053%2C%20%22height%22%3A%20500%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%221x1%22%3A%20%7B%22sizes%22%3A%20%5B%22600x600%22%2C%20%22300x300%22%5D%2C%20%22top%22%3A%200%2C%20%22height%22%3A%20563%2C%20%22width%22%3A%20562%2C%20%22left%22%3A%20188%7D%2C%20%223x4%22%3A%20%7B%22sizes%22%3A%20%5B%221500x2000%22%2C%20%22750x1000%22%5D%2C%20%22top%22%3A%200%2C%20%22height%22%3A%20563%2C%20%22width%22%3A%20422%2C%20%22left%22%3A%20308%7D%2C%20%2216x9%22%3A%20%7B%22sizes%22%3A%20%5B%221245x700%22%5D%2C%20%22top%22%3A%2093%2C%20%22height%22%3A%20420%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%224x3%22%3A%20%7B%22sizes%22%3A%20%5B%222000x1500%22%2C%20%221000x750%22%5D%2C%20%22top%22%3A%201%2C%20%22height%22%3A%20562%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%222x1%22%3A%20%7B%22sizes%22%3A%20%5B%221200x600%22%2C%20%22600x300%22%5D%2C%20%22top%22%3A%20116%2C%20%22height%22%3A%20374%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%7D%7D\" caption=\"You've viewed the adventures of the Pfefferman family; now see some real-life young adults dealing with a parent's transition in a new episode of MTV's True Life, \\\"I Have a Trans Parent.\\\" Follow Kiara as she gets to know her \\\"Pops,\\\" the parent she previously knew as her mother, and Jeffrey as he accepts his father as a transgender woman and strives to help his brothers do the same. The episode airs Monday at 11:30 p.m./10:30 Central; watch a preview below.\n\n\" photo_credit=\"\"]\n\nGross Indecency: The Three Trials of Oscar Wilde was banned in Russia.\n\nThis was Kaufman's debut as a playwright, opening off-Broadway in 1997, and it was a major success. It received numerous critics' awards and a GLAAD Media Award. It has been produced in dozens of cities in the U.S. and abroad, but a planned production in Moscow was abruptly canceled in 2015. The production was to be funded in part by the U.S. State Department, but the Russian government stepped in and said the Moscow theater company that was to stage it could not accept foreign funds. The real reason for the cancellation, Kaufman believes, was that this depiction of the great gay author and wit ran afoul of Russia's \"gay propaganda\" law, which bans any positive discussion of LGBT people or issues in forums accessible to minors. The play did receive a a star-studded benefit reading in New York City in the fall of 2015 to support the Tectonic Theater Project and the International Gay and Lesbian Human Rights Commission.\n\nPictured: Kaufman (left) and Ben Foster clown around at the premiere of the HBO film of The Laramie Project.\n\nThe Laramie Project has run into trouble a few places too.\n\nThe Laramie Project's gay subject matter has led high school administrators to cancel performances of the play in places as varied as Spokane, Wash.;Ottumwa, Iowa; and Burbank, Calif. The students in Burbank eventually were able to stage their production, although not at their high school -- it went on at the Los Angeles suburb's Colony Theatre, which donated the space, and with help from Tectonic. But the play also has had well-received, school-supported productions in many places in the U.S., including Xavier High School, a Roman Catholic institution in New York City.\n\nHis play 33 Variations gave Jane Fonda her first Broadway role in 46 years.\n\nKaufman wrote and directed 33 Variations, about a music scholar studying one of Beethoven's most enigmatic works, and when it premiered on Broadway in 2009, Jane Fonda played the lead role. This was Fonda's first Broadway appearance since 1963, and she received positive reviews. \"Whatever discomfort the actress may feel melds into her portrayal of Dr. Katherine Brandt, whose naturally assertive nature is humbled by the progressive, atrophying illness known as Lou Gehrig's disease,\" Ben Brantley wrote in The New York Times, adding, \"For those who grew up enthralled with Ms. Fonda's screen image, it's hard not to respond to her performance here, on some level, as a personal memento mori.\"\n\nHe discovered a different side of Robin Williams during Bengal Tiger at the Baghdad Zoo.\n\nFonda isn't the only major movie star who has appeared in a Kaufman play. In 2011, Robin Williams starred in Bengal Tiger at the Baghdad Zoo, a meditation on the Iraq war written and directed by Kaufman. Williams portrayed a tiger who is killed in the first scene and then haunts the rest of the characters for the remainder of the play. Williams initially started rehearsals with what Kaufman called \"the 10 a.m. stand-up.\" \"He would start talking about whatever crossed his mind and would riff on it for the next 20 or 30 minutes, keeping all of us -- actors, designers, stage management -- roaring with laughter,\" Kaufman wrote in Salon in 2014, after Williams's suicide. \"Like everyone, I was dazzled by the speed of his brain and the quickness of his wit, but I also noticed something else: an actor's natural trepidation about tackling a demanding role. As he developed his character ... the 10 a.m. monologues became shorter and shorter. He was feeling more at home in the rehearsal room, finding his groove in the role. Until, finally, the monologues were gone.\" Williams also developed \"a real camaraderie\" with his castmates -- and he occasionally showed signs of depression, the playwright noted. \"For me, it isn't his brilliant sense of humor, or his wit, or his chameleon abilities that I'll miss,\" Kaufman concluded. \"I'll miss the guy who came to rehearsal every day with humility and kindness, who sat around at lunch and shot the breeze. I'll miss the man who loved what he did every day. And who loved this community. I will miss my friend.\"\n\nHe's even directed operas, including one based on Puss in Boots.\n\nKaufman has proved his versatility time and again. In 2010 he took on the direction of Spanish composer Xavier Montsalvatge's chamber opera adaptation of the popular fairy tale. The production incorporated both puppets and human actors. Staging a show aimed at children was intimidating and also rewarding, Kaufman told the New York Daily News. \"I've never been more scared in my life, because children don't lie,\" he said. On the other hand, he noted, \"There's nothing better than hearing children laugh.\"\n\nHis most recent project is a reimagining of Bizet's Carmen.\n\nNothing if not adventurous, Kaufman and cowriter Eduardo Machado adapted Georges Bizet's 19th-century opera into Carmen: An Afro-Cuban Jazz Musical, set in 1958, changing the locale from Spain to Cuba, and making the sensuous factory worker Carmen a black woman who supports Fidel Castro's revolution. Composer Arturo O'Farrill adapted Bizet's melodies into jazzy tunes with lyrics by Kaufman and others. The play had its world premiere, directed by Kaufman, in February of this year at the Olney Theatre Center in Montgomery County, Md., near Washington, D.C.\n\nDespite all his success, Kaufman describes himself as shy and socially awkward.\n\n\"I'm incredibly shy, I am socially awkward, and I don't have many other interests other than my work,\" he told Los Angeles's Jewish Journal in 2011. \"When I'm in the rehearsal room, I'm my best self. I've always known how to live in my work. I am not so good at living my life.\"\n\nBut he has managed to have a long-term relationship. He is married to Jeffrey LaHoste, with whom he founded the Tectonic Theater Project.\n\nKaufman and LaHoste founded Tectonic in 1991, with the goal of \"developing innovative works that explore theatrical language and form, fostering an artistic dialogue with audiences on the social, political, and human issues that affect us all,\" according to the New York-based company's website. Kaufman is its artistic director, and LaHoste, a writer and producer, is a member of the board of directors. LaHoste has produced many of Kaufman's plays and several other projects, such as Kirby Dick's 2009 documentary film Outrage, about closeted politicians who support anti-LGBT legislation. He is also the author of author of Elysian Fields, a television series in development that was chosen as a participating project in the Producers' Guild of America's Diversity Workshop. Kaufman and LaHoste have been together for more than 20 years, and they were married in 2014."}, {"url": "https://apnews.com/article/entertainment-new-york-city-theater-aj-shively-c62c294d48749ab1ce5aaf7670157dc1", "page_content": "FILE - Director and playwright Moises Kaufman appears during a ceremony in the East Room of the White House for the National Medal of Arts in Washington on Sept. 22, 2016. Kaufman's latest production, \"Paradise Square,\" is nominated for 10 Tony Awards. (AP Photo/Carolyn Kaster, File)\n\nFILE - Director and playwright Moises Kaufman appears during a ceremony in the East Room of the White House for the National Medal of Arts in Washington on Sept. 22, 2016. Kaufman's latest production, \"Paradise Square,\" is nominated for 10 Tony Awards. (AP Photo/Carolyn Kaster, File)\n\nNEW YORK (AP) — Seven years ago, Moisés Kaufman was approached to direct the Broadway musical “Paradise Square” and, after reading it, he immediately said yes.\n\n“I did this show because it spoke to me,” the Venezuelan theater director and playwright says. “So much of my work occurs at the intersection of the personal and the political. I like to look at history through the eyes of the other, through the eye of the person that doesn’t get to tell their story.”\n\nNow “Paradise Square” — about unity and racism in New York’s notorious Five Points neighborhood, where Irish immigrants and Black Americans jostled to survive in the years before the Civil War — is nominated for 10 Tony Awards, including best musical, best lead actress for Joaquina Kalukango, and best featured actor for both Sidney DuPont and A.J. Shively.\n\nDuring a recent interview with The Associated Press, Kaufman, himself an immigrant based in New York City, reflected on immigration and the roots of American divisions.\n\n“Immigration is a great fallacy, because you never leave the country where you were born, and you never arrive in the country where you land. Your being is always divided, part of you is there and part of you is here,” he said.\n\nThe founder of Tectonic Theater Project — best known for “The Laramie Project” and who has received awards including the National Medal of Arts — also spoke about the relevance of the show today and the powerhouse that is Kalukango as the courageous bar owner Nelly O’Brien.\n\nRemarks have been edited for brevity and clarity.\n\n___\n\nAP: You have directed plays on Broadway, but this is your first Broadway musical. Did you expect “Paradise Square” to get 10 nominations?\n\nKAUFMAN: No, I did not expect it. It was a great joy to hear that and to get that, and it’s been really rewarding! I did this show because it spoke to me. I don’t know, something about looking at America through the eyes of that community, a community where Irish immigrants and Black natives were getting married and living together and doing business together in 1863! When in the South, Black people were still slaves, here there was a community where people were living and loving together. It spoke to me.\n\nAP: You are also an immigrant directing a show about immigrants. How did this inform the process?\n\nKAUFMAN: Well, that was another way into the material. Like a lot of immigrants, we arrive here with a dream, with an expectation of what we want our lives to be like. And we have this whole mythology of what America provides and what one is able to do in America. And invariably, whether you succeed or you fail, you have to confront the reality of America. There’s always a gap between the reality of America and the dream of America. I think that the poorer you are, the distance between that reality and that image widens. So, of course, it’s much harder for a poor person to come to America and realize their dreams than it is for a wealthy person to come to America and realize their dreams. I don’t know, there was something about these immigrants arriving in this country and then finding community with the least likely of partners that really spoke to me.\n\nAP: What was the biggest challenge of directing this show?\n\nKAUFMAN: The biggest challenge was that we knew that we wanted to tell an epic story. You don’t see musicals of this size on Broadway anymore or on the West End. You know, they’re un-producible — 36 actors on stage, 10 more actors off stage just being standbys, an orchestra of 50 people. It is a very big musical. At times we felt like, who do we want the audience to fall in love with and follow for the course of the play when you have so many characters? And how do you craft it in a way that you can follow all of them, and that you can follow the intricacies of this historical musical?\n\nAP: Joaquina Kalukango gets a standing ovation before the show even ends — after “Let It Burn.” What can you tell me about her? Do you ever worry she might get sick?\n\nKAUFMAN: We have two understudies for her, and they’re both very good. But Joaquina — every so often a monster arrives at the theater and that’s her, she’s a theatrical monster. And in real life she’s the most unassuming person in the world. She’s a Juilliard graduate, she’s a brilliant actor, and she can sing like that. It’s just an astonishing thing to watch.\n\nAP: “Paradise Square” happens in the 1800s, but it is still very relevant. What is the most important message that people can get from this musical today?\n\nKAUFMAN: I’m always a little afraid of that question, because I feel that if I tell you the message that I want people to get, I am denying the audience part of the fun, which is for them to figure out what they see in the play. But what I can tell you is that what interested me is to see how deep the roots of our divisions are, and to see what are the forces that keep fueling those divisions. You know, America is a melting pot where nothing ever melted. So how do we aspire to a more perfect union? I think that the answer to that is by really understanding what are the things that tear us apart, and the play talks a lot about that.\n\n___\n\nSigal Ratner-Arias is on Twitter at https://twitter.com/sigalratner."}], "Moisés Kaufman is a director, playwright, and screenwriter.": [{"url": "https://www.britannica.com/biography/Moises-Kaufman", "page_content": "Moisés Kaufman, (born November 21, 1963, Caracas, Venezuela), Venezuelan-born playwright and director who is best known for perceptive and moving plays often rooted in issues of sexuality. He was cofounder in 1991 of Tectonic Theater Project, a company dedicated to examining the structure and language of theatre as well as addressing contemporary social issues.\n\nKaufman was born in Venezuela to Orthodox Jewish parents and was of Ukrainian and Romanian descent. He attended a yeshiva (Jewish religious school) as a child and was exposed to broader culture on family trips to New York City. A Caracas theatre festival he attended as a young teenager brought him exposure to the avant-garde plays of such artists as Peter Brook, Tadeusz Kantor, Pina Bausch, and Jerzy Grotowski, whom he cited as his early influences. While attending Metropolitan University in Caracas (B.A. in business administration, 1985), Kaufman joined a touring experimental theatre group as an actor. In 1987 he moved to New York City, where he studied theatre directing at the Tisch School of the Arts, New York University, meanwhile directing a variety of plays. It was at NYU that he honed his ideas about the purpose and most-effective means of presenting theatrical performances. Four years later Kaufman, together with his partner, Jeffrey LaHoste, established Tectonic Theater Project.\n\nKaufman’s writing debut, Gross Indecency: The Three Trials of Oscar Wilde (performed 1997–98, published 1997), illustrated his concerns as a writer-director. He was especially interested in what he termed “watershed historical moments,” events that reveal the foundations of society’s beliefs. A powerful and moving play that used actual trial testimony, Gross Indecency won an Outer Critics Circle Award for outstanding Off-Broadway play. Kaufman and his troupe then began work on The Laramie Project (performed 2000, published 2001, television movie 2002), interviewing numerous residents of the small Wyoming city in which gay college student Matthew Shepard had been brutally murdered. The play had particular resonance with Kaufman, who was gay, and it proved popular throughout the world.\n\nIn 2003 Kaufman directed a one-man show, Doug Wright’s I Am My Own Wife: Studies for a Play About Charlotte von Mahlsdorf (performed 2003–04), the story of a gay transvestite who survived life in Nazi Germany and Soviet East Berlin. It was critically acclaimed and resulted in a Tony Award nomination for Kaufman. In the next several years Kaufman directed a variety of plays, including Wilde’s Lady Windermere’s Fan and Shakespeare’s Macbeth. He also directed his own play 33 Variations (first performed 2007), starring Jane Fonda as a musicologist obsessed with Beethoven’s Diabelli Variations, and received another Tony nomination. In 2009 Kaufman and other Tectonic members arranged for 150 simultaneous readings in theatres across the globe of a sequel, The Laramie Project: Ten Years Later. He also directed Rajiv Joseph’s Bengal Tiger at the Baghdad Zoo (performed 2011), starring Robin Williams as the title character; a 2012–13 revival of Ruth and Augustus Goetz’s The Heiress, a play based on Henry James’s novel Washington Square; and a revival of Torch Song (2018–19), which was written by Harvey Fierstein. In 2016 Kaufman received the National Medal of Arts."}, {"url": "https://www.nytimes.com/2019/06/16/us/moises-kaufman-stonewall-50.html", "page_content": "Merely a year later, some 5,000 activists held the first pride march in New York City — with similar marches held in Chicago and Los Angeles. And the rallying cry of the movement became: “We must all come out of the closet. We must make ourselves known.”\n\nCamus also states in his book that “in every act of rebellion,” the rebel experiences a “complete and spontaneous loyalty to certain aspects of himself.” Just four years after the riots, in 1973, we said “no” to the American Psychiatric Association, and its leaders at long last removed the diagnosis of homosexuality from its official list of mental illnesses.\n\nThe next year, 1974, we said “no” to being politically powerless when Elaine Noble, the first out lesbian to run for a state-level political office, was elected to the Massachusetts State Legislature. And, famously, in 1977, an openly gay man, Harvey Milk, was elected to the San Francisco Board of Supervisors.\n\nBut as the battle went on, and as the character of the homosexual was being redrawn in revolt, 1981 brought about the first cases of the AIDS epidemic. And the death toll — and the country’s initial refusal to respond to it — brought to the surface the depth of homophobia, transphobia and other queer-centered bigotry in the American psyche.\n\nA radical rethinking of tactics and actions was needed, and a new kind of gay activist was born. Lambda Legal, GMHC (formerly the Gay Men’s Health Crisis), Act Up and a host of other organizations redefined the way civil rights wars were being fought."}, {"url": "https://stageagent.com/writers/3201/moises-kaufman", "page_content": "Moisés Kaufman is a playwright, director, and founder of the Tectonic Theater Project based in New York City.\n\nKaufman was born in Caracas, Venequela on November 21, 1963. His family is Orthodox Jewish of Romanian and Ukrainian descent. He attended a yeshiva (a Jewish religious school) as a child. While growing up, he was first exposed to theatre on family vacations to New York City. As a teenager, he attended a Caracas theatre festival which introduced him to the work of avant grade theater artists Peter Brook, Tadeusz Kantor, Pina Bausch, and Jerzy Grotowski, whom he cites as his earliest influences. He attended Metropolitan University in Caracas. During his time at university, he acted in a touring experimental theatre group.\n\nIn 1987, Kaufman moved to New York City to study directing at NYU's Tisch School of the Performing Arts. Four years later, he and his partner, Jeffrey LaHoste, created the Tectonic Theatre Project. The company is dedicated to addressing contemporary social issues, as well as to explore the structure and language of theatre.\n\nKaufman has stated that he is primarily drawn to moments in history that unintentionally reveal a society's views and belief systems. His first play, Gross Indecency: The Three Trials of Oscar Wilde, premiered in New York City in 1997. It won the Outer Critics Circle Award for Outstanding Off-Broadway play.\n\nFrom 1998-1999, Kaufman and the Tectonic Theater Project traveled to Laramie, Wyoming to interview those connected to the murder of gay college student Matthew Shepard. The ensuing work compiled from their interviews, The Laramie Project, premiered in 2000 and was made into a film for HBO on 2001. The play gathered a worldwide following and has become a seminole work for the LGBQT community and for professional theaters, universities, high schools, and community theaters.\n\nIn 2003, Kaufman directed Doug Wright's I Am My Own Wife: Studies for a Play About Charlotte von Mahlsdorf. The play follows a gay transvestite who survived life in Nazi Germany and Soviet East Berlin. Kaufman received a Tony Award nomination for his direction. In 2007, Kaufman directed for Broadway again, this time for his own play, 33 Variations starring Jane Fonda as a musicologist obsessed with Beethoven’s Diabelli Variations. This garnered him his second Tony nomination.\n\nIn 2009, Kaufman and other members of the Tectonic Theater Project reunited to create The Laramie Project: Ten Years Later, a sequel to the original piece. It was performed in staged readings around the globe.\n\nIn 2011, he directed Rajiv Joseph's Bengal Tiger At the Baghdad Zoo on Broadway starring Robin Williams. In 2012, he directed a revival of Ruth and Augustus Goetz's The Heiress on Broadway.\n\nMr. Kaufman has been honored with a Steinberg/ATCA Best New Play Award, a Dike Award, an Outer Critics Circle Award, a GLAAD Media Award, a Drama Desk Award, a Lucille Lortel Award, a Carbonell Award, a Bay Area Theater Critics Circle Award, a Lambda Book Award, Venezuela's Casa del Artista, American Library Association's GLBT Literature Award, the Matthew Shepard Foundation’s “Making A Difference Award\", the Artistic Integrity Award from the Human Rights Campaign, the National Board of Review Award for Outstanding Made for Television Movie, a Golden Bear Award from the Berlin Film Festival, the Humanitas Prize,the Joe A. Callaway Award, and two Tony Award nominations.\n\nFor more information on the Tectonic Theater Project, visit their website: http://tectonictheaterproject.org."}, {"url": "https://www.shakespearetheatre.org/watch-listen/highlighting-playwright-moises-kaufman/", "page_content": "Highlighting Playwright Moisés Kaufman\n\nMoisés Kaufman\n\nMoisés Kaufman is an award-winning Venezuelan playwright, theatre director, filmmaker, and teacher. He was born in Caracas to Orthodox Jewish parents and is of Ukrainian and Romanian descent. Kaufman’s work is heavily influenced by his identity as a gay, Jewish man.\n\nIn 1985, he got his BA in Business Administration at the Metropolitan University in Caracas where he joined a touring experimental theatre group. He then relocated to New York to study theatre directing at the Tisch School of the Arts.\n\nIn 1991 he founded the Tectonic Theater Project, a theatre group based in New York City that develops productions focused on political and social issues. Their ideas stem from the collaboration of diverse individuals as well as extensive research on a multitude of topics.\n\nKaufman is an activist at heart and his company has created a plethora of plays and musicals that take on social and political issues that are relevant to modern audiences. His work includes Gross Indecency: The Three Trials of Oscar Wilde, 33 Variations, and The Laramie Project, among others.\n\nHis Broadway work includes directing plays such as the Pulitzer Prize finalist Bengal Tiger at the Baghdad Zoo by Rajiv Joseph (starring Robin Williams), Doug Wright’s Pulitzer and Tony Award-winning play I Am My Own Wife (starring Jefferson Mays and earning Kaufman a Tony Award nomination for Best Direction of a Play), Harvey Fierstein’s Torch Song, The Heiress by Ruth and Augustus Goetz (starring Jessica Chastain), and even his own play 33 Variations (starring Jane Fonda).\n\nThe Laramie Project is among the most performed plays in the country. The collaboratively written piece is a response to the brutal and senseless killing of Matthew Shepard, a gay University of Wyoming student. The murder took place in Laramie, Wyoming. Kaufman and his team at the Tectonic Theater Project interviewed family, friends, neighbors, and more within the small town of Laramie and their words are front and center in this documentary-style theatre production. This high-profile hate crime was one of many turning points in the LGBTQ+ community and inspired not only plays, but songs, films, novels, and other forms of media.\n\nIn September of 2016, Kaufman was awarded the National Medal of Arts and Humanities by President Barack Obama. He is the first Venezuelan to receive this award. To learn more about Kaufman and his work, visit his page on the Tectonic Theater Project website, which features links to articles about Kaufman, a timeline of his career, and an in depth look at his life and achievements."}, {"url": "https://www.theatregold.com/content/moises-kaufman/", "page_content": "Let's Get Social\n\nMoisés Kaufman\n\nMoisés Kaufman (born November 21, 1963) is a playwright, director and founder of Tectonic Theater Project. He is best known for writing The Laramie Project with other members of Tectonic Theater Project. He is also the author of Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations. He was born and raised in Caracas, Venezuela and moved to New York City in 1987.[1]\n\nLife\n\nKaufman is of Romanian and Ukrainian Jewish descent.[2] He described himself in an interview by saying “I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.”[3]\n\nKaufman was awarded a Guggenheim Fellowship in 2002.[4] He made his Broadway directing debut in the 2004 production of I Am My Own Wife by Doug Wright, for which he received a Tony Award nomination for Best Direction of a Play. On September 22, 2016, Kaufman was the first Venezuelan awarded the National Medal of Arts in ceremony conducted by U.S. president Barack Obama. He is a graduate of NYU[5]\n\nAwards\n\nSteinberg/ATCA Best New Play Award—2008: “33 Variations”\n\nOuter Critics Circle Award\n\nGLAAD Media Award\n\nDrama Desk Award\n\nLucille Lortel Award, 1998 Outstanding Play Gross Indecency:The Trials of Oscar Wilde – Playwright\n\nCarbonell Award\n\nBay Area Theater Critics Circle Award\n\nLambda Book Award\n\nVenezuela’s Casa del Artista\n\n2004 Obie Award, Best Direction I Am My Own Wife – Director\n\nAmerican Library Association’s LGBT Literature Award\n\nMatthew Shepard Foundation’s “Making A Difference Award”\n\nArtistic Integrity Award from the Human Rights Campaign\n\nNational Board of Review Award for Outstanding Made for Television Movie\n\nGolden Bear Award from the Berlin Film Festival\n\nHumanitas Prize\n\nJoe A. Callaway Award – 1997 – Gross Indecency:The Trials of Oscar Wilde Director\n\nThe Tony Award\n\n2016 National Medal of Arts and Humanities\n\nTheatre Work\n\nDirecting Credits\n\nBengal Tiger at the Baghdad Zoo\n\nPuss in Boots (El Gato con Botas)\n\n33 Variations\n\nMacbeth (with Liev Schreiber) for The Public Theater’s Shakespeare in the Park\n\nLady Windermere’s Fan\n\nThis Is How It Goes\n\nInto The Woods\n\nMaster Class (with Rita Moreno)\n\nOne Arm by Tennessee Williams\n\nI Am My Own Wife\n\nThe Laramie Project\n\nGross Indecency: The Three Trials of Oscar Wilde\n\nMarlow’s Eye\n\nThe Nest\n\nWomen in Beckett\n\nMachinal\n\nCoxinga\n\nThe Nightingale\n\nThe Heiress\n\nTorch Song Trilogy\n\nParadise Square\n\nAuthor Credits\n\n1. Standing On Ceremony: The Gay Marriage Plays Minetta Lane Theatre 11/13/2011 Author 2. One Arm Acorn Theater 06/09/2011 Adapation 3. The Laramie Project Union Square Theatre 03/18/2000 Playwright 4. Gross Indecency:The Trials of Oscar Wilde Minetta Lane Theatre 06/05/1997 Playwright\n\nFilm Credits\n\nThe Laramie Project\n\nThe L Word (2 episodes)\n\nReferences\n\n1 Hurwitt, Robert (2001-05-20). “The ‘Laramie’ process”. San Francisco Chronicle.\n\n2 Robert Myers (25 May 1997). “‘Nothing Mega About It Except the Applause'”. The New York Times. Retrieved 6 July 2009.\n\n3 Orozco, Jose (March 21, 2005). “True To Reality: An Interview with Moises Kaufman”. Morphizm. Retrieved 6 August 2012. I am Venezuelan, I am Jewish, I am gay, I live in New 4 York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.\n\n5 “Moisés Kaufman”. John Simon Guggenheim Memorial Foundation. 2002. Archived from the original on 2011-06-22. Retrieved 2009-03-03.\n\n6 http://www.nyu.edu/about/news-publications/news/2016/september/ArtsAccoladesSeptember.html\n\n7 Full References at WIKI\n\nExternal Links\n\nMoisés Kaufman – Bio, Moisés Kaufman, theatre director, Tectonic Theater Project, The Laramie Project, Gross indecency the three trials of oscar wilder, Paradise Square, Torch Song, The Heiress, The Nightingale, Machinal, Women Beckett, Master Class, Into the Woods, 33 Variations"}, {"url": "https://news.virginia.edu/content/award-winning-playwright-and-director-moises-kaufman-visit-uva", "page_content": "On April 26 and 27, the University of Virginia welcomes one of theater’s luminaries, Moisés Kaufman, to share his creative insights with students, faculty, staff and the Charlottesville community. His mini-residency will include two classroom visits and a public talk and book signing.\n\nMoisés Kaufman is the founder and artistic director of Tectonic Theater Project, a Tony- and Emmy-nominated director and playwright, and a recipient of the National Medal of Arts. His play “The Laramie Project” (which he wrote with the Tectonic Theater Project company) is among the most performed in America. He is an Obie winner and a Guggenheim Fellow in Playwriting.\n\nThe centerpiece of Kaufman’s visit is a public talk and moderated conversation to be held April 26 at 6:15 p.m. in the Ruth Caplin Theatre. The event is free, but patrons must obtain tickets through the Arts Box Office, with a limit of one ticket per student and two for other patrons. Tickets are available through April 19 to University staff, faculty and students only, after which they will be available to the general public; tickets must be obtained in person. UVA faculty, staff and students will need a UVA ID.\n\nMoisés Kaufman is the founder and artistic director of Tectonic Theater Project; his play “The Laramie Project” is among the most performed in America. (Contributed photo)\n\nA book signing for “Moment Work: Tectonic Theater Project’s Process of Devising Theater” will follow directly after the talk, in the Caplin Theatre’s upper lobby. “Moment Work” is a detailed manual of the Tectonic Theater Project’s method and a chronicle of how the group wrote some of its best-known works.\n\nKaufman said he is most excited to share his experiences with UVA drama students in two classes, one in playwriting and the other in acting.\n\n“I am very much looking forward to making my first-ever visit to Charlottesville and to the University of Virginia,” he said. “As a lifelong student of history, I am particularly interested in exploring Mr. Jefferson’s University and hometown. Most of all, I am eager to connect with the emerging theater artists at UVA who will soon be leading the way.”\n\nColleen Kelly, professor and chair of the Drama Department, will host Kaufman in her M.F.A. acting class on April 27.\n\n“I’m especially interested in our students learning about the integrated process that Tectonic Theater Project uses to develop new works,” she said. “It’s my hope that our playwrights, designers, technicians and performers are inspired to think in new ways about collaboration and reminded that their work can make a difference in the world.”\n\nKaufman will also visit undergraduate students on April 26 in an “Advanced Playwriting” course led by Doug Grissom, an associate professor of drama.\n\nKaufman’s work is known for celebrating difference and critiquing our national response to bias and hate crimes. “The Laramie Project” is based on the life and death of Matthew Shepard, a gay college student who was beaten and left for dead in October 1998.\n\nRecognizing his work’s impact on national conversations about diversity and LGBTQ rights, UVA’s Office of Equal Opportunity and Civil Rights – a co-sponsor of Kaufman’s visit – is hosting a reception for Kaufman and the LGBTQ and theater and arts communities during his stay.\n\n“We thought it was particularly important and timely to bring Moisés to Grounds,” said Catherine Spear, associate vice president for equal opportunity and civil rights. “His creativity and vision will generate meaningful dialogue here about equality and diversity.”\n\nOther co-sponsors of Kaufman’s visit include the Office of the Executive Vice President and Provost, the Vice Provost for the Arts and the Department of Drama.\n\nSaid Jody Kielbasa, vice provost for the arts, “We are honored to host Moisés Kaufman, whose extraordinary impact as an artist was recognized by President Barack Obama by both a National Medal for the Arts, and Kaufman’s attendance when the president signed into law the Matthew Shepard and James Byrd Jr. Hate Crimes Prevention Act.”\n\nKaufman’s Broadway directing credits include the revival of “The Heiress” with Jessica Chastain; “33 Variations” (which he also wrote) starring Jane Fonda, nominated for five Tony Awards; Rajiv Joseph’s Pulitzer Prize finalist “Bengal Tiger at the Baghdad Zoo,” with Robin Williams; and Doug Wright’s Pulitzer and Tony Award-winning play “I Am My Own Wife,” with Jefferson Mays. Kaufman also co-wrote and directed the HBO film adaptation of “The Laramie Project,” which received Emmy Award nominations for Best Director and Best Writer.\n\nKaufman’s visit is funded by the UVA Arts Fund for Artistic Excellence (formerly the Arts & Arts Grounds Fund), which supports the innovative creative work of students and faculty at the University. Administered by the Vice Provost for the Arts, funds are awarded across schools and units to support high-quality projects and initiatives in the arts."}, {"url": "https://peoplepill.com/people/moises-kaufman/", "page_content": "Moisés Kaufman (born November 21, 1963) is a Venezuelan theater director, filmmaker, playwright, and founder of Tectonic Theater Project, based in New York City. He was awarded the 2016 National Medal of Arts by President Barack Obama. He is best known for creating The Laramie Project (2000) with other members of Tectonic Theater Project. He has directed extensively on Broadway and Internationally, and is the author of numerous plays, including Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations.\n\nBorn and raised in Caracas, Venezuela, he moved as a young man to New York City in 1987.\n\nBiography\n\nKaufman is of Romanian and Ukrainian Jewish descent, and was born in Caracas, Venezuela. He is an alumnus of Venezuela's Universidad Metropolitana, where he began to study theatre. After immigrating to the United States, he went to college in New York and graduated from NYU.\n\nIn 2005 he described himself in an interview by saying, \"I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn't write anything that didn't incorporate all that I am.\"\n\nKaufman was awarded a Guggenheim Fellowship in 2002, following the premiere of The Laramie Project, which was based on extensive interviews with residents and commentators in and around Wyoming who were involved with the aftermath of the murder of gay student Matthew Shepard.\n\nHe made his Broadway directing debut in the 2004 production of I Am My Own Wife by Doug Wright, for which he received a Tony Award nomination for Best Direction of a Play.\n\nOn September 22, 2016, Kaufman was awarded the National Medal of Arts and Humanities in a ceremony conducted by U.S. president Barack Obama. He is the first Venezuelan to receive the honor.\n\nAwards\n\n2016 National Medal of Arts given to him by President Barack Obama\n\nObie Award - (Best Director) I AM MY OWN WIFE\n\nGuggenheim Fellowship\n\nTony Award Nomination (Best Director) I AM MY OWN WIFE\n\nTony Award Nomination (Best Playwright) 33 VARIATIONS (with Jane Fonda)\n\nNational Board of Review Award for Outstanding Made for Television Movie - THE LARAMIE PROJECT FILM (HBO)\n\nHumanitas Prize\n\nEmmy Nomination (Dest Director) The Laramie Project Film (HBO)\n\nEmmy Nomination (Best Screenwriter - with the Members of Tectonic Theater) THE LARAMIE PROJECT FILM (HBO)\n\nGolden Bear Award from the Berlin Film Festival THE LARAMIE PROJECT FILM (HBO)\n\nSteinberg/ATCA Best New Play Award—2008: 33 Variations\n\nOuter Critics Circle Award BEST DIRECTOR: GROSS INDECENCY: THE THREE TRIALS OF OSCAR WILDE.\n\nLucille Lortel Award BEST DIRECTOR: GROSS INDECENCY: THE THREE TRIALS OF OSCAR WILDE.\n\nGLAAD Media Award\n\nBay Area Theater Critics Circle Award GROSS INDECENCY: THE THREE TRIALS OF OSCAR WILDE\n\nLambda Book Award\n\nVenezuela's Casa del Artista\n\nAmerican Library Association's LGBT Literature Award\n\nMatthew Shepard Foundation's \"Making A Difference Award\"\n\nArtistic Integrity Award from the Human Rights Campaign\n\nCarbonell Award\n\nJoe A. Callaway Award for excellence in directing, given by The Society of Stage Directors and Choreographers\n\nStage directing credits\n\nPARADISE SQUARE (musical). Berkeley Rep.\n\nTORCH SONG (Broadway) Tony Nomination - Best Revival of a Play.\n\nTHE HEIRESS - with Jessica Chastain (Broadway).\n\nBengal Tiger at the Baghdad Zoo starring Robin Williams.(Broadway)\n\nstarring Robin Williams.(Broadway) Puss in Boots (El Gato con Botas)\n\n33 Variations starring Jane Fonda. (Broadway)\n\nstarring Jane Fonda. (Broadway) Macbeth (starring Liev Schreiber) for The Public Theater's Shakespeare in the Park\n\n(starring Liev Schreiber) for The Public Theater's Shakespeare in the Park Lady Windermere's Fan\n\nThis Is How It Goes starring Ben Chaplin at the Donmar Warehouse.\n\nstarring Ben Chaplin at the Donmar Warehouse. Into The Woods\n\nMaster Class (with Rita Moreno)\n\n(with Rita Moreno) One Arm by Tennessee Williams\n\nby Tennessee Williams I Am My Own Wife (2004, his Broadway debut)\n\n(2004, his Broadway debut) The Laramie Project (2000)\n\n(2000) Gross Indecency: The Three Trials of Oscar Wilde\n\nMarlow's Eye\n\nThe Nest\n\nWomen in Beckett\n\nMachinal\n\nCoxinga\n\nThe Nightingale\n\nThe Heiress\n\nTorch Song Trilogy\n\nFilm credits\n\nThe Laramie Project\n\nTelevision credits"}, {"url": "https://www.playwrightshorizons.org/shows/players/moises-kaufman/", "page_content": "Moises Kaufman\n\nDirector\n\nMOISÉS KAUFMAN is a Tony and Emmy nominated director and playwright. His most recent play,33 Variations, starring Jane Fonda, was nominated for 5 Tony Awards (including one for Ms. Fonda). Previous to that, Mr. Kaufman directed the Pulitzer and Tony award-winning play I Am My Own Wife, earning him an Obie Award for his direction as well as Tony, Drama Desk, Outer Critics Circle and Lucille Lortel nominations. His plays Gross Indecency: The Three Trials of Oscar Wildeand The Laramie Project have been among the most performed plays in America over the last decade. Mr. Kaufman also directed the film adaptation of The Laramie Project for HBO, which was the opening night selection at the 2002 Sundance Film Festival and won the National Board of Review Award, the Humanitas Prize and a Special Mention for Best First Film at the Berlin Film Festival. The film also earned Mr. Kaufman two Emmy Award nominations for Best Director and Best Writer. He is the Artistic Director of Tectonic Theater Project and a Guggenheim Fellow in Playwriting. Other recent credits include Bengal Tiger at the Bagdad Zoo (Mark Taper Forum);Macbeth with Liev Schreiber (Public Theater); This Is How It Goes (Donmar Warehouse); One Armby Tennessee Williams (Steppenwolf Theater Company); Master Class with Rita Moreno (Berkeley Repertory Theater); and Lady Windermere's Fan (Williamstown Theater Festival). (As of August 2010)\n\nAppears in\n\nI Am My Own Wife\n\n"}, {"url": "https://www.goodreads.com/author/show/44949.Mois_s_Kaufman", "page_content": "Moisés Kaufman\n\nBorn\n\nNovember 21, 1963\n\nGenre\n\nMoisés Kaufman (born November 21, 1963) is a playwright, director and founder of Tectonic Theater Project. He is best known for writing The Laramie Project with other members of Tectonic Theater Project. He is also the author of Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations. He was born and raised in Caracas, Venezuela and moved to New York City in 1987.\n\n\n\nKaufman is of Romanian and Ukrainian Jewish descent. He described himself in an interview by saying \"I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.\"\n\n\n\nKaufman was awarded a Guggenheim Fellowship in 2002. He made his Broadway directing debut in the 2004 production o\n\nMoisés Kaufman (born November 21, 1963) is a playwright, director and founder of Tectonic Theater Project. He is best known for writing The Laramie Project with other members of Tectonic Theater Project. He is also the author of Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations. He was born and raised in Caracas, Venezuela and moved to New York City in 1987.\n\n\n\nKaufman is of Romanian and Ukrainian Jewish descent. He described himself in an interview by saying \"I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.\"\n\n\n\nKaufman was awarded a Guggenheim Fellowship in 2002. He made his Broadway directing debut in the 2004 production of I Am My Own Wife by Doug Wright, for which he received a Tony Award nomination for Best Direction of a Play.\n\n\n\n(from Wikipedia)"}, {"url": "https://www.caa.com/caaspeakers/moises-kaufman/", "page_content": "Moisés Kaufman was awarded the National Medal of Arts by President Obama in September 2016. He is also a Tony and Emmy-nominated director and playwright. Prior Broadway credits: The Heiress with Jessica Chastain, 33 Variations (which he also wrote) with Jane Fonda (5 Tony nominations); Rajiv Joseph’s Pulitzer Prize finalist Bengal Tiger at the Baghdad Zoo with Robin Williams; the Pulitzer and Tony Award-winning play I Am My Own Wife.\n\nKaufman’s next project is the first NY revival of Harvey Fierstein’s Torch Song Trilogy starring Michael Urie.\n\nHis plays Gross Indecency: The Three Trials of Oscar Wilde and The Laramie Project are among the most performed plays in America over the last decade. Kaufman also co-wrote and directed the film adaptation of The Laramie Project for HBO, which received two Emmy Award nominations for Best Director and Best Writer. He is currently directing and writing a new Broadway-bound adaptation of Bizet’s Carmen with Grammy-winning composer Arturo O’Farrill. He’s the artistic director of Tectonic Theater Project and a Guggenheim Playwrighting Fellow."}]}