{"Moisés Kaufman was born in Caracas, Venezuela.": [{"url": "https://www.britannica.com/biography/Moises-Kaufman", "page_content": "Moisés Kaufman, (born November 21, 1963, Caracas, Venezuela), Venezuelan-born playwright and director who is best known for perceptive and moving plays often rooted in issues of sexuality. He was cofounder in 1991 of Tectonic Theater Project, a company dedicated to examining the structure and language of theatre as well as addressing contemporary social issues.\n\nKaufman was born in Venezuela to Orthodox Jewish parents and was of Ukrainian and Romanian descent. He attended a yeshiva (Jewish religious school) as a child and was exposed to broader culture on family trips to New York City. A Caracas theatre festival he attended as a young teenager brought him exposure to the avant-garde plays of such artists as Peter Brook, Tadeusz Kantor, Pina Bausch, and Jerzy Grotowski, whom he cited as his early influences. While attending Metropolitan University in Caracas (B.A. in business administration, 1985), Kaufman joined a touring experimental theatre group as an actor. In 1987 he moved to New York City, where he studied theatre directing at the Tisch School of the Arts, New York University, meanwhile directing a variety of plays. It was at NYU that he honed his ideas about the purpose and most-effective means of presenting theatrical performances. Four years later Kaufman, together with his partner, Jeffrey LaHoste, established Tectonic Theater Project.\n\nKaufman’s writing debut, Gross Indecency: The Three Trials of Oscar Wilde (performed 1997–98, published 1997), illustrated his concerns as a writer-director. He was especially interested in what he termed “watershed historical moments,” events that reveal the foundations of society’s beliefs. A powerful and moving play that used actual trial testimony, Gross Indecency won an Outer Critics Circle Award for outstanding Off-Broadway play. Kaufman and his troupe then began work on The Laramie Project (performed 2000, published 2001, television movie 2002), interviewing numerous residents of the small Wyoming city in which gay college student Matthew Shepard had been brutally murdered. The play had particular resonance with Kaufman, who was gay, and it proved popular throughout the world.\n\nIn 2003 Kaufman directed a one-man show, Doug Wright’s I Am My Own Wife: Studies for a Play About Charlotte von Mahlsdorf (performed 2003–04), the story of a gay transvestite who survived life in Nazi Germany and Soviet East Berlin. It was critically acclaimed and resulted in a Tony Award nomination for Kaufman. In the next several years Kaufman directed a variety of plays, including Wilde’s Lady Windermere’s Fan and Shakespeare’s Macbeth. He also directed his own play 33 Variations (first performed 2007), starring Jane Fonda as a musicologist obsessed with Beethoven’s Diabelli Variations, and received another Tony nomination. In 2009 Kaufman and other Tectonic members arranged for 150 simultaneous readings in theatres across the globe of a sequel, The Laramie Project: Ten Years Later. He also directed Rajiv Joseph’s Bengal Tiger at the Baghdad Zoo (performed 2011), starring Robin Williams as the title character; a 2012–13 revival of Ruth and Augustus Goetz’s The Heiress, a play based on Henry James’s novel Washington Square; and a revival of Torch Song (2018–19), which was written by Harvey Fierstein. In 2016 Kaufman received the National Medal of Arts."}, {"url": "https://stageagent.com/writers/3201/moises-kaufman", "page_content": "Moisés Kaufman is a playwright, director, and founder of the Tectonic Theater Project based in New York City.\n\nKaufman was born in Caracas, Venequela on November 21, 1963. His family is Orthodox Jewish of Romanian and Ukrainian descent. He attended a yeshiva (a Jewish religious school) as a child. While growing up, he was first exposed to theatre on family vacations to New York City. As a teenager, he attended a Caracas theatre festival which introduced him to the work of avant grade theater artists Peter Brook, Tadeusz Kantor, Pina Bausch, and Jerzy Grotowski, whom he cites as his earliest influences. He attended Metropolitan University in Caracas. During his time at university, he acted in a touring experimental theatre group.\n\nIn 1987, Kaufman moved to New York City to study directing at NYU's Tisch School of the Performing Arts. Four years later, he and his partner, Jeffrey LaHoste, created the Tectonic Theatre Project. The company is dedicated to addressing contemporary social issues, as well as to explore the structure and language of theatre.\n\nKaufman has stated that he is primarily drawn to moments in history that unintentionally reveal a society's views and belief systems. His first play, Gross Indecency: The Three Trials of Oscar Wilde, premiered in New York City in 1997. It won the Outer Critics Circle Award for Outstanding Off-Broadway play.\n\nFrom 1998-1999, Kaufman and the Tectonic Theater Project traveled to Laramie, Wyoming to interview those connected to the murder of gay college student Matthew Shepard. The ensuing work compiled from their interviews, The Laramie Project, premiered in 2000 and was made into a film for HBO on 2001. The play gathered a worldwide following and has become a seminole work for the LGBQT community and for professional theaters, universities, high schools, and community theaters.\n\nIn 2003, Kaufman directed Doug Wright's I Am My Own Wife: Studies for a Play About Charlotte von Mahlsdorf. The play follows a gay transvestite who survived life in Nazi Germany and Soviet East Berlin. Kaufman received a Tony Award nomination for his direction. In 2007, Kaufman directed for Broadway again, this time for his own play, 33 Variations starring Jane Fonda as a musicologist obsessed with Beethoven’s Diabelli Variations. This garnered him his second Tony nomination.\n\nIn 2009, Kaufman and other members of the Tectonic Theater Project reunited to create The Laramie Project: Ten Years Later, a sequel to the original piece. It was performed in staged readings around the globe.\n\nIn 2011, he directed Rajiv Joseph's Bengal Tiger At the Baghdad Zoo on Broadway starring Robin Williams. In 2012, he directed a revival of Ruth and Augustus Goetz's The Heiress on Broadway.\n\nMr. Kaufman has been honored with a Steinberg/ATCA Best New Play Award, a Dike Award, an Outer Critics Circle Award, a GLAAD Media Award, a Drama Desk Award, a Lucille Lortel Award, a Carbonell Award, a Bay Area Theater Critics Circle Award, a Lambda Book Award, Venezuela's Casa del Artista, American Library Association's GLBT Literature Award, the Matthew Shepard Foundation’s “Making A Difference Award\", the Artistic Integrity Award from the Human Rights Campaign, the National Board of Review Award for Outstanding Made for Television Movie, a Golden Bear Award from the Berlin Film Festival, the Humanitas Prize,the Joe A. Callaway Award, and two Tony Award nominations.\n\nFor more information on the Tectonic Theater Project, visit their website: http://tectonictheaterproject.org."}, {"url": "https://wiki.alquds.edu/?query=Mois%C3%A9s_Kaufman", "page_content": "Moisés Kaufman (born November 21, 1963) is a Venezuelan theater director, filmmaker, playwright, founder of Tectonic Theater Project, based in New York City, and co-founder of Miami New Drama at the Colony Theatre.[1] He was awarded the 2016 National Medal of Arts by President Barack Obama. He is best known for creating The Laramie Project (2000) with other members of Tectonic Theater Project. He has directed extensively on Broadway and Internationally, and is the author of numerous plays, including Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations.\n\nBorn and raised in Caracas, Venezuela, he moved as a young man to New York City in 1987.[2]\n\nBiography [ edit ]\n\nKaufman is of Romanian-Jewish and Ukrainian-Jewish descent, and was born in Caracas, Venezuela.[3] He is an alumnus of Venezuela's Universidad Metropolitana, where he began to study theatre.[4] After immigrating to the United States, he went to college in New York and graduated from NYU.[5]\n\nIn 2005 he described himself in an interview by saying, \"I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn't write anything that didn't incorporate all that I am.\"[6]\n\nKaufman was awarded a Guggenheim Fellowship in 2002, following the premiere of The Laramie Project, which was based on extensive interviews with residents and commentators in and around Wyoming who were involved with the aftermath of the murder of gay student Matthew Shepard.[7]\n\nHe made his Broadway directing debut in the 2004 production of I Am My Own Wife by Doug Wright, for which he received a Tony Award nomination for Best Direction of a Play.\n\nOn September 22, 2016, Kaufman was awarded the National Medal of Arts and Humanities in a ceremony conducted by U.S. president Barack Obama. He is the first Venezuelan to receive the honor.[5]\n\nIn 2022, Kaufman was included in the book 50 Key Figures in Queer US Theatre, profiled in a chapter written by theatre scholar Bess Rowen.[8]\n\nAwards [ edit ]\n\nStage directing credits [ edit ]\n\nFilm credits [ edit ]\n\nTelevision credits [ edit ]\n\nSee also [ edit ]"}, {"url": "https://www.celebsagewiki.com/moises-kaufman", "page_content": "Age, Biography and Wiki\n\nMoisés Kaufman was born on 1964 in Caracas, Venezuela, is a Director, Writer. Discover Moisés Kaufman's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 57 years old?\n\nPopular As N/A Occupation director,writer Age 59 years old Zodiac Sign Born 30 November 1963 Birthday 30 November Birthplace Caracas, Venezuela Nationality Venezuela\n\nWe recommend you to check the complete list of Famous People born on 30 November. He is a member of famous Director with the age 59 years old group.\n\nMoisés Kaufman Height, Weight & Measurements\n\nAt 59 years old, Moisés Kaufman height not available right now. We will update Moisés Kaufman's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nMoisés Kaufman Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Moisés Kaufman worth at the age of 59 years old? Moisés Kaufman’s income source is mostly from being a successful Director. He is from Venezuela. We have estimated Moisés Kaufman's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Director\n\nMoisés Kaufman Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://happyhappybirthday.net/en/age/moiss-kaufman-person_lqaysg", "page_content": "Moisés Kaufman\n\nAmerican playwright, director and founder of Tectonic Theater Project – Moisés Kaufman was born in Caracas (capital and largest city of Venezuela) on November 21st, 1963 and is 59 years old today.\n\nAge How old is Moisés Kaufman? 59 Moisés Kaufman is 59 years old.\n\nBiographical data\n\nMoisés Kaufman\n\nBirthday When was Moisés Kaufman born? Moisés Kaufman was born on November 21st, 1963.\n\nPlace of Birth Where was Moisés Kaufman born? Caracas (capital and largest city of Venezuela).\n\n♏ ♏ Zodiac What is the zodiac sign of Moisés Kaufman? Moisés Kaufman was born in the zodiac sign Scorpio (The Scorpion)."}, {"url": "https://www.advocate.com/arts-entertainment/2016/9/22/10-things-know-about-moises-kaufman", "page_content": "Moises Kaufman, known for writing and/or directing such plays as The Laramie Project, Gross Indecency: The Three Trials of Oscar Wilde, and I Am My Own Wife, today will receive the National Medal of Arts from President Obama at the White House. The medal recognizes outstanding contributions to the excellence, growth, support, and availability of the arts in the United States. Kaufman is in good company; among this year's other recipients are film director Mel Brooks, author Sandra Cisneros, actor Morgan Freeman, composer Philip Glass, and actress-singer Audra McDonald. (See the full list here.) Kaufman has had a long and varied career, and some facts about his life and work may surprise even devoted fans. Read on for 10 things you should know about Moises Kaufman.\n\nHe is the son of a Holocaust survivor.\n\nKaufman's father, Jose, was a Romanian Jew who survived the Holocaust. As a boy, Jose earned money by making and selling the yellow Stars of David that the Nazi regime forced Jews to wear. \"He spent most of the war alternately hiding in a small room and selling Stars of David,\" Moises Kaufman recalled in the book A Memory, a Monologue, a Rant, and a Prayer, edited by Eve Ensler. After World War II was over, Jose made his way to Caracas, Venezuela. There he worked in a grocery store and eventually bought one, and he married Dora Akerman, a Venezuelan-born woman of Ukrainian descent. Moises was born in Caracas in 1963. His parents brought him up in the Orthodox branch of Judaism, and he attended a yeshiva -- a Jewish religious school -- which made Moises quite the outsider in the heavily Catholic nation, as did his realization at age 11 that he was gay. Moises moved to New York City in 1987 to pursue his theatrical career, in which many of his projects have dealt with outsiders, and some have touched directly on the Holocaust. In 2015 he directed a revival of Bent, Martin Sherman's play about gay men in a concentration camp, at Los Angeles's Mark Taper Forum.\n\nThe Laramie Project was a massive undertaking.\n\nFor The Laramie Project, which deals with the brutal murder of gay college student Matthew Shepard and the reactions of the townspeople in Laramie, Wyo., Kaufman and his colleagues at the Tectonic Theater Project compiled 400 hours of interviews from over 200 people. Kaufman was in New York City when he heard about the attack on Shepard in October 1998. \"I started getting phone calls -- 'Did you hear what happened?' -- and then I read it in the newspaper and I saw it on television,\" he recalled to The Advocate in 2008. \"People have spoken about how we as gay people feel attacked, injured, constantly in our culture. And that image of that boy tied to the fence spoke to so many of us about our pain and about our sense of how we fit into the landscape of this country. The impact of seeing what this was doing to the country--that's when I decided to go to Laramie and do The Laramie Project.\" The Laramie Project premiered in 2000, has been performed widely, and was adapted into an HBO movie, directed by Kaufman, in 2002. And 10 years after Shepard's death Kaufman and his Tectonic collaborators returned to Laramie to compile a sequel, The Laramie Project: Ten Years Later, which premiered in 2009.\n\n[rebelmouse-image 32740833 expand=1 dam=1 alt=\"WATCH: True Life: \"I Have a Trans Parent\"\" site_id=25879312 is_animated_gif=false original_size=\"750x563\" crop_info=\"%7B%22image%22%3A%20%22https%3A//assets.rbl.ms/32740833/origin.jpg%22%2C%20%22thumbnails%22%3A%20%7B%22origin%22%3A%20%22https%3A//assets.rbl.ms/32740833/origin.jpg%22%2C%20%22300x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D300%22%2C%20%221500x2000%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1500%26height%3D2000%26coordinates%3D308%252C0%252C20%252C0%22%2C%20%22700x1245%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D700%26height%3D1245%26coordinates%3D361%252C0%252C73%252C0%22%2C%20%22600x200%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D200%26coordinates%3D0%252C178%252C0%252C135%22%2C%20%22600x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%22%2C%20%22300x300%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D300%26height%3D300%26coordinates%3D188%252C0%252C0%252C0%22%2C%20%221200x600%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1200%26height%3D600%26coordinates%3D0%252C116%252C0%252C73%22%2C%20%22600x600%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D600%26coordinates%3D188%252C0%252C0%252C0%22%2C%20%222000x1500%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D2000%26height%3D1500%26coordinates%3D0%252C1%252C0%252C0%22%2C%20%22600x300%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D300%26coordinates%3D0%252C116%252C0%252C73%22%2C%20%22750x1000%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D750%26height%3D1000%26coordinates%3D308%252C0%252C20%252C0%22%2C%20%221200x800%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1200%26height%3D800%26coordinates%3D0%252C53%252C0%252C10%22%2C%20%22210x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D210%22%2C%20%221200x400%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1200%26height%3D400%26coordinates%3D0%252C178%252C0%252C135%22%2C%20%221245x700%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1245%26height%3D700%26coordinates%3D0%252C93%252C0%252C50%22%2C%20%221000x750%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1000%26height%3D750%26coordinates%3D0%252C1%252C0%252C0%22%2C%20%22600x400%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D400%26coordinates%3D0%252C53%252C0%252C10%22%2C%20%22980x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D980%22%2C%20%2235x35%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D35%26height%3D35%22%7D%2C%20%22manual_image_crops%22%3A%20%7B%229x16%22%3A%20%7B%22sizes%22%3A%20%5B%22700x1245%22%5D%2C%20%22top%22%3A%200%2C%20%22height%22%3A%20563%2C%20%22width%22%3A%20316%2C%20%22left%22%3A%20361%7D%2C%20%22600x300%22%3A%20%7B%22sizes%22%3A%20%5B%22600x300%22%5D%2C%20%22top%22%3A%20116%2C%20%22height%22%3A%20374%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%223x1%22%3A%20%7B%22sizes%22%3A%20%5B%221200x400%22%2C%20%22600x200%22%5D%2C%20%22top%22%3A%20178%2C%20%22height%22%3A%20250%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%223x2%22%3A%20%7B%22sizes%22%3A%20%5B%221200x800%22%2C%20%22600x400%22%5D%2C%20%22top%22%3A%2053%2C%20%22height%22%3A%20500%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%221x1%22%3A%20%7B%22sizes%22%3A%20%5B%22600x600%22%2C%20%22300x300%22%5D%2C%20%22top%22%3A%200%2C%20%22height%22%3A%20563%2C%20%22width%22%3A%20562%2C%20%22left%22%3A%20188%7D%2C%20%223x4%22%3A%20%7B%22sizes%22%3A%20%5B%221500x2000%22%2C%20%22750x1000%22%5D%2C%20%22top%22%3A%200%2C%20%22height%22%3A%20563%2C%20%22width%22%3A%20422%2C%20%22left%22%3A%20308%7D%2C%20%2216x9%22%3A%20%7B%22sizes%22%3A%20%5B%221245x700%22%5D%2C%20%22top%22%3A%2093%2C%20%22height%22%3A%20420%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%224x3%22%3A%20%7B%22sizes%22%3A%20%5B%222000x1500%22%2C%20%221000x750%22%5D%2C%20%22top%22%3A%201%2C%20%22height%22%3A%20562%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%222x1%22%3A%20%7B%22sizes%22%3A%20%5B%221200x600%22%2C%20%22600x300%22%5D%2C%20%22top%22%3A%20116%2C%20%22height%22%3A%20374%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%7D%7D\" caption=\"You've viewed the adventures of the Pfefferman family; now see some real-life young adults dealing with a parent's transition in a new episode of MTV's True Life, \\\"I Have a Trans Parent.\\\" Follow Kiara as she gets to know her \\\"Pops,\\\" the parent she previously knew as her mother, and Jeffrey as he accepts his father as a transgender woman and strives to help his brothers do the same. The episode airs Monday at 11:30 p.m./10:30 Central; watch a preview below.\n\n\" photo_credit=\"\"]\n\nGross Indecency: The Three Trials of Oscar Wilde was banned in Russia.\n\nThis was Kaufman's debut as a playwright, opening off-Broadway in 1997, and it was a major success. It received numerous critics' awards and a GLAAD Media Award. It has been produced in dozens of cities in the U.S. and abroad, but a planned production in Moscow was abruptly canceled in 2015. The production was to be funded in part by the U.S. State Department, but the Russian government stepped in and said the Moscow theater company that was to stage it could not accept foreign funds. The real reason for the cancellation, Kaufman believes, was that this depiction of the great gay author and wit ran afoul of Russia's \"gay propaganda\" law, which bans any positive discussion of LGBT people or issues in forums accessible to minors. The play did receive a a star-studded benefit reading in New York City in the fall of 2015 to support the Tectonic Theater Project and the International Gay and Lesbian Human Rights Commission.\n\nPictured: Kaufman (left) and Ben Foster clown around at the premiere of the HBO film of The Laramie Project.\n\nThe Laramie Project has run into trouble a few places too.\n\nThe Laramie Project's gay subject matter has led high school administrators to cancel performances of the play in places as varied as Spokane, Wash.;Ottumwa, Iowa; and Burbank, Calif. The students in Burbank eventually were able to stage their production, although not at their high school -- it went on at the Los Angeles suburb's Colony Theatre, which donated the space, and with help from Tectonic. But the play also has had well-received, school-supported productions in many places in the U.S., including Xavier High School, a Roman Catholic institution in New York City.\n\nHis play 33 Variations gave Jane Fonda her first Broadway role in 46 years.\n\nKaufman wrote and directed 33 Variations, about a music scholar studying one of Beethoven's most enigmatic works, and when it premiered on Broadway in 2009, Jane Fonda played the lead role. This was Fonda's first Broadway appearance since 1963, and she received positive reviews. \"Whatever discomfort the actress may feel melds into her portrayal of Dr. Katherine Brandt, whose naturally assertive nature is humbled by the progressive, atrophying illness known as Lou Gehrig's disease,\" Ben Brantley wrote in The New York Times, adding, \"For those who grew up enthralled with Ms. Fonda's screen image, it's hard not to respond to her performance here, on some level, as a personal memento mori.\"\n\nHe discovered a different side of Robin Williams during Bengal Tiger at the Baghdad Zoo.\n\nFonda isn't the only major movie star who has appeared in a Kaufman play. In 2011, Robin Williams starred in Bengal Tiger at the Baghdad Zoo, a meditation on the Iraq war written and directed by Kaufman. Williams portrayed a tiger who is killed in the first scene and then haunts the rest of the characters for the remainder of the play. Williams initially started rehearsals with what Kaufman called \"the 10 a.m. stand-up.\" \"He would start talking about whatever crossed his mind and would riff on it for the next 20 or 30 minutes, keeping all of us -- actors, designers, stage management -- roaring with laughter,\" Kaufman wrote in Salon in 2014, after Williams's suicide. \"Like everyone, I was dazzled by the speed of his brain and the quickness of his wit, but I also noticed something else: an actor's natural trepidation about tackling a demanding role. As he developed his character ... the 10 a.m. monologues became shorter and shorter. He was feeling more at home in the rehearsal room, finding his groove in the role. Until, finally, the monologues were gone.\" Williams also developed \"a real camaraderie\" with his castmates -- and he occasionally showed signs of depression, the playwright noted. \"For me, it isn't his brilliant sense of humor, or his wit, or his chameleon abilities that I'll miss,\" Kaufman concluded. \"I'll miss the guy who came to rehearsal every day with humility and kindness, who sat around at lunch and shot the breeze. I'll miss the man who loved what he did every day. And who loved this community. I will miss my friend.\"\n\nHe's even directed operas, including one based on Puss in Boots.\n\nKaufman has proved his versatility time and again. In 2010 he took on the direction of Spanish composer Xavier Montsalvatge's chamber opera adaptation of the popular fairy tale. The production incorporated both puppets and human actors. Staging a show aimed at children was intimidating and also rewarding, Kaufman told the New York Daily News. \"I've never been more scared in my life, because children don't lie,\" he said. On the other hand, he noted, \"There's nothing better than hearing children laugh.\"\n\nHis most recent project is a reimagining of Bizet's Carmen.\n\nNothing if not adventurous, Kaufman and cowriter Eduardo Machado adapted Georges Bizet's 19th-century opera into Carmen: An Afro-Cuban Jazz Musical, set in 1958, changing the locale from Spain to Cuba, and making the sensuous factory worker Carmen a black woman who supports Fidel Castro's revolution. Composer Arturo O'Farrill adapted Bizet's melodies into jazzy tunes with lyrics by Kaufman and others. The play had its world premiere, directed by Kaufman, in February of this year at the Olney Theatre Center in Montgomery County, Md., near Washington, D.C.\n\nDespite all his success, Kaufman describes himself as shy and socially awkward.\n\n\"I'm incredibly shy, I am socially awkward, and I don't have many other interests other than my work,\" he told Los Angeles's Jewish Journal in 2011. \"When I'm in the rehearsal room, I'm my best self. I've always known how to live in my work. I am not so good at living my life.\"\n\nBut he has managed to have a long-term relationship. He is married to Jeffrey LaHoste, with whom he founded the Tectonic Theater Project.\n\nKaufman and LaHoste founded Tectonic in 1991, with the goal of \"developing innovative works that explore theatrical language and form, fostering an artistic dialogue with audiences on the social, political, and human issues that affect us all,\" according to the New York-based company's website. Kaufman is its artistic director, and LaHoste, a writer and producer, is a member of the board of directors. LaHoste has produced many of Kaufman's plays and several other projects, such as Kirby Dick's 2009 documentary film Outrage, about closeted politicians who support anti-LGBT legislation. He is also the author of author of Elysian Fields, a television series in development that was chosen as a participating project in the Producers' Guild of America's Diversity Workshop. Kaufman and LaHoste have been together for more than 20 years, and they were married in 2014."}, {"url": "https://www.famousbirthdays.com/people/moises-kaufman.html", "page_content": "About\n\nFounder of the Tectonic Theater Project who wrote the plays The Laramie Project and Gross Indecency: The Three Trials of Oscar Wilde.\n\nBefore Fame\n\nHe was born and raised in Caracas, Venezuela and moved to New York City in 1987.\n\nTrivia\n\nHe received a Tony Award nomination for Best Direction of a Play for his 2004 production of I Am My Own Wife.\n\nFamily Life\n\nHe is openly gay and considers himself the sum of all of his cultures.\n\nAssociated With\n\nHe directed episodes of The L Word, starring Mia Kirshner."}, {"url": "https://www.goodreads.com/author/show/44949.Mois_s_Kaufman", "page_content": "Moisés Kaufman\n\nBorn\n\nNovember 21, 1963\n\nGenre\n\nMoisés Kaufman (born November 21, 1963) is a playwright, director and founder of Tectonic Theater Project. He is best known for writing The Laramie Project with other members of Tectonic Theater Project. He is also the author of Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations. He was born and raised in Caracas, Venezuela and moved to New York City in 1987.\n\n\n\nKaufman is of Romanian and Ukrainian Jewish descent. He described himself in an interview by saying \"I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.\"\n\n\n\nKaufman was awarded a Guggenheim Fellowship in 2002. He made his Broadway directing debut in the 2004 production o\n\nMoisés Kaufman (born November 21, 1963) is a playwright, director and founder of Tectonic Theater Project. He is best known for writing The Laramie Project with other members of Tectonic Theater Project. He is also the author of Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations. He was born and raised in Caracas, Venezuela and moved to New York City in 1987.\n\n\n\nKaufman is of Romanian and Ukrainian Jewish descent. He described himself in an interview by saying \"I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.\"\n\n\n\nKaufman was awarded a Guggenheim Fellowship in 2002. He made his Broadway directing debut in the 2004 production of I Am My Own Wife by Doug Wright, for which he received a Tony Award nomination for Best Direction of a Play.\n\n\n\n(from Wikipedia)"}, {"url": "https://www.celebsages.com/moises-kaufman/", "page_content": "Birth Name: Moises Kaufman Occupation: Playwright Born In: Venezuela Birthdate: November 21, 1963 Age: 59 years old (as of 2023) Ethnicity: Unknown Nationality: Venezuelan Sexuality: N/A\n\nMoises Kaufman was born on the 21st of November, 1963. He is famous for being a Playwright. He directed episodes of The L Word, starring Mia Kirshner. Moises Kaufman’s age is 59. Founder of the Tectonic Theater Project who wrote the plays The Laramie Project and Gross Indecency: The Three Trials of Oscar Wilde. The 59-year-old playwright was born in Venezuela. He was born and raised in Caracas, Venezuela and moved to New York City in 1987. He received a Tony Award nomination for Best Direction of a Play for his 2004 production of I Am My Own Wife.\n\nCountdown to Moises’s next birthday.\n\nMoises Kaufman is a Scorpio and his 60th birthday is in .\n\nJUMP TO: Moises Kaufman’s biography , facts , family , personal life , zodiac , videos , net worth , and popularity .\n\nChildhood\n\nMoises Kaufman was born in 1960s. The 1960s were an era of protests. The decade was dominated by the Vietnam War, Civil Rights Protests, Cuban Missile Crisis, antiwar protests and saw the assassinations of US President John F. Kennedy and Martin Luther King Jr. It also marked the first man landed on the moon. Discover what happened on this day.\n\nMoises Kaufman is part of the Baby boomers generation. Also known as \"boomers\", are the result of the end of World War II, when birth rates across the world spiked. They are associated with a rejection of traditional values. These hippie kids protested against the Vietnam War and participated in the civil rights movement.\n\nYou can also find out who is Moises Kaufman dating now and celebrity dating histories at CelebsCouples.\n\nWhile we don't know Moises Kaufman birth time, but we do know his mother gave birth to his on a Thursday. People born on a Thursday are naturally well-meaning and open. Luck is on their side.\n\n[fetch instagram=”” display=”posts” ]\n\nThe 59-year-old Venezuelan was born in the Baby Boomers Generation and the Year of the Rabbit\n\nEducation\n\nThe education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nMoises Kaufman’s mother’s name is unknown at this time and his father’s name is under review. We will continue to update information on Moises Kaufman’s parents.\n\nPersonal Life\n\nLike many famous people and celebrities, Moises Kaufman keeps his personal life private. Once more details are available on who he is dating, we will update this section.\n\nFast Facts\n\nREAL NAME: Moises Kaufman NICKNAME: Moises\n\nMARTIAL STATUS: Pending RELIGION: Unknown TATTOOS: N/A AGE GENERATION: Baby Boomers Generation BIRTH SIGN: Scorpio BIRTH DAY: Thursday DAYS SINCE BIRTH:\n\nNet Worth\n\nThe 59-year-old Venezuelan playwright has done well thus far. Majority of Moises’s money comes from being a playwright. CelebsMoney has recently updated Moises Kaufman’s net worth .\n\nVideos\n\nHoroscope\n\nZodiac Sign: Moises Kaufman is a Scorpio. People of this zodiac sign like truth, being right, longtime friends, teasing, and dislike dishonesty, revealing secrets, passive people. The strengths of this sign are being resourceful, brave, passionate, a true friend, while weaknesses can be distrusting, jealous, secretive and violent. The greatest overall compatibility with Scorpio is Taurus and Cancer.\n\nChinese Zodiac: Moises Kaufman was born in the Year of the Rabbit. People born under this sign are popular because they're sincere and avoid conflict. Though they're sensitive, they also hesitate, which makes them lose on chances.\n\n\n\n\n\nRuling Planet: Moises Kaufman has a ruling planet of Pluto and has a ruling planet of Pluto. Back the early 2,000 B.C. the outer planets, Uranus and Neptune were not yet discovered, since the telescope had not yet been invented. Astrologers and astronomers could only work with planets visible to the eye.\n\n[fetch instagram=”” display=”posts” show=”2″ ]\n\nMoises Kaufman’s birth sign is Scorpio and he has a ruling planet of Pluto.\n\nDon’t miss\n\n– Who’s the richest Playwright in the world?\n\n– Moises Kaufman Net Worth Stats\n\n– When is Moises Kaufman’s birthday?\n\nAssociated with\n\nFans also viewed"}, {"url": "https://infofamouspeople.com/famous/moises-kaufman.htm", "page_content": "Moises Kaufman's About ✎]\n\nMoises Kaufman was born on November 21, 1963 (age 59) in Venezuela. According to numerology, Moises Kaufman's Life Path Number is 6. He is a celebrity playwright. Founder of the Tectonic Theater Project who wrote the plays The Laramie Project and Gross Indecency: The Three Trials of Oscar Wilde. More information on Moises Kaufman can be found here. This article will clarify Moises Kaufman's Bio, Wikipedia, Age, Birthday, Height, and other information.\n\nLet's explore Your Tarot online (love,wellness,fortune)\n\nIf you are a fan of Moises Kaufman, tell us more about Him\n\nAdvertisement\n\nFamily, Spouse, Dating, and Relationships of Moises Kaufman ✎]\n\nHe is openly gay and considers himself the sum of all of his cultures.\n\nMoises Kaufman Before Fame ✎]\n\nOn 11-21-1963, Moises Kaufman was born. It indicates that He is on life path 6. His personal year number in 2023 is 3. He was born and raised in Caracas, Venezuela and moved to New York City in 1987.\n\nThe Numerology of Moises Kaufman ✎]\n\nMoises Kaufman's Life Path Number is 6, The Life Path Number 6 is associated with a lot of love, affection, care, and humility. He is someone who likes to serve humanity for a more significant cause. He has a lot of empathy towards the ones who are weak and are suffering. It gives him immense joy to help people.\n\nAdvertisement\n\nMoises Kaufman's personal year in numerology ✎]\n\nThis year, Moises Kaufman’s personal year number is 3. The personal year number is 3 is outstanding year of strong brain development. Learning something new, a new language, a new degree, .. is the best choice for Moises Kaufman this year.\n\nSuccess of Moises Kaufman ✎]\n\nHe received a Tony Award nomination for Best Direction of a Play for his 2004 production of I Am My Own Wife.\n\nAssociated with ✎]\n\nHe directed episodes of The L Word, starring Mia Kirshner. Oscar Wilde, Tracy Letts, and Kenneth Lonergan were also His acquaintances.\n\nMoises Kaufman Net Worth ✎]\n\nInformation about His net worth in 2023 is being updated as soon as possible by infofamouspeople.com, You can also click edit to tell us what the Net Worth of the Moises Kaufman is\n\nHouses & Cars & Luxury Brands ✎]\n\nMoises Kaufman's house, cars and luxury brand in 2023 will be updated as soon as possible, you can also click edit to let us know about this information."}]}