{"Moisés Kaufman is the founder and artistic director of Tectonic Theater Project, a New York-based theater company.": [{"url": "https://www.britannica.com/biography/Moises-Kaufman", "page_content": "Moisés Kaufman, (born November 21, 1963, Caracas, Venezuela), Venezuelan-born playwright and director who is best known for perceptive and moving plays often rooted in issues of sexuality. He was cofounder in 1991 of Tectonic Theater Project, a company dedicated to examining the structure and language of theatre as well as addressing contemporary social issues.\n\nKaufman was born in Venezuela to Orthodox Jewish parents and was of Ukrainian and Romanian descent. He attended a yeshiva (Jewish religious school) as a child and was exposed to broader culture on family trips to New York City. A Caracas theatre festival he attended as a young teenager brought him exposure to the avant-garde plays of such artists as Peter Brook, Tadeusz Kantor, Pina Bausch, and Jerzy Grotowski, whom he cited as his early influences. While attending Metropolitan University in Caracas (B.A. in business administration, 1985), Kaufman joined a touring experimental theatre group as an actor. In 1987 he moved to New York City, where he studied theatre directing at the Tisch School of the Arts, New York University, meanwhile directing a variety of plays. It was at NYU that he honed his ideas about the purpose and most-effective means of presenting theatrical performances. Four years later Kaufman, together with his partner, Jeffrey LaHoste, established Tectonic Theater Project.\n\nKaufman’s writing debut, Gross Indecency: The Three Trials of Oscar Wilde (performed 1997–98, published 1997), illustrated his concerns as a writer-director. He was especially interested in what he termed “watershed historical moments,” events that reveal the foundations of society’s beliefs. A powerful and moving play that used actual trial testimony, Gross Indecency won an Outer Critics Circle Award for outstanding Off-Broadway play. Kaufman and his troupe then began work on The Laramie Project (performed 2000, published 2001, television movie 2002), interviewing numerous residents of the small Wyoming city in which gay college student Matthew Shepard had been brutally murdered. The play had particular resonance with Kaufman, who was gay, and it proved popular throughout the world.\n\nIn 2003 Kaufman directed a one-man show, Doug Wright’s I Am My Own Wife: Studies for a Play About Charlotte von Mahlsdorf (performed 2003–04), the story of a gay transvestite who survived life in Nazi Germany and Soviet East Berlin. It was critically acclaimed and resulted in a Tony Award nomination for Kaufman. In the next several years Kaufman directed a variety of plays, including Wilde’s Lady Windermere’s Fan and Shakespeare’s Macbeth. He also directed his own play 33 Variations (first performed 2007), starring Jane Fonda as a musicologist obsessed with Beethoven’s Diabelli Variations, and received another Tony nomination. In 2009 Kaufman and other Tectonic members arranged for 150 simultaneous readings in theatres across the globe of a sequel, The Laramie Project: Ten Years Later. He also directed Rajiv Joseph’s Bengal Tiger at the Baghdad Zoo (performed 2011), starring Robin Williams as the title character; a 2012–13 revival of Ruth and Augustus Goetz’s The Heiress, a play based on Henry James’s novel Washington Square; and a revival of Torch Song (2018–19), which was written by Harvey Fierstein. In 2016 Kaufman received the National Medal of Arts."}, {"url": "https://www.nytimes.com/2019/06/16/us/moises-kaufman-stonewall-50.html", "page_content": "Merely a year later, some 5,000 activists held the first pride march in New York City — with similar marches held in Chicago and Los Angeles. And the rallying cry of the movement became: “We must all come out of the closet. We must make ourselves known.”\n\nCamus also states in his book that “in every act of rebellion,” the rebel experiences a “complete and spontaneous loyalty to certain aspects of himself.” Just four years after the riots, in 1973, we said “no” to the American Psychiatric Association, and its leaders at long last removed the diagnosis of homosexuality from its official list of mental illnesses.\n\nThe next year, 1974, we said “no” to being politically powerless when Elaine Noble, the first out lesbian to run for a state-level political office, was elected to the Massachusetts State Legislature. And, famously, in 1977, an openly gay man, Harvey Milk, was elected to the San Francisco Board of Supervisors.\n\nBut as the battle went on, and as the character of the homosexual was being redrawn in revolt, 1981 brought about the first cases of the AIDS epidemic. And the death toll — and the country’s initial refusal to respond to it — brought to the surface the depth of homophobia, transphobia and other queer-centered bigotry in the American psyche.\n\nA radical rethinking of tactics and actions was needed, and a new kind of gay activist was born. Lambda Legal, GMHC (formerly the Gay Men’s Health Crisis), Act Up and a host of other organizations redefined the way civil rights wars were being fought."}, {"url": "https://stageagent.com/writers/3201/moises-kaufman", "page_content": "Moisés Kaufman is a playwright, director, and founder of the Tectonic Theater Project based in New York City.\n\nKaufman was born in Caracas, Venequela on November 21, 1963. His family is Orthodox Jewish of Romanian and Ukrainian descent. He attended a yeshiva (a Jewish religious school) as a child. While growing up, he was first exposed to theatre on family vacations to New York City. As a teenager, he attended a Caracas theatre festival which introduced him to the work of avant grade theater artists Peter Brook, Tadeusz Kantor, Pina Bausch, and Jerzy Grotowski, whom he cites as his earliest influences. He attended Metropolitan University in Caracas. During his time at university, he acted in a touring experimental theatre group.\n\nIn 1987, Kaufman moved to New York City to study directing at NYU's Tisch School of the Performing Arts. Four years later, he and his partner, Jeffrey LaHoste, created the Tectonic Theatre Project. The company is dedicated to addressing contemporary social issues, as well as to explore the structure and language of theatre.\n\nKaufman has stated that he is primarily drawn to moments in history that unintentionally reveal a society's views and belief systems. His first play, Gross Indecency: The Three Trials of Oscar Wilde, premiered in New York City in 1997. It won the Outer Critics Circle Award for Outstanding Off-Broadway play.\n\nFrom 1998-1999, Kaufman and the Tectonic Theater Project traveled to Laramie, Wyoming to interview those connected to the murder of gay college student Matthew Shepard. The ensuing work compiled from their interviews, The Laramie Project, premiered in 2000 and was made into a film for HBO on 2001. The play gathered a worldwide following and has become a seminole work for the LGBQT community and for professional theaters, universities, high schools, and community theaters.\n\nIn 2003, Kaufman directed Doug Wright's I Am My Own Wife: Studies for a Play About Charlotte von Mahlsdorf. The play follows a gay transvestite who survived life in Nazi Germany and Soviet East Berlin. Kaufman received a Tony Award nomination for his direction. In 2007, Kaufman directed for Broadway again, this time for his own play, 33 Variations starring Jane Fonda as a musicologist obsessed with Beethoven’s Diabelli Variations. This garnered him his second Tony nomination.\n\nIn 2009, Kaufman and other members of the Tectonic Theater Project reunited to create The Laramie Project: Ten Years Later, a sequel to the original piece. It was performed in staged readings around the globe.\n\nIn 2011, he directed Rajiv Joseph's Bengal Tiger At the Baghdad Zoo on Broadway starring Robin Williams. In 2012, he directed a revival of Ruth and Augustus Goetz's The Heiress on Broadway.\n\nMr. Kaufman has been honored with a Steinberg/ATCA Best New Play Award, a Dike Award, an Outer Critics Circle Award, a GLAAD Media Award, a Drama Desk Award, a Lucille Lortel Award, a Carbonell Award, a Bay Area Theater Critics Circle Award, a Lambda Book Award, Venezuela's Casa del Artista, American Library Association's GLBT Literature Award, the Matthew Shepard Foundation’s “Making A Difference Award\", the Artistic Integrity Award from the Human Rights Campaign, the National Board of Review Award for Outstanding Made for Television Movie, a Golden Bear Award from the Berlin Film Festival, the Humanitas Prize,the Joe A. Callaway Award, and two Tony Award nominations.\n\nFor more information on the Tectonic Theater Project, visit their website: http://tectonictheaterproject.org."}, {"url": "https://www.theatregold.com/content/moises-kaufman/", "page_content": "Let's Get Social\n\nMoisés Kaufman\n\nMoisés Kaufman (born November 21, 1963) is a playwright, director and founder of Tectonic Theater Project. He is best known for writing The Laramie Project with other members of Tectonic Theater Project. He is also the author of Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations. He was born and raised in Caracas, Venezuela and moved to New York City in 1987.[1]\n\nLife\n\nKaufman is of Romanian and Ukrainian Jewish descent.[2] He described himself in an interview by saying “I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.”[3]\n\nKaufman was awarded a Guggenheim Fellowship in 2002.[4] He made his Broadway directing debut in the 2004 production of I Am My Own Wife by Doug Wright, for which he received a Tony Award nomination for Best Direction of a Play. On September 22, 2016, Kaufman was the first Venezuelan awarded the National Medal of Arts in ceremony conducted by U.S. president Barack Obama. He is a graduate of NYU[5]\n\nAwards\n\nSteinberg/ATCA Best New Play Award—2008: “33 Variations”\n\nOuter Critics Circle Award\n\nGLAAD Media Award\n\nDrama Desk Award\n\nLucille Lortel Award, 1998 Outstanding Play Gross Indecency:The Trials of Oscar Wilde – Playwright\n\nCarbonell Award\n\nBay Area Theater Critics Circle Award\n\nLambda Book Award\n\nVenezuela’s Casa del Artista\n\n2004 Obie Award, Best Direction I Am My Own Wife – Director\n\nAmerican Library Association’s LGBT Literature Award\n\nMatthew Shepard Foundation’s “Making A Difference Award”\n\nArtistic Integrity Award from the Human Rights Campaign\n\nNational Board of Review Award for Outstanding Made for Television Movie\n\nGolden Bear Award from the Berlin Film Festival\n\nHumanitas Prize\n\nJoe A. Callaway Award – 1997 – Gross Indecency:The Trials of Oscar Wilde Director\n\nThe Tony Award\n\n2016 National Medal of Arts and Humanities\n\nTheatre Work\n\nDirecting Credits\n\nBengal Tiger at the Baghdad Zoo\n\nPuss in Boots (El Gato con Botas)\n\n33 Variations\n\nMacbeth (with Liev Schreiber) for The Public Theater’s Shakespeare in the Park\n\nLady Windermere’s Fan\n\nThis Is How It Goes\n\nInto The Woods\n\nMaster Class (with Rita Moreno)\n\nOne Arm by Tennessee Williams\n\nI Am My Own Wife\n\nThe Laramie Project\n\nGross Indecency: The Three Trials of Oscar Wilde\n\nMarlow’s Eye\n\nThe Nest\n\nWomen in Beckett\n\nMachinal\n\nCoxinga\n\nThe Nightingale\n\nThe Heiress\n\nTorch Song Trilogy\n\nParadise Square\n\nAuthor Credits\n\n1. Standing On Ceremony: The Gay Marriage Plays Minetta Lane Theatre 11/13/2011 Author 2. One Arm Acorn Theater 06/09/2011 Adapation 3. The Laramie Project Union Square Theatre 03/18/2000 Playwright 4. Gross Indecency:The Trials of Oscar Wilde Minetta Lane Theatre 06/05/1997 Playwright\n\nFilm Credits\n\nThe Laramie Project\n\nThe L Word (2 episodes)\n\nReferences\n\n1 Hurwitt, Robert (2001-05-20). “The ‘Laramie’ process”. San Francisco Chronicle.\n\n2 Robert Myers (25 May 1997). “‘Nothing Mega About It Except the Applause'”. The New York Times. Retrieved 6 July 2009.\n\n3 Orozco, Jose (March 21, 2005). “True To Reality: An Interview with Moises Kaufman”. Morphizm. Retrieved 6 August 2012. I am Venezuelan, I am Jewish, I am gay, I live in New 4 York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.\n\n5 “Moisés Kaufman”. John Simon Guggenheim Memorial Foundation. 2002. Archived from the original on 2011-06-22. Retrieved 2009-03-03.\n\n6 http://www.nyu.edu/about/news-publications/news/2016/september/ArtsAccoladesSeptember.html\n\n7 Full References at WIKI\n\nExternal Links\n\nMoisés Kaufman – Bio, Moisés Kaufman, theatre director, Tectonic Theater Project, The Laramie Project, Gross indecency the three trials of oscar wilder, Paradise Square, Torch Song, The Heiress, The Nightingale, Machinal, Women Beckett, Master Class, Into the Woods, 33 Variations"}, {"url": "https://www.goodreads.com/author/show/44949.Mois_s_Kaufman", "page_content": "Moisés Kaufman\n\nBorn\n\nNovember 21, 1963\n\nGenre\n\nMoisés Kaufman (born November 21, 1963) is a playwright, director and founder of Tectonic Theater Project. He is best known for writing The Laramie Project with other members of Tectonic Theater Project. He is also the author of Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations. He was born and raised in Caracas, Venezuela and moved to New York City in 1987.\n\n\n\nKaufman is of Romanian and Ukrainian Jewish descent. He described himself in an interview by saying \"I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.\"\n\n\n\nKaufman was awarded a Guggenheim Fellowship in 2002. He made his Broadway directing debut in the 2004 production o\n\nMoisés Kaufman (born November 21, 1963) is a playwright, director and founder of Tectonic Theater Project. He is best known for writing The Laramie Project with other members of Tectonic Theater Project. He is also the author of Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations. He was born and raised in Caracas, Venezuela and moved to New York City in 1987.\n\n\n\nKaufman is of Romanian and Ukrainian Jewish descent. He described himself in an interview by saying \"I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn’t write anything that didn’t incorporate all that I am.\"\n\n\n\nKaufman was awarded a Guggenheim Fellowship in 2002. He made his Broadway directing debut in the 2004 production of I Am My Own Wife by Doug Wright, for which he received a Tony Award nomination for Best Direction of a Play.\n\n\n\n(from Wikipedia)"}, {"url": "https://books.google.com/books/about/Moment_Work.html?id=Mx5PDwAAQBAJ", "page_content": "MOISÉS KAUFMAN is the founder and artistic director of Tectonic Theater Project, a theater company based in New York City. His 1997 play Gross Indecency: The Three Trials of Oscar Wilde was named one of the best plays of the year by Time, Newsday, the New York Post, The Advocate, and The New York Times. With Tectonic he has directed works by Samuel Beckett, Tennessee Williams, Benjamin Britten, and others, and created new works including The Laramie Project and 33 Variations. He is the recipient of the 1997 Joe A. Callaway Award for excellence in the craft of stage direction. In 2016, President Obama awarded Kaufman a 2015 National Medal of Arts for \"his powerful contributions to American theater.\"\n\n\n\nBARBARA PITTS MCADAMS was an actor/dramaturg for The Laramie Project, performing at BAM, Alice Tully Hall, Union Square Theater, LaJolla Playhouse, Berkeley Rep, and Denver Center. She also appears in the HBO Films adaptation and shares an Emmy Nomination for the screenplay. Barb originally codified Moment Work for an internal teaching manual, and, as a Moment Work master teacher, leads trainings and devises new plays at colleges and high schools. She has also served as an adjunct professor for Drew University and CUNY’s Applied Theater MA program. She is a two-time Orchard Project and Sundance Theater Lab alum and a proud cast member of the award-winning web series Anyone But Me, about lesbian teens in the post-9/11 era."}, {"url": "https://howlround.com/commons/moises-kaufman", "page_content": "Moisés Kaufman is the founder and artistic director of Tectonic Theater Project, an award-winning director and playwright, and an activist-in-art. In recognition of his contributions to the theater and to international conversations about social justice, he has received numerous professional and humanitarian honors. Moisés is an Obie and Lucille Lortel award winner, a 2002 Guggenheim Fellow in Playwriting, winner of the 2002 Humanitas Prize, and has been nominated for Tony, Emmy, and Drama Desk awards. He was awarded the 2015 National Medal of Arts from President Barack Obama, which he accepted in a ceremony at the White House in September 2016.\n\nMoisés was born in Caracas, Venezuela, in 1963, and he grew up surrounded by the city’s thriving international performance scene. He studied with several theater companies at home and then, in 1987, moved to New York City to complete his education at New York University. He attended NYU’s groundbreaking Experimental Theatre Wing, where he deepened his investigation of the role of text in the creative process and his love of challenge in theatrical structure. When he finished school in 1991, Moisés founded Tectonic Theater Project with his husband, Jeff LaHoste. Many of their first collaborators came from Moisés’s artistic circle at the Experimental Theatre Wing.\n\nTectonic’s early productions were a natural expansion upon the themes that had absorbed Moisés in his studies: structurally difficult plays demanding extensive problem-solving in stagecraft. He found his path to creative maturity, though, in applying that passion for form and experimentation to his own new work, most notably 1997’s critically acclaimed Gross Indecency: The Three Trials of Oscar Wilde, which ran off-Broadway for a year and a half. Gross Indecency gained Moisés and the company national recognition and its success enabled them to travel to Laramie, Wyoming to pursue their next undertaking.\n\nThat next work, The Laramie Project (which Moisés wrote in collaboration with members of Tectonic after an extensive community-based research process), is an examination of the cultural conflict surrounding the 1998 murder of Matthew Shepard. It opened at the Denver Theater Center in March 2000 and moved to New York shortly thereafter. TIME called Laramie “one of the 10 best plays of 2000,” and it was nominated for the Drama Desk Award for Unique Theatrical Experience. It was also recently selected by the New York Times as one of their “25 Best American Plays Since ‘Angels in America’” and remains among the most performed plays in the United States. In 2002, Moisés co-wrote and directed HBO’s film adaptation of The Laramie Project, which garnered two Emmy Award nominations—Best Director and Best Writer.\n\nIn the years since Gross Indecency first brought his methods to wider attention, Moisés has continued to refine his devising process with Tectonic, always with an aim toward using the powers unique to theater to explore primary sources and understand underrepresented stories—old and new. His writing and adaptation credits include 33 Variations (2007), The Laramie Project: Ten Years Later (2008), One Arm (2011), and Carmen (2013-2016); as artistic director he has also guided the development of Anushka Paris-Carter and Andy Paris’s Uncommon Sense (2017).\n\nMoisés is also a dedicated teacher. Since 2000, he and the company’s teaching artists have been sharing Tectonic’s techniques in lectures, training labs, and educational residencies. In 2018, he co-wrote Moment Work: Tectonic Theater Project’s Process of Devising (Vintage), a comprehensive introduction to his theatrical principles and the company’s creative tools.\n\nOn Broadway, Moisés has directed the 2012 revival of The Heiress with Jessica Chastain, the Tony-nominated 33 Variations with Jane Fonda , Rajiv Joseph’s Pulitzer Prize finalist Bengal Tiger at the Baghdad Zoo with Robin Williams, and Doug Wright’s Pulitzer- and Tony Award-winning I Am My Own Wife with Jefferson Mays. He recently helmed the off-Broadway revival (Second Stage) and Broadway transfer of Harvey Fierstein’s Torch Song.\n\nOther directing credits include The Tallest Tree in the Forest with Mark Taper (Brooklyn Academy of Music), The Nightingale (La Jolla Playhouse), The Common Pursuit (Roundabout), Macbeth with Liev Schreiber (Public Theater), This Is How It Goes (Donmar Warehouse), Tennessee Williams’s One Arm (New Group and Steppenwolf Theatre Company), El Gato con Botas (New Victory Theater), Master Class with Rita Moreno (Berkeley Repertory Theatre), and Into the Woods (Kansas City Repertory Theatre). In January 2019, Moisés directed the world premiere of the musical Paradise Square at Berkeley Repertory Theatre.\n\nMost recently with Tectonic, Moisés has written and directed the workshop premiere of The Album (Here There Are Blueberries) at Miami New Drama in June 2018. It is in ongoing development with Tectonic, as is the new work Euphoria, both of which will be workshopped throughout 2019."}, {"url": "https://peoplepill.com/people/moises-kaufman/", "page_content": "Moisés Kaufman (born November 21, 1963) is a Venezuelan theater director, filmmaker, playwright, and founder of Tectonic Theater Project, based in New York City. He was awarded the 2016 National Medal of Arts by President Barack Obama. He is best known for creating The Laramie Project (2000) with other members of Tectonic Theater Project. He has directed extensively on Broadway and Internationally, and is the author of numerous plays, including Gross Indecency: The Three Trials of Oscar Wilde and 33 Variations.\n\nBorn and raised in Caracas, Venezuela, he moved as a young man to New York City in 1987.\n\nBiography\n\nKaufman is of Romanian and Ukrainian Jewish descent, and was born in Caracas, Venezuela. He is an alumnus of Venezuela's Universidad Metropolitana, where he began to study theatre. After immigrating to the United States, he went to college in New York and graduated from NYU.\n\nIn 2005 he described himself in an interview by saying, \"I am Venezuelan, I am Jewish, I am gay, I live in New York. I am the sum of all my cultures. I couldn't write anything that didn't incorporate all that I am.\"\n\nKaufman was awarded a Guggenheim Fellowship in 2002, following the premiere of The Laramie Project, which was based on extensive interviews with residents and commentators in and around Wyoming who were involved with the aftermath of the murder of gay student Matthew Shepard.\n\nHe made his Broadway directing debut in the 2004 production of I Am My Own Wife by Doug Wright, for which he received a Tony Award nomination for Best Direction of a Play.\n\nOn September 22, 2016, Kaufman was awarded the National Medal of Arts and Humanities in a ceremony conducted by U.S. president Barack Obama. He is the first Venezuelan to receive the honor.\n\nAwards\n\n2016 National Medal of Arts given to him by President Barack Obama\n\nObie Award - (Best Director) I AM MY OWN WIFE\n\nGuggenheim Fellowship\n\nTony Award Nomination (Best Director) I AM MY OWN WIFE\n\nTony Award Nomination (Best Playwright) 33 VARIATIONS (with Jane Fonda)\n\nNational Board of Review Award for Outstanding Made for Television Movie - THE LARAMIE PROJECT FILM (HBO)\n\nHumanitas Prize\n\nEmmy Nomination (Dest Director) The Laramie Project Film (HBO)\n\nEmmy Nomination (Best Screenwriter - with the Members of Tectonic Theater) THE LARAMIE PROJECT FILM (HBO)\n\nGolden Bear Award from the Berlin Film Festival THE LARAMIE PROJECT FILM (HBO)\n\nSteinberg/ATCA Best New Play Award—2008: 33 Variations\n\nOuter Critics Circle Award BEST DIRECTOR: GROSS INDECENCY: THE THREE TRIALS OF OSCAR WILDE.\n\nLucille Lortel Award BEST DIRECTOR: GROSS INDECENCY: THE THREE TRIALS OF OSCAR WILDE.\n\nGLAAD Media Award\n\nBay Area Theater Critics Circle Award GROSS INDECENCY: THE THREE TRIALS OF OSCAR WILDE\n\nLambda Book Award\n\nVenezuela's Casa del Artista\n\nAmerican Library Association's LGBT Literature Award\n\nMatthew Shepard Foundation's \"Making A Difference Award\"\n\nArtistic Integrity Award from the Human Rights Campaign\n\nCarbonell Award\n\nJoe A. Callaway Award for excellence in directing, given by The Society of Stage Directors and Choreographers\n\nStage directing credits\n\nPARADISE SQUARE (musical). Berkeley Rep.\n\nTORCH SONG (Broadway) Tony Nomination - Best Revival of a Play.\n\nTHE HEIRESS - with Jessica Chastain (Broadway).\n\nBengal Tiger at the Baghdad Zoo starring Robin Williams.(Broadway)\n\nstarring Robin Williams.(Broadway) Puss in Boots (El Gato con Botas)\n\n33 Variations starring Jane Fonda. (Broadway)\n\nstarring Jane Fonda. (Broadway) Macbeth (starring Liev Schreiber) for The Public Theater's Shakespeare in the Park\n\n(starring Liev Schreiber) for The Public Theater's Shakespeare in the Park Lady Windermere's Fan\n\nThis Is How It Goes starring Ben Chaplin at the Donmar Warehouse.\n\nstarring Ben Chaplin at the Donmar Warehouse. Into The Woods\n\nMaster Class (with Rita Moreno)\n\n(with Rita Moreno) One Arm by Tennessee Williams\n\nby Tennessee Williams I Am My Own Wife (2004, his Broadway debut)\n\n(2004, his Broadway debut) The Laramie Project (2000)\n\n(2000) Gross Indecency: The Three Trials of Oscar Wilde\n\nMarlow's Eye\n\nThe Nest\n\nWomen in Beckett\n\nMachinal\n\nCoxinga\n\nThe Nightingale\n\nThe Heiress\n\nTorch Song Trilogy\n\nFilm credits\n\nThe Laramie Project\n\nTelevision credits"}, {"url": "https://www.nytimes.com/2021/04/14/theater/the-seven-deadly-sins-new-york.html", "page_content": "After enjoying a successful run in Miami Beach from late November through January, “The Seven Deadly Sins,” an outdoor theatrical anthology series that explores humanity’s basest impulses, will come to New York. Performances are scheduled to begin on June 23 and will take place in storefront windows in Manhattan’s Meatpacking District.\n\n“I think it was important for us to do it in this moment of transition,” said Moisés Kaufman, the founder and artistic director of Tectonic Theater Project, which is producing the show with Madison Wells Live in association with Miami New Drama. “We wanted to be able to create something while the pandemic is still with us because it feels more like an act of defiance.”\n\nThe New York version of “The Seven Deadly Sins” will feature short new plays by Ngozi Anyanwu, Thomas Bradshaw, MJ Kaufman, Jeffrey LaHoste, Ming Peiffer and Bess Wohl. Moisés Kaufman will also contribute a piece to the anthology and direct the production. Each playwright’s work will address a particular “sin”: pride, greed, wrath, envy, gluttony, sloth or lust.\n\n“We really wanted the event to not be a revival of an existing play,” Kaufman said in an interview on Wednesday. After having been through a pandemic, “the idea that new art can be born on the streets of Manhattan is something that excites us.”"}, {"url": "https://www.barnesandnoble.com/w/moment-work-moises-kaufman/1126848890", "page_content": "MOISÉS KAUFMAN is the founder and artistic director of Tectonic Theater Project, a theater company based in New York City. His 1997 play Gross Indecency: The Three Trials of Oscar Wilde was named one of the best plays of the year by Time, Newsday, the New York Post, The Advocate, and The New York Times. With Tectonic he has directed works by Samuel Beckett, Tennessee Williams, Benjamin Britten, and others, and created new works including The Laramie Project and 33 Variations. He is the recipient of the 1997 Joe A. Callaway Award for excellence in the craft of stage direction. In 2016, President Obama awarded Kaufman a 2015 National Medal of Arts for \"his powerful contributions to American theater.\"\n\n\n\nBARBARA PITTS MCADAMS was an actor/dramaturg for The Laramie Project, performing at BAM, Alice Tully Hall, Union Square Theater, LaJolla Playhouse, Berkeley Rep, and Denver Center. She also appears in the HBO Films adaptation and shares an Emmy Nomination for the screenplay. Barb originally codified Moment Work for an internal teaching manual, and, as a Moment Work master teacher, leads trainings and devises new plays at colleges and high schools. She has also served as an adjunct professor for Drew University and CUNY’s Applied Theater MA program. She is a two-time Orchard Project and Sundance Theater Lab alum and a proud cast member of the award-winning web series Anyone But Me, about lesbian teens in the post-9/11 era."}]}