{"Moisés Kaufman has written and directed numerous plays, including Gross Indecency:": [{"url": "https://www.britannica.com/biography/Moises-Kaufman", "page_content": "Moisés Kaufman, (born November 21, 1963, Caracas, Venezuela), Venezuelan-born playwright and director who is best known for perceptive and moving plays often rooted in issues of sexuality. He was cofounder in 1991 of Tectonic Theater Project, a company dedicated to examining the structure and language of theatre as well as addressing contemporary social issues.\n\nKaufman was born in Venezuela to Orthodox Jewish parents and was of Ukrainian and Romanian descent. He attended a yeshiva (Jewish religious school) as a child and was exposed to broader culture on family trips to New York City. A Caracas theatre festival he attended as a young teenager brought him exposure to the avant-garde plays of such artists as Peter Brook, Tadeusz Kantor, Pina Bausch, and Jerzy Grotowski, whom he cited as his early influences. While attending Metropolitan University in Caracas (B.A. in business administration, 1985), Kaufman joined a touring experimental theatre group as an actor. In 1987 he moved to New York City, where he studied theatre directing at the Tisch School of the Arts, New York University, meanwhile directing a variety of plays. It was at NYU that he honed his ideas about the purpose and most-effective means of presenting theatrical performances. Four years later Kaufman, together with his partner, Jeffrey LaHoste, established Tectonic Theater Project.\n\nKaufman’s writing debut, Gross Indecency: The Three Trials of Oscar Wilde (performed 1997–98, published 1997), illustrated his concerns as a writer-director. He was especially interested in what he termed “watershed historical moments,” events that reveal the foundations of society’s beliefs. A powerful and moving play that used actual trial testimony, Gross Indecency won an Outer Critics Circle Award for outstanding Off-Broadway play. Kaufman and his troupe then began work on The Laramie Project (performed 2000, published 2001, television movie 2002), interviewing numerous residents of the small Wyoming city in which gay college student Matthew Shepard had been brutally murdered. The play had particular resonance with Kaufman, who was gay, and it proved popular throughout the world.\n\nIn 2003 Kaufman directed a one-man show, Doug Wright’s I Am My Own Wife: Studies for a Play About Charlotte von Mahlsdorf (performed 2003–04), the story of a gay transvestite who survived life in Nazi Germany and Soviet East Berlin. It was critically acclaimed and resulted in a Tony Award nomination for Kaufman. In the next several years Kaufman directed a variety of plays, including Wilde’s Lady Windermere’s Fan and Shakespeare’s Macbeth. He also directed his own play 33 Variations (first performed 2007), starring Jane Fonda as a musicologist obsessed with Beethoven’s Diabelli Variations, and received another Tony nomination. In 2009 Kaufman and other Tectonic members arranged for 150 simultaneous readings in theatres across the globe of a sequel, The Laramie Project: Ten Years Later. He also directed Rajiv Joseph’s Bengal Tiger at the Baghdad Zoo (performed 2011), starring Robin Williams as the title character; a 2012–13 revival of Ruth and Augustus Goetz’s The Heiress, a play based on Henry James’s novel Washington Square; and a revival of Torch Song (2018–19), which was written by Harvey Fierstein. In 2016 Kaufman received the National Medal of Arts."}, {"url": "https://broadwaynews.com/2022/05/24/how-moises-kaufmans-experiences-as-an-immigrant-informed-his-vision-for-broadways-paradise-square/", "page_content": "“As a Hispanic immigrant, there is a shared knowledge we have with everybody who immigrates to America,” says Moisés Kaufman, the theater veteran who this season directed his first Broadway musical, “Paradise Square.” The show is nominated for 10 Tony Awards, including Best Musical.\n\nKaufman, artistic director and founder of Tectonic Theater Project, told Broadway News that “Paradise Square” is the only musical on Broadway directed by a Hispanic person. The show resonates with him on a different level.\n\n“You never really leave the country that you leave, and you never really land in the country where you land. Your heart is always divided between the two places.”\n\nSet in 1863, “Paradise Square” centers on a group of Black Americans and Irish immigrants living together in the Five Points neighborhood of Lower Manhattan."}, {"url": "https://www.playbill.com/article/i-was-enraged-i-was-saddened-why-gross-indecency-was-banned-in-russia-and-will-return-to-nyc-with-a-vengeance-com-364432", "page_content": "Moises Kaufman's first play, Gross Indecency: The Three Trials of Oscar Wilde , will receive a star-studded benefit reading Oct. 5 to support the Tectonic Theater Project and the International Gay and Lesbian Human Rights Commission. Almost 20 years after the play's Off-Broadway debut, Kaufman reflects on how much has changed and how much hasn't.\n\n*\n\nAn Irish author, playwright and poet who became one of London's most popular artists in the late 1800s and a Venezuelan-born homosexual playwright may not seem to be kindred spirits at first glance. But, according to Moises Kaufman, he and Oscar Wilde have more in common than one might think.\n\nAnd Kaufman would know: He is the playwright who brought the legal and social troubles of the famed scribe to the stage in Gross Indecency: The Three Trials of Oscar Wilde, written about Wilde's three trials on the matter of his relationship with Lord Alfred Douglas and others, which led to charges of \"committing acts of gross indecency with other male persons.\" The play will be be presented in a benefit reading Oct. 5 at the Gerald W. Lynch Theater. Staged in response to the Kremlin blocking a production of Gross Indecency in Russia, the reading will feature Sally Field, Michael C. Hall, David Hyde Pierce, Tony Kushner, Jonathan Groff, Judith Light, Darren Criss, Tituss Burgess, David Burtka, Andy Mientus, Jose Llana, Will Carlyon and Jake Shears. All funds raised will benefit the Tectonic Theater Project and the International Gay and Lesbian Human Rights Commission.\n\nUpon hearing of the canceled production in Russia, Kaufman said, \"I was enraged. I was saddened. I had really high hopes because I loved the idea of having Oscar Wilde addressing contemporary Russian audiences. I thought that that would have been magnificent...The thing that kind of interests me the most is a playwright being powerful enough that 120 years after his imprisonment, governments are still scared of his writing and his work. To me that is the testament of the man's scope and his broadness. It's also a testament to the fact that as much progress as we have made, there are still many parts of the world, including the U.S., where we still have a great deal to go.\"\n\nPolitically charged works are nothing new to Kaufman, who is the author of The Laramie Project, written with members of the Tectonic Theater Project about the murder of gay student Matthew Shepard in Laramie, WY. He has also penned 33 Variations, which explored the work of Beethoven, and has directed I Am My Own Wife, the story of an East German transvestite, on Broadway, as well as Bengal Tiger at the Baghdad Zoo, which examined the effects of war. Gross Indecency's script was pulled from the original sources, including court transcripts and biographies of everyone who participated in the trial as well as written accounts. Kaufman also traveled the world interviewing historians and academicians, and his research led him to numerous inconsistencies in participants' accounts of the trial, such as Wilde and his lawyer.\n\n\"There were all these versions that contradicted one another, and in my naivete I thought that when I was done with my research, I would know who was telling the truth,\" Kaufman recalled. \"Of course, when I was done with my research, I was left with was a number of different versions of the same story... How do you write a play about the impossibility of reconstructing this? So that's the form of the play: a group of actors around a table trying to figure out what happened.\"\n\nFirst performed in New York in 1997, Gross Indecency was a critical hit and played an extended, sold-out run Off-Broadway. It starred Michael Emerson as Wilde, a role he is reprising in the Oct. 5 reading. In contrast to the 2015 cast, which features several out and proud actors, and famed playwrights Larry Kramer and Tony Kushner as the two judges, Kaufman recalled of the 1997 cast: \"When we first did the play, there was no famous actor that was out. There were famous actors that had been outed because they got AIDS, but there were no famous actors who were out.\"\n\nDespite the academia and research involved, the writing of Gross Indecency touched upon intimate aspects of Kaufman's childhood, which, he said, was governed by many of the same ideals as Victorian England: \"Religious authority, a kind of rigor in terms of gender identity and sexual orientation, a kind of hypocrisy that Victorians were famous for — pretending that they're shocked and horrified at the most human part of ourselves while doing everything behind closed doors.\n\n\"I think that I could understand a lot of the Victorian frame of mind because there was a way in which I came from such a thing. I mean, the only difference was that there was also, in Latin America, an incredible love of pleasure and an incredible love of celebration. And I think in that way Oscar Wilde was very Latin American. So I think there's a lot of points of contact between my upbringing and the kind of ideology in which he grew up. And, that was my first play, so I was taking lessons from the master.\"\n\nMany years have passed since the \"master\" was tried, and, Kaufman said, much progress has been made. Immediately following the Russian production being banned, the Supreme Court legalized same-sex marriage. Reflecting on the cultural shifts, Kaufman said, \"We live in a very strange time of great conquests and also great defeats, and they exist side by side, so I think that thinking about theatre as a platform where we can have these kinds of conversations is pivotal to continuing to redefine the culture in which we live.\"\n\nFollowing the Supreme Court ruling, Rowan County clerk Kim Davis refused to distribute same-sex marriage licenses, claiming her religious beliefs made it impossible for her to do so — even after a U.S. Court judge ordered her to comply with the law. She was jailed for a few days and is seen by some as a symbol of religious freedom and others as one of religious bigotry.\n\n\"What's shocking to me is how there is so much confusion about separation of church and state, about things that you are forced to do and things that it's your job to do, so there's a lot of confusion around those things,\" Kaufman said. \"So, yes, I'm very upset about it. I also think that it is a backlash that is to be expected.\"\n\nOne wonders what Oscar Wilde would have written about Kim Davis, this reporter mused. Kaufman quickly responded: \"I don't think he would have been kind about her behavior.\"\n\n(Carey Purcell is the Features Editor of Playbill.com. Her work appears in the news, feature and video sections of Playbill.com as well as in the pages of Playbill magazine. Follow her on Twitter @PlaybillCarey.)"}, {"url": "https://www.uidaho.edu/class/theatre/productions-and-events/archive/indecency", "page_content": "Oscar Wilde’s Sex and Censorship Trial Still Resonates\n\n“Gross Indecency—The Three Trials of Oscar Wilde” by Moises Kaufman is a fast-paced tragic courtroom drama focused on the acclaimed Irish poet and playwright and his relationships with male partners, specifically Lord Alfred Douglas.\n\nSet in the 1890s when homosexuality was illegal in the United Kingdom, the trials center around the eventual accusations of “gross indecency” given to anyone exhibiting homosexual activity.\n\nPresented by the Department of Theatre Arts and directed by University of Idaho Master of Fine Arts candidate, Ricky Kimball, the story’s relevancy in our current social climate is undeniable. The fight for LGBTQ+ rights has made immense strides in the past decades and has moved the needle towards justice. Wilde’s story compels people to acknowledge that while society has come a long way, we still have “the impulse to impose prohibitionist judgment on the private lives of individuals,” said Kimball.\n\n\"This is also a strong story about the power of perspectives in our culture. How we can shape and distort facts in a way that can change the very fabric of what is known as truth. This event shows the staining power of Puritanistic attitudes when it comes to trying to determine what is moral and immoral for everyone,\" Kimball said.\n\n“This story needs to be told to as many people as possible to show that we cannot call ourselves a humane society and treat each other in this way,” Kimball said. He hopes the production creates a conversation about the issues that continue today in our culture.\n\nThe script uses actual trial testimony and excerpts from Wilde’s writing with the words of his contemporaries and introduces more than 40 characters. A cast of students from the College of Letters, Arts and Social Sciences portray 11 characters including Luke Holt as Oscar Wilde and Angel Kalasz as Lord Alfred Douglas, along with Rachael Fornarotto, Scout Christensen, Eli Baker, Blake Presnell, Lauren Welch, Teresa Daily, Nick Hansen, Shawn Hunt and alumnus Brian Tibayan.\n\nArticle by Princess Kannah, BFA candidate in Performance\n\nDepartment of Theatre Arts\n\nPublished March 2021"}, {"url": "https://www.playbill.com/article/moises-kaufman-and-tectonic-are-developing-galileo-and-mozart-plays-com-105082", "page_content": "Moisés Kaufman, the artistic director of the Tectonic Theatre Project and the force behind Gross Indecency: The Three Trials of Oscar Wilde and The Laramie Project , is developing two new and typically ambitious projects for the troupe.\n\nMoisés Kaufman, the artistic director of the Tectonic Theatre Project and the force behind Gross Indecency: The Three Trials of Oscar Wilde and The Laramie Project, is developing two new and typically ambitious projects for the troupe.\n\nOne, titled And Yet It Moves, is described as \"an investigation into the lives of Galileo and Brecht.\" The other, Apollo Et Hyacinthus, is based on the first musical composition written by Wolfgang Amadeus Mozart, when a child prodigy of 11.\n\n\"And yet it moves\" are the immortal words astronomer and physicist Galileo Galilei uttered just after the Catholic Church forced him to renounce his theory that the Earth rotated and orbited the Sun. Several famous plays have been written about the Italian scientist, including Brecht's own politically-inflected Galileo.\n\nKaufman will direct Doug Wright's I Am My Own Wife at Playwrights Horizons next season.\n\n* Moisés Kaufman has been awarded a 2002 Guggenheim Fellowship in Playwriting.\n\nKaufman made his mark with Gross Indecency: The Three Trials of Oscar Wilde, a documentary-style account of the trial and sentencing of poet and playwright Oscar Wilde at the turn of the 20th century. Kaufman went on to co-write and direct The Laramie Project, about the 1998 murder of gay college student Matthew Shepard. The play transferred from a run in Denver to an Off-Broadway engagement and has exploded in the regional theatre scene. The play was recently made into a television film for HBO. Kaufman directed the picture.\n\nPast Guggenheim fellows include David Auburn and Rebecca Gilman.\n\n—By Robert Simonson"}, {"url": "https://stageagent.com/writers/3201/moises-kaufman", "page_content": "Moisés Kaufman is a playwright, director, and founder of the Tectonic Theater Project based in New York City.\n\nKaufman was born in Caracas, Venequela on November 21, 1963. His family is Orthodox Jewish of Romanian and Ukrainian descent. He attended a yeshiva (a Jewish religious school) as a child. While growing up, he was first exposed to theatre on family vacations to New York City. As a teenager, he attended a Caracas theatre festival which introduced him to the work of avant grade theater artists Peter Brook, Tadeusz Kantor, Pina Bausch, and Jerzy Grotowski, whom he cites as his earliest influences. He attended Metropolitan University in Caracas. During his time at university, he acted in a touring experimental theatre group.\n\nIn 1987, Kaufman moved to New York City to study directing at NYU's Tisch School of the Performing Arts. Four years later, he and his partner, Jeffrey LaHoste, created the Tectonic Theatre Project. The company is dedicated to addressing contemporary social issues, as well as to explore the structure and language of theatre.\n\nKaufman has stated that he is primarily drawn to moments in history that unintentionally reveal a society's views and belief systems. His first play, Gross Indecency: The Three Trials of Oscar Wilde, premiered in New York City in 1997. It won the Outer Critics Circle Award for Outstanding Off-Broadway play.\n\nFrom 1998-1999, Kaufman and the Tectonic Theater Project traveled to Laramie, Wyoming to interview those connected to the murder of gay college student Matthew Shepard. The ensuing work compiled from their interviews, The Laramie Project, premiered in 2000 and was made into a film for HBO on 2001. The play gathered a worldwide following and has become a seminole work for the LGBQT community and for professional theaters, universities, high schools, and community theaters.\n\nIn 2003, Kaufman directed Doug Wright's I Am My Own Wife: Studies for a Play About Charlotte von Mahlsdorf. The play follows a gay transvestite who survived life in Nazi Germany and Soviet East Berlin. Kaufman received a Tony Award nomination for his direction. In 2007, Kaufman directed for Broadway again, this time for his own play, 33 Variations starring Jane Fonda as a musicologist obsessed with Beethoven’s Diabelli Variations. This garnered him his second Tony nomination.\n\nIn 2009, Kaufman and other members of the Tectonic Theater Project reunited to create The Laramie Project: Ten Years Later, a sequel to the original piece. It was performed in staged readings around the globe.\n\nIn 2011, he directed Rajiv Joseph's Bengal Tiger At the Baghdad Zoo on Broadway starring Robin Williams. In 2012, he directed a revival of Ruth and Augustus Goetz's The Heiress on Broadway.\n\nMr. Kaufman has been honored with a Steinberg/ATCA Best New Play Award, a Dike Award, an Outer Critics Circle Award, a GLAAD Media Award, a Drama Desk Award, a Lucille Lortel Award, a Carbonell Award, a Bay Area Theater Critics Circle Award, a Lambda Book Award, Venezuela's Casa del Artista, American Library Association's GLBT Literature Award, the Matthew Shepard Foundation’s “Making A Difference Award\", the Artistic Integrity Award from the Human Rights Campaign, the National Board of Review Award for Outstanding Made for Television Movie, a Golden Bear Award from the Berlin Film Festival, the Humanitas Prize,the Joe A. Callaway Award, and two Tony Award nominations.\n\nFor more information on the Tectonic Theater Project, visit their website: http://tectonictheaterproject.org."}, {"url": "https://www.penguinrandomhouse.com/authors/15199/moises-kaufman/", "page_content": "Moisés Kaufman is a Tony and Emmy-nominated director and award-winning playwright. He is also the Co-founder and Artistic Director of Tectonic Theater Project.\n\n\n\nMr. Kaufman’s plays Gross Indecency: The Three Trials of Oscar Wilde and The Laramie Project (which he co-wrote with the members of Tectonic Theater) have been among the most performed plays in America over the last decade.\n\n\n\nHe is also the author of the Tony Nominated play 33 Variations; One Arm (his adaptation of the Tennessee Williams screenplay of the same name); and the short play London Mosquitoes.\n\n\n\nHe has directed numerous plays on Broadway including The Heiress starring Jessica Chastain; 33 Variations starring Jane Fonda; the Pulitzer-nominated play Bengal Tiger at the Baghdad Zoo by Rajiv Joseph, with Robin Williams; and the Pulitzer and Tony Award-winning I Am My Own Wife by Doug Wright which earned Mr. Kaufman an Obie Award for direction as well as Tony, Outer Critics, Lucille Lortell, Drama Desk Awards nominations.\n\n\n\nMr. Kaufman also directed the film adaptation of The Laramie Project, which aired on HBO and was the opening night selection at the 2002 Sundance Film Festival. The film won a Special Mention at the Berlin Film Festival and he received two Emmy Award nominations for Best Director and Best Writer.\n\n\n\nMr. Kaufman is a Guggenheim Fellow."}, {"url": "https://www.advocate.com/arts-entertainment/2016/9/22/10-things-know-about-moises-kaufman", "page_content": "Moises Kaufman, known for writing and/or directing such plays as The Laramie Project, Gross Indecency: The Three Trials of Oscar Wilde, and I Am My Own Wife, today will receive the National Medal of Arts from President Obama at the White House. The medal recognizes outstanding contributions to the excellence, growth, support, and availability of the arts in the United States. Kaufman is in good company; among this year's other recipients are film director Mel Brooks, author Sandra Cisneros, actor Morgan Freeman, composer Philip Glass, and actress-singer Audra McDonald. (See the full list here.) Kaufman has had a long and varied career, and some facts about his life and work may surprise even devoted fans. Read on for 10 things you should know about Moises Kaufman.\n\nHe is the son of a Holocaust survivor.\n\nKaufman's father, Jose, was a Romanian Jew who survived the Holocaust. As a boy, Jose earned money by making and selling the yellow Stars of David that the Nazi regime forced Jews to wear. \"He spent most of the war alternately hiding in a small room and selling Stars of David,\" Moises Kaufman recalled in the book A Memory, a Monologue, a Rant, and a Prayer, edited by Eve Ensler. After World War II was over, Jose made his way to Caracas, Venezuela. There he worked in a grocery store and eventually bought one, and he married Dora Akerman, a Venezuelan-born woman of Ukrainian descent. Moises was born in Caracas in 1963. His parents brought him up in the Orthodox branch of Judaism, and he attended a yeshiva -- a Jewish religious school -- which made Moises quite the outsider in the heavily Catholic nation, as did his realization at age 11 that he was gay. Moises moved to New York City in 1987 to pursue his theatrical career, in which many of his projects have dealt with outsiders, and some have touched directly on the Holocaust. In 2015 he directed a revival of Bent, Martin Sherman's play about gay men in a concentration camp, at Los Angeles's Mark Taper Forum.\n\nThe Laramie Project was a massive undertaking.\n\nFor The Laramie Project, which deals with the brutal murder of gay college student Matthew Shepard and the reactions of the townspeople in Laramie, Wyo., Kaufman and his colleagues at the Tectonic Theater Project compiled 400 hours of interviews from over 200 people. Kaufman was in New York City when he heard about the attack on Shepard in October 1998. \"I started getting phone calls -- 'Did you hear what happened?' -- and then I read it in the newspaper and I saw it on television,\" he recalled to The Advocate in 2008. \"People have spoken about how we as gay people feel attacked, injured, constantly in our culture. And that image of that boy tied to the fence spoke to so many of us about our pain and about our sense of how we fit into the landscape of this country. The impact of seeing what this was doing to the country--that's when I decided to go to Laramie and do The Laramie Project.\" The Laramie Project premiered in 2000, has been performed widely, and was adapted into an HBO movie, directed by Kaufman, in 2002. And 10 years after Shepard's death Kaufman and his Tectonic collaborators returned to Laramie to compile a sequel, The Laramie Project: Ten Years Later, which premiered in 2009.\n\n[rebelmouse-image 32740833 expand=1 dam=1 alt=\"WATCH: True Life: \"I Have a Trans Parent\"\" site_id=25879312 is_animated_gif=false original_size=\"750x563\" crop_info=\"%7B%22image%22%3A%20%22https%3A//assets.rbl.ms/32740833/origin.jpg%22%2C%20%22thumbnails%22%3A%20%7B%22origin%22%3A%20%22https%3A//assets.rbl.ms/32740833/origin.jpg%22%2C%20%22300x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D300%22%2C%20%221500x2000%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1500%26height%3D2000%26coordinates%3D308%252C0%252C20%252C0%22%2C%20%22700x1245%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D700%26height%3D1245%26coordinates%3D361%252C0%252C73%252C0%22%2C%20%22600x200%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D200%26coordinates%3D0%252C178%252C0%252C135%22%2C%20%22600x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%22%2C%20%22300x300%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D300%26height%3D300%26coordinates%3D188%252C0%252C0%252C0%22%2C%20%221200x600%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1200%26height%3D600%26coordinates%3D0%252C116%252C0%252C73%22%2C%20%22600x600%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D600%26coordinates%3D188%252C0%252C0%252C0%22%2C%20%222000x1500%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D2000%26height%3D1500%26coordinates%3D0%252C1%252C0%252C0%22%2C%20%22600x300%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D300%26coordinates%3D0%252C116%252C0%252C73%22%2C%20%22750x1000%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D750%26height%3D1000%26coordinates%3D308%252C0%252C20%252C0%22%2C%20%221200x800%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1200%26height%3D800%26coordinates%3D0%252C53%252C0%252C10%22%2C%20%22210x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D210%22%2C%20%221200x400%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1200%26height%3D400%26coordinates%3D0%252C178%252C0%252C135%22%2C%20%221245x700%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1245%26height%3D700%26coordinates%3D0%252C93%252C0%252C50%22%2C%20%221000x750%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D1000%26height%3D750%26coordinates%3D0%252C1%252C0%252C0%22%2C%20%22600x400%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D600%26height%3D400%26coordinates%3D0%252C53%252C0%252C10%22%2C%20%22980x%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D980%22%2C%20%2235x35%22%3A%20%22https%3A//rebelmouse.advocate.com/media-library/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8zMjc0MDgzMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcyNDc4NDgyNH0.Y85TtSFypBmA3tBpeYbwDTCjKA_SEEu_QkTyd3VO9yo/image.jpg%3Fwidth%3D35%26height%3D35%22%7D%2C%20%22manual_image_crops%22%3A%20%7B%229x16%22%3A%20%7B%22sizes%22%3A%20%5B%22700x1245%22%5D%2C%20%22top%22%3A%200%2C%20%22height%22%3A%20563%2C%20%22width%22%3A%20316%2C%20%22left%22%3A%20361%7D%2C%20%22600x300%22%3A%20%7B%22sizes%22%3A%20%5B%22600x300%22%5D%2C%20%22top%22%3A%20116%2C%20%22height%22%3A%20374%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%223x1%22%3A%20%7B%22sizes%22%3A%20%5B%221200x400%22%2C%20%22600x200%22%5D%2C%20%22top%22%3A%20178%2C%20%22height%22%3A%20250%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%223x2%22%3A%20%7B%22sizes%22%3A%20%5B%221200x800%22%2C%20%22600x400%22%5D%2C%20%22top%22%3A%2053%2C%20%22height%22%3A%20500%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%221x1%22%3A%20%7B%22sizes%22%3A%20%5B%22600x600%22%2C%20%22300x300%22%5D%2C%20%22top%22%3A%200%2C%20%22height%22%3A%20563%2C%20%22width%22%3A%20562%2C%20%22left%22%3A%20188%7D%2C%20%223x4%22%3A%20%7B%22sizes%22%3A%20%5B%221500x2000%22%2C%20%22750x1000%22%5D%2C%20%22top%22%3A%200%2C%20%22height%22%3A%20563%2C%20%22width%22%3A%20422%2C%20%22left%22%3A%20308%7D%2C%20%2216x9%22%3A%20%7B%22sizes%22%3A%20%5B%221245x700%22%5D%2C%20%22top%22%3A%2093%2C%20%22height%22%3A%20420%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%224x3%22%3A%20%7B%22sizes%22%3A%20%5B%222000x1500%22%2C%20%221000x750%22%5D%2C%20%22top%22%3A%201%2C%20%22height%22%3A%20562%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%2C%20%222x1%22%3A%20%7B%22sizes%22%3A%20%5B%221200x600%22%2C%20%22600x300%22%5D%2C%20%22top%22%3A%20116%2C%20%22height%22%3A%20374%2C%20%22width%22%3A%20750%2C%20%22left%22%3A%200%7D%7D%7D\" caption=\"You've viewed the adventures of the Pfefferman family; now see some real-life young adults dealing with a parent's transition in a new episode of MTV's True Life, \\\"I Have a Trans Parent.\\\" Follow Kiara as she gets to know her \\\"Pops,\\\" the parent she previously knew as her mother, and Jeffrey as he accepts his father as a transgender woman and strives to help his brothers do the same. The episode airs Monday at 11:30 p.m./10:30 Central; watch a preview below.\n\n\" photo_credit=\"\"]\n\nGross Indecency: The Three Trials of Oscar Wilde was banned in Russia.\n\nThis was Kaufman's debut as a playwright, opening off-Broadway in 1997, and it was a major success. It received numerous critics' awards and a GLAAD Media Award. It has been produced in dozens of cities in the U.S. and abroad, but a planned production in Moscow was abruptly canceled in 2015. The production was to be funded in part by the U.S. State Department, but the Russian government stepped in and said the Moscow theater company that was to stage it could not accept foreign funds. The real reason for the cancellation, Kaufman believes, was that this depiction of the great gay author and wit ran afoul of Russia's \"gay propaganda\" law, which bans any positive discussion of LGBT people or issues in forums accessible to minors. The play did receive a a star-studded benefit reading in New York City in the fall of 2015 to support the Tectonic Theater Project and the International Gay and Lesbian Human Rights Commission.\n\nPictured: Kaufman (left) and Ben Foster clown around at the premiere of the HBO film of The Laramie Project.\n\nThe Laramie Project has run into trouble a few places too.\n\nThe Laramie Project's gay subject matter has led high school administrators to cancel performances of the play in places as varied as Spokane, Wash.;Ottumwa, Iowa; and Burbank, Calif. The students in Burbank eventually were able to stage their production, although not at their high school -- it went on at the Los Angeles suburb's Colony Theatre, which donated the space, and with help from Tectonic. But the play also has had well-received, school-supported productions in many places in the U.S., including Xavier High School, a Roman Catholic institution in New York City.\n\nHis play 33 Variations gave Jane Fonda her first Broadway role in 46 years.\n\nKaufman wrote and directed 33 Variations, about a music scholar studying one of Beethoven's most enigmatic works, and when it premiered on Broadway in 2009, Jane Fonda played the lead role. This was Fonda's first Broadway appearance since 1963, and she received positive reviews. \"Whatever discomfort the actress may feel melds into her portrayal of Dr. Katherine Brandt, whose naturally assertive nature is humbled by the progressive, atrophying illness known as Lou Gehrig's disease,\" Ben Brantley wrote in The New York Times, adding, \"For those who grew up enthralled with Ms. Fonda's screen image, it's hard not to respond to her performance here, on some level, as a personal memento mori.\"\n\nHe discovered a different side of Robin Williams during Bengal Tiger at the Baghdad Zoo.\n\nFonda isn't the only major movie star who has appeared in a Kaufman play. In 2011, Robin Williams starred in Bengal Tiger at the Baghdad Zoo, a meditation on the Iraq war written and directed by Kaufman. Williams portrayed a tiger who is killed in the first scene and then haunts the rest of the characters for the remainder of the play. Williams initially started rehearsals with what Kaufman called \"the 10 a.m. stand-up.\" \"He would start talking about whatever crossed his mind and would riff on it for the next 20 or 30 minutes, keeping all of us -- actors, designers, stage management -- roaring with laughter,\" Kaufman wrote in Salon in 2014, after Williams's suicide. \"Like everyone, I was dazzled by the speed of his brain and the quickness of his wit, but I also noticed something else: an actor's natural trepidation about tackling a demanding role. As he developed his character ... the 10 a.m. monologues became shorter and shorter. He was feeling more at home in the rehearsal room, finding his groove in the role. Until, finally, the monologues were gone.\" Williams also developed \"a real camaraderie\" with his castmates -- and he occasionally showed signs of depression, the playwright noted. \"For me, it isn't his brilliant sense of humor, or his wit, or his chameleon abilities that I'll miss,\" Kaufman concluded. \"I'll miss the guy who came to rehearsal every day with humility and kindness, who sat around at lunch and shot the breeze. I'll miss the man who loved what he did every day. And who loved this community. I will miss my friend.\"\n\nHe's even directed operas, including one based on Puss in Boots.\n\nKaufman has proved his versatility time and again. In 2010 he took on the direction of Spanish composer Xavier Montsalvatge's chamber opera adaptation of the popular fairy tale. The production incorporated both puppets and human actors. Staging a show aimed at children was intimidating and also rewarding, Kaufman told the New York Daily News. \"I've never been more scared in my life, because children don't lie,\" he said. On the other hand, he noted, \"There's nothing better than hearing children laugh.\"\n\nHis most recent project is a reimagining of Bizet's Carmen.\n\nNothing if not adventurous, Kaufman and cowriter Eduardo Machado adapted Georges Bizet's 19th-century opera into Carmen: An Afro-Cuban Jazz Musical, set in 1958, changing the locale from Spain to Cuba, and making the sensuous factory worker Carmen a black woman who supports Fidel Castro's revolution. Composer Arturo O'Farrill adapted Bizet's melodies into jazzy tunes with lyrics by Kaufman and others. The play had its world premiere, directed by Kaufman, in February of this year at the Olney Theatre Center in Montgomery County, Md., near Washington, D.C.\n\nDespite all his success, Kaufman describes himself as shy and socially awkward.\n\n\"I'm incredibly shy, I am socially awkward, and I don't have many other interests other than my work,\" he told Los Angeles's Jewish Journal in 2011. \"When I'm in the rehearsal room, I'm my best self. I've always known how to live in my work. I am not so good at living my life.\"\n\nBut he has managed to have a long-term relationship. He is married to Jeffrey LaHoste, with whom he founded the Tectonic Theater Project.\n\nKaufman and LaHoste founded Tectonic in 1991, with the goal of \"developing innovative works that explore theatrical language and form, fostering an artistic dialogue with audiences on the social, political, and human issues that affect us all,\" according to the New York-based company's website. Kaufman is its artistic director, and LaHoste, a writer and producer, is a member of the board of directors. LaHoste has produced many of Kaufman's plays and several other projects, such as Kirby Dick's 2009 documentary film Outrage, about closeted politicians who support anti-LGBT legislation. He is also the author of author of Elysian Fields, a television series in development that was chosen as a participating project in the Producers' Guild of America's Diversity Workshop. Kaufman and LaHoste have been together for more than 20 years, and they were married in 2014."}, {"url": "https://books.google.com/books/about/Gross_Indecency.html?id=w5RBDwAAQBAJ", "page_content": ": The Three Trials of Oscar Wilde Moises Kaufman Knopf Doubleday Publishing Group , 27 Jan 1998 - Drama - 160 pages 2 Reviews Reviews aren't verified, but Google checks for and removes fake content when it's identified Winner of the Lambda Literary Award\n\n\n\nIn this stunning work of theater, Moises Kaufman turns the trials of Oscar Wilde into a riveting human and intellectual drama.\n\n\n\nIn April 1895 Oscar Wilde brought a libel suit against the Marquess of Queensberry, the father of his youthful lover, who had publicly maligned him as a sodomite. In doing so, England's reigning man of letters set in motion a series of events that would culminate in his ruin and imprisonment. For within a year the bewildered Wilde himself was on trial for acts of \"gross indecency\" and, implicitly—for a vision of art that outraged Victorian propriety. Expertly interweaving courtroom testimony with excerpts from Wilde's writings and the words of his contemporaries, Gross Indecency unveils its subject in all his genius and human frailty, his age in all its complacency and repression. The result is a play that will be read and studied for decades to come."}, {"url": "https://www.nbcnews.com/news/latino/legendary-playwright-mois-s-kaufman-talks-about-art-lgbtq-activism-n672736", "page_content": "NEW YORK — Growing up gay in Venezuela, Moisés Kaufman knew what it was like to feel like an outsider. The son of a Holocaust survivor, he was raised in an Orthodox Jewish family in a conservative, deeply Roman Catholic country – which led to profound feelings of isolation.\n\n“The difficulty was that there were no role models,” he told NBC News. “But I remember very vividly the first time I found the word ‘homosexual’ in the dictionary and being delighted, because I thought there must be one other person in the world who is homosexual because there is a word for it.”\n\nToday Moisés Kaufman, 52, is one of the most acclaimed playwrights and directors in the American theater.\n\nIn September, Kaufman was among a select group of Americans honored at the White House with the highly prestigious National Medal of the Arts. He termed the experience “exciting” because of his fellow honorees. “Some of those people are people I have admired all my life, like Mel Brooks, Sandra Cisneros,” he said. “There was really a great sense of camaraderie between all of the recipients. And I love President Obama, so it was really wonderful to receive it from him.”\n\nPresident Barack Obama presents director Moises Kaufman with the 2015 National Medal of Arts during a ceremony in the East Room of the White House on Sept. 22. SAUL LOEB / AFP - Getty Images\n\nKaufman's plays been produced everywhere from Broadway to public high schools. He has been nominated for Tony and Emmy awards. And as his theater group celebrates its 25th anniversary, he can reflect on a body of work that has impacted social and cultural norms worldwide.\n\nOn Thursday, September 22, in the East Room of the White House, President Barack Obama awarded the 2015 National Medal of Arts and the National Humanities Medal to distinguished recipients. First Lady Michelle Obama attended the ceremony. Cheriss May / (C)2016 Photo by Cheriss May, www\n\nAfter attending college in Venezuela, Kaufman moved to New York City to study directing. He founded his theater company, The Tectonic Theater Project, in 1991 with his now-husband Jeffrey LaHoste.\n\n“We started it in the dining room of our apartment. The first four years, we were performing in church basements,” Kaufman said. “Often there were more people onstage than in the house.”\n\nRELATED: These Latinos Were Honored with National Medals for Art, Humanities\n\nThe Tectonic Theater Project uses a unique process for conceiving and reimagining theater known as “Moment Work.” It enables actors, writers, designers, and directors to collaborate in creative storytelling.\n\nVenezuelan-born playwright/director. Moises Kaufman. The LIFE Images Collection/Getty Images\n\nUsing this technique, Kaufman wrote and directed Gross Indecency: The Three Trials of Oscar Wilde in 1997. This off-Broadway play, which The New York Times called “absolutely gripping,” utilized actual testimony and transcripts from the trials of the iconic Wilde. Kaufman won a Lambda Literary Award, an award given for works that explore LGBT themes, for \"Gross Indecency\" in 1998.\n\nThat same year, just three months after the brutal murder of gay student Matthew Shepard, Kaufman took his theater group to Laramie, Wyoming to interview people in the town where the killing had taken place. They conducted over 200 interviews, totaling 400 hours, and the company then used these oral histories to write The Laramie Project.\n\n“The community was in shock,” Kaufman recalled. “They never expected a murder like that to occur in their midst. We managed to capture, I think, something of the rawness and the experience the town was having at that time.”\n\nKaufman and his siblings. Moises Kaufman\n\nActress Mercedes Herrero, who collaborated in the creation of \"The Laramie Project,\" described the process as “pretty extraordinary.”\n\n“I came from the Stanislavski (acting) tradition,” Herrero said. “Moisés was using this experimental form, not only gathering interviews, but also literally writing current events as they were happening. This was a new kind of theater to me, and it was mind-blowing.” Herrero, who co-stars in House of Cards, added that working with Kaufman has made her “a more politically aware being.”\n\n\"The Laramie Project,\" about the town’s reaction to Shepard’s brutal killing, went on to become one of the most acclaimed plays of the year, and one of the most-produced works of the decade. It has been performed worldwide, and is often used to educate people about homophobia and anti-LGBT violence. It was also made into an HBO film written and directed by Kaufman.\n\nJudy Shepard, the mother of Matthew Shepard, told NBC News that \"The Laramie Project\" was very special to her. “I think everybody can relate to an actor who is on stage. The audience is seeing somebody who is like them,” she said. “It brings home how differently we all feel about things, and how we respond to things.”\n\n“It (the play) is not specifically about Matt,” Shepard pointed out. “But it shows how society looks when we don’t accept each other for who we are. It shows what happens when we are at odds with each other for no reason.”\n\nShepard said that she hears from people all over the country who have “come out” as LGBT after seeing or having been a part of the play.\n\n“People say to me, are you a Latino writer? Are you a gay writer? Are you a Jewish writer? And I say yes to all.\"\n\n“Moisés has absolutely moved the needle in terms of how people view bullying and hate crimes against LGBT people,” said Shepard.\n\nKaufman and his theater company revisited Laramie to produce The Laramie Project: Ten Years Later in 2008.\n\nIn 2003, Kaufman directed the Pulitzer Prize- and Tony Award-winning play I Am My Own Wife on Broadway. Also on Broadway, in 2009 he directed Jane Fonda in 33 Variations, and Robin Williams in Bengal Tiger at the Baghdad Zoo in 2011. Kaufman’s most recent Broadway show was a 2012-2013 revival of The Heiress, starring Jessica Chastain.\n\nGlenn Davis, Brad Fleischer, playwright Rajiv Joseph, Robin Willams, director Moises Kaufman, Arian Moayed & Hrach Titizian during the Broadway Opening Night Curtain Call for 'Bengal Tiger at the Baghdad Zoo' at the Richard Rodgers Theatre in New York City. (C) Walter McBride/WM Photography / Corbis via Getty Images\n\n“He is a lovely person, with a really nice energy,” said casting director James Calleri, who worked with Kaufman on \"33 Variations.\"\n\n“Actors seem to want to work with him a lot,\" said Calleri. \"And he has very strong feelings about what the work should be.”\n\nThe fact that Kaufman’s work has dealt with controversial themes, Calleri stated, has contributed to its success in regional productions.\n\n“His stuff has been very on-topic and present, which, if anything, has helped it have an impact outside New York, in colleges and in local productions. \"The Laramie Project\" has even been done in high schools.”\n\nKaufman’s plays have generated their share of controversy. When \"The Laramie Project\" was first being produced at colleges, there were protests from people who claimed it was being used to recruit students into homosexuality. Last year, Russia cut off funding for a production of \"Gross Indecency\" at the Moscow New Drama Theater because of its gay themes.\n\nBroadway writer/director Moises Kaufman as a young actor. Moises Kaufman\n\nKaufman is currently working on an adaptation of the opera \"Carmen,\" and has several events planned for this fall. On November 7, Jane Fonda will host the 25th anniversary gala for the Tectonic Theater Project. The event will feature celebrities reading excerpts from Tectonic’s plays, including The Laramie Project and 33 Variations.\n\nOn November 10, Kaufman will be presented with the American Artist Award by Arena Stage in Washington D.C.\n\nThe Artistic Director of Arena Stage, Molly Smith, said that she was proud to have known Kaufman for almost two decades. “I watched him in the initial stages of developing \"The Laramie Project.\" I have been so moved by his combination of theater, social commentary, and political fervor in the projects he has taken on,” Smith said. “He is a bold theater artist, and I think our audience loves that.”\n\nWhen Barack Obama signed the Matthew Shepard and James Byrd, Jr. Hate Crimes Prevention Act, Smith noted, the president had Kaufman there as a recognition of the impact of his work.\n\nSmith also mentioned that Kaufman was “one of the most gracious and warm individuals you could ever meet.”\n\nThroughout his career, Kaufman has dealt with issues of identity. “People say to me, are you a Latino writer? Are you a gay writer? Are you a Jewish writer? And I say yes to all,” he said. “If I am any good at what I do, then I’m a Latino writer and I am a Jewish writer and I’m a gay writer, and I’m a New York writer. And I’m a writer of all the things that I am as a human being.”\n\nStill, Kaufman said that LGBT youth continue to face challenging circumstances as they grow up. “Anyone who has ever had the experience of coming out will tell you that it is a process. It is a process for the person coming out, and for the people you are coming out to,” he said. In his case, he explained, because his work dealt so publicly with issues of gender and sexuality, his parents had to learn how to deal with it.\n\nA picture of Moises Kaufman and his father Jose. Moises Kaufman\n\nAlthough Kaufman describes his mother and late father as “very proud and supportive” of his work, he stressed that young LGBT kids often struggle with acceptance. “The question of whether things are getting better for LGBT youth is a complicated one,” he said.\n\n“On the one hand, yes, they are getting better. Having said that, there is an epidemic of bullying in high school, especially against LGBT kids,” Kaufman continued, mentioning the high rates of suicide and depression among LGBT youth.\n\n“So I think that yes, things are getting better,\" said the playwright. \"But there is still a lot of work to do.”\n\nFollow NBC News Latino on Facebook, Twitter and Instagram."}]}