{"Robert Holgate was born around 1481.": [{"url": "https://discovery.nationalarchives.gov.uk/details/c/F31981", "page_content": "This website uses cookies\n\nWe place some essential cookies on your device to make this website work.\n\n\n\nWe'd like to use additional cookies to remember your settings and understand how you use our services.\n\n\n\nThis information will help us make improvements to the website."}, {"url": "https://www.wikitree.com/wiki/Holgate-163", "page_content": "Is Robert your ancestor? Please Login to collaborate or comment the profile manager, ask our community of genealogists a question.\n\nDNA\n\nNo known carriers of Robert's ancestors' DNA have taken a DNA test\n\nHave you taken a DNA test? If so, login to add it. If not, see our friends at Ancestry DNA."}, {"url": "https://www.findagrave.com/memorial/112912649/robert-holgate", "page_content": "Archbishop of York\n\n\n\nRobert Holgate (1481/1482 – 1555) was Bishop of Llandaff and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as leader of the Church of England.\n\n\n\nHolgate, chaplain to Thomas Cromwell, 1st Earl of Essex, became master of the Gilbertine Order in 1536, and exerted his influence to prevent the surrender of the Gilbertine houses under the Act for the Suppression of the Smaller Monasteries in 1536 as only four out of twenty-six houses had revenues over £200 a year. In 1538, Holgate surrendered Sempringham Priory.\n\n\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This may however have been a second marriage to make it fully legal, and Holgate and Wentworth may have first married in late 1547 with Roger Tongue officiating. In 1551 Arthur Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne she imprisoned Holgate on various charges, with his being a married clergy being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\n\n\n\n\nArchbishop of York\n\n\n\nRobert Holgate (1481/1482 – 1555) was Bishop of Llandaff and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as leader of the Church of England.\n\n\n\nHolgate, chaplain to Thomas Cromwell, 1st Earl of Essex, became master of the Gilbertine Order in 1536, and exerted his influence to prevent the surrender of the Gilbertine houses under the Act for the Suppression of the Smaller Monasteries in 1536 as only four out of twenty-six houses had revenues over £200 a year. In 1538, Holgate surrendered Sempringham Priory.\n\n\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This may however have been a second marriage to make it fully legal, and Holgate and Wentworth may have first married in late 1547 with Roger Tongue officiating. In 1551 Arthur Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne she imprisoned Holgate on various charges, with his being a married clergy being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\n\n\n"}, {"url": "https://maltonians.maltonschool.org/people/holgate.php", "page_content": "Illustrated here is the church at Darrington, near Pontefract. Archbishop Holgate's heir was his nephew, Thomas Holgate, who acquired the manor of Stapleton in the parish of Darrington. Several Holgate tombstones are here.\n\nROBERT HOLGATE died on 15th November, 1555 at the Headhouse of the Master of Sempringham, a Gilbertine Order of which he had himself been Master. In his Will he asked that his body should \"be buried in the parish church within the parish whereof it shall please Almighty God to take me out of this transitory life\". The Headhouse stood in Cow Lane, Smithfield, and within the parish of St. Sepulchre. \" The bells of Old Bailey\" are the bells of this Church which stands at the junction of Giltspur Street and Holborn Viaduct.\n\nSir William Petre was one of the four executors of Holgate's will. He was born c.1505 at Torbryan, in Devon, and educated at Oxford of which university he became Doctor of Law in 1533. For a time he was tutor to a brother of Anne Boleyn. By 1544 Henry VIII had made Petre a knight, a privy councillor, and one of his two Principal secretaries. He served Henry, Edward, Mary and Elizabeth. The original painting is at Ingatestone Hall in Essex.\n\nAdvert for Malton Free Grammar School\n\nAn illustration of a bill advertising the Grammar School at Old Malton. The illustration is taken from a book by Dr J S Purvis, Director of the Borthwick Institute of Historical Research in 1960, entitled \"Historical Records\"\n\nThe illustration was on the front of the menu for the Holgate Society dinner at Brown's Hotel, 28th October 1960.\n\nA transcription:\n\nThis is to give NOTICE,That at Old Malton Free Grammar School, YOUTH are completely qualified for any manner of Bufinefs, in Latin, Greek &c. Alfo Arithmetic in all its Parts, Navigation, Menfuration, Merchants Accompts &c. and Writing in very Perfection, by JOSEPH KERR, Mafter. WILLIAM HALL, Affiftant.\n\nN. B. Old Malton is pleafantly fituated upon the River Derwent in the North-Riding of the County of York, in a fine plentiful Country: Board at Seven Pounds per Annum; Board and Learning, at Nine Guineas; Learning, Board, and Cloaths, found in a neat decent Manner, at the Expense of Twelve Pounds.\n\nThofe who are pleafed to encourage this SCHOOL, may depend upon fuch Exactnefs and Care, as will, in every Refpect, be confiftent with this publick Notice"}, {"url": "https://www.houseofnames.com/hogate-family-crest", "page_content": "Hogate History, Family Crest & Coats of Arms Origins Available:\n\nOrigins Available: England\n\nThe name Hogate is an old Anglo-Saxon name. It comes from when a family lived in Holdgate, a parish, in the union of Ludlow, hundred of Munslow, in Shropshire. [1]\n\nAlternatively, the name could have originated in Holgate, a township, in the parish of St. MaryBishopshill-Junior, union of York, E. division of the Ainsty wapentake, in the West Riding of Yorkshire. [1] [2]\n\nLoading...\n\nEarly Origins of the Hogate family\n\nLoading...\n\nEarly History of the Hogate family This web page shows only a small excerpt of our Hogate research. Another 59 words (4 lines of text) covering the years 1525, 1481, 1555, 1545, 1554, 1481, 1549, 1524 and 1537 are included under the topic Early Hogate History in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nHogate Spelling Variations Before the last few hundred years, the English language had no fast system of spelling rules. For that reason, spelling variations are commonly found in early Anglo-Saxon surnames. Over the years, many variations of the name Hogate were recorded, including Holgate, Holdgate, Howgate, Hogate and others.\n\nLoading...\n\nEarly Notables of the Hogate family (pre 1700) Notables of the family at this time include Robert Holgate or Holdegate (c. 1481-1555), English Bishop of Llandaff and then Archbishop of York (1545-1554.) He recognized Henry VIII as head of the Church of England. \"He was the youngest son of Thomas Holgate and Elizabeth, daughter of Robert Champernowne, came of a Yorkshire family entitled to armorial bearings, and was born probably at Hemsworth, near Pontefract, in or about 1481, being, according to his own statement, sixty-eight years old in 1549. He was a canon of the order of St. Gilbert of Sempringham, and was probably educated in the house belonging...\n\nAnother 106 words (8 lines of text) are included under the topic Early Hogate Notables in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nMigration of the Hogate family To escape oppression and starvation at that time, many English families left for the \"open frontiers\" of the New World with all its perceived opportunities. In droves people migrated to the many British colonies, those in North America in particular, paying high rates for passages in cramped, unsafe ships. Although many of the settlers did not make the long passage alive, those who did see the shores of North America perceived great opportunities before them. Many of the families that came from England went on to make essential contributions to the emerging nations of Canada and the United States. Research into various historical records revealed some of first members of the Hogate family emigrate to North America: James Holgate settled in Philadelphia in 1685; William Holgate settled in New England in 1748; Mathew Holdgate settled with his daughter Mary in Philadelphia in 1685.\n\nContemporary Notables of the name Hogate (post 1700) + Kenneth Hogate Bacon (1944-2009), American journalist, spokesman for the Department of Defense during the Presidency of Bill Clinton, former president of Refugees International"}, {"url": "https://www.houseofnames.com/oldgate-family-crest", "page_content": "Oldgate History, Family Crest & Coats of Arms Origins Available:\n\nOrigins Available: England\n\nThe history of the Oldgate family goes back to the ancient Anglo-Saxon culture of Britain. It is derived from the family living in Holdgate, a parish, in the union of Ludlow, hundred of Munslow, in Shropshire. [1]\n\nAlternatively, the name could have originated in Holgate, a township, in the parish of St. MaryBishopshill-Junior, union of York, E. division of the Ainsty wapentake, in the West Riding of Yorkshire. [1] [2]\n\nLoading...\n\nEarly Origins of the Oldgate family\n\nLoading...\n\nEarly History of the Oldgate family This web page shows only a small excerpt of our Oldgate research. Another 59 words (4 lines of text) covering the years 1525, 1481, 1555, 1545, 1554, 1481, 1549, 1524 and 1537 are included under the topic Early Oldgate History in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nOldgate Spelling Variations Until quite recently, the English language has lacked a definite system of spelling rules. Consequently, Anglo-Saxon surnames are characterized by a multitude of spelling variations. Changes in Anglo-Saxon names were influenced by the evolution of the English language, as it incorporated elements of French, Latin, and other languages. Although Medieval scribes and church officials recorded names as they sounded, so it is common to find one person referred to by several different spellings of his surname, even the most literate people varied the spelling of their own names. Variations of the name Oldgate include Holgate, Holdgate, Howgate, Hogate and others.\n\nLoading...\n\nEarly Notables of the Oldgate family (pre 1700) Notables of the family at this time include Robert Holgate or Holdegate (c. 1481-1555), English Bishop of Llandaff and then Archbishop of York (1545-1554.) He recognized Henry VIII as head of the Church of England. \"He was the youngest son of Thomas Holgate and Elizabeth, daughter of Robert Champernowne, came of a Yorkshire family entitled to armorial bearings, and was born probably at Hemsworth, near Pontefract, in or about 1481, being, according to his own statement, sixty-eight years old in 1549. He was a canon of the order of St. Gilbert of Sempringham, and was probably educated in the house belonging...\n\nAnother 106 words (8 lines of text) are included under the topic Early Oldgate Notables in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nMigration of the Oldgate family Searching for a better life, many English families migrated to British colonies. Unfortunately, the majority of them traveled under extremely harsh conditions: overcrowding on the ships caused the majority of the immigrants to arrive diseased, famished, and destitute from the long journey across the ocean. For those families that arrived safely, modest prosperity was attainable, and many went on to make invaluable contributions to the development of the cultures of the new colonies. Research into the origins of individual families in North America revealed records of the immigration of a number of people bearing the name Oldgate or a variant listed above: James Holgate settled in Philadelphia in 1685; William Holgate settled in New England in 1748; Mathew Holdgate settled with his daughter Mary in Philadelphia in 1685."}, {"url": "https://www.houseofnames.com/howgate-family-crest", "page_content": "Howgate History, Family Crest & Coats of Arms Origins Available:\n\nOrigins Available: England\n\nHowgate is a name whose history is connected to the ancient Anglo-Saxon tribes of Britain. The name is derived from when the Howgate family once lived in Holdgate, a parish, in the union of Ludlow, hundred of Munslow, in Shropshire. [1]\n\nAlternatively, the name could have originated in Holgate, a township, in the parish of St. MaryBishopshill-Junior, union of York, E. division of the Ainsty wapentake, in the West Riding of Yorkshire. [1] [2]\n\nLoading...\n\nEarly Origins of the Howgate family\n\nLoading...\n\nEarly History of the Howgate family This web page shows only a small excerpt of our Howgate research. Another 59 words (4 lines of text) covering the years 1525, 1481, 1555, 1545, 1554, 1481, 1549, 1524 and 1537 are included under the topic Early Howgate History in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nHowgate Spelling Variations Sound was what guided spelling in the essentially pre-literate Middle Ages, so one person's name was often recorded under several variations during a single lifetime. Also, before the advent of the printing press and the first dictionaries, the English language was not standardized. Therefore, spelling variations were common, even among the names of the most literate people. Known variations of the Howgate family name include Holgate, Holdgate, Howgate, Hogate and others.\n\nLoading...\n\nEarly Notables of the Howgate family (pre 1700) Notables of the family at this time include Robert Holgate or Holdegate (c. 1481-1555), English Bishop of Llandaff and then Archbishop of York (1545-1554.) He recognized Henry VIII as head of the Church of England. \"He was the youngest son of Thomas Holgate and Elizabeth, daughter of Robert Champernowne, came of a Yorkshire family entitled to armorial bearings, and was born probably at Hemsworth, near Pontefract, in or about 1481, being, according to his own statement, sixty-eight years old in 1549. He was a canon of the order of St. Gilbert of Sempringham, and was probably educated in the house belonging...\n\nAnother 106 words (8 lines of text) are included under the topic Early Howgate Notables in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nHowgate migration to the United States + For political, religious, and economic reasons, thousands of English families boarded ships for Ireland, Canada, the America colonies, and many of smaller tropical colonies in the hope of finding better lives abroad. Although the passage on the cramped, dank ships caused many to arrive in the New World diseased and starving, those families that survived the trip often went on to make valuable contributions to those new societies to which they arrived. Early immigrants bearing the Howgate surname or a spelling variation of the name include:\n\n\n\nHowgate Settlers in United States in the 17th Century Jo Howgate, aged 17, who arrived in Virginia in 1635 aboard the ship \"Globe\" [8]\n\nTho Howgate, who landed in Virginia in 1641 [8]\n\nWilliam Howgate, who arrived in Maryland in 1653-1658 [8]\n\nSarah Howgate, who arrived in Maryland in 1660 [8] Howgate Settlers in United States in the 19th Century George Howgate, aged 30, who arrived in Ellis Island, New York aboard the ship \"Oxford\" in 1843 [9]\n\nMichl Howgate, aged 24, who arrived in Ellis Island, New York aboard the ship \"Isaac Wright\" in 1848 [9]\n\nBetty Howgate, aged 3, who arrived in Ellis Island, New York aboard the ship \"Gasetteer\" in 1854 [9]\n\nAnn Howgate, aged 30, who arrived in Ellis Island, New York aboard the ship \"Gasetteer\" in 1854 [9]\n\nEliza Howgate, aged 29, who arrived in Ellis Island, New York aboard the ship \"Gasetteer\" in 1854 [9]\n\n... (More are available in all our PDF Extended History products and printed products wherever possible.)\n\nHowgate migration to Australia +\n\n\n\nHowgate Settlers in Australia in the 20th Century Mr. E. C. Howgate, who arrived in Australia aboard the ship \"Esperance Bay\" in 1923 [10] Emigration to Australia followed the First Fleets of convicts, tradespeople and early settlers. Early immigrants include:"}, {"url": "https://www.houseofnames.com/hoggate-family-crest", "page_content": "Hoggate History, Family Crest & Coats of Arms Origins Available:\n\nOrigins Available: England\n\nThe ancestors of the name Hoggate date back to the Anglo-Saxon tribes of Britain. The name is derived from when the Hoggate family lived in Holdgate, a parish, in the union of Ludlow, hundred of Munslow, in Shropshire. [1]\n\nAlternatively, the name could have originated in Holgate, a township, in the parish of St. MaryBishopshill-Junior, union of York, E. division of the Ainsty wapentake, in the West Riding of Yorkshire. [1] [2]\n\nLoading...\n\nEarly Origins of the Hoggate family\n\nLoading...\n\nEarly History of the Hoggate family This web page shows only a small excerpt of our Hoggate research. Another 59 words (4 lines of text) covering the years 1525, 1481, 1555, 1545, 1554, 1481, 1549, 1524 and 1537 are included under the topic Early Hoggate History in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nHoggate Spelling Variations It is only in the last few hundred years that the English language has been standardized. For that reason, early Anglo-Saxon surnames like Hoggate are characterized by many spelling variations. As the English language changed and incorporated elements of other European languages, even literate people changed the spelling of their names. The variations of the name Hoggate include: Holgate, Holdgate, Howgate, Hogate and others.\n\nLoading...\n\nEarly Notables of the Hoggate family (pre 1700) Notables of the family at this time include Robert Holgate or Holdegate (c. 1481-1555), English Bishop of Llandaff and then Archbishop of York (1545-1554.) He recognized Henry VIII as head of the Church of England. \"He was the youngest son of Thomas Holgate and Elizabeth, daughter of Robert Champernowne, came of a Yorkshire family entitled to armorial bearings, and was born probably at Hemsworth, near Pontefract, in or about 1481, being, according to his own statement, sixty-eight years old in 1549. He was a canon of the order of St. Gilbert of Sempringham, and was probably educated in the house belonging...\n\nAnother 106 words (8 lines of text) are included under the topic Early Hoggate Notables in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nMigration of the Hoggate family Many English families tired of political and religious strife left Britain for the new colonies in North America. Although the trip itself offered no relief - conditions on the ships were extremely cramped, and many travelers arrived diseased, starving, and destitute - these immigrants believed the opportunities that awaited them were worth the risks. Once in the colonies, many of the families did indeed prosper and, in turn, made significant contributions to the culture and economies of the growing colonies. An inquiry into the early roots of North American families has revealed a number of immigrants bearing the name Hoggate or a variant listed above: James Holgate settled in Philadelphia in 1685; William Holgate settled in New England in 1748; Mathew Holdgate settled with his daughter Mary in Philadelphia in 1685."}, {"url": "https://www.houseofnames.com/holdgate-family-crest", "page_content": "Holdgate History, Family Crest & Coats of Arms Origins Available:\n\nOrigins Available: England\n\nThe name Holdgate has a long Anglo-Saxon heritage. The name comes from when a family lived in Holdgate, a parish, in the union of Ludlow, hundred of Munslow, in Shropshire. [1]\n\nAlternatively, the name could have originated in Holgate, a township, in the parish of St. MaryBishopshill-Junior, union of York, E. division of the Ainsty wapentake, in the West Riding of Yorkshire. [1] [2]\n\nLoading...\n\nEarly Origins of the Holdgate family\n\nLoading...\n\nEarly History of the Holdgate family This web page shows only a small excerpt of our Holdgate research. Another 59 words (4 lines of text) covering the years 1525, 1481, 1555, 1545, 1554, 1481, 1549, 1524 and 1537 are included under the topic Early Holdgate History in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nHoldgate Spelling Variations Spelling variations in names were a common occurrence before English spelling was standardized a few hundred years ago. In the Middle Ages, even the literate spelled their names differently as the English language incorporated elements of French, Latin, and other European languages. Many variations of the name Holdgate have been found, including Holgate, Holdgate, Howgate, Hogate and others.\n\nLoading...\n\nEarly Notables of the Holdgate family (pre 1700) Notables of the family at this time include Robert Holgate or Holdegate (c. 1481-1555), English Bishop of Llandaff and then Archbishop of York (1545-1554.) He recognized Henry VIII as head of the Church of England. \"He was the youngest son of Thomas Holgate and Elizabeth, daughter of Robert Champernowne, came of a Yorkshire family entitled to armorial bearings, and was born probably at Hemsworth, near Pontefract, in or about 1481, being, according to his own statement, sixty-eight years old in 1549. He was a canon of the order of St. Gilbert of Sempringham, and was probably educated in the house belonging...\n\nAnother 106 words (8 lines of text) are included under the topic Early Holdgate Notables in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nHoldgate migration to the United States + Families began migrating abroad in enormous numbers because of the political and religious discontent in England. Often faced with persecution and starvation in England, the possibilities of the New World attracted many English people. Although the ocean trips took many lives, those who did get to North America were instrumental in building the necessary groundwork for what would become for new powerful nations. Some of the first immigrants to cross the Atlantic and come to North America bore the name Holdgate, or a variant listed above:\n\n\n\nHoldgate Settlers in United States in the 17th Century Mathew Holdgate settled with his daughter Mary in Philadelphia in 1685\n\nMatthew Holdgate, who arrived in Philadelphia, Pennsylvania in 1685 [8] Holdgate Settlers in United States in the 19th Century James Holdgate, who settled in New York in 1823\n\nHoldgate migration to Australia +\n\n\n\nHoldgate Settlers in Australia in the 19th Century Mr. Richard Holdgate, English brassfounder who was convicted in Middlesex, England for 7 years, transported aboard the \"Countess of Harcourt\" on 8th April 1821, arriving in Tasmania (Van Diemen's Land) [9] Emigration to Australia followed the First Fleets of convicts, tradespeople and early settlers. Early immigrants include:\n\nHoldgate migration to New Zealand +\n\n\n\nHoldgate Settlers in New Zealand in the 19th Century Mr. Edward Holdgate, British labourer travelling from London aboard the ship \"Victory \" arriving in Lyttelton, Christchurch, South Island, New Zealand on 17th October 1863 [10] Emigration to New Zealand followed in the footsteps of the European explorers, such as Captain Cook (1769-70): first came sealers, whalers, missionaries, and traders. By 1838, the British New Zealand Company had begun buying land from the Maori tribes, and selling it to settlers, and, after the Treaty of Waitangi in 1840, many British families set out on the arduous six month journey from Britain to Aotearoa to start a new life. Early immigrants include:\n\nContemporary Notables of the name Holdgate (post 1700) + Sir Martin Wyatt Holdgate CB (b. 1931), English biologist and environmental scientist\n\nMartin W. Holdgate, British senior scientist of the survey of the South Sandwich Islands from HMS Protector in 1964, eponym of Mount Holdgate, Antarctica"}, {"url": "https://www.heraldry-wiki.com/heraldrywiki/index.php?title=Robert_Holgate", "page_content": "\n\nROBERT HOLGATE\n\nBorn : 1481\n\nDeceased : 1555\n\nBishop of Llandaff, 1537-1545\n\nArchbishop of York, 1545-1554\n\n\n\nBishop of Llandaff\n\nArchbishop of York\n\nOfficial blazon\n\nOr, a bend between two bulls’ heads couped Sable; on a chief Argent two bars Gules surmounted of a crutch staff, in bend, Azure.\n\nOrigin/meaning\n\nUnfortunately we have no information on the meaning or origin of these arms yet.\n\nIf you have any information on the origin or meaning of these arms, or have additional images that you want to share, please mail us your information !\n\n\n\nLiterature :\n\nThis page is part of the Ecclesiastical heraldry portal\n\n\n\n"}], "Robert Holgate died in 1555.": [{"url": "https://www.british-history.ac.uk/inquis-post-mortem/abstract/no1/pp135-144", "page_content": "Thomas Berthelett, citizen and Stationer.\n\nInquisition taken at the Guildhall, 24 October, 2 and 3 Philip and Mary [1555], before John Lyon, knight, Mayor and escheator, after the death of Thomas Berthelett, citizen and stationer of London, by the oath of Thomas Popelwell, Robert Johnson, Thomas Barnes, Hugh Davys, Thomas Preston, George S . . . . Thomas Hylton, Thomas Mychell, Thomas Mansey, Reginald Riversby, Richard Romesey, Michael Crosewayte, Thomas Woodhowse, William Baker and Simon Moore, who say that\n\nThomas Berthelett was seised of the manor of Hilhampton alias Ilhampton, lying in the parish of Lyvers Oculle(?), co. Hereford; 5 messuages in Fletestrete within the parish of St. Bride, in the several tenures of Anthony Philpott, Edward Halstide, John Deanes, Richard Pachett, and Richard Ebden; 2 messuages situate in Frydaystreate in the parish of St. Margaret Moyses, in the several tenures of John Howlande and William Dave; 2 other messuages in Fletestreate, in the several tenures of Anthony Androwes and Simon Lowe; 1 garden in the parish of St. Andrew, Holborn, in the tenure of Grace Hone; 1 tenement and garden in the said parish of St. Andrew in the tenure of John Ayer, gent.; 15 messuages and 1 garden in the said parish of St. Andrew, in the tenures of Robert Heper, John Johnson, John Byrde, William Borowe, Richard Barbor, John Rolleg, John Caryce, Thomas Evans, William Gebotte, John Burnett, Edmund Parton, Peter Le Graunde, John Starkey, Thomas Walker, and Dorothy Preston; 1 tenement and garden in Crokehorne Alley in the said parish of St. Andrew, Holborn, late in the occupation of the said Thomas Berthelett; 9 tenements and 6 gardens in Feterlane in the said parish of St. Andrew, in the several tenures of Richard Cheteley, Robert Sheppard, John Chaloner, . . . Lord Conyers, Thomas Wilbrounde, Thomas Riddle, John Robynson, William Hynde, Henry Garlyke, and Lewis Canveys; 8 tenements lying next Holborne Cross and in Snowhill in the parish of St. Sepulchre, in the several tenures of John Ryvell, John Rouver, Henry Palmer, Richard Henham, John Callowe, Simon Southwell, John Scarsdall, and Thomas Powell; 3 messuages in Breadestreate in the parish of St. Mildred in the City of London, in the several tenures of Robert Horner, Thomas Hall and William Hamersley; 2 messuages and 1 garden in Bishopsgate streate in the parish of St. Helen in the tenures of Thomas Luntley and Jasper Fisher; and 3 messuages in Distaff Lane, in the parish of St. Margaret Moyses, in the several tenures of John Fisher, John Sympson and John Grene.\n\nThe said Thomas Berthelett and Margery his wife, were seised of 2 messuages in Snowhill in the said parish of St. Sepulchre, now in the tenure of John Vaghan and Thomas Worme: which said messuages the said Thomas and Margery purchased to them and their heirs for ever of John Seymcr, esq., as by deed dated 21 March, 4 Edward VI [1550], appears.\n\nSo seised, the said Thomas Berthelett made his will the 23 September last past as follows: [Here given in English.]\n\nMy body to be buried in the parish Church of St. Bride in Fleetstreet, in the Lady Chapel there.\n\nI give to Edward Berthelett my son and heir apparent and to his heirs for ever my manor of Hilhampton, my pastures in Mardon, co. Hereford, all my messuages in the said Parish of St. Bride, my messuages in Bishopsgate Street, and all my messuages in the parish of St. Margaret in Friday Street; which said premises amount to the full third part of all my lands.\n\nTo Anthony Berthelett my younger son and to his heirs for ever I give all my messuages in Distaff lane, my messuages in Bredestreate, my messuages and gardens in the parish of St. Sepulchre, and my garden and messuages in the parish of St. Andrew in Holborn. If the said Anthony die without issue then the said premises to remain to my said son Edward and his heirs; for default, to my nephew Thomas Powell and his heirs; and for default, to my right heirs for ever.\n\nTo Margery my wife for the term of her life all my messuages in the said parish of St. Andrew, Holborn, in the several tenures of William Borowe, Richard Barbor, John Rolles, etc., etc., my house, rooms and garden, with all the ways, walks and commodities which I kept for my own use within Crokehorne Alley in the said parish of St. Andrew, and my messuage in the parish of St. Sepulchre: after her decease I give all the said premises to my said sons Edward and Anthony and to their heirs: if they both die without issue, then I give the same to my said wife and her heirs for ever.\n\nThe manor of Hilhampton is held of the King and Queen in free socage, as of their manor of East Greenwich, co. Kent, by fealty only and not in chief, and is worth per ann., clear, £5 13s. 4d. The messuages in Fleetstreet in the tenures of Anthony Philpott, Edward Halstide, John Deanes, Richard Pachett and Richard Ebden, are held of the said King and Queen in chief by the service of the 40th part of a knight's fee, and are worth per ann., clear, £12 17s. 4d. The 2 messuages in Friday Street are held of the King and Queen in chief, by the service of the 30th part of a knight's fee, and are worth per ann., clear, £10. The other 2 messuages in Flete street, the garden in Holborn, the tenement and garden in the parish of St. Andrew, Holborn, in the tenure of John Ayer, the 15 messuages in the said parish of St. Andrew, the messuage and garden in Crokehorne Alley, the 9 messuages and 6 gardens in Fetter Lane, and the 9 messuages and gardens next Holborn Cross in Snowhill, are held of the King and Queen in free socage by fealty only and not in chief, and are worth per ann., clear, £72 0s. 8d. The 8 messuages situate next Holborn Cross, 3 messuages in Bredestreate, 2 messuages and garden in Bishopsgate street, and the 3 messuages in Dystaff Lane are held of the King and Queen by fealty only in free burgage and not in chief, and are worth per ann., clear, £24 12s. 6d.\n\nThomas Berthelett died 26 September last past; Edward Berthelett is his son and next heir, and was aged 3 years on 24 July last past.\n\nInq. p.m., 2 and 3 Philip and Mary, p. 2, No. 8.\n\nThomas Clayton, baker.\n\nInquisition taken at the Guildhall, 6 August, 2 and 3 Philip and Mary, before John Lyen, knight, Mayor and escheator, after the death of John Clayton, of London, baker, by the oath of Robert Alleyn, William Phillippes, Morgan Ricarde, George Forman, John Smith, Robert Freer, Thomas Barnam, Edward Slayter, Richard Beard, Barnard Kingesfe, Edward Layne, Blaze (Blasu) Whyte and Robert Moses (?), who say that\n\nThomas Cleyton was seised of 1 messuage called the \"Sonne,\" and 1 shop and 1 large cellar, parcel of the same, and 1 messuage in the tenure of John Medcalf, parcel of the said messuage called the \"Sonne,\" lying in the parish of St. Mary at hill next Billingsgate, to wit, between the lands and tenements called the Baskill, now or late in the tenure of the Fraternity of the Grocers on the east part, the lane called St. Mari Layne on the west, the bakehouse of the said Thomas Cleyton wherein he then dwelt, and sometime of the Abbot of the Monastery of Waltham on the north part, and the lands and tenements lately belonging to the College of Pumfret, now or late in the tenure of John Hayword, goldsmith, on the south.\n\nSo seised, the said Thomas Cleyton, by deed dated 25 July, 4 Edward VI [1550], enfeoffed Benedict Jacson and Richard Ayens, citizens and butchers of London, of the said premises: to hold to them and their heirs for ever to the use of the said Thomas Cleyton and Helen Sponer wife of the said Thomas, by the name of Helen Sponer, of London, widow, late the wife of John Sponer, citizen and butcher of London, for their lives; and after their decease, then to the use of Cecilia Tyens, widow, daughter of the said Helen and William Burnynchill, deceased, and the heirs of the said Cecilia for ever.\n\nAfterwards the said Thomas married the said Helen, who survived him, and is still living in the said parish of St. Mary at Hill.\n\nThe said Cecilia still survives in the said parish.\n\nThe said Thomas Clayton was likewise seised of a bakehouse wherein he then dwelt with a yard, cellars, etc., thereto belonging, situate in St. Mary Hill Lane in the said parish; 2 messuages in the said parish in the tenures of Thomas Papworthe, citizen and draper of London, and Robert Saye, citizen and clerk of London; 1 messuage there in the tenure of Robert Hayes, citizen and barbersurgeon of London; 1 messuage there in the occupation of Thomas Fisher, citizen and barber-surgeon of London; and of 1 tenement there in the tenure of John Leonarde, citizen and barber-surgeon.\n\nSo seised, the said Thomas Clayton made his will in the said parish 30 March, 1 and 2 Philip and Mary [1555], as follows: [Here given in English.]\n\nI give my messuage or bakehouse with the shops on the south side thereof, which I granted to Ellen my now wife on our marriage, and which I purchased of Thomas Alleyn, gent., to Thomas Stanere, citizen and baker of London, now Master of the Guild of Our Lady and St. Clement of the Craft of Whitebakers in the City of London, and to Richard Hodge, John Martin, John Beest and George Hoorde, wardens of the said Guild; and also my 2 messuages in the tenure of Thomas Papworth and Robert Say: to hold for ever on the following conditions: that is to say, that on my anniversary they shall solemnly by note in the parish church of St. Mary Hill say placebo and dirge on the eve, and mass of requiem on the morrow by the parson there, and also that they shall distribute the sum of 39s. 6d. in money at the said obit, to wit, to the Master of the said Craft 12d., to each of the 4 Wardens then being present in their liveries 6d., to the Clerk 12d., to the beadle 4d., to the parson 8d., to 6 priests 6d. each, to 6 clerks 6d. each, to the sexton 6d. for \"pealles ringinge,\" for wax to burn at the said dirge and mass 12d., among the poor inhabitants in halfpenny whitebread 6s. 8d., in ale 3s. 4d., and in cheese 3s. 4d. I will that there be spent at the said dirge in spice bread and drink \"for potac[i]on\" of the said Master and Wardens and others of the Livery in Bakers Hall 10s., and to the 2 Churchwardens being present at the said mass 12d. each. If it should happen that by the laws of the land such obit should not be allowed by reason that of late years in the time of King Edward VI prayers for the dead and all ceremonies touching the same were disallowed, then I give the said money, except the said 13s. 4d. to be spent in bread, ale and cheese, and the 10s. for the potation of the said Master and Wardens, to the Governors and rulers of the House of the poor children within Newgate.\n\nTo Mr. Allen Pearci, Clerk, now parson of the said church of St. Mary Hill, and to Thomas Socham, merchant tailor, and Henry Smythe, draper, citizens of London, Churchwardens of the said church, my tenement in the said parish now in the tenure of Robert Hayes: to hold to them and their successors for ever for the repairing of the said church and for divine service to be held there.\n\nTo my cousin Thomas Clayton, citizen and grocer of London, and to his heirs for ever I give my tenement now in the tenure of Thomas Fishe.\n\nTo Ellen my wife I give my tenement wherein John Leonarde now dwells, for her life; after her decease the same to remain to William Brayfyeld, citizen and baker of London, and his heirs male; for default, to my cousin William Clayton, now servant to Sir Richard Southewell, knight, and to his heirs for ever.\n\nWitnessed by Robert Yonge and William Paten, fishmongers, Stephen Skydmor, vintner, and Thomas Eyns and William Charnock, scrivener.\n\nThe messuage in the parish of St. Mary at Hill wherein John Leonarde dwelt is held of the King and Queen in free burgage, and is worth per ann., clear, £3 6s. 8d. The messuage called the \"Sonne,\" the shops, large cellar and messuage in the tenure of John Medcalfe are held of the King and Queen by fealty only, and are worth per ann., clear, £5. The tenement wherein the said Thomas Clayton lived is held of the King and Queen in chief by the service of the 20th part of a knight's fee, and by the yearly rent of 5s. 4d., and is worth per ann., clear, 53s. 4d. The 2 tenements in the tenure of Thomas Papworthe and Robert Saye are held of the King and Queen in free burgage, and are worth per ann., clear, £8. The tenement in the tenure of Robert Hayes is held of the King and Queen in free burgage, and is worth per ann., clear, 53s. 4d. The tenement in the occupation of Thomas Fysshe is held of the King and Queen in free burgage, and is worth per ann., clear, 66s. 8d.\n\nThomas Clayton died 30 March last past; Thomas Clayton is his kinsman and next heir, to wit, son and heir of Hugh Cleyton, brother of the said Thomas, and is now aged 40 years and more.\n\nInq. p.m., 2 and 3 Philip and Mary, p. 2, No. 9.\n\nJohn Branche.\n\nInquisition taken at the Guildhall, 20 March, 2 and 3 Philip and Mary [1556], before William Garrett, knight, Mayor and escheator, after the death of John Branche, by the oath of George Forman, George Brayfield, Thomas Warren, Nicholas Avenand, Thomas Mayott, William Dent, Walter Maykins, Alexander Beste, John Evans, Simon Ludforde, Thomas Cressey, Henry Clooker, William Eton, John Hayes, William Alday, John Harrys and Nicholas Smale, who say that\n\nBefore the death of Joan Branche one Christopher Campyon, citizen and mercer of London, was seised of 1 messuage and 2 shops lately demised to Ellen Wylkington, situate in the lane called grene lettyce in Candelwykestrete in the parish of St. Mary Abchurche, London, and late parcel of the lands and possessions of the late Priory or New Hospital of St. Mary without Bysshoppesgate, now dissolved.\n\nHe, being so seised, King Henry VIII by Letters Patent dated 25 January, in the 32nd year of his reign [1541], for the sum of 10s. paid into the Hanaper, gave licence to the said Christopher Campyon to grant the said premises, which are held of the King in chief, to the said John Branche and his heirs for ever.\n\nAfterwards, the said Christopher by deed dated 27 January, 32 Henry VIII [1541], in fulfilment of certain agreements lately made between himself of the one part, and the said John Branche by the name of John Branche, senior, citizen and clothier (pannarium) of London, of the other part, and contained in certain indentures dated 17 November, 32 Henry VIII, granted the said premises to the said John Branche and his heirs for ever.\n\nThe said premises are held of the King and Queen in chief, by the service of the 20th part of a knight's fee, and are worth per ann., clear, 30s.\n\nJohn Branche died 5 May, 1 and 2 Philip and Mary [1555]; John Branche is his son and next heir, and was then aged 39 years and more.\n\nInq. p.m., 2 and 3 Philip and Mary, p. 2, No. 14.\n\nMaster Robert Holgate alias Halgate, clerk.\n\nArchbishop of Canterbury.\n\nInquisition taken 11 May, 2 and 3 Philip and Mary [1556], before William Garret, knight, Mayor and escheator, after the death of Master Robert Holgate alias Halgate, clerk, late Archbishop of Canterbury, by the oath of Robert Bellingham, William Jurden, Robert Dove, Robert Collins, William Myldenall, John Isham, Richard Langham, Thomas Reade, George Wymarke, Thomas Chapman, John Abbot, Edward Pressen, John Benlowes, Ralph Presson and James Moore, who say that\n\nRobert Holgate was seised of 1 capital messuage called \"Mayster of Sempringham Headhouse\" and 1 garden situate in a lane called Cowlane in the parish of St. Sepulchre, London, late of the Monastery of Sempringham, co. Lincoln, now dissolved, and sometime belonging to the Master of the Order of St. Gilbert of Sempringham; also of 6 messuages and 6 gardens lying together in Cowlane aforesaid next to the said capital messuage on the east towards Smythfield; and 2 messuages and 2 gardens lying together in Cowelane next to the Master of Sempryngham's headhouse on the south towards Holborn Cross, to the said late Monastery belonging.\n\nAll the said premises are held of the King and Queen by fealty only in free burgage, and not in chief, and are worth per ann., clear, £12.\n\nRobert Holgate died 15 November last past at the said capital messuage in Cowelane; Thomas Holgate is his kinsman and next heir, to wit, son and heir of Henry Holgate, late of Clayton, senior, deceased, brother of the said Robert Holgate, and was then aged 40 years and more.\n\nInq. p.m., 2 and 3 Philip and Mary, p. 2, No. 30.\n\nAlice Cornwaleis, widow.\n\nInquisition taken at the Guildhall, 16 May, 2 and 3 Philip and Mary [1556], before William Garret, knight, Mayor and escheator, after the death of Alice Cornwaleis, widow, by the oath of George Forman, George Brayfeld, Thomas Warren, Nicholas Avenon, Thomas Mayot, William Dent, Walter Meakyns, Alexander Beoost, John Evans, Thomas Crcssey, Henry Cloker, William Eton, John Harys, William Aldaye, John Harrys and Nicholas Small, who say that\n\nAlice Cornwaleis was seised of 1 large messuage called \"The Principall Place,\" and 1 large garden thereto adjoining, situate in the parish of St. Caterine Christchurch in London; and of 16 tenements or houses and 3 stables situate in Byllyter Lane within the said parish: which said premises are held of the King and Queen by knight's service, to wit, by the 20th part of a knight's fee, and are worth per ann., clear, £12 3s. 4d.\n\nAlice Cornwaleis died 8 January last past; Thomas Cornwaleis, esq., is her son and next heir, and is now aged 24 years and more.\n\nInq. p.m., 2 and 3 Philip and Mary, p. 2, No. 31.\n\nRichard Morgan, knight.\n\nInquisition taken at the Guildhall, 17 December, 2 and 3 Philip and Mary [1555], before William Gerret, Mayor and escheator, after the death of Richard Morgan, knight, by the oath of Thomas Jennyns, Christopher Bussher, Robert Lyvers, William Aldaye, John Redman, Robert Hardyng, John Harrys, Thomas Thome, John Thome, William Robynson, Thomas Maye, Robert Braunche, Thomas Dycheffeld, Alexander Bankes and Robert Woode, who say that\n\nRichard Morgan was of sound mind and memory from his birth up to 8 May, 1 Mary [1554], upon which day he became demented in the parish of St. Magnus the Martyr in Bridge ward in London, and has remained in that condition ever since, so that he is incapable of managing himself or his lands, etc., as he does not enjoy lucid intervals. When the said Richard became a lunatic he did not hold any lands or tenements in the City of London.\n\nThomas Morgan is the son and heir apparent of the said Richard Morgan, and was aged 15 years and no more on the feast of the Nativity of St. John the Baptist next before the taking of this inquisition.\n\nInq. p.m., 2 and 3 Philip and Mary, p. 2, No. 32."}, {"url": "http://www.historyofyork.org.uk/themes/tudor-stuart/robert-holgate-archbishop", "page_content": "1545AD - 1554AD\n\nRobert Holgate from a Yorkshire family, was educated in Cambridge and entered the Gilbertine order as a canon. He played an important role in the life of the community before the Dissolution of the Monasteries.\n\nConsidered to be a protégé of Thomas Cromwell, Holgate was appointed president of the Council in the North in 1538, a post he held for 11 years. He lived in the house of the former abbot of St Mary’s Abbey in York, which has survived as King’s Manor.\n\nFollowing the death of Archbishop Lee in September 1544, Holgate was named his successor and was consecrated as Archbishop of York at Lambeth in January 1545, renouncing papal authority.\n\nFrom then, the tenets of Protestant theology were regularly expounded in the Minster for the first time, and organ music was abolished. He instructed that the Minster Library be furnished with new Protestant commentaries on the Bible by theologians like Calvin.\n\nArchbishop Holgate founded three grammar schools in 1546, one at his birthplace of Hemsworth in the West Riding, one at Old Malton and one in York. He required his headmasters to be skilled in Hebrew, Greek and Latin and to take his pupils to the Minster on Sundays.\n\nIn order to prove his Protestantism to the sceptical Duke of Northumberland, in 1550, aged 68, the Archbishop took a bride when he was 68 – local gentlewoman Barbara Wentworth. This was a year after an Act of Parliament removed the duty of celibacy from the English clergy.\n\nBut when Queen Mary came to the throne in 1553 and returned England to Catholicism, Holgate was sent to the Tower then stripped of his post for breaking his vow of celibacy.\n\nHaving paid the crown £1,000 for his ‘crimes’ Holgate was set free in January 1555 only to die that November in London."}, {"url": "https://www.englandcast.com/2022/11/robert-holgate/", "page_content": "Today in 1555 Robert Holgate died. He was the Archbishop of York, and in his life he brought to the fore one of the major issues between Protestants and Catholics, which was the idea of a clergy that could get married. He was the first Protestant Archbishop of York, and he was also the first to get married.\n\nHe was President of the Council in the North, but proved unable to put down the Seamer rebellion in 1549, and was replaced by Francis Talbot, Earl of Shrewsbury. He would see much of the wealth of the York minster be stripped as Edward VI moved the Protestant reformation further and destroyed any lingering signs of Catholicism.\n\nAfter Edward VI died, his sister, the Catholic Mary assumed the throne in 1553, and Robert Holgate, to quote from the York Minster Chronicle, “Quickly shed his wife and his Protestant faith to save his skin.” In 1554 he was deprived of his title.\n\nRobert Holgate died in London on the 15th of Nov 1555, and his body was buried in the Church of St. Sepulchre, Holborn, London.\n\nThat’s your Tudor Minute for today. Remember you can dive deeper into life in 16th-century England through the Renaissance English History Podcast at englandcast.com.\n\n\n\nSuggested link:\n\nOctober is Reformation Month!\n\n\n\nFrom my shop:\n\nEarly Christmas shopping gifts\n\nChristmas Tree Skirt Collection\n\nPs. All products are made on-demand and can take a few weeks to ship."}, {"url": "http://www.tudorplace.com.ar/Bios/RobertHolgate.htm", "page_content": "Robert H OLGATE (Archbishop of York)\n\nDied: 15 Nov 1555\n\nBuried: Church of St. Sepulchre, Holborn, London\n\nEmerges from obscurity in 1537 as Bishop of Llandaff and Master of Semperingham, home of the Gilbertine Order, and of whom it was said, a great favourite at court. He was also Lord President of the Council in the North.\n\nHe left this Bishopric to become Archbishop of York in 1545 becoming the first Protestant Archbishop of York and also the first to be married. When Henry VIII died in 1547, Robert Holgate saw the Minster stripped of half its clergy and much of its treasure under Edward VI .\n\nHe acquired much wealth, land and property, stretching from Pickering and East Yorkshire to Hemsworth. Holgate was born in Hemsworth and did not forget his native village. He left an endownment the \"Holgate Trust\" which to this day controls the Hemsworth Holgate Alms House in Robin Lane, Hemsworth. The Alms House Trust was made for the upkeep of a number of men and women of the Protesant persuasion. Holgate also left money for school at Hemsworth, York and old Malton. In May 1548 the Archbishop, by deed poll, prescribed the rules and ordinances of the Hemsworth School.\n\nHe was President of the Council in the North, but proved unable to deal with the Seamer rebellion in Aug 1549, nad was replaced by Francis Talbot, Earl of Shrewsbury . He later claimedthat it was John Dudley, Earl of Warwick who '... touke such displeasure with me that... he put me firth of the rowme of the President...'.\n\nAs the Reformation progressed and Edward VI died, his sister, the Catholic Mary assumed the throne in 1553, and Robert Holgate, to quote from the York Minster Chronicle, quickly shed his wife and his Protestant faith to save his skin.\n\nIn 1554 he was deprived of his title, and in 1555 Robert Holgate, Archbishop of York, endowed a Hospital in Hemsworth by Will."}, {"url": "https://discovery.nationalarchives.gov.uk/details/c/F31981", "page_content": "This website uses cookies\n\nWe place some essential cookies on your device to make this website work.\n\n\n\nWe'd like to use additional cookies to remember your settings and understand how you use our services.\n\n\n\nThis information will help us make improvements to the website."}, {"url": "https://www.findagrave.com/memorial/112912649/robert-holgate", "page_content": "Archbishop of York\n\n\n\nRobert Holgate (1481/1482 – 1555) was Bishop of Llandaff and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as leader of the Church of England.\n\n\n\nHolgate, chaplain to Thomas Cromwell, 1st Earl of Essex, became master of the Gilbertine Order in 1536, and exerted his influence to prevent the surrender of the Gilbertine houses under the Act for the Suppression of the Smaller Monasteries in 1536 as only four out of twenty-six houses had revenues over £200 a year. In 1538, Holgate surrendered Sempringham Priory.\n\n\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This may however have been a second marriage to make it fully legal, and Holgate and Wentworth may have first married in late 1547 with Roger Tongue officiating. In 1551 Arthur Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne she imprisoned Holgate on various charges, with his being a married clergy being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\n\n\n\n\nArchbishop of York\n\n\n\nRobert Holgate (1481/1482 – 1555) was Bishop of Llandaff and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as leader of the Church of England.\n\n\n\nHolgate, chaplain to Thomas Cromwell, 1st Earl of Essex, became master of the Gilbertine Order in 1536, and exerted his influence to prevent the surrender of the Gilbertine houses under the Act for the Suppression of the Smaller Monasteries in 1536 as only four out of twenty-six houses had revenues over £200 a year. In 1538, Holgate surrendered Sempringham Priory.\n\n\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This may however have been a second marriage to make it fully legal, and Holgate and Wentworth may have first married in late 1547 with Roger Tongue officiating. In 1551 Arthur Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne she imprisoned Holgate on various charges, with his being a married clergy being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\n\n\n"}, {"url": "https://www.wikitree.com/wiki/Holgate-163", "page_content": "Is Robert your ancestor? Please Login to collaborate or comment the profile manager, ask our community of genealogists a question.\n\nDNA\n\nNo known carriers of Robert's ancestors' DNA have taken a DNA test\n\nHave you taken a DNA test? If so, login to add it. If not, see our friends at Ancestry DNA."}, {"url": "https://www.yorkpress.co.uk/news/17223886.meet-archbishop-robert-holgate-founder-archbishop-holgates-school/", "page_content": "Robert Holgate and the restored Archbishop Holgate’s Grammar School playing field gates\n\nLocation of plaque: on the restored gates in Bridge Lane, off Wigginton Road near York Hospital\n\nTHINGS are a little bit different now. But back in Tudor times it wasn't the done thing for a priest who had taken a vow of chastity to suddenly decide to get married.\n\nRobert Holgate wasn't just any priest: he was the Archbishop of York and President of the King's Council in the North. When he married in 1550, at the age of 68, it caused quite a scandal - particularly in conservative northern Church circles.\n\nHe got away with it during the reign of the young, and Protestant, King Edward VI, Henry VIII's son. But when Edward died at the age of 15 in 1553 and his Catholic sister Mary succeeded him, Robert quickly found himself in hot water.\n\nHe was imprisoned in the Tower of London for 'divers offences' - most notably getting married after having taken a vow of chastity.\n\nStripped of all his offices, he apologised to the Queen, and was eventually released in 1555 on payment of a huge fine. It did him little good - he died ten months later, clearly a broken man.\n\nRobert's career was typical of many statesmen in Tudor times. Like Cardinal Wolsey, he rose to dizzying heights, only to fall quickly from grace when he offended the ruling monarch.\n\nHis name survives in York, however, because of something he did while at the height of his power in York.\n\nHolgate had bought the Treasurer's House and other property in Minster Close.\n\nIn 1546, he founded three schools - one in York, one in Hemsworth, and one in Old Malton. The York school was in Ogleforth 'close by the cathedral' and, like other early grammar schools in England, was intended to train students for the church. The curriculum included Latin, Greek and Hebrew with some history, geography and maths but with the emphasis firmly on religious and moral education. Discipline is said to have been severe - as it was for poor Archbishop Robert himself once Queen Mary came to the throne.\n\nThe school survived the Archbishop's fall from grace, however. More than 200 years after his death, an advert in the York Courant in December 1799 stated that: \"The Free Grammar School situate within the Close of the Cathedral Church of York founded by Archbishop Holgate for the Instruction of Youth ... will open again after the Christmas recess on Monday, January 20, 1800.\"\n\nLike other grammar schools Archbishop Holgate's struggled for pupils in the early 1800s: it had just 10 in 1818, and 17 in 1824.\n\nThen, in 1845-6, the York Diocesan School Society built a new training college (St John's College) on Lord Mayor's Walk. A new school, the Yeoman School, was built next door. Opened in 1846 this was intended to cater for the 'middle class children' of agriculturalists, as well as to provide teaching practice for student teachers at St John's.\n\nThe new school ran into financial difficulties, however, and in 1858, after 300 years in Ogleforth, Archbishop Holgate's School took it over.\n\nThe iron gates to the school's playing fields seem to have been designed between 1850 and 1860 by George Townsend Andrews, the architect who had designed St John's College itself. They were made by the Walmgate-based Walker Iron Foundry, which also made railings and gates for the British Museum, as well as others across York, including in St Leonard's Place, York Cemetery, Dean's Park and at St Peter's School.\n\nArchbishop Holgate's School thrived in its new location in Lord Mayor's Walk. By 1915, when the Rev William Johnson retired as headmaster, the school had 294 pupils.\n\nBy then, the school had leased part of Bootham Stray for playing fields, which is why the school playing field gates - which were restored in 2017 by York Civic Trust working with York Hospital - are there to this day.\n\nThe school itself moved to its present site on Hull Road in 1963.\n\nStephen Lewis\n\nFor the stories behind more York Civic Trust plaques, visit yorkcivictrust.co.uk"}, {"url": "https://maltonians.maltonschool.org/people/holgate.php", "page_content": "Illustrated here is the church at Darrington, near Pontefract. Archbishop Holgate's heir was his nephew, Thomas Holgate, who acquired the manor of Stapleton in the parish of Darrington. Several Holgate tombstones are here.\n\nROBERT HOLGATE died on 15th November, 1555 at the Headhouse of the Master of Sempringham, a Gilbertine Order of which he had himself been Master. In his Will he asked that his body should \"be buried in the parish church within the parish whereof it shall please Almighty God to take me out of this transitory life\". The Headhouse stood in Cow Lane, Smithfield, and within the parish of St. Sepulchre. \" The bells of Old Bailey\" are the bells of this Church which stands at the junction of Giltspur Street and Holborn Viaduct.\n\nSir William Petre was one of the four executors of Holgate's will. He was born c.1505 at Torbryan, in Devon, and educated at Oxford of which university he became Doctor of Law in 1533. For a time he was tutor to a brother of Anne Boleyn. By 1544 Henry VIII had made Petre a knight, a privy councillor, and one of his two Principal secretaries. He served Henry, Edward, Mary and Elizabeth. The original painting is at Ingatestone Hall in Essex.\n\nAdvert for Malton Free Grammar School\n\nAn illustration of a bill advertising the Grammar School at Old Malton. The illustration is taken from a book by Dr J S Purvis, Director of the Borthwick Institute of Historical Research in 1960, entitled \"Historical Records\"\n\nThe illustration was on the front of the menu for the Holgate Society dinner at Brown's Hotel, 28th October 1960.\n\nA transcription:\n\nThis is to give NOTICE,That at Old Malton Free Grammar School, YOUTH are completely qualified for any manner of Bufinefs, in Latin, Greek &c. Alfo Arithmetic in all its Parts, Navigation, Menfuration, Merchants Accompts &c. and Writing in very Perfection, by JOSEPH KERR, Mafter. WILLIAM HALL, Affiftant.\n\nN. B. Old Malton is pleafantly fituated upon the River Derwent in the North-Riding of the County of York, in a fine plentiful Country: Board at Seven Pounds per Annum; Board and Learning, at Nine Guineas; Learning, Board, and Cloaths, found in a neat decent Manner, at the Expense of Twelve Pounds.\n\nThofe who are pleafed to encourage this SCHOOL, may depend upon fuch Exactnefs and Care, as will, in every Refpect, be confiftent with this publick Notice"}, {"url": "https://maltonians.maltonschool.org/documents/holgate/holgateSociety.html", "page_content": "The Early Days\n\nThe Fiftieth Anniversary Dinner (3 April 1998) seems an appropriate time to put on record my own memories of those early days, partly as a matter of historical interest but mainly as a tribute to that band of stalwart Old Boys who first created, and then carried forward the work of the Society.\n\nWhat follows is based partly on my own literature collection, made during the first two decades of the Society's existence together with information gleaned from archival material in York Minster library, but mostly on personal recollection so there will inevitably be errors (for which I beg indulgence); however I hope to be able to give some flavour of those exciting, early days.\n\nI take as the limits of the \"Early Days\" of the title the period starting with the Society's foundation in 1947 and ending in early 1957 i.e. just about a decade.\n\nThe Foundation of the Society\n\nMost current members will know that the foundations of the Society were laid at a dinner hosted by F H Woodward (school 1917 - 1923) at the Oxford and Cambridge Club on 3 February 1947. The venue was appropriate since the gathering followed up on a tradition whereby Old Boy Fellows of Oxford and: Cambridge colleges offered hospitality and help to members of the School during their undergraduate days ( Frank Woodward was himself a Mathematical Fellow of Selwyn College, Cambridge ).\n\nThe decision of that February meeting was \"to form a London Association of Old Boys of Archbishop Holgate's School affiliated to the Association in York\" with the principal aims of \"facilitating re-union gatherings and social intercourse for its members\"; also \"to help all boys, past and present, of the school\" and \" to take steps, wherever possible, to enhance the reputation of the ancient school and to foster its traditions\".\n\nColonel E A Loftus (school 1897 -1903) was elected Chairman; Frank Woodward was Honorary Treasurer and Harry Ward ( 1904 -1914) became Honorary Secretary.\n\nReunion Dinners.\n\nThe first reunion dinner was held at the Waldorf Hotel, Aldwych, WC2 on 14 May 1947. The cost was 16 shillings (80p); this was quite expensive when one considers that, during the war, the charge for any meal was limited to 5 shillings (25p). It was agreed to charge a membership fee, per annum, of one guinea (£ 1.05) for those aged 25 and over, with a reduced fee of half a guinea (52.5p) for those under 25. It has pointed out that Old Boys could become Life Members of the York Association at a cost of £4; this sum included receipt of \"The Mitre\" free of charge for the rest of one's life!\n\nFrom the earliest times, much emphasis was given to the third of the above objectives (\"taking steps, wherever possible, to enhance the reputation of the school ...\"). This applied particularly to gathering information relating to our Founder - a seemingly endless task, which I enjoy doing to this day.\n\nBy the Autumn of 1947, Sir Gerald Woolston, Norroy and Ulster King of Arms and formerly Garter Principal King of Arms, had prepared, at the request of the Society, a sketch of the Archbishop's armorial bearings. A replica in oak was prepared and presented by the President to the Society.\n\nThe other objectives were forwarded by arranging to complete a list of Old Boys willing to offer hospitality to boys \"newly coming to London\" and to forward the list to the Headmaster. The Society decided upon affiliation with the Society of Yorkshiremen in London, especially because so many Old Boys were the recipients of Scholarships founded by that Society.\n\nA pattern of two reunion dinners per year (spring and autumn) was agreed upon; most of these were held at Brown's Hotel, Dover Street (at least until 1963). Accompanying each dinner was a beautifully-produced menu card, the work of Frank Woodward (by now our Honorary Archivist). Collectively they comprise valuable historical material relating back to the early days of the school and to its Founder. The considerable effort involved was finally well-rewarded, since they formed a significant part of the material available to E N Jewels when he agreed to prepare a \"History of Archbishop Holgate's Grammar School, York\" published as a book in 1962 (and thus beyond the scope of my remit).\n\nThe pattern of two dinners per year was unexpectedly interrupted almost as soon as it began. We had planned our most important reunion so far, with significant progress to report, and with the Archbishop of York as our chief guest and speaker. The meeting was to be held at Brown's Hotel as usual, on 26 November 1948. At the last minute, the Archbishop's secretary discovered that the Archbishop Holgate Society held its meetings in London and not in York - so the Archbishop had to withdraw and the meeting was cancelled! Since that time I do not think that we have ever had the pleasure of receiving an Archbishop (as Chairman of Governors) at a London meeting ( I hope to hear that this was not the case). This was the only time a reunion was cancelled in the early years - and we made up for it by holding three meetings in 1949.\n\nThe reunion held on 12 January 1949 was the first occasion on which a committee meeting was held on the same evening and at the same place as the dinner itself; the arrangement proved popular and has continued more or less ever Since.\n\nThe Holgate Portrait\n\nThe only known portrait of our Founder belongs to the Holgate Hospital at Hemsworth (founded under the terms of Robert Holgate's will); it hangs in the Governor's Room at the hospital. The Society arranged for Eric Westbrook, Principal of the Wakefield School of Art, to make a copy and this was on show for the first time at the meeting on 12 January 1949. It was subsequently handed over, on \"permanent loan\", at a ceremony held at the School on 18 February 1949.\n\nThis dinner also witnessed the introduction of the first of a series of post-prandial discussions. The topic was \"CRIME\",introduced by Harry Ward who had himself lived in an English prison for two years and had studied the prison systems of several countries. The conclusion was \"that the present crime wave is likely to grow for a while and then die down again to the astonishing orderliness which characterised us before the war\"\n\nThe November 1949 reunion was an important one for the Society and the School. Our guest speaker was Rt. Hon. J Bowes Morrell, Lord Mayor of York. His speech mainly concerned proposals and arrangements for York's celebration of the forthcoming 1951 Festival of Britain. He also announced that consideration was being given to the establishment of a new (or second) University in York. Alderman Morrell played a leading part in the successful launch of the University at Heslington in mid-1963, a few weeks before our own new school was opened on adjacent land. The Alderman's name is commemorated by the University's main library; The J B Morrell Library. The Archbishop Holgate Society was active in a number of ways in assisting the start-up of both the University and the new school - but this is a story too long to detail here."}], "Robert Holgate was a prelate.": [{"url": "https://www.cambridge.org/core/journals/journal-of-ecclesiastical-history/article/abs/church-in-transition-the-intriguing-use-of-the-pallium-in-tudor-england/DC153D8B2281A370EF367112C92B6E92", "page_content": "Setting the context The break with Rome in the 1530s brought many challenges for the English Church as, following the extirpation of Roman jurisdiction under Henry viii, that body no longer owed obedience to Rome. Following the accession of Edward vi a Protestant Church emerged, to be cut short on the accession of his half-sister Mary. England's reconciliation with Rome was then itself swept away by Elizabeth's religious settlement after Mary's death in 1558. Throughout this quarter century, the question of authority and power in the Church was much debated. In a body cut off from Roman jurisdiction, where was the source of authority and what was the relationship between the papacy, monarchy and episcopacy? This article attempts to provide answers to those questions by looking at the intriguing use of the pallium as a symbol of the power of an archbishop as metropolitan of his province. The opening sections of this article draw a picture of the nature of royal supremacy and episcopal authority from the reign of Henry viii through to the death of Mary. This picture essentially sketches the main sources of episcopal authority and jurisdiction in the period 1533–58 and provides a backdrop for the central emphasis of the essay, an examination of the differing uses of the pallium – a woollen vestment symbolising the jurisdiction which a metropolitan archbishop enjoyed – from Henry's break with Rome to the death of Elizabeth in 1603. The meaning and significance of the garment changed from reign to reign and an attempt will be made to unravel the meanings behind its use and to draw conclusions on the resulting source and nature of episcopal jurisdiction in Tudor England.\n\nProclaiming the royal supremacy, 1533–47 It was the Act of Supremacy of November 1534 which formally stated that the king and his successors should be acknowledged as supreme head of the Church.Footnote 1 Such an overt assertion, however, called into question the prevailing consensus on the source of authority in that Church. When Thomas Cranmer undertook a metropolitical visitation of Canterbury province in 1533–5, the bishops of London, Winchester, Exeter, Norwich and Lincoln all protested against Cranmer's actions, as did the President and Fellows of Corpus Christi College, Oxford.Footnote 2 When Stephen Gardiner at Winchester received his citation, he stressed that Cranmer's use of the title ‘primate of all England’ was in derogation of the king's position as supreme head of the Church. The issue at stake, the source of authority in the English Church, was tackled by the Henrician government which delivered commissions to the bishops for the exercise of their jurisdiction. It was for the king, as supreme head of the Church, to instruct the episcopate with rules by which their episcopal functions were to be deployed. Thomas Cranmer's Henrician commission was issued out of the court of Thomas Cromwell, who acted as the king's vicegerent in ecclesiastical causes.Footnote 3 This commission covers administrative powers formerly exercised by medieval archbishops of Canterbury following provision by the pope. Cranmer was able to ordain men to livings, to institute men to benefices in the diocese of Canterbury, to collate clerics to livings in his gift, to prove the wills of men having goods, rights and credits (‘bona, iura sive credita’) in more than one diocese according to the custom of the Prerogative Court of Canterbury, to proceed in causes in his courts and to do all else necessary. However, Cranmer's powers were now made to rest explicitly on the king's position as supreme head of the Church. Significantly, Cranmer's commission did not authorise him to undertake visitations. The purpose of this omission was to allow the crown itself to undertake a visitation of the Church through the vicegerent. An inhibition was addressed to Cranmer, and through him to the diocesan bishops, in September 1535. By the terms of this, ecclesiastical officials were forbidden to exercise their powers of jurisdiction.Footnote 4 Further traces of royal activity are rather thin on the ground. However, two sets of injunctions were issued in 1536 and 1538, which helped to shape the future direction of the English Church and the duties of those who sat on the episcopal bench.Footnote 5 The visitation ended in 1537 and powers of visitation were returned to the bishops. Edward Fox at Hereford seems to have been the first prelate to receive such a licence.Footnote 6 Cranmer's licence has not survived, but it is clear from his letters that he did receive one.Footnote 7 The role of the king as supreme head of the Church continued in the reign of Edward vi, whose government adopted a position similar to that of the previous monarch. Cranmer's commission as archbishop of Canterbury lasted at Henry's pleasure only and, accordingly, it had lapsed on Henry's death in 1547. The Edwardian regime proceeded to issue fresh commissions and Cranmer received his from Edward on 7 February 1547.Footnote 8 Edward likewise undertook royal visitations and issued injunctions.Footnote 9 The new commission, at pleasure, to Thomas Cranmer empowered him to exercise his jurisdiction within the diocese and province of Canterbury. The preamble emphasised that the powers of all magistrates, both ecclesiastical and secular, emanated from the crown and from the king as supreme head. Such jurisdiction had been exercised precariously, and the king wished men to recognise that it was granted by the crown alone. In response to the archbishop's requests, the king licensed him to ordain men from the diocese of Canterbury who were suitable in learning and morals. He could admit, institute, invest or deprive those presented to benefices within the diocese, if they were suitable, and collate men to benefices in his own gift. He was to prove the wills of those who had goods in several dioceses or jurisdictions, and to administer the goods of all those who died intestate, according to the custom of the Prerogative Court of Canterbury, and to prove wills and administer goods within his diocese. He could judge all ecclesiastical causes which came before him; he could also appoint deputies. A general clause empowered him to do all else necessary ‘beyond and above those tasks which are acknowledged to be granted to you by God in Holy Scripture’ (‘preter et ultra ea que tibi ex sacris litteris divinitus commisa dinoscuntur’). Any previous inhibition of ecclesiastical jurisdiction was to be of no effect. The king enjoined the archbishop to perform his office according to the norms of Holy Scripture and to ensure that he admit no one to holy orders or to have cure of souls unless their character, learning and other qualifications were exemplary, for the corruption of all virtue, especially within the Christian religion, stemmed from wicked pastors. If faithful shepherds were appointed, the king did not doubt but that the true religion of Christ would be restored and an improvement in men's lives and manners ensue.\n\nThe accession of Mary I: all change, 1553–8 The accession of Mary to the throne in 1553 posed enormous challenges for the Tudor episcopate and for the question of authority in the Church. The consensus of Henry's years, following the break with Rome, and of Edward vi’s reign could no longer apply when Mary wished to return the Church to Roman obedience. How would this transition be made and where then would the locus of authority in the Church be found? When Mary issued writs for her first convocation on 14 August 1553, Cranmer's register at Lambeth shows that these documents used a royal style entirely in keeping with that of her half-brother, Edward vi, and her father Henry viii. The writ styled the monarch as ‘Mary, by the grace of God queen of England, France and Ireland, defender of the faith and supreme head of the English and Irish Church’ (‘MARIA DEI GRACIA ANGLIE, FRANCIE ET HIBERNIE regina FIDEI DEFENSOR et in terra ecclesie Anglicane et Hibernice supremum caput’).Footnote 10 Mary's use of the title ‘supreme head’, however, was not to last, for she was determined to restore papal supremacy and to repeal the religious acts passed by her father. The reference to ‘supreme head’ was included in the style and title prefixed to the parliamentary record for 1 Mary session 2 (24 Oct.– 6 Dec 1553). Later it was omitted on Mary's decision, without parliamentary approval, in the style and title prefixed to the record for 1 Mary session 3 (2 Apr.–5 May 1554), and presumably remained omitted in all documents up to her marriage – and proclamation of her joint style and title with Philip of Spain – on 25 July 1554. In July 1554 the joint style of Philip and Mary was announced as ‘Philip and Mary, by the grace of God king and queen of England, France, Naples, Jerusalem, and Ireland; defenders of the faith; princes of Spain and Sicily; archdukes of Austria; dukes of Milan, Burgundy, and Brabant; counts of Hapsburg, Flanders, and Tyrol’ (‘Philippus et Maria, Dei gratia rex et regina Anglie, Francie, Neapolis, Ierusalem, et Hibernie; fidei defensores; principes Hispanie et Sicilie; archiduces Austrie; duces Mediolani, Burgundie, et Brabancie; comites Haspurgi, Flandrie, et Tirolis’). Further changes applied later in the reign, but the use of the title ‘supreme head’ did not figure in Mary's official style after July 1554.Footnote 11 It was officially abolished by Mary's second Repeal Act of 1554, which restored the ecclesiastical status quo of 1529.Footnote 12 Although Mary rejected the use of the style ‘supremum caput’, she was certainly capable of using powers formerly associated with the title when it suited her. She did not issue commissions to the bishops of her realm, but was happy in 1554 to use the mechanism of royal injunctions.Footnote 13 These made it clear that no bishop was to style himself ‘supported by royal authority’ (‘regia auctoritate fulcitus’), nor was an oath of supremacy to be demanded of ecclesiastics. Mary was focussed on reconciling the kingdom to Rome and this formed the basis of her polity for transforming the Church.Footnote 14 On becoming queen she inherited twenty-three bishops, all of whom had accepted the Edwardian settlement; two bishoprics were vacant (Rochester and Bangor) and John Hooper held two sees (Gloucester and Worcester). Under her half-brother Edward vi, bishops had been appointed by the simple issue of letter patent.Footnote 15 This process was abolished by Mary's first Repeal Act of 1553.Footnote 16 The man who would support her in this was Cardinal Reginald Pole, for it was he who was tasked with reconciling the realm to the Holy See and with repatriating the episcopate as an instrument of that reconciliation after years of schism. Looking back on events in 1556, as he addressed the citizens of London, Pole saw that it was Henry's assumption of the supreme headship which was the start of disaster: ‘And in lyke maner, all the tyme the arche was in the Kynge's hande, as yt was, he takynge that straunge tytle upon him, to be Hedd of the Chyrche in his realme.’Footnote 17 Pole's original commissions are recorded in his Canterbury register at Lambeth.Footnote 18 He was awarded two sets of Faculties – the Bulla Facultatum Communium and the Facultatem Extraordinarium, both dated 5 August 1553. However, these were not specific enough and on 8 March 1554 the pope issued an amplification of Pole's powers.Footnote 19 These new powers were particularly important in allowing Pole to reconstitute the English episcopate. The new faculties enabled him to confirm the appointments of bishops made by Henry viii and Edward vi, and to provide men for vacant sees at the request of the queen. Those bishops appointed under Henry could exercise their gift of consecration or, if it had not been received, obtain it from a Catholic bishop. Those appointed under Edward could be promoted to all orders, including the priesthood; in addition they could be given the ‘gift of consecration’ (‘munus consecrationis’). A marked feature of Marian episcopal polity before Pole arrived in England was the widespread deprivation of priests.Footnote 20 By June 1554 thirteen Edwardian bishops had been deprived. Of these, six had been ordained with the Edwardian Ordinal, so their status as bishops was disallowed as well.Footnote 21 Mary was in need of new bishops as replacements and proceeded to appoint them. These men, however, first needed dispensation from ecclesiastical censures. Pole provided this and proof is found in his legatine register, Registrum expeditorum in Anglia factarum per illustrissimum & reverendissimum cardinalem Polum legatum, a neglected resource for Tudor church history.Footnote 22 In a dispensation issued outside Paris (before he even arrived in England) and dated 17 March 1554, Pole absolved seven named episcopal candidates from heresy and schism.Footnote 23 The seven men were Robert Wharton, John White, Gilbert Bourne, James Brooks, George Cotes, Henry Morgan and Maurice Griffith. Wharton had already been consecrated as bishop of St Asaph in Henry viii’s reign in 1536. That consecration being regarded as valid, reconsecration was deemed unnecessary and a dispensation was all that was required. The remaining six men were all consecrated together on 1 April 1554.Footnote 24 Pole's actions were interesting because, technically speaking, his legatine authority was not valid in England until 10 November 1554, and actually his attainder could not be repealed until parliament on the 22nd.Footnote 25 These episcopal appointments established a process for the formal appointment of new bishops in communion with the see of Rome to support England's reconciliation to the Holy See. The next stage in rehabilitating the kingdom to Rome took place on 30 November, when Pole formally absolved the Church from schism.Footnote 26 The reconciliation emphasised that Henry viii and Edward vi, at the instigation of the devil, had passed laws against the pope, and specifically laws stating that the king was supreme head. Rejecting such claims, Pole absolved the whole realm through his powers as legate a latere, restoring everything to a pristine state. Pole's actions in appointing new bishops in March 1554 threw a light on the need to reconcile bishops already in post and his legatine register shows how this was accomplished. Records are found here for the reconciliation of bishops, for example Cuthbert Tunstall at Durham, George Day at Chichester, Robert Aldrich at Carlisle and John Chamber at Peterborough.Footnote 27 Not all the individual reconciliations are recorded; there is, for example, no record for Stephen Gardiner at Winchester. Restored in August 1553, Gardiner apparently asked for absolution, or at least expressed his repentance in a letter, now missing. Instead of granting absolution, Pole emphasised God's grace to Gardiner which had prevented him from falling into heresy after schism. Pole told Gardiner in a second letter that obedience must come first.Footnote 28 Following the actions of November 1554, the reconciliation of the kingdom to Rome needed to be promulgated and Pole saw that the bishops were key to this task. He delivered instructions to them on 29 January 1555, and to other officials, on how to tackle this job. When announcing the reconciliation, bishops and others were specifically to dwell on the misery of Henry viii’s schism.Footnote 29 Pole stressed that, since Canterbury province represented almost all persons in the kingdom, it was impossible for him personally to reconcile everyone. Therefore, he was delegating this task to his bishops and other officials. Pole's legatine register shows how widely this faculty was disseminated. The document is headed ‘Faculty to be granted to each and every bishop’ (‘Facultas singulis episcopis concedenda’).Footnote 30 The registered copy is addressed to Stephen Gardiner as bishop of Winchester and the legatine register goes onFootnote 31 to list all the recipients of this document. The list is headed by a group of nineteen bishops – London, Bristol, Gloucester, Durham, Bath and Wells, Lincoln, Chester, Rochester, Norwich, St David's, Chichester, Carlisle, Coventry and Lichfield, Hereford, Peterborough, Oxford, Salisbury, Llandaff and Worcester. Other recipients are listed after this.Footnote 32 The bishops clearly understood the import of what Pole was asking them to do. After Gardiner, the first named recipient in Pole's legatine register is Edmund Bonner, bishop of London. Bonner received Pole's commission dated 29 January 1555, and on 19 February he sent it to the archdeacons of London, Middlesex, Essex, St Albans and Colchester to be published in their archdeaconries. He added a covering note telling the archdeacons to select learned men to deal with any queries about absolution and to absolve their clerics first before their flocks.Footnote 33 The years 1533–58 were crucial in determining the role of the episcopate in early modern England. Immediately following the extirpation of Roman jurisdiction, bishops effectively became civil servants under the crown. Henry never claimed an overt power of orders (‘potestas ordinis’) over the clergy, but he issued commissions to the bishops, inhibited their jurisdictions, undertook royal visitations, drew up injunctions and firmly grounded the authority of the episcopate in the role of the king as supreme head. As with Henry viii, so with his son Edward vi, who continued the Henrician mode of management in the Church. Henry's daughter Mary quickly renounced the title supreme head, although she was still capable of using those powers formerly associated with this rank. Her need to reconcile the English Church to Rome resulted in a series of elaborate processes to deprive schismatical bishops, rehabilitate others and then appoint fresh blood to the episcopal bench. Inherent in this move was a reliance on the renewed role of the episcopate to effect reconciliation. The role of a bishop had thus been both defined and reinterpreted in the twenty-five years after 1533. What significance did this have for the traditional emblems of episcopal authority and power? It is this which is the main subject of this article.\n\nThe use of the pallium at the break with Rome In the medieval Church, the symbol of authority for a metropolitan archbishop was the pallium – for many centuries bestowed by the pope on metropolitans and primates as a symbol of the jurisdiction delegated to them by Rome. The pallium signified the fullness of the pontifical office (‘plenitudinem pontificalis officii’) which an archbishop was to enjoy as metropolitan of his province. Nicholas Hawkins, successor to Thomas Cranmer as ambassador to Emperor Charles v, wrote to Henry viii from Bologna on 22 February 1533 that ‘This pall is a pece of white cloth made of the wool of certen lambis, whiche the Pope halowith, and consecrate [sic] bi the Pope, and leide upon St Petre his sepulchre.’Footnote 34 The bulls for Thomas Cranmer's canonical appointment to the see of Canterbury are recorded in his register at Lambeth.Footnote 35 The government wanted a prelate, outwardly in communion with Rome, who would be able to end Henry's marriage to Catherine of Aragon. On 22 February 1533 there was despatched notification to the archbishop of the form of the oath of loyalty to be taken to the Holy See at his consecration.Footnote 36 On 3 March notification was sent to Cranmer (via the archbishop of York and the bishop of London) of the despatch of the pallium.Footnote 37 The form of words to be used at the bestowal of the pallium is carefully recorded. Cranmer was to note that the garment was ‘taken from the body of St Peter, symbolising the fullness of the pontifical office’ (‘de corpore Beati Petri sumptum, plenitudinem videlicet pontificalis officii’).Footnote 38 The wording of all the papal bulls was in common form throughout. The form of the oath of loyalty to the holy see, which Cranmer was to swear, was exactly the same, with minor verbal variations, as that sworn by William Warham on his translation to Canterbury.Footnote 39 On 21 February Hawkins wrote to the king concerning the cost of the bulls, telling him that the pallium would cost 1,000 ducats.Footnote 40 The use of the pallium in Cranmer's consecration is illustrated in what is otherwise a very odd document in Cranmer's register – a protestation, made several times during the ceremony, by which Cranmer wished to make clear that, despite his papal bull of provision, he would accept his appointment at the hands of the king and of no one else. It was, morally, a dubious act and legally an act of perjury. However, Cranmer swore this protestation as a matter of conscience and the king, desperate to secure a canonically-appointed archbishop, supported him and advised him how to proceed to salve his conscience.Footnote 41 After the solemnities of his consecration in St Stephen's chapel, Westminster, the archbishop stood before the high altar ‘to receive the pallium’ (‘ante dictum summum altare pallium recepturus’). Before he would recite the form of words prescribed to be read, Cranmer again swore that he understood the words only in the sense of his earlier protestation. He swore an oath of loyalty to the pope, but made clear that he understood its terms only in the sense of his earlier protestation. It was in 1534 that the government issued new regulations for the appointment of bishops.Footnote 42 After 1534 letters missive sent by the crown to the cathedral chapter became in effect papal bulls of provision. Capitular election of the royal nominee and metropolitical confirmation of that election were simply formalities to complete the process. As late as 1535 renunciations of papal jurisdiction were obtained from bishops appointed before the statute of 1534. Seventeen renunciations survive, eleven dating from February, four from March, one from April and one from June.Footnote 43 So thorough were the government's actions that even bishops appointed after the statute of 1534 made the renunciation.Footnote 44 Cranmer formally renounced his appointment at the hands of the pope on 10 February 1535.Footnote 45 With minor variations, the text is the same as that sworn by Roland Lee.Footnote 46 The oath made no explicit mention of the pallium, even though the bestowal of this garment was closely linked in the medieval English Church with the offering of an oath of loyalty to the pope. It was to be a significant omission, and it helps to explain how the Tudor Church continued to use the pallium after the break with Rome.\n\nLater uses of the pallium, 1534–40 Historians have sometimes noted the use of the pallium in heraldic devices after the English Church's break with Rome and Cranmer himself used it in glass in his palaces. Such stained glass, dated to about 1535, survives in the Victoria and Albert Museum; this has Cranmer's arms which use the pallium, along with his motto ‘Nosce teipsum et deum’ (‘Know yourself and God’).Footnote 47 The pallium was also used as an illustrative device in Cranmer's seals.Footnote 48 A good example appears in the two states of Cranmer's general seal, 1534 and 1540. In this seal, the martyrdom of Archbishop Thomas Becket has been replaced by a representation of the crucifixion. This change took place from 1538 and underlines both Cranmer's support for the royal supremacy and his own evangelical leanings. Even in 1540, however, the pallium still appears (as an intriguing decorative feature) as part of the altered impaled coat of arms of the archdiocese and priory at the bottom left (the dexter side) in the later seal. No further evidence has yet been found concerning the use of the pallium in the sixteenth century in such architectural or formal archival settings. However, the main use of this garment after the break with Rome was as part of the procedure for archiepiscopal appointments. During Cranmer's rule, the archbishop was called upon to confirm elections to archiepiscopal sees. Robert Holgate was appointed to York in 1545 and George Browne to Dublin in 1536.Footnote 49 In both cases, the solemnities of consecration included the bestowal of the pallium. In the acts recording the consecration of George Browne to Dublin, the record shows that on 19 March 1536 the archbishop of Canterbury, assisted by the bishops of Salisbury and Worcester, consecrated Browne and surrendered the pallium to him. The relevant documents comprise two sets of letters patent giving the king's assent to Browne's election to the see of Dublin and a note of Browne's consecration, when the pallium was handed to him. Both sets of letters patent were formally despatched to the archbishop, which is why they have been entered in the legal record of Browne's appointment and consecration in Cranmer's register. Both letters bear the same date, 13 March 1536. The first letter is general in tone and makes no mention of the relevant parliamentary statute governing the appointment, nor of the grant of the pallium. This was not good enough, and a second copy of the letters patent was despatched, clearly asking the archbishop to confirm Browne's election, to consecrate him as archbishop and to bestow the pallium upon him. Browne was to receive episcopal insignia and Cranmer was commanded to perform all that was necessary in that regard. The record of Browne's appointment in Cranmer's register is full, but the surviving documents contain no real definition as to the meaning that the pallium now held, following the extirpation of Roman jurisdiction in England. The records do, however, make three things clear: it was for the crown to command that the pallium be granted to the incoming archbishop as metropolitan; it was the role of the archbishop of Canterbury to bestow the pallium at the request of the crown; and the pallium was a sign of Browne's new archiepiscopal authority, although how and why this is the case is not discussed.Footnote 50\n\nUses of the pallium, 1540–7 Robert Holgate was nominated to the see of York in 1545. His York register contains no relevant material concerning his appointment,Footnote 51 but the documents entered into Cranmer's register are much fuller and can be divided into four sections. It is instructive to compare the form of the materials in Cranmer's register which relate to Holgate's appointment to York with those recorded in Henry Chichele's Canterbury register over a century earlier,Footnote 52 because there are significant differences. The dominant figure in Chichele's appointment is the pope himself. It is the pope who sends the pallium and this action dictates the sequence of events thereafter as, on its receipt, Chichele immediately offered an oath of loyalty to the Holy See. Over a century later, how exactly was the pallium administered to Holgate and what was its significance and meaning? The documents in Cranmer's register shed light on this.Footnote 53 On 26 January 1545 the archbishop of Canterbury, assisted by the bishops of Westminster and Chichester, assembled in the chapel at Lambeth Palace. All the stages in the confirmation of Holgate's election were completed on that day and Cranmer then issued his definitive sentence. Following this, the archbishop's chaplain, dressed in appropriate vestments, celebrated a private mass. After the mass, the archbishop of York, dressed in pontificals, knelt before Cranmer and his colleagues, who were sitting in front of the altar wearing their mitres. The archbishop of Canterbury blessed the pallium, a sign of the fullness of the archiepiscopal office and, with his fellow bishops as his assistants, he laid it on the archbishop of York's shoulders, following the confirmation of his election. Cranmer was requested to inform the king that he had confirmed the election, but that the archdeacon of York should be ordered to enthrone the new archbishop, according to custom. Cranmer agreed, ordering that public instruments be drawn up to record all the acts. Cranmer's register shows, as in the records concerning Browne's appointment to Dublin, that it was the role of the archbishop of Canterbury formally to invest the new archbishop with the pallium. When Cranmer received his pallium in 1533, the garment was first blessed by the pope.Footnote 54 For Holgate, it was Cranmer who blessed the woollen pallium and bestowed it on the new archbishop. When Holgate was appointed to York, the significance of the pallium is described simply and plainly as ‘a sign of the fullness of the archiepiscopal office’. Holgate required no consecration as he proceeded to York from the see of Llandaff;Footnote 55 the bestowal of the pallium therefore took place after a celebration of the mass. Cranmer blessed the pallium and then he and his episcopal colleagues laid it on Holgate's shoulders. In this record, the pallium is not even connected to Holgate's oath of obedience to the king. At Cranmer's own consecration, in 1533, the pallium was closely linked to the new archbishop swearing an oath of loyalty to the pope. Clearly, in Holgate's appointment to York, there is no reference to the pope. Instead, Holgate swore an oath to the king, his heirs and successors, according to a statute of 35 Henry VIII,Footnote 56 and the archbishop of Canterbury then delivered the definitive sentence. The bestowal of the pallium took place later in the ceremonies, in fact after the private mass which was celebrated by Cranmer's chaplain. Holgate was present in person throughout the whole proceedings and Cranmer had invited him to sit on a throne next to his.Footnote 57 The placing of the bestowal of the pallium at the end of the ceremonies seems to confirm the vagueness in the significance of that garment in the English Church of the 1540s. Section 2 of the acts in Holgate's appointment adds little to our understanding. The trigger for the pallium to be given to Holgate by Cranmer was once again the receipt by the latter of a mandate from the king signifying his assent to Holgate's appointment, ordering Cranmer to bestow the pallium and to invest Holgate with appropriate insignia. Similarly, section 3 says little more, being a set of summary articles from the dean and chapter of York, which were delivered by their proctor to Cranmer in Lambeth. Article 6 confirms that, in letters patent, the king signified his assent to the archbishop of Canterbury and his assistant bishops to Holgate's appointment, ordering them to confirm the election, to bestow the pallium and to invest the new archbishop with appropriate insignia. Section 4 of the acts, however, is much more informative, as it gives a detailed description of the prayers and form of words to be used before, during and after the blessing and bestowal of the pallium. What is the significance of these texts and what do they reveal about the use of the pallium in Holgate's appointment? The prayers before the bestowal of that garment reveal that it was to be regarded as a sign of Holgate's archiepiscopal authority (‘hoc pontificalis dignitatis plenitudinis insigne’). All those who possessed such a symbol of honour were to use it before the people so that it could illuminate their deeds and grant heavenly rewards. Here the emphasis is not on the recipient, nor the donor, but on the people who are witnesses to the use of the pallium. When it is blessed by being sprinkled with water, the invocation is to the Almighty (in whose honour the pallium is used) to bless that garment. Further clarity comes from the forms and words used at the bestowal of the pallium itself. The source of human authority for the bestowal of the garment is naturally different from that laid down in medieval canon law. A comparison of the form of words used in 1414 when Henry Chichele was provided to the see of Canterbury by the pope with those used at Holgate's appointment in 1545 reveals the point.Footnote 58 Whereas the fifteenth-century formula stressed that the pallium was taken ‘from the body of St Peter’ (‘de corpore Beati Petri’), the sixteenth-century text omitted all reference to St Peter and stressed simply that the pallium was ‘a sign of the priesthood of our Lord Jesus Christ’ (‘sacerdotii domini nostri Jesu Christi signum’). More significantly, however, the fifteenth-century text laid down that the pope was the sole human agent responsible for the bestowal of the woollen garment. The Tudor rite, however, maintained that the pallium was bestowed in honour of Henry viii ‘to whom, and to none other, you have a duty of obedience and loyalty, to the honour of the English Church’ (‘cui soli et nulli alii obedienciam et fidelitatem debes et exhibuisti in decus ecclesie Anglicane’). Finally, at the end of Holgate's record, the focus switches to its recipient, with an invocation to the Almighty to illumine the archbishop, whom he has honoured with the holiness of the pallium.\n\nThe significance of the use of the pallium in the Henrician Church The surviving records highlight an interesting dilemma which faced a Church cut off from Roman jurisdiction. In Cranmer's appointment to Canterbury, the crown needed an archbishop outwardly in communion with Rome to settle Henry's marital cause with Catherine of Aragon. Here, the pallium was despatched from Rome according to precedent and a reluctant archbishop forced to accept it. Why did the Tudor Church, why did the archbishop of Canterbury, continue to use this garment after the break with Rome? Was it the new order trying to cling to pieces of the old which had no meaning in a new context? Although the records are fragmentary, the appointment of Browne to Dublin and Holgate to York show that this was not the case. First and foremost, the pallium was now a sign of the crown's supremacy in the Church. This is why the records stress repeatedly that it is for the king to bestow this garment on the archbishop. Clearly, this is a fundamental change in the medieval understanding of the pallium, where it was bestowed by the pope himself, with the garment being taken from the body of St Peter. The Henrician Church therefore infused the garment with a new symbolism. It remained a symbol of an archbishop's authority, but an authority which was bestowed by the crown and enunciated in the royal grant of a commission to Cranmer for the exercise of his jurisdiction. Holgate's appointment to York reveals further subtleties in the continued use of the pallium, which were not known in the medieval Church and may not have underpinned the appointment of Browne to Dublin. Do these changes indicate a developing view in the English Church of the use of this garment? Alas, the sources are too fleeting for us to be sure, but it may be that this was the case. At various points in Holgate's ceremony, the emphasis on the use of the garment falls on the people who witness the ceremonies, and on Holgate himself as the recipient. In terms of the use of the pallium in the late medieval Church, these are not definitions of use which would have been accorded to the garment of lamb's wool being used. The pallium is also called a sign of the priesthood of Jesus Christ himself, not simply a sign of archiepiscopal authority. Is this a reflection of an attempt by Cranmer to infuse additional evangelical meaning into the retention of a medieval garment? The surviving evidence does not allow us to be sure, and Holgate's record is quick to emphasise that the bestowal of the pallium is a sign of the supremacy of Henry viii in the Church.Footnote 59 It is clear, none the less, that the bestowal of the pallium was not an anachronism, nor a casual survival of a medieval symbol.Footnote 60 It was rather a powerful demonstration of the reality of the royal supremacy within the Church. When Henry viii claimed to bestow this garment upon Holgate and Browne of Dublin, the nature of that insignia changed from being papal and sacerdotal to political and religious. The pallium continued to be a sign of metropolitical authority, but it was for the king alone on earth to appoint archbishops and to bestow jurisdiction upon them."}, {"url": "http://www.historyofyork.org.uk/themes/tudor-stuart/robert-holgate-archbishop", "page_content": "1545AD - 1554AD\n\nRobert Holgate from a Yorkshire family, was educated in Cambridge and entered the Gilbertine order as a canon. He played an important role in the life of the community before the Dissolution of the Monasteries.\n\nConsidered to be a protégé of Thomas Cromwell, Holgate was appointed president of the Council in the North in 1538, a post he held for 11 years. He lived in the house of the former abbot of St Mary’s Abbey in York, which has survived as King’s Manor.\n\nFollowing the death of Archbishop Lee in September 1544, Holgate was named his successor and was consecrated as Archbishop of York at Lambeth in January 1545, renouncing papal authority.\n\nFrom then, the tenets of Protestant theology were regularly expounded in the Minster for the first time, and organ music was abolished. He instructed that the Minster Library be furnished with new Protestant commentaries on the Bible by theologians like Calvin.\n\nArchbishop Holgate founded three grammar schools in 1546, one at his birthplace of Hemsworth in the West Riding, one at Old Malton and one in York. He required his headmasters to be skilled in Hebrew, Greek and Latin and to take his pupils to the Minster on Sundays.\n\nIn order to prove his Protestantism to the sceptical Duke of Northumberland, in 1550, aged 68, the Archbishop took a bride when he was 68 – local gentlewoman Barbara Wentworth. This was a year after an Act of Parliament removed the duty of celibacy from the English clergy.\n\nBut when Queen Mary came to the throne in 1553 and returned England to Catholicism, Holgate was sent to the Tower then stripped of his post for breaking his vow of celibacy.\n\nHaving paid the crown £1,000 for his ‘crimes’ Holgate was set free in January 1555 only to die that November in London."}, {"url": "https://www.houseofnames.com/holgate-family-crest", "page_content": "Holgate History, Family Crest & Coats of Arms Origins Available:\n\nOrigins Available: England\n\nThe origins of the Holgate name come from when the Anglo-Saxon tribes ruled over Britain. The name Holgate was originally derived from a family having lived in Holdgate, a parish, in the union of Ludlow, hundred of Munslow, in Shropshire. [1]\n\nAlternatively, the name could have originated in Holgate, a township, in the parish of St. MaryBishopshill-Junior, union of York, E. division of the Ainsty wapentake, in the West Riding of Yorkshire. [1] [2]\n\nLoading...\n\nEarly Origins of the Holgate family\n\nLoading...\n\nEarly History of the Holgate family This web page shows only a small excerpt of our Holgate research. Another 59 words (4 lines of text) covering the years 1525, 1481, 1555, 1545, 1554, 1481, 1549, 1524 and 1537 are included under the topic Early Holgate History in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nHolgate Spelling Variations Before English spelling was standardized a few hundred years ago, spelling variations of names were a common occurrence. Elements of Latin, French and other languages became incorporated into English through the Middle Ages, and name spellings changed even among the literate. The variations of the surname Holgate include Holgate, Holdgate, Howgate, Hogate and others.\n\nLoading...\n\nEarly Notables of the Holgate family (pre 1700) Notables of the family at this time include Robert Holgate or Holdegate (c. 1481-1555), English Bishop of Llandaff and then Archbishop of York (1545-1554.) He recognized Henry VIII as head of the Church of England. \"He was the youngest son of Thomas Holgate and Elizabeth, daughter of Robert Champernowne, came of a Yorkshire family entitled to armorial bearings, and was born probably at Hemsworth, near Pontefract, in or about 1481, being, according to his own statement, sixty-eight years old in 1549. He was a canon of the order of St. Gilbert of Sempringham, and was probably educated in the house belonging...\n\nAnother 106 words (8 lines of text) are included under the topic Early Holgate Notables in all our PDF Extended History products and printed products wherever possible.\n\nHolgate Ranking In the United States, the name Holgate is the 16,133rd most popular surname with an estimated 2,487 people with that name. [8]\n\nLoading...\n\nHolgate migration to the United States + A great wave of immigration to the New World was the result of the enormous political and religious disarray that struck England at that time. Families left for the New World in extremely large numbers. The long journey was the end of many immigrants and many more arrived sick and starving. Still, those who made it were rewarded with an opportunity far greater than they had known at home in England. These emigrant families went on to make significant contributions to these emerging colonies in which they settled. Some of the first North American settlers carried this name or one of its variants:\n\n\n\nHolgate Settlers in United States in the 17th Century Martha Holgate, who landed in Virginia in 1664 [9]\n\nJames Holgate, who landed in Philadelphia, Pennsylvania in 1685 [9] Holgate Settlers in United States in the 18th Century William Holgate, who settled in New England in 1748 Holgate Settlers in United States in the 19th Century Ann Holgate, aged 15, who arrived in New York in 1864 [9]\n\nJohn Holgate, aged 7, who arrived in New York in 1864 [9]\n\nMary Holgate, aged 13, who arrived in New York in 1864 [9]\n\nSeth Holgate, who landed in New York in 1864 [9]\n\nWilliam Holgate, aged 47, who landed in New York in 1864 [9]\n\n... (More are available in all our PDF Extended History products and printed products wherever possible.)\n\nHolgate migration to Australia +\n\n\n\nHolgate Settlers in Australia in the 19th Century Mr. John Holgate, English convict who was convicted in Essex, England for 14 years, transported aboard the \"Fairlie\" on 14th October 1833, arriving in New South Wales, Australia [10]\n\nMr. James Holgate, (b. 1807), aged 28, English farm servant who was convicted in London, England for life for house breaking, transported aboard the \"England\" on 6th June 1835, arriving in New South Wales, Australia, he died in 1886 [11]\n\nMr. John Holgate, (b. 1803), aged 32, British convict who was convicted in London, England for life for theft, transported aboard the \"England\" on 6th June 1835, arriving in New South Wales, Australia [11]\n\nMr. James Holgate, English convict who was convicted in Preston, Lancashire, England for 7 years transported aboard the \"Forfarshire\" on 24th June 1843, arriving in Tasmania (Van Diemen's Land) [12] Emigration to Australia followed the First Fleets of convicts, tradespeople and early settlers. Early immigrants include:\n\nContemporary Notables of the name Holgate (post 1700) + Stephen Holgate (1971-2021), English professional rugby league footballer who played in the 1990s and 2000s for England and Cumbria\n\nSidney Holgate (1918-2003), English mathematician at the University of Durham\n\nSharon Ann Holgate Ph.D., English Freelance Science Writer and Broadcaster and Visiting Fellow in Physics and Astronomy at Sussex University\n\nSir Stephen T. Holgate CBE (b. 1947), British physician who specializes in immunopharmacology, respiratory medicine and allergies, and asthma and air pollution, based at the University of Southampton\n\nHarold Norman \"Harry\" Holgate AO (1933-1997), Australian Labor Party politician, 36th Premier of Tasmania (1981-1982), Speaker of the Tasmanian House of Assembly (1975-1976)\n\nStephen Holgate (b. 1953), Australian composer\n\nEdwin Headley Holgate (1892-1977), Canadian painter, who was briefly a member of the \"Group of Seven\" in 1931\n\nJames Holgate, American politician, Member of Pennsylvania State House of Representatives from Philadelphia County, 1868-69, 1879-80 [13]"}, {"url": "https://www.englandcast.com/2022/11/robert-holgate/", "page_content": "Today in 1555 Robert Holgate died. He was the Archbishop of York, and in his life he brought to the fore one of the major issues between Protestants and Catholics, which was the idea of a clergy that could get married. He was the first Protestant Archbishop of York, and he was also the first to get married.\n\nHe was President of the Council in the North, but proved unable to put down the Seamer rebellion in 1549, and was replaced by Francis Talbot, Earl of Shrewsbury. He would see much of the wealth of the York minster be stripped as Edward VI moved the Protestant reformation further and destroyed any lingering signs of Catholicism.\n\nAfter Edward VI died, his sister, the Catholic Mary assumed the throne in 1553, and Robert Holgate, to quote from the York Minster Chronicle, “Quickly shed his wife and his Protestant faith to save his skin.” In 1554 he was deprived of his title.\n\nRobert Holgate died in London on the 15th of Nov 1555, and his body was buried in the Church of St. Sepulchre, Holborn, London.\n\nThat’s your Tudor Minute for today. Remember you can dive deeper into life in 16th-century England through the Renaissance English History Podcast at englandcast.com.\n\n\n\nSuggested link:\n\nOctober is Reformation Month!\n\n\n\nFrom my shop:\n\nEarly Christmas shopping gifts\n\nChristmas Tree Skirt Collection\n\nPs. All products are made on-demand and can take a few weeks to ship."}, {"url": "http://www.tudorplace.com.ar/Bios/RobertHolgate.htm", "page_content": "Robert H OLGATE (Archbishop of York)\n\nDied: 15 Nov 1555\n\nBuried: Church of St. Sepulchre, Holborn, London\n\nEmerges from obscurity in 1537 as Bishop of Llandaff and Master of Semperingham, home of the Gilbertine Order, and of whom it was said, a great favourite at court. He was also Lord President of the Council in the North.\n\nHe left this Bishopric to become Archbishop of York in 1545 becoming the first Protestant Archbishop of York and also the first to be married. When Henry VIII died in 1547, Robert Holgate saw the Minster stripped of half its clergy and much of its treasure under Edward VI .\n\nHe acquired much wealth, land and property, stretching from Pickering and East Yorkshire to Hemsworth. Holgate was born in Hemsworth and did not forget his native village. He left an endownment the \"Holgate Trust\" which to this day controls the Hemsworth Holgate Alms House in Robin Lane, Hemsworth. The Alms House Trust was made for the upkeep of a number of men and women of the Protesant persuasion. Holgate also left money for school at Hemsworth, York and old Malton. In May 1548 the Archbishop, by deed poll, prescribed the rules and ordinances of the Hemsworth School.\n\nHe was President of the Council in the North, but proved unable to deal with the Seamer rebellion in Aug 1549, nad was replaced by Francis Talbot, Earl of Shrewsbury . He later claimedthat it was John Dudley, Earl of Warwick who '... touke such displeasure with me that... he put me firth of the rowme of the President...'.\n\nAs the Reformation progressed and Edward VI died, his sister, the Catholic Mary assumed the throne in 1553, and Robert Holgate, to quote from the York Minster Chronicle, quickly shed his wife and his Protestant faith to save his skin.\n\nIn 1554 he was deprived of his title, and in 1555 Robert Holgate, Archbishop of York, endowed a Hospital in Hemsworth by Will."}, {"url": "https://www.houseofnames.com/hoggate-family-crest", "page_content": "Hoggate History, Family Crest & Coats of Arms Origins Available:\n\nOrigins Available: England\n\nThe ancestors of the name Hoggate date back to the Anglo-Saxon tribes of Britain. The name is derived from when the Hoggate family lived in Holdgate, a parish, in the union of Ludlow, hundred of Munslow, in Shropshire. [1]\n\nAlternatively, the name could have originated in Holgate, a township, in the parish of St. MaryBishopshill-Junior, union of York, E. division of the Ainsty wapentake, in the West Riding of Yorkshire. [1] [2]\n\nLoading...\n\nEarly Origins of the Hoggate family\n\nLoading...\n\nEarly History of the Hoggate family This web page shows only a small excerpt of our Hoggate research. Another 59 words (4 lines of text) covering the years 1525, 1481, 1555, 1545, 1554, 1481, 1549, 1524 and 1537 are included under the topic Early Hoggate History in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nHoggate Spelling Variations It is only in the last few hundred years that the English language has been standardized. For that reason, early Anglo-Saxon surnames like Hoggate are characterized by many spelling variations. As the English language changed and incorporated elements of other European languages, even literate people changed the spelling of their names. The variations of the name Hoggate include: Holgate, Holdgate, Howgate, Hogate and others.\n\nLoading...\n\nEarly Notables of the Hoggate family (pre 1700) Notables of the family at this time include Robert Holgate or Holdegate (c. 1481-1555), English Bishop of Llandaff and then Archbishop of York (1545-1554.) He recognized Henry VIII as head of the Church of England. \"He was the youngest son of Thomas Holgate and Elizabeth, daughter of Robert Champernowne, came of a Yorkshire family entitled to armorial bearings, and was born probably at Hemsworth, near Pontefract, in or about 1481, being, according to his own statement, sixty-eight years old in 1549. He was a canon of the order of St. Gilbert of Sempringham, and was probably educated in the house belonging...\n\nAnother 106 words (8 lines of text) are included under the topic Early Hoggate Notables in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nMigration of the Hoggate family Many English families tired of political and religious strife left Britain for the new colonies in North America. Although the trip itself offered no relief - conditions on the ships were extremely cramped, and many travelers arrived diseased, starving, and destitute - these immigrants believed the opportunities that awaited them were worth the risks. Once in the colonies, many of the families did indeed prosper and, in turn, made significant contributions to the culture and economies of the growing colonies. An inquiry into the early roots of North American families has revealed a number of immigrants bearing the name Hoggate or a variant listed above: James Holgate settled in Philadelphia in 1685; William Holgate settled in New England in 1748; Mathew Holdgate settled with his daughter Mary in Philadelphia in 1685."}, {"url": "https://maltonians.maltonschool.org/people/holgate.php", "page_content": "Illustrated here is the church at Darrington, near Pontefract. Archbishop Holgate's heir was his nephew, Thomas Holgate, who acquired the manor of Stapleton in the parish of Darrington. Several Holgate tombstones are here.\n\nROBERT HOLGATE died on 15th November, 1555 at the Headhouse of the Master of Sempringham, a Gilbertine Order of which he had himself been Master. In his Will he asked that his body should \"be buried in the parish church within the parish whereof it shall please Almighty God to take me out of this transitory life\". The Headhouse stood in Cow Lane, Smithfield, and within the parish of St. Sepulchre. \" The bells of Old Bailey\" are the bells of this Church which stands at the junction of Giltspur Street and Holborn Viaduct.\n\nSir William Petre was one of the four executors of Holgate's will. He was born c.1505 at Torbryan, in Devon, and educated at Oxford of which university he became Doctor of Law in 1533. For a time he was tutor to a brother of Anne Boleyn. By 1544 Henry VIII had made Petre a knight, a privy councillor, and one of his two Principal secretaries. He served Henry, Edward, Mary and Elizabeth. The original painting is at Ingatestone Hall in Essex.\n\nAdvert for Malton Free Grammar School\n\nAn illustration of a bill advertising the Grammar School at Old Malton. The illustration is taken from a book by Dr J S Purvis, Director of the Borthwick Institute of Historical Research in 1960, entitled \"Historical Records\"\n\nThe illustration was on the front of the menu for the Holgate Society dinner at Brown's Hotel, 28th October 1960.\n\nA transcription:\n\nThis is to give NOTICE,That at Old Malton Free Grammar School, YOUTH are completely qualified for any manner of Bufinefs, in Latin, Greek &c. Alfo Arithmetic in all its Parts, Navigation, Menfuration, Merchants Accompts &c. and Writing in very Perfection, by JOSEPH KERR, Mafter. WILLIAM HALL, Affiftant.\n\nN. B. Old Malton is pleafantly fituated upon the River Derwent in the North-Riding of the County of York, in a fine plentiful Country: Board at Seven Pounds per Annum; Board and Learning, at Nine Guineas; Learning, Board, and Cloaths, found in a neat decent Manner, at the Expense of Twelve Pounds.\n\nThofe who are pleafed to encourage this SCHOOL, may depend upon fuch Exactnefs and Care, as will, in every Refpect, be confiftent with this publick Notice"}, {"url": "https://www.yorkpress.co.uk/news/17223886.meet-archbishop-robert-holgate-founder-archbishop-holgates-school/", "page_content": "Robert Holgate and the restored Archbishop Holgate’s Grammar School playing field gates\n\nLocation of plaque: on the restored gates in Bridge Lane, off Wigginton Road near York Hospital\n\nTHINGS are a little bit different now. But back in Tudor times it wasn't the done thing for a priest who had taken a vow of chastity to suddenly decide to get married.\n\nRobert Holgate wasn't just any priest: he was the Archbishop of York and President of the King's Council in the North. When he married in 1550, at the age of 68, it caused quite a scandal - particularly in conservative northern Church circles.\n\nHe got away with it during the reign of the young, and Protestant, King Edward VI, Henry VIII's son. But when Edward died at the age of 15 in 1553 and his Catholic sister Mary succeeded him, Robert quickly found himself in hot water.\n\nHe was imprisoned in the Tower of London for 'divers offences' - most notably getting married after having taken a vow of chastity.\n\nStripped of all his offices, he apologised to the Queen, and was eventually released in 1555 on payment of a huge fine. It did him little good - he died ten months later, clearly a broken man.\n\nRobert's career was typical of many statesmen in Tudor times. Like Cardinal Wolsey, he rose to dizzying heights, only to fall quickly from grace when he offended the ruling monarch.\n\nHis name survives in York, however, because of something he did while at the height of his power in York.\n\nHolgate had bought the Treasurer's House and other property in Minster Close.\n\nIn 1546, he founded three schools - one in York, one in Hemsworth, and one in Old Malton. The York school was in Ogleforth 'close by the cathedral' and, like other early grammar schools in England, was intended to train students for the church. The curriculum included Latin, Greek and Hebrew with some history, geography and maths but with the emphasis firmly on religious and moral education. Discipline is said to have been severe - as it was for poor Archbishop Robert himself once Queen Mary came to the throne.\n\nThe school survived the Archbishop's fall from grace, however. More than 200 years after his death, an advert in the York Courant in December 1799 stated that: \"The Free Grammar School situate within the Close of the Cathedral Church of York founded by Archbishop Holgate for the Instruction of Youth ... will open again after the Christmas recess on Monday, January 20, 1800.\"\n\nLike other grammar schools Archbishop Holgate's struggled for pupils in the early 1800s: it had just 10 in 1818, and 17 in 1824.\n\nThen, in 1845-6, the York Diocesan School Society built a new training college (St John's College) on Lord Mayor's Walk. A new school, the Yeoman School, was built next door. Opened in 1846 this was intended to cater for the 'middle class children' of agriculturalists, as well as to provide teaching practice for student teachers at St John's.\n\nThe new school ran into financial difficulties, however, and in 1858, after 300 years in Ogleforth, Archbishop Holgate's School took it over.\n\nThe iron gates to the school's playing fields seem to have been designed between 1850 and 1860 by George Townsend Andrews, the architect who had designed St John's College itself. They were made by the Walmgate-based Walker Iron Foundry, which also made railings and gates for the British Museum, as well as others across York, including in St Leonard's Place, York Cemetery, Dean's Park and at St Peter's School.\n\nArchbishop Holgate's School thrived in its new location in Lord Mayor's Walk. By 1915, when the Rev William Johnson retired as headmaster, the school had 294 pupils.\n\nBy then, the school had leased part of Bootham Stray for playing fields, which is why the school playing field gates - which were restored in 2017 by York Civic Trust working with York Hospital - are there to this day.\n\nThe school itself moved to its present site on Hull Road in 1963.\n\nStephen Lewis\n\nFor the stories behind more York Civic Trust plaques, visit yorkcivictrust.co.uk"}, {"url": "https://findingaids.library.northwestern.edu/agents/people/1587", "page_content": "Dates\n\nExistence: 1859 - 1945\n\nBiography\n\nThomas Franklin Holgate was born on April 8, 1859, in Hastings County, Ontario, Canada, the son of Thomas and Eleanor Wright Holgate. He received a Bachelor of Arts degree from Victoria College, University of Toronto, in 1884, and a Master's degree, in absentia, from the same institution in 1889. Holgate came to Northwestern University in 1893 as a mathematics professor. He served as Dean of the College of Liberal Arts for 17 years and two terms as acting president of the University.\n\n\n\nHolgate began his professional teaching career in 1874, teaching in the public school system of Ontario. Upon graduation from college in 1884, he became a mathematics master (instructor) at Albert College, Belleville, Ontario. He remained in this position until 1890 when he became a fellow at Clark University in Worcester, Massachusetts. He received a Ph.D. from Clark University in 1893. He joined the Northwestern University faculty in 1893 as an instructor in the Mathematics Department. During the year, he became involved in the activities of the first International Congress of Mathematicians held in conjunction with the Chicago Columbian Exposition of 1893. He also devoted considerable attention to the preparation of a series of Colloquium Lectures by Felix Klein held in Evanston following the Congress.\n\n\n\nIn 1894, after only one year at Northwestern, he was made a full professor. In 1897, he played an instrumental role in the formation of the Chicago section of the American Mathematical Society and served as Secretary from 1897 to 1905. In 1902, he was appointed Dean of the College of Liberal Arts, a position he held for the next seventeen years.\n\n\n\nIn 1904, following the resignation of President Edmund James, Holgate was appointed President Ad Interim of Northwestern University. He served in this capacity until the selection of Abram Harris as President in 1906. During his first two-year term as acting president, the Norman Harris Lecture Foundation was established, a department of education was added to the College of Liberal Arts, a training school for nurses was established, the geology, zoology, and romance language departments were enlarged, the athletic field on Central Street was opened, and the University was able to pay off a quarter-million-dollar debt. Additionally, he served as Secretary for the Louisiana Purchase Exposition held in St. Louis in 1904.\n\n\n\nBetween 1906 and 1916, Holgate held the Noyes Professorship of Pure Mathematics, secured legislation for revision and codification of the Illinois school laws, traveled to Rome where he was Secretary/Delegate to the International Congress of Mathematicians in 1908, and was a member of a commission to reorganize the Chicago Public Library.\n\n\n\nIn 1916, with the resignation of Abram Harris, Holgate was once again called upon to serve as acting president of the University. As acting president from 1916 to 1919, Holgate instituted democratic reforms in the selection of deans; Northwestern was elected to membership in the Association of American Universities; the Law School's course of study was lengthened to four years; degree courses in physical education and public speaking were installed; student military training was established on campus; and 3,600 soldiers and sailors were trained in mechanical subjects as part of the University's commitment to the United States' war effort.\n\n\n\nDuring World War I, Holgate assisted Walter Dill Scott in personnel work for the War Department. He was also influential in the formation of the North Central Association of Colleges and Secondary Schools and served as President from 1917 to 1918.\n\n\n\nIn 1919, with the selection of Lynn Harold Hough as President of the University, Holgate retired from his major administrative duties and was made Dean Emeritus of the College of Liberal Arts. He continued, however, to teach mathematics for the next fifteen years, retiring in 1934. He spent the 1921-,22 academic year in China as a visiting professor at the University of Nanking. His experiences in China served to reinforce an interest in foreign students and he acted as their advisor upon his return to Northwestern.\n\n\n\nHolgate's research interests were in the fields of pure geometry and ruled surfaces of the fourth order. His translation of Theodore Reye's Geometrie der Lage (Geometry of Position) was published in 1898. His other published works include Elementary Geometry (1901) and Projective Pure Geometry (1930). He also wrote a “History of the Mathematics Department at Northwestern University, 1855-1905,” and a thirty-page summary of Northwestern University's activities during World War I, “Northwestern in the Great War.”\n\n\n\nHolgate received honorary Doctor of Law degrees from the University of Illinois in 1905, Queen's University in 1919, and Northwestern University in 1937. He was a fellow of the American Association for the Advancement of Science and a member of the University Club of Evanston, the University Club of Chicago, Phi Beta Kappa, and Sigma Xi.\n\n\n\nIn addition to his university activities, Holgate was prominent in civic and religious affairs and was particularly concerned with administrative problems of the Methodist Episcopal Church. He served five terms as a member of the Methodist Church's General Conference; was a member of its Board of Education for Negroes; and from 1924 to his death in 1945, was a member of the church's Board of Education, serving as its treasurer from 1934 to 1938. From 1923 to 1925, he was president of the Chicago Church Federation. In recognition of his support of educational opportunities for black students, the library at Bennett College in North Carolina was named for him.\n\n\n\nDean Holgate was married twice. On August 2, 1885, in Bath, Ontario, Canada, he married Julia Caroline Sharp, the daughter of a local farmer, John Sharp. She died in 1887. His second marriage to Georgina Angela Burdette, the daughter of Daniel Burdette, a. manufacturer, took place in Newburgh, Ontario, Canada, July 23, 1890. The Holgates had four children: Eleanor, born in 1894, who later married the noted scholar, Owen Lattimore; Robert Burdette, born in 1895; Barbara (Mrs. George H. Young), born in 1899, and Frances Burdette, born in 1902.\n\n\n\nThomas Franklin Holgate died of a heart ailment in Evanston at the age of 86 on April 11, 1945. Funeral services were held on April 13, 1945 at the First Methodist Church of Evanston.\n\n\n\nDespite the fact that his formal title was that of President Ad Interim, Holgate was one of the most accomplished, significant, and influential administrators in Northwestern's history, and enjoyed an extraordinarily long and productive academic career, while maintaining an avid interest in foreign, civic and religious affairs.\n\nFound in 1 Collection or Record:"}, {"url": "https://stirnet.com/genie/data/british/hh4bz/holgate1.php", "page_content": "\n\n'Holgate1' Index links to: Lead / Letter\n\nFamilies covered: Holgate of Stapleton, Holgate of Walden\n\nRobert Holgate\n\nm. Isabel Marshall (dau of William Marshall of Pickering)\n\n1. Thomas Holgate\n\nm. Jane Brown (dau of William Brown)\n\nA. John Holgate\n\nm. Elizabeth Thornton (dau of John Thornton)\n\ni. Thomas Holgate\n\nm. Elizabeth Champernoun (dau of Thomas Champernoun)\n\na. John Holgate\n\n(1) Henry Holgate\n\nm. Mary Jackson of Snydal\n\n(A) Thomas Holgate\n\nm1. Isabel Butler (dau/heir of Henry Butler of Pontefract)\n\n(i)+ issue - Henry, Robert\n\nm2. Mary Power (dau/heir of Henry Power of Beverley)\n\n(iii) Thomas Holgate of Stapleton\n\nFMG shows that Thomas dsp but adds a note that one source suggests that he was bur 29.04.1601 \"having had three sons and two daughters. His issue survived for three generations\".\n\n(iv)+ other issue - Edward (bur 17.08.1591), Bartholomew\n\n(B) William Holgate\n\nb. Edward Holgate\n\nc. Robert Holgate, Archbishop of York (b 1481-2, d 1555)\n\nWikipedia (\"Robert Holgate\") shows Robert's dates and suggests that he had the following family. This got him into trouble when Queen Mary came to the throne.\n\nm. (1547/1550) Barbara Wentworth (b c1525)\n\n(1)+ issue - Robert, child\n\nd. Elizabeth Holgate\n\n## FMG shows this as the Elizabeth who m. Thomas Nettleton of Thornhill (a 1420) but we show her below as of an earlier generation.\n\nii. Richard Holgate\n\nm. Ursula Champernoun (dau of Thomas Champernoun)\n\niii. Anne Holgate\n\nm. Robert Radcliffe\n\niv. Ursula Holgate\n\nm. Alexander Bowles\n\nv. Mabel Holgate\n\nm. Anthony Brae\n\nB. Edward Holgate\n\nm. Jane Reynerson (dau of Francis Reynerson)\n\nC. Anne Holgate\n\nm. Thomas Methley of Methley\n\nD. Elizabeth Holgate see ## above\n\n2. John Holgate\n\nm. Ann Dalison of Lincolnshire\n\n3. Margaret Holgate\n\nm. Robert Hansard of Walworth\n\n\"of the family of Robert Holgate, Archbishop of York and Lord President of the North, who lived anno 1544\" was ...\n\nWilliam Holgate of Clavering, Essex\n\n1. William Holgate of Walden, Essex (b 1557-8, d 01.08.1630)\n\nm. Lettice Bawcock (b c1562, d 27.03.1629)\n\nA. William Holgate of Great Bradfield, Essex\n\ni. William Holgate (b c1618, d 1634)\n\nB. John Holgate of Walden (a 1626, d 05.05.1673, of the Middle Temple, 6th/youngest son)\n\nm1. Anne Plomor (dau of Richard Plomor of Walden)\n\ni. William Holgate of Walden (d 31.08.1672, of the Outer Temple, 2nd son)\n\na. William Holgate of Walden (b c1670-1, d 25.01.1717)\n\nm1. Mary Baldwine (dau of Ralph Baldwine of Ashwell)\n\n(1) John Holgate of London (b 10.07.1693, d 1738)\n\n(A) Charles William Holgate (b 05.05.1721)\n\nm. Mary Kentish of Baldock\n\n(i) Ann Holgate (b 03.04.1732, d 1817)\n\n(ii)+ other issue (dvpsp)\n\n(B)+ other issue - John (b 26.04.1724), Mary (b 02.05.1725)\n\n(2) Mary Holgate (d 23.11.1724)\n\nm. William Lekeux of London\n\nm2. Susan Stubbin of Essex\n\n(3)+ other issue - William (a 1730), Thomas (a 1730), Anne\n\nb. Anne Holgate (a 1730)\n\nm. Thomas Cooke (a 1730, vicar in London)\n\nc.+ other issue (d unm) - John (b c1656, a 1664), Lettice\n\nii.+ other issue - John (b c1632, a 1634), Lettice (d unm)\n\nm2. Mary Wood (dau of William Wood of Battles)\n\niv. Robert Holgate (dsp)\n\nv. Anne Holgate (d 05.01.1685)\n\nm. James Monteth of Greenwich, Kent (b 1632-3, d 21.09.1681, \"of the ancient family of Monteth in Scotland\")\n\nC. Jane Holgate (2nd dau)\n\nm. John Gibbs of Walden"}], "Robert Holgate was a statesman.": [{"url": "http://www.historyofyork.org.uk/themes/tudor-stuart/robert-holgate-archbishop", "page_content": "1545AD - 1554AD\n\nRobert Holgate from a Yorkshire family, was educated in Cambridge and entered the Gilbertine order as a canon. He played an important role in the life of the community before the Dissolution of the Monasteries.\n\nConsidered to be a protégé of Thomas Cromwell, Holgate was appointed president of the Council in the North in 1538, a post he held for 11 years. He lived in the house of the former abbot of St Mary’s Abbey in York, which has survived as King’s Manor.\n\nFollowing the death of Archbishop Lee in September 1544, Holgate was named his successor and was consecrated as Archbishop of York at Lambeth in January 1545, renouncing papal authority.\n\nFrom then, the tenets of Protestant theology were regularly expounded in the Minster for the first time, and organ music was abolished. He instructed that the Minster Library be furnished with new Protestant commentaries on the Bible by theologians like Calvin.\n\nArchbishop Holgate founded three grammar schools in 1546, one at his birthplace of Hemsworth in the West Riding, one at Old Malton and one in York. He required his headmasters to be skilled in Hebrew, Greek and Latin and to take his pupils to the Minster on Sundays.\n\nIn order to prove his Protestantism to the sceptical Duke of Northumberland, in 1550, aged 68, the Archbishop took a bride when he was 68 – local gentlewoman Barbara Wentworth. This was a year after an Act of Parliament removed the duty of celibacy from the English clergy.\n\nBut when Queen Mary came to the throne in 1553 and returned England to Catholicism, Holgate was sent to the Tower then stripped of his post for breaking his vow of celibacy.\n\nHaving paid the crown £1,000 for his ‘crimes’ Holgate was set free in January 1555 only to die that November in London."}, {"url": "https://www.yorkpress.co.uk/news/17223886.meet-archbishop-robert-holgate-founder-archbishop-holgates-school/", "page_content": "Robert Holgate and the restored Archbishop Holgate’s Grammar School playing field gates\n\nLocation of plaque: on the restored gates in Bridge Lane, off Wigginton Road near York Hospital\n\nTHINGS are a little bit different now. But back in Tudor times it wasn't the done thing for a priest who had taken a vow of chastity to suddenly decide to get married.\n\nRobert Holgate wasn't just any priest: he was the Archbishop of York and President of the King's Council in the North. When he married in 1550, at the age of 68, it caused quite a scandal - particularly in conservative northern Church circles.\n\nHe got away with it during the reign of the young, and Protestant, King Edward VI, Henry VIII's son. But when Edward died at the age of 15 in 1553 and his Catholic sister Mary succeeded him, Robert quickly found himself in hot water.\n\nHe was imprisoned in the Tower of London for 'divers offences' - most notably getting married after having taken a vow of chastity.\n\nStripped of all his offices, he apologised to the Queen, and was eventually released in 1555 on payment of a huge fine. It did him little good - he died ten months later, clearly a broken man.\n\nRobert's career was typical of many statesmen in Tudor times. Like Cardinal Wolsey, he rose to dizzying heights, only to fall quickly from grace when he offended the ruling monarch.\n\nHis name survives in York, however, because of something he did while at the height of his power in York.\n\nHolgate had bought the Treasurer's House and other property in Minster Close.\n\nIn 1546, he founded three schools - one in York, one in Hemsworth, and one in Old Malton. The York school was in Ogleforth 'close by the cathedral' and, like other early grammar schools in England, was intended to train students for the church. The curriculum included Latin, Greek and Hebrew with some history, geography and maths but with the emphasis firmly on religious and moral education. Discipline is said to have been severe - as it was for poor Archbishop Robert himself once Queen Mary came to the throne.\n\nThe school survived the Archbishop's fall from grace, however. More than 200 years after his death, an advert in the York Courant in December 1799 stated that: \"The Free Grammar School situate within the Close of the Cathedral Church of York founded by Archbishop Holgate for the Instruction of Youth ... will open again after the Christmas recess on Monday, January 20, 1800.\"\n\nLike other grammar schools Archbishop Holgate's struggled for pupils in the early 1800s: it had just 10 in 1818, and 17 in 1824.\n\nThen, in 1845-6, the York Diocesan School Society built a new training college (St John's College) on Lord Mayor's Walk. A new school, the Yeoman School, was built next door. Opened in 1846 this was intended to cater for the 'middle class children' of agriculturalists, as well as to provide teaching practice for student teachers at St John's.\n\nThe new school ran into financial difficulties, however, and in 1858, after 300 years in Ogleforth, Archbishop Holgate's School took it over.\n\nThe iron gates to the school's playing fields seem to have been designed between 1850 and 1860 by George Townsend Andrews, the architect who had designed St John's College itself. They were made by the Walmgate-based Walker Iron Foundry, which also made railings and gates for the British Museum, as well as others across York, including in St Leonard's Place, York Cemetery, Dean's Park and at St Peter's School.\n\nArchbishop Holgate's School thrived in its new location in Lord Mayor's Walk. By 1915, when the Rev William Johnson retired as headmaster, the school had 294 pupils.\n\nBy then, the school had leased part of Bootham Stray for playing fields, which is why the school playing field gates - which were restored in 2017 by York Civic Trust working with York Hospital - are there to this day.\n\nThe school itself moved to its present site on Hull Road in 1963.\n\nStephen Lewis\n\nFor the stories behind more York Civic Trust plaques, visit yorkcivictrust.co.uk"}, {"url": "https://www.houseofnames.com/holgate-family-crest", "page_content": "Holgate History, Family Crest & Coats of Arms Origins Available:\n\nOrigins Available: England\n\nThe origins of the Holgate name come from when the Anglo-Saxon tribes ruled over Britain. The name Holgate was originally derived from a family having lived in Holdgate, a parish, in the union of Ludlow, hundred of Munslow, in Shropshire. [1]\n\nAlternatively, the name could have originated in Holgate, a township, in the parish of St. MaryBishopshill-Junior, union of York, E. division of the Ainsty wapentake, in the West Riding of Yorkshire. [1] [2]\n\nLoading...\n\nEarly Origins of the Holgate family\n\nLoading...\n\nEarly History of the Holgate family This web page shows only a small excerpt of our Holgate research. Another 59 words (4 lines of text) covering the years 1525, 1481, 1555, 1545, 1554, 1481, 1549, 1524 and 1537 are included under the topic Early Holgate History in all our PDF Extended History products and printed products wherever possible.\n\nLoading...\n\nHolgate Spelling Variations Before English spelling was standardized a few hundred years ago, spelling variations of names were a common occurrence. Elements of Latin, French and other languages became incorporated into English through the Middle Ages, and name spellings changed even among the literate. The variations of the surname Holgate include Holgate, Holdgate, Howgate, Hogate and others.\n\nLoading...\n\nEarly Notables of the Holgate family (pre 1700) Notables of the family at this time include Robert Holgate or Holdegate (c. 1481-1555), English Bishop of Llandaff and then Archbishop of York (1545-1554.) He recognized Henry VIII as head of the Church of England. \"He was the youngest son of Thomas Holgate and Elizabeth, daughter of Robert Champernowne, came of a Yorkshire family entitled to armorial bearings, and was born probably at Hemsworth, near Pontefract, in or about 1481, being, according to his own statement, sixty-eight years old in 1549. He was a canon of the order of St. Gilbert of Sempringham, and was probably educated in the house belonging...\n\nAnother 106 words (8 lines of text) are included under the topic Early Holgate Notables in all our PDF Extended History products and printed products wherever possible.\n\nHolgate Ranking In the United States, the name Holgate is the 16,133rd most popular surname with an estimated 2,487 people with that name. [8]\n\nLoading...\n\nHolgate migration to the United States + A great wave of immigration to the New World was the result of the enormous political and religious disarray that struck England at that time. Families left for the New World in extremely large numbers. The long journey was the end of many immigrants and many more arrived sick and starving. Still, those who made it were rewarded with an opportunity far greater than they had known at home in England. These emigrant families went on to make significant contributions to these emerging colonies in which they settled. Some of the first North American settlers carried this name or one of its variants:\n\n\n\nHolgate Settlers in United States in the 17th Century Martha Holgate, who landed in Virginia in 1664 [9]\n\nJames Holgate, who landed in Philadelphia, Pennsylvania in 1685 [9] Holgate Settlers in United States in the 18th Century William Holgate, who settled in New England in 1748 Holgate Settlers in United States in the 19th Century Ann Holgate, aged 15, who arrived in New York in 1864 [9]\n\nJohn Holgate, aged 7, who arrived in New York in 1864 [9]\n\nMary Holgate, aged 13, who arrived in New York in 1864 [9]\n\nSeth Holgate, who landed in New York in 1864 [9]\n\nWilliam Holgate, aged 47, who landed in New York in 1864 [9]\n\n... (More are available in all our PDF Extended History products and printed products wherever possible.)\n\nHolgate migration to Australia +\n\n\n\nHolgate Settlers in Australia in the 19th Century Mr. John Holgate, English convict who was convicted in Essex, England for 14 years, transported aboard the \"Fairlie\" on 14th October 1833, arriving in New South Wales, Australia [10]\n\nMr. James Holgate, (b. 1807), aged 28, English farm servant who was convicted in London, England for life for house breaking, transported aboard the \"England\" on 6th June 1835, arriving in New South Wales, Australia, he died in 1886 [11]\n\nMr. John Holgate, (b. 1803), aged 32, British convict who was convicted in London, England for life for theft, transported aboard the \"England\" on 6th June 1835, arriving in New South Wales, Australia [11]\n\nMr. James Holgate, English convict who was convicted in Preston, Lancashire, England for 7 years transported aboard the \"Forfarshire\" on 24th June 1843, arriving in Tasmania (Van Diemen's Land) [12] Emigration to Australia followed the First Fleets of convicts, tradespeople and early settlers. Early immigrants include:\n\nContemporary Notables of the name Holgate (post 1700) + Stephen Holgate (1971-2021), English professional rugby league footballer who played in the 1990s and 2000s for England and Cumbria\n\nSidney Holgate (1918-2003), English mathematician at the University of Durham\n\nSharon Ann Holgate Ph.D., English Freelance Science Writer and Broadcaster and Visiting Fellow in Physics and Astronomy at Sussex University\n\nSir Stephen T. Holgate CBE (b. 1947), British physician who specializes in immunopharmacology, respiratory medicine and allergies, and asthma and air pollution, based at the University of Southampton\n\nHarold Norman \"Harry\" Holgate AO (1933-1997), Australian Labor Party politician, 36th Premier of Tasmania (1981-1982), Speaker of the Tasmanian House of Assembly (1975-1976)\n\nStephen Holgate (b. 1953), Australian composer\n\nEdwin Headley Holgate (1892-1977), Canadian painter, who was briefly a member of the \"Group of Seven\" in 1931\n\nJames Holgate, American politician, Member of Pennsylvania State House of Representatives from Philadelphia County, 1868-69, 1879-80 [13]"}, {"url": "http://www.tudorplace.com.ar/Bios/RobertHolgate.htm", "page_content": "Robert H OLGATE (Archbishop of York)\n\nDied: 15 Nov 1555\n\nBuried: Church of St. Sepulchre, Holborn, London\n\nEmerges from obscurity in 1537 as Bishop of Llandaff and Master of Semperingham, home of the Gilbertine Order, and of whom it was said, a great favourite at court. He was also Lord President of the Council in the North.\n\nHe left this Bishopric to become Archbishop of York in 1545 becoming the first Protestant Archbishop of York and also the first to be married. When Henry VIII died in 1547, Robert Holgate saw the Minster stripped of half its clergy and much of its treasure under Edward VI .\n\nHe acquired much wealth, land and property, stretching from Pickering and East Yorkshire to Hemsworth. Holgate was born in Hemsworth and did not forget his native village. He left an endownment the \"Holgate Trust\" which to this day controls the Hemsworth Holgate Alms House in Robin Lane, Hemsworth. The Alms House Trust was made for the upkeep of a number of men and women of the Protesant persuasion. Holgate also left money for school at Hemsworth, York and old Malton. In May 1548 the Archbishop, by deed poll, prescribed the rules and ordinances of the Hemsworth School.\n\nHe was President of the Council in the North, but proved unable to deal with the Seamer rebellion in Aug 1549, nad was replaced by Francis Talbot, Earl of Shrewsbury . He later claimedthat it was John Dudley, Earl of Warwick who '... touke such displeasure with me that... he put me firth of the rowme of the President...'.\n\nAs the Reformation progressed and Edward VI died, his sister, the Catholic Mary assumed the throne in 1553, and Robert Holgate, to quote from the York Minster Chronicle, quickly shed his wife and his Protestant faith to save his skin.\n\nIn 1554 he was deprived of his title, and in 1555 Robert Holgate, Archbishop of York, endowed a Hospital in Hemsworth by Will."}, {"url": "https://alchetron.com/Robert-Holgate", "page_content": "Robert Holgate (1481/1482 – 1555) was the Catholic Bishop of Llandaff and then Archbishop of York (from 1545 to 1554). He later recognised Henry VIII as head of the Church of England.\n\nAlthough a protege of Thomas Cromwell, 1st Earl of Essex, Holgate had a career in the Gilbertine Order of which he became master. Most of the Gilbertine houses were lesser establishments which should have been dissolved under the Suppression of Religious Houses Act 1535 (only four out of twenty-six houses had revenues over £200 a year). However, Holgate is credited with using his influence to save them for a few years. For example, Malton Priory, one of the lesser Gilbertine houses, was the last of them to surrender in December 1539, whereas Sempringham Priory, worth more than £200 a year, surrendered in 1538.\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This may however have been a second marriage to make it fully legal, and Holgate and Wentworth may have first married in late 1547 with Roger Tongue officiating. In 1551 Anthony Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne she imprisoned Holgate on various charges, with his being a married clergy being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\nIn 1558 a Robert Holgate from Yorkshire entered the University of Cambridge. He may have been a son of Holgate, since there are some claims he had two children by Barbara, but there is no conclusive evidence on the matter."}, {"url": "https://findingaids.library.northwestern.edu/agents/people/1587", "page_content": "Dates\n\nExistence: 1859 - 1945\n\nBiography\n\nThomas Franklin Holgate was born on April 8, 1859, in Hastings County, Ontario, Canada, the son of Thomas and Eleanor Wright Holgate. He received a Bachelor of Arts degree from Victoria College, University of Toronto, in 1884, and a Master's degree, in absentia, from the same institution in 1889. Holgate came to Northwestern University in 1893 as a mathematics professor. He served as Dean of the College of Liberal Arts for 17 years and two terms as acting president of the University.\n\n\n\nHolgate began his professional teaching career in 1874, teaching in the public school system of Ontario. Upon graduation from college in 1884, he became a mathematics master (instructor) at Albert College, Belleville, Ontario. He remained in this position until 1890 when he became a fellow at Clark University in Worcester, Massachusetts. He received a Ph.D. from Clark University in 1893. He joined the Northwestern University faculty in 1893 as an instructor in the Mathematics Department. During the year, he became involved in the activities of the first International Congress of Mathematicians held in conjunction with the Chicago Columbian Exposition of 1893. He also devoted considerable attention to the preparation of a series of Colloquium Lectures by Felix Klein held in Evanston following the Congress.\n\n\n\nIn 1894, after only one year at Northwestern, he was made a full professor. In 1897, he played an instrumental role in the formation of the Chicago section of the American Mathematical Society and served as Secretary from 1897 to 1905. In 1902, he was appointed Dean of the College of Liberal Arts, a position he held for the next seventeen years.\n\n\n\nIn 1904, following the resignation of President Edmund James, Holgate was appointed President Ad Interim of Northwestern University. He served in this capacity until the selection of Abram Harris as President in 1906. During his first two-year term as acting president, the Norman Harris Lecture Foundation was established, a department of education was added to the College of Liberal Arts, a training school for nurses was established, the geology, zoology, and romance language departments were enlarged, the athletic field on Central Street was opened, and the University was able to pay off a quarter-million-dollar debt. Additionally, he served as Secretary for the Louisiana Purchase Exposition held in St. Louis in 1904.\n\n\n\nBetween 1906 and 1916, Holgate held the Noyes Professorship of Pure Mathematics, secured legislation for revision and codification of the Illinois school laws, traveled to Rome where he was Secretary/Delegate to the International Congress of Mathematicians in 1908, and was a member of a commission to reorganize the Chicago Public Library.\n\n\n\nIn 1916, with the resignation of Abram Harris, Holgate was once again called upon to serve as acting president of the University. As acting president from 1916 to 1919, Holgate instituted democratic reforms in the selection of deans; Northwestern was elected to membership in the Association of American Universities; the Law School's course of study was lengthened to four years; degree courses in physical education and public speaking were installed; student military training was established on campus; and 3,600 soldiers and sailors were trained in mechanical subjects as part of the University's commitment to the United States' war effort.\n\n\n\nDuring World War I, Holgate assisted Walter Dill Scott in personnel work for the War Department. He was also influential in the formation of the North Central Association of Colleges and Secondary Schools and served as President from 1917 to 1918.\n\n\n\nIn 1919, with the selection of Lynn Harold Hough as President of the University, Holgate retired from his major administrative duties and was made Dean Emeritus of the College of Liberal Arts. He continued, however, to teach mathematics for the next fifteen years, retiring in 1934. He spent the 1921-,22 academic year in China as a visiting professor at the University of Nanking. His experiences in China served to reinforce an interest in foreign students and he acted as their advisor upon his return to Northwestern.\n\n\n\nHolgate's research interests were in the fields of pure geometry and ruled surfaces of the fourth order. His translation of Theodore Reye's Geometrie der Lage (Geometry of Position) was published in 1898. His other published works include Elementary Geometry (1901) and Projective Pure Geometry (1930). He also wrote a “History of the Mathematics Department at Northwestern University, 1855-1905,” and a thirty-page summary of Northwestern University's activities during World War I, “Northwestern in the Great War.”\n\n\n\nHolgate received honorary Doctor of Law degrees from the University of Illinois in 1905, Queen's University in 1919, and Northwestern University in 1937. He was a fellow of the American Association for the Advancement of Science and a member of the University Club of Evanston, the University Club of Chicago, Phi Beta Kappa, and Sigma Xi.\n\n\n\nIn addition to his university activities, Holgate was prominent in civic and religious affairs and was particularly concerned with administrative problems of the Methodist Episcopal Church. He served five terms as a member of the Methodist Church's General Conference; was a member of its Board of Education for Negroes; and from 1924 to his death in 1945, was a member of the church's Board of Education, serving as its treasurer from 1934 to 1938. From 1923 to 1925, he was president of the Chicago Church Federation. In recognition of his support of educational opportunities for black students, the library at Bennett College in North Carolina was named for him.\n\n\n\nDean Holgate was married twice. On August 2, 1885, in Bath, Ontario, Canada, he married Julia Caroline Sharp, the daughter of a local farmer, John Sharp. She died in 1887. His second marriage to Georgina Angela Burdette, the daughter of Daniel Burdette, a. manufacturer, took place in Newburgh, Ontario, Canada, July 23, 1890. The Holgates had four children: Eleanor, born in 1894, who later married the noted scholar, Owen Lattimore; Robert Burdette, born in 1895; Barbara (Mrs. George H. Young), born in 1899, and Frances Burdette, born in 1902.\n\n\n\nThomas Franklin Holgate died of a heart ailment in Evanston at the age of 86 on April 11, 1945. Funeral services were held on April 13, 1945 at the First Methodist Church of Evanston.\n\n\n\nDespite the fact that his formal title was that of President Ad Interim, Holgate was one of the most accomplished, significant, and influential administrators in Northwestern's history, and enjoyed an extraordinarily long and productive academic career, while maintaining an avid interest in foreign, civic and religious affairs.\n\nFound in 1 Collection or Record:"}, {"url": "https://wiki2.org/en/Robert_Holgate", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nEnglish Anglican bishop (died 1555)\n\nRobert Holgate (1481/1482 – 1555) was Bishop of Llandaff from 1537 and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as head of the Church of England.\n\nAlthough a protege of Thomas Cromwell, 1st Earl of Essex, Holgate had a career in the Gilbertine Order of which he became master. He was briefly Prior of Watton until the priory was dissolved in 1539. Most of the Gilbertine houses were lesser establishments which should have been dissolved under the Suppression of Religious Houses Act 1535 (only four out of twenty-six houses had revenues over £200 a year). However, Holgate is credited with using his influence to save them for a few years. For example, Malton Priory, one of the lesser Gilbertine houses, was the last of them to surrender in December 1539,[1] whereas Sempringham Priory, worth more than £200 a year, surrendered in 1538.[2]\n\nHolgate was consecrated as Bishop of Llandaff on 25 March 1537. He translated to York on 16 January 1545. At York in 1546, he founded a school, now called Archbishop Holgate's School.\n\nHe was President of the Council of the North from 1538.[3]\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This might, however have been a second wedding to make it fully legal, and Holgate and Wentworth might have first married in late 1547 with Roger Tongue officiating.[4] In 1551 Anthony Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne. She imprisoned Holgate on various charges, with his being a married cleric being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.[5]\n\nIn 1558 a Robert Holgate from Yorkshire entered the University of Cambridge. He may have been a son of Holgate, since there are some claims he had two children by Barbara, but there is no conclusive evidence on the matter.\n\nYouTube Encyclopedic\n\n1 / 2 Views: 631 1 724\n\nMy Australia: Australian Parliament\n\nLiving, Studying and all things fun in Canberra from an International Students Perspective Transcription\n\nReferences\n\nThis article contains public domain text from William Page's Houses of the Gilbertine order: The priory of Sempringham, A History of the County of Lincoln: Volume 2 (1906)\n\nArchbishop Holgate's School\n\nH.L. Parish, ‘Holgate, Robert (1481/2–1555)’, Oxford Dictionary of National Biography, Oxford University Press, 2004, accessed 5 June 2007"}, {"url": "https://stirnet.com/genie/data/british/hh4bz/holgate1.php", "page_content": "\n\n'Holgate1' Index links to: Lead / Letter\n\nFamilies covered: Holgate of Stapleton, Holgate of Walden\n\nRobert Holgate\n\nm. Isabel Marshall (dau of William Marshall of Pickering)\n\n1. Thomas Holgate\n\nm. Jane Brown (dau of William Brown)\n\nA. John Holgate\n\nm. Elizabeth Thornton (dau of John Thornton)\n\ni. Thomas Holgate\n\nm. Elizabeth Champernoun (dau of Thomas Champernoun)\n\na. John Holgate\n\n(1) Henry Holgate\n\nm. Mary Jackson of Snydal\n\n(A) Thomas Holgate\n\nm1. Isabel Butler (dau/heir of Henry Butler of Pontefract)\n\n(i)+ issue - Henry, Robert\n\nm2. Mary Power (dau/heir of Henry Power of Beverley)\n\n(iii) Thomas Holgate of Stapleton\n\nFMG shows that Thomas dsp but adds a note that one source suggests that he was bur 29.04.1601 \"having had three sons and two daughters. His issue survived for three generations\".\n\n(iv)+ other issue - Edward (bur 17.08.1591), Bartholomew\n\n(B) William Holgate\n\nb. Edward Holgate\n\nc. Robert Holgate, Archbishop of York (b 1481-2, d 1555)\n\nWikipedia (\"Robert Holgate\") shows Robert's dates and suggests that he had the following family. This got him into trouble when Queen Mary came to the throne.\n\nm. (1547/1550) Barbara Wentworth (b c1525)\n\n(1)+ issue - Robert, child\n\nd. Elizabeth Holgate\n\n## FMG shows this as the Elizabeth who m. Thomas Nettleton of Thornhill (a 1420) but we show her below as of an earlier generation.\n\nii. Richard Holgate\n\nm. Ursula Champernoun (dau of Thomas Champernoun)\n\niii. Anne Holgate\n\nm. Robert Radcliffe\n\niv. Ursula Holgate\n\nm. Alexander Bowles\n\nv. Mabel Holgate\n\nm. Anthony Brae\n\nB. Edward Holgate\n\nm. Jane Reynerson (dau of Francis Reynerson)\n\nC. Anne Holgate\n\nm. Thomas Methley of Methley\n\nD. Elizabeth Holgate see ## above\n\n2. John Holgate\n\nm. Ann Dalison of Lincolnshire\n\n3. Margaret Holgate\n\nm. Robert Hansard of Walworth\n\n\"of the family of Robert Holgate, Archbishop of York and Lord President of the North, who lived anno 1544\" was ...\n\nWilliam Holgate of Clavering, Essex\n\n1. William Holgate of Walden, Essex (b 1557-8, d 01.08.1630)\n\nm. Lettice Bawcock (b c1562, d 27.03.1629)\n\nA. William Holgate of Great Bradfield, Essex\n\ni. William Holgate (b c1618, d 1634)\n\nB. John Holgate of Walden (a 1626, d 05.05.1673, of the Middle Temple, 6th/youngest son)\n\nm1. Anne Plomor (dau of Richard Plomor of Walden)\n\ni. William Holgate of Walden (d 31.08.1672, of the Outer Temple, 2nd son)\n\na. William Holgate of Walden (b c1670-1, d 25.01.1717)\n\nm1. Mary Baldwine (dau of Ralph Baldwine of Ashwell)\n\n(1) John Holgate of London (b 10.07.1693, d 1738)\n\n(A) Charles William Holgate (b 05.05.1721)\n\nm. Mary Kentish of Baldock\n\n(i) Ann Holgate (b 03.04.1732, d 1817)\n\n(ii)+ other issue (dvpsp)\n\n(B)+ other issue - John (b 26.04.1724), Mary (b 02.05.1725)\n\n(2) Mary Holgate (d 23.11.1724)\n\nm. William Lekeux of London\n\nm2. Susan Stubbin of Essex\n\n(3)+ other issue - William (a 1730), Thomas (a 1730), Anne\n\nb. Anne Holgate (a 1730)\n\nm. Thomas Cooke (a 1730, vicar in London)\n\nc.+ other issue (d unm) - John (b c1656, a 1664), Lettice\n\nii.+ other issue - John (b c1632, a 1634), Lettice (d unm)\n\nm2. Mary Wood (dau of William Wood of Battles)\n\niv. Robert Holgate (dsp)\n\nv. Anne Holgate (d 05.01.1685)\n\nm. James Monteth of Greenwich, Kent (b 1632-3, d 21.09.1681, \"of the ancient family of Monteth in Scotland\")\n\nC. Jane Holgate (2nd dau)\n\nm. John Gibbs of Walden"}, {"url": "https://commons.wikimedia.org/wiki/File:Robertholgate.jpg", "page_content": "one or moreThis may be due to recognition of the \" sweat of the brow \" doctrine, allowing works to be eligible for protection through skill and labour, and not purely by originality as is the case in the United States (where this website is hosted). These claims may or may not be valid in all jurisdictions. As such, use of this image in the jurisdiction of the claimant or other countriesbe regarded as. Please see Commons:When to use the PD-Art tag for more information.\n\nWhile Commons policy accepts the use of this media,\n\nPermission\n\n(Reusing this file)"}], "Robert Holgate served as Archbishop of York.": [{"url": "http://www.historyofyork.org.uk/themes/tudor-stuart/robert-holgate-archbishop", "page_content": "1545AD - 1554AD\n\nRobert Holgate from a Yorkshire family, was educated in Cambridge and entered the Gilbertine order as a canon. He played an important role in the life of the community before the Dissolution of the Monasteries.\n\nConsidered to be a protégé of Thomas Cromwell, Holgate was appointed president of the Council in the North in 1538, a post he held for 11 years. He lived in the house of the former abbot of St Mary’s Abbey in York, which has survived as King’s Manor.\n\nFollowing the death of Archbishop Lee in September 1544, Holgate was named his successor and was consecrated as Archbishop of York at Lambeth in January 1545, renouncing papal authority.\n\nFrom then, the tenets of Protestant theology were regularly expounded in the Minster for the first time, and organ music was abolished. He instructed that the Minster Library be furnished with new Protestant commentaries on the Bible by theologians like Calvin.\n\nArchbishop Holgate founded three grammar schools in 1546, one at his birthplace of Hemsworth in the West Riding, one at Old Malton and one in York. He required his headmasters to be skilled in Hebrew, Greek and Latin and to take his pupils to the Minster on Sundays.\n\nIn order to prove his Protestantism to the sceptical Duke of Northumberland, in 1550, aged 68, the Archbishop took a bride when he was 68 – local gentlewoman Barbara Wentworth. This was a year after an Act of Parliament removed the duty of celibacy from the English clergy.\n\nBut when Queen Mary came to the throne in 1553 and returned England to Catholicism, Holgate was sent to the Tower then stripped of his post for breaking his vow of celibacy.\n\nHaving paid the crown £1,000 for his ‘crimes’ Holgate was set free in January 1555 only to die that November in London."}, {"url": "http://www.historyofyork.org.uk/directory/tudor-stuart/robert-holgate-archbishop", "page_content": "Robert Holgate from a Yorkshire family, was educated in Cambridge and entered the Gilbertine order as a canon. He played an important role in the life of the community before the Dissolution of the Monasteries.\n\nConsidered to be a protégé of Thomas Cromwell, Holgate was appointed president of the Council in the North in 1538, a post he held for 11 years. He lived in the house of the former abbot of St Mary’s Abbey in York, which has survived as King’s Manor.\n\nFollowing the death of Archbishop Lee in September 1544, Holgate was named his successor and was consecrated as Archbishop of York at Lambeth in January 1545, renouncing papal authority.\n\nFrom then, the tenets of Protestant theology were regularly expounded in the Minster for the first time, and organ music was abolished. He instructed that the Minster Library be furnished with new Protestant commentaries on the Bible by theologians like Calvin.\n\nArchbishop Holgate founded three grammar schools in 1546, one at his birthplace of Hemsworth in the West Riding, one at Old Malton and one in York. He required his headmasters to be skilled in Hebrew, Greek and Latin and to take his pupils to the Minster on Sundays.\n\nIn order to prove his Protestantism to the sceptical Duke of Northumberland, in 1550, aged 68, the Archbishop took a bride when he was 68 – local gentlewoman Barbara Wentworth. This was a year after an Act of Parliament removed the duty of celibacy from the English clergy.\n\nBut when Queen Mary came to the throne in 1553 and returned England to Catholicism, Holgate was sent to the Tower then stripped of his post for breaking his vow of celibacy.\n\nHaving paid the crown £1,000 for his ‘crimes’ Holgate was set free in January 1555 only to die that November in London."}, {"url": "https://www.yorkpress.co.uk/news/17223886.meet-archbishop-robert-holgate-founder-archbishop-holgates-school/", "page_content": "Robert Holgate and the restored Archbishop Holgate’s Grammar School playing field gates\n\nLocation of plaque: on the restored gates in Bridge Lane, off Wigginton Road near York Hospital\n\nTHINGS are a little bit different now. But back in Tudor times it wasn't the done thing for a priest who had taken a vow of chastity to suddenly decide to get married.\n\nRobert Holgate wasn't just any priest: he was the Archbishop of York and President of the King's Council in the North. When he married in 1550, at the age of 68, it caused quite a scandal - particularly in conservative northern Church circles.\n\nHe got away with it during the reign of the young, and Protestant, King Edward VI, Henry VIII's son. But when Edward died at the age of 15 in 1553 and his Catholic sister Mary succeeded him, Robert quickly found himself in hot water.\n\nHe was imprisoned in the Tower of London for 'divers offences' - most notably getting married after having taken a vow of chastity.\n\nStripped of all his offices, he apologised to the Queen, and was eventually released in 1555 on payment of a huge fine. It did him little good - he died ten months later, clearly a broken man.\n\nRobert's career was typical of many statesmen in Tudor times. Like Cardinal Wolsey, he rose to dizzying heights, only to fall quickly from grace when he offended the ruling monarch.\n\nHis name survives in York, however, because of something he did while at the height of his power in York.\n\nHolgate had bought the Treasurer's House and other property in Minster Close.\n\nIn 1546, he founded three schools - one in York, one in Hemsworth, and one in Old Malton. The York school was in Ogleforth 'close by the cathedral' and, like other early grammar schools in England, was intended to train students for the church. The curriculum included Latin, Greek and Hebrew with some history, geography and maths but with the emphasis firmly on religious and moral education. Discipline is said to have been severe - as it was for poor Archbishop Robert himself once Queen Mary came to the throne.\n\nThe school survived the Archbishop's fall from grace, however. More than 200 years after his death, an advert in the York Courant in December 1799 stated that: \"The Free Grammar School situate within the Close of the Cathedral Church of York founded by Archbishop Holgate for the Instruction of Youth ... will open again after the Christmas recess on Monday, January 20, 1800.\"\n\nLike other grammar schools Archbishop Holgate's struggled for pupils in the early 1800s: it had just 10 in 1818, and 17 in 1824.\n\nThen, in 1845-6, the York Diocesan School Society built a new training college (St John's College) on Lord Mayor's Walk. A new school, the Yeoman School, was built next door. Opened in 1846 this was intended to cater for the 'middle class children' of agriculturalists, as well as to provide teaching practice for student teachers at St John's.\n\nThe new school ran into financial difficulties, however, and in 1858, after 300 years in Ogleforth, Archbishop Holgate's School took it over.\n\nThe iron gates to the school's playing fields seem to have been designed between 1850 and 1860 by George Townsend Andrews, the architect who had designed St John's College itself. They were made by the Walmgate-based Walker Iron Foundry, which also made railings and gates for the British Museum, as well as others across York, including in St Leonard's Place, York Cemetery, Dean's Park and at St Peter's School.\n\nArchbishop Holgate's School thrived in its new location in Lord Mayor's Walk. By 1915, when the Rev William Johnson retired as headmaster, the school had 294 pupils.\n\nBy then, the school had leased part of Bootham Stray for playing fields, which is why the school playing field gates - which were restored in 2017 by York Civic Trust working with York Hospital - are there to this day.\n\nThe school itself moved to its present site on Hull Road in 1963.\n\nStephen Lewis\n\nFor the stories behind more York Civic Trust plaques, visit yorkcivictrust.co.uk"}, {"url": "https://discovery.nationalarchives.gov.uk/details/c/F31981", "page_content": "This website uses cookies\n\nWe place some essential cookies on your device to make this website work.\n\n\n\nWe'd like to use additional cookies to remember your settings and understand how you use our services.\n\n\n\nThis information will help us make improvements to the website."}, {"url": "https://www.archbishopofyork.org/archbishop-york/previous-archbishops-york", "page_content": "Notable Archbishops\n\nLearn more about some of the previous Archbishops of York:\n\nLancelot Blackburne 1724-1743\n\nDuring the 1680's and following his ordination, Lancelot went to the West Indies and obtained a position as a ship's chaplain. He received a payment of £20 for discharging his duties diligently. The payment, a considerable sum at the time, was due to the fact he was aboard a privateer (pirate ship!)\n\nCardinal Thomas Wolsey 1514-1530\n\nOne of the most unusual Archbishops of York as he never came to the city! After failing to negotiate a divorce for Henry VIII with the Pope, he travelled to Cawood Castle and spent the night there prior to his enthronement. Thomas Wolsey had been the Archbishop of York for 16 years without ever so much as visiting York, but when he finally travelled to York he was arrested the morning of his enthronement by Henry VIII men. He died on his return to London in the custody of the King's men.\n\nRichard le Scrope 1398-1405\n\nBeheaded on the Knavesmire following his trial for treason in the Great Hall during Henry IV reign. He asked the executioner to strike him five times with the sword. Each strike was to represent the five wounds on Christ's body on the cross. Richard Le Scrope was interred at York Minster.\n\nEdward Venables Vernon Harcourt (1807-1847) and Walter de Grey (1215-1255) were also notable as each served for a period of 40 years."}, {"url": "https://archbishopholgates.academy/our-school/our-vision-values-care-achievement/our-history/", "page_content": "Archbishop Holgate’s School was founded by one of the leading statesmen of the reign of King Henry VIII. Robert Holgate held absolute political power in the North, running the King’s Council in the North Parts from the King’s Manor, raising armies to subdue the Scots, and operating with the authority of the King himself. In 1545, Henry VIII made him Archbishop of York, thereby complementing Holgate’s political authority with the authority of one of the two leading roles in the Church of England, and cementing his position of absolute supremacy (second only to the King himself) in matters spiritual and temporal north of the Trent. Very soon after he was enthroned as Archbishop of York Holgate he founded a number of schools, ours included. Holgate took a close personal interest in the organisation of each school; his own signature lies at the bottom of each of the twenty-four pages of each of the three surviving copies of our school’s Foundation Deed. Holgate then fell from grace politically, but remained Archbishop of York, a role he fulfilled vigorously until 1554.\n\nThe original school site, between Ogleforth and the City Walls, was on land in the shadow of York Minster owned by Holgate himself. Links between Church and School have remained strong. Indeed, the story of the school over more than four and a half centuries has been intertwined with the story of successive Archbishops of York. No school in the country has more distinguished links with the Church of England than ours, including successive Archbishops appointing Foundation Governors and themselves serving as Foundation Governors of the school. Archbishop Sentamu and the Dean of the Minster (along with the Bishop of Whitby) serve as Members of Pathfinder Trust (to which AHS belongs) and the Archbishop has also appointed one of our Foundation Governors to serve as a Lay Canon on Chapter, the Governing Body of York Minster.\n\nThere are only two hundred or so Church of England secondary schools in the country, four in the Diocese of York. The other three being Manor CE Academy, All Saints’ VA School, Ingleby Barwick, Middlesborough, opened as new build in 2003; and Archbishop Sentamu, Hull, which became an Academy in 2008. Indeed in April 2011 both Archbishop’s and Manor converted to Academy status and All Saints and Sentamu Academy have since followed. Both Manor (HOPE) and Sentamu (SALT) have formed Multi Academy Trusts and in September 2016 Archbishop Holgate’s was one of the four founding schools of Pathfinder Multi Academy Trust. Our Christian foundation, which continues to remain at the heart of all we do as an Academy, as part of a Teaching School and as part of a Multi Academy Trust, gives the school an extra dimension, an additional facet, embedding our distinctiveness. Our Church status does not provide a context for evangelising; those committed to the Christian path will, on the other hand, find many ways in which their faith can find expression through the corporate values of the school."}, {"url": "http://www.tudorplace.com.ar/Bios/RobertHolgate.htm", "page_content": "Robert H OLGATE (Archbishop of York)\n\nDied: 15 Nov 1555\n\nBuried: Church of St. Sepulchre, Holborn, London\n\nEmerges from obscurity in 1537 as Bishop of Llandaff and Master of Semperingham, home of the Gilbertine Order, and of whom it was said, a great favourite at court. He was also Lord President of the Council in the North.\n\nHe left this Bishopric to become Archbishop of York in 1545 becoming the first Protestant Archbishop of York and also the first to be married. When Henry VIII died in 1547, Robert Holgate saw the Minster stripped of half its clergy and much of its treasure under Edward VI .\n\nHe acquired much wealth, land and property, stretching from Pickering and East Yorkshire to Hemsworth. Holgate was born in Hemsworth and did not forget his native village. He left an endownment the \"Holgate Trust\" which to this day controls the Hemsworth Holgate Alms House in Robin Lane, Hemsworth. The Alms House Trust was made for the upkeep of a number of men and women of the Protesant persuasion. Holgate also left money for school at Hemsworth, York and old Malton. In May 1548 the Archbishop, by deed poll, prescribed the rules and ordinances of the Hemsworth School.\n\nHe was President of the Council in the North, but proved unable to deal with the Seamer rebellion in Aug 1549, nad was replaced by Francis Talbot, Earl of Shrewsbury . He later claimedthat it was John Dudley, Earl of Warwick who '... touke such displeasure with me that... he put me firth of the rowme of the President...'.\n\nAs the Reformation progressed and Edward VI died, his sister, the Catholic Mary assumed the throne in 1553, and Robert Holgate, to quote from the York Minster Chronicle, quickly shed his wife and his Protestant faith to save his skin.\n\nIn 1554 he was deprived of his title, and in 1555 Robert Holgate, Archbishop of York, endowed a Hospital in Hemsworth by Will."}, {"url": "https://archbishopholgates.academy/our-school/about-us/history-of-our-school/", "page_content": "Archbishop Holgate’s School was founded by one of the leading statesmen of the reign of King Henry VIII. Robert Holgate held absolute political power in the North, running the King’s Council in the North Parts from the King’s Manor, raising armies to subdue the Scots, and operating with the authority of the King himself. In 1545, Henry VIII made him Archbishop of York, thereby complementing Holgate’s political authority with the authority of one of the two leading roles in the Church of England, and cementing his position of absolute supremacy (second only to the King himself) in matters spiritual and temporal north of the Trent. Very soon after he was enthroned as Archbishop of York Holgate he founded a number of schools, ours included. Holgate took a close personal interest in the organisation of each school; his own signature lies at the bottom of each of the twenty-four pages of each of the three surviving copies of our school’s Foundation Deed. Holgate then fell from grace politically, but remained Archbishop of York, a role he fulfilled vigorously until 1554.\n\nThe original school site, between Ogleforth and the City Walls, was on land in the shadow of York Minster owned by Holgate himself. Links between Church and School have remained strong. Indeed, the story of the school over more than four and a half centuries has been intertwined with the story of successive Archbishops of York. No school in the country has more distinguished links with the Church of England than ours, including successive Archbishops appointing Foundation Governors and themselves serving as Foundation Governors of the school. Other Foundation Governors include a senior Canon Residentiary of York Minster, and a senior representative from York St John University.\n\nThere are only two hundred or so Church of England secondary schools in the country, four in the Diocese of York. The other three being Manor CE Academy, All Saints’ VA School, Ingleby Barwick, Middlesborough, opened as new build in 2003; and Archbishop Sentamu, Hull, which became an Academy in 2008. Indeed in April 2011 both Archbishop’s and Manor converted to Academy status and All Saints and Sentamu Academy have since followed. Both Manor (HOPE) and Sentamu (SALT) have formed Multi Academy Trusts and in September 2016 Archbishop Holgate’s was one of the four founding schools of Pathfinder Multi Academy Trust. Our Christian foundation, which continues to remain at the heart of all we do as an Academy, as part of a Teaching School and as part of a Multi Academy Trust, gives the school an extra dimension, an additional facet, embedding our distinctiveness. Our Church status does not provide a context for evangelising; those committed to the Christian path will, on the other hand, find many ways in which their faith can find expression through the corporate values of the school."}, {"url": "https://maltonians.maltonschool.org/people/holgate.php", "page_content": "Illustrated here is the church at Darrington, near Pontefract. Archbishop Holgate's heir was his nephew, Thomas Holgate, who acquired the manor of Stapleton in the parish of Darrington. Several Holgate tombstones are here.\n\nROBERT HOLGATE died on 15th November, 1555 at the Headhouse of the Master of Sempringham, a Gilbertine Order of which he had himself been Master. In his Will he asked that his body should \"be buried in the parish church within the parish whereof it shall please Almighty God to take me out of this transitory life\". The Headhouse stood in Cow Lane, Smithfield, and within the parish of St. Sepulchre. \" The bells of Old Bailey\" are the bells of this Church which stands at the junction of Giltspur Street and Holborn Viaduct.\n\nSir William Petre was one of the four executors of Holgate's will. He was born c.1505 at Torbryan, in Devon, and educated at Oxford of which university he became Doctor of Law in 1533. For a time he was tutor to a brother of Anne Boleyn. By 1544 Henry VIII had made Petre a knight, a privy councillor, and one of his two Principal secretaries. He served Henry, Edward, Mary and Elizabeth. The original painting is at Ingatestone Hall in Essex.\n\nAdvert for Malton Free Grammar School\n\nAn illustration of a bill advertising the Grammar School at Old Malton. The illustration is taken from a book by Dr J S Purvis, Director of the Borthwick Institute of Historical Research in 1960, entitled \"Historical Records\"\n\nThe illustration was on the front of the menu for the Holgate Society dinner at Brown's Hotel, 28th October 1960.\n\nA transcription:\n\nThis is to give NOTICE,That at Old Malton Free Grammar School, YOUTH are completely qualified for any manner of Bufinefs, in Latin, Greek &c. Alfo Arithmetic in all its Parts, Navigation, Menfuration, Merchants Accompts &c. and Writing in very Perfection, by JOSEPH KERR, Mafter. WILLIAM HALL, Affiftant.\n\nN. B. Old Malton is pleafantly fituated upon the River Derwent in the North-Riding of the County of York, in a fine plentiful Country: Board at Seven Pounds per Annum; Board and Learning, at Nine Guineas; Learning, Board, and Cloaths, found in a neat decent Manner, at the Expense of Twelve Pounds.\n\nThofe who are pleafed to encourage this SCHOOL, may depend upon fuch Exactnefs and Care, as will, in every Refpect, be confiftent with this publick Notice"}, {"url": "https://www.findagrave.com/memorial/112912649/robert-holgate", "page_content": "Archbishop of York\n\n\n\nRobert Holgate (1481/1482 – 1555) was Bishop of Llandaff and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as leader of the Church of England.\n\n\n\nHolgate, chaplain to Thomas Cromwell, 1st Earl of Essex, became master of the Gilbertine Order in 1536, and exerted his influence to prevent the surrender of the Gilbertine houses under the Act for the Suppression of the Smaller Monasteries in 1536 as only four out of twenty-six houses had revenues over £200 a year. In 1538, Holgate surrendered Sempringham Priory.\n\n\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This may however have been a second marriage to make it fully legal, and Holgate and Wentworth may have first married in late 1547 with Roger Tongue officiating. In 1551 Arthur Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne she imprisoned Holgate on various charges, with his being a married clergy being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\n\n\n\n\nArchbishop of York\n\n\n\nRobert Holgate (1481/1482 – 1555) was Bishop of Llandaff and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as leader of the Church of England.\n\n\n\nHolgate, chaplain to Thomas Cromwell, 1st Earl of Essex, became master of the Gilbertine Order in 1536, and exerted his influence to prevent the surrender of the Gilbertine houses under the Act for the Suppression of the Smaller Monasteries in 1536 as only four out of twenty-six houses had revenues over £200 a year. In 1538, Holgate surrendered Sempringham Priory.\n\n\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This may however have been a second marriage to make it fully legal, and Holgate and Wentworth may have first married in late 1547 with Roger Tongue officiating. In 1551 Arthur Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne she imprisoned Holgate on various charges, with his being a married clergy being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\n\n\n"}], "Robert Holgate served as Archbishop of York from 1545 until his death in 1555.": [{"url": "http://www.historyofyork.org.uk/themes/tudor-stuart/robert-holgate-archbishop", "page_content": "1545AD - 1554AD\n\nRobert Holgate from a Yorkshire family, was educated in Cambridge and entered the Gilbertine order as a canon. He played an important role in the life of the community before the Dissolution of the Monasteries.\n\nConsidered to be a protégé of Thomas Cromwell, Holgate was appointed president of the Council in the North in 1538, a post he held for 11 years. He lived in the house of the former abbot of St Mary’s Abbey in York, which has survived as King’s Manor.\n\nFollowing the death of Archbishop Lee in September 1544, Holgate was named his successor and was consecrated as Archbishop of York at Lambeth in January 1545, renouncing papal authority.\n\nFrom then, the tenets of Protestant theology were regularly expounded in the Minster for the first time, and organ music was abolished. He instructed that the Minster Library be furnished with new Protestant commentaries on the Bible by theologians like Calvin.\n\nArchbishop Holgate founded three grammar schools in 1546, one at his birthplace of Hemsworth in the West Riding, one at Old Malton and one in York. He required his headmasters to be skilled in Hebrew, Greek and Latin and to take his pupils to the Minster on Sundays.\n\nIn order to prove his Protestantism to the sceptical Duke of Northumberland, in 1550, aged 68, the Archbishop took a bride when he was 68 – local gentlewoman Barbara Wentworth. This was a year after an Act of Parliament removed the duty of celibacy from the English clergy.\n\nBut when Queen Mary came to the throne in 1553 and returned England to Catholicism, Holgate was sent to the Tower then stripped of his post for breaking his vow of celibacy.\n\nHaving paid the crown £1,000 for his ‘crimes’ Holgate was set free in January 1555 only to die that November in London."}, {"url": "http://www.historyofyork.org.uk/directory/tudor-stuart/robert-holgate-archbishop", "page_content": "Robert Holgate from a Yorkshire family, was educated in Cambridge and entered the Gilbertine order as a canon. He played an important role in the life of the community before the Dissolution of the Monasteries.\n\nConsidered to be a protégé of Thomas Cromwell, Holgate was appointed president of the Council in the North in 1538, a post he held for 11 years. He lived in the house of the former abbot of St Mary’s Abbey in York, which has survived as King’s Manor.\n\nFollowing the death of Archbishop Lee in September 1544, Holgate was named his successor and was consecrated as Archbishop of York at Lambeth in January 1545, renouncing papal authority.\n\nFrom then, the tenets of Protestant theology were regularly expounded in the Minster for the first time, and organ music was abolished. He instructed that the Minster Library be furnished with new Protestant commentaries on the Bible by theologians like Calvin.\n\nArchbishop Holgate founded three grammar schools in 1546, one at his birthplace of Hemsworth in the West Riding, one at Old Malton and one in York. He required his headmasters to be skilled in Hebrew, Greek and Latin and to take his pupils to the Minster on Sundays.\n\nIn order to prove his Protestantism to the sceptical Duke of Northumberland, in 1550, aged 68, the Archbishop took a bride when he was 68 – local gentlewoman Barbara Wentworth. This was a year after an Act of Parliament removed the duty of celibacy from the English clergy.\n\nBut when Queen Mary came to the throne in 1553 and returned England to Catholicism, Holgate was sent to the Tower then stripped of his post for breaking his vow of celibacy.\n\nHaving paid the crown £1,000 for his ‘crimes’ Holgate was set free in January 1555 only to die that November in London."}, {"url": "https://www.yorkpress.co.uk/news/17223886.meet-archbishop-robert-holgate-founder-archbishop-holgates-school/", "page_content": "Robert Holgate and the restored Archbishop Holgate’s Grammar School playing field gates\n\nLocation of plaque: on the restored gates in Bridge Lane, off Wigginton Road near York Hospital\n\nTHINGS are a little bit different now. But back in Tudor times it wasn't the done thing for a priest who had taken a vow of chastity to suddenly decide to get married.\n\nRobert Holgate wasn't just any priest: he was the Archbishop of York and President of the King's Council in the North. When he married in 1550, at the age of 68, it caused quite a scandal - particularly in conservative northern Church circles.\n\nHe got away with it during the reign of the young, and Protestant, King Edward VI, Henry VIII's son. But when Edward died at the age of 15 in 1553 and his Catholic sister Mary succeeded him, Robert quickly found himself in hot water.\n\nHe was imprisoned in the Tower of London for 'divers offences' - most notably getting married after having taken a vow of chastity.\n\nStripped of all his offices, he apologised to the Queen, and was eventually released in 1555 on payment of a huge fine. It did him little good - he died ten months later, clearly a broken man.\n\nRobert's career was typical of many statesmen in Tudor times. Like Cardinal Wolsey, he rose to dizzying heights, only to fall quickly from grace when he offended the ruling monarch.\n\nHis name survives in York, however, because of something he did while at the height of his power in York.\n\nHolgate had bought the Treasurer's House and other property in Minster Close.\n\nIn 1546, he founded three schools - one in York, one in Hemsworth, and one in Old Malton. The York school was in Ogleforth 'close by the cathedral' and, like other early grammar schools in England, was intended to train students for the church. The curriculum included Latin, Greek and Hebrew with some history, geography and maths but with the emphasis firmly on religious and moral education. Discipline is said to have been severe - as it was for poor Archbishop Robert himself once Queen Mary came to the throne.\n\nThe school survived the Archbishop's fall from grace, however. More than 200 years after his death, an advert in the York Courant in December 1799 stated that: \"The Free Grammar School situate within the Close of the Cathedral Church of York founded by Archbishop Holgate for the Instruction of Youth ... will open again after the Christmas recess on Monday, January 20, 1800.\"\n\nLike other grammar schools Archbishop Holgate's struggled for pupils in the early 1800s: it had just 10 in 1818, and 17 in 1824.\n\nThen, in 1845-6, the York Diocesan School Society built a new training college (St John's College) on Lord Mayor's Walk. A new school, the Yeoman School, was built next door. Opened in 1846 this was intended to cater for the 'middle class children' of agriculturalists, as well as to provide teaching practice for student teachers at St John's.\n\nThe new school ran into financial difficulties, however, and in 1858, after 300 years in Ogleforth, Archbishop Holgate's School took it over.\n\nThe iron gates to the school's playing fields seem to have been designed between 1850 and 1860 by George Townsend Andrews, the architect who had designed St John's College itself. They were made by the Walmgate-based Walker Iron Foundry, which also made railings and gates for the British Museum, as well as others across York, including in St Leonard's Place, York Cemetery, Dean's Park and at St Peter's School.\n\nArchbishop Holgate's School thrived in its new location in Lord Mayor's Walk. By 1915, when the Rev William Johnson retired as headmaster, the school had 294 pupils.\n\nBy then, the school had leased part of Bootham Stray for playing fields, which is why the school playing field gates - which were restored in 2017 by York Civic Trust working with York Hospital - are there to this day.\n\nThe school itself moved to its present site on Hull Road in 1963.\n\nStephen Lewis\n\nFor the stories behind more York Civic Trust plaques, visit yorkcivictrust.co.uk"}, {"url": "https://discovery.nationalarchives.gov.uk/details/c/F31981", "page_content": "This website uses cookies\n\nWe place some essential cookies on your device to make this website work.\n\n\n\nWe'd like to use additional cookies to remember your settings and understand how you use our services.\n\n\n\nThis information will help us make improvements to the website."}, {"url": "http://www.tudorplace.com.ar/Bios/RobertHolgate.htm", "page_content": "Robert H OLGATE (Archbishop of York)\n\nDied: 15 Nov 1555\n\nBuried: Church of St. Sepulchre, Holborn, London\n\nEmerges from obscurity in 1537 as Bishop of Llandaff and Master of Semperingham, home of the Gilbertine Order, and of whom it was said, a great favourite at court. He was also Lord President of the Council in the North.\n\nHe left this Bishopric to become Archbishop of York in 1545 becoming the first Protestant Archbishop of York and also the first to be married. When Henry VIII died in 1547, Robert Holgate saw the Minster stripped of half its clergy and much of its treasure under Edward VI .\n\nHe acquired much wealth, land and property, stretching from Pickering and East Yorkshire to Hemsworth. Holgate was born in Hemsworth and did not forget his native village. He left an endownment the \"Holgate Trust\" which to this day controls the Hemsworth Holgate Alms House in Robin Lane, Hemsworth. The Alms House Trust was made for the upkeep of a number of men and women of the Protesant persuasion. Holgate also left money for school at Hemsworth, York and old Malton. In May 1548 the Archbishop, by deed poll, prescribed the rules and ordinances of the Hemsworth School.\n\nHe was President of the Council in the North, but proved unable to deal with the Seamer rebellion in Aug 1549, nad was replaced by Francis Talbot, Earl of Shrewsbury . He later claimedthat it was John Dudley, Earl of Warwick who '... touke such displeasure with me that... he put me firth of the rowme of the President...'.\n\nAs the Reformation progressed and Edward VI died, his sister, the Catholic Mary assumed the throne in 1553, and Robert Holgate, to quote from the York Minster Chronicle, quickly shed his wife and his Protestant faith to save his skin.\n\nIn 1554 he was deprived of his title, and in 1555 Robert Holgate, Archbishop of York, endowed a Hospital in Hemsworth by Will."}, {"url": "https://www.englandcast.com/2022/11/robert-holgate/", "page_content": "Today in 1555 Robert Holgate died. He was the Archbishop of York, and in his life he brought to the fore one of the major issues between Protestants and Catholics, which was the idea of a clergy that could get married. He was the first Protestant Archbishop of York, and he was also the first to get married.\n\nHe was President of the Council in the North, but proved unable to put down the Seamer rebellion in 1549, and was replaced by Francis Talbot, Earl of Shrewsbury. He would see much of the wealth of the York minster be stripped as Edward VI moved the Protestant reformation further and destroyed any lingering signs of Catholicism.\n\nAfter Edward VI died, his sister, the Catholic Mary assumed the throne in 1553, and Robert Holgate, to quote from the York Minster Chronicle, “Quickly shed his wife and his Protestant faith to save his skin.” In 1554 he was deprived of his title.\n\nRobert Holgate died in London on the 15th of Nov 1555, and his body was buried in the Church of St. Sepulchre, Holborn, London.\n\nThat’s your Tudor Minute for today. Remember you can dive deeper into life in 16th-century England through the Renaissance English History Podcast at englandcast.com.\n\n\n\nSuggested link:\n\nOctober is Reformation Month!\n\n\n\nFrom my shop:\n\nEarly Christmas shopping gifts\n\nChristmas Tree Skirt Collection\n\nPs. All products are made on-demand and can take a few weeks to ship."}, {"url": "https://www.findagrave.com/memorial/112912649/robert-holgate", "page_content": "Archbishop of York\n\n\n\nRobert Holgate (1481/1482 – 1555) was Bishop of Llandaff and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as leader of the Church of England.\n\n\n\nHolgate, chaplain to Thomas Cromwell, 1st Earl of Essex, became master of the Gilbertine Order in 1536, and exerted his influence to prevent the surrender of the Gilbertine houses under the Act for the Suppression of the Smaller Monasteries in 1536 as only four out of twenty-six houses had revenues over £200 a year. In 1538, Holgate surrendered Sempringham Priory.\n\n\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This may however have been a second marriage to make it fully legal, and Holgate and Wentworth may have first married in late 1547 with Roger Tongue officiating. In 1551 Arthur Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne she imprisoned Holgate on various charges, with his being a married clergy being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\n\n\n\n\nArchbishop of York\n\n\n\nRobert Holgate (1481/1482 – 1555) was Bishop of Llandaff and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as leader of the Church of England.\n\n\n\nHolgate, chaplain to Thomas Cromwell, 1st Earl of Essex, became master of the Gilbertine Order in 1536, and exerted his influence to prevent the surrender of the Gilbertine houses under the Act for the Suppression of the Smaller Monasteries in 1536 as only four out of twenty-six houses had revenues over £200 a year. In 1538, Holgate surrendered Sempringham Priory.\n\n\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This may however have been a second marriage to make it fully legal, and Holgate and Wentworth may have first married in late 1547 with Roger Tongue officiating. In 1551 Arthur Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne she imprisoned Holgate on various charges, with his being a married clergy being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\n\n\n"}, {"url": "https://centaur.reading.ac.uk/16858/", "page_content": "RDF+XML BibTeX RIOXX2 XML RDF+N-Triples JSON RefWorks Simple Metadata Refer HTML Citation (with IDs) HTML Citation ASCII Citation EndNote MPEG-21 DIDL RDF+N3 Wordle Link Dublin Core Atom METS Dublin Core OpenURL ContextObject OpenURL ContextObject in Span MODS EP3 XML Dublin Core Data Cite XML Reference Manager Multiline CSV\n\nParish, H. L. (2004) Holgate, Robert (1481/2-1555), Archbishop of York. In: Oxford Dictionary of National Biography. Oxford University Press, UK, pp. 641-643.\n\nFull text not archived in this repository.\n\nIt is advisable to refer to the publisher's version if you intend to cite from this work. See Guidance on citing.\n\nTo link to this item DOI: 10.1093/ref:odnb/13504\n\nAltmetric Altmetric Altmetric\n\nDeposit Details Deposit Details Deposit Details Date Deposited: 04 May 2011 08:12 Date item deposited into CentAUR Last Modified: 09 Jul 2021 08:06 Date item last modified\n\nUniversity Staff: Request a correction | Centaur Editors: Update this record"}, {"url": "https://maltonians.maltonschool.org/people/holgate.php", "page_content": "Illustrated here is the church at Darrington, near Pontefract. Archbishop Holgate's heir was his nephew, Thomas Holgate, who acquired the manor of Stapleton in the parish of Darrington. Several Holgate tombstones are here.\n\nROBERT HOLGATE died on 15th November, 1555 at the Headhouse of the Master of Sempringham, a Gilbertine Order of which he had himself been Master. In his Will he asked that his body should \"be buried in the parish church within the parish whereof it shall please Almighty God to take me out of this transitory life\". The Headhouse stood in Cow Lane, Smithfield, and within the parish of St. Sepulchre. \" The bells of Old Bailey\" are the bells of this Church which stands at the junction of Giltspur Street and Holborn Viaduct.\n\nSir William Petre was one of the four executors of Holgate's will. He was born c.1505 at Torbryan, in Devon, and educated at Oxford of which university he became Doctor of Law in 1533. For a time he was tutor to a brother of Anne Boleyn. By 1544 Henry VIII had made Petre a knight, a privy councillor, and one of his two Principal secretaries. He served Henry, Edward, Mary and Elizabeth. The original painting is at Ingatestone Hall in Essex.\n\nAdvert for Malton Free Grammar School\n\nAn illustration of a bill advertising the Grammar School at Old Malton. The illustration is taken from a book by Dr J S Purvis, Director of the Borthwick Institute of Historical Research in 1960, entitled \"Historical Records\"\n\nThe illustration was on the front of the menu for the Holgate Society dinner at Brown's Hotel, 28th October 1960.\n\nA transcription:\n\nThis is to give NOTICE,That at Old Malton Free Grammar School, YOUTH are completely qualified for any manner of Bufinefs, in Latin, Greek &c. Alfo Arithmetic in all its Parts, Navigation, Menfuration, Merchants Accompts &c. and Writing in very Perfection, by JOSEPH KERR, Mafter. WILLIAM HALL, Affiftant.\n\nN. B. Old Malton is pleafantly fituated upon the River Derwent in the North-Riding of the County of York, in a fine plentiful Country: Board at Seven Pounds per Annum; Board and Learning, at Nine Guineas; Learning, Board, and Cloaths, found in a neat decent Manner, at the Expense of Twelve Pounds.\n\nThofe who are pleafed to encourage this SCHOOL, may depend upon fuch Exactnefs and Care, as will, in every Refpect, be confiftent with this publick Notice"}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=6695736&lang=en", "page_content": "Robert Holgate (1481/1482 – 1555) was Bishop of Llandaff from 1537 and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as head of the Church of England.\n\nAlthough a protege of Thomas Cromwell, 1st Earl of Essex, Holgate had a career in the Gilbertine Order of which he became master. He was briefly Prior of Watton until the priory was dissolved in 1539. Most of the Gilbertine houses were lesser establishments which should have been dissolved under the Suppression of Religious Houses Act 1535 (only four out of twenty-six houses had revenues over £200 a year). However, Holgate is credited with using his influence to save them for a few years. For example, Malton Priory, one of the lesser Gilbertine houses, was the last of them to surrender in December 1539, whereas Sempringham Priory, worth more than £200 a year, surrendered in 1538.\n\nHolgate was consecrated as Bishop of Llandaff on 25 March 1537. He translated to York on 16 January 1545. At York in 1546, he founded a school, now called Archbishop Holgate's School.\n\nHe was President of the Council of the North from 1538.\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This might, however have been a second wedding to make it fully legal, and Holgate and Wentworth might have first married in late 1547 with Roger Tongue officiating. In 1551 Anthony Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne. She imprisoned Holgate on various charges, with his being a married cleric being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\nIn 1558 a Robert Holgate from Yorkshire entered the University of Cambridge. He may have been a son of Holgate, since there are some claims he had two children by Barbara, but there is no conclusive evidence on the matter.\n\nReferences\n\nThis article contains public domain text from William Page's Houses of the Gilbertine order: The priory of Sempringham, A History of the County of Lincoln: Volume 2 (1906)"}]}