{"Robert Holgate was educated at the University of Cambridge, and was ordained a priest in 1510.": [{"url": "http://www.historyofyork.org.uk/themes/tudor-stuart/robert-holgate-archbishop", "page_content": "1545AD - 1554AD\n\nRobert Holgate from a Yorkshire family, was educated in Cambridge and entered the Gilbertine order as a canon. He played an important role in the life of the community before the Dissolution of the Monasteries.\n\nConsidered to be a protégé of Thomas Cromwell, Holgate was appointed president of the Council in the North in 1538, a post he held for 11 years. He lived in the house of the former abbot of St Mary’s Abbey in York, which has survived as King’s Manor.\n\nFollowing the death of Archbishop Lee in September 1544, Holgate was named his successor and was consecrated as Archbishop of York at Lambeth in January 1545, renouncing papal authority.\n\nFrom then, the tenets of Protestant theology were regularly expounded in the Minster for the first time, and organ music was abolished. He instructed that the Minster Library be furnished with new Protestant commentaries on the Bible by theologians like Calvin.\n\nArchbishop Holgate founded three grammar schools in 1546, one at his birthplace of Hemsworth in the West Riding, one at Old Malton and one in York. He required his headmasters to be skilled in Hebrew, Greek and Latin and to take his pupils to the Minster on Sundays.\n\nIn order to prove his Protestantism to the sceptical Duke of Northumberland, in 1550, aged 68, the Archbishop took a bride when he was 68 – local gentlewoman Barbara Wentworth. This was a year after an Act of Parliament removed the duty of celibacy from the English clergy.\n\nBut when Queen Mary came to the throne in 1553 and returned England to Catholicism, Holgate was sent to the Tower then stripped of his post for breaking his vow of celibacy.\n\nHaving paid the crown £1,000 for his ‘crimes’ Holgate was set free in January 1555 only to die that November in London."}, {"url": "https://www.oxfordreference.com/view/10.1093/acref/9780192802903.001.0001/acref-9780192802903-e-3295", "page_content": "Note on the Revision of the Third Edition\n\nAbp. of *York. He was probably educated at the Gilbertine house of studies in Cambridge, where he was university preacher in ... ...\n\nPRINTED FROM OXFORD REFERENCE (www.oxfordreference.com). (c) Copyright Oxford University Press, 2023. All Rights Reserved. Under the terms of the licence agreement, an individual user may print out a PDF of a single entry from a reference work in OR for personal use (for details see Privacy Policy and Legal Notice ).\n\nAccess to the complete content on Oxford Reference requires a subscription or purchase. Public users are able to search the site and view the abstracts and keywords for each book and chapter without a subscription.\n\nPlease subscribe or login to access full text content.\n\nIf you have purchased a print title that contains an access token, please see the token for information about how to register your code.\n\nFor questions on access or troubleshooting, please check our FAQs, and if you can''t find the answer there, please contact us."}, {"url": "https://www.yorkpress.co.uk/news/17223886.meet-archbishop-robert-holgate-founder-archbishop-holgates-school/", "page_content": "Robert Holgate and the restored Archbishop Holgate’s Grammar School playing field gates\n\nLocation of plaque: on the restored gates in Bridge Lane, off Wigginton Road near York Hospital\n\nTHINGS are a little bit different now. But back in Tudor times it wasn't the done thing for a priest who had taken a vow of chastity to suddenly decide to get married.\n\nRobert Holgate wasn't just any priest: he was the Archbishop of York and President of the King's Council in the North. When he married in 1550, at the age of 68, it caused quite a scandal - particularly in conservative northern Church circles.\n\nHe got away with it during the reign of the young, and Protestant, King Edward VI, Henry VIII's son. But when Edward died at the age of 15 in 1553 and his Catholic sister Mary succeeded him, Robert quickly found himself in hot water.\n\nHe was imprisoned in the Tower of London for 'divers offences' - most notably getting married after having taken a vow of chastity.\n\nStripped of all his offices, he apologised to the Queen, and was eventually released in 1555 on payment of a huge fine. It did him little good - he died ten months later, clearly a broken man.\n\nRobert's career was typical of many statesmen in Tudor times. Like Cardinal Wolsey, he rose to dizzying heights, only to fall quickly from grace when he offended the ruling monarch.\n\nHis name survives in York, however, because of something he did while at the height of his power in York.\n\nHolgate had bought the Treasurer's House and other property in Minster Close.\n\nIn 1546, he founded three schools - one in York, one in Hemsworth, and one in Old Malton. The York school was in Ogleforth 'close by the cathedral' and, like other early grammar schools in England, was intended to train students for the church. The curriculum included Latin, Greek and Hebrew with some history, geography and maths but with the emphasis firmly on religious and moral education. Discipline is said to have been severe - as it was for poor Archbishop Robert himself once Queen Mary came to the throne.\n\nThe school survived the Archbishop's fall from grace, however. More than 200 years after his death, an advert in the York Courant in December 1799 stated that: \"The Free Grammar School situate within the Close of the Cathedral Church of York founded by Archbishop Holgate for the Instruction of Youth ... will open again after the Christmas recess on Monday, January 20, 1800.\"\n\nLike other grammar schools Archbishop Holgate's struggled for pupils in the early 1800s: it had just 10 in 1818, and 17 in 1824.\n\nThen, in 1845-6, the York Diocesan School Society built a new training college (St John's College) on Lord Mayor's Walk. A new school, the Yeoman School, was built next door. Opened in 1846 this was intended to cater for the 'middle class children' of agriculturalists, as well as to provide teaching practice for student teachers at St John's.\n\nThe new school ran into financial difficulties, however, and in 1858, after 300 years in Ogleforth, Archbishop Holgate's School took it over.\n\nThe iron gates to the school's playing fields seem to have been designed between 1850 and 1860 by George Townsend Andrews, the architect who had designed St John's College itself. They were made by the Walmgate-based Walker Iron Foundry, which also made railings and gates for the British Museum, as well as others across York, including in St Leonard's Place, York Cemetery, Dean's Park and at St Peter's School.\n\nArchbishop Holgate's School thrived in its new location in Lord Mayor's Walk. By 1915, when the Rev William Johnson retired as headmaster, the school had 294 pupils.\n\nBy then, the school had leased part of Bootham Stray for playing fields, which is why the school playing field gates - which were restored in 2017 by York Civic Trust working with York Hospital - are there to this day.\n\nThe school itself moved to its present site on Hull Road in 1963.\n\nStephen Lewis\n\nFor the stories behind more York Civic Trust plaques, visit yorkcivictrust.co.uk"}, {"url": "https://www.cam.ac.uk/about-the-university/history", "page_content": "1209 Groups of scholars congregate at the ancient Roman trading post of Cambridge for the purpose of study, the earliest record of the University.\n\n1284 Peterhouse, the first college at Cambridge, is founded by the Bishop of Ely.\n\n1347 Mary, Countess of Pembroke, founds Pembroke College.\n\n1446 Henry VI, founder of Eton and of King's College, Cambridge, lays the first stone of King's College Chapel.\n\n1473 Robert Woodlark founds St Catharine’s College.\n\n1503 Thomas Cranmer, aged 14, enters the newly-endowed Jesus College.\n\n1511 Lady Margaret Beaufort, mother of Henry VII, founds St John's College.\n\n1516 Erasmus, Lady Margaret Professor of Divinity at Cambridge, works on his translation of the Greek New Testament and on textbooks which were to become the staple of the 'new learning'. His work led to him being considered the most important scholar of the Northern Renaissance.\n\n1533 Thomas Cranmer ends his career in Cambridge to become the first post-reformation Archbishop of Canterbury. While in the post, he annuls Henry VIII's marriages to Catherine of Aragon and Anne Boleyn and divorces him from Anne of Cleves. He is also largely responsible for the Book of Common Prayer, the official directory of worship of the Church of England.\n\n1546 Henry VIII founds Trinity College, Cambridge.\n\n1584 The Cambridge University Press, the world's oldest-established press, begins its unbroken record of publishing every year until the present.\n\n1600 Dr William Gilbert of St John's publishes his 'De Magnete', a scientific work fundamental to the development of navigation and map making.\n\n1625 John Milton enters Christ's, where he studies until 1632. Five years later, on the death of his friend, Edward King, he writes Lycidas, recalling in pastoral terms their days together.\n\n1627 John Harvard enters Emmanuel College as an undergraduate. He later emigrates to America and, in 1638, re-endows the college which now bears his name, at Cambridge, Massachusetts.\n\n1628 William Harvey of Gonville and Caius College, publishes his celebrated treatise, 'De motu cordis et sanguinis in animalibus', (On the Motion of the Heart and Blood in Animals), describing his discovery of the mechanism of blood circulation.\n\n1675 Charles II appoints John Flamsteed to the new post of Astronomer Royal. The following year, Flamsteed, educated at Cambridge, institutes reliable observations at Greenwich, near London, providing data from which Newton is later able to verify his gravitational theory.\n\n1687 Isaac Newton publishes 'Principia Mathematica', establishing the fundamental principles of modern physics.\n\n1704 The Plumian chair of Astronomy and Experimental Philosophy is endowed by Thomas Plume of Christ's. Subsequent incumbents include Roger Cotes, Sir George Biddel Airy, who was responsible for the first public observatory in Cambridge, James Challis, Sir George Darwin, son of the naturalist Charles Darwin, Sir Fred Hoyle and Sir Martin Rees.\n\n1711 Richard Bentley, Regius Professor of Divinity from 1717, completes his edition of the Latin poet, Horace. His editing and interpretation of classical texts inspires all later generations of classics scholars.\n\n1762 The University's first Botanic Garden is endowed by Richard Walker of Trinity.\n\n1776 Cambridge graduates, Thomas Nelson, Trinity and later of Virginia; Arthur Middleton, St John's and later of South Carolina and Thomas Lynch, Gonville and Caius and also of South Carolina, are among the signatories of America's Declaration of Independence.\n\n1784 The Rt Hon William Pitt of Pembroke is elected MP for the University at the age of 25, a year after becoming Prime Minister.\n\n1791 Wordsworth goes down from St John's, later to become Poet Laureate. Just a few months afterwards, his great literary companion and poet, Samuel Taylor Coleridge, enters Jesus College.\n\n1805 Lord Byron enters Trinity and starts writing his early satires and poems.\n\n1806 Viscount Palmerston is elected to Parliament three years after entering St John's, beginning a distinguished lifetime's career in the UK Government, much of it as an MP for the University. He served two terms as Prime Minister, the first of which saw his vigorous prosecution of the Crimean war with Russia in 1855.\n\n1812 Charles Babbage, while an undergraduate at Peterhouse, has his first ideas for a calculating machine and later starts work on his 'difference engine', which he never completed but which heralds later inventions leading to the modern computer.\n\n1829 Alfred Tennyson, Trinity undergraduate, is awarded the Chancellor's medal for his poem, 'Timbuctoo'. In 1850, he publishes his major poetic achievement, 'In Memoriam', the elegy mourning the death of his friend, Arthur Hallam, also of Trinity, and succeeds Wordsworth as Poet Laureate.\n\n1829 also sees the staging of the first Boat Race between Cambridge and Oxford, won by Oxford.\n\n1831 Charles Darwin of Christ's is recommended by Botany Professor John Stevens Henslow to join HMS Beagle as the naturalist on its scientific survey of South American waters.\n\n1847 Prince Albert, Consort of Queen Victoria, is elected Chancellor and becomes an influential voice for reform.\n\n1849 Thomas Babington Macaulay, Fellow of Trinity, publishes volumes one and two of his immensely popular 'History of England'.\n\n1851 The Natural Sciences Tripos is first examined, loosening the stranglehold of mathematics and classics on the syllabus, and opening the door to modern studies of the arts and sciences.\n\n1869 Emily Davies and others found Girton College, the first residential university-level institution of higher learning for women.\n\n1870 William Cavendish, seventh Duke of Devonshire, endows the University's new Cavendish Laboratory for the study of experimental physics. Total cost: £8,450.\n\n1871 James Clerk Maxwell returns to Cambridge as the first Cavendish Professor of Physics. Two years afterwards he publishes his 'Treatise on Electricity and Magnetism' and later outlines his theory of electromagnetic radiation, confirming him as the leading theoretical physicist of the century.\n\n1888 Frederic William Maitland is appointed Downing Professor of the Laws of England. He remains the outstanding figure in the understanding of the medieval history and law of England. His work secures Cambridge as one of the world's leading centres for the study of legal history.\n\n1897 JJ Thomson, Cavendish Professor of Physics, discovers the electron, laying the foundations for the whole of modern physics, including electronics and computer technology. In following years, inventors use his work to develop new devices such as the telephone, radio and television.\n\n1899 Lytton Strachey, Leonard Woolf and Thoby Stephen meet as undergraduates at Trinity and form the nucleus of what was to become known as the Bloomsbury Group.\n\n1903 Bertrand Russell, Fellow of Trinity, publishes 'Principles of Mathematics', the same year as GE Moore publishes his influential 'Principia Ethica'. In 1913, Russell and AN Whitehead publish the even more influential `Principia Mathematica'. It is another four decades before Russell collects his Nobel prize for Literature.\n\n1906 JJ Thomson collects his Nobel prize for Physics for his work on the electron.\n\n1907 Jawaharlal Nehru, Prime Minister of India 1947-1964, enters Trinity.\n\n1911 Ludwig Wittgenstein arrives in Cambridge from Vienna to study philosophy with Russell. The work of the two men, with Moore, transforms philosophy during the first half of the 20th century and makes Cambridge the most important centre for philosophical research in the English-speaking world.\n\n1912 During a walk on the Backs, the young Lawrence Bragg has an idea that will lead to his discovery of the mechanism of X-ray diffraction. Three years later, he shares his Nobel prize for Physics with his father, WH Bragg.\n\n1918 Following the Armistice, Eric Milner-White, Dean of King's, institutes the first Festival of Nine Lessons and Carols, now broadcast worldwide from King's College Chapel each Christmas Eve.\n\n1927 George 'Dadie' Rylands becomes a Fellow of King's. His career inspired generations of actors and directors including Derek Jacobi, Michael Redgrave, Daniel Massey, Peter Hall, Trevor Nunn and Jonathan Miller.\n\n1929 Sir Frederick Gowland Hopkins, Professor of Biochemistry, receives his Nobel prize for Physiology and Medicine for discovering vitamins. It was his work which gave rise to the study of a new subject, biochemistry, and inspired Sir William Dunn's trustees to endow the now world famous Sir William Dunn Institute of Biochemistry.\n\n1932 The atom is split for the first time. The work, giving birth to the study of nuclear physics, is carried out by John Cockcroft and Ernest Walton, under the direction of Ernest Rutherford at the Cavendish Laboratory. Their Nobel prize for Physics is awarded in 1951.\n\nIn this year, FR Leavis, Lecturer in English, also publishes 'New Bearings in English Poetry'. His distinctive style of literary and cultural criticism influences generations of students in the 1930s, 40s, and 50s.\n\n1933 Professor Paul Dirac receives his Nobel prize for Physics. One of the founding fathers of quantum theory, basic to physics, chemistry and mathematics, Dirac also suggested the existence of antimatter, the positron being the first antiparticle to be discovered. Positron Emission Tomography is today a vital technique in many areas of medical diagnosis.\n\nRoger Fry becomes the University's Slade Professor of Fine Art.\n\n1934 Flight Lieutenant Frank Whittle is sent to Cambridge as a mature student by the RAF and enters Peterhouse. He is encouraged to pursue his innovative idea of jet propulsion, patented three years earlier but ignored by the Air Ministry.\n\nThe University Library moves to its new site across the River Cam, from where it expands to become the largest open-access library in Europe and one of five national copyright libraries.\n\n1936 John Maynard Keynes, Fellow of King's, publishes the revolutionary 'General Theory of Employment, Interest and Money', following his equally powerful 'A Treatise on Money' six years earlier. The Keynsian Revolution, as it became known, changes the view of how economies should be managed. As Bursar of King's, Lord Keynes also initiated the Cambridge Arts Theatre.\n\n1937 Dorothy Garrod becomes Disney Professor of Archaeology, the University's first woman professor. Her notable excavations at Mount Carmel cast new light on the origin of our own species, Homo Sapiens Sapiens, and our links to Neanderthal man.\n\n1941 The first aeroplane to be powered by one of Frank Whittle's revolutionary new jet engines takes to the air.\n\n1944 GM Trevelyan, Professor of Modern History, publishes his pioneering work, English Social History, a companion to his History of England, 1926.\n\n1948 Women are admitted to formal membership of the University and permitted to graduate in the same manner as male students. The first honorary degree given to a woman is conferred upon the late Queen Elizabeth the Queen Mother.\n\n1949 Maurice Wilkes develops the EDSAC, Electronic Delay Storage Automatic Calculator, the first stored program digital computer to work successfully.\n\n1953 Francis Crick and James Watson discover the structure of DNA, unlocking the secret of how coded information is contained in living cells and passed from one generation to the next - the secret of life. Their discovery opens the door to the study of an entirely new science - genetics.\n\n1954 Dr Joseph Needham, Master of Gonville and Caius and already eminent in biochemistry, publishes the first volume of his 'Science and Civilisation in China', the start of a massive enterprise, vastly expanding our knowledge of China and its civilisation.\n\n1955 Sylvia Plath, Marshall Scholar at Newnham, continues correspondence to her mother, later to be published in the book, 'Letters Home'.\n\n1958 Frederick Sanger of the University's Department of Biochemistry, wins the first of his two Nobel prizes for Chemistry for determining the specific sequence of the amino acid building blocks which form the protein insulin.\n\n1960 Sir Charles Oatley, Professor of Electrical Engineering at the University's Department of Engineering, leads a team which develops the first scanning electron microscope, arguably the most important scientific instrument to be developed in the last 50 years. The instrument is later adapted to write the masks for today's electronic chips.\n\n1962 Max Perutz establishes and directs the Medical Research Council's Laboratory of Molecular Biology in Cambridge, a notable example of close working relations between the University and other leading research establishments.\n\nCrick and Watson share the Nobel Prize for Physiology and Medicine for their discovery of the structure of DNA with Maurice Wilkins of the University of London. At the same ceremony, Max Perutz and John Kendrew share the Nobel prize for Chemistry for solving the three dimensional structure of proteins - the catalysts that perform most of the chemical reactions of life.\n\n1968 Anthony Hewish and Jocelyn Bell make the most exciting recent observation in astrophysics by discovering pulsating stars or 'pulsars' using Cambridge's Mullard Radio Astronomy Observatory. Their work alters the course of modern cosmology.\n\nThe new stars provide unique physics laboratories for studying matter in extreme conditions, stimulating research into many new areas of physics. Hewish collects the Nobel Prize for Physics eight years later, sharing it with Sir Martin Ryle, Astronomer Royal, whose technique of aperture synthesis had made many of the observations possible.\n\n1975 Trinity College, under the guidance of Dr John Bradfield, Senior Bursar, founds England's first science park on the outskirts of Cambridge.\n\n1977 Installation of HRH the Prince Philip, Duke of Edinburgh as Chancellor.\n\n1980 Dr Frederick Sanger, Fellow of King's, becomes the first person ever to win two Nobel prizes for Chemistry, this time for discovering how to determine the information encoded in DNA - DNA sequencing.\n\n1982 Aaron Klug, of the MRC Laboratory for Molecular Biology, collects his Nobel prize for solving complex three dimensional structures including viruses and RNA molecules.\n\n1984 Ted Hughes of Pembroke College succeeds Sir John Betjeman as Poet Laureate.\n\n1985 Cesar Milstein, fellow of Darwin College, collects his Nobel prize for his work on monoclonal antibodies, the original `magic bullets'. His method of producing unlimited supplies of highly specific antibodies opens a new route for attacking unwanted cells such as cancers - revolutionising all aspects of medicine from pure research to drug design.\n\n1988 Professor Stephen Hawking, Lucasian Professor of Mathematics, publishes his book, 'A Brief History of Time' one of the best selling scientific books of all time. He is already eminent for his work on black holes and the Big Bang theory of the origin of the universe.\n\n1989 The Cambridge Foundation is formed, with the aim of raising £250 million over ten years for research and development in the University.\n\n1990 The Royal Greenwich Observatory relocates to Cambridge, confirming the city among the world's leading centres for the study of astronomy and astrophysics. Its founder in 1676, John Flamsteed, also studied at Cambridge.\n\nThe Institute of Management Studies is named the Judge Institute following an £8 million benefaction from the businessman, Paul Judge. Mr Simon Sainsbury gives £5 million to support the Institute the same year and Mr Peter Beckwith pledges £1 million the following year.\n\n1993 The Royal Commonwealth Society Library moves to Cambridge.\n\nThe Granta Backbone Network is completed, providing the University with on line computer links across Cambridge via a network of fibre-optic cables running under the streets of the medieval city. The project allows the University to become an early site for connection to SuperJANET and the Internet.\n\n1995 Professor Sir Martin Rees, Plumian Professor of Astronomy and Experimental Philosophy, 1973-91, and a Royal Society research professor at Cambridge, follows in the footsteps of many of his predecessors by taking up his appointment as Astronomer Royal.\n\nThe University mounts 'Foundations for the Future', the first exhibition of its kind in the UK, marking the achievements of Cambridge.\n\n1996 HM The Queen visits Cambridge to open the new Law Faculty and Judge Institute of Management Studies buildings.\n\nThe Institute of Biotechnology is awarded the Queen's Award for Technology for its work on protein purification.\n\nProfessor James Mirrlees is awarded the Nobel Prize for Economics.\n\n1997 Professor Michael Pepper and his team discover a new standard for electric current.\n\nThe Cavendish Laboratory marks the 100th anniversary of the discovery of the electron.\n\nMrs Molly Maxwell becomes Cambridge's oldest graduate at the age of 105.\n\n1998 A special ceremony at the Senate-House marks the 50th anniversary of women gaining full membership of the University.\n\n1999 Cambridge-MIT Institute set up to improve entrepreneurship in Britain.\n\nCambridge Scientists identify gene causing diabetes and high blood pressure.\n\n2000 Development begins on West Cambridge Site.\n\nGates Scholarships go live. $210 million endowment to provide international scholarships in perpetuity.\n\n2001 Launch of the new Centre for Research in the Arts, Social Sciences and Humanities (CRASSH).\n\nBritain's first Park and Cycle facility opens on the University's West Cambridge Site.\n\nOpening of the new BP Institute at Madingley Road, Cambridge.\n\n2002 The William H Gates building opens, the first on the University's major new science and technology West Cambridge site.\n\n2003 Professor Alison Richard becomes Vice-Chancellor.\n\nWork starts on a £42 million state-of-the-art cancer research facility, which will create the largest concentration of researchers in Europe.\n\n2004 Fitzwilliam Museum unveils a £12 million transformation, creating the new Courtyard Development and purpose-built education rooms.\n\nOpening of the Faculty of English Building on the Sidgwick Site and the University's first ever purpose-built staff accommodation at West Cambridge.\n\n2005 Opening of the Institute of Criminology building on the Sidgwick Site and the Faculty of Education building on Hills Road.\n\nHM The Queen visits Cambridge to open the Centre for Mathematical Sciences and attend the Quincentenary celebrations at Christ's College.\n\nThe University launches its 800th anniversary appeal to raise £1 billion by 2012.\n\n2006 The University announces the formation of its first Investment Board to advise it on all matters relating to its endowment, and the appointment of its first Chief Investment Officer.\n\nThe Registrary of the University celebrates 500 years of history, one of the longest continuously-held offices in UK higher education.\n\nThe £14 million new home for the Electrical Engineering Division of the Department of Engineering is opened at West Cambridge.\n\n2007 Her Majesty The Queen opens the Cancer Research UK Cambridge Research Institute on the Cambridge Biomedical Campus next to Addenbrooke's Hospital.\n\nA day of celebrations marks 30 years that Prince Philip has served as Chancellor of the University.\n\n2008 Cambridge Assessment (formerly known as the University of Cambridge Local Examinations Syndicate) celebrates its 150th anniversary.\n\n2009 The University of Cambridge celebrates its 800th anniversary.\n\n2010 Professor Sir Leszek Borysiewicz becomes Vice-Chancellor.\n\n2013 Development begins at North West Cambridge.\n\nThe Institute of Continuing Education celebrates its 140th anniversary.\n\nThe Cambridge Centre for Advanced Research and Education in Singapore (Cambridge CARES) is established as The University's first research centre outside of the UK.\n\n2015 The University of Cambridge Primary School, the first primary University Training School in the UK, opens for its first pupils.\n\n2016 The University Library celebrates its 600th anniversary.\n\nThe Fitzwilliam Museum celebrates its 200th anniversary.\n\n2018 Professor Stephen J Toope becomes Vice-Chancellor.\n\nThe University Library's £17m Library Storage Facility opens in Ely.\n\nThe Cambridge-Africa Programme celebrates its 10th anniversary and now supports research in Africa with 50 partner institutions across 18 countries.\n\n2019 Launch of Cambridge Zero. The University's response to the climate crisis aims to maximise the University of Cambridge’s contribution towards achieving a resilient and sustainable zero-carbon world.\n\n2021 Launch of the Foundation Year in Arts, Humanities and Social Sciences – a free and fully-funded one year pre-degree course, designed to offer a stepping stone to Cambridge for those who have experienced educational disadvantage.\n\nCambridge COVID-19 Test Centre processes more than 3 million tests.\n\nCambridge University Press and Cambridge Assessment join together as one organisation, Cambridge University Press & Assessment."}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=6695736&lang=en", "page_content": "Robert Holgate (1481/1482 – 1555) was Bishop of Llandaff from 1537 and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as head of the Church of England.\n\nAlthough a protege of Thomas Cromwell, 1st Earl of Essex, Holgate had a career in the Gilbertine Order of which he became master. He was briefly Prior of Watton until the priory was dissolved in 1539. Most of the Gilbertine houses were lesser establishments which should have been dissolved under the Suppression of Religious Houses Act 1535 (only four out of twenty-six houses had revenues over £200 a year). However, Holgate is credited with using his influence to save them for a few years. For example, Malton Priory, one of the lesser Gilbertine houses, was the last of them to surrender in December 1539, whereas Sempringham Priory, worth more than £200 a year, surrendered in 1538.\n\nHolgate was consecrated as Bishop of Llandaff on 25 March 1537. He translated to York on 16 January 1545. At York in 1546, he founded a school, now called Archbishop Holgate's School.\n\nHe was President of the Council of the North from 1538.\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This might, however have been a second wedding to make it fully legal, and Holgate and Wentworth might have first married in late 1547 with Roger Tongue officiating. In 1551 Anthony Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne. She imprisoned Holgate on various charges, with his being a married cleric being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\nIn 1558 a Robert Holgate from Yorkshire entered the University of Cambridge. He may have been a son of Holgate, since there are some claims he had two children by Barbara, but there is no conclusive evidence on the matter.\n\nReferences\n\nThis article contains public domain text from William Page's Houses of the Gilbertine order: The priory of Sempringham, A History of the County of Lincoln: Volume 2 (1906)"}, {"url": "https://maltonians.maltonschool.org/people/holgate.php", "page_content": "Illustrated here is the church at Darrington, near Pontefract. Archbishop Holgate's heir was his nephew, Thomas Holgate, who acquired the manor of Stapleton in the parish of Darrington. Several Holgate tombstones are here.\n\nROBERT HOLGATE died on 15th November, 1555 at the Headhouse of the Master of Sempringham, a Gilbertine Order of which he had himself been Master. In his Will he asked that his body should \"be buried in the parish church within the parish whereof it shall please Almighty God to take me out of this transitory life\". The Headhouse stood in Cow Lane, Smithfield, and within the parish of St. Sepulchre. \" The bells of Old Bailey\" are the bells of this Church which stands at the junction of Giltspur Street and Holborn Viaduct.\n\nSir William Petre was one of the four executors of Holgate's will. He was born c.1505 at Torbryan, in Devon, and educated at Oxford of which university he became Doctor of Law in 1533. For a time he was tutor to a brother of Anne Boleyn. By 1544 Henry VIII had made Petre a knight, a privy councillor, and one of his two Principal secretaries. He served Henry, Edward, Mary and Elizabeth. The original painting is at Ingatestone Hall in Essex.\n\nAdvert for Malton Free Grammar School\n\nAn illustration of a bill advertising the Grammar School at Old Malton. The illustration is taken from a book by Dr J S Purvis, Director of the Borthwick Institute of Historical Research in 1960, entitled \"Historical Records\"\n\nThe illustration was on the front of the menu for the Holgate Society dinner at Brown's Hotel, 28th October 1960.\n\nA transcription:\n\nThis is to give NOTICE,That at Old Malton Free Grammar School, YOUTH are completely qualified for any manner of Bufinefs, in Latin, Greek &c. Alfo Arithmetic in all its Parts, Navigation, Menfuration, Merchants Accompts &c. and Writing in very Perfection, by JOSEPH KERR, Mafter. WILLIAM HALL, Affiftant.\n\nN. B. Old Malton is pleafantly fituated upon the River Derwent in the North-Riding of the County of York, in a fine plentiful Country: Board at Seven Pounds per Annum; Board and Learning, at Nine Guineas; Learning, Board, and Cloaths, found in a neat decent Manner, at the Expense of Twelve Pounds.\n\nThofe who are pleafed to encourage this SCHOOL, may depend upon fuch Exactnefs and Care, as will, in every Refpect, be confiftent with this publick Notice"}, {"url": "https://www.cam.ac.uk/about-the-university/how-the-university-and-colleges-work/people", "page_content": "The University has a central senior administrative team. They are responsible for the day-to-day management of the University.\n\nAcademic, research and support staff work throughout the University and Colleges. They are crucial to the University’s success and reputation.\n\nThe Chancellor of the University is Lord Sainsbury of Turville.\n\nThe Chancellor is elected for life as the constitutional head of the University although the role is now largely ceremonial. The Chancellor is elected by the Senate, which comprises all senior graduates of the University. In modern times, the Chancellor's principal public role has been the conferment of Honorary Degrees at an annual ceremony. Yet this is only a small aspect of his continuous overall involvement with the University.\n\nIn the UK university system, the office of Chancellor is held by a distinguished individual, from academia or public life. They are not usually resident and do not hold any other University office.\n\nThe Chancellor of the University of Cambridge is elected in a ballot of the Senate. The Chancellor is responsible under the Statutes for adjudicating in certain disputes, and is Visitor of several of the Cambridge Colleges.\n\nThe Chancellor also presides at major ceremonies. The best-known being the annual ceremony for the conferment of Honorary Degrees.\n\nThe Acting Vice-Chancellor is Dr Anthony Freeling.\n\nThe Vice-Chancellor is the main academic and administrative officer of the University. They are appointed for a period of up to seven years.\n\nThey chair the Council of the University, the General Board of the Faculties and the Finance Committee of the Council. Among the main tasks of the Vice-Chancellor are to:\n\nprovide leadership, academic and administrative to the whole University\n\nrepresent the University externally, both within the UK and overseas\n\nsecure a financial base sufficient to allow the delivery of the University's mission, aims and objectives\n\ncarry out certain important ceremonial and civic duties\n\nFive Pro-Vice-Chancellors are appointed to support the Vice-Chancellor. Their responsibilities are determined by the Vice-Chancellor and the University Council. These responsibilities currently include planning and resources, research and education. The office of Pro-Vice-Chancellor is limited to six years.\n\nThe Registrary\n\nThe Registrary is the principal administrative officer of the University. They are Head of the Unified Administrative Services and Secretary of the University Council.\n\nThe Registrary reports to the Vice-Chancellor. They are responsible for ensuring the University's business is conducted properly.\n\nProctors\n\nTwo Proctors are elected annually on the nomination of the Colleges. They are primarily disciplinary and ceremonial officers. They are responsible for maintaining good order in the University. Four Pro-Proctors support the Proctors."}, {"url": "https://wiki.alquds.edu/?query=Robert_Holgate", "page_content": "English Anglican bishop (died 1555)\n\nRobert Holgate (1481/1482 – 1555) was Bishop of Llandaff from 1537 and then Archbishop of York (from 1545 to 1554). He recognised Henry VIII as head of the Church of England.\n\nAlthough a protege of Thomas Cromwell, 1st Earl of Essex, Holgate had a career in the Gilbertine Order of which he became master. He was briefly Prior of Watton until the priory was dissolved in 1539. Most of the Gilbertine houses were lesser establishments which should have been dissolved under the Suppression of Religious Houses Act 1535 (only four out of twenty-six houses had revenues over £200 a year). However, Holgate is credited with using his influence to save them for a few years. For example, Malton Priory, one of the lesser Gilbertine houses, was the last of them to surrender in December 1539,[1] whereas Sempringham Priory, worth more than £200 a year, surrendered in 1538.[2]\n\nHolgate was consecrated as Bishop of Llandaff on 25 March 1537. He translated to York on 16 January 1545. At York in 1546, he founded a school, now called Archbishop Holgate's School.\n\nHe was President of the Council of the North from 1538.[3]\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This might, however have been a second wedding to make it fully legal, and Holgate and Wentworth might have first married in late 1547 with Roger Tongue officiating.[4] In 1551 Anthony Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne. She imprisoned Holgate on various charges, with his being a married cleric being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.[5]\n\nIn 1558 a Robert Holgate from Yorkshire entered the University of Cambridge. He may have been a son of Holgate, since there are some claims he had two children by Barbara, but there is no conclusive evidence on the matter.\n\nReferences [ edit ]\n\nThis article contains public domain text from William Page's Houses of the Gilbertine order: The priory of Sempringham, A History of the County of Lincoln: Volume 2 (1906)"}, {"url": "https://alchetron.com/Robert-Holgate", "page_content": "Robert Holgate (1481/1482 – 1555) was the Catholic Bishop of Llandaff and then Archbishop of York (from 1545 to 1554). He later recognised Henry VIII as head of the Church of England.\n\nAlthough a protege of Thomas Cromwell, 1st Earl of Essex, Holgate had a career in the Gilbertine Order of which he became master. Most of the Gilbertine houses were lesser establishments which should have been dissolved under the Suppression of Religious Houses Act 1535 (only four out of twenty-six houses had revenues over £200 a year). However, Holgate is credited with using his influence to save them for a few years. For example, Malton Priory, one of the lesser Gilbertine houses, was the last of them to surrender in December 1539, whereas Sempringham Priory, worth more than £200 a year, surrendered in 1538.\n\nIn 1550 Holgate married Barbara Wentworth, who was about 25 at the time. This may however have been a second marriage to make it fully legal, and Holgate and Wentworth may have first married in late 1547 with Roger Tongue officiating. In 1551 Anthony Norman claimed that he was already married to Barbara Wentworth, but the courts decided that their marriage when she was about seven had not been a binding legal transaction. Robert and Barbara remained married until 1553, when shortly after Mary I of England came to the throne she imprisoned Holgate on various charges, with his being a married clergy being central to these. In 1554 Holgate renounced his marriage claiming he had only entered it to avoid suspicion as a papist. In January 1555 Holgate was released from prison, but he was not restored to priestly office. He died later that year.\n\nIn 1558 a Robert Holgate from Yorkshire entered the University of Cambridge. He may have been a son of Holgate, since there are some claims he had two children by Barbara, but there is no conclusive evidence on the matter."}, {"url": "https://maltonians.maltonschool.org/documents/holgate/holgateSociety.html", "page_content": "The Early Days\n\nThe Fiftieth Anniversary Dinner (3 April 1998) seems an appropriate time to put on record my own memories of those early days, partly as a matter of historical interest but mainly as a tribute to that band of stalwart Old Boys who first created, and then carried forward the work of the Society.\n\nWhat follows is based partly on my own literature collection, made during the first two decades of the Society's existence together with information gleaned from archival material in York Minster library, but mostly on personal recollection so there will inevitably be errors (for which I beg indulgence); however I hope to be able to give some flavour of those exciting, early days.\n\nI take as the limits of the \"Early Days\" of the title the period starting with the Society's foundation in 1947 and ending in early 1957 i.e. just about a decade.\n\nThe Foundation of the Society\n\nMost current members will know that the foundations of the Society were laid at a dinner hosted by F H Woodward (school 1917 - 1923) at the Oxford and Cambridge Club on 3 February 1947. The venue was appropriate since the gathering followed up on a tradition whereby Old Boy Fellows of Oxford and: Cambridge colleges offered hospitality and help to members of the School during their undergraduate days ( Frank Woodward was himself a Mathematical Fellow of Selwyn College, Cambridge ).\n\nThe decision of that February meeting was \"to form a London Association of Old Boys of Archbishop Holgate's School affiliated to the Association in York\" with the principal aims of \"facilitating re-union gatherings and social intercourse for its members\"; also \"to help all boys, past and present, of the school\" and \" to take steps, wherever possible, to enhance the reputation of the ancient school and to foster its traditions\".\n\nColonel E A Loftus (school 1897 -1903) was elected Chairman; Frank Woodward was Honorary Treasurer and Harry Ward ( 1904 -1914) became Honorary Secretary.\n\nReunion Dinners.\n\nThe first reunion dinner was held at the Waldorf Hotel, Aldwych, WC2 on 14 May 1947. The cost was 16 shillings (80p); this was quite expensive when one considers that, during the war, the charge for any meal was limited to 5 shillings (25p). It was agreed to charge a membership fee, per annum, of one guinea (£ 1.05) for those aged 25 and over, with a reduced fee of half a guinea (52.5p) for those under 25. It has pointed out that Old Boys could become Life Members of the York Association at a cost of £4; this sum included receipt of \"The Mitre\" free of charge for the rest of one's life!\n\nFrom the earliest times, much emphasis was given to the third of the above objectives (\"taking steps, wherever possible, to enhance the reputation of the school ...\"). This applied particularly to gathering information relating to our Founder - a seemingly endless task, which I enjoy doing to this day.\n\nBy the Autumn of 1947, Sir Gerald Woolston, Norroy and Ulster King of Arms and formerly Garter Principal King of Arms, had prepared, at the request of the Society, a sketch of the Archbishop's armorial bearings. A replica in oak was prepared and presented by the President to the Society.\n\nThe other objectives were forwarded by arranging to complete a list of Old Boys willing to offer hospitality to boys \"newly coming to London\" and to forward the list to the Headmaster. The Society decided upon affiliation with the Society of Yorkshiremen in London, especially because so many Old Boys were the recipients of Scholarships founded by that Society.\n\nA pattern of two reunion dinners per year (spring and autumn) was agreed upon; most of these were held at Brown's Hotel, Dover Street (at least until 1963). Accompanying each dinner was a beautifully-produced menu card, the work of Frank Woodward (by now our Honorary Archivist). Collectively they comprise valuable historical material relating back to the early days of the school and to its Founder. The considerable effort involved was finally well-rewarded, since they formed a significant part of the material available to E N Jewels when he agreed to prepare a \"History of Archbishop Holgate's Grammar School, York\" published as a book in 1962 (and thus beyond the scope of my remit).\n\nThe pattern of two dinners per year was unexpectedly interrupted almost as soon as it began. We had planned our most important reunion so far, with significant progress to report, and with the Archbishop of York as our chief guest and speaker. The meeting was to be held at Brown's Hotel as usual, on 26 November 1948. At the last minute, the Archbishop's secretary discovered that the Archbishop Holgate Society held its meetings in London and not in York - so the Archbishop had to withdraw and the meeting was cancelled! Since that time I do not think that we have ever had the pleasure of receiving an Archbishop (as Chairman of Governors) at a London meeting ( I hope to hear that this was not the case). This was the only time a reunion was cancelled in the early years - and we made up for it by holding three meetings in 1949.\n\nThe reunion held on 12 January 1949 was the first occasion on which a committee meeting was held on the same evening and at the same place as the dinner itself; the arrangement proved popular and has continued more or less ever Since.\n\nThe Holgate Portrait\n\nThe only known portrait of our Founder belongs to the Holgate Hospital at Hemsworth (founded under the terms of Robert Holgate's will); it hangs in the Governor's Room at the hospital. The Society arranged for Eric Westbrook, Principal of the Wakefield School of Art, to make a copy and this was on show for the first time at the meeting on 12 January 1949. It was subsequently handed over, on \"permanent loan\", at a ceremony held at the School on 18 February 1949.\n\nThis dinner also witnessed the introduction of the first of a series of post-prandial discussions. The topic was \"CRIME\",introduced by Harry Ward who had himself lived in an English prison for two years and had studied the prison systems of several countries. The conclusion was \"that the present crime wave is likely to grow for a while and then die down again to the astonishing orderliness which characterised us before the war\"\n\nThe November 1949 reunion was an important one for the Society and the School. Our guest speaker was Rt. Hon. J Bowes Morrell, Lord Mayor of York. His speech mainly concerned proposals and arrangements for York's celebration of the forthcoming 1951 Festival of Britain. He also announced that consideration was being given to the establishment of a new (or second) University in York. Alderman Morrell played a leading part in the successful launch of the University at Heslington in mid-1963, a few weeks before our own new school was opened on adjacent land. The Alderman's name is commemorated by the University's main library; The J B Morrell Library. The Archbishop Holgate Society was active in a number of ways in assisting the start-up of both the University and the new school - but this is a story too long to detail here."}]}