{"Robert Holgate rose quickly through the ranks of the Church, becoming Bishop of Llandaff in 1523 and Bishop of Exeter in 1525.": [{"url": "http://www.tudorplace.com.ar/Bios/RobertHolgate.htm", "page_content": "Robert H OLGATE (Archbishop of York)\n\nDied: 15 Nov 1555\n\nBuried: Church of St. Sepulchre, Holborn, London\n\nEmerges from obscurity in 1537 as Bishop of Llandaff and Master of Semperingham, home of the Gilbertine Order, and of whom it was said, a great favourite at court. He was also Lord President of the Council in the North.\n\nHe left this Bishopric to become Archbishop of York in 1545 becoming the first Protestant Archbishop of York and also the first to be married. When Henry VIII died in 1547, Robert Holgate saw the Minster stripped of half its clergy and much of its treasure under Edward VI .\n\nHe acquired much wealth, land and property, stretching from Pickering and East Yorkshire to Hemsworth. Holgate was born in Hemsworth and did not forget his native village. He left an endownment the \"Holgate Trust\" which to this day controls the Hemsworth Holgate Alms House in Robin Lane, Hemsworth. The Alms House Trust was made for the upkeep of a number of men and women of the Protesant persuasion. Holgate also left money for school at Hemsworth, York and old Malton. In May 1548 the Archbishop, by deed poll, prescribed the rules and ordinances of the Hemsworth School.\n\nHe was President of the Council in the North, but proved unable to deal with the Seamer rebellion in Aug 1549, nad was replaced by Francis Talbot, Earl of Shrewsbury . He later claimedthat it was John Dudley, Earl of Warwick who '... touke such displeasure with me that... he put me firth of the rowme of the President...'.\n\nAs the Reformation progressed and Edward VI died, his sister, the Catholic Mary assumed the throne in 1553, and Robert Holgate, to quote from the York Minster Chronicle, quickly shed his wife and his Protestant faith to save his skin.\n\nIn 1554 he was deprived of his title, and in 1555 Robert Holgate, Archbishop of York, endowed a Hospital in Hemsworth by Will."}, {"url": "https://study.com/academy/lesson/pope-gregory-xiii-accomplishments-legacy.html", "page_content": "Early Life\n\nPainting of the Council of Trent\n\nGregory XIII was born Ugo Boncompagni in Bologna, Italy, on January 1, 1502. He received his education in canon and civil law at the University of Bologna, then taught jurisprudence at the same university from 1531 up to 1539, when he departed for Rome. At the age of forty, Boncompagni was ordained a priest. Boncompagni's knowledge and expertise of canon law drew the attention of the current Pope, Pius IV, who sent him on various diplomatic missions. Boncompagni continued to move up in the ranks of the church, becoming Bishop of Viesti in 1558, and by 1565, he was a cardinal. Boncompagni also attended the final and most troubled meeting of the Council of Trent in Italy, lasting from 1562 to 1563. The Council of Trent worked to deal with the Protestant Reformation and clarify Catholic doctrine.\n\nBecoming Pope\n\nPope Gregory XIII\n\nUpon the death of Pope Pius V, the cardinals met, and on May 14, 1572, elected Boncompagni as Pope. Boncompagni decided to take the name Gregory XIII. The new pope pledged to carry out the reforming decrees made by the Council of Trent. He told bishops to make their residence in their sees and to meet the obligations of their office. A strong believer in education, Gregory XIII established a number of seminaries and colleges, including the Gregorian University, to train missionaries and priests.\n\nGregorian Calendar\n\nEngraving of Gregory XIII\n\nAt the time of Gregory XIII's papacy, the main calendar of the European world was the Julian calendar. However, the Julian calendar miscalculated the measurement of the solar year, which was actually longer than the Julian calendar, meaning the Julian calendar was losing a day per century. By Gregory XIII's time, the calendar was ten days behind the actual solar year.\n\nThe Pope enlisted the aid of Luigi Lilio Ghiraldi, a Neapolitan astronomer and Christopher Clavius, a German Jesuit, to correct the calendar. On February 24, 1582, Gregory XIII issued a bull, or a papal decree, that announced the new Gregorian calendar. This new calendar would push the date up ten days, so October 4th of 1582 would be immediately followed by the 15th. The method of calculating leap years was also revised. The calendar was initially binding on the papal states but quickly became adopted by countries under Catholic rule, and was welcomed by the astronomers Johannes Kepler and Tycho Brahe.\n\nFurther Actions as Pope\n\nGregory XIII was active in foreign affairs, backing the League in France and Mary Stuart in England, as well as recognizing Stephen Báthory as Poland's rightful king. However, the pope's reaction to the slaughter of Huguenots, or French Protestants, in France in August of 1572 would prove very controversial. Gregory had held a Te Deum, or a hymn of praise to God, in Rome in celebration of the massacre. While historians condemn Gregory for the Te Deum, others claim he believed the Huguenots were attempting to overthrow the French royal family and was not actually celebrating the bloodshed but the act of putting down a political and religious rebellion. Gregory's Te Deum remains controversial to this day."}, {"url": "https://www.britainexpress.com/cities/oxford/oxford-martyrs.htm", "page_content": "Set into the pavement in front of Balliol College on Broad Street, Oxford, is a cross made of different coloured cobblestones. The Martyrs Cross marks the traditional place where three Protestant bishops, Nicholas Ridley, Hugh Latimer, and Thomas Cranmer, were burned at the stake under Queen Mary for refusing to renounce their Protestant faith. The Oxford Martyrs The Tudor period was an era of religious turmoil prompted by Henry VIII's break from the Catholic Church. Henry's son, Edward I, continued his father's Protestant policies, but when Edward died in 1553, his half-sister Mary came to the throne. Queen Mary was a staunch Catholic and during her short and bloody reign, large numbers of high-profile Protestants were put to death for refusing to renounce their beliefs. Three of the most prominent Protestant leaders were Hugh Latimer, Bishop of Worcester, Nicholas Ridley, Archbishop of London, and Thomas Cranmer, Archbishop of Canterbury.\n\nBishop Hugh Latimer Hugh Latimer was born sometime around 1487 to a farming family in Thurcaston, Leicestershire. The exact date is unknown and has been estimated at any time between 1480 and 1494. He was educated at Clare College, University of Cambridge, and ordained as a priest in 1515. He served as a university chaplain and preacher, and he became one of a dozen priests licensed by Cambridge University to preach anywhere in England. He continued his studies until 1524 when he received a Bachelor of Divinity degree. Latimer was initially vehemently opposed to Protestantism, but after hearing the confessions of Thomas Bilney, he accepted the reforming philosophy and began to preach in favour of an English translation of the Bible. For this, he was called to explain himself before Archbishop Wolsey. He quickly became influenced by the radical writings of Martin Luther and was called before Archbishop Wolsey to defend himself from accusations of Protestantism. He satisfied Wolsey, but his freedom of movement was curtailed. When Wolsey died and was replaced by Thomas Cranmer as Archbishop of Canterbury, Latimer was unleashed. Latimer continued to preach in favour of religious reform, and in 1535 he was named Bishop of Worcester. He openly opposed the Catholic doctrines of purgatory and the mass, but when he criticised the Six Articles of 1539 he was removed as Bishop of Worcester and thrown in prison. He was released, and served for a time as the personal chaplain to Katherine Brandon, Duchess of Suffolk, but found himself back in the Tower of London by 1546. When Edward VI took the throne that year, Latimer was freed from the Tower of London and resumed his ministry. When Mary took the throne, however, it was only a matter of time before Latimer's Protestant preachings caught up with him.\n\nBishop Nicholas Ridley Born in 1500 to a wealthy family in Tynedale, Northumberland, Ridley was raised at Unthank Hall, near Haltwhistle, and was educated at Pembroke College, Cambridge. On graduation, he was ordained as a priest and went to the Sorbonne in Paris for further education before taking up the post of senior proctor at Cambridge University. In that post he was responsible for the University's resolution that the Pope had no more authority in England than any other foreign bishop. In 1537 he became one of Archbishop Cranmer's chaplains and from there, aided by Cranmer's patronage, rose steadily through the ranks of the church, becoming Bishop of Rochester in 1547. He was also one of Cranmer's closest advisors and worked with him on the 1549 Book of Common Prayer. In a peculiar twist, Ridley was forced by Cranmer to appoint the reformer John Knox to the post of vicar of All Hallows, Bread Street in London. When Edward VI died, Ridley supported the claims to the throne of Lady Jane Grey, and his signature appeared on the letters patent offering the throne to Grey. On 9 July, Ridley affirmed publicly that Mary and her half-sister Elizabeth were illegitimate. When Grey was overthrown and Mary took the throne, it was only a matter of time before she turned her anger on Ridley and other Protestant leaders.\n\nArchbishop Thomas Cranmer Thomas Cranmer was born 2 July 1489 in Aslockton, Northamptonshire, the second son of a modest gentry family. Since, as the second son, he would not inherit the family estate, Thomas embarked on a career in the church. At the age of just 14, he was sent to Jesus College, Cambridge. There he stayed for 11 years, eventually gaining a Master of Arts degree and becoming a Fellow in 1515. He married a woman we know only as Joan, which was technically allowed, as he was not yet a priest, but resulted in the loss of his fellowship at Jesus College. His wife died during childbirth and Jesus College once more accepted Cranmer as a Fellow. He was ordained as a priest in 1520 and a Doctor of Divinity in 1526. He was selected by Cardinal Wolsey as an ambassador to the Holy Roman Emperor in Spain. From 1527 he was one of several scholars called upon by Cardinal Wolsey to argue for the annulment of Henry VIII's marriage with Catherine of Aragon. Cranmer suggested calling upon university theologians throughout Europe to support the king's bid for an annulment. It was during this process that Cranmer first became exposed to the humanist philosophies of religious reform that were then sweeping Europe. In 1532 he was again an ambassador to the Holy Roman Emperor, and it was during his time on the continent that he met and married his second wife, Margarete (maiden name unknown). Contemporary records are not clear, but it seems that until clerical celibacy was established in England in 1539, Cranmer lived openly with his wife. Cranmer was named Archbishop of Canterbury in late 1532, under the patronage of the Boleyn family. He responded by organising the legal process by which Henry's marriage to Catherine was declared null, and Cranmer personally crowned Anne Boleyn as queen on 1 June 1533. He was later named as a godparent of Anne's daughter, the future Elizabeth I. Cranmer the Reformer\n\nAs Archbishop of Canterbury, Cranmer gradually moved the church towards reform, against the wishes of many of his bishops. When Anne Boleyn was accused of adultery by Henry, Cranmer was one of the few to support her cause, and he heard her confession at the Tower of London three days before her execution. Conservative clergy denounced Cranmer, but the king continued his support, and Cranmer gradually introduced more reforming policies. He was one of the executors of Henry's will and helped ensure that Edward Seymour was named as Lord Protector during Edward VI's minority. In 1549 Cranmer introduced the Book of Common Prayer, the controversial document that laid out a reforming vision for the new English church. He reformed canon law and published the Forty-Two Articles, a revised statement of Anglican doctrine. Cranmer must have known that when Mary took the throne in 1553 he would be in danger, but, unlike many religious reformers, he chose to stay in England. On 14 September he was sent to the Tower of London to await trial for treason. The trial took place on 13 November and he was found guilty and sentenced to death.\n\nThe trial took place in the University Church of St Mary the Virgin The Bishops on Trial On 8 March 1554, the Privy Council ordered Ridley, Latimer, and Cranmer to be taken to the Bocardo prison in Oxford to await trial for heresy. The bishops were kept in the prison for 17 months before their trials began. The city of Oxford bore the cost of keeping the bishops. The cost of supplying the faggots used to burn Archbishop Cranmer were charged to his expense account, which the city tried, unsuccessfully, to claim back from the Archbishop of Canterbury. Cranmer was tried first, while Ridley and Latimer were tried together. In the case of Ridley and Latimer, the verdicts were very quick; they were sentenced to be burned at the stake. The trials were held at the Church of St Mary the Virgin in Oxford, where you can still see a notch made in one of the nave columns where it was cut away to create a wooden platform. All three were found guilty because they refused to accept transubstantiation, the process by which the wine and bread offered during communion becomes the blood and body of Christ."}, {"url": "https://www.britannica.com/topic/bishop-Christianity", "page_content": "bishop, in some Christian churches, the chief pastor and overseer of a diocese, an area containing several congregations. Roman Catholic, Eastern Orthodox, and other churches have maintained the view that bishops are the successors of the Apostles and that an unbroken line of succession connects the Apostles to all legitimate bishops, a doctrine known as apostolic succession. Until February 11, 1989, when Barbara Harris was ordained a bishop in the Episcopal Church in the United States of America, the apostolic-succession churches had reserved the office only for men.\n\nAlthough the New Testament mentions the office of bishop, its origins are obscure. It seems that the episcopacy—or threefold ministry of bishops, priests, and deacons—was well established in the Christian church by the 2nd century ce. From the Roman Empire’s recognition of Christianity in the 4th century ce until the Protestant Reformation in the 16th century, the bishop was the chief pastor, priest, administrator, and ruler of his diocesan Christian community. He was the chief liturgical minister; he baptized, celebrated the Eucharist, ordained, absolved, controlled church finances, and settled matters of dispute.\n\nBritannica Quiz Pop Quiz: 19 Things to Know About Christianity\n\nIn the course of the Reformation, some of the new Protestant churches repudiated the office of the bishop, partly because they believed the office to have acquired such broad temporal and civil powers during the Middle Ages as to endanger its spiritual purity, and partly because they saw no basis for the institution in the New Testament. Thus, of the post-Reformation Christian communions, only the Roman Catholics, the Eastern Orthodox, Old Catholics, Anglicans, and a few others have maintained both the bishop’s office and the belief that bishops have continued the apostolic succession. Some Lutheran churches (in the United States, Scandinavia, and Germany) have bishops, but, except for those in Sweden, they have not maintained the doctrine of apostolic succession. Most other Protestant churches do not have bishops. In the United Methodist Church in the United States, bishops function as superintendents of several congregations and have the power to ordain ministers. In other Protestant churches, bishops have various functions.\n\nPopes, cardinals, archbishops, patriarchs, and metropolitans are different gradations of bishops. A bishop is often assisted in the administration of his diocese by other, lesser bishops, who may be known as suffragans, assistants, auxiliaries, or coadjutor bishops. Bishops alone have the right to confirm and ordain members of the clergy, and their main duty is to supervise the clergy within their diocese. In the Roman Catholic Church, the bishop is selected by the pope and receives confirmation in his office at the hands of an archbishop and two other bishops. In the Anglican and other churches, a bishop is chosen by the dean and chapter of the cathedral of a diocese. In the Methodist churches, the bishop is chosen by jurisdictional conferences. Among the insignia traditional to a bishop are a mitre, pastoral staff, pectoral cross, ring, and caligae (i.e., stockings and sandals). See also ministry."}, {"url": "https://danteworlds.laits.utexas.edu/textpopup/inf1901.html", "page_content": "Pope Boniface VIII: Circle 8, Inferno 19\n\n\n\nUnam sanctam)--that the pope was not only the spiritual head of Christendom but also superior to the emperor in the secular, temporal realm. Dante, by contrast, firmly held that the pope and emperor should be co-equals with a balance of power between the pope's spiritual authority and the emperor's secular authority. Boniface's political ambitions directly affected Dante when the pope--under the false pretense of peace-making--sent Charles of Valois, a French prince, to Florence; Charles' intervention allowed the black guelphs to overthrow the ruling white guelphs, whose leaders--including Dante, in Rome at the time to argue Florence's case before Boniface--were Divine Comedy by damning the pope even before his death in 1303 (the journey takes place in 1300): in the pit of the simonists, Pope Nicholas III, who can see the future (like all the damned), mistakenly assumes that Dante is Boniface come before his time (Inf. 19.49-63). Boniface, for Dante, is personal and public enemy number one. Benedetto Caetani, a talented and ambitious scholar of canon law, rose quickly through the ranks of the church and was elected pope, as Boniface VIII, soon after the abdication of Pope Celestine V in 1294. (There were rumors that Boniface had intimidated Celestine into abdicating so he could become pope himself.) Boniface's pontificate was marked by a consolidation and expansion of church power, based on the view--expressed in a papal bull ()--that the pope was not only the spiritual head of Christendom but also superior to the emperor in the secular, temporal realm. Dante, by contrast, firmly held that the pope and emperor should be co-equals with a balance of power between the pope's spiritual authority and the emperor's secular authority. Boniface's political ambitions directly affected Dante when the pope--under the false pretense of peace-making--sent Charles of Valois, a French prince, to Florence; Charles' intervention allowed the black guelphs to overthrow the ruling white guelphs, whose leaders--including Dante, in Rome at the time to argue Florence's case before Boniface--were sentenced to exile . Dante now settles his score with Boniface in theby damning the pope even before his death in 1303 (the journey takes place in 1300): in the pit of the simonists, Pope Nicholas III, who can see the future (like all the damned), mistakenly assumes that Dante is Boniface come before his time (19.49-63)."}, {"url": "https://www.adducation.info/general-knowledge-politics-religion/catholic-and-anglican-titles/", "page_content": "Approximate ranking: God, the Pope, cardinals, archbishops, bishops, priests and deacons.\n\nCatholic church titles positions. Jesus Christ is the head of the Anglican church. Queen Elizabeth II is the supreme governor. Then follow the archbishop of Canterbury, Archbishops of Wales and York, bishops, archdeacons, deacons, priests, deans, canons (or prebendary), vicars, rectors, chaplains and curates.\n\nArchbishop Abp., Archiep., Archiepus. Head bishop. Office occupied mainly by a bishop in charge of metropolitan and some titular sees. An Archbishop is a head bishop. There are three archbishops: The Archbishop of Canterbury is the spiritual leader of Anglicans worldwide\n\nThe Archbishop of York\n\nThe Archbishop of Wales.\n\nArchdeacon Archid. Formerly a senior official who assisted the bishop in non-spiritual matters (like an Executive Assistant). The role is nowadays performed by qualified laypersons or vicars, deans, etc. Archdeacons are senior clergy who assist the bishop with administration matters. For example, responsibility for (church) buildings, welfare issues etc. Archdeacons are often seen as the extended “eyes and ears” of the bishop.\n\nBishop EPS, EP., Episc., Epus. overseer, elder A bishop is a sacramental position (baptism, confession, marriage etc.). Bishops are considered successors of the Apostles and teachers of doctrine. The Pope is also a bishop. A bishop usually supervises several “dioceses” (a province) typically over a large region. A diocese includes groups of congregations and priests. A bishop must first have been a priest.\n\nCanon rule Members of a cathedral chapter. Honorary title for clergy or lay persons for long or distinguished services to the church.\n\nCardinal hinge, as in “pivotal” Office occupied by bishops. “Princes of the Church” appointed by the Pope. There are no cardinals in the Anglican church hierarchy.\n\nChaplain cloak A Chaplin is a clergy member outside of a parish who organizes worship within non-religious organizations, for example in hospitals, schools and the military. The Catholic and Anglican titles are the same. The Catholic and Anglican titles for a chaplin are the same. A chaplin is a clergy member outside of a parish who organizes worship within non-religious organizations, for example in hospitals, schools and the military.\n\nCurate C.C. cure or care of souls A curate is a senior priest within a parish. Curate is an administrative position. A deacon or priest who assists a parish Incumbent.\n\nDeacon servant A deacon is a sacramental position (baptism, confession, marriage etc.) to assist the pastor with teaching, parish work and counseling. Deacons can be either: Transitional: Students who become priests after a year\n\nPermanent: Those not wishing to become a priest. A deacon proclaims the Gospel and assists at Holy Communion.\n\nDean Dec head of ten Dean is a title given to senior pastors without diocesal authority. A Dean often mentors and leads local pastors. A dean is a senior vicar in charge of a cathedral and the most senior priest of a diocese (dener) under the bishop.\n\nFather Pr. Father is a form of address for some clergymen wishing to identify themselves as members of the Catholic church. Used only by invitation. –\n\nIncumbent lie down – Term for responsible clergy member in a parish or congregation. More commonly termed “rector”.\n\nMinister servant A minister is a person (not a rank) who performs acts for the Church. Also used to denote various clergy roles; priests, bishops etc. A minister is authorized to perform religious functions.\n\nMonsignor Mgr., Msgr., Mons. my lord Monsignor is an honorary title and office held by priests. Conferred by the Pope on priests who are adopted into the papal household. There are no Monsignors in the Anglican church hierarchy.\n\nParson person (in charge of a church) There are no parsons in the Catholic church hierarchy. A parson can be any clergy member. Historically a parson is a salaried priest with a parish.\n\nPastor Pr. shepherd, feeder A pastor is a priest who has been entrusted with a parish by a bishop. A pastor is the spiritual leader of a congregation. Unofficially used for “Rector” or “Incumbent”. In UK “minister” is also used.\n\nPope PP. father The pope is a special bishop who has power to make binding decisions for all Catholics. It’s a sacramental position to a degree. Vicar of Christ and Supreme Pontiff. The pope is viewed as the successor of St Peter (chief of the Apostles) and head of the College of Bishops. There is no pope in the Anglican church hierarchy.\n\nPresiding Bishop – An Anglican presiding bishop usually presides over a large region or nation. In the USA a presiding bishop is equivalent to a Catholic Primate.\n\nPriest Pbr., Presbit., PRB. church elder A Catholic priest is a sacramental position (baptism, confession, marriage etc.). Catholic priests are ordained men who consecrate and offer the body and blood of Christ in the Mass and mediates between people and God. An Anglican priest is someone who stands in place of Christ, e.g. a vicar, but who offers a sacrifice (the Eucharist or body of Christ). A priest can absolve a person from sin. An Anglican priest must previously have been a deacon.\n\nPrimate chief In the Catholic church ranks a primate is usually a title for first or oldest bishop in country. In the Anglican church a primate is a bishop presiding over the church in a large region or nation. In the USA a presiding bishop is equivalent to a Catholic Primate.\n\nRector P.R. (“Permanent Rector”), M.R. (“Missionary Rector”) put straight A rector is a person presiding over an ecclesiastical institution. Historically the title of rector within the Anglican church is essentially the same as a vicar; i.e. a priest with primary administrative and pastoral duties in a congregation.\n\nReverend Rt. Rev. (Right Reverend) respect Reverend is one of the Catholic and Anglican titles which is a general term of address for clergymen in both the Catholic and Anglican church. For example The Reverend Deacon, The Reverend Canon etc. Reverend is a general term of address for clergymen in both the Anglican and Catholic church. For example The Reverend Deacon, The Reverend Canon etc."}, {"url": "https://poemanalysis.com/robert-browning/the-bishop-orders-his-tomb/", "page_content": "‘The Bishop Orders His Tomb’ by Robert Browning reveals the deep-rooted fears and lack of belief in the heart of one of the church leaders. On his death bed, rather than hoping for the life to come or being thankful, he had devoted his life to serving God, this bishop is filled with feelings of fear, regret, petty materialism, and even jealousy. ‘The Bishop Orders His Tomb’ is ironic in its very nature as this man who, most of his life, was looked to as a religious authority figure, gloats in his sins including an affair and a love for material wealth. He mentions various possibilities of what might happen to him when he dies, but ultimately seems convinced that he will stay right there in his tomb for all of eternity. Every belief, feeling, and request that this bishop expresses reveals that in his heart, he believes exactly the opposite of what he has taught throughout his life.\n\nThe Bishop Orders His Tomb Analysis\n\nLines 1-13\n\nVanity, saith the preacher, vanity! Draw round my bed: is Anselm keeping back? Nephews—sons mine . . . ah God, I know not! Well— She, men would have to be your mother once, Old Gandolf envied me, so fair she was! What’s done is done, and she is dead beside, Dead long ago, and I am Bishop since, And as she died so must we die ourselves, And thence ye may perceive the world’s a dream. Life, how and what is it? As here I lie In this state-chamber, dying by degrees, Hours and long hours in the dead night, I ask “Do I live, am I dead?” Peace, peace seems all.\n\nRobert Browning begins ‘The Bishop Orders His Tomb’ with an immediate reference to the book of Ecclesiastes, found in the Old Testament. Ecclesiastes 1:1 states, “Vanity of vanities, says the Preacher,\n\nvanity of vanities! All is vanity.\n\nThis reference sets the tone for the rest of ‘The Bishop Orders His Tomb’. The speaker is a Bishop, one who is considered a religious leader. He is clearly familiar with scripture, as he begins with a reference to the book of Ecclesiastes. However, his choice of scripture to quote on his deathbed seems quite strange. The book of Ecclesiastes itself ends with hopefulness for a life after death, even if everything “under the sun” is futile. But the bishop doesn’t quote the end of the book, nor does he quote any of the countless scripture verses that support the idea of life after death in paradise. Rather, he quotes the despairing voice of King Solomon, who, after acquiring all the wealth there was to be gained, still considered everything futile. This opening line sets the tone and reveals to the readers that this religious leader identifies with King Solomon in his despair, feeling that everything is vanity, that everything is meaningless. He questions whether life is nothing but a dream, and he even questions whether he is currently alive or dead.\n\nThe Bishop then begins to give his nephews, and possibly one son, directions for his death and burial. He refers to a mistress that has long been dead, which implies that he is talking to not only nephews, but also an illegitimate son. He begins to question life. This is ironic, because his entire life as a religious leader, he was the one people looked to for answers to these very types of questions. And yet, as he laid on his deathbed, he asked, “Life, how and what is it?” He has yet to figure out the meaning of life.\n\nLines 14-30\n\nSaint Praxed’s ever was the church for peace; And so, about this tomb of mine. I fought With tooth and nail to save my niche, ye know: —Old Gandolf cozened me, despite my care; Shrewd was that snatch from out the corner South He graced his carrion with, God curse the same! Yet still my niche is not so cramped but thence One sees the pulpit o’ the epistle-side, And somewhat of the choir, those silent seats, And up into the aery dome where live The angels, and a sunbeam’s sure to lurk: And I shall fill my slab of basalt there, And ‘neath my tabernacle take my rest, With those nine columns round me, two and two, The odd one at my feet where Anselm stands: Peach-blossom marble all, the rare, the ripe As fresh-poured red wine of a mighty pulse.\n\nIn this section of ‘The Bishop Orders His Tomb’, the speaker refers to Saint Praxed Church, which is apparently the place he is to be buried. He goes on to give his nephews and son specific instructions, and he reveals how important his resting place is to him when he says that he “fought with tooth and nail” for the specific place where he wanted his tomb. This seems strange for a bishop to say, as church leaders teach and promote the belief that one leaves the body and joins Christ in heaven upon death. If the bishop believed this, why should he be so concerned about his physical, earthly resting place?\n\nThis is only the beginning of the bishop revealing beliefs and actions that go against the teachings of the church. In the very next line, he accuses Gandolf, most likely his predecessor, or deceiving him, snatching up the best resting place before his death. He exclaims, “God curse the same!” in which he curses Gandolf. This also seems contradictory to his life’s position and work as a bishop. In the rest of this section, the bishop requires to be laid to rest within hearing distance of the choir, and where the sunbeams would shine, and where he would enjoy a beautiful view. All of these requests contradict the church’s teaching that the soul leaves the body upon death. The bishop’s request seems to infer that he beliefs he will stay in his resting place.\n\nLines 31-44\n\n—Old Gandolf with his paltry onion-stone, Put me where I may look at him! True peach, Rosy and flawless: how I earned the prize! Draw close: that conflagration of my church —What then? So much was saved if aught were missed! My sons, ye would not be my death? Go dig The white-grape vineyard where the oil-press stood, Drop water gently till the surface sink, And if ye find . . . Ah God, I know not, I! … Bedded in store of rotten fig-leaves soft, And corded up in a tight olive-frail, Some lump, ah God, of lapis lazuli, Big as a Jew’s head cut off at the nape, Blue as a vein o’er the Madonna’s breast …\n\nThis section reveals that the bishop has been planning for his death for quite some time. Most of the materials he has listed here are things he has been storing up in preparation for his death, so that his tomb might not be forgotten. He wants to be remembered on the earth, and this section reveals that he believes the best way to do it is to create a tomb for himself that everyone would awe. He had saved up these materials in the “white grape vineyard” and he told his listeners to do dig up the “fig leaves” and “lapis lazuli” (a bright blue rock) that he had buried to be used one day. He wished to be laid on the soft fig leaves, and to have his tomb decorated with the beautiful blue stone he had reserved for this very purpose. In this section, he is giving directions to those who will bury him.\n\nLines 45-56\n\nSons, all have I bequeathed you, villas, all, That brave Frascati villa with its bath, So, let the blue lump poise between my knees, Like God the Father’s globe on both His hands Ye worship in the Jesu Church so gay, For Gandolf shall not choose but see and burst! Swift as a weaver’s shuttle fleet our years: Man goeth to the grave, and where is he? Did I say basalt for my slab, sons? Black— ‘Twas ever antique-black I meant! How else Shall ye contrast my frieze to come beneath? The bas-relief in bronze ye promised me,\n\nThis section is a continuance of the bishop’s directions for his own burial. He addresses his listeners as “sons” and tells them to make sure to put part of the bluestone he’s stored up “between [his] knees” which suggests a belief in the pagan ritual of burying their loved ones with wealth to take with them into the next life. He then goes on to continue describing what he wants the outside of his tomb to look like, requesting “basalt for [his] slab” which he specifically wants to be “antique black” and “bronze” and covered in blue jewels. This continues to contrast his very position in life, as he is adhering to some ancient beliefs the church had long since denied concerning the ability to take wealth with you into the next life. This section also reveals that he has put so much thought into what his tomb will look like, and little thought to the condition of his soul. This section shows the bishop to be entirely materialistic, which is not what one would expect from a religious leader.\n\nLines 56-67\n\nThose Pans and Nymphs ye wot of, and perchance Some tripod, thyrsus, with a vase or so, The Saviour at his sermon on the mount, Saint Praxed in a glory, and one Pan Ready to twitch the Nymph’s last garment off, And Moses with the tables . . . but I know Ye mark me not! What do they whisper thee, Child of my bowels, Anselm? Ah, ye hope To revel down my villas while I gasp Bricked o’er with beggar’s mouldy travertine Which Gandolf from his tomb-top chuckles at!\n\nIn this section, the bishop goes so far as to list pagan gods including “Pans” and “Nymphs” along with the “Saviour” and “Moses”. This suggests a complete and total uncertainty about his beliefs. He seems to be covering his bases, so to speak. In other words, in case the pagan beliefs are true, he will be buried with some wealth. In case of the church’s teachings being true, he mentions his “Saviour” and “Moses” on his deathbed. This suggests a lack of belief. In fact, he seems to be grasping at every possibility, revealing that although he has served as a religious leader, he actually has no idea what he believes, and he is afraid of death. He is so focused on leaving a beautiful tomb to keep his memory alive. This reveals that the bishop is not sure that there is any afterlife at all, and if that is the case, then he wishes to make for himself a monument by which to be remembered on earth.\n\nLines 68-75\n\nNay, boys, ye love me—all of jasper, then! ‘Tis jasper ye stand pledged to, lest I grieve. My bath must needs be left behind, alas! One block, pure green as a pistachio-nut, There’s plenty jasper somewhere in the world— And have I not Saint Praxed’s ear to pray Horses for ye, and brown Greek manuscripts, And mistresses with great smooth marbly limbs?\n\nThis section of ‘The Bishop Orders His Tomb’ continues to reveal the bishop’s lack of belief in an afterlife as he gives more specific directions for his tomb. He wants it to be inlaid not only with the blue jewels he has already described, but also with “jasper” that is “as green as a pistachio-nut” and he asks them to go and find the jasper to use for his tomb, claiming that “There’s plenty jasper somewhere in the world”. He then asks them to carve images of beautiful women on his tomb, which he describes as “mistresses with great smooth marbly limbs”. This is also an ironic request, considering his role as a bishop, a church leader.\n\nLines 76-84\n\n—That’s if ye carve my epitaph aright, Choice Latin, picked phrase, Tully’s every word, No gaudy ware like Gandolf’s second line— Tully, my masters? Ulpian serves his need! And then how I shall lie through centuries, And hear the blessed mutter of the mass, And see God made and eaten all day long, And feel the steady candle-flame, and taste Good strong thick stupefying incense-smoke!\n\nIn this section, he asks his hearers to write Latin phrases on his tomb, and specifically requests that they be better phrases than those engraved on Gandolf’s tomb. The Bishop then laments about lying there in his grave “through centuries” listening to “the blessed mutter of the mass” and being “eaten” by worms “all day long”. He hopes he will at least be able to “feel the steady candle flame” and “taste” the “incense smoke”. This continues to reveal the bishop’s lack of belief in heaven as an after-life.\n\nLines 85-93\n\nFor as I lie here, hours of the dead night, Dying in state and by such slow degrees, I fold my arms as if they clasped a crook, And stretch my feet forth straight as stone can point, And let the bedclothes, for a mortcloth, drop Into great laps and folds of sculptor’s-work: And as yon tapers dwindle, and strange thoughts Grow, with a certain humming in my ears, About the life before I lived this life, And this life too, popes, cardinals and priests, Saint Praxed at his sermon on the mount, Your tall pale mother with her talking eyes, And new-found agate urns as fresh as day, And marble’s language, Latin pure, discreet, —Aha, ELUCESCEBAT quoth our friend? No Tully, said I, Ulpian at the best!\n\nThe bishop begins this section by going into detail about what it feels like to be dying “by such slow degrees”. He then describes his death as he “fold[s] [his] arms” and “stretch[es] [his] feet” and allows the burial clothes to be laid over him”. He talks as if he will still be conscious of what is happening to him even in death. He goes on to describe “a certain humming in [his] ears” and seems to believe that he will lie in his tomb for eternity, thinking about this life. He believes in death that he will remember his mistress. He addresses his son when he says that he will think of, “[his] tall pale mother with her talking eyes”. He’s having a mistress also contradicts his position as a leader in a Christian church. But this bishop, thus far, shows no interest in convincing his hearers of his Christian beliefs or lifestyle, but rather on his deathbed talks of every action and belief that contradicts the Christian lifestyle and theology.\n\nLines 94-118\n\nEvil and brief hath been my pilgrimage. All lapis, all, sons! Else I give the Pope My villas! Will ye ever eat my heart? Ever your eyes were as a lizard’s quick, They glitter like your mother’s for my soul, Or ye would heighten my impoverished frieze, Piece out its starved design, and fill my vase With grapes, and add a vizor and a Term, And to the tripod ye would tie a lynx That in his struggle throws the thyrsus down, To comfort me on my entablature Whereon I am to lie till I must ask “Do I live, am I dead?” There, leave me, there! For ye have stabbed me with ingratitude To death—ye wish it—God, ye wish it! Stone— Gritstone, a-crumble! Clammy squares which sweat As if the corpse they keep were oozing through— And no more lapis to delight the world! Well, go! I bless ye. Fewer tapers there, But in a row: and, going, turn your backs —Ay, like departing altar-ministrants, And leave me in my church, the church for peace, That I may watch at leisure if he leers— Old Gandolf, at me, from his onion-stone, As still he envied me, so fair she was!\n\nIn this last section, the bishop tells his listeners that if they love him at all, they will do as he has asked them to do for him, turning his tomb into a beautiful work of art by which the world would remember him. He acknowledges that his life has been short and evil, when he says, “Evil and brief hath been my pilgrimage”. And at that, he continues to request more and more blue jewels to be inlaid in his tomb. He asks them to carve a vase full of grapes on the wall of his tomb. He gives further instruction for what to engrave on his tomb, specifically instructing, “And to the tripod ye would tie a lynx\n\nThat in his struggle throws the thyrsus down” which suggests that there will be intricate artwork of a lynx (a beautiful wild cat), tied to a tripod and struggling with a thyrsus (some sort of cane). It is likely that these pictures represent the struggle the bishop has felt in life. He tells his hearers that these works of art on his tomb would “comfort [him] on [his] entablature” (tomb). In his tomb, he believes, he will lie and ask himself, “Do I live? Am I dead?”\n\nAt this point, it seems the bishop begins to panic, crying out to God, nature, whomever there is to cry out to, asking why he is destined to lay in the stone which will “crumble” in a “clammy” confined tomb in which his very own corpse will begin to deteriorate. The bishop can imagine people leaving him there in his tomb, and he can no longer delight in the “lapis” of the world, nor in any other beauty the earth has to offer. He can imagine his predecessor, Gandolf, laying in the tomb that the bishop had intended for himself. He imagines that Gandolf, in his tomb, will envy the bishop for the tomb he has made for himself. This is revealed in the last two lines of ‘The Bishop Orders His Tomb’, in which the bishop says,\n\nOld Gandolf, at me, from his onion-stone, As still he envied me, so fair she [the bishop’s tomb] was!\n\nConclusion\n\nThe entirety of The Bishop Orders his Tomb is the laments of a dying church leader who does not actually believe in what he has been teaching his whole life. This is implied by his deep concern with the materialistic beauty of his tomb and his request to be buried with precious stones. His mentioning of pagan gods along with Jesus and Moses reveals his attempt to “cover his bases” but also shows that he has no real faith in what he has claimed to believe for his whole life. He does not talk about meeting his savior or life after death in paradise, but is rather concerned with the material aspect of his tomb, his memory on earth, and the comfort of his dead body. The Bishop Orders his Tomb is ironic in nature as this religious leader dies with no assurance of comfort in death or life after death, but rather with a feeling of utter meaninglessness and a strong desire to create an extravagant piece of art out of his tomb in order to be remembered."}, {"url": "https://newpittsburghcourier.com/2021/05/20/couriers-men-of-excellence-pivots-during-pandemic-but-show-ultimately-goes-on/", "page_content": "by Rob Taylor Jr.\n\nCourier Staff Writer\n\nThe New Pittsburgh Courier’s “Men of Excellence” awards celebration was put on pause due to the COVID-19 pandemic.\n\nBut it was never “canceled.”\n\nHow could an occasion that spotlights some of the most accomplished African American men in the nearly two million residents of the Pittsburgh region just…not happen? Sure, it may have been put on hold for, oh, 500 days (but who’s counting), but on April 16, the awards show that’s got the men showing up in their Sunday Best finally took place.\n\nSavoy Restaurant was the location—owned by an African American man and former Courier “Men of Excellence” honoree, Chuck Sanders—as about 13 men per hour came to the lounge to accept their award, four hours total. Everyone wore masks, the crowd was socially distanced, and, all in all, the Courier’s first event in its history that occurred during a pandemic went off without a hitch.\n\nThe Self-Starters — The Motivators — The Overachievers — The Changemakers\n\n“Change will not come if we wait for some other person or some other time.\n\nWe are the ones we’ve been waiting for. We are the change that we seek.”\n\n— Former President Barack Obama\n\n“To be in the number amongst this group of excellent men is something that I’m thankful for, and I’m grateful to God for any bit of recognition for the things I might do or say across the country,” voiced Marlin Woods, CPC. Woods is executive chairman of BenefitsPLUS, an advisory board of professional healthcare and benefits decision-makers which discover health and welfare benefits innovations, products and services for procurement opportunities. He also authored a book, “Courting The Employ(H)er: A Business-To-Business Romance,” and is a national public speaker on sales behavior and motivational messaging.\n\nHONOREE ROBERT D. WALKER, with his daughter, Randi.\n\n“I love doing the work I do, helping the community,” said Luther J. Dupree Jr., whose day job is service coordinator at Pittsburgh Mercy, and true passion is his Steel City Sports World TV show that’s been running for years on PCTV-21. Oftentimes, Dupree features Black high school athletes in Pittsburgh’s City League that otherwise would not get recognition. “I’m going to continue to do what I do and just work and strive to make this place a place to live where everybody’s accepted.”\n\n“I’m humbled and I’m honored to be presented with such a prestigious award,” echoed Eric Gibson, the senior executive career coach at Nazareth Prep, a private Catholic high school that has a majority-Black student population. “Essentially every day in my job and my career, I’m trying to make a positive impact, I’m trying to make a big splash in service to others. When you serve, you move action forward.”\n\nGibson, the Ambridge resident who’s married with two sons and a daughter, said he found his calling 30 years ago to be an inspirational motivator, working with hundreds of youth from unfortunate backgrounds of neglect and abuse.\n\nHONOREE SHABANA PERKINS receives his Men of Excellence award from New Pittsburgh Courier Editor and Publisher Rod Doss. (Photos by Courier photographer J.L. Martello)\n\nThis special Men of Excellence “Class of 2021” also featured a number of entrepreneurs. Michael Barnes moved to Pittsburgh from New Orleans, and created Roux Orleans Catering, bringing the Southern Creole flavors up North. Robert Fulton has owned Fulton Home Building & Remodeling for more than a generation, where he’s especially proud to employ youth from Pittsburgh’s Black community. And Damon Givner owns R&R Trucking, LLC, telling the Courier he’s “always had a passion for trucks.” He told Larissa Lane, the Courier guest correspondent for the event, that if someone wants to get into the trucking business, it’s “10 toes down. It’s a hands-on business. You need to learn the trucks…it’s a rough business. It can go either way. Just as well as it makes you a lot of money, the trucks, if you’re not able to maintain them, it’ll take you down.”\n\nMEN OF EXCELLENCE HONOREES TERRY SMITH AND MICHAEL POTTER.\n\nAmong this special class were some men with entire universities on their shoulders. Chris Howard, the president of Robert Morris University, was an honoree, as was Roger W. Davis, the president of Community College of Beaver County.\n\nHONOREE CHESTER D. THOMPSON, DSc, right. (Photos by Courier photographer J.L. Martello)\n\nCourier Editor and Publisher Rod Doss opened the event by welcoming each set of honorees to Savoy, then Courier Advertising Coordinator Ashley Johnson thanked the event’s sponsors. Lane, who is an entrepreneur in the fashion and beauty industry, interviewed a number of honorees throughout the four-hour event, as the festivities were recorded so that a “virtual event” could be watched online beginning May 20 at 6 p.m. on the Courier’s Facebook page and website, newpittsburghcourier.com.\n\nThe April 16 event at Savoy didn’t allow outside spectators to attend, such as family and friends, due to the pandemic.\n\nThe legacy honoree for this year’s Men of Excellence was Bishop Loran E. Mann, senior pastor at Pentecostal Temple Church of God in Christ in East Liberty. He was unable to attend the April 16 event, and it saddened many in the Pittsburgh area who learned of his passing on May 2. Bishop Mann was 74, and was a pioneering figure in Pittsburgh media as the first Black full-time news anchor on KDKA Radio, then had a 20 year run as a reporter on WPXI-TV.\n\nMEN OF EXCELLENCE CLASS OF 2021 LEGACY HONOREE\n\nBishop Loran E. Mann\n\nAug. 8, 1946—May 2, 2021\n\nThe New Pittsburgh Courier expresses its most heartfelt condolences to the family of the revered late Bishop Loran E. Mann.\n\nEach time that the Courier holds its Men of Excellence Awards Ceremony, we honor a legacy honoree who, usually for decades, has been an immovable force in Pittsburgh in his profession and in his benevolence. We couldn’t think of a more deserving person for the award than Bishop Loran E. Mann, whose larger-than-life presence and voice was heard first on KDKA Radio (1020) and then WPXI-TV (Channel 11) until his retirement in the early 1990s.\n\nBut there was more to Bishop Mann than the microphone and the video camera.\n\nWhen a person is driven, led by the power of the Lord, they know that anything is possible. Before the age of 25, Bishop Mann had become a pastor at a Baptist church in Braddock Hills. But at the heart, he was always Pentecostal. He left First Baptist Church to start his own Pentecostal church—but he had no physical building. And less than 20 members.\n\nNo problem.\n\nBishop Mann would have services underneath tents, until he was able to find a small physical location in Wilkinsburg beginning in 1971. Pentecostal Temple Church of God in Christ continued to grow, and eventually, a million-dollar sanctuary was constructed at Larimer Avenue and East Liberty Boulevard, where services have been held now for almost 30 years, and home to nearly 1,000 members.\n\nBishop Mann rose up the ranks in the Church of God in Christ, becoming Bishop of the state of Vermont Jurisdiction in 2011, a crowning achievement. And just a few months ago, Bishop Mann was elected to the COGIC General Board, a select group of 12 Bishops in the Church that set the direction and its policies. Another crowning achievement.\n\nThe Courier had its Men of Excellence Awards Ceremony at Savoy Restaurant, in the Strip District, on April 16. We learned, however, that Bishop Mann would be unable to attend. A few weeks later, on Sunday, May 2, we learned that Bishop Mann had died.\n\nA Lying in Honor ceremony will be held on Monday, May 24, from noon to 9 p.m. at the church, 6300 East Liberty Boulevard. A Jurisdictional and Family Homegoing Celebration will be held, Tuesday, May 25, at 6 p.m. also at the church. A National Homegoing Celebration will be held on Wednesday, May 26, at 10 a.m. at Victory Family Church, 21150 Route 19, Cranberry Township.\n\nBishop Mann is survived by his wife, Barbara, and children, Tiana and Loran II.\n\nMen Of Excellence Class of 2021\n\nBYRON T. ALLEN\n\nProject Manager, Highmark\n\nTHOMAS BURLEY\n\nCommunity Leader—Retired, Westinghouse\n\nElectric Power Systems\n\nJOHNNIE BURTON\n\nOwner, BFF Arbor & Lawn\n\nSTEPHAN DAVIS\n\nPresident & Executive Coach, Davis &\n\nAssociates\n\nDERRICK DAVIS\n\nFounder & CEO, H.L.R. Entertainment,\n\nLLC\n\nLUTHER J. DUPREE JR.\n\nService Coordinator, Pittsburgh Mercy\n\n— Producer/Host, Steel City Sports\n\nWorld\n\nKELTON EDMONDS, PH.D.\n\nProfessor, California University of Pa.\n\nVINCENT D. ELLIOTT\n\nPresident, Western PA Council of\n\nHBCU Alumni\n\nGEORGE FLEMING\n\nProgram Supervisor and Outreach\n\nSpecialist, Fathers Involved Now\n\nProgram, Allegheny Family Network\n\nROY BLANKENSHIP JR.\n\nCommunity Outreach Manager, Hilltop\n\nAlliance — Founder, Blankenship\n\nEstate Enterprises\n\nALLAN FRANCETTE\n\nOwner, Big Al’s Unisex Hair Salon\n\nBRANDON WHITE\n\nVice President & Senior Recruiter,\n\nBNY Mellon\n\nROGER W. DAVIS, ED.D.\n\nPresident, Community College of\n\nBeaver County\n\nERIC GIBSON\n\nSenior Executive Career Coach,\n\nNazareth Prep\n\nDAMON GIVNER\n\nOwner, R&R Trucking, LLC\n\nBRENT JERNIGAN\n\nAssistant Head of Schools, The\n\nNeighborhood Academy\n\nELIJHA DAVID KING\n\nOwner & Director, Oakland Fashion\n\nOptical\n\nTAYON MITCHELL\n\nPresident & CEO, Engrade Financial\n\nGroup\n\nALTON MITCHELL\n\nMinister of Worship & Arts, Rodman\n\nStreet Missionary Baptist Church\n\nCHARLES J. REEVES\n\nDeputy Chief Operations Officer, Port\n\nAuthority of Allegheny County\n\nCHESTER D. THOMPSON, DSc.\n\nAssociate Dean, School of Business,\n\nArts, Science and Technology, Community\n\nCollege of Beaver County\n\nREV. JOHN C. WELCH, PH.D.\n\nMedical Ethicist and Community\n\nEngagement Consultant\n\nMICHAEL BARNES\n\nOwner, Roux Orleans Catering\n\nCHRIS HOWARD\n\nPresident, Robert Morris University\n\nKELLY E. MORRISSEY\n\nLaw Enforcement, Federal and State\n\nof Pennsylvania\n\nSHABAKA PERKINS\n\nCo-Founder & Director, Sankofa\n\nVillage for the Arts\n\nANTHONY W. PIPKIN\n\nAssistant Principal at Pittsburgh Morrow,\n\nPittsburgh Public Schools\n\nMICHAEL POTTER\n\nFounder and CEO, Black Brew Culture—\n\nCo-Founder, Blacktoberfest\n\nJACE RANSOM\n\nOut of School Time Manager, Office\n\nof Community Services, Allegheny\n\nCounty DHS\n\nLELAND SCALES\n\nNonprofit Partner Field Manager, 412\n\nFood Rescue\n\nGEORGE C. SPENCER SR.\n\nPresident, Greater Pittsburgh Area\n\nMAD DADS Chapter\n\nCHRISTOPHER W. ROBINSON\n\nAssociate Professor, Community\n\nCollege of Allegheny County\n\nLELAND SCALES\n\nNonprofit Partner Field Manager, 412\n\nFood Rescue\n\nSHAWN THOMAS\n\nEntrepreneur Lending Director,\n\nBridgeway Capital\n\nWILLIAM SIMMONS, M.D.\n\nAssociate Professor, School of Medicine,\n\nUniversity of Pittsburgh—Past\n\nPresident, Gateway Medical Society\n\nTERRY SMITH\n\nFounder, President & CEO, M-Powerhouse\n\nof Greater Pittsburgh— Founder,\n\nWisdom, Work & Wealth, LLC\n\nMARK STUCKEY\n\nChief Technology Officer, Pittsburgh Public\n\nSchools\n\nDANIEL TAYLOR\n\nExecutive Vice President, African American\n\nChamber of Commerce of Western Pa.\n\nROBERT D. WALKER\n\nPresident & Co-Founder, Exurbia Home Healthcare,\n\nLLC\n\nTHOMAS WASHINGTON JR.\n\nCommunity School Site Manager, Homewood\n\nChildren’s Village\n\nREP. JAKE WHEATLEY JR.\n\nRepresentative of the 19th Legislative District,\n\nPennsylvania\n\nMARLIN WOODS, CPC\n\nExecutive Chairman, BenefitsPLUS\n\nDANTE WORKS\n\nOwner, The House of Veterans, LLC\n\nCURTIS UPSHER JR.\n\nRetired, Community Care Behavioral Health\n\nOrganization\n\nROBERT B. FULTON\n\nEqual Opportunity Specialist 2, Commonwealth\n\nof Pennsylvania Department of General Services,\n\nBureau of Diversity Equity, Inclusion and Small\n\nBusiness Opportunities\n\nSTANLEY BELL\n\nLocal 154 Boilermakers\n\nJUSTIN NWOKEJI\n\nDirector of Development of the Business, Math,\n\nScience and Technology Division, Office of Institutional\n\nAdvancement, Morehouse College\n\nRONALD SAUNDERS\n\nPresident, Dr. Edna B. McKenzie Branch, ASALH\n\nRYAN S. SCOTT\n\nExecutive Director, Social Justice Institutes,\n\nCarlow University\n\nCLYBURN HALLEY (No photo requested)\n\nPolice Chief, Pittsburgh Technical College\n\nTHOMAS BURLEY receives his Men of Excellence Award from\n\nCourier Editor and Publisher Rod Doss\n\nMEN OF EXCELLENCE CLASS OF 2021 HONOREES ALLAN FRANCETTE AND THOMAS BURLEY, among those who received their awards at a ceremony held at Savoy Restaurant, in the Strip District, April 16. (All Men of Excellence photos by J.L. Martello)\n\nAbout Post Author"}, {"url": "https://newpittsburghcourier.com/2021/06/13/bishop-loran-mann-remembered-during-homegoing-celebrations/", "page_content": "by Jacquelyn McDonald\n\nFor New Pittsburgh Courier\n\nWhether you knew him as Bishop, Pastor, Church Of God In Christ (COGIC) Media Host, Local Newscaster, Community Leader, Toastmaster or simply as “the Voice,” the late Bishop Loran Edward Mann left an immeasurable impact on those that encountered him. The sure evidence of that impact was the overwhelming attendance of the Pittsburgh community and beyond during his Homegoing Celebration, which spanned three days, May 24-26.\n\nThe remembrance began with a walk-through viewing on May 24, followed on May 25 by the first local memorial service, which also included his assigned Vermont Jurisdiction of the past 10 years. That service was held at 6 p.m. at the 1,200 seat Pentecostal Temple Church Of God In Christ in East Liberty, where Bishop Mann was the pastor.\n\nThe final remembrance for Bishop Mann was held at Victory Family Church, in Cranberry Township, to accommodate the large National Church presence that was expected and to meet the CDC’s social distancing measures. Former Pentecostal Temple members and COGIC hierarchy arrived from across the U.S. and Puerto Rico.\n\nBISHOP LORAN MANN, the venerable pastor and media personality, died on May 2. He was 74.\n\nPresiding COGIC Bishop J. Drew Sheard, from Detroit, was on hand to give the final eulogy, preaching from the biblical scripture Matt 25:21 and entitled his sermon, “The Greatest Commendation.” He spoke of Bishop Mann’s talents being put to good use in the marketplace of human needs and demands. He also emphasized Bishop Mann’s servitude and personal investment and commitment to his God-given assignments.\n\nThe Homegoing Celebration culmination consisted of the Church Of God In Christ royal ceremonial, “The Sealing Of The Bier,” a regalia skillfully conducted by the National Adjutants of the Church designated by members of the COGIC General Board, the governing entity of the 6.5 million-member denomination. Bishop Loran Mann was a newly elected General Board member, a few months prior to his passing.\n\nFIRST LADY BARBARA MANN, during the funeral for her late husband, Bishop Loran Mann, at Pentecostal Temple COGIC, May 25. (Photos by Courier photographer J.L. Martello)\n\nEach gathering was unique in acknowledging Bishop Mann’s contributions to the ecumenical community. His alumni choir, which now consists of several pastors, popular psalmists and minstrels throughout the tri-state area, gathered to pay tribute in song to their beloved pastor and initial choir director. They were known as the “Sounds of Pentecost.” Bishop Mann was an accomplished musician, as is his wife, Evangelist Barbara Mann. They often sang and played the keyboards during his services.\n\nLORAN MANN II speaks during the funeral for his father, Bishop Loran Mann, at Pentecostal Temple COGIC, May 25.\n\nOthers, like Church Mother Denise White, remarked of the spirit-filled worship services that Bishop Mann led at Pentecostal Temple. White raised the praise as she testified of how God healed her of an affliction that rendered her wheelchair-bound for 10 years. Now walking, she shared of the convalescent ministry of Bishop Mann and how he petitioned God on her behalf.\n\nBishop Mann’s “sons in the gospel,” of which there are many, came from far and near to tell of Bishop Mann’s biblical guidance and tutoring. His ability to articulate scripture was considered superior; and as the founder of Pittsburgh’s only 24-hour Gospel radio station, WGBN (1360 AM), several of the present and former on-air personalities shared their stories of how the Bishop mentored them in broadcasting and journalism.\n\nBishop Mann died on May 2 at age 74. He was the founder of Pentecostal Temple, and grew its church membership from roughly 20 to more than 1,000, and was instrumental in the completion of the church’s million-dollar sanctuary that rises above Larimer Avenue and East Liberty Boulevard.\n\nBishop Mann was known for his career as a young anchor/reporter on KDKA-AM (1020) in 1968, then moved to television as an anchor/reporter for WPXI (Channel 11). He spent more than 20 years there, becoming a household name in Pittsburgh. Following his retirement from WPXI, he rose up the ranks of the Church Of God In Christ, becoming Bishop of the Vermont Jurisdiction in 2011.\n\nAbout Post Author"}, {"url": "https://www.washingtonpost.com/archive/local/1983/10/07/cardinal-terence-cooke-rose-through-ranks-of-ny-archdiocese/9cb555ad-9c0d-4244-86fa-5a1fe0056555/", "page_content": "Cardinal Terence Cooke, who died yesterday at the age of 62, was a former priest in the South Bronx who rose through the ranks of the church to become head of the Archdiocese of New York and spiritual leader of its 1.8 million Roman Catholics.\n\nThe archdiocese revealed six weeks ago that the cardinal was terminally ill with leukemia. Although he was receiving medication, Cardinal Cooke decided against hospitalization and aggressive chemotherapy, saying it would interfere with the dignity of life.\n\n\"Life is no less beautiful when accompanied by illness or weakness, hunger or poverty, physical or mental disease,\" Cardinal Cooke wrote in a letter released by the Vatican Sunday.\n\nInstead of allowing extraordinary measures to prolong his life, he remained at his Madison Avenue residence, behind the ornate St. Patrick's Cathedral in the heart of Manhattan. It was there that President and Mrs. Reagan visited him on Sept. 25. Cardinal Cooke had visited Reagan after the president was shot in an assassination attempt in March 1981.\n\nUpon learning of the cardinal's death, Reagan issued a statement saying that Cardinal Cooke in life \"inspired us with his personal holiness, his dedication to the church, and his devotion to his flock.\"\n\n\"The world has rarely seen a more moving display of the three cardinal virtures than in the faith, hope and love with which Cardinal Cooke confronted and conquered death,\" Reagan said.\n\nPope John Paul II announced Cardinal Cooke's death to bishops gathered for a world synod, then led them in prayer, the Vatican said.\n\nArchbishop James Hickey of Washington called on worshipers to join \"in sorrow and prayer\" for Cardinal Cooke, and said all Roman Catholics here \"have benefited from the example of his gentle, effective leadership.\"\n\nNew York Mayor Edward Koch said Cardinal Cooke was \"a man of simple tastes but extraordinary compassion.\" The mayor directed that the flags of the city be flown at half staff.\n\nThe Archdiocese of New York, which runs from the tip of Staten Island through the concrete canyons of Manhattan to the farmland of the Catskills (Brooklyn and Long Island are separate dioceses), is the fourth-largest unit of the church in the country. But its importance is magnified by the worldwide centers of trade, communication and culture within its boundaries.\n\nCardinal Cooke led the archdiocese during a time of profound demographic and social change and a period in which the church was still grappling with the changes wrought by the Second Vatican Council.\n\nHe was the hand-picked successor to one of the most powerful prelates the Catholic church in this country ever produced, Cardinal Francis Spellman, under whom Cooke served for his entire career until he was made archbishop.\n\nA skilled diplomat and administrator, Cardinal Cooke managed to steer a course between the extreme conservatism of his predecessor and the revolutions that the 1960s produced in both church and society.\n\nThe diverse archdiocese has seen the number of Hispanic Catholics rise sharply. After years of importuning by black church leaders, the Vatican recently named a black auxiliary bishop to deal with the growing numbers of black Catholics in New York.\n\nCardinal Cooke was installed as archbishop of New York on April 4, 1968, but his triumphal day ended abruptly when it was learned that the Rev. Martin Luther King Jr. had been shot in Memphis. The new prelate returned to St. Patrick's, where he had been installed only hours before, and led an impromptu prayer service for King. In the tense days that followed, Cardinal Cooke joined other religious and civil rights leaders in marches and demonstrations of grief. (At the time, he held the rank of archbishop; he was made a cardinal the following year.)\n\nCardinal Cooke went to Atlanta where he joined Robert F. Kennedy to attend King's funeral. Less than four months later, Cardinal Cooke presided over Kennedy's funeral at St. Patrick's.\n\nIn a sharp break with the aloof style of his predecessor, Cardinal Cooke quickly emerged as a highly visible leader on both the secular and religious scene. Affable, and with a politician's skill at remembering names, he broke new ground in furthering friendly relations with non-Catholic groups.\n\nWhen President Lyndon B. Johnson named a commission on violence the day after Robert Kennedy's assassination, Cardinal Cooke was among its members.\n\nHe was on his way to a commission meeting in 1969 when the public announcement was made that Pope Paul VI had named him to the College of Cardinals.\n\nCardinal Cooke was among six of the commission's 13 members who refused to condemn all civil disobedience. He did condemn \"violent or coercive\" tactics, but defended an individual's moral right to resist a law in good conscience as long as he is nonviolent and prepared to accept the law's punishment for his disobedience.\n\nHis opposition to violence brought him into conflict with the methods and goals of the provisional wing of the Irish Republican Army, which is trying to eject Britain from Northern Island.\n\nThe New York cardinal was involved in the question of Northern Ireland both because of his ancestry and the massive numbers of Irish-Catholics in New York. Last St. Patrick's Day, he drew scattered boos when he was late to appear on the cathedral steps in a direct snub of Michael Flannery, a strong IRA supporter who was grand marshal of the parade.\n\nIn addition to serving as archbishop of New York, Cardinal Cooke was military vicar--the liaison between the church and the armed forces. He made frequent Christmas season visits to military units, including a 1969 trip to Vietnam.\n\nIn Longbinh, Cardinal Cooke told U.S members of the armed forces attending a Christmas Day mass that \"some people get confused at times and mix up war with the military man. War is ugly. But the military man is a hero. He is making sacrifices for freedom.\"\n\nCardinal Cooke, like most other Catholic bishops at the time, defended the Vietnam war. St. Patrick's Cathedral became the frequent focus of antiwar demonstrations and the cardinal was assailed in the liberal Catholic press.\n\nIn the U.S. Catholic hierarchy's recent efforts to develop of a pastoral letter condemning nuclear war, Cardinal Cooke and most of his auxiliary bishops continued to press for a more moderate stance.\n\nBorn March 1, 1921, in a tenement on New York City's upper West Side, Cardinal Cooke was the second son of Michael Cooke, a chauffeur and construction worker, and Margaret Gannon Cooke, who were both from County Galway, Ireland.\n\nAfter his mother died when he was 9, her sister helped to raise the family. He attended Catholic elementary schools in the Bronx and West Nyack and studied for the priesthood at Cathedral College, a prep school for seminarians in Manhattan, and St. Joseph's Seminary in Yonkers, where he was an outstanding scholar and played on the basketball team.\n\nOrdained on Dec. 1, 1945, he served as an assistant pastor in a Bronx parish, then was transferred to the chaplaincy at the St. Agatha Home in Nanuet, N.Y. He earned a master's degree in social work at Catholic University here.\n\nFrom 1949 to 1954, he directed youth activities for Catholic Charities of New York, assisted at St. Jude Church in Manhattan and taught at Fordham University. During the mid-1950s, he also was bursar at St. Joseph's Seminary and proved adept at financial management.\n\nCardinal Cooke began his rise in the church hierarchy in January 1957, when Cardinal Spellman chose him as his personal secretary. That same year, he was named a papal chamberlain by the pope and was raised to the rank of monsignor. He became vice chancellor of the archdiocese in 1958, chancellor in 1961, prothonotary apostolic in 1964, and vicar general of the archdiocese and auxiliary bishop of New York in 1965."}]}