{"Robert Holgate was a strong advocate of the Protestant faith, and was responsible for introducing Protestantism to the north of England.": [{"url": "http://www.historyofyork.org.uk/themes/tudor-stuart/robert-holgate-archbishop", "page_content": "1545AD - 1554AD\n\nRobert Holgate from a Yorkshire family, was educated in Cambridge and entered the Gilbertine order as a canon. He played an important role in the life of the community before the Dissolution of the Monasteries.\n\nConsidered to be a protégé of Thomas Cromwell, Holgate was appointed president of the Council in the North in 1538, a post he held for 11 years. He lived in the house of the former abbot of St Mary’s Abbey in York, which has survived as King’s Manor.\n\nFollowing the death of Archbishop Lee in September 1544, Holgate was named his successor and was consecrated as Archbishop of York at Lambeth in January 1545, renouncing papal authority.\n\nFrom then, the tenets of Protestant theology were regularly expounded in the Minster for the first time, and organ music was abolished. He instructed that the Minster Library be furnished with new Protestant commentaries on the Bible by theologians like Calvin.\n\nArchbishop Holgate founded three grammar schools in 1546, one at his birthplace of Hemsworth in the West Riding, one at Old Malton and one in York. He required his headmasters to be skilled in Hebrew, Greek and Latin and to take his pupils to the Minster on Sundays.\n\nIn order to prove his Protestantism to the sceptical Duke of Northumberland, in 1550, aged 68, the Archbishop took a bride when he was 68 – local gentlewoman Barbara Wentworth. This was a year after an Act of Parliament removed the duty of celibacy from the English clergy.\n\nBut when Queen Mary came to the throne in 1553 and returned England to Catholicism, Holgate was sent to the Tower then stripped of his post for breaking his vow of celibacy.\n\nHaving paid the crown £1,000 for his ‘crimes’ Holgate was set free in January 1555 only to die that November in London."}, {"url": "https://www.britannica.com/event/Reformation", "page_content": "The greatest leaders of the Reformation undoubtedly were Martin Luther and John Calvin . Martin Luther precipitated the Reformation with his critiques of both the practices and the theology of the Roman Catholic Church. John Calvin was the most important figure in the second generation of the Reformation, and his interpretation of Christianity, known as Calvinism , deeply influenced many areas of Protestant thought. Other figures included Pope Leo X , who excommunicated Luther; the Holy Roman emperor Charles V , who essentially declared war on Protestantism; Henry VIII , king of England, who presided over the establishment of an independent Church of England; and Huldrych Zwingli , a Swiss reformer.\n\nThe Reformation became the basis for the founding of Protestantism , one of the three major branches of Christianity . The Reformation led to the reformulation of certain basic tenets of Christian belief and resulted in the division of Western Christendom between Roman Catholicism and the new Protestant traditions. The spread of Protestantism in areas that had previously been Roman Catholic had far-reaching political, economic, and social effects.\n\nReformation, also called Protestant Reformation, the religious revolution that took place in the Western church in the 16th century. Its greatest leaders undoubtedly were Martin Luther and John Calvin. Having far-reaching political, economic, and social effects, the Reformation became the basis for the founding of Protestantism, one of the three major branches of Christianity.\n\nThe world of the late medieval Roman Catholic Church from which the 16th-century reformers emerged was a complex one. Over the centuries the church, particularly in the office of the papacy, had become deeply involved in the political life of western Europe. The resulting intrigues and political manipulations, combined with the church’s increasing power and wealth, contributed to the bankrupting of the church as a spiritual force. Abuses such as the sale of indulgences (or spiritual privileges) by the clergy and other charges of corruption undermined the church’s spiritual authority. These instances must be seen as exceptions, however, no matter how much they were played up by polemicists. For most people, the church continued to offer spiritual comfort. There is some evidence of anticlericalism, but the church at large enjoyed loyalty as it had before. One development is clear: the political authorities increasingly sought to curtail the public role of the church and thereby triggered tension.\n\nMore From Britannica Christianity: Reformation\n\nThe Reformation of the 16th century was not unprecedented. Reformers within the medieval church such as St. Francis of Assisi, Valdes (founder of the Waldensians), Jan Hus, and John Wycliffe addressed aspects in the life of the church in the centuries before 1517. In the 16th century Erasmus of Rotterdam, a great humanist scholar, was the chief proponent of liberal Catholic reform that attacked popular superstitions in the church and urged the imitation of Christ as the supreme moral teacher. These figures reveal an ongoing concern for renewal within the church in the years before Luther is said to have posted his Ninety-five Theses on the door of the Castle Church, Wittenberg, Germany, on October 31, 1517, the eve of All Saints’ Day—the traditional date for the beginning of the Reformation. (See Researcher’s Note.)\n\nMartin Luther claimed that what distinguished him from previous reformers was that while they attacked corruption in the life of the church, he went to the theological root of the problem—the perversion of the church’s doctrine of redemption and grace. Luther, a pastor and professor at the University of Wittenberg, deplored the entanglement of God’s free gift of grace in a complex system of indulgences and good works. In his Ninety-five Theses, he attacked the indulgence system, insisting that the pope had no authority over purgatory and that the doctrine of the merits of the saints had no foundation in the gospel. Here lay the key to Luther’s concerns for the ethical and theological reform of the church: Scripture alone is authoritative (sola scriptura) and justification is by faith (sola fide), not by works. While he did not intend to break with the Catholic church, a confrontation with the papacy was not long in coming. In 1521 Luther was excommunicated; what began as an internal reform movement had become a fracture in western Christendom.\n\nThe Reformation movement within Germany diversified almost immediately, and other reform impulses arose independently of Luther. Huldrych Zwingli built a Christian theocracy in Zürich in which church and state joined for the service of God. Zwingli agreed with Luther in the centrality of the doctrine of justification by faith, but he espoused a different understanding of the Holy Communion. Luther had rejected the Catholic church’s doctrine of transubstantiation, according to which the bread and wine in Holy Communion became the actual body and blood of Christ. According to Luther’s notion, the body of Christ was physically present in the elements because Christ is present everywhere, while Zwingli claimed that entailed a spiritual presence of Christ and a declaration of faith by the recipients.\n\nAnother group of reformers, often though not altogether correctly referred to as “radical reformers,” insisted that baptism be performed not on infants but on adults who had professed their faith in Jesus. Called Anabaptists, they remained a marginal phenomenon in the 16th century but survived—despite fierce persecution—as Mennonites and Hutterites into the 21st century. Opponents of the ancient Trinitarian dogma made their appearance as well. Known as Socinians, after the name of their founder, they established flourishing congregations, especially in Poland.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nFind out how Martin Luther launched the Protestant Reformation See all videos for this article\n\nAnother important form of Protestantism (as those protesting against their suppressions were designated by the Diet of Speyer in 1529) is Calvinism, named for John Calvin, a French lawyer who fled France after his conversion to the Protestant cause. In Basel, Switzerland, Calvin brought out the first edition of his Institutes of the Christian Religion in 1536, the first systematic, theological treatise of the new reform movement. Calvin agreed with Luther’s teaching on justification by faith. However, he found a more positive place for law within the Christian community than did Luther. In Geneva, Calvin was able to experiment with his ideal of a disciplined community of the elect. Calvin also stressed the doctrine of predestination and interpreted Holy Communion as a spiritual partaking of the body and blood of Christ. Calvin’s tradition merged eventually with Zwingli’s into the Reformed tradition, which was given theological expression by the (second) Helvetic Confession of 1561.\n\nThe Reformation spread to other European countries over the course of the 16th century. By mid century, Lutheranism dominated northern Europe. Eastern Europe offered a seedbed for even more radical varieties of Protestantism, because kings were weak, nobles strong, and cities few, and because religious pluralism had long existed. Spain and Italy were to be the great centres of the Catholic Counter-Reformation, and Protestantism never gained a strong foothold there.\n\nIn England the Reformation’s roots were both political and religious. Henry VIII, incensed by Pope Clement VII’s refusal to grant him an annulment of his marriage, repudiated papal authority and in 1534 established the Anglican church with the king as the supreme head. In spite of its political implications, the reorganization of the church permitted the beginning of religious change in England, which included the preparation of a liturgy in English, the Book of Common Prayer. In Scotland, John Knox, who spent time in Geneva and was greatly influenced by John Calvin, led the establishment of Presbyterianism, which made possible the eventual union of Scotland with England. For further treatment of the Reformation, see Protestantism, history of. For a discussion of the religious doctrine, see Protestantism."}, {"url": "https://www.britannica.com/topic/Protestantism", "page_content": "Protestantism , Christian religious movement that began in northern Europe in the early 16th century as a reaction to medieval Roman Catholic doctrines and practices. Along with Roman Catholicism and Eastern Orthodoxy , Protestantism became one of three major forces in Christianity . After a series of European religious wars in the 16th and 17th centuries, and especially in the 19th century, it spread throughout the world. Wherever Protestantism gained a foothold, it influenced the social, economic, political, and cultural life of the area.\n\nIn the 16th century Protestant referred primarily to the two great schools of thought that arose in the Reformation, the Lutheran and the Reformed. In England in the early 17th century, the word was used to denote “orthodox” Protestants as opposed to those who were regarded by Anglicans as unorthodox, such as the Baptists or the Quakers . Roman Catholics, however, used it for all who claimed to be Christian but opposed Catholicism (except the Eastern churches). They therefore included Baptists, Quakers, and Catholic-minded Anglicans under the term. Before the year 1700 this broad usage was accepted, though the word was not yet applied to Unitarians . The English Toleration Act of 1689 was titled “an Act for exempting their Majesties’ Protestant subjects dissenting from the Church of England .” But the act provided only for the toleration of the opinions known in England as “orthodox dissent” and conceded nothing to Unitarians. Throughout the 18th century the word Protestant was still defined in relation to the 16th-century Reformation.\n\nThe name Protestant first appeared at the Diet of Speyer in 1529, when the Roman Catholic emperor of Germany , Charles V , rescinded the provision of the Diet of Speyer in 1526 that had allowed each ruler to choose whether to administer the Edict of Worms (which banned Martin Luther ’s writings and declared him a heretic and an enemy of the state). On April 19, 1529, a protest against this decision was read on behalf of 14 free cities of Germany and six Lutheran princes who declared that the majority decision did not bind them because they were not a party to it and that if forced to choose between obedience to God and obedience to Caesar, they must choose obedience to God. They appealed either to a general council of all Christendom or to a synod of the whole German nation. Those who made this protest became known to their opponents as Protestants, and gradually the label was applied to all who adhered to the tenets of the Reformation , especially to those living outside Germany. In Germany the adherents of the Reformation preferred the name evangelicals and in France Huguenots . The name was attached not only to the disciples of Martin Luther (c. 1483–1546) but also to the Swiss disciples of Huldrych Zwingli (1484–1531) and later of John Calvin (1509–64). The Swiss reformers and their followers in Holland, England, and Scotland , especially after the 17th century, preferred the name Reformed .\n\nThe context of the late medieval church\n\nThe Protestant Reformation occurred against the background of the rich ferment of the late medieval church and society. It has been difficult for two reasons to gain a proper understanding of the relationship between the late Middle Ages and the Reformation. One reason is the tradition of the sectarian historiography of the period. Catholic historians had an interest in showing how much reform occurred before and apart from the activities of the Protestant reformers of the 16th century. Protestant historians, on the other hand, portrayed the late medieval church in the most negative terms to show the necessity of the Reformation, which was characterized as a movement that broke completely with a corrupt past.\n\nThe second reason for difficulty in understanding the period is that the 15th-century critics of the church were not “Pre-Reformers”; they neither anticipated Protestantism nor acquired their importance from the Reformation. The events of that period were also not “Pre-Reformation” happenings but had an identity and meaning of their own.\n\nThe existence of reform efforts in the 15th-century church from Spain and Italy northward through Germany, France, and England has long been acknowledged. Some of these were directed against abuses by the papacy, the clergy, and monks and nuns. The pious, for example, abhorred Pope Innocent VIII (1484–92), who performed marriage ceremonies for his own illegitimate children in the Vatican, and Pope Alexander VI (1492–1503), who bribed his way to the throne of St. Peter and had fathered eight children by three women by the time he became pope. The public was also increasingly aware of and angered by extravagant papal projects—patronage of art and architecture, wars of conquest—for which funds were exacted from the faithful.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nThe distaste for the papacy increased at a time of rising nationalist spirit. The popes, who had long intervened in European political affairs, faced setbacks when European monarchs acquired new power and asserted it against both the papacy and the local clergy.\n\nDuring this time of rising national consciousness, a generation of theologians appeared who remained entirely within the context of medieval Roman Catholicism but who engaged in fundamental criticisms of it. Thus William of Ockham (died 1349?) spoke up as a reformer within the Franciscan order, which he hoped to return to its original strict rule of apostolic poverty. Ockham argued that Pope John XXII was a heretic because he denied that Jesus and the Apostles were possessionless. Ockham saw the papacy and empire as independent but related realms. He believed that when the church was in danger of heresy, lay people—princes and commoners alike—must come to its rescue. This meant reform.\n\nAnother English theologian, John Wycliffe, also challenged the church’s abuse of power and questioned its doctrines. Wycliffe encouraged reform of the church and its teachings and granted uncommon spiritual authority to the king. His primary source of inspiration for reform was the Bible. Wycliffe gave impetus to its translation, and in 1380 he helped make it available to rulers and ruled alike.\n\nIn Bohemia, Jan Hus, who became rector of the University of Prague, used that school as his base to criticize lax clergy and the recent prohibition of offering the cup of wine to communicants. He also exploited nationalist feelings and argued that the pope had no right to use the temporal sword. Hus’s bold accusations were judged heretical and led to his death by burning at the Council of Constance in 1415.\n\nAlongside a piety that combined moral revulsion with nationalism, Christian humanism was a further sign of unrest in the late medieval church. In Italy Lorenzo Valla (1407–57) used philology and historical inquiry to expose a number of forgeries, including the Donation of Constantine, which purportedly granted control over the Western Roman Empire to the pope. In Germany Johannes Reuchlin (1455–1522) studied Greek and Hebrew, the biblical languages, and was involved in an international controversy that pitted intellectual freedom against ecclesiastical authority. Desiderius Erasmus (1466/69–1536), the most famous and important of the Northern or Christian humanists, used his vast learning and his satiric pen to question the practices of the church. Because of his philosophy of Christ, which stressed a focus on the Bible and rejected much medieval superstition, Erasmus, a lifelong Catholic, was accused of laying the egg that hatched Luther.\n\nWhile these reformers attacked people in high places, they also regarded the Catholicism of ordinary people as needing reform. Such practices as pilgrims visiting shrines or parishioners regarding the relics of saints with awe were open to abuse. The pestilences and plagues of the 14th century had bred an inordinate fear of death, which led to the exploitation of simple people by a church that was, in effect, offering salvation for sale.\n\nDespite instances of anticlericalism and polemics against the church, most of the faithful remained loyal and found the church to be the vehicle of their eternal salvation. Nothing is more erroneous than the notion that, early in the 16th century, Europe was ripe for a reform of the church."}, {"url": "https://www.britannica.com/topic/Protestantism/The-Reformation-in-England-and-Scotland", "page_content": "Henry VIII and the separation from Rome\n\nIn the meantime the Reformation had taken hold in England. The beginning there was political rather than religious, a quarrel between the king and the pope of the sort that had occurred in the Middle Ages without resulting in a permanent schism and might not have in this instance save for the overall European situation. The dispute had its root in the assumption that the king was a national stallion expected to provide an heir to the throne. England did not have the Salic law, which in France forbade female succession, but England had just emerged from a prolonged civil war, the Wars of the Roses, and the new dynasty needed a male heir to maintain its hold on the throne and to prevent the resumption of civil war. Catherine of Aragon, the queen of Henry VIII, had borne him numerous children of whom only one survived, the princess Mary, and more were not to be expected. The ordinary procedure in such a case was to discover some flaw in the marriage that would allow an annulment or a divorce. In this instance the flaw was not difficult to find, because Catherine had been married to Henry’s brother Arthur, and canon law, following the prohibition in the book of Leviticus (20:21), forbade the marriage of a man with his deceased brother’s widow. At the time of the marriage the pope, Julius II, had given a dispensation to cover this infraction of the rule. The question now was whether the pope had the authority to dispense from the divine law. Catherine said there had been no need for a dispensation because her marriage to Arthur had not been consummated and there had been no impediment to her marriage to Henry. The knot would have been cut by some casuistry had Catherine not been the aunt of Emperor Charles V, who was not prepared to see her cast aside in favour of another wife. Clement VII, wishing neither to provoke the emperor nor to alienate the king, dallied so long that Henry took the matter into his own hands, repudiated papal authority, and in 1534 set up the independent Church of England, with the king as the supreme head. The spiritual head was the archbishop of Canterbury, Thomas Cranmer, who married Henry to Anne Boleyn. She bore the princess Elizabeth, and still another wife, Jane Seymour, bore the future Edward VI.\n\nHenry’s basic concern was political, but the alterations in the structure of the church gave scope for a reformation that was religious in character. Part of the impulse came from the survivals of Lollardy, part from the Lutheran movement on the Continent, and even more from the Christian humanism represented by Erasmus. Although Henry retained much Catholic doctrine, especially transubstantiation, and ecclesiastical organization, he did introduce important changes, including the suppression of the monasteries, the introduction of the Bible in the vernacular in the parish churches, and permission to the clergy to marry, though this last reform was later revoked. The resistance to Henry’s program was not formidable, and the executions resulting were not numerous. Henry was impartial in burning some Lutherans who would not submit to his later reactionary legislation and toward some Catholics who would not accept the royal supremacy over the church, notably John Fisher and Thomas More.\n\nOn his ascent to the throne in 1547, young Edward VI was hailed as England’s Josiah, the young 7th-century-bce king of Judah who enforced the Deuteronomic reform. Edward, it was held, would rid the land of idolatry so that England might be blessed. Protestantism advanced rapidly during his reign through the systematic reformation of doctrine, worship, and discipline—the three external marks of the true church. A reformed confession of faith and a prayer book were adopted, but the reformation of the ecclesiastical laws that would have defined the basis of discipline was blocked by the nobility in Parliament.\n\nThe death of Edward and England’s return to Roman Catholicism in 1553 under Queen Mary was interpreted by Protestants as God’s judgment that England had not taken the Reformation seriously enough. Many, including Cranmer, died as martyrs to the Protestant cause, and others fled to the European continent. Those in exile experimented with more radical forms of worship and discipline, and published material justifying rebellion against an idolatrous ruler. Exiles also produced two large volumes of incalculable consequence for English religious thought, John Foxe’s Actes and Monuments, popularly known as The Book of Martyrs, and the Geneva Bible. The most popular books in England for many years after their publication, they provided a view of the country as an elect nation chosen by God to bring the power of the Antichrist (understood to be the pope) to an end.\n\nElizabeth I, assumed the throne in 1558 and was hailed as the glorious Deborah (a 12th-century-bce Israelite leader), the “restorer of Israel.” She did not, however, restore it far enough for some English Protestants, particularly the Puritans. Indeed, she distrusted the challenge to authority and feared the disorder that either extreme evangelical zeal or extreme Catholic zeal could cause. Two statutes promulgated in her first year—the Act of Supremacy, stating that the queen was “supreme governor” of the Church of England, and the Act of Uniformity, ensuring that English worship should follow The Book of Common Prayer—defined the nature of the English religious establishment. In 1571 the Convocation of Canterbury, one of the church’s two primary legislative bodies (along with the Convocation of York), defined standard doctrine in the Thirty-nine Articles, but attempts to reform the prayer book further and to produce a reformed discipline failed. Defeated in the convocation, the reformers came to rely more on Parliament, where they could always depend on strong support."}, {"url": "https://www.nationalgeographic.org/article/protestant-reformation/", "page_content": "The Protestant Reformation was a religious reform movement that swept through Europe in the 1500s. It resulted in the creation of a branch of Christianity called Protestantism , a name used collectively to refer to the many religious groups that separated from the Roman Catholic Church due to differences in doctrine.\n\n\n\nThe Protestant Reformation began in Wittenberg, Germany, on October 31, 1517, when Martin Luther, a teacher and a monk, published a document he called Disputation on the Power of Indulgences, or 95 Theses. The document was a series of 95 ideas about Christianity that he invited people to debate with him. These ideas were controversial because they directly contradicted the Catholic Church 's teachings.\n\n\n\nLuther's statements challenged the Catholic Church 's role as intermediary between people and God, specifically when it came to the indulgence system, which in part allowed people to purchase a certificate of pardon for the punishment of their sins. Luther argued against the practice of buying or earning forgiveness, believing instead that salvation is a gift God gives to those who have faith.\n\n\n\nLuther's objections to the indulgence system paved the way for other challenges to the Catholic doctrine throughout Europe. For example, John Calvin in France and Huldrych Zwingli in Switzerland proposed new ideas about the practice of Holy Communion, and a group called Anabaptists rejected the idea that infants should be baptized in favor of the notion that baptism was reserved for adult Christians.\n\n\n\nBroadly speaking, most of the challenges to the Catholic Church revolved around the notion that individual believers should be less dependent on the Catholic Church , and its pope and priests, for spiritual guidance and salvation. Instead, Protestants believed people should be independent in their relationship with God, taking personal responsibility for their faith and referring directly to the Bible, the Christian holy book, for spiritual wisdom.\n\n\n\nProtestant reform in England began with Henry VIII in 1534 because the Pope would not grant him a marriage annulment. Subsequently, King Henry rejected the Pope's authority, instead creating and assuming authority over the Church of England, a sort of hybrid church that combined some Catholic doctrine and some Protestant ideals. Over the next 20 years, there was religious turbulence in England as Queen Mary (1553–1558) reinstated Catholicism in England while persecuting and exiling Protestants , only to have Queen Elizabeth I and her Parliament attempt to lead the country back toward Protestantism during her reign (1558–1603).\n\n\n\nSome English citizens did not believe Queen Elizabeth's efforts to restore England to Protestantism went far enough. These citizens fell into two groups, both labeled Puritans by their opponents. The first group, known as separatists, believed the Church of England was so corrupt that their only choice was to leave England, separate from the church , and start a new church . They called this the English Separatist Church .\n\n\n\nAround 1607 or 1609, some of the separatists tried to start the new lives they imagined in Holland, in the Netherlands. Ultimately, the endeavor failed due to poverty and the sense that the children were assimilating too much into Dutch culture, so many of the separatists returned to England.\n\n\n\nBy 1620, members of the English Separatist Church were ready for a second try at establishing a new life and church . Those who set sail aboard the Mayflower for New England and eventually landed near Plymouth, Massachusetts, would, in time, become known as the Pilgrims.\n\n\n\nThe other group of English citizens who did not believe Queen Elizabeth's reform efforts went far enough were called non separatists ; over time, the term \" Puritan \" would become synonymous with the non separatists . They did not seek to leave the Church of England; they wanted only to reform it by eliminating the remnants of Catholicism that remained. In terms of theology, most of them were Calvinists.\n\n\n\nAlthough they did not desire to separate from the Church of England, some Puritans saw emigrating to New England as their best chance at true reform of the church and freedom to worship as they chose. In 1630, a decade after the Pilgrims embarked on a similar journey for similar reasons, the first Puritans traveled to the New World and established the Massachusetts Bay Colony in Boston, Massachusetts.\n\n\n\nThough the separatists and non separatists disagreed about whether to sever ties to the Church of England, both groups of early North American colonists shared a dissatisfaction with the church and a mindset that they were free to establish a church more in alignment with their spiritual views. Perhaps predictably, this freedom to practice religion according to one's beliefs led to the creation of countless different churches , denominations, and doctrines in the colonies. Equally predictable, throughout history this diversity has led to disagreements.\n\n\n\nHowever, this diversity of religious thought has also become a core part of the identity of the United States: The Bill of Rights explicitly forbids \"establishment of religion, or prohibiting the free exercise thereof.” Over 400 years in the making, this belief in personal empowerment and independence in religious matters, with its roots in the Protestant Reformation , has become an enduring part of the American mindset.\n\n\n\n"}, {"url": "https://www.britannica.com/topic/Protestantism/The-spread-of-missions", "page_content": "As European and to a lesser extent American power grew in the 19th century, the Protestant churches entered their greatest period of expansion. Confronted at home by new industrial cities, they developed social services on a scale hitherto unknown, including hospitals, orphanages, temperance work, care of the old, extension of education to the young and to working adults, Sunday schools, boys’ and men’s clubs in city slums, and the countless organizations demanded by the new city life of the 19th century. Abroad they carried Protestantism effectively into all parts of Africa that were not under French or Portuguese influence, so that in southern Africa the Bantu became largely a federation of Protestant peoples. In India British and American missionaries steadily increased the strength of the newer Indian Christian churches. In China Christianity , hitherto confined to the seaports and to the remnants of Roman Catholic missions in the 17th century, expanded deep into the interior because of the work of the China Inland Mission (founded 1865) and other evangelical groups that were financed from England or the United States . Japan had been closed to Christianity since 1630, and after its reopening in 1859 American and British missionaries created Japanese Christian churches. American missionaries developed Protestant congregations in the countries of South and Central America. All of the main Protestant denominations—Lutherans, Presbyterians, Anglicans, Congregationalists, Baptists, Methodists—developed into worldwide bodies, and all suffered strain in adjusting their organizations to meet these extraordinary new needs.\n\nRevivalism in the 19th century\n\nOne of the most prominent features of Protestantism in the 19th century was the development of the camp revival to meet the needs of an industrial and urban society. Although the urban poor seldom went to church, they listened to evangelical preachers in halls and theatres, or on street corners. Methodists and Baptists, familiar with revivalistic methods, made great strides, especially in the United States. Their efforts were not confined to reaching the working class. The English Baptist Charles H. Spurgeon (1834–92) accepted a ministry to the educated and secured a large audience in London. William Booth (1829–1912), a former Methodist preacher, and his wife, Catherine, established an evangelical mission for the poor in east London that was known from 1878 as the Salvation Army. They directed their mission to the people on the street corners, using brass bands and even dancing to attract attention. They differed from the Methodist revivalist tradition in their belief in the necessity of a strong central government under a “general” appointed for life. They also abandoned the use of sacraments. At first the Salvation Army faced much hostility and even persecution, but by the end of the 19th century it had securely established its place in Britain and had become a worldwide organization.\n\nKarl Olof Rosenius (1816–68), influenced by Methodist preaching, introduced revivalism into Swedish Lutheranism. Although Rosenius was also influenced by Zinzendorf and Pietism, his new movement was quite unlike the little groups of Pietism. The Pietists wanted to bring men to salvation from the world, whereas the Bornholmers (as they later came to be called in Denmark because of a famous episode in evangelism on the island of Bornholm) wanted to declare salvation for the world. The movement had influence in Norway and Denmark and even in the United States.\n\nIn the United States the development of revivalism was particularly marked in the expansion of the moving frontier. The memory of the Great Awakening (c. 1725–50) remained powerful in the 19th century, and revival meetings took place in cities as well as in the western camps. Famous evangelists emerged, including Charles Grandison Finney (1792–1875) and Dwight Lyman Moody (1837–99), to lead revivals in American cities in what is known as the Second Great Awakening.\n\nThe evangelical movement in Protestantism of the 19th century moved away from the traditional churches of the Reformation—Lutheran, Calvinist, and Anglican—to create new forms of church life and new organizations. These new institutions used lay preachers and were more concerned with individual conversions than with church order or church affiliation. Consequently, they developed a tendency, not common before the Pietist movement, to identify Protestantism with individualism in religion. These evangelical activities produced separate Christian organizations that still called themselves Protestant.\n\nThe secular state allowed and in some cases stimulated further growth among the Protestant churches. Apocalyptic expectation of the Second Coming of Christ contributed to the emergence of a number of important radical Protestant groups and churches. In Britain in 1827 John Nelson Darby (1800–82) founded the Plymouth Brethren, who separated themselves from the world in preparation for the imminent coming of the Lord. The Catholic Apostolic Church, formed in 1832 largely by the Scotsman Edward Irving, likewise prepared for the second coming. Apocalyptic groups also formed in the United States. The apocalyptic prophecies of William Miller (1782–1849) in the 1840s led to the formation of the church of the Seventh-day Adventists. The Mormons (Church of Jesus Christ of Latter-day Saints), founded by Joseph Smith (1805–44), emerged from similar expectations of the imminent end. Another set of groups arose from the revival of faith healing, the most important being the Christian Scientists, founded in 1879 by Mary Baker Eddy (1821–1910), who set up her first church in Boston."}, {"url": "https://www.cambridge.org/core/journals/central-european-history/article/abs/nazi-germany-as-a-christian-state-the-protestant-experience-of-1933-in-wurttemberg/AF6644556511E6BD982A22F62A544232", "page_content": "The study of German Christian responses to the Nazis is undoubtedly a growing field of historical inquiry.Footnote 1 Within this topic much of the focus has been on larger church organizations, such as the Catholic Church or on those who were engaged in the “Church Struggle” (Kirchenkampf)––the Confessing Church (Bekennende Kirche, BK) or the German Christian Faith Movement (Glaubensbewegung Deutsche Christen, GDC).Footnote 2 There are numerous such works that form excellent studies of church organizations, as well as individual theologians.Footnote 3\n\nMy own interest lies far more with the question of ascertaining individual Christian responses––more particularly, Protestant responses. Hence, this essay is a response to Manfred Gailus's call for “micro-histories,” in acknowledgment of the “strictly particularist” tradition of Protestantism in Germany.Footnote 4 Gailus has described the first year of Nazi rule as a “Protestant experience,” with a focus on Berlin.Footnote 5 This essay sets out to examine whether the same can be said of Württemberg, through a two-level approach.Footnote 6 It focuses both on the depiction of events in 1933 in the theologically conservative Evangelisches Gemeindeblatt (Protestant Community Paper) and the more private discussions that occurred between pastors who were leaders within their own communities but who were not necessarily associated with either prominent party in the Church Struggle.Footnote 7\n\nThe key question is, how did the Gemeindeblatt and members of a “Pastors' Prayer Group” (Pfarrergebetsbund) view the Nazi regime in 1933? A crucial secondary question is, how did they respond to the Nazis' antisemitism?Footnote 8 This dual comparison is made the more relevant because most of the theologically conservative pastors from the prayer group were from Württemberg.Footnote 9 This essay argues that while 1933 was indeed portrayed as a time of national-religious revival, by the end of the year deep concerns had already arisen as to the situation of the church and the level of political incursion. At the same time, the notion of a national revival was still generally accepted and those in the church remained “actively passive” on the Nazis' antisemitism. It also argues that part of the power of the 1933 “experience” was that church members could draw on a preexisting myth of religious revival running concurrent to national renewal: the supposed “spirit of 1914.”Footnote 10 While this has principally been seen as the embodiment of “national faith,” it also incorporated concepts of church revival with the advent of World War I.\n\nHence while examining a “regional” response, this analysis also fits with those studies that consider the local level and the response taken within (for instance) individual parishes. The works of scholars such as Gailus and Kyle Jantzen feature prominently in this field, though those of Hartmut Lehmann and David Diephouse are of more specific relevance to these Pietist ministers in southern Germany.Footnote 11\n\nThe Sacred as Secular: Pietism and “Lived” Christianity To understand the theological milieu of these pastors, it is necessary to explain a little of Pietism. Two of the main emphases of Pietist religious practices and belief were (and are) piety and community. In essence, Pietists are those who follow Philipp Spener's idea of Collegia Pietatis: that groups of Christians, by gathering together and focusing their attentions on Scripture, can lead more truly Christian lives, partly through a deeper and more regular experience of Christian teaching, and partly through providing each other with a self-reflective model for living. As such, an idea of “active” Christianity is important.Footnote 12 This adds further weight to the study of such groups in the Nazi period, given that their faith was meant to be expressed through their actions. Indeed, the primary materials that I am relying on were found in research conducted on the Korntal Brethren, a prominent group within “Württemberg Pietism.”Footnote 13 There can be no doubt that this group was formed very much by convinced and prominent Pietists.Footnote 14 They believed that Christians must be awakened into a deep personal relationship with God, often through a particular experience in their lives. In original drafts for their community guidelines, only “a fundamental change in one's life through the spirit of God” made one a “true member” of the community.Footnote 15 I am using the Korntal edition of the Protestant Community Paper, the Evangelisches Gemeindeblatt Korntal (EGK). The publication itself took the form of a syndicated paper, following the format of three pages of general church information and news, with only the back page devoted to specific items from the particular community. The Korntal minister was evidently also a member of the “Pastors' Prayer Group.”Footnote 16 This organization sent letters as circulars to its members. As such, the correspondence was both public and private. It was open to those who participated in the circle, but was also viewed as a private discussion among themselves. There has been a great deal of interest in the question of Nazism as a “political religion.”Footnote 17 What is more relevant in studying such pastors, however, is not the possibility of the secular––politics––being sacralized, but the possibility of the sacred being viewed as secular, which is the essence of the “lived Christianity” of Pietist communities. The members of the Pastors' Prayer Group were serious about their faith, which means that we also have to take their faith seriously. This includes the application of their faith to political and secular events, which were often viewed through a religious lens. Indeed, an idea endemic to Württemberg Pietism was the interpretation of temporal events as manifestations of God's will.Footnote 18 As Hartmut Lehmann has noted, events such as the foundation of the German Reich, World War I, and the rise of the Nazis could be read as indicating divine will.Footnote 19 What is useful in the idea of a “political religion” is that essentially religious concepts such as faith could be used to justify the state; however, the difference in belief is demonstrated through the fact that church groups often advocated a Christian state.Footnote 20 Given that there is also a strong concept of obedience to the state in German Protestantism, this might be better expressed as a desire for a Christlichnation, or Christian nation. While there have been questions as to the religious nature of German nationalism, responses are also diverse. Any consideration of German nationalism in the nineteenth century also has to understand the strength of regional loyalties, which often included a strong sense of religious affiliation.Footnote 21 Hence, Thomas Nipperdey made the point that in 1866 most churches were “reserved” about nationalism, preferring to preserve regional versions of “throne and altar.” He argued, however, that from 1871 many Protestant leaders accepted a national German identity and began to conflate religious and national agendas such that the “foundation of the Reich” became the “completion of the Reformation.”Footnote 22 The year 1870 was not simply a victory over France, but of Wittenberg over the “Babylon of Paris, over atheism, Ultramontanism, and revolution.” To use Friedrich Meinecke's concepts of the Kulturnation and Staatsnation, the “cultural nation” of the German state was supposed to be Christian, and it was believed the state apparatus of the “political nation” should support, protect, and promote this Christian nation. This conception was reflected in Johannes Schneider's formulation in 1921 in the prominent Protestant publication Kirchliches Jahrbuch (Church Yearbook). He argued that a “People's Church” (Volkskirche) would demonstrate “there is still a German-Protestant nation within the boundaries of the German state.”Footnote 23 To take the reverse perspective, such notions could also mean an exclusionary perception of the nation, which meant that those of another faith (such as Jews), those of no faith (the “godless”), or even fellow Christians (Catholics) might be viewed as not “truly” German. The strong desire for a “German Protestant nation” was crucial in 1933.\n\nThe Myth of the Church Spirit of 1914 (and 1933) The belief in a widespread spiritual “awakening” and its links to the Nazis were felt to be justified because there was a rise in church attendance with the advent of Nazi Germany.Footnote 60 This change was reminiscent of the increase in church attendance in 1914, when it appeared the war “united all classes and social strata of our people. . . . Even in those circles that were formerly indifferent or hostile to the church, and especially in the working-class world, it has led to a desire for the church, which has found expression in high attendance at all places of worship in Berlin.”Footnote 61 One EGK writer in 1916 had even described the war as having turned Germans into a “Community of Saints,” making them “churchly.”Footnote 62 Some Württemberg Pietists had viewed the war as a “spiritual springtime” (Geistesfrühling).Footnote 63 As Jeffrey Verhey notes, the “spirit of 1914” was a powerful one for the Nazis, who “described their accession to power as a recreation of the days of 1914.”Footnote 64 Yet it should be borne in mind that running parallel to this nationalist myth of the “experience” of 1914 was a spiritual myth, one both of “God is with us” (Gott mit uns) and of church revival.Footnote 65 As described as early as 1921, the general notion was that the “outbreak of the war was accompanied by a powerful religious-ecclesiastical wave” that had “strongly ebbed away” after 1918.Footnote 66 But by 1933 the tide was believed to be once more in. This also means that many in the churches seem to have felt this was a return to 1914 in both a nationalist and religious sense.Footnote 67 In Württemberg in 1933, reports from across the state described overfilled church services on new days of national celebration such as Labor Day (May 1) and Thanksgiving (October 1).Footnote 68 They included one record of Degerloch, where a loudspeaker needed to be set up in front of the church so that “two thousand people could take part” in the service. Such events were reported with delight, excitement, and a sense of disbelief at the apparently ever increasing religious enthusiasm. The new government seemed to bring with it a renewed interest in Christianity, and the filled services were held to be strong evidence of a church revival. It is telling that both 1914 and 1933 were seen as “God's hour,” and both were interpreted (as Gailus put it) “as a reunion with God of a people who had strayed from the true faith, a change of direction toward re-Christianization.”Footnote 69 Paul Althaus, a prominent theologian at Erlangen University, summarized such notions in The German Hour of the Church. Originally published in October 1933, it was a work presumably written partly in response to the overfilled churches on May 1 and October 1. Althaus wrote, “Our Protestant Churches have greeted the turning point of 1933 as a gift and miracle of God.”Footnote 70 He emphasized a salvation “from the abyss” and believed that there was “religious significance” in the “events of 1933,” referring back to the similarly perceived religious significance of August 1914.Footnote 71\n\nThe Pastors' Prayer Group in 1933 It was in this context, then, that the members of the Pastors' Prayer Group began to consider their position on the Nazi regime. A letter from September 1933 was one of the first on this topic. Sent from Degerloch by J, it noted that they were all affected by the changes of the period.Footnote 126 He believed that they had to “recognize in Hitler a God-given ‘savior’ (2 Kings 13:5).” The passage referred to appears in the context of God's anger against Israel, with an eventual change: “The Lord provided a deliverer for Israel, and they escaped from the power of Aram. So the Israelites lived in their own homes as they had before.” What this meant was that Germans were compared to the people of Israel, and the Weimar Republic was seen as a period when “the Lord's anger” had “burned” against Germany (2 Kings 13:3).Footnote 127 J, however, viewed the “future of our church” with “great concern,” because the “faith movement” (presumably of the German Christians) wished also to create a totalitarian regime in the church.Footnote 128 At the same time, Wurm was concerned by the totalitarian claims of the state, arguing that the church needed to clarify its relationship to the Third Reich.Footnote 129 J was particularly worried that the “racial question” was being brought into the church, noting that it was against the articles of the Lutheran Church and would bring “great hardships.” It was viewed as an extreme problem if the “Aryan question” should put “the roots of our Christian life in question.” Indeed, he felt that this was possibly a satanic device to prevent “a genuine awakening.”Footnote 130 This was demonstrative of a focus specifically on the “racial question” in the church, rather than in German society as a whole. It certainly showed a lack of understanding as to German Christian aims, given that J believed the disparate parties in the church could be welded together in opposing the “Aryan question.” His letter dealt with a contemporaneous issue of great concern, the question of whether an “Aryan Paragraph” could or should be introduced into the DEK. The key point was whether this contradicted the church constitution, the “teachings of the Holy Scripture, the Gospel of Jesus Christ, and the lessons of the Apostles”––and it was a question asked of Protestant faculties at the universities of Erlangen and Marburg.Footnote 131 J's letter was written only shortly before the response from Marburg, issued September 20, 1933, which declared that the antisemitic clauses were “irreconcilable with the character of the Christian church as it is determined by the solely definitive authority of the Holy Scripture and the Gospel of Jesus Christ and as it is witnessed to by the confessions of the Reformation.”Footnote 132 It went on to reject the idea that Schöpfungsglaube (belief in creation) justified making such distinctions.Footnote 133 Ultimately, J believed that they could only continue in their “intercession for all of the men in authority in the state and the church.”Footnote 134 Others supported this perspective.Footnote 135 One writer from Siglingen, H, viewed it as both “distressing and oppressive” that the German Christians were attempting to seize “power in the church,” arguing that “this certainly has nothing to do with living faith and will not contribute to the promotion of church life and religious life.” He hoped that the German Christians would not topple Bishop Wurm, believing that perhaps Wurm had gone too far out of his way to accommodate them.Footnote 136 Very few wrote in support of antisemitic measures, though one pastor, K, saw the “great happenings that have gripped our hearts so deeply” as hitting especially hard in Frankfurt because they formed a “counterforce” to the “power of the Jews.”Footnote 137 He held this was a “reaction” to an overbearing “arrogance” or “presumption” on the part of some Jews. Even in this, the only openly antisemitic letter among the pastors, the writer did not understand the Nazis' racially determinist attitude. He thought that the severities visited upon “noble Jews and Jewish Christians” were to be deeply regretted.Footnote 138 His concern was primarily the blanket discrimination taken without consideration for the individual, as he clearly believed some such measures were necessary. Yet the fact that he even believed there were “noble Jews” ran counter to Nazism. Hitler had expressed himself very clearly on this, even in the early years of the Nazi Party. In his view, it was irrelevant whether the individual Jew was “decent”: “In himself he carries those characteristics that nature has given him, and he cannot ever rid himself of those characteristics.”Footnote 139 Probably writing from personal experience, K gave examples of the impact of antisemitism, viewing it as a “hard fate” that a Jewish missionary lost his position, or that a “Jewish Christian typesetter is unable to find work.” His solution was an odd one––he posited the possibility of the creation of a colony for converted Jews in Palestine. This was a conclusion drawn from his belief that Jewish converts to Christianity would continue to suffer in Germany, unable to find work with Jews because of their religious beliefs, rejected by Christians “because the racial difference stands in the way.”Footnote 140 It was a mix of support and opposition and demonstrated some assumption that Jews would not be closed out of German society, but that “Jewish Christians” might. K concluded, “If we think of the Russian brothers in their distress, then we will not wish to forget such brothers from Israel.”\n\nA Clash of Conservatisms: Weighing up the Regime By December, a Pastor G dealt more clearly with the simultaneous joy and concern in 1933. With regard to the political situation, he noted that “we wish to and should greet the new state with innermost joy and gratitude,” believing that even the actions of the regime that were “less pleasing” needed to be seen as part of the one “salvational act of God.”Footnote 141 This statement is a very telling one, and perhaps offers some insight into larger debates on German responses to the “Jewish Question.” Different formulations have been used to describe the issue of public opinion in the Third Reich, with some debate between Ian Kershaw and Otto Dov Kulka as to whether Germans' views are better characterized as a “lethal” or “moral indifference” or “passive complicity.”Footnote 142 The phrase “passive complicity” captured the notion that the “general passivity of the population in the face of persecution of the Jews” meant an “ensuing objective complicity.”Footnote 143 Kershaw's notion was that “of shrugging one's shoulders or turning one's back on an evil in recognition that one can do nothing about it, and in the feeling that other concerns are more pressing or overwhelming.”Footnote 144 Obviously, the present study is dealing with a particular segment of the German population in 1933—whereas much of the debate focuses on “public opinion” in the war years. Neither of these statements fully encompasses the response of these ministers in their conscious decision making. What appears to be lacking is agency. There was tolerance of antisemitic policies because of the perceived benefits of the Nazi regime (“national redemption”), while support was given not for an antisemitic regime, but a salvational nationalist one. On one level, the discussion in this Pastors' Prayer Group matches Kershaw's formulation. They were far more concerned with their own issues within the church than they were with issues such as those facing German Jews, and their perspective was (it appears) limited to German Christians, including converted Jews. A phrase that perhaps meets the requirements of both Kulka and Kershaw, and one that certainly seems applicable to the Pfarrergebetsbund is “actively passive.” What was illustrated through the pastors' discussion in 1933 is that they were not indifferent to racial ideology––they genuinely seem to have felt it challenged the foundations of the Protestant Church. But while opposing such notions in the church, in the political field they were (at the very least) willing to tolerate anti-Jewish racial policy.Footnote 145 They acknowledged antisemitism and “less pleasing” aspects of Nazi Germany, but made a conscious decision to accept them as part of a “salvational act of God.” G did not elaborate, though by this point there had not only been public acts of antisemitism such as the boycott on April 1 but also the burning of “un-German writings” on May 10 and the creation of a concentration camp for the Nazis' political opponents (at Heuberg) that was widely reported in the Württemberg press.Footnote 146 In point of fact, antisemitic measures may well have had little impact on these pastors or their congregations.Footnote 147 But a willingness to overlook antisemitic policy (or attacks on political opponents or any “less pleasing” action) because of other aspects of Nazism––such as the apparent salvation of the German nation––meant they were actively passive, having made a choice to remain passive, to abide.Footnote 148 At the same time there were clear signs that the “new Germany” was not the Christian state they sought, and G went on in this vein: “But alongside this, what deep pain and what serious concern about the unholy, confused situation of our church.”Footnote 149 This was a tremendous qualification for people whose lives were dictated by their religious faith. He epitomized the conflict that existed for these conservative pastors as a whole, what might be termed a clash of conservatisms: a national or political conservatism as against a religious and theological conservatism.Footnote 150 G saw a vast discrepancy between the Nazis' national revival and the spiritual awakening that should underpin it. He relied on Hitler's statements in arguing that “The work for the Volk is truly something very good: it is based on overpowering Bolshevism, which would have killed off all religious life; it is carried by the conviction of the Führer that our Volk also requires a religious revival.”Footnote 151 He had strong concerns, however, that such a religious revival had not come about. Although a national leader had been received in the “God-given Führer,” Germany still lacked a “spiritual leader” who could solve the spiritual confusion of the Protestant Church.Footnote 152 There was a political or national joy expressed, and that very enthusiastically, but the correlative of this was religious concern. G argued that all the pastors in the prayer group were one in the conviction that the Kingdom of God could only be promoted through “the working of the Holy Spirit, which awakens men's souls, renews, sanctifies,” but held that this was currently impossible because of the overwhelming politicization of life.Footnote 153 He astutely observed that there was a form of sensory overload in Germany, driven especially through media such as the radio, that did not allow time for reflection. While he believed this hindered the kind of contemplation needed to find God, his observation captures more generally the Nazis' use of radio and festivals. Much of their propaganda effort aimed to maintain an unquestioning experiential enthusiasm, creating a kind of perpetual motion: a sense that the nation was constantly moving forward. This was a point that Detlev Peukert made in his work Inside Nazi Germany, describing an “empty but permanent activism” as driving much early participation in the SA, and arguing that the Nazi “vision” was a “perpetuum mobile of a utopian Volksgemeinschaft bent on struggle.”Footnote 154 According to G, this left no room for the religious realm. Asking how the prospects now appeared for a “spiritual springtime” that would drive “all church distress into the background,” he concluded that the outlook was not good: “Is it not so that the tremendously strong emphasis on the political, Volk-bound values in our time necessarily pushes religious interest and life into the background?”Footnote 155 Not only this, but völkisch ideas were invading the religious realm: “the Germanic wave in religion, so terribly up to date . . . [it] entices, encompasses, inundates––and it threatens to push back Christian values to a minimum, to put them in the shade.” By December 1933, these conservative pastors were not only concerned about a lack of religious revival, but that Christianity was under attack. The problem that we face in dealing with such a group as these pastors is that of a very limited concern. They effectively saw their battle as lying within the church. The focus was on a supposed act of God, the “national rebirth” that Roger Griffin posited was at the heart of fascism, rather than the “redemptive anti-Semitism” that Saul Friedländer argued was at the heart of Nazism.Footnote 156 What this meant in turn is that the Nazi government's antisemitism was viewed as tolerable. An “actively passive” response indicates two major points. First, members of the church (including very leading members) viewed their interest as largely limited to the ecclesiastical realm. Second, such a perspective meant that the apparently positive aspects of the new regime for the church overwhelmed the negative aspects. The idea that this was a “salvational act of God” drew on notions of a government that was not only reviving Germany as a nation, but that was also creating a “Christian state.” It also drew very powerfully and directly on the experience of overfilled churches in 1933, and preexisting notions of church revival in the “experience” of 1914. This religious coloring to the year helps partly to explain the fact that the massive church attendance was reported, whereas the April boycott was not. There was a belief that on balance the “less pleasing” aspects could be borne, as long as they did not amount to an incursion into the church––as the response to the Krause controversy indicates. Though there was generally a celebratory mood in the Gemeindeblatt, concerns were expressed both in the paper and among the Pastors' Prayer Group as to what this all meant. Belief in a national revival under the Nazis still existed, as did a belief that Nazi Germany was a state in support of religion. But for these conservative Christians, at least, the year was no longer seen as a “spiritual springtime.”"}, {"url": "https://www.bbc.co.uk/history/british/tudors/english_reformation_01.shtml", "page_content": "Strange turn of events For much of the sixteenth century England and Scotland hated each other with all the passion of warring neighbours. Yet in 1603 a Scottish king would ascend the English throne with the connivance and general approval of the English ruling elite. This unlikely turn of events owed much to the eccentricities of the Welsh Tudor dynasty that had occupied the English for almost precisely that century: the determination of the father, Henry VIII, to marry often and the equal determination of the daughter, Elizabeth, not to marry at all. But it also owed a great deal to Protestantism. There was little that bound together the English aristocracy and the Scottish king, for whom they developed a profound distaste, than a shared commitment to Protestantism. It was a determination to preserve England as a Protestant nation that gave James VI and I his opportunity and which would doom his son Charles when his actions threatened to undermine this cherished identity. A remarkably smooth transition ...by the end of the century England and Scotland were... the cornerstones of Protestant Europe. For all the glories of hindsight, there are many ironies in this unlikely turn of events. The prevailing mood among historians has been to regard the translation of England to Protestantism as largely accidental, and certainly grudging. If England became a Protestant country, it is argued, it did so largely at the behest of its rulers and against its better judgement. If this was so, the transformation was indeed profound, for by the end of the century England and Scotland were rightly regarded as the cornerstones of Protestant Europe. The faith would become so deeply ingrained that in the seventeenth century both nations would defend their religious affinity with a passion that verged on bigotry. Yet the adoption of Protestantism had been, by the standards of the turmoil that had gripped much of Europe in this period, remarkably smooth. Top\n\nInitially, Henry defends the faith England in the sixteenth century, was a land of contrasts. Much less urban than either Germany or the Netherlands, it nevertheless possessed a thriving international trade centre in London and in Oxford and Cambridge, two universities of outstanding reputation. The universities, in fact, would play a significant role in the early campaigns against Luther. Henry VIII turned to their finest theologians for arguments allowing him to enter the lists against the growing threat of Lutheran heresy. This initiative would earn him from a grateful Pope the coveted title, Defender of the Faith. The progress of the Reformation in England was closely bound up with Henry's personal affairs. His increasing desperation to secure release from his marriage to Catherine of Aragon forced him to contemplate radical steps that went very much against the grain of his own instinctive theological conservatism. In this respect the Reformation in England would follow a model much closer to that of Scandinavia than Germany or Switzerland. Although England, like Bohemia, had its own indigenous mediaeval heresy in Lollardy, Luther's attack on the church had initially produced little resonance in England. Luther's works were imported into England at an early stage, but this may very often have been for the convenience of conservative theologians who bought them to refute them, such as Bishop John Fisher and Sir Thomas More. Henry's fateful decision There is no evidence of any great hostility towards the church...before the Reformation All of this changed when Henry made the fateful decision that only drastic action could extricate him from a marriage that, in the absence of a male heir, now threatened the future of his dynasty. In rapid succession from 1532, legislation was passed through Parliament curbing the influence of the papacy in England and appointing the King as Supreme Head of the Church. Once this and the divorce were achieved, the king moved to take control over much of the Church's property through the dissolution of the monasteries. The political nation was, for the most part, obediently compliant rather than enthusiastic. There is no evidence of any great hostility towards the church and its institutions before the Reformation; on the contrary, both the English episcopate and parish clergy seem to have been, by the standards of other European lands, both well-trained and living without scandal. Cardinal Wolsey, who fathered an illegitimate son, was very much the exception. On the other hand, few were prepared to defy the King to defend the threatened institutions of the old church. Many benefited from the windfall of church property that followed the confiscation of monastic lands. Top\n\nA powerful reforming party emerges at Court As Henry's health failed in the last years of his life it became clear that his own actions had encouraged the growth of a powerful evangelical party at Court. On his death in 1547 they moved quickly to establish their supremacy in the regency government made necessary by the youth of the new king, Edward VI (1547-1553). So, the short reign of Edward VI saw a determined attempt to introduce a full Protestant church polity into England, modelled on that of the Swiss and German Reformed churches and driven on by a powerful alliance of Archbishop Cranmer and the Lord Protector, the Duke of Somerset. In the five years of the king's life, much was achieved: two evangelical Prayer Books, a new English order of service and the stripping of the remaining Catholic paraphernalia from the churches. But time was too short to put down roots. On Edward's death in 1553, the changes were reversed easily by his Catholic half-sister, Mary (1553-1558). Only Mary's devotion to the papacy (which threatened the continued possession of former monastic property in the hands of those who had purchased it from the crown), and her determination to marry her cousin, Philip of Spain, provoked a half-hearted reaction. English Protestantism was reduced once again to a persecuted remnant; many of its ablest figures taking refuge abroad, to avoid martyrdom - the fate of those whom remained behind. From Mary to Elizabeth English Protestantism was reduced once again to a persecuted remnant... So, in 1558 Elizabeth acceded to a troubled throne, after a five-year period in which Catholicism had been re-established in England with little apparent difficulty. Although the changes of Mary's reign were now reversed once more, Elizabeth and her councillors were under no illusions that many of her subjects remained obstinately attached to the old ways. It would be well into the last two decades of Elizabeth's long reign before it could be said with confidence that Protestantism was the religion of the majority in England. Top\n\nThe new, insecure regime For the first decades those who opposed the religious policies of the Elizabethan government could take comfort from the evident insecurity of a regime embodied by a mature, childless Queen who obstinately refused to marry and whose nearest heir was the Catholic Mary Queen of Scots. Had Elizabeth died early (as she nearly did in 1563, from smallpox), England too might have plunged into the same religious civil war convulsing neighbouring lands on the Continent. Given this evident insecurity, it was with remarkable confidence that Elizabeth and her advisors addressed those complicated problems of domestic and foreign policy arising from a new restoration of Protestantism. The Church of England would remain, in the words of its Protestant critics, 'but halfly reformed'. A Parliament gathered to settle religion in 1559 compliantly reinstated the Protestant Prayer Book of Edward VI. But Elizabeth balked at the introduction of the full Calvinist Church order urged upon her by foreign theologians and by some of the English exiles who, having withdrawn to the continent during Mary's reign, now returned to assist the new regime. The English church retained Bishops and ecclesiastical vestments, which many of the hotter Protestants regarded as an unacceptable Popish survival. When in 1566 Elizabeth insisted upon uniformity in clerical attire, a substantial proportion of the English clergy (up to ten per cent in London) refused to submit and was deprived. Further attempts to move the Queen to a more perfect Reformation, whether by Parliamentary statute or subtle pressure from the bench of bishops, proved equally unavailing. The Church of England would remain, in the words of its Protestant critics, 'but halfly reformed'. Top\n\nA secure Protestant identity Despairing at the Queen's obstinacy and at the apparent indifference of broad sections of the population to the call to a godlier lifestyle, evangelicals took refuge in brotherhoods and congregations that became increasingly detached from the mainstream church. The frustration of reform measures in the Parliaments of 1571 and 1572 led some into formal separation. In the latter years of Elizabeth's reign Puritanism gave way to sectarian non-conformity, and eventually into outright confrontation with the established church. But the numbers involved in such open dissidence were small, the vast majority of the godly preferring to remain in communion and to seek consolation in voluntary associations which provided an appropriate context for the puritan lifestyle. And in the main, their choice was justified, for whatever their disappointment at Elizabeth's lack of godly zeal, England's general allegiance to the Protestant cause was not in doubt. Even from the beginning of the reign there were evident proofs of this in an ambitious foreign policy which led swiftly to confrontation with the leading Catholic powers. By the last quarter of the century England was destined to play a pivotal role in the survival of Calvinist powers on the Continent, as they faced the most profound threat to their survival from a resurgent Catholicism. By 1603, English people had come to esteem their Church. By the time Elizabeth's long reign came to an end in 1603, English people had come to esteem their Church. The trials of the last three decades had in a very real sense secured England's Protestant identity. Through a generation of conflict in which the enemy had been foreign, Catholic and dangerous, English people had come to identify their Church and Protestantism, as a cornerstone of their identity. This was not manifested, necessarily, in any very profound grasp of the theological tenets of faith. While English readers seem to have been avid consumers of catechisms and other cheap volumes of religious instruction, their clergy, as elsewhere in Europe, continued to lament how shallow was their grasp of doctrine. Yet the identification could be more subtle and oblique, but still very real. The Catholic festival year, for instance, had been gradually superseded by a calendar of new, largely unofficial and profoundly Protestant patriotic festivals: the defeat of the Armada, Crownation day, the date of Elizabeth's accession. In 1605 they would be joined by 5 November, the date of the discovery of the Gunpowder Plot, proof, if proof were needed that Catholicism was still considered perfidious, deadly and deeply un-English. The celebration of Guy Fawkes' day with bonfires and fireworks is a reminder of how fresh these Reformation controversies remained in the consciousness of the people for many centuries. Top\n\nFind out more Top"}, {"url": "https://www.bbc.co.uk/religion/religions/christianity/history/uk_1.shtml", "page_content": "Constantine and Augustine The rise of Christianity from a persecuted sect to a global religion is a remarkable story of guts, faith, chance, politics and Providence. This article charts the course of Christianity in Britain from its first tentative steps to the final settlement of a Protestant faith. In the 1st Century AD, Britain had its own set of religious icons: Pagan gods of the earth and Roman gods of the sky. Into this superstitious and violent world came a modern, fashionable cult from the east: Christianity. We tend to associate the arrival of Christianity in Britain with the mission of Augustine in 597 AD. But in fact Christianity arrived long before then, and in the 1st Century AD, there wasn't an organised attempt to convert the British. It began when Roman artisans and traders arriving in Britain spread the story of Jesus along with stories of their Pagan deities. Christianity was just one cult amongst many, but unlike the cults of Rome, Christianity demanded exclusive allegiance from its followers. It was this intolerance of other gods, and its secrecy, which rattled the Roman authorities and led to repeated persecutions of Christians. Christians were forced to meet and worship in secret. But a single religion with a single God appealed to the Roman Emperor Constantine. He saw that Christianity could be harnessed to unite his Empire and achieve military success. From 313 AD onwards, Christian worship was tolerated within the Roman Empire. During the 4th Century, British Christianity became more visible but it had not yet won over the hearts and minds of the population. Pagan beliefs still abounded and Christianity was a minority faith. It looked as if Paganism might again get the better of Christianity when, after the departure of the Romans, new invaders arrived: Angles, Saxons and Jutes. Yet somehow Christianity survived on the Western edges of Britain, even during the Dark Ages. Missionary activity continued in Wales and Ireland, and in Western Scotland Saint Columba helped to bring a distinctly Irish brand of Christianity to mainland Britain. It could be argued that it was Augustine's famous mission in 597 AD from the Pope in Rome to King Aethelbert of Kent that really set up the future course of Christianity in Britain, creating a strong alliance between Christianity and Kingship. Certainly the Venerable Bede wanted to see it this way. For Bede, a Christian England was part of God's master plan. It was Providence that meant it was the destiny of the Anglo-Saxons to become Christians, united in a single Christian nation. But how would this come about? In the account of the Synod of Whitby in his Ecclesiastical History of the English People, Bede describes the showdown between the Irish Christianity epitomised by Saint Columba and the international Roman brand of Christianity which had been brought by Augustine. Bede ends his Ecclesiastical History bemoaning the laziness of the Anglo-Saxons who he saw as half-hearted Christians still holding onto Pagan practices. An organised and disciplined parish life which would regulate the beliefs and behaviour of the British people was still to mature. Top\n\nAlfred and the Normans Christianity rose from a minor cult to demonstrate the potential to be a major national religion, but had yet to win the hearts and minds of the population. The faith had already proved that it was able to survive invasion and attack. But just as Christianity's rise looked to be unstoppable, the Viking invasion of Lindisfarne in 871 AD marked the start of a series of attacks which threatened to destroy the Christian church. Monasteries and churches were plundered, and priests fled for their lives. It looked as if Paganism would again crush Christianity. It was Alfred, the Christian King of Wessex, who turned things round. Alfred saw the Viking attacks as punishment from God. Once Alfred had secured a victory over the Viking warrior Guthrum at the Battle of Eddington, he set about creating a new system of Christian learning that would reach the illiterate country people. It was Alfred's hope that this would enable Christianity to begin to capture the imagination of the ordinary people. In the 10th Century, lords began to provide small chapels on their land where local people could use the services of a priest. This sowed the seeds of the parish system, still in existence today. It was the Norman Conquest that really cemented the power of the church in England. William the Conqueror implemented a colossal building project at both monastic and parish level. In Winchester, for example, the old Saxon Minster made way for a new Norman building. These new stone churches continued to play a central role in community life: they acted as schools, market places and entertainment venues. The medieval period in Britain is really a story of how Christianity came to dominate the lives of the ordinary people, both at home and on the long and perilous journeys of pilgrimage. But it would be wrong to think of medieval Christians as devout church-goers who flocked to church every Sunday. Professor Ronald Hutton of Bristol University suggests that on average people would go to church just a few times a year, when there was a real spectacle to take part in. But even those who weren't regular churchgoers could not escape regulation by the Church. As Dr Sarah Foot of Sheffield University explains, you could argue that Christianity had an impact on \"every single aspect of every member of the population's lives\". Indeed \"the Church regulated lives by controlling what people did during the day and what they did in bed\". From the cradle to the grave, and every stage in between, the Church could be your ally or your foe, and ultimately your passport to heaven or hell. Top\n\nThe Reformation At the beginning of the 16th Century there was nothing inevitable about the Reformation in England. England was not bound to turn Protestant like its Northern neighbours - indeed a bookmaker would have given pretty high odds against it. No one could predict what was to happen over the next 150 years, least of all the king who started the process. Reform movements on the Continent were successfully influencing their governments to bring about change. In England reformers were a tiny minority: people who wanted changes in the medieval Catholicism that had dominated for centuries. There was criticism of the 'magic-like' qualities of medieval Catholicism, the rituals that cluttered up the relationship between the individual and God. There was talk of corruption and money-making that had distorted the true and simple meaning of the gospels. But these criticisms were not the cause of Henry VIII's decision to break from Rome. Henry wanted to divorce and re-marry in order to try and secure an heir, but the Pope would not grant him permission. So Henry divorced England from the Pope instead. He was happy to endorse a few religious changes so that his decision to split from the Catholic Church didn't look too blatantly driven by self-interest. Religious changes under Henry were minimal in comparison to those wanted by the reformers wanted but they made a big difference to the individual believer. Until then the Bible had been in Latin: the priest alone told people what it meant. Suddenly there was to be an English bible in every Church. There would be no more pilgrimages to shrines with hospitality laid on by the Church, no more relying on prayer to the appropriate saint for ailments and grievances. The monasteries, an entrenched and influential symbol of medieval Catholicism, were closed and their lands sold off. Reformation really took off under Henry's Protestant educated son, Edward VI. He changed the ritual of the mass and abolished the sacraments of penance and the last rites of the dead. He declared that Purgatory no longer existed and prayers for the dead were written off as useless; God alone decided whether you were saved or damned. Churches were stripped of their artefacts and priests no longer had to be celibate. By the end of Edward's reign the Reformation was much more than political: it felt personal since it cut so deeply into people's habits and beliefs. Dissent was punishable by death. Six years after his coronation Edward VI died and his Catholic half-sister, Mary, set history into reverse. England once again became Catholic. English Bibles were removed from churches, the Latin mass said again. The trappings of old Catholicism reappeared in the churches. Priests who had married were suddenly banned from seeing their wives without a chaperone. Henry's changes were barely 20 years old, so most priests had been trained and most parishioners baptised as Catholics. For those who did not want to slip back into the Catholic fold the only road was persecution and martyrdom. Under Mary's orders hundreds of Protestants were burned at the stake. Then after five years the unexpected happened again. The queen died. She had no heir and her sister Elizabeth took the throne. The nation once again became Protestant and the Protestant simplicity of the churches was restored by force. By the end of Elizabeth's reign a stunning transformation had occurred. There was no single clever tactic that achieved this, merely the passing of time. By now, the majority of the population had only known Protestantism because the generation baptised into Catholicism had died. For the first time the majority of the nation felt Protestant. To be Protestant was to be English and those stubbornly remaining Catholic were traitors. Elizabeth refused to abolish bishops - disappointing the more extreme Protestants, the Puritans, but keeping the vast moderate majority on side. The balancing act was maintained by her successor, James I. The King James Bible defines the nation and encapsulates its religion. The Protestant propaganda machine had finally won the battle, with its religious catechism uniquely and brilliantly pitched at each social and intellectual stratum. From school children to soldiers, each citizen was expected to know the core Protestant doctrines, to read from its custom designed text. The old religion had by and large been flushed out and the new one successfully implanted. The Reformation has been sold to the English and it looked like nothing could challenge it. Top"}, {"url": "https://www.encyclopedia.com/religion/encyclopedias-almanacs-transcripts-and-maps/christianity-protestantism", "page_content": "Christianity: Protestantism\n\nFOUNDED: 1517 c.e.\n\nRELIGION AS A PERCENTAGE OF WORLD POPULATION: 5.8 percent\n\nOVERVIEW\n\nAlong with Roman Catholicism and Eastern Orthodoxy, Protestantism is one of the three major branches of Christianity. It is divided into numerous groups, often called \"denominations,\" that are marked by their own institutional characteristics. Each denomination has its own history, and each possesses unique beliefs, emphases, organizations, and practices that set it apart from other groups in the Protestant family. These extensive differences make Protestantism appear fragmented compared with the highly centralized structures of authority that mark Catholicism and Eastern Orthodoxy. A common conviction of Protestantism is that humans are saved not by good deeds or other actions but by faith in Jesus Christ alone. Humans receive this salvation though the work of the Holy Spirit, who illuminates the readers of Holy Scripture with the gift of faith.\n\nThe early Protestant groups emerged in sixteenth-century Europe in what came to be called the Reformation. The term \"Protestant\" was first used in 1529, when five German princes seeking church reform issued a statement (Latin, protestatio) at the Diet of Speyer. This statement of belief declared solidarity against the powerful Roman Catholic majority. Later in the sixteenth century the term came to describe two reforming movements that separated from the Catholic Church: Lutheranism, based on the teachings of Martin Luther (1483–1546), and Reformed, based on the work of Huldrych Zwingli (1484–1531) and John Calvin (1509–64). An additional stream of protest against the Catholic Church, which featured a rejection of infant baptism, was called \"Anabaptist.\" In England a \"middle way\" between Catholicism and Protestantism was developed, resulting in the Church of England, or Anglicanism. Protestantism has subsequently spread throughout the world, although some contemporary groups have moved away from and beyond their Protestant roots.\n\nHISTORY\n\nThe beginnings of Protestantism are traditionally associated with an event that took place on 31 October 1517; Martin Luther, then a Catholic priest, nailed his \"Ninety-five Theses\" to a church door in Wittenberg, Germany. Criticizing elements within the Roman Catholic Church that Luther viewed as not rightly based on Scripture, these were intended as items for debate. Luther's emerging critique of the Catholic Church and his developing theology led to his excommunication by Pope Leo X in 1520. His writings and reforming activities gave rise to the formation of \"evangelical\" churches that opposed Catholic theology and sought to focus authority for Christian faith and practice on the Old and New Testaments instead of the teachings of the church.\n\nThe joint \"protestation\" of princes at the second Diet of Speyer in 1529 led to the use of \"Protestant\" to describe those who opposed the halting of the reform movement, something Roman Catholics at the diet proposed to do. But the term also had a positive meaning. The Latin protestari means \"to witness,\" \"to profess,\" or \"to declare formally,\" which was consistent with the desire of those at the Diet of Speyer to \"testify openly before God … and likewise before all persons and creatures\" according to their consciences. Thus, Protestants are those who witness, or testify, to their Christian faith.\n\nAlthough the term did not appear until 1529, during the 1520s new churches had begun to emerge that could be called \"Protestant.\" These bodies opposed the doctrines, organization, and juridical functions of the Catholic Church. The new churches and movements represented the theological beliefs of Luther and, later, those of Huldrych Zwingli, John Calvin, and the Anabaptist Menno Simons (1496–1561).\n\nThe followers of Luther established Lutheran churches, whereas those who followed Zwingli and Calvin were called \"Reformed\" or \"Calvinist.\" The name \"Reformed\" recognized the impulse of these two men to reform the church \"according to Scripture.\" Zwingli and Calvin had theological disagreements with Luther about such issues as the Lord's Supper, or Communion (opposing Luther's view that during the Lord's Supper the bread and wine were transformed into the physical body and blood of Christ). The Anabaptist stream of Protestantism was made up of groups that emphasized baptism not for infants but for mature believers who professed their faith in Jesus Christ. This view made Anabaptists suspicious in the eyes of Catholics as well as Lutherans and the Reformed. Typically Anabaptism was also marked by a strong sense of social radicalism, the desire to order the church according to New Testament patterns and practices, and an expectation of the imminent end of the world.\n\nSince the sixteenth century there has been a proliferation of Protestant bodies worldwide. These groups are termed \"denominations\" (Latin, denominare; \"to name\") in the United States. Among the most prominent denominational families are Adventist, Anglican (Episcopal in the United States), Baptist, Brethren, Campbellite/Restorationist, Christian Church, Church of God, Congregational, Friends (Quaker), Holiness, Lutheran, Mennonite, Methodist, Moravian, Pentecostal, Presbyterian, and Reformed. Today so-called mainline denominations have their own identities, while Protestants across denominational lines sometimes primarily identify themselves as \"evangelicals,\" stressing the need for a personal relationship with Jesus Christ, or as \"fundamentalists,\" interpreting Scripture in a literal sense. As these groups function through church bodies in different countries, they incorporate various cultural practices that accompany their theological beliefs. There is no single head or leader of Protestantism, each church family instituting its own form of church government.\n\nCENTRAL DOCTRINES\n\nProtestantism emerged out of Martin Luther's protest against the doctrines and practices of the Roman Catholic Church as he understood them in the context of sixteenth-century Germany. Protestants today continue to be marked by a rejection of Catholic dogma, church structure, and views on authority. They also differ from Eastern Orthodoxy in theological views and in matters of church government and authority.\n\nThe critique of Catholic teachings can be summarized through Reformation slogans that became watch-words among Protestant adherents. The first of these is \"Scripture alone\" (sola scriptura). Luther's initial criticism of Catholic teachings involved the practice of indulgences, the paying of money to reduce the number of years spent in purgatory. Luther believed that the practice was not scriptural. His developing theology was centered on the conviction that it is Scripture alone, not Catholic teaching (magisterium) or tradition, that provides authority for the church and the Christian. Scripture is God's Word and is the source from which theological understandings are developed. This contrasts with the Catholic view that it is the church through its traditions that interprets Scripture and thus that tradition plus Scripture are the sources of authority. Because of the conviction that it is in Scripture that God's Word and presence are found, Protestantism focuses on the interpretation of the Bible.\n\nA second slogan is \"Christ alone\" (solus Christus). The Scriptures bear witness to Jesus Christ as God's incarnate Word, for it is in him that the full expression of God is found. As the second person of the Trinity, Jesus became a human being, and he is the only agent through whom salvation can be accomplished. Protestantism stresses that salvation—a restored relationship with God in which human sin is overcome—is possible only through the work of Christ in his life, death, and resurrection. For Protestants, Christ is the sole agent of salvation, and one can be saved apart from the church and its sacraments, which are emphasized in Catholicism.\n\nA third slogan is \"grace alone\" (sola gratia). Protestant theology emphasizes that salvation is God's free gift. Salvation is not earned; it is not gained by human works or by righteousness of any kind. Humans are sinful and incapable of performing any actions that can remove their sin or make them right, or \"just,\" in the eyes of God. Yet God showed his love by sending Jesus Christ to die for the sins of the world so that the relationship between God and humans that had been ruptured by sin could be restored. Salvation is provided solely through God's gracious love in Christ. This view contrasts with the traditional Roman Catholic belief that humans can cooperate with God's grace and thus provide an element of their salvation through the doing of works that are good in God's sight.\n\nFinally, there is \"faith alone\" (sola fide). Humans receive the gift of salvation by faith. Luther's critical insight was that \"the just shall live by faith\" (Rom. 1:17). This means, Luther believed, that it is by faith, or trust, in God's gift in Jesus Christ, who died for the sin of the world (Rom. 5:8), that humans receive the gift of salvation. This contrasts with the traditional Roman Catholic position that it is faith plus human works that produce salvation. According to the Protestant view, the Christian does works that are pleasing to God but does them as an expression of faith, not as a cause for salvation.\n\nThese major characteristics of Protestantism are also the basis for other distinctive views on such matters as sin, the church, the sacraments of baptism and the Lord's Supper, and eschatology (future life). For example, on the basis of Scripture, Protestants reject the Catholic classification of sins as either \"mortal\" or \"venial\" and the doctrine of purgatory.\n\nMORAL CODE OF CONDUCT\n\nAs guides for living a Christian life, Protestantism looks to the centrality of love and justice as expressed in the person of Jesus Christ. Jesus himself embodied God's love and commanded his followers to express this love. He saw love as the fulfillment of the law and the prophets of the Old Testament (Matt. 22:40), and Protestants look to the life of Jesus as a model for living faithfully before God and in right relationships with other people.\n\nProtestants also emphasize that those Christians who are related to God by faith and who follow Jesus Christ can live their lives in freedom as the children of God. The power of sin as the controlling force in life is broken by the forgiveness that comes through the death of Christ on the cross (Eph. 1:7; Col. 1:14). The power of the moral law to condemn sinners also is broken by the grace of God in Christ (Rom. 6:14). Christian life is life in the Spirit who dwells in believers (Rom. 6:9–11). This gives Christians the freedom to follow Christ as their guide for moral conduct and to be open to the leading of God's Spirit in determining how to live and how to act. Christian freedom involves the responsibility of seeking the will of God in all things. For Protestants the goal of Christian living is to \"do everything for the glory of God\" (1 Cor. 10:31).\n\nFreedom in Jesus Christ does not mean, however, that the moral law of God expressed in the Ten Commandments no longer has a role to play. The Reformed tradition of Protestantism has especially stressed the place of the law in Christian life. The law is seen as an expression of the will of God, which was fulfilled in Christ. The Ten Commandments are guides to the kind of conduct God desires humans to follow, and those who love God in Christ will keep the law and obey the commandments out of thankfulness for the forgiveness and salvation given in Christ. Christians live an ethic of gratitude for the love of God expressed in Christ.\n\nChristian freedom, with an emphasis on thankfulness expressed through obedience to God's will, leads Protestant churches to emphasize the \"fruit of the Spirit\"—characteristics such as love, joy, peace, and kindness (Gal. 5:22–26)—both in individual lives and in the ministry and mission of the church. The will of God as expressed through the Old Testament prophets also provides ethical direction, for the power of sin requires that the cries of the prophets for justice, righteousness, and peace be repeated in every age. This involves the church and its members in struggles for justice and peace and in active involvement in the problems of society. These ethical concerns emerge from biblical perspectives and are motivated by the call of Jesus Christ to follow him (Mark 2:14).\n\nSACRED BOOKS\n\nProtestants believe in the authority of the Bible. The canon of Scripture in Protestantism consists of the 39 books of the Old Testament and the 27 books of the New Testament. The Apocrypha, or deuterocanonical books, may be studied but do not possess theological status as part of the canon. Theological writings, pronouncements of church councils, confessions of faith, and creeds are subordinate standards for understanding the Bible, which for Protestants is authoritative as God's Word.\n\nSACRED SYMBOLS\n\nProtestant churches vary in the amount of symbolism they display in their sanctuaries and during worship. As the central symbol of Christianity, the cross is nearly always displayed in church buildings. Protestants usually display an empty cross, recognizing that Jesus Christ has been raised from the dead, rather than a crucifix, displaying Christ on the cross, as in the Roman Catholic tradition. Most Protestants allow the cross to be worn in various forms of jewelry.\n\nEARLY AND MODERN LEADERS\n\nOne early Protestant leader of high standing was Martin Bucer (1491–1551), of Strasbourg, who had strong ecumenical impulses and tried to bring reconciliation between the emerging theological positions of Lutheran and Reformed Christians. In England, George Fox (1624–91), the founder of the Religious Society of Friends (Quakers), possessed tremendous organizing abilities to accompany his magnetic personality and spiritual vitality. The founder of the Methodist movement was John Wesley (1703–91), whose itinerant preaching in England and voluminous writings, along with his great capacity for leadership, gained many followers and established a significant body of those who rejected the tenets of Calvinism.\n\nThroughout the years Protestants have been leading figures in many areas of endeavor. Well-known Protestants in modern times whose influence has been world-wide include Albert Schweitzer (1875–1965), best known for his medical work in Africa; Dietrich Bonhoeffer (1906–45), a German theologian who opposed Adolf Hitler; Toyohiko Kagawa (1888–1960), a Japanese Presbyterian minister, social worker, and evangelist; Martin Luther King, Jr. (1929–68), a U.S. civil rights leader; Archbishop Desmond Tutu (born in 1931), a leading South African foe of apartheid; and Billy Graham (born in 1918), an American evangelist who has preached throughout the world.\n\nA number of Protestant women have made important contributions. One early leader was Katharina Schütz Zell (1497/98–1562), of Strausbourg, who was a tireless provider for the needs of the poor, a strong advocate of toleration of both Roman Catholics and Anabaptists, and a zealous preacher of the gospel in word and deed. Queen Elizabeth I (1533–1603) was instrumental in establishing a moderate Protestantism in England, and Selina Hastings, Countess of Huntingdon (1707–91), was a lay leader in the eighteenth-century British evangelical revival. Anne Hutchinson (1591–1643), a New England colonist, was an early advocate of religious liberty and women's rights. Other important Protestant women in the United States have included Harriet Beecher Stowe (1811–96), author of Uncle Tom's Cabin (1852); Susan B. Anthony (1820–1906), Quaker social reformer; Elizabeth Cady Stanton (1815–1902), women's rights leader; Lucretia Mott (1793–1880), Quaker minister and social reformer; and Jane Addams (1860–1935), settlement house founder and peace activist.\n\nMAJOR THEOLOGIANS AND AUTHORS\n\nMartin Luther (1483–1546) provided Protestantism with its earliest theological expressions, while Philipp Melanchthon (1497–1560) was an important participant in theological disputations. Huldrych Zwingli (1484–1531) was a Swiss who began reforms in Basel and who, along with John Calvin (1509–64), was one of the leading theologians of the Reformed stream of Protestantism. Major early Anabaptist theologians included Thomas Müntzer (c. 1489–1525), Balthasar Hubmaier (c. 1485–1528), Hans Denck (1495?–1527), Pilgram Marpeck (died in 1556), and Menno Simons (1496–1561). So-called second-generation Protestant theologians included Theodore Beza (1519–1605), Martin Chemnitz (1522–86), and Francis Turretin (1623–87). Later important Protestant theologians included Friedrich D. E. Schleiermacher (1768–1834), known as the father of liberal theology; Philipp Jakob Spener (1635–1705), German Pietist; Albrecht Ritschl (1822–89); Jonathan Edwards (1703–58), perhaps the most brilliant of American theologians; Charles Hodge (1797–1878); Abraham Kuyper (1837–1920), Dutch theologian, politician, and statesman; P. T. Forsyth (1848–1921); Herman Bavinck (1854–1921); Adolf von Harnack (1851–1930), a brilliant German historian of dogma; Paul Tillich (1886–1965), the most prolific and influential twentieth-century Protestant theologian; Karl Barth (1886–1968); and H. Emil Brunner (1889–1966). Other theologians of note have included Helmut Thielicke (1908–86); Jürgen Moltmann (born in 1926), who has reestablished the importance of eschatology for theology; Wolfhart Pannenberg (born in 1928), who sees theology as a science with universal scope; and John Cobb (born in 1925), a leading proponent of process theology, the view that God \"evolves\" with the world and that humans share in the process of his emerging identity and actions. Prominent authors in evangelical theology have included Carl F. H. Henry (1913–2003) and Donald G. Bloesch (born in 1928). Important women theologians in the United States have included Georgian Harkness (1891–1974), Letty Russell (born in 1929), and Sallie McFague (born in 1933).\n\nORGANIZATIONAL STRUCTURE\n\nThree forms of church government (polity) are found in Protestantism. Episcopal polity is hierarchical and features government by bishops, who have authority over local pastors and congregations. Presbyterian polity centers authority in presbyteries composed of elders and ministers from local churches within a region. Larger bodies, such as synods and a general assembly, also have governing roles. Congregational polity focuses on the local church body, which adopts its own standards for belief, organization, and practice.\n\nHOUSES OF WORSHIP AND HOLY PLACES\n\nProtestant churches vary greatly in their architectural styles. This is true not only in terms of the country in which churches are located but also in regard to the particular denomination to which a church belongs. To emphasize the centrality of the Word of God, Protestant sanctuaries feature a pulpit, which is often located in the center front of the sanctuary. An altar, where the bread and wine for the Lord's Supper are placed, is featured prominently in the front of the sanctuary as well. Reformed churches speak of a \"communion table\" instead of an altar. Churches also have a baptismal font or a baptistery for baptism by immersion. Other particular features of the sanctuary are distinctive to each Protestant tradition. For example, although almost all sanctuaries feature an empty cross, the size, type, and placement vary.\n\nWHAT IS SACRED?\n\nProtestants historically have focused on Jesus Christ as the Word of God, thus making subordinate all other persons, objects, or entities. Yet Protestants have also recognized various religious and even natural symbols as \"pointers to the divine.\" Some Protestant denominations with highly developed worship liturgies, such as Anglican churches, use extensive religious symbolism. Other Protestant bodies, such as Baptist churches, do not, but because of their emphasis on the Bible, they are sometimes accused of turning the Bible itself into a sacred object.\n\nHOLIDAYS AND FESTIVALS\n\nFestivals of the Christian year, as recognized by the universal Church, are observed by most Protestant denominations. Among others these include Advent, Christmas, Epiphany, Lent, Maundy Thursday, Good Friday, Palm Sunday, Easter, and Pentecost. Reformed churches initially rejected holiday and festival celebrations, but today most celebrate the major festivals. The ways in which these holidays and festivals are commemorated vary widely among Protestant churches. Local customs and practices may play a role in the way observances are carried out. Other days honoring saints and commemorating events in the traditions of specific churches are also observed. Individual congregations may recognize special days in their own locales. In a number of Protestant traditions, use of the Common Lectionary, or list of Bible readings for Sundays, provides a way by which celebration of the church's festivals are integrated into the worship practices of each congregation.\n\nMODE OF DRESS\n\nFor worship some Protestant clergy wear special vestments, which may include a clerical collar, a cassock or an alb, and a cross. In other Protestant traditions, however, the clergy dress in the same way as their parishioners. The variations in dress for clergy apply both to men and to women. Protestants have no prescribed modes of dress for laypersons, which vary according to time, place, and culture. Outside worship some clergy wear clerical garb, which clearly sets them apart from other persons and testifies to the clerical vocation. In other Protestant traditions clergy do not wear special garments outside worship, the emphasis being on their common unity with the laity.\n\nDIETARY PRACTICES\n\nMost Protestants do not subscribe to or participate in special dietary practices. Protestants historically have not emphasized fasting in the same way Roman Catholics have. Although fasting is not a prescribed activity, Protestants may at times fast voluntarily. In Protestantism there are no specific bans against eating meat or, for a number of Protestants, against using alcohol. Some Protestants, particularly in the United States, however, regard alcohol as sinful, which has led many churches to substitute grape juice for wine in the Lord's Supper. Many Protestants see the Lord's Supper in a sacramental sense as an \"eating and drinking with Jesus.\" For them the blessing of Jesus for fellowship around a table with food and drink gives Christians the freedom to enjoy these created, Godgiven elements as gifts that can and must be shared with others.\n\nRITUALS\n\nIn practice there is great diversity among the worship services of Protestant churches. The varieties exist between Protestant denominations and also within denominations themselves. Most Protestant traditions have clear liturgical practices that prescribe or suggest the elements of ritual for each worship service and the patterns by which worship is to be carried out. Church \"bulletins\" often list the order of worship and provide instructions for the congregation to follow. Protestant worship services typically consist of prayers, Scripture readings, hymns, an offering, and a sermon, as well as the sacraments of baptism and the Lord's Supper. Not all Protestant churches celebrate the Lord's Supper in each worship service. Baptism may be administered as appropriate, always to adults in the Protestant tradition and, for the Lutheran and Reformed streams, also for infants. Anabaptists insist that only adult baptism is valid. Some churches have a tradition of holding regular \"revivals,\" while others emphasize glossolalia, or speaking in tongues, and some practice foot washing. Weddings and funerals are typically special services. Weddings are usually held in a church sanctuary, whereas a Protestant funeral may be conducted in a church, a home, or a funeral parlor.\n\nRITES OF PASSAGE\n\nMost of Protestantism recognizes two sacraments, baptism and the Lord's Supper. In Anabaptist traditions these are regarded not as sacraments, in which God has promised to be present and which provide the benefits of salvation, but as \"ordinances,\" that is, as memorials or acts of obedience. The Lutheran and Reformed traditions baptize infants, whereas Anabaptist traditions recognize only adult baptisms. Baptism in general is the incorporation of the person into the household of God. For Protestants the Lord's Supper nurtures the faith of believers, who are \"nourished\" by the bread and the wine. Unlike Roman Catholics, Protestants do not believe that the \"substance\" of the bread and wine is changed into the body and blood of Christ. Other rites of passage typically include confirmation, a rite whereby those baptized as infants are \"confirmed\" by making personal affirmations of Christian faith. Ordination in Protestantism marks a person for a ministry or function in the church. Clergy are ordained, and in some Protestant traditions laity are also ordained as church officers. Wedding ceremonies are performed by Protestant clergy and typically take place apart from the weekly worship services. Wedding services witness to the blessing of God upon marriage. Funerals serve as a witness to the Resurrection and, in many Protestant traditions, also as a celebration of the life of the deceased.\n\nMEMBERSHIP\n\nMost Protestant denominations seek to expand their membership through evangelism or other means. In the history of Protestantism there has been a wide variety of evangelistic practices, ranging from special services featuring \"altar calls,\" or the opportunity for people to confess their faith in Jesus Christ, to door-to-door efforts, in which believers witness to their Christian faith to strangers. Many Protestant bodies have also been vigorous practitioners of mass evangelism through radio, television, and the Internet. Western Protestant churches historically have been deeply involved in missionary efforts to take the Christian gospel to people in other countries. In contemporary times, with recognition of the negative ways in which Western mores and culture were part of the traditional missionary enterprise, many of these efforts have taken different forms, including efforts to develop indigenous leaders.\n\nRELIGIOUS TOLERANCE\n\nBecause a number of Protestant churches were persecuted in their origins, many—especially in the Anabaptist stream—have stressed religious toleration and sought freedom to worship. After the sixteenth century degrees of toleration were granted in various European lands, and in some nations Protestant bodies became the state churches. In the American colonies religious intolerance was common, but with the adoption of the U.S. Constitution in 1788, freedom of religion became a founding ideal, and today Protestants and other groups enjoy religious toleration. To varying degrees Protestants have been involved in the ecumenical movement, seeking points of contact and agreement with Roman Catholicism and Eastern Orthodoxy. There also are dialogues among Protestants, both at official and local levels. Churches of Christ Uniting (COCU), originally the Consultation on Church Union, is ongoing in the United States.\n\nSOCIAL JUSTICE\n\nProtestants have made strong commitments to education, and many schools and universities owe their origins to Protestant church bodies. Education is seen as a gift of God and thus as a Christian responsibility. Protestant churches also have been concerned with the alleviation of poverty and have worked both legislatively and through local congregations to provide relief for the plight of the poor. In the United States the Social Gospel movement of the early twentieth century was a Protestant effort that made concern for the poor a central focus, believing that Christian responsibility for the less fortunate was both a personal and a collective mission. Some Protestant churches have been outspoken in their support for human rights. Through their official bodies Protestant denominations regularly issue pronouncements that address a wide range of issues in social justice.\n\nSOCIAL ASPECTS\n\nMarriage and the family have been important concerns for Protestant churches. Protestants view marriage as ordained by God and intended to be permanent. Many Protestant denominations, however, have dropped prohibitions on divorce and no longer consider it a disqualification for leadership. While marriage is not regarded as a sacrament, it is considered to be a sacred obligation. Nonetheless, given human brokenness, marriage is sometimes better ended through divorce, and divorced people may legitimately remarry. Because Protestantism did not adopt the requirement that clerics be celibate, marriage and family experience have been features of the life of the clergy. Protestants have not generally been opposed to birth control, believing that stewardship of the family is a responsibility of parents. Protestant's views differ on the ethical legitimacy of abortion.\n\nCONTROVERSIAL ISSUES\n\nA number of contemporary issues create divisions among Protestants. There are, for example, strong differences over the legitimacy of ordaining women to pastoral offices. Issues of war and peace are sometimes divisive, although political contexts and convictions play as great a role as formal theological views. The appropriateness of homosexuality and of homosexuals in church leadership is strongly debated. The great variety of political and cultural settings in which Protestant churches exist means that they are not unanimous in their perspectives on a number of other controversial issues. Among these are stem-cell research, cloning, and end-of-life issues.\n\nCULTURAL IMPACT\n\nA primary Protestant affirmation, that Christians are called to serve God in the midst of the world, has been a strong impetus for believers to engage their cultures fully and, at times, decisively. For example, the musical works of Johann Sebastian Bach (1685–1750) were composed in the service of the German Lutheran Church but provide religious depth for all Christians. George Frideric Handel (1685–1759) is perhaps best remembered for his oratorio Messiah. The Protestant tradition in hymnody has produced thousands of songs. Among writers the Puritan poet John Milton (1608–74), author of Paradise Lost, and John Bunyan (1628–88), author of The Pilgrim's Progress, stand out. Protestant literary traditions continue through the poet William Blake (1757–1827) to the present day with the contemporary Left Behind series, based on a reading of Scripture. The astronomer Johannes Kepler (1571–1630) and the mathematician Isaac Newton (1642–1727) were both Protestants.\n\nPriesthood of All Believers\n\nMartin Luther emphasized that all Christians are \"priests\" and thus are able to approach God directly through Jesus Christ. Baptism incorporates believers into the household of God, where as part of the \"people of God\" they are a \"royal priesthood\" (1 Peter 2:9). In the sixteenth century, however, \"priesthood\" had predominantly come to mean the ordained hierarchy of the Roman Catholic Church. Luther's rediscovery of the biblical usage became an important part of his theological understanding and a key point of Protestant doctrine. Christians may pray to God directly without the need for an ordained priest as a \"mediator.\" This view also implied that Christian believers can directly interpret the Scriptures without the need of priestly intermediaries.\n\nDonald K. McKim\n\nSee Also Vol. 1: Christianity\n\nBibliography\n\nBalmer, Randall, and Lauren F. Winner. Protestantism in America. New York: Columbia University Press, 2002.\n\nBenedetto, Robert, Darrell L. Guder, and Donald K. McKim. Historical Dictionary of Reformed Churches. Lanham, Md.: Scarecrow Press, 1999.\n\nCameron, Euan. The European Reformation. New York: Oxford University Press, 1991.\n\nChadwick, Owen. The Reformation. Pelican History of the Church, vol. 3. Baltimore: Penguin Books, 1968.\n\nDillenberger, John, and Claude Welch. Protestant Christianity: Interpreted through Its Development. New York: Macmillan, 1988.\n\nGeorge, Timothy. Theology of the Reformers. Nashville: Broadman, 1988.\n\nGritsch, Erich W., and Robert W. Jenson. Lutheranism: The Theological Movement and Its Confessional Writings. Philadelphia: Fortress Press, 1976.\n\nHillerbrand, Hans J., ed. Encyclopedia of Protestantism. New York: Routledge, 2004.\n\n——, ed. Historical Dictionary of the Reformation and Counter-Reformation. Lanham, Md.: Scarecrow Press, 1999.\n\n——, ed. The Oxford Encyclopedia of the Reformation. 4 vols. New York: Oxford University Press, 1996.\n\nLatourette, Kenneth S. History of Christianity. Vol. 2 of Reformation to 1975. New York: Harper and Row, 1975.\n\nLindberg, Carter. The European Reformations. Cambridge, Mass.: Blackwell, 1996.\n\nMacCullough, Dairmaid. The Reformation: A History. New York: Viking, 2003.\n\nMcGrath, Alister E., and Darren C. Marks. Blackwell Companion to Protestantism. London: Blackwell, 2004.\n\nMarty, Martin E. Varieties of Protestantism. New York: K.G. Saur, 1992.\n\nPelikan, Jaroslav. The Reformation of Church and Dogma 1300–1700. Vol. 4 of The Christian Tradition. Chicago: University of Chicago Press, 1984.\n\nTroeltsch, Ernst. Protestantism and Progress: The Significance of Protestantism for the Rise of the Modern World. Philadelphia: Fortress Press, 1986.\n\nWeber, Max. The Protestant Ethic and the Spirit of Capitalism. Translated by Talcott Parsons. 1904–05. Reprint, New York: Routlege, 1992.\n\nWelch, Claude. Protestant Thought in the Nineteenth Century. 2 vols. New Haven: Yale University Press, 1972–85.\n\nWilliams, George H. The Radical Reformation. Kirksville, Mo.: Sixteenth Century Publishers, 1992."}]}