{"Duncan Mackay started his career in 1969.": [{"url": "https://www.theguardian.com/sport/2003/aug/07/athletics.duncanmackay", "page_content": "Athletics\n\n\n\nSome of the greatest middle-distance runners of the last half-century will gather at the Norwich Union London Grand Prix at Crystal Palace tomorrow night to help celebrate the 50th anniversary of the world's longest continually held international mile race.\n\nSebastian Coe, Said Aouita, John Walker, David Moorcroft and Derek Ibbotson will all be there as past winners of the Emsley Carr Mile.\n\nThe race was inaugurated in 1953 by Sir William Carr in memory of his father Emsley, who like him had been chairman of the News of the World and a great athletics fan. The object was to bring together athletes from around the world for the purpose of running the first sub-four-minute mile, which at the time was regarded as the pinnacle of athletics achievement.\n\nIt remained one of Sir William's great disappointments that, when the barrier was finally broken, by Roger Bannister the following year at Iffley Road in Oxford, it did not happen in his race.\n\nBut there have been many memorable moments since to compensate. The first man to break four minutes in the Emsley Carr Mile was Ibbotson, who ran 3min 59.4sec at the White City in 1956. The race record stands to Hicham El Guerrouj, whose 3.45.96 in 2000 is the ninth fastest ever.\n\nThe Moroccan was due to chase a record fourth consecutive win but has withdrawn because of a minor back injury, leaving Cornelius Chircir as the favourite.\n\nIf he succeeds, becoming the fourth Kenyan winner, his signature will appear with every other winner's in a special Emsley Carr Mile Trophy illuminated book, bound in red morocco leather and based on the 1953 Coronation bible.\n\nIt contains a history of mile running since 1868 as well as signatures of many other leading milers, including Paavo Nurmi, Sydney Wooderson, John Landy and Bannister, now Sir Roger, and the result of each Emsley Carr Mile.\n\nThe original book was completed in 1980, so the following year Carr commissioned a second volume which matched the first. Other past winners include Kip Keino, Jim Ryun, Filbert Bayi and Steve Ovett.\n\nBut the race has particular significance for Coe. It was in this event that he ran his first sub-four-minute mile in 1976. He led for three laps before being passed by seven men in the home stretch, including Moorcroft, whose win in 3:57.06 fulfilled a dream.\n\n\"I'd watched the Emsley Carr Mile in 1967 when Jim Ryun had beat Kip Keino at White City,\" said Moorcroft. \"There are moments in your life when you want to do something and the Emsley Carr Mile had a mystique about it. I'd run it in 1971 when I was 18 and there had been lots of speculation that I would be the first teenager to break four minutes for the mile. But I got hammered at Meadowbank [Peter Stewart won]. So winning it in 1976 meant loads to me.\"\n\nThere was no beating Coe in 1977, though, when he finished ahead of a field that included Bayi. It heralded a golden age in British athletics during which the mile became the sexiest event in sport.\n\n\"I'd run on Saturday in the South Yorkshire League in the 400m and then for Britain against West Germany at Crystal Palace the next day,\" Coe recalled. \"Then the AAA officials said why not run in the Emsley Carr Mile the next day? I was debating about it but my old man said it was too big an opportunity to miss. It was a good decision. It was one of the races which started the ball rolling.\"\n\nBy the end of last year 938 men had broken four minutes for the mile, once thought to be beyond human reach. Despite the fact that the metric equivalent, 1500 metres, is the distance contested at major championships, the mile retains its unique fascination.\n\n\"Bannister's was probably the most significant world record ever,\" said Moorcroft. \"It was the Everest of athletics. It caught the public's imagination and therefore the legend of the Emsley Carr Mile lives on.\"\n\nIn 1969 Carr became ill and control of the News of the World passed to Rupert Murdoch. He decided not to continue the race's sponsorship, so the Amateur Athletic Association took it over and continued the tradition until Sir William died in 1977.\n\nSince then Emsley Carr's grandson, William, has kept the book up to date and provided a presentation glass piece for each winner to keep. This has always been presented by a member of the Carr family.\n\nThe News of the World have renewed their links this year by sponsoring Tom Lancashire, the European 1500m silver medallist, as Britain seeks its first winner since Kevin McKay in 1994.\n\nThe 18-year-old from Bolton cites Haile Gebrselassie, the Emsley Carr Mile winner in 1999, as his hero. What Lancashire would to give to see his name appear alongside that of the great Ethiopian in the red leather book imbued with so much history.\n\nEmsley Carr high spots\n\n1953\n\nThe first Emsley Carr Mile is won by Gordon Pirie at White City Stadium in 4min 06.8sec.\n\n1956\n\nYorkshire's Derek Ibbotson becomes the first man to break four minutes in the Emsley Carr Mile when he runs 3:59.4 at the White City.\n\n1967\n\nThe American Jim Ryun beats Kenya's Kip Keino in a classic race at the White City and sets a new event record of 3:56.02. The following year Keino beats Ryun to claim Olympic 1500m gold.\n\n1976\n\nSebastian Coe leads for most of the race at Crystal Palace before being swallowed up and finishing eighth in a race won by David Moorcroft in 3:57.06. It is the first occasion Coe breaks four minutes.\n\n1977\n\nCoe makes a late decision to run and beats a classy field in 3:57.67. A legend is born.\n\n2000\n\nThe day after meeting the now Sir Roger Bannister at Iffley Road, an inspired Hicham El Guerrouj runs 3:45.96, the fastest mile ever in Britain."}, {"url": "https://prabook.com/web/duncan.mackay/2398366", "page_content": "Duncan MacKay\n\nassociation football player\n\nJuly 14, 1937 Glasgow, Scotland, United Kingdom\n\nBorn in Glasgow, Mackay turned professional when he joined Celtic from Maryhill Harp aged 17 in 1955. He developed rapidly, making his club debut within two years and earning the first of an eventual 14 caps for the Scottish national side four years later. Celtic manager Jimmy McGrory\"s attempts to rejuvenate his side eventually resulted in MacKay\"s departure from Celtic Park after over 200 first team appearances, the fullback moving to south Glasgow side Third Lanark in November 1964. Thirds were relegated at the end of the 1964-1965 season though, and MacKay was one of several players released. MacKay opted to move to Australia at this juncture, joining Melbourne Croatia of the Victorian State League. He helped the side to the State title in 1968 and several Dockerty Cup triumphs but left when Croatia were suspended following crowd disturbances in 1972. He returned to Scotland and joined junior club Street Anthony\"s as a player-coach for two years before deciding upon a second stint in Australia. After playing for Perth Azzurri between 1974 and 1977 he coached with South Melbourne and Essendon Lions."}, {"url": "https://vwmusicrocks.com/an-interview-with-duncan-mackay-of-fluance-and-formerly-of-10cc-and-cockney-rebel/", "page_content": "All images courtesy of Duncan Mackay/Getty Images\n\n\n\nBy Joe O’Brien\n\njoe@vinylwriter.com\n\nWould you be interested in the story of a childhood violin prodigy turned teacher, who upended his life to move to Brazil after a chance encounter to become the organ player for a storied Jazz musician?\n\nWhat about the story of a young keyboard player, who while grinding it out on the South African club circuit, made a virtuoso-level, now cult-classic / prog rock solo album, which paid off in the most unexpected of ways, leading him to London to explore the musical world with the likes of Gary Moore and Ginger Baker before finding his harmonic balance?\n\nWhat if I was to tell you of a third musician, who over the course of a decade was a member of legendary bands Cockney Rebel and 10cc ? And while a member of those bands, at the same time he remained one of the most in-demand session musicians, participating in recordings by The Alan Parsons Project, Kate Bush, Camel, Budgie , and others. As unbelievable as it is, all three of these musicians are one and the same.\n\nThe man in question? The understated legend Duncan Mackay .\n\nNot only does Mackay’s story incorporate that of the “three musicians,” but he also moved to become an accomplished composer, delving into library music and soundtracking. And after focusing on composing for several years, Mackay decided to harken back to his progressive roots through a liaison with the Japanese label, Belle Antique.\n\nThat particular rabbit hole led Mackay to the most recent and exciting footnote in his celebrated career, Fluance , a band that’s pitched a fresh take on a familiar sound, and one which both challenges and comforts the listener in one fell swoop.\n\nFluance is set to release their second album shortly, but in the meantime, you can get your fix listening to their first release, Lunacy.\n\nOne fine afternoon, from his home studio in South Africa, Mackay took the time to sit down with me via Zoom for an exclusive, career-spanning chat.\n\nJoe:\n\nFrom what I understand you initially studied violin in school. What drew you to focus more on the organ, keyboards, and other key-based instruments?\n\nDuncan:\n\nWell, I was very fortunate that my late father was a fabulous musician. He was a great violinist which is why the violin was the instrument that I went and did my music degree for. When I was at university, it was obligatory that your second instrument was keyboard based. I chose to do church organ as my second instrument. It was absolutely great. That’s where I really honed my bass pedal playing. It was quite good at one time in my life. When I got my degree, I taught music for six months and realized that that was not what I wanted to do in my life. I just started playing around with keyboards, and I managed to get my first Hammond organ.\n\nThe way I was playing at that time was more from the jazz side. Jimmy Smith type Jazz, rather than traditional Jazz. I started getting noticed playing organ in that nontraditional Jazz style. In fact, that’s how I ended up in Brazil at the age of 20. That all started when I met a fabulous guitarist by the name of Rosinha de Valença. She was in town playing with her band, but she also played with Sergio Mendes. She and I got on, and to cut the story short, their keyboard player had other things to do with his life. So, she said, “Would you like to come to Rio de Janeiro and play with the rest of the chaps?” I quickly resigned from my teaching job, and I was on the next plane to Brazil.\n\nJoe:\n\nSpeaking of your experience in Brazil, what effect did playing in the Sergio Mendes Band have on you as a young musician?\n\nDuncan:\n\nI think the experiences, as can happen when you’re younger, are a natural chain of events that come about through a combination of chance and skill. I took it on board, and I got on with it. When I got a little older and was able to look back, I realized that was actually very important. At the time, it was just an adventure. Going to Rio. Holy shit, what a great place. Musically, I really learned rhythms from those guys. They were fantastic with rhythm. Rhythm is so important in music from Brazil.\n\nJoe:\n\nHow did the experience come to an end?\n\nDuncan:\n\nA chain of events led to the end of that experience. I can tell you I was lock-stock-and-barrel when I went over there. I shipped my prized possession, my Hammond organ, over to Rio. Unfortunately, some corruption in customs gave me trouble. Someone decided they liked my Hammond, and they didn’t want to let it out of customs. I said, “Well, send it back.” They said, “No, no, no. You can’t send it back unless you leave with it.” So, wrongly, or rightly, I left with my Hammond, which was my most important possession at that age. I think I was over there for six months. It was a great time in my life.\n\nJoe:\n\nHow did you get into the prog rock scene?\n\nDuncan:\n\nI came back to South Africa by which time I’d become aware of Keith Emerson. I think he was playing with The Nice in those days. What he was doing fit in with everything that I was writing. Keith was a big inspiration for the way I played in my early days. I love what he got up to. He was the first keyboard showman. There were plenty of guitarists chucking their guitars around, standing on monitors, a smashing up Marshall speakers. Normally, the keyboard player was somewhere in the background. Emerson stepped out and said, “I’m not doing that.” I loved him for it, and of course, he was an extraordinary player.\n\nAll images courtesy of Duncan Mackay/Getty Images\n\nJoe:\n\nWhat sort of influence did Keith Emerson have on your playing and musical direction of your first solo album, Chimera?\n\nDuncan:\n\nI have always strived to be original in my career. Of course, you can’t help but be influenced by outside things. Emerson was a big influence, and I enjoyed what he got up to for a lot of reasons. Back then – we’re talking early 70s – there was one great thing about the music world. If your technique, playing, and imagination were bigger than the next guy, you were more likely to get the job. If you were also a good player and you practiced hard, then you could start going towards the virtuosity that Emerson had.\n\nJoe:\n\nThe attributes you mentioned: imagination, technique, and originality, were on full display on Chimera. Tell us about how the album came together.\n\nDuncan:\n\nIt was a massive stepping-stone. At that time, I was playing a multitude of keyboards, which included playing bass pedals with my feet. I was working with a fabulous drummer called Mike Gray. We were playing in a club several nights a week. Then we were offered an album deal. All of that meant that we were packing up all the gear every morning, at the club, and putting it in my van. Then we would drive into the recording studio, unload it, and record all day. Afterward, we would pack it up and put it back in the van. Then drive back to the club, set up all the gear, and play all night. Recording-wise, that was almost live. The whole album, the basic tracks anyway, were done in three days. That is unheard of nowadays. There were a couple of overdubs over a couple of days. We went in to sing a bit and do a few other things as well. But that was pretty much it. I look back at it now and wonder how the bloody hell that happened. [Laughs]. At the time, my knowledge of what was meant to happen in the studio was zero. It wasn’t extraordinary, it was simply what we did. The whole process was part of what made the Chimera album special. Recording those songs all day and playing them every night.\n\nJoe:\n\nWhat part, if any, did Chimera have on enabling you to garner the amount of work you would come into shortly following its release?\n\nDuncan:\n\nSo, the club where we played was called The Branch Office. It instantly became a hub for other musicians. It was the only club around that didn’t have a dance floor. People just came and sat and listened. When all the other musicians playing in other clubs finished playing at midnight, they would come over. It always turned into a jam session. It was very good times. One of the chaps who was visiting at the time was Peter Knight Jr. He was the head of Phonogram International. I felt I was coming to the end of the club thing. We hit the highs there. My plan was always to return to England. A couple of weeks later, I got a call from Peter, and said, “Ginger Baker and Adrian Gurvitz are starting a new band. They’ve heard Chimera. I’ve told them how you play. Would you like to join?” I was a fan of Cream, and Ginger Baker was a hero of mine. Ginger was right up there, blimey. I got the call on a Saturday morning, and that same night I got on a plane to England. I showed up there and I started with Ginger Baker and Adrian Gurvitz. I believe the group was to be called The Baker-Gurvitz Army. Unfortunately, it didn’t work out. I’ve met a lot of people in the music business. All types and levels of importance. Ginger Baker is right up there with one of the most unpleasant people I’ve ever met. [Laughs].\n\nJoe:\n\nAt that point, you stayed in England to look for a gig that was a better fit, right? What led you to join Cockney Rebel?\n\nDuncan:\n\nI went to Peter Knight Jr., with who I’d become friends, and was now back in London. I went to him, and I said, “Look, I appreciate everything, but I can’t do this.” It was a difficult decision, but Peter was very helpful. I looked around and ended up meeting two great chaps. Jon Hiseman, from Colosseum , and Gary Moore, the guitarist. They were starting a band called Colosseum II. After I met them, I started rehearsing with them. It was fantastic. Nice people. Unbelievable players. But they were broke and didn’t have any record company support. I was broke too, like most musicians, and needed a paying gig. Suddenly, the Cockney Rebel gig was offered to me. Initially, I auditioned with Steve Harley, and I didn’t get the gig. Then, for some reason, I got called back for a second audition. By this time Jim Cregan was the guitarist in the band, and Jim said to Harley, “You got to get this guy,” and I joined Cockney Rebel.\n\nJoe:\n\nCockney Rebel had some decent success and exposure in the U.K., including a number one hit. Why do you feel the band wasn’t able to duplicate that same feat in The States?\n\nDuncan:\n\nI don’t know. We did a tour of the states, which I enjoyed immensely. During the tour, we were supported by The Kinks. It all seemed to go down well. I wish I had a more definitive answer. Back then the business side of music wasn’t at the forefront of my mind. I was playing music with a bunch of great guys and having fun. The politics and that side of music hadn’t gotten their hooks into me yet. I look back on those times, by the way, Joe, with happiness. The business side of music isn’t always something to be proud of. I understand it’s got to be there, but it’s got very little to do with actual music.\n\nAt that time, at least, the record companies were more apt to recognize a band for what it was and where it can progress to. It was not uncommon for a band to sign a three or four-album deal. The idea was the power of the record company would help the artist financially to make those three or four albums. Help them grow. That doesn’t happen anymore.\n\nHowever, going back to your question, I don’t think Steve [Harley] helped himself with his attitude. He was very arrogant and abrasive, which he got away with in the U.K. In hindsight, I think that had something to do with it. When he decided that he didn’t need Cockney Rebel anymore, which was an enormous mistake, I stayed on as his right-hand man. He [Steve Harley] never did crack America, as you know.\n\nImage credit: Dick Barnatt/Redferns\n\nJoe:\n\nIt seemed like Cockney Rebel was getting stronger with each album. Can you provide any insight into the sequence of events that led to the eventual disbanding?\n\nDuncan:\n\nWhen we made that first album with “Make Me Smile (Come Up and See Me),” there was no doubt that Jim Cregan and I were very much part of the writing team. It became very apparent that Steve wasn’t at all prepared to acknowledge that in terms of songwriting credits. Any future would have just been, “Here’s some money come and play,” or “Can I use your knowledge and expertise to make my next song?” We all got a bit fed up with it. Jim left first and went off to join Rod Stewart.\n\nJoe:\n\nThat’s kind of similar to what happened with the first iteration of the band.\n\nDuncan:\n\nThat’s right. Steve Harley has done it all his life. The proof of what we’re talking about is in the result. Since the Cockney Rebel that I was in, since we all stopped working together, there hasn’t been a hit. It’s really silly. I’d personally rather have 50% of something than 100% of nothing.\n\nJoe:\n\nA handful of years ago you took part in a Cockney Rebel anniversary tour with most of the classic lineup intact. What was the impetus for that tour?\n\nDuncan:\n\nWell, that was Steve’s [Harley] idea. I have been in some contact with Jim [Cregan] and Stuart Elliot, the original drummer, over the years. Stuart and I are good friends. When we talked about putting together a reunion to celebrate The Best Years of Our Lives, I thought, “That will be great fun to relive the camaraderie that we had in those beginning years.” The band was all good mates. It was fabulous. So, I agreed to do it. I went back over to the U.K. for the tour. I enjoyed working with Jim, Stuart, and Steve’s bass player at the time was a guy called Marty Prior. He toured with us and is also the bass player in Fluance. I ended up meeting all the other people from Fluance through Marty.\n\nJoe:\n\nWhat was the experience like of working with that group of guys again after all those years?\n\nDuncan:\n\nIt was terrific to play those old songs, but the tour ended up being all about Steve. Steve was still the prima donna that he always was, but now to an even greater extent. That’s me being very polite. Despite all that, we had a great time. We did 23 dates, or something like that, and played to 3000 people a night. It was fabulous and very humbling to see people of our age coming to revisit their youth. It was amazing to see how important Rebel and those songs had been in their lives. I’ve got goosebumps just thinking about it. I enjoyed that part of it a lot.\n\nJoe:\n\nYour second solo album, Score had some notable differences from Chimera. The psychedelic nature and frenetic pace of Chimera were replaced with jazzier sounds and a more melodic tempo. How did working with Steve Harley, and John Wetton’s production inform your approach?\n\nDuncan:\n\nI think you hit the nail on the head with everything you said. I was now living in the U.K. and had different influences. And that’s the way the record went. EMI was a big company and there were elements added to try to make it more accessible than Chimera. But there never has been a set plan going into an album. It’s gonna go the way it goes naturally as I start writing. I mean, there’s a fake plan, of course. [Laughs]. That’s the lovely thing about going into the studio, you can go in the morning thinking, “I know what I’m doing,” and then you start fiddling around with this sound and that sound. You don’t go in a completely different direction, but certainly with a different flavor. I love that, especially when mistakes in the studio stay on the record. Sometimes those mistakes are bloody brilliant. I find getting it clinically correct, which an awful lot of music is today, somehow sucks the soul out of it.\n\nJoe:\n\nOne of the most exciting opportunities you had was working with The Alan Parsons Project on three of their albums towards the beginning of their career. You first met Alan as a producer for Cockyney Rebel, right? What was that experience like and what did you take away from it?\n\nDuncan:\n\nThat’s correct. So, there was Alan and Andrew Powell, who was Alan Parsons’s orchestrator. He was a great classical orchestrator. I first met them while recording with Rebel. I got on really well with Alan Parsons. I learned so much from that man through his approach in the studio. He invited me and Stuart Elliott, the drummer from Cockney Rebel, as well as Ian Bairnson and David Paton from Pilot to record on several projects. The four of us became the nucleus for an awful lot of other people’s records. If the four of us had been in a band together, it would have worked because we played well together. It wasn’t the same as getting your average four-session guys to come and play drums, bass, guitar, and keyboards. Events unfolded and we just ended up doing the Parsons album. Then Andrew Powell got the job producing the first Kate Bush album and the same four chaps got pulled in to do that album. We became a team. When we weren’t working with either rebel or pilot, and we had time down, then people would normally knock on the door. They would say, “Can you guys come be the band for our album?” It was all great fun, especially the Parsons Project. It [The Alan Parsons Project] was always innovative and adventurous.\n\nAll images courtesy of Duncan Mackay/Getty Images\n\nJoe:\n\nYou started to mention Kate Bush. What was it like to work with her at the beginning of her career?\n\nDuncan:\n\nKate was fantastic and delightful. She was unbelievably humble and sweet. She was extremely talented. I loved her songs, writing, and piano playing. She played a great piano. When we went to record Kate’s first album, we all turned up, the four of us [Duncan Mackay, Stuart Elliott, Ian Bairnson, and David Paton]. We hadn’t seen each other for a little while and we had gotten there early. So, we were chatting and catching up. That’s when a funny little incident happened that describes Kate to a tee. This young lady comes into where we are sitting and says, “Would anybody like a cup of tea?” We all said, “Yes, thank you very much. That’d be lovely.” Off she went to get us our tea, and then Andrew Powell turned up. He was a bit late. When he came in, what we thought was the tea girl was beside him. He said, “Have you met Kate yet?” [Laughs]. Then we got to work.\n\nJoe:\n\nBy Kate’s third album, Never For Ever, the studio nucleus surrounding the first two albums was mostly not involved. However, you stayed on to work with her on the album for a few tracks. What led to the change in personnel?\n\nDuncan:\n\nI may be wrong, but I think Stuart Elliott was also there. There were other people around that I didn’t know so well. But Joe, that wasn’t such a big deal, I thought “Okay, there are other people around and that was fine.” Around that time, she started to play live, and different people were part of her live outfit. It made sense to include those people in the studio. It was just a chain of events.\n\nJoe:\n\nDavid Gilmore had a role as an executive producer on Kate Bush’s first album, The Kick Inside. Did you ever work with him in any capacity in the studio during the album?\n\nDuncan:\n\nNot so much, Joe. As far as I remember, heads would pop in, and people would talk, etc., but I don’t remember specifically dealing with him. I know the story about how Kate got the EMI deal in the first place, which was through him. He’d heard her somewhere and knew she was one to watch. And boy, was he right. But his involvement in the album, if my memory serves me right, wasn’t enormous. Maybe behind the scenes, it was enormous.\n\nJoe:\n\nAnother band that, like Cockney Rebel, was going through a transitionary period when you joined was 10cc. How did it compare to when you joined Cockney Rebel?\n\nDuncan:\n\nI’ve been very fortunate in both bands I’ve been a member of. Fortunate because the chaps in the band we’re good guys, which is unbelievably vital to any band. It is certainly vital to any band I want to be with. When I was with Rebel, we worked very hard, and we played hard. It was a very good time to be in the game. I had much the same experience with 10cc. 10cc had a different approach in that it was run like the military without the strict bit and certainly not the haircuts. [Laughs]. When we said 9 am in the studio to record, that meant 9 am. Musically, it was fantastic because everybody was always experimenting with different approaches and styles. The live shows were always fantastic with that band, and we were renowned for always having a very good sound. That’s because of the time, the effort, and the thought that went into getting that level of sound. Our sound engineer, who mixed the live sound, was treated almost like a member of the band. That’s how important he was to us. It all just worked well. Great players, great music. I was so fortunate that both bands I joined, Cockney Rebel and 10cc, had hits that went to number one with “Come Up and See Me,” and “Dreadlock Holiday.”\n\nJoe:\n\nWas there anything in particular that pulled 10cc towards the ska and reggae sounds that were incorporated on both “Dreadlock Holiday” and other songs on Bloody Tourists?\n\nDuncan:\n\nThe reason that I enjoyed 10cc from day one was the way the music would evolve and transpire. We never sat down and said, “Hey, let’s do a reggae song, or let’s specifically take the direction we did end up taking on ‘Dreadlock Holiday.’” As far as I remember, it was just, we’re going to do a song, and this is how it’s progressing. It wasn’t a whole preconceived idea. I don’t think Eric [Stewart] and Graham [Gouldman] expected it to ever become the monster hit it turned into. I think the enormous success of that track took us all by surprise, at least a little bit.\n\nAll images courtesy of Duncan Mackay/Getty Images\n\nJoe:\n\nLet’s backtrack for a minute and discuss how you ended up becoming a member of 10cc in the first place.\n\nDuncan:\n\nIt was New Year’s Eve, and a mate of mine was throwing a party. This mate was a rather famous photographer. He used to throw a party every year to thank all the models, agencies, and other people he worked with. He asked, “Do you want to put together a little scratch band and come play the New Year party?” I went, “Yeah, why not?” I remember lugging my Hammond up the stairs and helping set everything up. We started playing and one of the chaps who turned up was Rick Fenn, the guitarist from 10cc. We had a spare amp and Rick plugged in and jammed with us. We had great fun and eventually said our goodbyes. Later on, the next week, he phoned up and said, “Do you want to come meet the band? I’m in 10cc. We’re looking for a keyboard player.” I hit it off with the guys in the band. They had just started recording the Bloody Tourist album. I was able to slot in rather nicely, right at the beginning of that album. That’s how that happened. It was a shame it didn’t carry on longer.\n\nJoe:\n\nWhat were the circumstances that led to you parting ways with 10cc sometime after Look Here?\n\nDuncan:\n\nWe were in the middle of a world tour. We had just come back from America, and we had Christmas off. We had two weeks and then we were on our way to Australia and Japan. In that interim Eric [Stewart] had a terrible car crash on black ice. The car crash turned into a disaster for the band as Eric was injured quite badly. Some decisions were made by management that were silly. Then we did the Look Here? album, which was a very different experience from making Bloody Tourists. Things seemed to diminish from there to a point where I had to make the hard decision to move on.\n\nJoe:\n\nI wanted to touch on Budgie. I’d say that Budgie was very different from many other artists you had worked with to that point. While Budgie had begun to experiment with various sounds, Deliver Us From Evil was certainly a divergence for the band. Where was the band both creatively and musically at the time, and what were the circumstances that led to you being involved in the album?\n\nDuncan:\n\nI don’t know definitively, but I’m pretty sure they’d heard some of my other work. Based on what they heard, they thought that I could help in with the direction they were looking to go in. My knowledge of them as a band, before I turned up in the studio, was limited. I knew of them, but I hadn’t heard lots of their music. I had no idea what I was turning up for. In many ways, that aspect was no different from many of the other experiences I have had. People wanted me to play with them because of my style, which was a lot different than many of my contemporaries. Whatever I brought to the party, it was what they were looking for.\n\nJoe:\n\nWere you given full creative control over the keyboard parts, or were you considered more of a hired gun?\n\nDuncan:\n\nI have never been the hired gun, ever. It’s not me being arrogant but simply the way my career has gone. People would ask me to play on an album because they liked how I played. I can only say this in hindsight but there really were no expectations. I was booked to do an album in this residential studio with Budgie. I turned up and it was great. I got to meet some nice guys and play some music. That’s kind of how I went into it.\n\nJoe:\n\nGiven this was Budgie’s first album to significantly feature the keyboards, what were the expectations set forth going into the studio?\n\nDuncan:\n\nYou should also understand that there are things I turned down. I remember one band, who I won’t mention, had their management phone me up. They said, “We’re looking for someone who plays piano like Jerry Lee Lewis.” I said, “Well, don’t speak to me because I don’t play anything like that. It’s not how I play. So, thank you, but no thank you.” I play how I play, and it seems to have worked rather well.\n\nJoe:\n\nIn the 70s through the early 80s, you were on a torrid recording pace. How did you find the time to record your solo music while also being a member of Cockney Rebel, as well as 10cc, and work as a session musician?\n\nDuncan:\n\nIt was my extreme, complete, and dedicated focus on playing and making music. I loved every second of it. None of it seemed like work. It was all, “Yeah, brilliant. Fancy that. Let’s have a go.” The timing of it all played into it as well. It was a different era in rock ‘n’ roll, progressive music, or whatever you want to call it. It was more adventurous, and people were taking a lot more risks than they do now. That all benefited me as a musician. I’m delighted that I was able to work so extensively during that era and for it to have brought forth so many highlights from my career. It was an era where the music business seemed to be run more by music than business. I’m sure that may not fully be an accurate statement, but those are my feelings regarding the music business. I’m not moaning. It’s changed. The world changed. Life changed. It is what it is.\n\nJoe:\n\nIt’s certainly important to touch on Visa. I see it as a nod to much of your later work in library music and soundtracks. You mentioned that much of your music tends to develop organically in the studio, however, what inspired you to take the direction you developed on Visa?\n\nDuncan:\n\nI know what I said earlier about how I record but, Visa was the exception. I’ve always been a tunesmith. Tunes have always just come to me. I love a good tune and that is probably based on my classical training. Mozart and Beethoven wrote great tunes and that’s why we still know them hundreds of years later. In the Chimera days and subsequent albums, virtuosity was part of the writing thing there. When I did Visa, I thought, “Let’s explore this being a tunesmith idea, but keep some technique and a put bit of flash in it.” Plus, I had just recently acquired some sequencers and other new equipment. It was an experiment and probably a bit more contrived than some of my other works. It was a different direction for sure. I had built my first ever studio and that was my first attempt at recording there. That was the path that Visa went down. It was an experiment, and it was exciting.\n\nAll images courtesy of Duncan Mackay/Getty Images\n\nJoe:\n\nWith Greg McEwan Kocovaos, you recorded The First Time. The two of you were seamlessly able to blend new wave/art rock sounds with more modern electronic and world music flavors. I was able to listen to the album on SoundCloud, but not much else is out there about the album.\n\nDuncan:\n\nTo tell you the truth, I had no idea it was available anywhere. [Laughs]. It was a great plan, but it didn’t work out. If you want to work with me, committing to something is a prerequisite lesson. If I’m going to put all my energy into something, I expect it from the other people I’m working with as well. In my book, it’s not too much to expect. It’s a prerequisite for making good music and getting it somewhere. It didn’t work out and it was a shame. The way it was going, it became obvious to me towards the end of making the album that it wasn’t going to work out. So, I made the album and moved on. This has happened to me a few times. I’ve gone down a path with someone who has said all the right words at the beginning about commitment and didn’t follow through.\n\nYou know, people say musicians just go on stage and they work for two hours a day, “Lucky them.” All the good musicians do much more. They just live it. You need to say, “Look, I have no idea if this is gonna be successful. I have no idea if it’s gonna make a dollar or a million dollars. But I’m going into it with 100%.” Otherwise, why bother? That’s been my attitude to this game all my life. That happened with Greg, and it unfortunately also happened with the Bletchley Park Project. The projects that didn’t work out always cause me to look back on my time with both Rebel and 10 CC with gratitude. Gratitude because all the people in those bands were so like-minded about what we were up to, and generally good chaps. That is vital for me. I can’t work with someone who I haven’t got any respect. I don’t care how talented they are. Is the plan to be heart-and-soul 100%? Then off we go. That’s the truth. Thank you for even knowing about it.\n\nJoe:\n\nYou mentioned the Bletchley Park Project. I wanted to discuss both that album and Kintsugi. What made you return to your 70s prog rock-styled musical approach, and how did you end up on the Japanese label, Belle Antique?\n\nDuncan:\n\nHow that came about was out of the blue. I got a request from a Japanese prog magazine to do an interview. My interview was featured in this magazine, and soon after I got a call from Belle Antique Records. They said, “Would you be interested in doing a prog album.” I’ve done a lot of commercial things, as we’ve talked about, but there is nothing like being inventive. Progressive music allows you to do that. “Progressive” means you experiment, and you go into places you wouldn’t otherwise. So, I told them I would be glad to work on something with them. At the time, I already working on something with a drummer and that evolved into the Bletchley Park Project album.\n\nJoe:\n\nI know you also write and record library music. For those ignorant of the process, what is your approach to writing library music?\n\nDuncan:\n\nWell, library music started for me back in when I was still in the U.K. I became friends with people at KPM records, which was an affiliate of EMI. I started doing library music for them and it worked well for me, because, as I said, I’m a bit of a tunesmith. With library music, they give you a kind of theme. They say, “This is going to be about industry,” so you know it’s gonna have to be powerful. Or they say, “This is going to be pastoral,” so you think countryside and your tunes to go off in different directions from there. Once you have enough tunes, you end up with a library album that is suitable for your theme. I found that I was alright at that, and they liked what I was doing.\n\nJoe:\n\nHow did you get into soundtracking documentaries and TV shows? How is the approach taken for a soundtrack different?\n\nDuncan:\n\nConsequently, from the success with library music, came the commissions for film. The difference with writing for films and the like is that instead of an overall theme, you’ve got a rough cut of the visuals or a storyboard. It enables you to fine-tune your work. The music is there to enhance the story not to take over. A perfect example is Jaws. Without the Jaws music, it’s just somebody going for a swim on a beach. Pretty boring [imitates person snoring]. Because you hear that music [starts humming Jaws theme] you anticipate something exciting and awful is gonna happen. It’s fabulous when music can do that. That’s how I see music, whether it’s rock ‘n’ roll or music for films. Is it making you feel something? What’s it meant to do? If you can achieve a little bit of that you’re winning.\n\nAll images courtesy of Duncan Mackay/Getty Images\n\nJoe:\n\nTell me a little about your studio.\n\nDuncan:\n\nThe studio has grown in importance for me as my life has changed from touring and all that to what I do now. My wife and I designed and built the studio in our house. I spent a lot of time in the studio, It’s heaven.\n\nJoe:\n\nDo you only record your work, or others as well? If you do record others, are you involved as a producer, engineer, etc.?\n\nDuncan:\n\nI made a point to get into recording others in the studio because the opportunity is there. In this era, everybody I meet is a record producer or an engineer. I feel like it used to be quite an exclusive club, and I respect that. So, in 1,000 years I wouldn’t say I’m an engineer or a producer if I’m being truthful. Yes, I am both, but that’s not where I hang my hat. However, over the years, I’ve learned some things. I’m pretty good at pressing the buttons, I suppose. The whole point since I had my first eight-track studio ‘til now, is that it enables me to create the music that’s in my head or somebody else’s head. It’s a tool to create, hopefully, what everybody wants to hear. That’s how I see my studio.\n\nJoe:\n\nAll of that aside, Duncan, what have you been up to in the past couple of years considering the current state of the world? Is Fluance a major point of focus?\n\nDuncan:\n\nYes. I’ve been concentrating a lot on Fluance, which is the band that did Lunacy. When we brought out the Lunacy album, we dealt with Belle Antique because I’ve got a deal with them. And they liked what I did in Japan. So, we were already getting ready for me to travel from Cape Town and Marty [Prior], the bass player, to travel from Spain to rehearse. Then hopefully go out and promote the album. Then, of course, the pandemic hits. So that all went out the window. It is a difficult time for everybody in any profession in the world, especially musicians. COVID and Brexit have completely screwed how musicians make money. It put a stop to things, with Fluance, for some time. There was nowhere to play because it was all closed down. The timing of the first album from Fluance was unfortunate. I said to the chaps, “All we can do in this time is use the time to create the best album we possibly can.” So, we’re getting to the end of completing the recording of it. That’s kind of what I’ve been doing in these strange times.\n\nJoe:\n\nSounds like you have been keeping yourself busy working on this new Fluance album. What can you tell us about it?\n\nDuncan:\n\nIt is 90% recorded. We have just in recent months found a new permanent guitarist. A guy called Mauritz Lotz. He lives in Johannesburg. It’s funny, I’ve been living in Cape Town for a long time now and I just discovered him. He is fitting in with the band rather well. He is in the process of putting some guitar on the tracks that we’ve done. Then we sit down and decide where we go from there.\n\nJoe:\n\nAny other projects coming out in the future we should be aware of?\n\nDuncan:\n\nI’m in the process of writing music for a movie that is coming out. It’s from a South African film director and producer. He’s planning to start shooting later this year. It has a wondrous title, Drunks Have Whiter Teeth. I’ve been writing music for that when I’m not working with Fluance.\n\n– Joe O’Brien (@ JoeOB1005 ) is the Senior Columnist for www.vwmusicrocks.com and may be reached at joe@vinylwriter.com"}, {"url": "https://bcsportshall.com/honoured_member/duncan-mickey-mackay/", "page_content": "Mickey Mackay came to BC in 1913 to play hockey with the Grand Forks club. Nicknamed “The Wee Scot”, Mackay was best known for his breakaway speed and puck handling. He was elected to the International Hockey hall of Fame in 1952 and the Hockey Hall of Fame in 1958.\n\nMackay turned professional with the Vancouver Millionaires in the 1914-15 season, and in his rookie year led the Pacific Coast Hockey Association in scoring. He played a major part in taking the Vancouver Millionaires to Vancouver’s first and last Stanley Cup win in 1915.\n\nMackay played center with the Vancouver team until 1926, winning the top scoring title three times. During his career, he led the Pacific Coast / Western Hockey Association in individual career points (290) on 198 goals and 92 assists.\n\nIn 1926, he played two seasons for the NHL’s Chicago Blackhawks, and at age 31, led the team in scoring during the 1927-28 season.\n\nMackay started with Pittsburgh in 1928-29, but joined the Boston Bruins halfway through the season and helped them to a record-breaking year with 38 wins, one tie and only five losses, ending with a Stanley Cup victory. After the start of the 1929-30 season, he retired from play but stayed on with Boston as the Bruins’ team business manager."}, {"url": "https://www.thecelticwiki.com/players/all-time-a-to-z-of-celtic-players/m/mackay-duncan/", "page_content": "Personal\n\nFullname: Duncan MacKay\n\naka: Dunky MacKay\n\nBorn: 14 July 1937\n\nDied: 23 December 2019\n\nBirthplace: Springburn\n\nSigned: 11 April 1955\n\nLeft: 6 November 1964 (Third Lanark)\n\nPosition: Right-back\n\nDebut: Clyde 1-4 Celtic, League Cup, 9 Aug 1958\n\nInternationals: Scotland\n\nInternational Caps: 14\n\nInternational Goals: 0\n\nBiog\n\nThe classy Duncan MacKay signed for Celtic from Maryhill Harp in April 1955.\n\nOn his signing, he was proclaimed as the find of the season, and for the next season was “the best defensive prospect in the country“.\n\nThe stylish right-back made his debut in a 4-1 League Cup win at Clyde in August 1958 and would spend the next six years as one of the top performers in disappointing & underachieving Celtic sides.\n\nDuncan MacKay had fantastic pace and stamina and he was a wonderful attacking full-back who was one of the first players in that position to use the over-lap as a regular feature of his game.\n\nWith fine control and a pin-point accurate pass, Duncan MacKay would always attempt to play the ball out of defence rather than just rely on the long clearance up the park. He was not overly physical in his defending either, preferring to win the ball through quick thinking and anticipation rather than just brute strength. So in some ways he was ahead of his time.\n\nThis refined approach to the game made him a popular player among the Celtic support and the Scotland selectors who capped him 14 times.\n\nHe became the captain in 1961, and then led the first team to the Scottish Cup matches v Dunfermline (the final & replay), but in both unfortunately Celtic once again came up short and lost. The side were perennially underachieving despite the wealth of talent on hand.\n\nWith Celtic so poor, he actually decided openly to request a move to England, but there was surprisingly little interest (Celtic’s poor state a likely major cause of the lack of interest). You have to take in the poor team management at the time at Celtic, lack of morale in the squad and the constant board meddling. It wasn’t an uncommon position. Jimmy Johnstone, Billy McNeill and Lennox were all also on the verge of leaving or giving up before Jock Stein’s arrival at Celtic.\n\nDuncan McKay lost the captaincy to Billy McNeill in 1963, and his place in the first team later in the year. His last game was a single appearance in the 1964/65 season with a 4-2 defeat to Hearts.\n\nHe was not a heavy goalscorer, but curiously once he scored his first the others soon enough followed. He took a long time to score his first for Celtic, a penalty in a 7-0 victory over St Mirren in November 1962. However, over April & May 1963, he scored five goals (all penalties), including a double over Raith Rovers in a Scottish Cup semi-final. His last goal (also a penalty) was in October 1963 as Celtic defeated Aberdeen 3-0.\n\nIt was a great injustice to Duncan McKay’s wonderful ability that he never won any major trophies as a Celt. This popular player eventually left Parkhead in 1964 for Third Lanark after 236 appearances and 7 goals.\n\nThe saddest aspect is that he was a great player in one of the poorer eras for Celtic. After the League Cup win in 1957, Celtic did not win another major trophy again until 1965. His first team career sadly spanned practically the whole of this period. Jock Stein became the club manager only a few months after Duncan Mackay’s departure. If Jock Stein had arrived sooner then possibly Duncan Mackay could have won a medal worthy of his talents.\n\nHe is one of the finest regular long-term first team Celtic players to leave Celtic without a medal for a major trophy (Willie Miller is another in this group). He deserved better, and it is an indictment of the club at the time for just how poor the First Team were.\n\nHowever, the Celtic support more then recognised his talent. In 1967, following the triumph in Lisbon in the European Cup, a poll by the Evening Times amongst its readers surveyed for the best Celtic team in living memory. To his credit, Duncan MacKay walked in at right-back. A great accolade and a mark of the respect the support had for him.\n\nAfter Third Lanark, he moved to Australia to play for various sides and then later to coach clubs there also, with a brief period back home in Scotland between 1972-74 when he was player-coach with Juniors St Anthony’s.\n\nHe passed away in December 2018, coincidentally just a few weeks after the passing of Ian Young who had succeeded him as the right-back at Celtic.\n\nPlaying Career\n\nAPPEARANCES LEAGUE SCOTTISH CUP LEAGUE CUP EUROPE TOTAL 1955-64 162 33 37 – 236 Goals 5 2 0 – 7\n\nHonours with Celtic\n\nnone\n\nPictures\n\nForums\n\nArticles\n\nDuncan MacKay Source: http://sesasport.com/?p=760 Duncan MacKay had a relatively short but stellar career with Celtic, racking up 236 games for the club from 1958 to 1964 and 14 Scottish caps in the late 1950s and early 1960s. He moved to Third Lanark in 1964 when Bill Hiddleston was engaged in the destruction of that club and in 1965 Frank Burin from the Croatia club in Melbourne persuaded him to try his luck in Australia. Mackay had an immediate impact on the club which had just been promoted to the Victorian State League, the top division. Croatia had been up and down between the State League and lower divisions over previous seasons but this time president Enver Begovic organised an open cheque-book approach that resulted in the expenditure of £5000 in two months. Hammy McMeechan from Slavia was signed for a Victorian record fee of £1200. Other newcomers were Joe Keenan, Ian Currie, Bobby McLachlan, Bill McIntyre and Brian Adlam. Croatia finished sixth in 1965. It was the ‘Glamour Team’ of the season, according to the Victorian Soccer Federation Yearbook. The early season form had been poor, six of the first seven games were lost, and it looked as if Croatia would go back down again, but the attraction of Duncan MacKay and the other players resulted in a transformation in the second half of the season when it finished with eleven wins. Croatia was also runner-up in the Dockerty Cup in 1965. The team which was to take Croatia to the top in Victoria and Australia was now in place. Croatia finished 6th in 1966, 3rd in 1967 under Jimmy Adam, and won the State League for the first time in 1968 under coach Mijo Kiss, finishing seven points clear of Polonia. Only four league games were lost all season. In addition, Croatia won the Ampol Cup and the Dockerty Cup, to complete an extraordinary triumph. In 1972 after an incident involving crowd trouble in a match against Hakoah, Croatia was suspended from the Victorian Soccer Federation and eventually refused permission to regain its position in the State League. It was not till 1974 that the Croatians took over Essendon Lions and resumed participation at a lower level. Duncan MacKay returned to Scotland in March 1972 and was player-coach at St Anthony’s, but he came back to Australia to the Azzurri club in Western Australia in 1974 and in 1977 he returned to Melbourne with Essendon Lions as player-coach.\n\nDeath of Celtic great Duncan MacKay\n\nBy: Newsroom Staff on 26 Dec, 2019 11:31\n\nhttp://www.celticfc.net/news/17326\n\nEVERYONE at Celtic Football Club is saddened to hear of the death of former player, Duncan MacKay, who has passed away at the age of 82.\n\nDunky, who played for the Hoops between 1955-64, making 236 appearances and scoring seven goals, is rightly considered a Celtic great. His first-team debut came in August 1958, in a League Cup tie against Clyde at Shawfield, which Celtic won 4-1, and he soon established himself as first-choice right-back in the team.\n\nA highly-rated defender who was an early exponent of the attacking full-back role later honed by the likes of Tommy Gemmell and Jim Craig, Dunky MacKay was a firm fans’ favourite and his leadership qualities were identified by Jimmy McGrory, who made him captain in 1961, succeeding Bertie Peacock as skipper.\n\nHe would later pass on the captain’s armband to Billy McNeill for the start of the 1963/64 season.\n\nIn November 1984, he moved to Third Lanark, before heading out to Australia where he would eventually settle after a brief return to Scotland. He also gained 14 caps for Scotland during his playing career.\n\nThe thoughts and prayers of everyone at Celtic are with Duncan’s family and friends at this very sad time.\n\nThe Celtic players will wear black armbands at today’s game against St Mirren as a mark of respect.\n\nObituary: Duncan Mackay, highly esteemed Celtic full-back who won honours in Australia\n\nBy Matt Vallance\n\n(2)\n\nSource: https://www.heraldscotland.com/opinion/18141730.obituary-duncan-mackay-highly-esteemed-celtic-full-back-won-honours-australia/Former Celtic captain and Scotland full-back\n\nBorn:July 14, 1937;\n\nDied: December 23, 2019.\n\nIT IS a long way from Maryhill to Melbourne, but in his 82 years that was the journey made by the esteemed former Celtic and Scotland full-back Dunky Mackay.\n\nLike many before him, Duncan’s father, also Duncan, had left the West Highlands for the city, where he worked at several jobs to keep a roof over his family’s head. He insisted the young Duncan wore his Mackay tartan kilt every day. But getting into schoolyard scrapes when responding to taunts of “Kiltie, kiltie cauld-bum” began to wear thin with the youngster, and he persuaded his parents to get him into long trousers.\n\nAt St Columba’s High his exceptional skill with a football got him noticed. He moved to St Mary’s Boys’ Guild, where Celtic signed him on a provisional form, farming him out to juniors, Maryhill Harp. By now the teenaged Mackay had seen the great Hungarian side of Ferenc Puskas and the sort of attacking football he wanted to play. He had left school and started an apprenticeship as a marine engineer.\n\nHe turned full-time at Celtic after completing his apprenticeship. During the 1958-59 campaign he made the first of his 236 first-team appearances in a League Cup tie against Clyde. By season’s end he was first choice, and an Under-23 cap. On April 11, 1959, aged 21, he made the first of an eventual 14 appearances for Scotland, against England at Wembley.\n\nHis full-back partner that day was Rangers’ Eric Caldow and the pair hit it off immediately. Indeed, they played together 12 times for Scotland, making Mackay Caldow’s most frequent international partner. Caldow would relate how, as Scotland captain, he once distributed ‘fan mail’ when the national squad was training at Largs; finding one addressed to “Donkey Mackay’ he quipped, “This lassie must have seen you playing, Dunky”. In reality, Caldow, rated his Celtic friend very highly as a player.\n\nBut, if things were going well with Scotland, all was not well at Celtic Park, where, following the 1957 League Cup win, the side struggled to compete with Rangers, Kilmarnock and Hearts, then the top teams. Bertie Peacock left the club and Mackay was appointed team captain in 1960, leading them to the Scottish Cup final of 1961, where they lost to Dunfermline after a replay. Indeed, along with 1940s goalkeeper Willie Miller, Mackay shares the “distinction” of having won more Scotland caps than medals as a Celtic player.\n\nIn 1963 he lost the captaincy to Billy McNeill, then, after injury he lost his first-team place, partly because, it is rumoured, manager Jimmy McGrory and chairman Bob Kelly, who picked the side, did not like Mackay’s attacking sorties up the wing.\n\nIn November, 1964, he left Celtic for Third Lanark. This is one of Scottish football’s great “what-ifs”; maybe, had he hung on until Jock Stein returned in February, 1965, he would have regained his place. Stein certainly preferred attacking full-backs. But Thirds were starting to implode and at the end of that season, Mackay joined Melbourne Croatia, who were spending big in a bid to become the top side in the Victoria League.\n\nHe was an instant success, being appointed captain and winning the Player of the Year title in his first season. He led Croatia to several trophies, including a league-and-two-cups treble in 1972, but the club fell foul of Australian Soccer financial rules and collapsed. Mackay returned to Scotland for two seasons, working as a bookbinder and coaching junior outfit St Anthony’s.\n\nHis first marriage, when a young man, had failed. But while, back home, he married his second wife, Marilyn, before, in 1974, Perth Azzurri, in Western Australia, offered him a player-coach role.\n\nHe led the Azzurri to back-to-back league titles, then returned to Melbourne, to Essendon Lions, as Croatia had now become. Here he found success as a league-winning coach, before winding down his active involvement in football with South Melbourne Hellas.\n\nMelbourne clearly suited Mackay. In his first spell with Croatia, he turned down the chance to join Pele at New York Cosmos. His non-football working life turned full circle when he joined Transfeld Ship Builders as a Senior Procurement Buyer – the post he filled until his retirement.\n\nHe and Marilyn, who survives him, had two daughters, Shone and Elissa. He is also survived by son Duncan Junior, from his first marriage, who also lives in Australia. Paul, another son from that first marriage predeceased his father. In retirement, Mackay enjoyed listening to the Beatles, Barbra Streisand and Tony Bennett.\n\nDunky Mackay was a very good full-back. He was Celtic’s Player of the Year in 1963, and Man of the Match when they played Real Madrid at Parkhead in a friendly. Sadly, he never had the medals to show for playing at a low point in the club’s history, but on the other side of the world he finally won a few medals, forged a good reputation as a coach, and perhaps showed Scottish football what it lost when it allowed him to leave.\n\nMATT VALLANCE"}, {"url": "https://wiki.alquds.edu/?query=Duncan_MacKay_(footballer)", "page_content": "Scottish footballer and manager (1937–2019)\n\nDuncan MacKay (14 July 1937 – 23 December 2019) was a Scottish footballer who played for Celtic, Third Lanark, Melbourne Croatia, Perth Azzurri and the Scotland national team.\n\nBorn in Glasgow, Mackay turned professional when he joined Celtic from Maryhill Harp, aged 17, in 1955. He developed rapidly, making his club debut within two years and earning the first of an eventual 14 caps for the Scottish national side four years later.\n\nCeltic manager Jimmy McGrory's attempts to rejuvenate his side eventually resulted in MacKay's departure from Celtic Park after over 200 first team appearances, the fullback moving to south Glasgow side Third Lanark in November 1964. Thirds were relegated at the end of the 1964–65 season and MacKay was one of several players released.\n\nMacKay opted to move to Australia at this juncture, joining Melbourne Croatia of the Victorian State League. He helped the side to the State title in 1968 and several Dockerty Cup triumphs but left when Croatia were suspended following crowd disturbances in 1972. He returned to Scotland and joined junior club St Anthony's as a player-coach for two years before deciding upon a second stint in Australia. After playing for Perth Azzurri between 1974 and 1977 he coached with South Melbourne[4] and Croatia (now known as Essendon Lions), the latter as Captain-Coach.\n\nMacKay died on 23 December 2019, aged 82.[5]\n\nHonours [ edit ]\n\nCeltic\n\nMelbourne Knights[7]\n\nPerth Azzuri\n\nIndividual\n\nReferences [ edit ]\n\n\n\n"}, {"url": "https://www.thescottishsun.co.uk/sport/football/5105150/ex-celtic-duncan-mackay-died-82/", "page_content": "FORMER Celtic player Duncan MacKay has passed away aged 82.\n\nThe former right-back made 236 appearances in green and white after making his Hoops first-team debut in 1958.\n\n1 Celtic have confirmed former player Duncan MacKay has died Credit: PA:Press Association\n\nMacKay, who had came through the ranks, went on to establish himself as a first-team player.\n\nHe was made club captain in 1961 before handing over the armband to Celts legend Billy McNeill in 1963.\n\nCeltic confirmed the news in a statement, writing: \"Everyone at Celtic Football Club is saddened to hear of the death of former player, Duncan MacKay, who has passed away at the age of 82.\n\n\"Dunky, who played for the Hoops between 1955-64, making 236 appearances and scoring seven goals, is rightly considered a Celtic great.\n\n\"His first-team debut came in August 1958, in a League Cup tie against Clyde at Shawfield, which Celtic won 4-1, and he soon established himself as first-choice right-back in the team.\n\n\"A highly-rated defender who was an early exponent of the attacking full-back role later honed by the likes of Tommy Gemmell and Jim Craig, Dunky MacKay was a firm fans’ favourite and his leadership qualities were identified by Jimmy McGrory, who made him captain in 1961, succeeding Bertie Peacock as skipper.\n\n\"He would later pass on the captain’s armband to Billy McNeill for the start of the 1963/64 season.\n\n\"In November 1964, he moved to Third Lanark, before heading out to Australia where he would eventually settle after a brief return to Scotland. He also gained 14 caps for Scotland during his playing career.\n\n\"The thoughts and prayers of everyone at Celtic are with Duncan’s family and friends at this very sad time.\n\n\"The Celtic players will wear black armbands at today's game against St Mirren as a mark of respect.\"\n\nKeep up to date with ALL the latest news and transfers at the Scottish Sun football page"}, {"url": "https://www.theguardian.com/sport/2005/sep/18/athletics.duncanmackay", "page_content": "Traditionally for runners in Britain, the route to the marathon has been well worn. They usually start by competing in the 800 and 1500 metres, discover that they are not fast enough and then move up to the 10,000m before, finally, in their late twenties, accepting that it is time to turn to the 26.2-mile distance.\n\nJohn Mayock has gone about things in a different way. At 34, he has skipped the middle phase and is hoping to go straight from being Britain's leading miler to the top marathon runner. The Yorkshireman will embark upon a major stepping stone today when he competes in the Great North Run, the world's largest half-marathon, which is celebrating its twenty-fifth anniversary. If all goes well, Mayock will confirm his entry in the New York City Marathon on 6 November.\n\nHe could have been one of Britain's most successful middle-distance runners if he had not retired from the track in March after finishing second in the 3,000m at the European indoor championships in Madrid. At the Olympics in Athens last year, he finished as the fastest Europe-born runner in the 5,000m.\n\nA young family and a new job at the Welsh Sports Council forced Mayock to reassess his priorities and the amount of time he was devoting to a sport in which he has been competing internationally for 16 years. Preparing for a marathon may mean that he has to run more miles in training, but he is able to spend more time at home rather than chasing dollars around the ultra-competitive European grand-prix circuit.\n\n'I am no longer a full-time athlete, I have a young family and have to fit in my two sessions a day between my work schedule,' said Mayock. 'But I do want to continue in the sport and when the New York organisers took me out to lunch in Madrid and invited me to their race, that gave me a new challenge for the future.\n\n'I discussed the situation with Peter Watson, my coach, and he told me it was the right time to have a go. Sharing a room with Jon Brown at international championships and training with him and the other marathon boys reminded me I still wanted a piece of the action.'\n\nBrown, Britain's leading male distance runner of the past decade, having twice finished fourth in the Olympic marathon, is a former Yorkshire schoolboy rival of Mayock. Interestingly, Mayock fits the prototype of the runner whom Brown claims the sport should be looking for if it is to reinvigorate British distance running, which has failed to produce a home male winner of the Great North Run since Steve Kenyon in 1985.\n\nBrown said that, to be successful, marathon runners needed to have run at least 3min 40sec for the 1500m. Mayock has a best of 3:31.86, ranking him fourth on the UK all-time list for the distance behind Steve Cram, Sebastian Coe and Steve Ovett. 'He's a very talented athlete, although he might have left switching to the marathon a little late,' said Brown.\n\nMayock has always suffered unfairly by being compared with Cram, Coe and Ovett, three of the greatest athletes in history. But he did reach two Olympic finals in the 1500m, finishing eleventh in 1996 and ninth in 2000. He also won bronze and silver medals in the 1994 and 1998 Commonwealth Games respectively and won eight national titles.\n\nHe had had to compete in a period of overwhelming African domination. Some criticised Mayock for appearing to be satisfied with being the best in Britain. 'People put this stigma on me that I was only interested in beating [main British rival] Anthony Whiteman and at the end of the day that meant nothing to me,' he said. 'I wanted to beat the Africans because being Britain's number one is good, but nowadays you want to be the European and world number one.'\n\nMayock will find plenty of talented Africans in his new event. Indeed, reigning champion Dejene Berhanu, of Ethiopia, and South Africa's two-time winner Hendrick Ramaala are expected to dominate today's race.\n\nMayock finished ninth last year in 64min 31sec, but that was just an end-of-season jolly he had not trained properly for. This time it is different. 'I've been preparing firstly for the Great North Run and then New York very seriously and Sunday will give me a good idea where I am at,' he said.\n\nMayock may not have taken the route everyone usually travels, but the marathon beckons all the same."}, {"url": "https://peoplepill.com/people/duncan-mackay/", "page_content": "Duncan MacKay (14 July 1937 – 23 December 2019) was a Scottish footballer who played for Celtic, Third Lanark, Melbourne Croatia, Perth Azzurri and the Scotland national team.\n\nBorn in Glasgow, Mackay turned professional when he joined Celtic from Maryhill Harp, aged 17, in 1955. He developed rapidly, making his club debut within two years and earning the first of an eventual 14 caps for the Scottish national side four years later.\n\nCeltic manager Jimmy McGrory's attempts to rejuvenate his side eventually resulted in MacKay's departure from Celtic Park after over 200 first team appearances, the fullback moving to south Glasgow side Third Lanark in November 1964. Thirds were relegated at the end of the 1964–65 season and MacKay was one of several players released.\n\nMacKay opted to move to Australia at this juncture, joining Melbourne Croatia of the Victorian State League. He helped the side to the State title in 1968 and several Dockerty Cup triumphs but left when Croatia were suspended following crowd disturbances in 1972. He returned to Scotland and joined junior club St Anthony's as a player-coach for two years before deciding upon a second stint in Australia. After playing for Perth Azzurri between 1974–77 he coached with South Melbourne and Croatia (now known as Essendon Lions), the latter as Captain-Coach.\n\nMacKay died on 23 December 2019, aged 82."}, {"url": "https://www.theguardian.com/sport/2001/jul/02/athletics.duncanmackay", "page_content": "Athletics\n\nIn the gloom of Scotstoun stadium here yesterday, the dark clouds hanging over Mark Richardson's career for the last two years began to lift and the sun began to shine on him once more.\n\nThe Windsor runner, racing an individual 400 metres for the first time since his two-year doping ban was commuted last month, returned in triumphant style as he beat two of the men expected to be among the favourites for the world title in Edmonton next month.\n\nRacing on a potent mix of adrenalin, passion and sense of injustice and roared on by a capacity crowd of 5,000, Richardson pulled away from Antonio Pettigrew and Jerome Young to win in 46.20sec, a time that was irrelevant in such blustery conditions.\n\n\"Driving in on the team bus when I saw the stadium and everything laid out ready my heart started pounding; this was it, me starting all over,\" said Richardson. \"It was strange when I was out there on the track doing it all again, sensing it and feeling it.\"\n\nPerhaps as important as the victory to Richardson was the fact that he had been made team captain for this match against the United States and Russia, an unequivocal message of support from UK Athletics only eight months after they had suspended him for testing positive for nandrolone. He had subsequently been cleared after scientific evidence proved contaminated supplements had been to blame.\n\n\"When it was announced I'd been made British captain for the event the athletes burst into spontaneous applause,\" said Richardson. \"I felt very humbled and honoured by that. It showed support for me. People have spent all day coming up to me and wishing me well.\"\n\nRichardson had been the only contender from Europe Michael Johnson had included in his \"12, 14 guys who could be the next to be on top [in the 400m]\". But he was not getting carried away. \"I would not be such a fool to think I can win the world championships,\" said Richardson.\n\nKatharine Merry is firmly established as the favourite for the women's 400m title but she will be hoping to end a worrying sequence of problems which are casting a long shadow over her preparations. First a throat infection forced her to pull out of Nuremberg, then a calf problem restricted her to sixth in the 200m at last weekend's European Cup.\n\nThe Olympic bronze medallist returned to win the one-lap race here in 51.03 but was so ill at the end with a headache blamed on the antibiotics she had been taking that she slumped to the floor for several minutes and was taken away for treatment.\n\nThe only other British individual victory of the day came from Jonathan Edwards in the triple jump. It was also the outstanding performance of the meeting as he leapt 17.66 metres, improving his position at the top of the world rankings.\n\nIt came after team-mate Phillips Idowu had briefly led with 17.38, the longest he has ever jumped in his life. \"It was thanks to him pushing me,\" said Edwards. \"You think now I'm the Olympic champion he would let me relax in my own backyard.\"\n\nDwain Chambers suffered his first defeat of the season in the 100m as he never recovered from a poor start which allowed Jon Drummond to open up a gap. The American held on to win in 10.10, breaking the stadium record of his training partner Maurice Greene, with Chambers second in 10.13. Mark Lewis-Francis suffered the worst race he could remember in his career as he finished fourth in 10.25.\n\nLewis-Francis and Chambers enjoyed some consolation when, with Christian Malcolm and Marlon Devonish, they won the 4x100m. But it was not enough to stop the US again winning this annual match as Britain finished second."}], "Duncan Mackay played for Rangers.": [{"url": "https://thecelticstar.com/celtic-v-the-rangers-minute-of-applause-confirmed-in-memory-of-duncan-dunky-mackay/", "page_content": "CELTIC have confirmed that there will be a minute of applause ahead of tomorrow’s Glasgow Derby against the Rangers at Celtic Park, in memory of the club’s former captain Dunky MacKay who passed away just before Christmas.\n\n“A minutes applause will be held ahead of tomorrow’s Glasgow Derby in memory of former player, Duncan MacKay, who has passed away at the age of 82,” Celtic have tweeted this afternoon.\n\nA minutes applause will be held ahead of tomorrow’s Glasgow Derby in memory of former player, Duncan MacKay, who has passed away at the age of 82. pic.twitter.com/iqIXEoRBIo — Celtic Football Club (@CelticFC) December 28, 2019\n\nAll 58k Celtic supporters at the game tomorrow will pay their respects by joining in the applause and the small group of away supporters also have the chance to show some courtesy and common decency.\n\nThe Celtic players wore black armbands on the away trip to Paisley on Thursday to play St Mirren but tomorrow is the first home match since Dunky’s passing and therefore this is the opportunity for the Celtic support to pa tribute to our former captain.\n\nThe club’s official website paid tribute to Duncan MacKay earlier today ahead of the Premiership match in Paisley.\n\n“Everyone at Celtic Football Club is saddened to hear of the death of former player, Duncan MacKay, who has passed away at the age of 82.\n\n“Dunky, who played for the Hoops between 1955-64, making 236 appearances and scoring seven goals, is rightly considered a Celtic great. His first-team debut came in August 1958, in a League Cup tie against Clyde at Shawfield, which Celtic won 4-1, and he soon established himself as first-choice right-back in the team.\n\n“A highly-rated defender who was an early exponent of the attacking full-back role later honed by the likes of Tommy Gemmell and Jim Craig, Dunky MacKay was a firm fans’ favourite and his leadership qualities were identified by Jimmy McGrory, who made him captain in 1961, succeeding Bertie Peacock as skipper.\n\n“He would later pass on the captain’s armband to Billy McNeill for the start of the 1963/64 season.\n\n“In November 1964, he moved to Third Lanark, before heading out to Australia where he would eventually settle after a brief return to Scotland. He also gained 14 caps for Scotland during his playing career.\n\n“The thoughts and prayers of everyone at Celtic are with Duncan’s family and friends at this very sad time.\n\n“The Celtic players will wear black armbands at today’s game against St Mirren as a mark of respect,” the official site advised.\n\nMeanwhile Willie Wallace today posted for the first time in several months to pay his respects to Ian Young, another recent loss to the the Celtic family and he also had a word or two about tomorrow’s match against the “old enemy”.\n\n“Sorry to hear that Ian Young who was a member of the first team squad when I arrived in 1966 at Celtic Park. It was very sad to read the messages of remembrance for all the lads.\n\n“Looking forward to good result against the “old enemy” in the upcoming match. Thanks to everyone for all the good wishes at Christmas and special thanks to Sydney Celtic Supporters Club for a great trip to Sydney and for fantastic hospitality. Looking forward to a successful 2020 and Happy New Year to all. Hail Hail!”"}, {"url": "https://www.thescottishsun.co.uk/sport/football/5111917/celtic-rangers-minutes-applause-duncan-mackay/", "page_content": "CELTIC will hold a minute's applause ahead of the Old Firm clash against Rangers in memory of former Hoops player Duncan MacKay.\n\nEx-Hoops ace MacKay passed away on Boxing Day aged 82.\n\n1 The Hoops will pay tribute to the late MacKay Credit: PA:Press Association\n\nThe Celts will now pay tribute to the former right-back ahead of the crucial Old Firm clash at Parkhead.\n\nAnnouncing the tribute on Twitter, the club posted: \"A minutes applause will be held ahead of tomorrow’s Glasgow Derby in memory of former player, Duncan MacKay, who has passed away at the age of 82.\"\n\nThe Hoops had already worn black armbands in the match against St Mirren on Thursday as a mark of respect.\n\nMacKay made 236 appearances in green and white after making his Hoops first-team debut in 1958.\n\nHe went on to establish himself as a first-team player.\n\nHe was made club captain in 1961 before handing over the armband to Celts legend Billy McNeill in 1963.\n\nCeltic confirmed the sad news of MacKay's passing in a statement, writing: \"Everyone at Celtic Football Club is saddened to hear of the death of former player, Duncan MacKay, who has passed away at the age of 82.\n\n\"Dunky, who played for the Hoops between 1955-64, making 236 appearances and scoring seven goals, is rightly considered a Celtic great.\n\n\"His first-team debut came in August 1958, in a League Cup tie against Clyde at Shawfield, which Celtic won 4-1, and he soon established himself as first-choice right-back in the team.\n\n\"A highly-rated defender who was an early exponent of the attacking full-back role later honed by the likes of Tommy Gemmell and Jim Craig, Dunky MacKay was a firm fans’ favourite and his leadership qualities were identified by Jimmy McGrory, who made him captain in 1961, succeeding Bertie Peacock as skipper.\n\n\"He would later pass on the captain’s armband to Billy McNeill for the start of the 1963/64 season.\n\n\"In November 1964, he moved to Third Lanark, before heading out to Australia where he would eventually settle after a brief return to Scotland. He also gained 14 caps for Scotland during his playing career.\n\n\"The thoughts and prayers of everyone at Celtic are with Duncan’s family and friends at this very sad time.\n\n\"The Celtic players will wear black armbands at today's game against St Mirren as a mark of respect.\"\n\nKeep up to date with ALL the latest news and transfers at the Scottish Sun football page"}, {"url": "https://prabook.com/web/duncan.mackay/2398366", "page_content": "Duncan MacKay\n\nassociation football player\n\nJuly 14, 1937 Glasgow, Scotland, United Kingdom\n\nBorn in Glasgow, Mackay turned professional when he joined Celtic from Maryhill Harp aged 17 in 1955. He developed rapidly, making his club debut within two years and earning the first of an eventual 14 caps for the Scottish national side four years later. Celtic manager Jimmy McGrory\"s attempts to rejuvenate his side eventually resulted in MacKay\"s departure from Celtic Park after over 200 first team appearances, the fullback moving to south Glasgow side Third Lanark in November 1964. Thirds were relegated at the end of the 1964-1965 season though, and MacKay was one of several players released. MacKay opted to move to Australia at this juncture, joining Melbourne Croatia of the Victorian State League. He helped the side to the State title in 1968 and several Dockerty Cup triumphs but left when Croatia were suspended following crowd disturbances in 1972. He returned to Scotland and joined junior club Street Anthony\"s as a player-coach for two years before deciding upon a second stint in Australia. After playing for Perth Azzurri between 1974 and 1977 he coached with South Melbourne and Essendon Lions."}, {"url": "https://www.glasgowlive.co.uk/news/glasgow-news/former-celtic-captain-duncan-mackay-17475220", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest Celtic F.C updates, transfer news and analysis from Football Scotland delivered straight to your inbox every day for free\n\nCeltic have paid tribute to former captain Duncan MacKay, who has died at the age of 82.\n\nThe right-back made 236 appearances for the Hoops between 1955-64.\n\nMacKay made his debut in a League Cup tie against Clyde at Shawfield in August 1958 and was made skipper by Jimmy McGrory in 1961 before passing on the armband to Billy McNeill two seasons later.\n\nFormer Scotland international MacKay moved to Third Lanark in 1964 and subsequently had spells with Australian clubs Melbourne Croatia and Perth Azzurri.\n\nCeltic announced the news in a statement on their official website which read: \"Everyone at Celtic Football Club is saddened to hear of the death of former player, Duncan MacKay, who has passed away at the age of 82.\n\n\"Dunky, who played for the Hoops between 1955-64, making 236 appearances and scoring seven goals, is rightly considered a Celtic great.\n\n\"His first-team debut came in August 1958, in a League Cup tie against Clyde at Shawfield, which Celtic won 4-1, and he soon established himself as first-choice right-back in the team.\n\n\"A highly-rated defender who was an early exponent of the attacking full-back role later honed by the likes of Tommy Gemmell and Jim Craig, Dunky MacKay was a firm fans' favourite and his leadership qualities were identified by Jimmy McGrory, who made him captain in 1961, succeeding Bertie Peacock as skipper.\n\n\"He would later pass on the captain's armband to Billy McNeill for the start of the 1963/64 season.\n\n\"In November 1964, he moved to Third Lanark, before heading out to Australia where he would eventually settle after a brief return to Scotland.\n\n\"He also gained 14 caps for Scotland during his playing career. The thoughts and prayers of everyone at Celtic are with Duncan's family and friends at this very sad time.\n\n\"The Celtic players will wear black armbands at today's game against St Mirren as a mark of respect.\"\n\nHave you downloaded the new and improved Glasgow Live app? Get all the latest news and events at the touch of a button on Android and Apple."}, {"url": "https://en.unionpedia.org/Duncan_MacKay_(footballer)", "page_content": "Duncan MacKay (footballer) Duncan MacKay (born 14 July 1937) is a Scottish former footballer, who played for Celtic, Third Lanark, Melbourne Croatia, Perth Azzurri and the Scotland national team. [1]\n\n23 relations: Association football, Australia, Bertie Peacock, Billy McNeill, Cap (sport), Celtic F.C., Celtic Park, Defender (association football), Dockerty Cup, Glasgow, Jimmy McGrory, Maryhill Hibernians F.C., Melbourne Knights FC, Perth SC, Rangers F.C., Scotland, Scotland national football team, Scottish Junior Football Association, South Melbourne FC, St Anthony's F.C., Third Lanark A.C., Victoria (Australia), 1964–65 in Scottish football.\n\nAssociation football, more commonly known as football or soccer, is a team sport played between two teams of eleven players with a spherical ball.\n\nNew!!: Duncan MacKay (footballer) and Association football · See more »\n\nAustralia, officially the Commonwealth of Australia, is a sovereign country comprising the mainland of the Australian continent, the island of Tasmania and numerous smaller islands.\n\nNew!!: Duncan MacKay (footballer) and Australia · See more »\n\nJohn Robert Peacock MBE (29 September 1928 – 22 July 2004), known as Bertie Peacock, was a Northern Ireland international footballer and manager who played for Celtic.\n\nNew!!: Duncan MacKay (footballer) and Bertie Peacock · See more »\n\nWilliam McNeill MBE (born 2 March 1940) is a Scottish former football player and manager.\n\nNew!!: Duncan MacKay (footballer) and Billy McNeill · See more »\n\nIn sport, a cap is a metaphorical term for a player's appearance in a game at international level.\n\nNew!!: Duncan MacKay (footballer) and Cap (sport) · See more »\n\nThe Celtic Football Club is a professional football club based in Glasgow, Scotland, which plays in the Scottish Premiership.\n\nNew!!: Duncan MacKay (footballer) and Celtic F.C. · See more »\n\nCeltic Park is a football stadium in the Parkhead area of Glasgow, and is the home ground of Celtic Football Club.\n\nNew!!: Duncan MacKay (footballer) and Celtic Park · See more »\n\nIn the sport of association football, a defender is an outfield player whose primary role is to prevent the opposing team from scoring goals.\n\nNew!!: Duncan MacKay (footballer) and Defender (association football) · See more »\n\nThe Dockerty Cup (also occasionally spelled erroneously as Docherty Cup) is an annual association football knock-out competition held between clubs in Victoria, Australia.\n\nNew!!: Duncan MacKay (footballer) and Dockerty Cup · See more »\n\nGlasgow (Glesga; Glaschu) is the largest city in Scotland, and third most populous in the United Kingdom.\n\nNew!!: Duncan MacKay (footballer) and Glasgow · See more »\n\nJames Edward McGrory (26 April 1904 – 20 October 1982) was a Scottish International football player, who played for Celtic and Clydebank as a forward, and then went on to manage Kilmarnock, before returning to Celtic after the end of the Second World War, to manage them.\n\nNew!!: Duncan MacKay (footballer) and Jimmy McGrory · See more »\n\nMaryhill Hibernians Football Club were a Scottish football club based in the Maryhill area of Glasgow, who played in Scottish Junior Football Association competitions from 1923 until they went out of business in 1967.\n\nNew!!: Duncan MacKay (footballer) and Maryhill Hibernians F.C. · See more »\n\nMelbourne Knights FC is an Australian semi-professional football club based in the suburb of Sunshine North, Melbourne, Victoria.\n\nNew!!: Duncan MacKay (footballer) and Melbourne Knights FC · See more »\n\nPerth Soccer Club is an Australian semi-professional soccer club based in West Perth, Western Australia.\n\nNew!!: Duncan MacKay (footballer) and Perth SC · See more »\n\nRangers Football Club are a football club in Glasgow, Scotland, who play in the Scottish Premiership, the first tier of the Scottish Professional Football League.\n\nNew!!: Duncan MacKay (footballer) and Rangers F.C. · See more »\n\nScotland (Alba) is a country that is part of the United Kingdom and covers the northern third of the island of Great Britain.\n\nNew!!: Duncan MacKay (footballer) and Scotland · See more »\n\nThe Scotland national football team represents Scotland in international football and is controlled by the Scottish Football Association.\n\nNew!!: Duncan MacKay (footballer) and Scotland national football team · See more »\n\nThe Scottish Junior Football Association (SJFA) is an affiliated national association of the Scottish Football Association and is the governing body for the junior grade of football in Scotland.\n\nNew!!: Duncan MacKay (footballer) and Scottish Junior Football Association · See more »\n\nSouth Melbourne Football Club is an Australian semi-professional soccer club based in suburb of Albert Park, in Melbourne, Victoria.\n\nNew!!: Duncan MacKay (footballer) and South Melbourne FC · See more »\n\nSt Anthony's Football Club is a Scottish non-league football club based in Cardonald, Glasgow.\n\nNew!!: Duncan MacKay (footballer) and St Anthony's F.C. · See more »\n\nThird Lanark Athletic Club were a professional Scottish football club based in Glasgow.\n\nNew!!: Duncan MacKay (footballer) and Third Lanark A.C. · See more »\n\nVictoria (abbreviated as Vic) is a state in south-eastern Australia.\n\nNew!!: Duncan MacKay (footballer) and Victoria (Australia) · See more »\n\nThe 1964–65 season was the 92nd season of competitive football in Scotland and the 68th season of Scottish league football.\n\nNew!!: Duncan MacKay (footballer) and 1964–65 in Scottish football · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Duncan_MacKay_(footballer)"}, {"url": "https://www.thecelticwiki.com/players/all-time-a-to-z-of-celtic-players/m/mackay-duncan/", "page_content": "Personal\n\nFullname: Duncan MacKay\n\naka: Dunky MacKay\n\nBorn: 14 July 1937\n\nDied: 23 December 2019\n\nBirthplace: Springburn\n\nSigned: 11 April 1955\n\nLeft: 6 November 1964 (Third Lanark)\n\nPosition: Right-back\n\nDebut: Clyde 1-4 Celtic, League Cup, 9 Aug 1958\n\nInternationals: Scotland\n\nInternational Caps: 14\n\nInternational Goals: 0\n\nBiog\n\nThe classy Duncan MacKay signed for Celtic from Maryhill Harp in April 1955.\n\nOn his signing, he was proclaimed as the find of the season, and for the next season was “the best defensive prospect in the country“.\n\nThe stylish right-back made his debut in a 4-1 League Cup win at Clyde in August 1958 and would spend the next six years as one of the top performers in disappointing & underachieving Celtic sides.\n\nDuncan MacKay had fantastic pace and stamina and he was a wonderful attacking full-back who was one of the first players in that position to use the over-lap as a regular feature of his game.\n\nWith fine control and a pin-point accurate pass, Duncan MacKay would always attempt to play the ball out of defence rather than just rely on the long clearance up the park. He was not overly physical in his defending either, preferring to win the ball through quick thinking and anticipation rather than just brute strength. So in some ways he was ahead of his time.\n\nThis refined approach to the game made him a popular player among the Celtic support and the Scotland selectors who capped him 14 times.\n\nHe became the captain in 1961, and then led the first team to the Scottish Cup matches v Dunfermline (the final & replay), but in both unfortunately Celtic once again came up short and lost. The side were perennially underachieving despite the wealth of talent on hand.\n\nWith Celtic so poor, he actually decided openly to request a move to England, but there was surprisingly little interest (Celtic’s poor state a likely major cause of the lack of interest). You have to take in the poor team management at the time at Celtic, lack of morale in the squad and the constant board meddling. It wasn’t an uncommon position. Jimmy Johnstone, Billy McNeill and Lennox were all also on the verge of leaving or giving up before Jock Stein’s arrival at Celtic.\n\nDuncan McKay lost the captaincy to Billy McNeill in 1963, and his place in the first team later in the year. His last game was a single appearance in the 1964/65 season with a 4-2 defeat to Hearts.\n\nHe was not a heavy goalscorer, but curiously once he scored his first the others soon enough followed. He took a long time to score his first for Celtic, a penalty in a 7-0 victory over St Mirren in November 1962. However, over April & May 1963, he scored five goals (all penalties), including a double over Raith Rovers in a Scottish Cup semi-final. His last goal (also a penalty) was in October 1963 as Celtic defeated Aberdeen 3-0.\n\nIt was a great injustice to Duncan McKay’s wonderful ability that he never won any major trophies as a Celt. This popular player eventually left Parkhead in 1964 for Third Lanark after 236 appearances and 7 goals.\n\nThe saddest aspect is that he was a great player in one of the poorer eras for Celtic. After the League Cup win in 1957, Celtic did not win another major trophy again until 1965. His first team career sadly spanned practically the whole of this period. Jock Stein became the club manager only a few months after Duncan Mackay’s departure. If Jock Stein had arrived sooner then possibly Duncan Mackay could have won a medal worthy of his talents.\n\nHe is one of the finest regular long-term first team Celtic players to leave Celtic without a medal for a major trophy (Willie Miller is another in this group). He deserved better, and it is an indictment of the club at the time for just how poor the First Team were.\n\nHowever, the Celtic support more then recognised his talent. In 1967, following the triumph in Lisbon in the European Cup, a poll by the Evening Times amongst its readers surveyed for the best Celtic team in living memory. To his credit, Duncan MacKay walked in at right-back. A great accolade and a mark of the respect the support had for him.\n\nAfter Third Lanark, he moved to Australia to play for various sides and then later to coach clubs there also, with a brief period back home in Scotland between 1972-74 when he was player-coach with Juniors St Anthony’s.\n\nHe passed away in December 2018, coincidentally just a few weeks after the passing of Ian Young who had succeeded him as the right-back at Celtic.\n\nPlaying Career\n\nAPPEARANCES LEAGUE SCOTTISH CUP LEAGUE CUP EUROPE TOTAL 1955-64 162 33 37 – 236 Goals 5 2 0 – 7\n\nHonours with Celtic\n\nnone\n\nPictures\n\nForums\n\nArticles\n\nDuncan MacKay Source: http://sesasport.com/?p=760 Duncan MacKay had a relatively short but stellar career with Celtic, racking up 236 games for the club from 1958 to 1964 and 14 Scottish caps in the late 1950s and early 1960s. He moved to Third Lanark in 1964 when Bill Hiddleston was engaged in the destruction of that club and in 1965 Frank Burin from the Croatia club in Melbourne persuaded him to try his luck in Australia. Mackay had an immediate impact on the club which had just been promoted to the Victorian State League, the top division. Croatia had been up and down between the State League and lower divisions over previous seasons but this time president Enver Begovic organised an open cheque-book approach that resulted in the expenditure of £5000 in two months. Hammy McMeechan from Slavia was signed for a Victorian record fee of £1200. Other newcomers were Joe Keenan, Ian Currie, Bobby McLachlan, Bill McIntyre and Brian Adlam. Croatia finished sixth in 1965. It was the ‘Glamour Team’ of the season, according to the Victorian Soccer Federation Yearbook. The early season form had been poor, six of the first seven games were lost, and it looked as if Croatia would go back down again, but the attraction of Duncan MacKay and the other players resulted in a transformation in the second half of the season when it finished with eleven wins. Croatia was also runner-up in the Dockerty Cup in 1965. The team which was to take Croatia to the top in Victoria and Australia was now in place. Croatia finished 6th in 1966, 3rd in 1967 under Jimmy Adam, and won the State League for the first time in 1968 under coach Mijo Kiss, finishing seven points clear of Polonia. Only four league games were lost all season. In addition, Croatia won the Ampol Cup and the Dockerty Cup, to complete an extraordinary triumph. In 1972 after an incident involving crowd trouble in a match against Hakoah, Croatia was suspended from the Victorian Soccer Federation and eventually refused permission to regain its position in the State League. It was not till 1974 that the Croatians took over Essendon Lions and resumed participation at a lower level. Duncan MacKay returned to Scotland in March 1972 and was player-coach at St Anthony’s, but he came back to Australia to the Azzurri club in Western Australia in 1974 and in 1977 he returned to Melbourne with Essendon Lions as player-coach.\n\nDeath of Celtic great Duncan MacKay\n\nBy: Newsroom Staff on 26 Dec, 2019 11:31\n\nhttp://www.celticfc.net/news/17326\n\nEVERYONE at Celtic Football Club is saddened to hear of the death of former player, Duncan MacKay, who has passed away at the age of 82.\n\nDunky, who played for the Hoops between 1955-64, making 236 appearances and scoring seven goals, is rightly considered a Celtic great. His first-team debut came in August 1958, in a League Cup tie against Clyde at Shawfield, which Celtic won 4-1, and he soon established himself as first-choice right-back in the team.\n\nA highly-rated defender who was an early exponent of the attacking full-back role later honed by the likes of Tommy Gemmell and Jim Craig, Dunky MacKay was a firm fans’ favourite and his leadership qualities were identified by Jimmy McGrory, who made him captain in 1961, succeeding Bertie Peacock as skipper.\n\nHe would later pass on the captain’s armband to Billy McNeill for the start of the 1963/64 season.\n\nIn November 1984, he moved to Third Lanark, before heading out to Australia where he would eventually settle after a brief return to Scotland. He also gained 14 caps for Scotland during his playing career.\n\nThe thoughts and prayers of everyone at Celtic are with Duncan’s family and friends at this very sad time.\n\nThe Celtic players will wear black armbands at today’s game against St Mirren as a mark of respect.\n\nObituary: Duncan Mackay, highly esteemed Celtic full-back who won honours in Australia\n\nBy Matt Vallance\n\n(2)\n\nSource: https://www.heraldscotland.com/opinion/18141730.obituary-duncan-mackay-highly-esteemed-celtic-full-back-won-honours-australia/Former Celtic captain and Scotland full-back\n\nBorn:July 14, 1937;\n\nDied: December 23, 2019.\n\nIT IS a long way from Maryhill to Melbourne, but in his 82 years that was the journey made by the esteemed former Celtic and Scotland full-back Dunky Mackay.\n\nLike many before him, Duncan’s father, also Duncan, had left the West Highlands for the city, where he worked at several jobs to keep a roof over his family’s head. He insisted the young Duncan wore his Mackay tartan kilt every day. But getting into schoolyard scrapes when responding to taunts of “Kiltie, kiltie cauld-bum” began to wear thin with the youngster, and he persuaded his parents to get him into long trousers.\n\nAt St Columba’s High his exceptional skill with a football got him noticed. He moved to St Mary’s Boys’ Guild, where Celtic signed him on a provisional form, farming him out to juniors, Maryhill Harp. By now the teenaged Mackay had seen the great Hungarian side of Ferenc Puskas and the sort of attacking football he wanted to play. He had left school and started an apprenticeship as a marine engineer.\n\nHe turned full-time at Celtic after completing his apprenticeship. During the 1958-59 campaign he made the first of his 236 first-team appearances in a League Cup tie against Clyde. By season’s end he was first choice, and an Under-23 cap. On April 11, 1959, aged 21, he made the first of an eventual 14 appearances for Scotland, against England at Wembley.\n\nHis full-back partner that day was Rangers’ Eric Caldow and the pair hit it off immediately. Indeed, they played together 12 times for Scotland, making Mackay Caldow’s most frequent international partner. Caldow would relate how, as Scotland captain, he once distributed ‘fan mail’ when the national squad was training at Largs; finding one addressed to “Donkey Mackay’ he quipped, “This lassie must have seen you playing, Dunky”. In reality, Caldow, rated his Celtic friend very highly as a player.\n\nBut, if things were going well with Scotland, all was not well at Celtic Park, where, following the 1957 League Cup win, the side struggled to compete with Rangers, Kilmarnock and Hearts, then the top teams. Bertie Peacock left the club and Mackay was appointed team captain in 1960, leading them to the Scottish Cup final of 1961, where they lost to Dunfermline after a replay. Indeed, along with 1940s goalkeeper Willie Miller, Mackay shares the “distinction” of having won more Scotland caps than medals as a Celtic player.\n\nIn 1963 he lost the captaincy to Billy McNeill, then, after injury he lost his first-team place, partly because, it is rumoured, manager Jimmy McGrory and chairman Bob Kelly, who picked the side, did not like Mackay’s attacking sorties up the wing.\n\nIn November, 1964, he left Celtic for Third Lanark. This is one of Scottish football’s great “what-ifs”; maybe, had he hung on until Jock Stein returned in February, 1965, he would have regained his place. Stein certainly preferred attacking full-backs. But Thirds were starting to implode and at the end of that season, Mackay joined Melbourne Croatia, who were spending big in a bid to become the top side in the Victoria League.\n\nHe was an instant success, being appointed captain and winning the Player of the Year title in his first season. He led Croatia to several trophies, including a league-and-two-cups treble in 1972, but the club fell foul of Australian Soccer financial rules and collapsed. Mackay returned to Scotland for two seasons, working as a bookbinder and coaching junior outfit St Anthony’s.\n\nHis first marriage, when a young man, had failed. But while, back home, he married his second wife, Marilyn, before, in 1974, Perth Azzurri, in Western Australia, offered him a player-coach role.\n\nHe led the Azzurri to back-to-back league titles, then returned to Melbourne, to Essendon Lions, as Croatia had now become. Here he found success as a league-winning coach, before winding down his active involvement in football with South Melbourne Hellas.\n\nMelbourne clearly suited Mackay. In his first spell with Croatia, he turned down the chance to join Pele at New York Cosmos. His non-football working life turned full circle when he joined Transfeld Ship Builders as a Senior Procurement Buyer – the post he filled until his retirement.\n\nHe and Marilyn, who survives him, had two daughters, Shone and Elissa. He is also survived by son Duncan Junior, from his first marriage, who also lives in Australia. Paul, another son from that first marriage predeceased his father. In retirement, Mackay enjoyed listening to the Beatles, Barbra Streisand and Tony Bennett.\n\nDunky Mackay was a very good full-back. He was Celtic’s Player of the Year in 1963, and Man of the Match when they played Real Madrid at Parkhead in a friendly. Sadly, he never had the medals to show for playing at a low point in the club’s history, but on the other side of the world he finally won a few medals, forged a good reputation as a coach, and perhaps showed Scottish football what it lost when it allowed him to leave.\n\nMATT VALLANCE"}, {"url": "https://www.dailyrecord.co.uk/sport/football/football-news/duncan-mackay-dies-aged-82-21163559", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest Celtic news sent straight to your inbox with our daily newsletter\n\nFormer Celtic hero Duncan MacKay has died at the age of 82.\n\nThe Hoops will honour the former player by wearing black armbands in their trip to Paisley to face St Mirren this afternoon.\n\nThe Parkhead club released a statement announcing the news ahead of the Premiership encounter.\n\nIt read: \"Everyone at Celtic Football Club is saddened to hear of the death of former player, Duncan MacKay, who has passed away at the age of 82.\n\n\"Dunky, who played for the Hoops between 1955-64, making 236 appearances and scoring seven goals, is rightly considered a Celtic great. His first-team debut came in August 1958, in a League Cup tie against Clyde at Shawfield, which Celtic won 4-1, and he soon established himself as first-choice right-back in the team.\n\n\"A highly-rated defender who was an early exponent of the attacking full-back role later honed by the likes of Tommy Gemmell and Jim Craig, Dunky MacKay was a firm fans’ favourite and his leadership qualities were identified by Jimmy McGrory, who made him captain in 1961, succeeding Bertie Peacock as skipper.\n\n\"He would later pass on the captain’s armband to Billy McNeill for the start of the 1963/64 season.\n\n\"In November 1984, he moved to Third Lanark, before heading out to Australia where he would eventually settle after a brief return to Scotland. He also gained 14 caps for Scotland during his playing career.\n\n\"The thoughts and prayers of everyone at Celtic are with Duncan’s family and friends at this very sad time.\n\n\"The Celtic players will wear black armbands at today's game against St Mirren as a mark of respect.\""}, {"url": "https://peoplepill.com/people/duncan-mackay/", "page_content": "Duncan MacKay (14 July 1937 – 23 December 2019) was a Scottish footballer who played for Celtic, Third Lanark, Melbourne Croatia, Perth Azzurri and the Scotland national team.\n\nBorn in Glasgow, Mackay turned professional when he joined Celtic from Maryhill Harp, aged 17, in 1955. He developed rapidly, making his club debut within two years and earning the first of an eventual 14 caps for the Scottish national side four years later.\n\nCeltic manager Jimmy McGrory's attempts to rejuvenate his side eventually resulted in MacKay's departure from Celtic Park after over 200 first team appearances, the fullback moving to south Glasgow side Third Lanark in November 1964. Thirds were relegated at the end of the 1964–65 season and MacKay was one of several players released.\n\nMacKay opted to move to Australia at this juncture, joining Melbourne Croatia of the Victorian State League. He helped the side to the State title in 1968 and several Dockerty Cup triumphs but left when Croatia were suspended following crowd disturbances in 1972. He returned to Scotland and joined junior club St Anthony's as a player-coach for two years before deciding upon a second stint in Australia. After playing for Perth Azzurri between 1974–77 he coached with South Melbourne and Croatia (now known as Essendon Lions), the latter as Captain-Coach.\n\nMacKay died on 23 December 2019, aged 82."}, {"url": "https://www.thescottishsun.co.uk/sport/football/5105150/ex-celtic-duncan-mackay-died-82/", "page_content": "FORMER Celtic player Duncan MacKay has passed away aged 82.\n\nThe former right-back made 236 appearances in green and white after making his Hoops first-team debut in 1958.\n\n1 Celtic have confirmed former player Duncan MacKay has died Credit: PA:Press Association\n\nMacKay, who had came through the ranks, went on to establish himself as a first-team player.\n\nHe was made club captain in 1961 before handing over the armband to Celts legend Billy McNeill in 1963.\n\nCeltic confirmed the news in a statement, writing: \"Everyone at Celtic Football Club is saddened to hear of the death of former player, Duncan MacKay, who has passed away at the age of 82.\n\n\"Dunky, who played for the Hoops between 1955-64, making 236 appearances and scoring seven goals, is rightly considered a Celtic great.\n\n\"His first-team debut came in August 1958, in a League Cup tie against Clyde at Shawfield, which Celtic won 4-1, and he soon established himself as first-choice right-back in the team.\n\n\"A highly-rated defender who was an early exponent of the attacking full-back role later honed by the likes of Tommy Gemmell and Jim Craig, Dunky MacKay was a firm fans’ favourite and his leadership qualities were identified by Jimmy McGrory, who made him captain in 1961, succeeding Bertie Peacock as skipper.\n\n\"He would later pass on the captain’s armband to Billy McNeill for the start of the 1963/64 season.\n\n\"In November 1964, he moved to Third Lanark, before heading out to Australia where he would eventually settle after a brief return to Scotland. He also gained 14 caps for Scotland during his playing career.\n\n\"The thoughts and prayers of everyone at Celtic are with Duncan’s family and friends at this very sad time.\n\n\"The Celtic players will wear black armbands at today's game against St Mirren as a mark of respect.\"\n\nKeep up to date with ALL the latest news and transfers at the Scottish Sun football page"}, {"url": "https://canucksbanter.ca/2021/09/04/hockey-pioneer-duncan-mickey-mackay/", "page_content": "By Andrew Chernoff\n\nMacKay, Duncan “Mickey” Vancouver Millionaires Source: https://andrewchernoff.wordpress.com/tag/duncan-mickey-mackay/\n\nMacKay was born in Chesley, Ontario on May 21, 1894, the son of John MacKay and Margaret McMillan.\n\nHe married Anne May Reyburn on June 12, 1916 in Grand Forks, B.C.\n\nMacKay played professional hockey for several teams: Vancouver Millionaires, Chicago Black Hawks, Pittsburgh Pirates, and Boston Bruins.\n\nHe was part of two Stanley Cup winning teams: The Vancouver Millionaires in 1915 and the Boston Bruins in 1929. He was inducted into the Hockey Hall of Fame.\n\nMacKay died after having a heart attack while driving and crashing his car near Nelson, British Columbia.\n\nHe was buried in Evergreen Cemetery, Grand Forks, B.C.\n\nSource: https://www.wikitree.com/wiki/MacKay-3053\n\nHe joined the Canadian Army at the age of 14 and briefly trained at the Valcartier training camp in Quebec until recruiting officers realized he was under age and discharged him from the service. He played with the Chesley Ontario senior OHA in 1911, then moved to Edmonton for the 1912-13 season, and played for the Edmonton team which won the city championship. Then he moved to Grand Forks, and played there during the 1913-14 season, winning the McBride Cup, and the Daily News Cup, for the Kootenay championship; and the Boundary Cup, for the Boundary Championship. He was known as a phenom then, and he was signed by Vancouver for the 1914-15 season, although his residence had shifted for a time to Toronto. At the of time of joining Vancouver, he was considered the youngest professional hockey player at 19. Source: Craig H. Bowlsby, Empire Of Ice: The Rise and Fall of the Pacific Coast Hockey Association, 1911-1926, p.358\n\nWith the senior team in Grand Forks, he was the provincial league’s leading goal scorer with 15 goals in 1913–14. Source: https://peoplepill.com/people/mickey-mackay\n\nMacKay learned to skate at the age of 15.\n\nWhile with the Edmonton Dominions of the Alberta Senior Hockey League, in 1912-1913 he led the league with eight playoff goals, and was a teammate of future Vancouver Millionaires teammate Barney Stanley.\n\nA marvelous skater and goal scorer, Duncan “Mickey” MacKay was blessed with instinct and timing on the ice that was matched by few contemporaries. A star rover and center in a number of leagues during his career, he was particularly successful in the Pacific Coast Hockey Association, where his offensive heroics made him one of the Vancouver Millionaires’ most popular stars. In 1914 McKay was signed by the Vancouver Millionaires of the PCHA and he quickly embarked on the most fruitful period of his hockey career. MacKay dazzled the West Coast fans with a three-goal effort in his first league game on December 8, 1914, playing on a line with Frank Nighbor and Ken Mallen. His 33 goals in 17 games as a rookie exceeded all other rivals. During the Stanley Cup victory over Ottawa, MacKay continued to impress with four goals in the three-game series that his team dominated. The scoring exploits of MacKay didn’t abate during the coming years. He was sensational during Vancouver’s heartbreaking loss to the Toronto Arenas in the 1918 Stanley Cup series, scoring five goals in as many games playing as a rover and right wing. “The Wee Scot” spent the 1919-20 schedule with the Calgary Columbus of the Alberta Big 4 Hockey League before returning to Vancouver the next year. He topped the PCHA in goals scored during its last year of operation in 1923-24. That same year his Vancouver squad lost to the Montreal Canadiens in the last Stanley Cup championship series involving a PCHA team. The Vancouver franchise joined the Western Canada Hockey League in 1924-25 and MacKay led the way on the strength of a league high of 27 goals in 28 games. The loop was renamed the Western Hockey League prior to the 1925-26 schedule. When the league folded a few months later, MacKay was among the stars coveted and purchased by NHL teams. Consequently he joined the Chicago Black Hawks for their inaugural season in 1926-27. MacKay spent two years in the Windy City recording 31 goals playing on a line with Dick Irvin. Acquired by the Pittsburgh Pirates in the off-season, MacKay was traded again, this time to the Boston Bruins, on December 21,1928. He scored nine goals while helping the Bruins finish at the top of the American Division standings. In the Stanley Cup finals, MacKay helped the Beantowners quell the New York Rangers in two straight games and got his name on the Cup for the second time in his career. He retired as a player partway through the next season to assume the task of business manager with the Bruins. MacKay scored 260 regular-season and playoff goals in three top-flight leagues between 1914 and 1929. Source: https://www.hhof.com/HonouredMembers/MemberDetails.html?type=Player&mem=p195205&list=\n\nMacKay was regarded by his contemporaries as one of the top players of his time.\n\nLester Patrick praised his abilities:\n\n“He was perhaps the greatest center we ever had on the coast. MacKay was a great crowd pleaser. He was clean, splendidly courageous, a happy player with a stylish way of going. He was one of those who helped make pro hockey a great game.”\n\nHis greatest limitation was his size, standing five foot nine and around 162 pounds; he frequently battled through injuries and missed many games throughout his career as a result. His nickname, “the wee Scot”, was in reference to his diminutive size.\n\nLeaving the Bruins, MacKay settled near his wife’s hometown of Grand Forks. He remained active in hockey, serving as a referee and coach in the area.\n\nHe contemplated purchasing the Spokane Clippers of the minor professional Pacific Coast Hockey League in 1938 but decided against taking over the team. MacKay became involved in mining in the eastern Kootenays upon his return to British Columbia.\n\nHe died on May 30, 1940, when traveling as part of his mining job after his vehicle left the road and hit a telephone pole near the village of Ymir. The medical examiner determined that he had suffered a heart attack, causing the crash.\n\nMacKay was posthumously honored by several organizations for his hockey career, and was inducted into the Hockey Hall of Fame in 1952. He was inducted into the British Columbia Sports Hall of Fame in 1989, and is an honored member of the British Columbia Hockey Hall of Fame. Source: https://en.wikipedia.org/wiki/Mickey_MacKay"}]}