{"Wilhelm Windelband belonged to the neo-Kantianism philosophical school.": [{"url": "https://plato.stanford.edu/entries/wilhelm-windelband/", "page_content": "First published Mon May 18, 2020\n\nWindelband was a marvelous essayist. He developed his ideas not in the format of a larger systematic work, but in a series of addresses and individual papers, a selection of which was published in his famous Präludien [Preludes] in 1883. The genre of Windelband’s writings does not lend itself to the development of a philosophical system, and he often changes the emphasis, framing, and terminology of his claims and arguments from one essay to the next. Nevertheless, he was a rigorous thinker. This entry provides a rational reconstruction of the systematic insights that Windelband developed in his various addresses and essays, and groups them around the central themes that reoccur throughout his oeuvre. With respect to many of these themes—the anti-psychologistic interpretation of Kant, the fact-value distinction, the question of historical method, and the conception of the history of philosophy—Windelband was a highly influential contributor to the philosophical landscape of his time. Although he did not develop a detailed and encompassing philosophical system like his student Rickert, or the neo-Kantians of the Marburg school, most notably Ernst Cassirer (1874–1945), his ideas shaped subsequent debates on these issues more profoundly than is often acknowledged.\n\nHe also made a name for himself in the history of philosophy by pioneering the method of structuring the historical presentation in terms of fundamental philosophical problems, rather than as a chronology of individual thinkers.\n\nWindelband is well-known for having introduced a distinction between the “nomothetic method” of the natural sciences and the “idiographic method” of the historical disciplines. His argument that history is a science [Wissenschaft] that captures the unique, unrepeatable and individual character of reality has been highly relevant for subsequent debates on historical method.\n\nWindelband’s main philosophical contribution consists in reformulating Kant’s transcendental approach in terms of a “philosophy of values” that focuses philosophical analysis on questions of normativity. Although Windelband thinks of his project as an anti-metaphysical “scientific philosophy”, he is keen to secure for philosophy a role that is independent of the special sciences. He finds the grounds for philosophy’s independence in its formal-teleological method, and in its concern with a quaestio juris, rather than a quaestio facti. That is, philosophy deals with questions of justification, it does not determine matters of fact.\n\nWilhelm Windelband (1848–1915) was a German neo-Kantian philosopher. He is considered the founding father of the Baden (or Southwest) school of Neo-Kantianism. The Baden school included his student and successor at Heidelberg, Heinrich Rickert (1863–1936), and Rickert’s student Emil Lask (1875–1915) as its core members. Alongside his contemporary Hermann Cohen (1842–1918)—the founder of the Marburg school of Neo-Kantianism—Windelband is a central proponent of the anti-psychologistic interpretation of Kant that became dominant in German academic philosophy from the 1880s onwards, and that constituted the backbone of “orthodox” neo-Kantianism in the late nineteenth century.\n\n1. Biographical Sketch\n\nWilhelm Windelband was born in 1848 in Potsdam, Germany. His father, Johann Friedrich Windelband was a state secretary for the Province of Brandenburg. Windelband studied in Jena, Berlin, and Göttingen, attending lectures by Kuno Fischer (1824–1907) in Jena and studying with Hermann Lotze (1817–1881) in Göttingen. Fischer and Lotze would deeply influence Windelband’s philosophical thinking, as well as his work as a historian of philosophy.\n\nIn 1870, Windelband completed his dissertation on Die Lehren vom Zufall [Doctrines of chance] under Lotze’s supervision. The following year he served as a soldier in the German-French war. After his military service, he completed his habilitation in Leipzig and took up a position as “Privatdozent” there. His habilitation was published in 1873 under the title Ueber die Gewissheit der Erkenntniss: eine psychologisch-erkenntnisstheoretische Studie [On the certainty of knowledge: a psychological-epistemological study]. In 1874, Windelband married Martha Wichgraf with whom he would have four children.\n\nTwo years later, Windelband became professor (ordinarius) of “inductive philosophy” in Zürich. He lectured on psychology before taking up a position as professor of philosophy in Freiburg im Breisgau in 1877. In 1882 he accepted an offer from the University of Strasbourg. While his inaugural lectures in Zürich and Freiburg had centered on the relation between psychology and philosophy, his works from the Strasbourg period develop his core themes in the philosophy of values and the philosophy of history. Windelband served as “Rektor” of the University of Strasbourg in 1894/95 and 1897/98. He remained in Strasbourg until 1903, when he accepted a call from the University of Heidelberg. Between 1905 and 1908 he served as representative of the University of Heidelberg in the Baden “Landtag”. He was a member of the Berlin Academy of Sciences, and of the Academies of Sciences of Göttingen, Bayern and Heidelberg. He remained in Heidelberg and taught there until his death in 1915.\n\n2. From Kant to the Philosophy of Values\n\nWindelband’s views on normativity are strongly influenced by his teacher Lotze. In his Logic (1874), Lotze distinguishes between psychological laws which determine how thinking proceeds as a matter of fact, and logical laws, which are normative laws and prescribe how thinking ought to proceed (Lotze 1874: §x; §332, §337). This distinction also corresponds to a distinction between act and content. Lotze observes that “ideas” do occur in us as acts or events of the mind. But their content does not consist in such acts, is not reducible to mental activity, and does not exist in the way empirical processes and entities may be said to exist. It is not real, but “valid” (Lotze 1874: §§314–318).\n\nThe distinction between the factual and the normative would become the cornerstone of Windelband’s “philosophy of values”. In his early writings, however, Windelband does not yet embrace this distinction. In his habilitation thesis Über die Gewißheit der Erkenntnis (1873), he argues that logic is a normative discipline, but that it needs to be put on a psychological basis. This is because the justification of our knowledge claims is always dependent on and relative to specific epistemic purposes which, in turn, are given psychologically. Although he criticizes the identification of the conditions of knowledge with psychophysical processes, he does think of psychology and logic or epistemology as continuous with one another. His 1875 “Die Erkenntnislehre unter dem völkerpsychologischen Gesichtspunkte” [“The theory of knowledge from the perspective of folk-psychology”] which was published in Moritz Lazarus’ and Heyman Steinthal’s Zeitschrift für Völkerpsychologie und Sprachwissenschaft [Journal of folk psychology and linguistics], is more radical. It denies that logical norms are independent of the conscious mind and claims that the origins of logical norms are to be found in the social history of humankind: the principle of contradiction emerges in situations of social conflict together with the distinction between true and false beliefs; and the law of sufficient reason comes into being when conflicts between rival views are no longer settled by brute force. On this picture, logical principles exist only when humans cognize them. There is no boundary between psychological acts and objective logical laws, or between actual historical acceptance and normative validity.\n\nThis is precisely the type of thinking that Windelband will later reject as “psychologistic”, “historicist”, and “relativist” (1883: 116–117, 132). It is not clear what led Windelband to this change of view, but a deeper engagement with the Critique of Pure Reason and with the Kant scholarship of his time, in particular with works by Kuno Fischer (1860), Herman Cohen (1871), and Friedrich Paulsen (1875), seem to have factored in. The clear contours of Windelband’s anti-psychologistic interpretation of Kant emerge for the first time in his 1877 paper “Über die verschiedenen Phasen der Kantischen Lehre vom Ding-an-sich” [“On the different stages of the Kantian doctrine of the thing-in-itself”]. In this essay, Windelband argues against the idea, held by prominent figures of the “back-to-Kant” movement like Friedrich Albert Lange (1828–1875) and Hermann von Helmholtz (1821–1894), that knowledge emerges from an interaction between subject and object. According to their view, the object affects the subject’s mind, while the subject provides the a priori cognitive structures that organize representations. These a priori structures are innate as they consist in the psychophysical constitution of the human sensory apparatus and mind. Cohen’s critique of this (mis)interpretation focuses on the concept of the a priori and the question of objectivity (Cohen 1871). Windelband, in contrast, takes the problem of the thing-in-itself and the concept of truth as his starting points. His critique of the subject-object-interaction model leads him to an immanent conception of truth, according to which truth consists in the normative rules according to which our judgments ought to be formed. The immanent concept of truth thus shifts the focus of philosophical analysis on the universal and necessary “rules” that ground our judgments.\n\nThe 1877 essay gives a genetic account of the development of Kant’s views about the thing-in-itself from the Inaugural Dissertation (1770) to the second edition of the Critique of Pure Reason (1787). This genetic reconstruction is supposed to reveal the underlying philosophical problems and motivations that drove Kant’s thinking, as well as the inner tensions that, according to Windelband, permeate critical philosophy. In particular, Windelband identifies a “gulf” (1877: 225) between Kant’s critique of knowledge and the metaphysics of morals, as well as a tension between the psychological account of the faculties, and Kant’s mature anti-psychologism. He distinguishes between four phases in Kant’s thinking about the thing-in-itself, and argues that residues of the latter three stages are present in both editions of the Critique (1781; 1787) and in the Prolegomena (1783).\n\nThe first phase, Windelband argues, is that of the Inaugural Dissertation (1770). Kant adopts Leibniz’s distinction between noumena and phenomena while formulating a genuinely novel thought: he introduces the psychological distinction between receptive sensibility and the spontaneous intellect. This distinction allows him to maintain the claim that, unlike intuitions, concepts relate to things-in-themselves (1877: 240–241).\n\nIn the second phase, Kant concerns himself more deeply with the question how the concepts of the understanding can relate to objects. He is driven to the insight that\n\n[w]e can only have a priori knowledge of that which we produce by the lawlike forms of our rational activities [Vernunfthandlungen]. (1877: 246)\n\nHere, Windelband follows Fischer’s claim that the categories of the understanding are a priori valid for experience because they produce or “make” it (Fischer 1860). Because the understanding cannot “make” the thing-in-itself, the thing-in-itself cannot be known.\n\nAccording to Windelband, Kant then proceeds to inquire why we are even assuming the existence of things-in-themselves if we cannot know them. Here he enters his third, most radical phase. Kant now thinks of the thing-in-itself as a fiction, an illegitimate hypostasis in which\n\nthe universal form of the synthetic act of the understanding is seen as something that exists independently of experience. (1877: 254)\n\nWindelband argues that it is only by dismissing the existence of the thing-in-itself and by jettisoning the phenomena-noumena distinction that Kant can undertake his anti-psychologistic turn. With the rejection of the thing-in-itself, the characterization of sensibility as “receptive” also needs to be abandoned. And that makes a psychological construal of the faculties nonsensical. Kant is then also able to abandon the concept of truth as correspondence between representations and objects in favor of a strictly immanent conception. The immanent conception defines truth in terms of the universal and necessary rules that the relations between our representations need to accord to (1877: 259–260).\n\nAnd yet, Kant could not rest with this radical view given his commitments in moral philosophy. Practical reason, and in particular the idea that the moral law does not depend on the qualities of humans as sensuous beings, but only on reason, demands a return to the assumption that the thing-in-itself exists (1877: 262). In the fourth phase, Kant thus reintroduces the thing-in-itself, while maintaining his anti-psychologism.\n\nThis genetic reconstruction allows Windelband to think of the conflict between the different views of the thing-in-itself that had emerged within the neo-Kantian tradition as reflective of inherent tensions in the Critique. He argues that Kant was especially unclear with respect to psychologism: the distinction between judgment (as a cognitive process) and justification (as logical and normative) is inadequately articulated in the first Critique. Hence Kant is at least partly responsible for the fact that in the first wave of neo-Kantianism represented by Lange and Helmholtz “the new concept of aprioricity was soon dragged down to the old idea of psychological priority” (1883: 101).\n\nBut Windelband’s approach to Kant is not merely historical. His sympathies clearly lie with the Kant of the third phase. For Windelband, the insight that natural psychological processes are “utterly irrelevant” for the truth value of our representations (1882b: 24), and the idea that the ultimate problem of philosophy is that of normativity and justification—not a quaestio facti, but a quaestio juris (1882b: 26)—need to be defended from Kant’s own unclarities on these matters. Windelband’s “philosophy of values” can thus be understood as an attempt to purify, explicate and develop the radical insights of the anti-psychologistic move in Kant’s “third phase”.\n\nThe cornerstone of this endeavor is the immanent conception of truth. Windelband repeatedly returns to discussing the correspondence theory of knowledge with its metaphor of a “mirror relation” between mind and object. He criticizes the misconception that our sensual perceptions are the things-in-themselves and that these things could be compared with our representations. Any comparison must occur between representations, since things and representations are “incommensurable” (1881: 130). According to Windelband, Kant’s central innovation consists in the insight that the truth of our judgments, and the relation of our representations to an object are not to be found in correspondence at all. Rather, it consists in the “rules” for combining representations (1881: 134). This leads Windelband to define truth as the “normality of thinking” (1881: 138)—with “normality” meaning that thinking proceeds in accordance with rules or norms. Windelband also conceptualizes the object of knowledge in terms of the rules of judgment. The object of knowledge is nothing other than\n\na rule according to which representational elements ought to organize themselves, in order for them to be recognized as universally valid in this organization. (1881: 135).\n\nWindelband uses the terms “axioms” and “values” interchangeably to refer to the most fundamental rules, and he uses the term “norms” often, but not fully consistently to refer to values or axioms as they relate to psychological experience and the cultural-historical world. Focusing his interpretation on “values” and “norms”, Windelband captures the structural similarity of Kant’s three Critiques in terms of immanent truth: if truth is nothing other than accordance with a rule, then there is moral and aesthetic truth in just the same way as there is epistemic truth (1881: 140). In a later text, Windelband describes the unified project of the three Critiques in terms of the necessary and universal relation between thought and object. He writes that the postulates of practical reason relate to intelligible objects (ideas) just “as necessarily” as the intuitions and categories relate to the object of experience, and that teleological judgment constructs the purposive whole of nature just “as universally” as the principles of pure understanding apply the categories to experience (1904a: 151). While this formulation glosses over some of the nuances of the distinction between constitutive and regulative uses of reason, Windelband’s main intention is not that of giving a detailed and fully accurate reconstruction of Kant’s philosophy. In line with his famous dictum that “understanding Kant means to go beyond him” (1915: iv), he instead seeks to revive the critical project in a manner that allows it to answer the needs of his own time. And Windelband thinks that the critical philosophy required at the time of his writing is a “philosophy of values” which reveals the most fundamental values in epistemology, ethics, and aesthetics.\n\n3. The Factual, the Normative, and the Method of Philosophy\n\nAs indicated above, Windelband bases his “philosophy of values” on Lotze’s distinction between the factual and the normative. Throughout his career, he seeks to explicate and clarify this distinction and to illuminate its consequences for philosophical method.\n\nIn “Was ist Philosophie?” [“What is philosophy?”] (1882), Windelband approaches the factual-normative distinction by identifying two basic and irreducible types of cognitive operations: judgments and evaluations. While judgments relate representations in a synthesis, and thus expand our knowledge about an object, evaluations presuppose an object as given. They do not expand our knowledge. Rather, they express a relation between the “evaluating consciousness” and the represented object in a “feeling” of approval or disapproval (1882b: 29–30).\n\nDespite characterizing evaluations in terms of the feelings and subjective attitudes of the evaluating consciousness, Windelband argues that some evaluations are “absolutely valid”. Even if they are not embraced by everyone as a matter fact, they entail a normative demand: they ought to be accepted universally according to an absolute value (1882b: 37). The basic idea seems to be that the normative force of any particular evaluation that is carried out by an empirical consciousness is derived from its relation to a non-empirical, absolute value. Windelband argues that even if there is disagreement about which evaluations ought to be embraced as universal and necessary, the demand for absolute validity itself can be recognized by everyone: we all believe in the distinction between that which is absolutely valid and that which is not (1882b: 43).\n\nAccordingly, there must be a system of absolute values from which the validity of judgments in epistemology, aesthetics, and ethic derives. Critical philosophy, then, is nothing other than the “science of necessary and universal values” (1882b: 26) that explicates this system and thus reveals the grounds of normative appraisal and valid judgment. Note that for Windelband, normativity and validity are closely linked, if not identical. Absolute values endow our judgments with a normative demand. Our judgments are valid if and only if they raise a normative demand, that is if they ought to be accepted universally and necessarily.\n\nHaving distinguished the factual and the normative by reference to different cognitive operations, Windelband also seeks to identify the points of contact between the two realms. Ultimately, he wants to explain how empirical beings can recognize absolute values. His idea that there is a system of absolute values is thus accompanied by the conception of a “normal consciousness”. In normal consciousness the absolute system of values is, at least partially, represented in the form of norms that are known by “empirical consciousness” and that have an effect on it.\n\nStarting from the immanent conception of truth as accordance with a rule, Windelband distinguishes from among the infinite possible combinations of representations that might or might not be formed by empirical consciousness a subset of combinations: the subset that accords with universal and necessary rules, and which hence ought to be formed (1881: 135–139: 1882a: 72–73). This subset is what he calls “normal consciousness” (1881: 139). Thought is related to and valid for an object if of the infinite possible combinations of our representations, our thinking forms exactly those judgments that “ought to be thought” (1881: 135). One might say that empirical consciousness contains (parts) of the system of absolute values as its “normal consciousness”. To the extent that philosophy seeks not only to reveal the absolute system of values, but also to inquire into how they can be norms for empirical—embodied, psychological and historically situated—human beings, critical philosophy is not only a “science of values”, but also a “science of normal consciousness” (1882b: 46).\n\nAlthough Windelband refers to the “philosophy of values” as a science, he emphasizes that philosophy does not rely on the methods of the empirical sciences. Philosophy is a second-order science that reflects on the methods and results of the various empirical disciplines in order to reveal the values “by virtue of which we can evaluate the form and extent of their validity” (1907: 9). Crucially, this reflective endeavor cannot be carried out by means of empirical investigation. Here, the distinction between the factual and the normative assumes a methodological dimension.\n\nIn “Kritische oder genetische Methode?” [“Critical or genetic method?”] (1883) Windelband lays out in great detail the differences between the “explanatory” and “genetic” method of the empirical sciences, on the one hand, and the “teleological” or “critical” method of philosophy, on the other. And he warns of the devastating consequences that result if the two are conflated. He singles out two disciplines that might be thought to be relevant to philosophical questions about values: individual psychology and cultural history. He does not call into question the legitimacy of these disciplines or of the “genetic method” in general. He even thinks that the genetic method can be applied to values. That is, individual psychology and cultural history can yield valid genetic theories that explain the actual acceptance and development of values in an individual’s mental life and in cultural history. But actual acceptance is not the same as normative validity, and validity proper cannot be found by generalizing from the empirical. A firm boundary separates the genetic method and its approach toward actually accepted values from the critical method of philosophy which concerns values as normative.\n\nWindelband’s argument against the application of the genetic method to philosophical questions has three components. First, he argues that the genetic method cannot solve philosophical questions about normativity and validity, because there is too much variety regarding the values that have been and are actually accepted. The empirical method will not uncover values that are universally embraced by all cultures (1883: 114–115).\n\nSecond, the genetic method can show and explain why some values have been accepted by this or that individual, or in this or that culture. But insofar as it is an empirical method, it cannot establish that the values in question are universal and necessary.\n\nThe universally valid can be found neither by inductive comparison of all individuals and peoples nor by deductive inference from … the ‘essence’ of man. (1883: 115)\n\nWindelband points to the absurdity of trying to justify by empirical means that which is the presupposition of any empirical theory: the axioms upon which the validity of any theory is based (1883: 113).\n\nThird, Windelband argues that the genetic method leads to relativism. The argument rests on the two claims just outlined, and can be reconstructed as follows. There is variation between individuals and cultures regarding which beliefs are actually prevalent, and the naturally necessary [naturnotwendig] laws of psychology lead to the formation of both true and false beliefs. As an empirical method with no access to the universal and necessary, the genetic method of cultural history and individual psychology has no criterion for distinguishing between valid and invalid beliefs. This means that it has to treat all beliefs as “equally justified [alle gleich berechtigt]” (1882b: 36).\n\nFor [the genetic explanation], there is thus no absolute measure; it must treat all beliefs as equally justified because they are all equally necessary by nature… [R]elativism is the necessary consequence of the purely empiricist treatment of philosophy’s cardinal question. (1883: 115–116)\n\nNote that Windelband does not differentiate between the idea that all beliefs have only relative validity and the claim that they are all equally justified or equally valid. In his view, the genetic method does not merely render belief relative to individuals and cultures; it also forces us to conclude that all beliefs are equally valid. An empirical psychology or cultural history that oversteps its boundaries and tries to address philosophical questions about normativity and validity leads to “historicism”, “psychologism”, and “relativism” and destroys the basis of normative appraisal altogether.\n\nHaving rejected the genetic method in philosophy, Windelband explains that philosophical method is purely “formal”. The axioms, or values, on which the validity of our judgments is based upon cannot be proven. But it can be shown that the purposes of recognizing truth, beauty, and can only be achieved if absolute values are presupposed. Hence the critical method of philosophy has a teleological structure:\n\n[F]or the critical method these axioms, regardless of the extent to which they are actually accepted, are norms which ought to be valid if thinking wants to fulfil the purpose of being true, volition the purpose of being good, and feeling the purpose of capturing beauty, in a manner that warrants universal validation. (1883: 109)\n\nAnd yet, while Windelband insists on the distinction between the empirical-genetic method of science and the critical-teleological method of philosophy, he takes his theory of “normal consciousness” to imply that empirical facts do play a role in philosophy. In particular, he wants to maintain that empirical facts about individual psychology and culture can provide the starting points for philosophical reflection. He therefore describes the philosophical method as a method of reflection [Selbstbesinnung], in which the empirical mind becomes aware of its own “normal consciousness”. Philosophy examines existing claims to validity in light of teleological considerations, and in this way reveals the “processual forms of psychic life that are necessary conditions for the realization of universal appraisal” (1883: 125). Put differently, teleological considerations allow the empirical consciousness to distinguish within itself between empirical and contingent contents, on the one hand, and the “contents and forms” that “have the value of normal consciousness”, on the other (1882b: 45–46; 1881: 139).\n\n4. The Problem of Freedom\n\nThe distinction between the normative and the factual and the question how the two realms are related also structure Windelband’s reflections on human freedom. Throughout his intellectual career, Windelband returns to this problem, presenting different strategies for reconciling causal determinism and human freedom. His dissertation, completed under Lotze in 1870, deals with the concepts of chance, causal necessity, and freedom. At that time, Windelband still embraces the Kantian concept of transcendental freedom, according to which the noumenal self is the uncaused cause of all intentional action (1870: 16–19). But after the 1877 essay, which had uncovered the anti-metaphysical rejection of the thing-in-itself in Kant’s “third phase” as the radical starting point for the “philosophy of values”, Kant’s metaphysical solution to the problem of freedom ceased to convince him.\n\nWindelband’s most fully developed effort to arrive at an alternative solution to the problem of freedom can be found in his 1882 essay “Normen und Naturgesetze” [“Norms and natural laws”] and in his 1904 lectures Über Willenfreiheit [On freedom of the will]. In these texts, Windelband articulates the following core claims. First, the Kantian dualism between phenomena and noumena needs to be overcome, and we need to think of moral responsibility in a way that does not presuppose a noumenal realm. Second, causal explanation and normative evaluation are two irreducible, but ultimately compatible, ways of viewing, or constructing, the world of appearances. Third, the object of moral evaluation is neither a particular moral action, nor a transcendentally free will, but a “personality”—understood as a set of relatively stable motivations and psychological dispositions—that is the natural cause of our actions. Although articulating these same core thoughts, the two texts differ in how they motivate these ideas, and in the consequences that they draw from them.\n\n“Normen und Naturgesetze” begins by postulating a conflict between natural law and moral law: if the moral law demands an action that would also result from natural causes alone, it is superfluous. But if it demands an action that does not accord with natural causes, it is useless, because natural necessity cannot be violated (1882a: 59).\n\nWindelband holds that causal determinism extends to mental life and that for this reason the conception of freedom as a fundamental capacity that violates “the naturally necessary functions of psychic life” (1882a: 60) is implausible from the get-go. However, he grants that there are two different and irreducible ways of viewing the same objects: on the one hand, there is psychological science which explains what the facts of mental life are. On the other hand, there are ideal norms, which do not explain what the facts are, but express how they ought to be (1882a: 66–67). The solution to the antagonism between natural law and moral law is to be found in the relation between these two points of view.\n\nHere, Windelband introduces the claim that although ideal norms differ from causal laws, they are not incommensurable with them and, in fact, act on us causally. His argument builds on his conception of “normal consciousness” as the representation of the system of absolute values within empirical consciousness. Windelband argues that a mind that becomes aware of its own “normal consciousness” is capable of acting on the basis of and in agreement with the norms that it has discovered within itself:\n\n[E]ach norm carries with it a sense that the real process of thinking or willing ought to form itself in accordance with it. With immediate evidence a form of psychological coercion attaches itself to the awareness of the norm. (1882a: 85)\n\nThe norm becomes a determining factor in and for empirical consciousness. It acts as “part of the causal law” and determines psychological life with natural necessity (1882a: 87; see also 1883: 122).\n\nThe result is what Windelband calls a “deterministic concept of freedom” (1882a: 88), according to which freedom consists in nothing other than the becoming-aware of the norms that command how we ought to act: our becoming-aware of them determines our actions with natural necessity. Freedom is the “determination of empirical consciousness by normal consciousness” (1882a: 88).\n\nBut Windelband still needs to explain how it is possible that we can be aware of a moral norm and not act on it. Long passages in the 1904 lectures are devoted to developing the thought that what determines our moral decisions and actions, and hence decisions if and when we act in accordance with the moral law is our “personality”. Windelband approaches this as a theoretical, not as a normative, question and concludes that we may well call those decisions and actions “free” that are predominantly determined by our constant personality, as opposed to being determined by external circumstances or contingent affects. Freedom is “the unhindered causality of a pre-existing willing” (1904b: 106).\n\nHowever, Windelband concedes that this analysis does not exhaust our concept of freedom since there is not merely a theoretical, but also a normative use of the concept. In this context, Windelband acknowledges the attraction of the Kantian argument that moral responsibility is possible only if we have transcendental free will and with it the capacity for genuine alternatives: we could act differently given the same circumstances. But Windelband rejects the project of grounding human freedom in a noumenal world. He thinks that Kant’s distinction between an intelligible noumenal self that is the uncaused cause of our actions, and a deterministic empirical world as constructed by our understanding reproduces the same problems that earlier metaphysical accounts of freedom had encountered. He discusses two problems in particular.\n\nFirst, on the one hand, the personality that a particular individual has developed is part of the empirical world and therefore, on the metaphysical picture, does not feature into the free decisions of the individual. But, on the other hand, the noumenal self is empty. It is an abstract, general self, uniform in all of us; and thus it cannot account for the differences in the moral life of individuals (1904b: 161–163).\n\nSecond, transcendental freedom is fundamentally incompatible with the “all- encompassing reality and causality of the deity” (1904b: 187). God is the ultimate uncaused cause, and the only way to understand this thought is by assuming a “timeless causality” between God and the intelligible characters (noumenal selves)—a view which ends up undermining the freedom of the latter (1904b: 186–9)\n\nHaving concluded that Kantian dualism fails to avoid the pitfalls of earlier metaphysical approaches to freedom, Windelband abandons the concept of transcendental freedom altogether. But while in 1882 his alternative had been the “deterministic concept of freedom”, in 1904 Windelband proceeds to articulate the view that the concept of free will is a mere placeholder in our normative discourse. We are not free in the metaphysical sense, but we are perfectly entitled to pass moral judgment. And we use the language of freedom to express the fact that when passing moral judgment we disregard questions of causal determination.\n\nTo spell out this idea, Windelband takes up the 1882 distinction between the “points of view” of explanatory science and ideal norms. He now argues that there are two ways of constructing the world of appearances: we construct the world of appearances according to causal laws, and we construct it according to our normative evaluations. Evaluation\n\nreflects within the manifoldness of the given on those moments only which can be put in relation to the norm… [O]ne could call the manner in which the objects of experience, the given manifoldness of the factual, appear uniformly in light of such an evaluation another form of “appearance”…. (1904b: 195–6)\n\nFreedom then means not that the will is an uncaused cause. When speaking of freedom, we appeal to the uncaused merely in the sense that we evaluate matters independently of causal deterministic processes (1904b: 197–198).\n\nWindelband believes that his view preserves moral responsibility. As described above, his theoretical investigation had yielded the result that that which determines the extent to which we act in agreement with a moral norm is our personality or character. Personality is the constant cause of voluntary action, it determines our actions necessarily according to general psychological laws. From a practical standpoint, personality then is also the ultimate object of moral appraisal. We hold personality responsible, and we are justified in doing so, even if the formation of personality is itself a causal process over which the individual has no control. Ultimately, the upshot of Windelband’s discussion is that moral responsibility does not presuppose a noumenal world and transcendental freedom, because it does not presuppose that we could act otherwise. It merely presupposes that another person in the same circumstances could act otherwise. The idea that one could have acted differently refers\n\nnot to the concrete human being in these concrete circumstances, but to the generic concept of the human being. (1904b: 212)\n\n5. The Natural and the Historical Sciences\n\nIn Windelband’s view, a reconsideration of the Kantian project is not only necessary because of its inherent tensions; broader developments in nineteenth-century culture and science also necessitate an adaptation of the critical method to changed historical circumstances. One important factor is the professionalization of the historical disciplines that had been underway since the early nineteenth century (1907: 12). One of Windelband’s central and best known philosophical contributions concerns the question what distinguishes the “historical sciences”, that is, those disciplines that study the human-historical and cultural world, from the natural sciences. Windelband’s answer to this question is in line with his formal-teleological conception of philosophy: by explicating the autonomous presuppositions of historical method, critical philosophy safeguards the historical sciences against methodological holism, namely the view that there is only one scientific method, and that this is the method of physics and natural science.\n\nWindelband shares the goal of securing the autonomy of the historical disciplines with his contemporary Wilhelm Dilthey. In his 1883 Einleitung in die Geisteswissenschaften [Introduction to the human sciences] Dilthey had founded the distinction between the natural sciences and the human sciences or “sciences of spirit” on a distinction between outer and inner experience. While outer experience forms the basis of hypothetical knowledge in natural science, inner experience discloses “from within” how the individual is an intersection of social and cultural relations (Dilthey 1883: 30–32, 60–61, 88–89). Inner experience is at the same time psychological and socio-historical, and a descriptive psychology capable of grasping the integrated nexus of inner experience can provide the “sciences of spirit” with a solid foundation (Dilthey 1894).\n\nWindelband profoundly disagrees with Dilthey’s strategy for demarcating the historical disciplines. In his Strasbourg rector’s address “Geschichte und Naturwissenschaft” [“History and natural science”] from 1894, he takes issue with the suggestion that the facts of the “sciences of spirit” derive from a particular type of experience. He takes Dilthey to endorse an introspective view of psychological method. To this he objects that the facts of the historical disciplines do not derive from inner experience alone, and that inner perception is a dubious method in the first place. He also classifies psychology with the natural sciences, rejecting Dilthey’s idea that the human-historical disciplines could be founded on a non-explanatory and non-hypothetical descriptive psychology. Perhaps most fundamentally, Windelband rejects the term “sciences of spirit” on the ground that it suggests that the distinction between different sciences rests on a material distinction between different objects: spirit and nature (Windelband 1894: 141–143).\n\nWindelband seeks an alternative method for science-classification that is purely formal. His reflections take scientific justification in its most abstract form as their starting point: justification in science is either inductive or deductive, Windelband argues, and the basic relation on which all knowledge is based is between the general and the particular (1883: 102–103).\n\nThe distinction between different empirical sciences is then also to be sought at this level. In particular, Windelband argues that science might pursue one of two different “knowledge goals” (1894: 143): it “either seeks the general in the form of natural law or the particular in the historically determined form” (1894: 145). The former approach is that of the “nomothetic sciences” which seek to arrive at universal apodictic judgments, treating the particular and unique as a mere exemplar or special case of the type or of the generic concept. The “idiographic sciences”, in contrast, aim to arrive at singular assertoric judgments that represent a unique object in its individual formation (1894: 150).\n\nWindelband emphasizes that the distinction between nomothetic and idiographic sciences is a purely formal and teleological one. One and the same object can be approached from both points of view, and which method is appropriate depends entirely on the goal or purpose of the investigation. Moreover, most sciences will involve both general and particular knowledge. The idiographic sciences in particular depend on general and causal knowledge which has been derived from the nomothetic sciences (1894: 156–157).\n\nNote, however, that Windelband is not consistently restricting his analysis to the formal level. He tends to use the terms “nomothetic” and “natural” sciences, and the terms “idiographic” and “historical” sciences interchangeably, which at least suggests a correspondence between scientific goals, methods, and objects.\n\nAlthough Windelband does not spell this out in great detail, he also suggests that values are of integral importance to the idiographic method. First, he argues that the selection of relevant historical facts depends on an assessment of what is valuable to us (1894: 153–154). Second, he suggests that the integration of particular facts into larger wholes is only possible if meaningful, value-laden relations can be established such that “the particular feature is a meaningful part of a living intuition of the whole [Gesamtanschauung]” (1894: 154). And third, he claims that we value the particular, unique, and individual in a way in which we do not value the general and recurrent, and that the experience of the individual is indeed at the root of our “feelings of value” (1894: 155–156).\n\nIt is Windelband’s student Heinrich Rickert who takes up these suggestions and develops them into a systematic account of the “individuating” and “value-relating” “concept-formation” of the “historical sciences of culture” (Rickert 1902). Rickert argues that “scientific concept formation”, by which science overcomes the “extensive and intensive manifold” of reality, depends on a principle of selection. The principle of selection at work in the natural sciences is that of “generalization”. For this reason, the natural sciences cannot account for the unique and unrepeatable character of reality. The historical sciences, in contrast, form their concepts in a manner that allows them to capture individual realities (Rickert 1902: 225, 236, 250–251). They do so on the basis of values: values guide the selection of which particular historical facts belong to and can be integrated into a specific historical “individuality” (examples being “the Renaissance”, “the Reformation” or “the German nation state”). According to Rickert, one can clearly distinguish the theoretical value-relation that is the basis of historical science and practical evaluation. The historian relies on values but does not evaluate his material (Rickert 1902: 364–365). Building on Windelband’s core ideas about historical method, Rickert arrives at a more refined and systematized account of how historical science forms its concepts, that ultimately leads to an account of what culture as an object of scientific study amounts to.\n\nIn some of his later writings, Windelband will pick up the more developed thoughts of his student Rickert. For example, he claims that each science creates its objects according to the manner in which it forms its concepts (1907: 18), and that the historical sciences rely on a system of universal values when making selections about what enters into their concepts (1907: 20).\n\n6. The History of Philosophical Problems\n\nA large part of Windelband’s oeuvre consists of writings in the history of philosophy. Windelband primarily covers modern philosophy from the Renaissance to his own time, but he also published on ancient philosophy. As a historian, Windelband is heavily indebted to Fischer. And yet, he goes significantly beyond his teacher, developing a new method and mode of historical presentation. Windelband conceives of the history of philosophy as a “history of problems”. Rather than presenting a chronological sequence of great minds, he organizes the presentation of philosophical ideas according to the fundamental problems around which the philosophical debates and arguments of an age were structured. Windelband also takes a reflective attitude towards his own historiographical practice and seeks to clarify the goals and systematic relevance of the history of philosophy.\n\nIn these reflections, Windelband seeks to integrate two main thoughts: First, the idea that philosophy is a reflection of its time and age and, second, the conviction that the history of philosophy has systematic significance. Windelband finds both thoughts in Hegel’s approach to the history of philosophy. Mirroring Hegel’s famous dictum that “philosophy is its own time apprehended in thought”, he speaks of philosophy the “self-consciousness of developing cultural life” (1909: 4). He also applauds Hegel’s “deep insight” that the history of philosophy realizes reason and thus has intrinsic relevance for systematic philosophy (1883: 133). Windelband thinks of history as the “organon of philosophy” (1905: 184), as a guide to the absolute values that the critical method seeks to reveal.\n\nBut despite the Hegelian gloss of these two claims, Windelband is critical of Hegelianism. This is primarily because he has a different understanding of the idea that philosophy is “its own time apprehended in thought”. For Windelband, this means that philosophical thinking is shaped by historically contingent factors.\n\nAccordingly, Windelband formulates two criticisms of the Hegelian conception of the history of philosophy. First, he finds fault with the idea that the order in which successive philosophical ideas emerge is necessary and that—in virtue of being necessary—it has systematic significance:\n\n[I]n its essentially empirical determination which is accidental with respect to the “idea” the historical process of development cannot have this systematic significance. (1883: 133, see also 1905: 176–177)\n\nThe history of philosophy is not only shaped by the necessary self-expression of reason, but also by the causal necessity of cultural history. The cultural determinants of philosophical thinking lead to “problem-convolutions” (1891: 11), in which various, conceptually unrelated philosophical questions merge with one another. Windelband also emphasizes that the “individual factor” of the philosopher’s character and personality is relevant for how philosophical problems and concepts are articulated in a given historical moment (1891: 12)\n\nSecond, although Windelband agrees that the historical development of philosophical ideas is partly driven by critique and self-improvement, he does not think of this process in terms of progress. Windelband probes the often unacknowledged presuppositions of our talk about progress. In “Pessimismus und Wissenschaft” (1876) Windelband argues that science cannot decide between historical optimism and historical pessimism (1876: 243). In “Kritische und genetische Methode” (1883) he gives a more detailed analysis of why this is the case. Historical change itself is not progress, he observes. In order to determine whether a given historical development is progressive, we need to be in possession of “a standard, the idea of a purpose, which determines the value of the change” (1883: 119). Windelband is wary of triumphalist narratives that identify the historical development of present-day values with progress. History is determined by contingent cultural factors and could have produced “delusions and follies … which we only take to be truths now because we are inescapably trapped in them” (1883: 121). Of progress we can only speak legitimately, if we are in possession of an absolute value that allows us to assess the historical development. At minimum, this means that the appeal to a progressive history of philosophy is of no help when it comes to the systematic task of uncovering the system of absolute values: progress cannot aid in revealing absolute values as it presupposes them.\n\nBut while the fact that philosophy is at least partly determined by contingent cultural factors undercuts necessity and progress, it also opens the door for a reconceptualization of the “essence” of philosophy. In his Einleitung in die Philosophie [Introduction to philosophy] (1914) Windelband reflects on the fact that everyday life, culture, and science do already contain general concepts of the world. These concepts form the initial content of philosophical reflection (1914: 6). But the business of philosophy only takes off when these initial concepts, and the assumptions that are baked into them, become unstable and collapse. An experience of shock and unsettling prompts philosophy to question, rethink, and critically assess the concepts and ideas of everyday life and science. In this process of critical assessment, philosophy strives to purify these concepts and ideas, and to connect them into a coherent, unified system. According to Windelband, in this process of conceptual reorganization, a rational necessity exerts itself. The “vigorous and uncompromising rethinking of the preconditions of our spiritual life” creates certain philosophical problems “with objective necessity” (1914: 8).\n\nWindelband provides neither a very detailed account of what “philosophical problems” exactly are, nor of how precisely they spring from the unsettling of everyday concepts. But he makes three claims that, taken together, establish that philosophy, even when reflecting its particular age, is not solely determined by contingent cultural factors. First, philosophical puzzles stem from the “inadequacy and contradictory imbalance” of the contents that philosophy receives from life and science (1891: 10). That is, true philosophical problems emerge whenever the systematizing drive of philosophy is confronted with the deep incoherence of life. Second, philosophical problems are necessary because the conceptual “material” found in life already contains “the objective presuppositions and logical coercions for all rational deliberation about it” (1891: 10). The necessity of philosophical problems is logical necessity. Third, despite historical change\n\n[c]ertain differences of world- and life-attitudes reoccur over and over again, combat each other and destroy each other in mutual dialectics. (1914: 10)\n\nBecause philosophical problems emerge “necessarily” and “objectively”, they also reoccur throughout history. Philosophical problems are thus timeless and eternal (1891: 9–10; 1914: 11)).\n\nWindelband also believes that the history of philosophy, pursued empirically and scientifically, can disentangle from one another the “temporal causes and timeless reasons” (1905: 189) that together give rise to the emergence of philosophical problems.\n\nOnly through knowledge of the empirical trajectory that is free of constructions can come to light …. what is the share of … the needs of the age on the one hand…but on the other hand that of the objective necessities of conceptual progress. (1905: 189)\n\nAt this point, Windelband reaches a clear verdict on the goal and systematic significance of the history of philosophy: it lies in disentangling that which is contingently actually accepted from that which is “valid in itself” (1905: 199). History is the “organon of critical philosophy” precisely to the extent that it allows us to distinguish the actually accepted norms of cultural life from that which is absolutely valid (1883: 132).\n\n7. Critical Philosophy and World-Views\n\nWindelband’s “philosophy of values” is also an intervention into debates that had preoccupied the neo-Kantian movement and German academic philosophy more broadly since the materialism controversy [Materialismusstreit]: what the relation between science and world-views is, and whether philosophy is capable of providing a “world-view”.\n\nGiven that he takes the core of the critical project to consist in a quaestio juris—a concern with normativity—it seems surprising that throughout the 1880s Windelband insists that critical philosophy does not provide a “world-view”: the project of revealing the highest values of human life has nothing to do with “world-views”, he argues, because it does not provide a metaphysical account of the world and our place in it (1881: 140–141, 145). Questions about optimism or pessimism cannot be answered by means of “scientific” philosophy, since they depend on the idea that the world as a whole has a purpose. And claims about the ultimate purpose of the world arise only from an unscientific, subjective, and arbitrary projection of particular purposes onto the universe as such (1876: 231). Philosophy is a science, albeit a second-order formal science, and is thus barred from formulating a world-view that would be metaphysical in character.\n\nAfter 1900, however, Windelband’s position on the question of world-views changes. He now claims that it is the aim of philosophy to provide a “world-view” with scientific justification (1907: 1). Given that Windelband holds that philosophy in general and the Kantian project in particular need to be adapted to the developing circumstances of time and culture, this change of position is not inconsequential: the cultural landscape of the early 1900s demands a revision of the neo-Kantian project that highlights not only its “negative” and critical aspects, but also develops its positive implications for cultural life (1907, 8). The shift to a more positive attitude towards philosophy as a world-view corresponds to a re-evaluation of Kant’s oeuvre, in which Windelband at least partly suspends the anti-metaphysical rigor of the “third phase” of the genesis of the Critique of Pure Reason, and attributes more relevance to the Critique of the Power of Judgment. This view is taken up by Rickert, who later argues in more detail that the third Critique forms the core of critical philosophy, and that Kant’s metaphysical project can provide the basis for an encompassing theory of world-views (Rickert 1924: 153–168).\n\nIn his 1904 “Nach hundert Jahren” [“After one hundred years”] Windelband provides yet another take on the relation between the natural and the normative. Declaring the question how the realm of natural laws is related to the realm of values to be the “highest” philosophical endeavor (1904a: 162), he now sees in the Critique of the Power of Judgment the possibility of solving this problem: here one finds the idea that the purposive system of nature gives rise to the value-determined process of human history. The central concept that allows for connecting nature and history in this way is that of “realization” (1904a: 162–3).\n\nThe turn to the concept of “realization” also leads to a shift in how Windelband approaches the problem of science classification. In 1894, Windelband had thought of the nomothetic and idiographic sciences as two fundamental yet disjointed and even incommensurable approaches to seeking knowledge of the word: “Law and event persist next to each other as the last, incommensurable factors of our representation of the world” (1894: 160). But in 1904, he claims that the concept of realization provides a common, unified basis for the natural and the historical sciences (1904a: 163).\n\nWindelband’s language assumes a Hegelian tone. Critical philosophy equipped with the concept of realization is able to grasp and express the “spiritual value content” of reality (1904a: 165). History is capable of revealing the universal value content in the contingent maze of human interests and desires, and in so doing captures “the progressive realization of rational values” (1907: 20–21). The human as a rational being is not determined psychologically or naturally, but humanity is a historical task: “only as a historical being, as the developing species, do we have a share in world-reason” (1910a: 283: see also 1905: 185). Windelband even suggests that history itself has a goal, namely the realization of a common humanity (1908: 257).\n\nThese remarks remain cursory however, and there is room for debate over how much of Hegel’s ontology of history Windelband takes on board, as well as whether his talk about the progressive realization of reason in history is incompatible with the formal-teleological method that he had endorsed in the 1880s and 1890s. His “Kulturphilosophie und transzendentaler Idealismus” [“Philosophy of culture and transcendental idealism”] of 1910 presents us with a puzzling fusion of Kantian and Hegelian language. The goal of critical philosophy is that of revealing the unity of culture, Windelband now claims, and this unity can only be found"}, {"url": "https://iep.utm.edu/neo-kant/", "page_content": "Neo-Kantianism\n\nBy its broadest definition, the term ‘Neo-Kantianism’ names any thinker after Kant who both engages substantively with the basic ramifications of his transcendental idealism and casts their own project at least roughly within his terminological framework. In this sense, thinkers as diverse as Schopenhauer, Mach, Husserl, Foucault, Strawson, Kuhn, Sellers, Nancy, Korsgaard, and Friedman could loosely be considered Neo-Kantian. More specifically, ‘Neo-Kantianism’ refers to two multifaceted and internally-differentiated trends of thinking in the late Nineteenth and early Twentieth-Centuries: the Marburg School and what is usually called either the Baden School or the Southwest School. The most prominent representatives of the former movement are Hermann Cohen, Paul Natorp, and Ernst Cassirer. Among the latter movement are Wilhelm Windelband and Heinrich Rickert. Several other noteworthy thinkers are associated with the movement as well.\n\nNeo-Kantianism was the dominant philosophical movement in German universities from the 1870’s until the First World War. Its popularity declined rapidly thereafter even though its influences can be found on both sides of the Continental/Analytic divide throughout the twentieth century. Sometimes unfairly cast as narrowly epistemological, Neo-Kantianism covered a broad range of themes, from logic to the philosophy of history, ethics, aesthetics, psychology, religion, and culture. Since then there has been a relatively small but philosophically serious effort to reinvigorate further historical study and programmatic advancement of this often neglected philosophy.\n\nTable of Contents\n\n1. Proto Neo-Kantians\n\nDuring the first half of the Nineteenth-Century, Kant had become something of a relic. This is not to say that major thinkers were not strongly influenced by Kantian philosophy. Indeed there are clear traces in the literature of the Weimar Classicists, in the historiography of Bartold Georg Niebuhr (1776-1831) and Leopold von Ranke (1795-1886), in Wilhelm von Humboldt’s philosophy of language (1767-1835), and in Johannes Peter Müller’s (1801-1858) physiology. Figures like Schleiermacher (1768-1834), Immanuel Hermann Fichte (1796-1879), Friedrich Eduard Beneke (1798-1854), Christian Hermann Weiße (1801-1866), the Fries-influenced Jürgen Bona Meyer (1829-1897), the Frenchman Charles Renouvier (1815-1903), the evangelical theologian Albrecht Ritschl (1822-1889), and the great historian of philosophy Friedrich Ueberweg (1826-1871), made calls to heed Kant’s warning about transgressing the bounds of possible experience. However, there was neither a systematic nor programmatic school of Kantian thought in Germany for more than sixty years after Kant’s death in 1804.\n\nThe first published use of the term ‘Neo-Kantianer’ appeared in 1862, in a polemical review of Eduard Zeller by the Hegelian Karl Ludwig Michelet. But it was Otto Liebmann’s (1840-1912) Kant und die Epigonen (1865) that most indelibly heralds the rise of a new movement. Here Johann Gottlieb Fichte (1762-1814), Hegel (1770-1831), and Schelling (1775-1854), whose idealist followers held sway in German philosophy departments during the early decades of the 19th Century, are chided for taking over only Kant’s system-building, and for doing so only in a superficial way. They sought to create the world from scratch, as it were, by finding new, more-fundamental first principles upon which to create a stronghold of interlocking propositions, one following necessarily from its predecessor. Insofar as those principles were generated from reflection rather than experience, however, the ‘descendants’ would effectively embrace Kant’s idealism at the expense of his empirical realism. The steep decline of Hegelianism a generation later opened a vacuum which was to be filled by the counter-movement of scientific materialism, represented by figures like Karl Vogt (1817-1895), Heinrich Czolbe (1819-1873), and Ludwig Büchner (1824-1899). By reducing speculative philosophy to a system of naturalistic observation consistent with their realism, the materialists utilized a commonsense terminology that reopened philosophical inquiry for those uninitiated in idealist dialectics. Despite their successes in the realm of the natural sciences, the materialists were accused of avoiding serious philosophical problems rather than solving them. This was especially true about matters of consciousness and experience, which the materialists were inclined to treat unproblematically as ‘given’. Against the failings of both the idealists and the materialists, Liebmann could only repeatedly call, “Zurück zu Kant!”\n\nThe 1860’s were a sort of watershed for Neo-Kantianism, with a row of works emerging which sought to move past the idealism-materialism debate by returning to the fundamentals of the Kantian Transcendental Deduction. Eduard Zeller’s (1814-1908) Ueber Bedeutung und Aufgabe der Erkenntnishteorie (1862) placed a call similar to Liebmann’s to return to Kant, maintaining a transcendental realism in the spirit of a general epistemological critique of speculative philosophy. Kuno Fischer’s (1824-1907) Kants Leben und die Grundlagen seiner Lehre (1860), and the second volume of his Geschichte der neuern Philosophie (1860) manifested the same call, too, in what remain important commentaries on Kant’s philosophy. Fischer was at first not so concerned to advance a new philosophical system as to correctly understand the more intricate nuances of the true master. These works gained popular influence in part because of their major literary improvement upon the commentaries of Karl Leonhard Reinhold (1757-1823), but in part also because of the controversy surrounding Fischer’s interpretation of Kant’s argument that space is a purely subjective facet of experience. Worried that the ideality of space led inexorably to skepticism, Friedrich Adolf Trendelenburg (1802-1872) sought to retain the possibility that space was also empirically real, applicable to the things-in-themselves at least in principle. Fischer returned fire by claiming that treating space as a synthetic a posteriori would effectively annul the necessity of Newtonian science, something Fischer emphasized was at the very heart of the Kantian project. Their spirited quarrel, which enveloped a wide circumference of academics over a twenty-year span, climaxed with Trendelenburg’s highly personal Kuno Fischer und sein Kant (1869) and Fischer’s retaliatory Anti-Trendelenburg (1870). Although such personal diatribes attract popular attention, the genuine philosophical foundations of Neo-Kantianism were laid earlier.\n\nHermann Ludwig Ferdinand von Helmholtz (1821-94) outstripped even the scientific credentials of the materialists, combining his experimental research with a genuine philosophical sophistication and historical sensitivity. His advances in physiology, ophthalmology, audiology, electro- and thermo-dynamics duly earned him an honored place among the great German scientists. His Über die Erhaltung der Kraft (1847) ranks only behind The Origin of Species as the most influential scientific treatise of the Nineteenth-Century, even though its principle claim might have been an unattr­­­­ibuted adoption of the precedent theories by Julius Robert von Mayer (1814-1878) and James Joule (1818-1889). His major philosophical contribution was an attempt to ground Kant’s theoretical division between phenomena and noumena within empirically verifiable sense physiognomy. In place of the materialist’s faith in sense perception as a copy of reality and in advance of Kant’s general ignorance about the neurological conditions of experience, Helmholtz noted that when we see or hear something outside us there is a complicated process of neural stimulation. Experience is neither a direct projection of the perceived object onto our sense organs nor merely a conjunction of concept and sensuous intuition, but an unconscious process of symbolic inferences by which neural stimulations are made intelligible to the human mind.\n\nThe physical processes of the brain are a safer starting point, a scientifically-verifiable ground on which to explain the a priori necessity of experience, than Kant’s supra-naturalistic deduction of conceptual architectonics. Yet two key Kantian consequences are only strengthened thereby. First, experience is revealed to be nothing immediate, but a demonstrably discursive process wherein the material affect of the senses is transformed by subjective factors. Second, any inferences that can possibly be drawn about the world outside the subject must reckon with this subjective side, thereby reasserting the privileged position of epistemology above ontology. Helmholtz and the materialists both thought that Newtonian science was the best explanation of the world; but Helmholtz realized that science must take account of what Kant had claimed of it: science is the proscription of what can be demonstrated within the limits of possible experience rather than an articulation about objects in-themselves. Empirical physiognomy would more precisely proscribe those limits than purely conceptual transcendental philosophy.\n\nFriedrich Albert Lange (1828-1875) was, at least in the Nineteenth-Century, more widely recognized as a theorist of pedagogy and advocate of Marxism in the Vereinstag deutscher Arbeitervereine than as a forerunner to Neo-Kantianism. But his influence on the Marburg school, though brief, was incisive. He took his professorship at Marburg in 1872, one year before Cohen completed his Habilitationschrift there. Lange worked with Cohen for only three years before his untimely death in 1875.\n\nMuch of Lange’s philosophy was conceived before his time in Marburg. As Privatdozent at Bonn, Lange attended Helmholtz’s lectures on the physiology of the senses, and later came to agree that the best way to move philosophy along was by combining the general Kantian insights with a more firmly founded neuro-physiology. In his masterpiece, Geschichte des Materialismus und Kritik seiner Bedeutung in der Gegenwart (1866), Lange argues that materialism is at once the best explanation of phenomena, yet quite naïve in its presumptive inference from experience to the world outside us. The argument is again taken from the progress of the physiological sciences, with Lange providing a number of experiments that reveal experience to be an aggregate construction of neural processes.\n\nWhere he progresses beyond Helmholtz is his recognition that the physiognomic processes themselves must, like every other object of experience, be understood as a product of a subject’s particular constitution. Even while denying the given-ness of sense data, Helmholtz had too often presumed to understand the processes of sensation on the basis of a non-problematic empirical realism. That is, even while Helmholtz viewed knowledge of empirical objects as an aggregate of sense physiognomy, he never sufficiently reflected on the conditions for the experience of that very sense physiognomy. So even while visual experience is regarded as derivative from the physiognomy of the eyes, optic nerves, and brain, how each of these function is considered unproblematically given to empirical experience. For Lange, we cannot so confidently infer that our experience of physiognomic processes corresponds to what is really the case outside our experience of them—that the eyes or ears actually do work as we observe them to—since the argument by which that conclusion is reached is itself physiological. Neither the senses, nor the brain, nor the empirically observable neural processes between them permit the inference that any of these is the causal grounds of our experience of them.\n\nWith such skepticism, Lange would naturally dispense, too, with attempts to ground ethical norms in either theological or rationalistic frameworks. Our normative prescriptions, however seemingly unshakeable by pure practical reason, are themselves operations of a brain, which develop contingently over great spans of evolutionary history. That brain itself is only another experienced representation, nothing which can be considered an immutable and necessary basis of which universal norms could be considered derivative. Lange thought this opened a space for creative narratives and even myths, able to inspire rather than regulate the ethical side of human behavior. Through their mutual philology teacher at Bonn, Friedrich Ritschl, Lange was also a decisive influence on the epistemology and moral-psychology of Friedrich Nietzsche.\n\nThe progenitors of Neo-Kantianism, represented principally by Liebmann, Fischer, Trendelenburg, Helmholtz, and Lange, evince a preference for Kant’s theoretical rather than ethical or aesthetical writings. While this tendency would be displaced by both the Marburg school’s social concerns and the Baden school’s concentration on the logic of values, the proto-Neo-Kantians had definite repercussions for later figures like Hans Vaihinger (1852-1933), the so-called empirio-positivists like Richard Avenarius and Ernst Mach, and the founder of the Vienna Circle, Moritz Schlick (1882-1936).\n\n2. Marburg\n\nHerman Cohen (1842-1918) was Lange’s friend and successor, and is usually considered the proper founder of Neo-Kantianism at Marburg. The son of a rabbi in Coswig, he was given a diverse schooling by the historian of Judaism Zacharias Frankel (1801-1875) and the philologist Jacob Bernays (1824-1881). Moving to Berlin, he studied philosophy under Trendelenburg, philology under August Boeckh (1785-1867), culture and linguistics with Heymann Steinthal (1823-1899), and physiology with Emil Du Bois-Reymond (1818-1896). One of his earliest papers, “Zur Controverse zwischen Trendelenburg und Kuno Fischer” (1871), was a sort of coming-out in academic society. Against Fischer, the attempt above all to understand the letter of Kant perfectly –even the problems that persisted in his work—was tantamount to historicizing what ought to be a living engagement with serious philosophical problems. Although roughly on the side of his teacher Trendelenburg, Cohen stood mostly on his own ground in denying that objectivity required any appeal to extra-mental objects. Granted a professorship at the University of Marburg in 1876, Cohen came to combine Kant-interpretation with Lange’s instinct to develop Kant’s thinking in light of contemporary developments: a “Verbindung der systematischen und historischen Aufgabe.” It was Cohen who published Lange’s Logische Studien (1877) posthumously and produced several new editions of his Geschichte des Materialismus. More interested in logic than science, however, Cohen took Lange’s initiatives in a decidedly epistemological direction.\n\nCohen’s early work consists mainly in critical engagements with Kant: Kants Theorie der Erfahrung (1871), Kants Begründung der Ethik (1877), and Kants Begründung der Aesthetik (1889). Where he progresses beyond Kant is most plainly in his attempt to overcome the Kantian dualism between intuition and discursive thinking. Cohen argues that formal a priori laws of the mind not only affect how we think about external objects, but actually constitute those objects for us. “Thinking produces that which is held to be” (Logik der reinen Erkenntnis [Berlin 1902], 67). That is, the laws of the mind not only provide the form but the content of experience, leaving Cohen with a more idealistic picture of experience than Kant’s empirical realism would have warranted. These laws lie beyond, as it were, both Kant’s conceptual categories as well as Helmholtz’s and Lange’s physiognomic processes, the latter of which Cohen considered unwarrantedly naturalistic. The transcendental conditions of experience lay in the most fundamental rules of mathematical thinking, such that metaphysics, properly understood, is the study of the laws that make possible mathematical, and by derivation, scientific thinking. While Cohen did not deny the importance of the categories of the understanding or of the necessity of sensuous processes within experience, his own advancement beyond these entailed that an object was experienced and only could be experienced in terms of the formal rules of mathematics. The nature of philosophical investigation becomes, in Cohen’s hands, neither a physiognomic investigation of the brain or senses as persistent ‘things’ nor a transcendental deduction of the concepts of the understanding and the necessary faculties of the mind, but an exposition of the a priori rules that alone make possible any and every judgment. The world itself is the measure of all possible experience.\n\nThe view had a radical implication for the notion of a Kantian self. Kant never much doubted that something persistent was the fundament on which judgment was constructed. He denied that this thing was understandable in the way either materialism or commonsense presumed, of course, but posited a transcendental unity of apperception as, at least, the logically-necessary ground for experience. Cohen replaces the ‘unity’ of a posited self, and indeed any ‘faculties’ of the mind, with a variety of ‘rules’, ‘methods’, and ‘procedures’. What we are is not a ‘thing’, but a series of logical acts. The importance of his view can be illustrated in terms of Cohen’s theoretical mathematics, especially his notions of continuity and the infinitesimally small. Neither of these is an object, obviously, in the views of materialists or empiricists. And even idealists were at pains to decipher how either could be represented. By treating both as rules for thinking rather than persistent things, Cohen was able to show their respective necessities in terms of what sorts of everyday experiences would be made impossible without them. Continuity becomes an indispensable rule for thinking about any objects in time, while the infinitesimally smallest thing becomes an indispensable rule for thinking about the composition of objects in space. Though a substantial departure from the Kantian ascription of faculties, Cohen never prided himself so much on ascertaining and propagating the conclusions of Kant as on applying Kant’s transcendental method to its sincerest conclusions.\n\nLike his Marburg colleagues, Cohen is sometimes unfairly cast as an aloof logical hair-splitter. Quite the contrary, he was deeply engaged in ethics as well as in the social and cultural debates of his time. His approach to them is also based on a generally Kantian methodology, which he sometimes dubbed a ‘social idealism’. Dismissing the practical and applied aspects of Kant’s ethics as needlessly individualistic psychology, he stressed the importance of Kant’s project of grounding ethical laws in practical reason, therein presenting for the first time a transcendentally necessary ought. This necessity holds for humanity generally, insofar as humanity is considered generally and not in terms of the privileges or disadvantages of particular individuals. Virtues like truthfulness, honor, and justice, which relate to the concept of humanity, thus take priority over sympathy or empathy, which operate on particular individuals and their circumstances. Like both experience and ethical life, civil laws could only be justified insofar as they were necessary, in terms of their intersubjective determinability. Because class-strata effectually inculcate authoritative relationships of power, a democratic –or better— a socialist society that effaced autocratically decreed legal dicta would better fulfill Kant’s exhortation to treat people as ends rather than means, as both legislators and legislated at the same time. However, Cohen thought that then-contemporary socialist ideals put too much stock in the economic aspects of Marx’s theory, and in their place tried to instill a greater concentration on the spiritual and cultural side of human social life. Cohen’s grounding of socialism in a Kantian rather than Marxist framework thus circumvents some of its statist and materialist overtones, as Lange also tried to do in his 1865 Die Arbeiterfrage.\n\nHermann Cohen also remains important for his contributions to Jewish thought. In proportion to his decreasing patriotism in Germany, he became an increasingly unabashed stalwart of Judaism in his later writing, and indeed is still considered by many to be the greatest Jewish thinker of his century. After his retirement from Marburg in 1912, he taught at the Berlin Lehranstalt für die Wissenschaft des Judentums. His posthumous Die Religion der Vernunft aus den Quellen des Judentums (1919) maintains that the originally Jewish method of religious thinking –its monotheism— reveals it as a “religion of reason,” a systematic and methodological attempt to think through the mysteries of the natural world and to construct a universal system of morality ordered under a single universal divine figure. As such, religion is not simply an ornament to society or a mere expression of feelings, but an entirely intrinsic aspect of human culture. The grand summation of these various strands of his thought was to have been collated into a unified theory of culture, but only reached a planning stage before his death in 1918. Even had he completed it, Cohen’s fierce advocacy of socialism and fiercer defense of Judaism, especially in Germany, would have made an already adverse academic life increasingly difficult.\n\nCohen’s student Paul Natorp (1854-1924) was a trained philologist, a renowned interpreter of Plato and of Descartes, a composer, a mentor to Pasternak, Barth, and Cassirer, and an influence on the thought of Husserl, Heidegger, and Gadamer. Arriving at Marburg in 1881, much of Natorp’s career was concerned with widening the sphere of influence of Cohen’s interpretation of Kant and with tracing the historical roots of what he understood to be the essence of critical philosophy. For Natorp, too, the necessity of Neo-Kantian philosophizing lie in overcoming the speculations of the idealists and in joining philosophy again with natural science by means of limiting discourse to that which lay within the bounds of possible experience, in overcoming the Kantian dualism of intuition and discursive thinking.\n\nHowever close their philosophies, Natorp stresses more indelibly the experiential side of thinking than did Cohen’s concentration on the logical features of thought. Natorp saw it as a positive advance on Kant to articulate the formal rules of scientific inquiry not as a set of axioms, but as an exposition of the rules—the methods for thinking scientifically—to the extreme that the importance of the conclusions reached by those rules becomes subsidiary to the rules themselves. Knowledge is an ‘Aufgabe’ or task, guided by logic, to make the undetermined increasingly more determined. Accordingly, the Kantian ‘thing-itself’ ceases to be an object that lies outside possible experience, but a sort of regulative ideal that of itself spurs the understanding to work towards its fulfillment. That endless call to new thinking along specifically ordered lines is just what Natorp means by scientific inquiry—a normative requirement to think further rather than a set of achieved conclusions. Thus, where Kant began with a transcendental logic in order to ground math and the natural sciences, Natorp began with the modes of thinking found already in the experimental processes of good science and the deductions of mathematics as evidence of what conditions are necessarily at play in thinking generally. The necessities of math and science do not rest, as they arguably do for Kant, upon the psychological idiosyncrasies of the rational mind, but are self-sufficient examples of what constitutes objective thinking. Thus philosophy itself, as Natorp conceived it, does not begin with the psychological functions of a rational subject and work towards its products. It begins with a critical observation of those objectively real formations—mathematical and scientific thinking—to ground how the mind itself must have worked in order to produce them.\n\nOne of the consequences of Natorp’s concentration on the continual process of methodological thinking was his acknowledgement that a proper exposition of its laws required an historical basis. Science, as the set of formal rules for thinking, begins to inquire by reflecting on why a thing is, not just that it is. Whenever that critical reflection on the methods of scientific thinking occurs, there ensues a sort of historical rebirth that generates a new cyclical age of scientific inquiry. This reflection, Natorp thought, involves rethinking how one considers that object: a genetic rather than static reflection on the changing conditions for the possibility of thinking along the lines of the continuing progress of science.\n\nPlato’s notion of ideal forms marks the clearest occasion of –to borrow Kuhn’s designation for a similar notion—a paradigm shift. Under Natorp’s interpretation, Plato’s forms are construed not as real subsistent entities that lie beyond common human experience, but regulative hypotheses intended to guide thinking along systematic lines. No transcendent things per se, the forms are transcendental principles about the possibility of the human experience of objects. In this sense, Natorp presented Plato as a sort of Marburg Neo-Kantian avant le lettre, a view which garnered little popularity.\n\nLike Cohen, Natorp also had significant cultural interests, and thought that the proper engagement with Kant’s thought had the potential to lead to a comprehensive philosophy of culture. Not as interested as Cohen in the philosophy of religion, it is above all in Natorp’s pedagogical writings that he espouses a social-democratic, anti-dogmatic ideal of education, the goal of which was not an orthodox body of knowledge but an attunement to the lines along which we think so as to reach knowledge. Education ought to be an awareness of the ‘Aufgabe’ of further determining the yet undetermined. Accordingly, the presentation of information in a lecture was thought to be intrinsically stilting, in comparison to the guided process of a quasi-Socratic method of question and answer. An educator of considerable skill, among his students were Karl Vorländer (1860-1928), Nicolai Hartmann (1882-1950), José Ortega y Gasset (1883-1955), and Boris Pasternak (1890-1960).\n\nErnst Cassirer (1874-1945) is usually considered the last principle figure of the Marburg school of Neo-Kantianism. Entering Marburg to study with Cohen himself in 1896, though he would never teach there, Cassirer adopted both the school’s historicist leanings and its emphasis on transcendental argumentation. Indeed, he stands as one of the last great comprehensive thinkers of the West, equal parts epistemologist, logician, philosopher of science, cultural theorist, and historian of thought. His final work, written after having immigrated to America in the wake of Nazi Germany, wove together Cohen’s defense of Judaism together with his own observations of the fascist employment of mythic symbolism to form a comprehensive critique of the Myth of the State (published posthumously in 1946). His wide interests were not accidental, but a direct consequence of his lifelong attempt to show the logical and creative aspects of human life –the Naturwissenschaften and Geisteswissenschaften— as integrally entwined within the characteristically human mode of mentality: the symbolic form.\n\nCassirer’s earlier historical works adopt the basic view of history promulgated by Natorp. The development of the history of ideas takes the form of naïve progresses interrupted by a series of fundamental reconsiderations of the epistemological methods that gave rise to those progresses, through Plato, Galileo, Spinoza, Leibniz, and Kant. Like Natorp, too, the progress of the history of ideas is, for Cassirer, the march of the problems and solutions constructed by the naturally progressive structure of the human mind. Despite this seemingly teleological framework, Cassirer’s histories of the Enlightenment, of Modernity, of Goethe, Rousseau, Descartes, and of epistemology are generally reliable, lucidly written expositions that aim to contextualize an author’s own thought rather than squeeze it into any particular historiographical framework. A sort of inverse of Hegel, for Cassirer the history of ideas is not reducible to an a priori necessary structure brought about by the nature of reason, but reliable evidence upon which to examine the progression of what problems arise for minds over time.\n\nCassirer’s historicism also led him to rethink Cohen’s notion of the subject. As Cohen thought the self was just a logical placeholder, the subject-term of the various rules of thinking, so Cassirer thought the self was a function that united the various symbolic capacities of the human mind. Yet, that set is not static. What the history of mathematics shows is not a timeless set of a priori rules that can in principle be deciphered within a philosophical logic, but a slow yet fluid shift over time. This is possible, Cassirer argued, because mathematical rules are tied neither to any experience of objects nor to any timeless notion of a context-less subject. Ways of thinking shift over time in response to wider environmental factors, and so do the mathematical and logical forms thereby. Einstein’s relativity theory, of which Cassirer was an important promulgator, underscores Cassirer’s insights especially in its assumption of non-Euclidean geometry. Put into the language of Cassirer’s mature thought, the logical model on which Einsteinian mathematics was based is itself an instantiation not of the single correct outlook on the world, but of a powerful new shift in the symbolic form of science. What Einstein accomplished was not just another theory in a world full of theories, but the remarkably concise formula for a modified way of thinking about the physical world.\n\nThe complete expression of Cassirer’s own philosophy is his three-volume Philosophie der symbolischen Formen (1923-9). In keeping with a general Kantianism, Cassirer argues that the world is not given as such in human experience, but mediated by subject-side factors. Cassirer thought that more complex structures constituted experience and the human necessity to think along certain pre-given lines. What Cassirer adds is a much greater historical sensitivity to earlier forms of human thinking as they were represented in myths and early religious expressions. The more complex and articulate forms of culture –the three major ones are language, myth, and science— are not a priori necessary across time or cultures, but are achieved by a sort of dialectical solution to problems arising when other cultural forms become unsustainable. Knowledge for Cassirer, unlike Natorp, is not so much the process of determination, but a web of psycho-linguistic relations. The human mind progresses over history through linguistic and cultural forms, from the affective expressions of primitives, to representational language, which situates objects in spatial and temporal relations, to the purely logical and mathematical forms of signification. The unique human achievement is the symbolic form, an energy of the intellect that binds a particular sensory signal to a meaningful general content. By means of symbols, humans not only navigate the world empirically and not only understand the world logically, but make the world meaningful to themselves culturally. This symbolic capacity is indeed what separates the human species from the animals. Accordingly, Cassirer saw himself as having synthesized the Neo-Kantian insights about subjectivity with the roughly Hegelian-themed phenomenology of conscious forms.\n\n3. Baden\n\nThe intellectual pride of the Marburg school fostered a prickly relationship with their fellow neo-Kantians. The rivalry developed with the Baden Neo-Kantians (alternately named the “Southwest” school) was not so much a competition for the claim to doctrinal orthodoxy as much as what the proper aims and goals of Kant-studies should be. Although it is a generalization, where the Marburg Neo-Kantians sought clarity and methodological precision, the Baden school endeavored to explore wider applications of Kantian thought to contemporary cultural issues. Like their Marburg counterparts, they concerned themselves with offering a third, critical path between speculative idealism and materialism, but turned away from how science or mathematics were grounded in the logic of the mind toward an investigation of the human sciences and the transcendental conditions of values. While they paid greater attention to the spiritual and cultural side of human life than the Marburg school, they were less active in the practical currents of political activity.\n\nWilhelm Windelband (1848-1915), a student of Kuno Fischer and Hermann Lotze (1817-1881), set the tone of the school by claiming that to truly understand Kant was not a matter of philological interpretation–per Fischer—nor a return to Kant–per Liebmann—but of surpassing Kant along the very path he had blazed. Never an orthodox Kantian, he originally said “Kant verstehen, heißt über ihn hinausgehen.” Part of that effort sprung from Kant’s distinction between different kinds of judgment as being appropriate to different forms of inquiry. Whereas the Marburg school’s conception of logic was steeped in Kant, Windleband found certain elements of Fichte, Hegel, and Lotze to be fruitful. Moreover, the Marburgers too-hastily applied theoretical judgment to all fields of intellectual investigation summarily, and thereby conflated the methods of natural science with proper thinking as such. This effectively relegated the so-called cultural sciences, like history, sociology, and the arts – Geisteswissenschaften – to a subsidiary intellectual rank behind logic, mathematics, and the natural science – Naturwissenschaften. Windelband thought, on the contrary, that these two areas of inquiry had a separate but equal status. To show that, Windelband needed to prove the methodological rigor of those Geisteswissenschaften, something which had been a stumbling block since the Enlightenment. In a distinctly Kantian vein, he was able to show that the conditions for the possibility of judging the content of any of the Geisteswissenschaften took the shape of idiographic descriptions, which focus on the particular, unique, and contingent. The natural sciences, on the other hand, are generalizing, law-positing, and nomothetic. Idiographic descriptions are intended to inform, nomothetic explanations to demonstrate. The idiographic deals in Gestaltungen, the nomothetic in Gesetze. Both are equally parts of the human endeavor.\n\nThe inclination to seek a more multifaceted conception of subjectivity was a hallmark of the Baden Neo-Kantians. The mind is not a purely mathematical or logical function designed to construct laws and apply them to the world of objects; it works in accordance with the environment in which it operates. What is constructed is done as a response to a need generated by that socio-cultural-historical background. This notion was a sort of leitmotif to Windelband’s own history of philosophy, which for the first time addressed philosophers organically in terms of the philosophical problems they faced and endeavored to solve rather than as either a straightforward chronology, a series of schools, or, certainly, a sort of Hegelian conception of a graduated dialectical unfolding of a single grand idea.\n\nHeinrich Rickert (1863-1936) began his career with a concentration on epistemology. Alongside many Neo-Kantians, he denied the cogency of a thing itself, and thereby reduced an ontology of externalities to a study of the subjective contents of a common, universal mind. Having dissertated under Windelband in 1888 and succeeding him at Heidelberg in 1916, Rickert also came to reject the Marburger’s assumption that the methodologies of natural science were the rules for thinking as such. Rickert argued instead that the mind engages the world along the dual lines of Geisteswissenschaften and Naturwissenschaften according to idiographic or nomothetic judgments respectively, the division which Rickert borrowed from his friend Windelband and elaborated upon (although it is sometimes attributed to Rickert or even Dilthey mistakenly). And similar to him as well, Rickert considered it a major project of philosophy to ground the former in a critical method, as a sort of transcendental science of culture. Where Rickert went his own way was in his critique of scientific explanations insofar as they rested on abstracted generalizations and in his privilege of historical descriptions on account of their attention to life’s genuine particularity and the often irrational character of historical change. Where Windelband saw equality-but-difference between the Geistes—and Naturwissenschaften, Rickert saw the latter as deficient insofar as it was incapable of addressing values.\n\nHistory, for Rickert, was the exemplary case of a human science. Historians write about demonstrable facts in time and space, wherein the truth or falsity of a claim can be demonstrated with roughly the same precision as the natural sciences. The relational links between historical events – causes, influences, consequences – rely on mind-centered concepts rather than on observable features of a world outside the historian; though this of itself would not preclude the possibility of at least phenomenal explanations of history. More importantly, historians deal with events which cannot be isolated, repeated, or tested, particular individuals whose actions cannot be subsumed under generalizations, and with human values which resist positive nomothetic explanation. Those values constitute the essence of an historiographical account in a way entirely foreign to the physical sciences, whose objects of inquiry – atoms, gravitational forces, chemical bonds, etc.—remain value-neutral. A historian passes judgment about the successes and failures of policies, assigns titular appellations from Alexander the Great to Ivan the Terrible, decides who is king and who a tyrant, and regards eras as contributions or hindrances to human progress. The values of historians essentially comprise what story is told about the past, even if this sacrifices history’s status as an exact, demonstrable, or predictive science.\n\nRickert’s differentiation of the methods of history and science has been influential on post-modern continental theorists, in part through his friend and colleague, Karl Jaspers (1883-1969), and through his doctoral student, Martin Heidegger (1889-1976). The traditional scientific reliance on a correspondential theory of truth seemed woefully uncritical and thereby inadequate to the cultural sciences. The very form of reality should be understood as a product of a subject’s judgment. However, Rickert’s recognition of this subjective side did not entangle him in value relativism. Although the historian’s values, for example, do indeed inform the account, Rickert also thought that values were nothing exclusively personal. Values, in fact, express proximate universals across cultures and eras. Philosophy itself, as a critical inquiry into the values that inform judgment, reveals the endurance and trans-cultural nature of values in such a way that grounds the objectivity of an historical account in the objectivity of the values he or she holds. That truth is something that ‘ought to be sought’ is perhaps one such value. But Rickert has been criticized for believing that the values of historians on issues of personal ethics, the defensibility of wars, the treatment of women, or the social effects of religion were universally agreed upon.\n\n4. Associated Members\n\nTwentieth-century attempts to categorize thinkers historically into this or that school led to some debate about which figures were ‘really’ Neo-Kantian. But this overlooks the fact that even until the mid-1880’s the term ‘Neo-Kantian’ was rarely self-appellated. Unlike other more tightly-knit schools of thought, the nature of the Neo-Kantian movement allowed for a number of loosely-associated members, friends, and students, who were seekers of truth first and proponents of a doctrine second. Although each engaged the basic terminology and transcendental framework of either Kant or the Neo-Kantians, none did so wholesale or uncritically.\n\nHans Vaihinger (1852-1933) remains arguably the best scholar of Kant after Fischer and Cohen. And he probably maintained the closest ties with Neo-Kantianism without being assimilated into one or the other school. His massive commentary, begun in 1881 and left unfinished due to his health, exposited not only Kant’s work, but also the history of Neo-Kantian interpretation to that point. He founded the Kant-Studien in 1897, which is both the worldwide heart of Kant studies and the model for all author-based periodicals published in philosophy. Vaihinger’s own philosophy, which resonates in contemporary debates about fictionalism and anti-realism, takes as its starting point a curious blend of Kant, Lange, and Nietzsche in his Die Philosophie des Als-Ob (1911). For Vaihinger, the expressions that stem from our subjective makeup render moot the question whether they correspond to the real world. Not only do the concepts of math and logic have a subjective source, as per many of the Neo-Kantians, but the claims of religion, ethics, and even philosophy turn out to be subjectively-generated illusions that are found to be particularly satisfying to certain kinds of life, and thereafter propagated for the sake of more successfully navigating an unconceptualizable reality in-itself. Human psychology is structured to behave ‘as-if’ these concepts and mental projections corresponded to the way things really were, though in reality there is no way to prove whether they do. Freedom, a key notion for Vaihinger, is not merely one side of a misunderstanding between reason and the understanding, but a useful projection without which we could neither act nor live.\n\nWilhelm Dilthey (1833-1911) remains alongside Vaihinger as one of the great patrons of Kant scholarship for his work on the Academy Edition of Kant’s works, which began in 1900. Taught by both Fischer in Heidelberg and Trendelenburg in Berlin, Dilthey was strongly influenced by the hermeneutics of Schleiermacher as well, and entwines his Neo-Kantian denial of material realism with the hermeneutical impulse to see judgment as socio-culturally informed interpretation. Dilthey shares with the Baden school the distinction between nomothetic and idiographic sciences. Where he stresses the distinction, though, is slightly different. The natural sciences explain by way of causal relationships, whereas history makes understood by correctly associating particulars and wholes. In this way, the practice of history itself allows us to better understand the Lebenzusammenhang –how all life’s aspects are interconnected—in a way the natural sciences, insofar as they treat the objects of their study as abstract generalizations, cannot. The natural sciences utilize an abstract Verstand; the cultural sciences use a more holistic way of understanding, a Verstehen.\n\nDespite his shared interest in the conditions of experience, Dilthey is usually not considered a Neo-Kantian. Among several key differences, he rejects the Marburg proclivity to construct laws of thinking and experience that supposedly hold for all rational beings. Their consideration of the self as a set of logico-mathematical rules was an illegitimate abstraction from the really-lived, historically-contextualized human experience. In its place he stresses the ways historicity and social contexts shape the experiences and thinking processes of unique individuals. In distinction from the Baden school, Dilthey rejects Rickert’s theses about both the necessarily phenomenal and universal character of historical experience. Since we have unmediated access to our lived inner life through a sort of ‘reflexive awareness’, our explanations of historical events may indeed require a degree of generalization and abstraction; however, our sympathetic awareness of agent’s motivations and intentions remains direct. That inner world is not representational or inferential, but – contrary to the natural sciences – lived from within our inter-contextualized experience of the world. In this way, Dilthey alsocrossed the mainstay Neo-Kantian position on the role of psychology in the human sciences. It is not a field alongside sociology or economics that requires a transcendental grounding in order to gain a nomothetic status. Psychology is an immediate descriptive science that alone enables the other Geisteswissenschaften to be understood properly as a sort of mediation between the individual and their social milieu. Dilthey thought the results of psychology will, contra Windelband, allow us to move beyond a purely idiographic description of individuals to a law-like (though not strictly nomothetic) typology according to worldviews or ‘Weltanschauungen’.\n\nMax Weber (1864-1920) was a student and friend of Rickert’s in Freiburg, and was also concerned with distinguishing the logic of historical judgment from that of the natural sciences. The past itself contains no intelligibility. Intelligibility is something added by means of the historian’s act of contextualizing an individual in his or her social environment. Unlike Comte (1798-1857), whatever ‘laws’ we might discover in history are really just constructions. And unlike Durkheim (1858-1917), talk of ‘societies’ runs the risk of hypostasizing what is actually a convenient symbol. Social history should instead be about trying to understand the motivations behind individual and particular changes.\n\nThe sociology of Georg Simmel (1858-1918) was also informed by a personal connection to Rickert. From its foundation by Comte and Mill (1806-1873), sociology had been marked by both a positivist theory of explanation-under-law and by an uncritical empiricism. Simmel, with the familiar Neo-Kantian move, undermined their naivety and replaced it with a more careful consideration of how society could be conceived at all. How do individuals relate to society, in what sense does society have a sort of psychology in its own right that generates changes and out of which spiritual shifts emerge, and how do the representational faculties affect societal rituals like money, fashion, and the construction of cities?\n\nTaking history away from its sociological orientation and back to its conceptual roots was Emil Lask (1875-1915). Having dissertated on Fichte under Rickert in 1902 and habilitated on legal theory under Windelband in 1905, Lask was called to Heidelberg in 1910, where his inaugural lecture –“Hegel in seinem Verhältnis zur Weltanschauung der Aufklärung”— intimated a rather different line of influence. His work is comprised of two major published titles: Logik der Philosophie oder die Kategorienlehre (1911) and Lehre vom Urteil (1912). In them, Lask works out an immediate-intuitional theory of knowledge that went beyond the Kantian categories of the understanding of objects into the realm of a logic of values, and even probed the borders of the irrational. In fact he criticized the generalities of the Baden school’s Problemsgeschichte for lacking a concrete grounding in actual historical movements. Although Lask’s insistence to fight on the eastern front in the First World War cut short what should have been a promising career, he had significant influence on German philosophy through Weber, Lukács, and Heidegger. His death, in the same year as Windelband’s, stands as the usual endpoint of the Baden school of Neo-Kantianism.\n\nThe physiognomic leanings of the Neo-Kantian forerunners, like Helmholtz and Lange, were revitalized by a pair of philosophers of considerable scientific reputation. Richard Avenarius (1843-96) and Ernst Mach (1838-1916), founders of empirio-criticism, sought to overcome the idealism-materialism rift in German academic philosophy by closer investigation into the nature of experience. This entailed replacing traditional physics with a phenomenalistic conception of thermodynamics as the model of positivist science. In his Kritik der reinen Erfahrung (1888-90), Avenarius showed that the physiognomic factors of experience vary according to environmental conditions. As the nervous system develops regular patterns within a relatively constant environment, experience itself becomes regularized. That feeling of being accustomed to typical experiences, rather than logical deduction, is what counts as knowledge. Mach was similarly critical of realist assumptions about sensation and experience, positing instead the mind’s inherent ability to economize the welter of experience into abbreviated forms. Although the concepts we use, especially those in the natural sciences, are indispensable for communication and for navigating the world, they cannot demonstrate the substantial objects from which they are believed to be derived.\n\nAlois Riehl (1844-1924) denied Liebmann’s claim that the Kantian thing-in-itself was nothing more than an incidental remnant of enlightenment rationalism. Were it, Riehl argued, Kantianism should give up any pretension to a positive engagement with science. Kant in fact never entirely rejected the possibility of apprehending the thing-in-itself, only the attempt to do so by way of the understanding and reason. It was not inconsistent with Kant to try to articulate noumena mediately, via indirect inferences from their perceptible characteristics in observation. Beyond its spatio-temporal and categorical qualifications, the particular characteristics of an object which we perceive and by which we distinguish it from any other object depend not on us so much, as upon its mode of appearance as it really is outside us.\n\nAlthough Rudolph Otto (1869-1937) taught in Marburg, he had little interest in the logic of mathematics per se. Otto did, however, follow his school’s inclination to understand the objects of study in terms of the transcendental conditions of their experience as fundamental to the proper study, specifically of religion. What Otto discovered thereby was a new kind of experience –the ‘holy’— that was irreducible either to the categories of the understanding or to feeling. This had a substantial influence on the religious phenomenology of two other loosely-associated Neo-Kantian thinkers, Ernst Troeltsch (1865-1923) and Paul Tillich (1886-1965).\n\nWith certain Hegelian overtones, Bruno Bauch (1877-1942) was another fringe member of the Baden school with much to say about religion. While he studied with Fischer in Heidelberg, Rickert in Freiburg, and wrote his Habilitationschrift under Vaihinger in Berlin, he was more concerned than most Badeners with logic and mathematics, and in this respect represents a key link between the Neo-Kantians and both Frege, his confidant, and Carnap, his student. But his views about religion and contemporary politics kept Bauch at considerable distance from mainline Neo-Kantians. Due, in fact to his overt anti-Semitism, he was made to resign his editorship at the Kant-Studien. Having argued that Jews were intrinsically foreign to German culture, his embrace of Nazism during the very period of Cassirer’s emigration was an obvious affront, too, to the legacy of Cohen, whatever honors it may have gained him by the state-run academies.\n\nNicolai Hartmann (1882-1950) began his career as a Neo-Kantian under Cohen and Natorp, but soon after developed his own form of realism. While remaining largely beholden to transcendental semantics, Hartmann rejected the basic Neo-Kantian position on the priority of epistemology to ontology. The first condition for thinking about objects is itself the existence of those objects. It was an error of idealism to assume the human mind constitutes the knowability of those objects and equally the error of materialism to assume that those objects are all open to knowability. To Hartmann, some objects were able to be known by way of their appropriate categorization. Others, however, must remain mysterious, closed off to human inquiry at least until philosophy could point the way toward new methods of comprehending them. Philosophy’s task, accordingly, was to discover the discontinuities between the ‘subjective categories’ of thought and the ‘objective categories’ of reality, and, where possible, to eventually overcome them.\n\nGiven the predominance of Neo-Kantianism in German academies during the turn of the century, a number of fringe-members deserve at least mention here. None can be considered an orthodox ‘Marburg’ or ‘Southwestern’ school Neo-Kantian, but each had certain affinities or at least critical engagements with the general movement. Friedrich Paulsen (1846-1908), Johannes Volkelt (1848-1930), Benno Erdmann (1851-1921), Rudolf Stammler (1856-1938), Karl Vorländer (1860-1928), the Harvard psychologist Hugo Münsterberg (1863-1916), Ernst Troeltsch (1865-1923), the plant physiologist Jonas Cohn (1869-1947), Albert Görland (1869-1952), Richard Hönigswald (1875-1947), Artur Buchenau (1879-1946), Eduard Spranger (1882-1963), and the neo-Friesian Leonard Nelson (1882-1927), who, though more critical than not about Neo-Kantian epistemology, shared certain ethical and social Neo-Kantian themes. There was also significant Neo-Kantian influence on French universities in the same years, with representative figures like Charles Renouview (1815-1903), Jules Lachelier (1832-1918), Émile Boutroux (1845-1921), Octave Hamelin (1856-1907), and Léon Brunschvicg (1869-1944). (For a more detailed look at French Neo-Kantians, see Luft and Capeillères 2010, pp. 70-80.)\n\n5. Legacy\n\nFrom March 17 to April 6, 1929, the city of Davos, Switzerland hosted an International University Course intended to bring together the continent’s best philosophers. The keynote lecturers and subsequent leaders of the famous disputation were the author of the recent Being and Time, Martin Heidegger, and the author of the recent Philosophy of Symbolic Forms, Ernst Cassirer. Heidegger’s contribution was his interpretation of Kant as chiefly concerned with trying to ground metaphysical speculation in what he calls the transcendental imagination through temporally-finite human reason. Cassirer countered by revealing Heidegger’s formulation of that imagination as unwarrantedly accepting of the non-rational. Agreeing that the progress of Kantian philosophy must acknowledge the finitude of human life, as Heidegger held, Cassirer emphasized that beyond this it must retain the spirit of critical inquiry, the openness to natural science, and the clarity of rational argumentation that marked Kant himself as a great philosopher and not only as an intuitive visionary. The Analytic philosopher Rudolf Carnap (1891-1970) was a participant in the Davos congress, and was thereafter prompted to write a highly critical review of Heidegger. What should have been an event that revitalized Neo-Kantianism in contemporary thought became instead the symbol both for the rise of the Analytic school of philosophy and for its cleavage from Continental thought. Increasingly, Cassirer was viewed as defending an unfashionable way of philosophizing, and after he emigrated from Germany in the wake of increasing anti-Jewish sentiment in 1933 the influence of Neo-Kantianism waned.\n\nEven while serious Kant scholarship thrives in the Anglophone world of the early 21st century, Neo-Kantianism remains perhaps the single worst-neglected region of the historical study of ideas. This is unfortunate for Kant studies, since it inculcates an attitude of offhandedness toward nearly a century of superb scholarship on Kant, from Fischer to Cohen to Vaihinger to Cassirer. The Neo-Kantians were also the single most dominant group in German philosophy departments for half a century. Few works of Cohen, Natorp, Rickert, or Windelband have been translated in their entirety, to say nothing of the less prominent figures. Cassirer and Dilthey have attracted the interest of solid scholars, though it tends to be historical and hermeneutical rather than programmatic. Study of Simmel and Weber has been consistently strong, but more for their sociological conclusions than their philosophical starting points. To the rest, it has become customary to attribute a secondary philosophy rank behind the Idealists, Marxists, and Positivists –and even a tertiary one behind the Romantics, Schopenhauer, Nietzsche, and Kierkegaard, none of whom, it may be reminded, held a professorship in the field. It is not uncommon even in lengthy histories of 19th Century philosophy to find their names omitted entirely.\n\nThe reasons for this neglect are complex and not entirely clear. The writing of the Marburg school is dense and academically forbidding, true, but that of Windelband, Cassirer, Vaihinger, and Simmel are quite eloquent. The personalities of Cohen and Rickert were eccentric to the point of unattractive, though Natorp and Cassirer were congenial. Their ad hominem criticisms of rival members seem crass, but such gossip is undeniably salacious as well. Some of their writing was intentionally set against the backdrop of obscure political developments, though often with other figures such obscurities give rise to cottage-industries of historical scholarship (see Willey, 1978). The two World Wars no doubt had a severely negative impact on the continuity of any movement or school, though phenomenology has fared far better. The fact that many of the Neo-Kantians were both social-liberals and Jewish virtually guaranteed their works would be repressed in Hitler’s Germany. Forced resignation and even exile was a reality for many Jewish academics; Cassirer even had his habilitation at Straßburg rejected explicitly on the grounds that he was Jewish. He and Brunschvicg both escaped likely persecution by giving up their homeland. But as the examples of Bauch and Fischer make clear, Neo-Kantianism need not be subsumed under a specifically Jewish or even minimally Semitically-tolerant worldview. And as Cohen’s resurgent legacy in Jewish scholarship proves, not all aspects that were once repressed need forever be.\n\nTo ignore the Neo-Kantians, however, creates the false impression of a philosophical black hole in the German academies between the decline of Hegelianism and the rise of phenomenology, a space more often devoted to anti-academic philosophers like Kierkegaard and Nietzsche. Moreover, the Neo-Kantian influence on 20th century minds from Husserl and Heidegger to Frege and Carnap is pronounced, and should not be brushed aside lightly. In terms of early 21st century philosophy, Neo-Kantianism reminds us of the importance of reflecting on method and of philosophizing in conjunction with the best contemporary research in the natural sciences, something for which Helmholtz, Lange, and Cassirer stand as exemplars. And just as Liebmann’s motto ‘Back to Kant’ was exhorted to bridge the gap between idealism and materialism in the 19th century, so too may it be a sort of third way that rectifies the split between contemporary continental and analytic partisanship. If the old saying still carries water, then “one can philosophize with Kant, or against Kant; but one cannot philosophize without Kant.”\n\nFortunately there are signs of renewed interest. In 2010, Luft and Rudolf Makkreel edited Neo-Kantianism in Contemporary Philosophy (Bloomington, IN: Indiana University Press), which presents a well-rounded contemporary collection of research papers. In Continental Europe, no one has done more to revitalize Neo-Kantian studies than Helmut Holzhey and Fabien Capeillères, who have each published a row of books, editions, and papers on the theme. Under the directorship of Christian Krijnen and Kurt Walter Zeidler, the Desiderata der Neukantianismus-Forschung has hosted a number of congresses and meetings throughout Europe. A 2008 issue of the Philosophical Forum was dedicated to Neo-Kantianism generally, and featured articles by Rolf-Peter Horstmann, Paul Guyer, Michael Friedman, and Frederick Beiser among others. Studies of particular Neo-Kantians have been produced by Poma (1997), Krijnen (2001), Zijderveld (2006), Skildelsky (2008), and Munk (2010). And Charles Bambach (1995), Michael Friedmann (2000), Tom Rockmore (2000), and Peter Eli Gordon (2012) have composed fine works of intellectual history concerning the heritage of Neo-Kantianism in the twentieth century.\n\n6. References and Further Reading\n\na. Principle Works by Neo-Kantians and Associated Members\n\nHelmholtz\n\nÜber die Erhaltung der Kraft (Berlin: G. Reimer, 1847).\n\nÜber das Sehen des Menschen (Leipzig: Leopold Voss, 1855).\n\n\n\nLange\n\nDie Arbeiterfrage in ihrer Bedeutung für Gegenwart und Zukunft (Duisburg: W. Falk & Volmer, 1865).\n\nGeschichte des Materialismus und Kritik seiner Bedeutung in der Gegenwart (Iserlohn: J. Baedeker, 1866).\n\nLogische Studien: Ein Beitrag zur Neubegründung der formalen Logik und der Erkenntnisstheorie (Iserlohn: J. Baedeker, 1877).\n\n\n\nCohen\n\n“Zur Controverse zwischen Trendelenburg und Kuno Fischer,” Zeitschrift für Völkerpsychologie and Sprachewissenschaft 7 (1871): 249–296.\n\nKants Theorie der Erfahrung (Berlin: Dümmler, 1885 [1871]).\n\nDie systematische Begriffe in Kants vorkritische Schriften nach ihrem Verhältniss zum kritischen Idealismus (Berlin: Dümmler, 1873).\n\n“Friedrich Albert Lange,” Preußische Jahrbücher 37 [4] (1876): 353-381.\n\nKants Begründung der Ethik (Berlin: Dümmler, 1877).\n\nKants Begründung der Aesthetik (Berlin: Dümmler, 1889).\n\nDie Religion der Vernunft aus den Quellen des Judentums (Leipzig: Fock, 1919).\n\n\n\nNatorp\n\nForschungen zur Geschichte des Erkenntnisproblems im Altertum: Protagoras, Demokrit, Epikur und die Skepsis (Berlin: Darmstadt, 1884).\n\nPlatos Ideenlehre: Eine Einführung in den Idealismus (Leipzig: Dürr, 1903).\n\nPhilosophische Propädeutik (Marburg: Elwert, 1903).\n\nDie logischen Grundlagen der exakten Wissenschaften (Leipzig: Teubner, 1910).\n\n“Kant und die Marburger Schule,” Kant-Studien 17 (1912): 193-221.\n\nSozialidealismus: Neue Richtlinien sozialer Erziehung (Berlin: Julius Springer, 1920).\n\nCassirer\n\nZur Einsteinschen Relativitätstheorie: Erkenntnistheoretische Betrachtungen (Berlin: Bruno Cassirer, 1921).\n\nPhilosophie der symbolischen Formen, 3 vols. (Berlin: Bruno Cassirer, 1923-9).\n\nSprache und Mythos: Ein Beitrag zum Problem der Götternamen (Leipzig: Teubner, 1925).\n\nIndividuum und Kosmos in der Philosophie der Renaissance (Leipzig: Teubner, 1927).\n\nDie Idee der republikanischen Verfassung (Hamburg: Friedrichsen, 1929).\n\nAn Essay on Man (New Haven, CT: Yale University Press, 1944).\n\nThe Myth of the State (New Haven, CT: Yale University Press, 1946).\n\n\n\n\n\nWindelband\n\nDie Geschichte der neueren Philosophie in ihrem Zusammenhange mit der allgemeinen Cultur und den besonderen Wissenschaften dargestellt, 2 vols. (Leipzig: Breitkopf & Härtel, 1878–80).\n\nPraeludien: Aufsaetze und Reden zur Philosophie und ihrer Geschichte (Freiburg im Breisgau: Mohr, 1884).\n\nEinleitung in die Philosophie: Grundriß der philosophischen Wissenschaften, edited by Fritz Medicus (Tübingen: Mohr, 1914).\n\n\n\nRickert\n\nDer Gegenstand der Erkenntnis: ein Beitrag zum Problem der philosophischen Transcendenz (Freiburg im Breisgau: Mohr, 1892).\n\nDie Grenzen der naturwissenschaftlichen Begriffsbildung, 2 vols. (Tübingen: Mohr, 1896-1902).\n\nKulturwissenschaft und Naturwissenschaft (Freiburg im Breisgau: Mohr, 1899).\n\nDie Heidelberger Tradition und Kants Kritizismus, 2 vols. (Berlin: Junker und Dünnhaupt, 1934).\n\n1934).\n\nDilthey\n\nGesammelte Schriften, 26 vols. (Göttingen: Vandenhoeck & Ruprecht, 1914–2006).\n\n\n\nVaihinger\n\nHartman, Dühring und Lange: Zur Geschichte der deutschen Philosophie im XIX. Jahrhundert (Iserlohn: J. Baedeker, 1876).\n\nKommentar zu Kants Kritik der reinen Vernunft, 2 vols. (Stuttgart: Spemann & Union Deutsche Verlagsgesellschaft, 1881-92).\n\nDie Philosophie des Als Ob (Berlin: Reuther und Reichard, 1911).\n\n\n\nWeber\n\nGesammelte Aufsätze zur Soziologie und Sozialpolitik (Tübingen: Mohr, 1924).\n\n\n\nSimmel\n\nÜber sociale Differenzierung (Leipzig: Duncker & Humblot, 1890).\n\nDie Probleme der Geschichtphilosophie (Leipzig: Duncker & Humblot, 1892).\n\nGrundfragen der Soziologie (Berlin: Göschen, 1917).\n\n\n\n\n\nMach\n\nDie Analyse der Empfindungen und das Verhältnis des Physischen zum Psychischen (Jena: Gustav Fischer, 1886).\n\n\n\nBauch\n\nStudien zur Philosophie der exakten Wissenschaften (Heidelberg: C. Winter, 1911).\n\nWahrheit, Wert und Wirklichkeit (Leipzig: F. Meiner, 1923).\n\n\n\nLask\n\nGesammelte Schriften, 3 vols., edited by Eugen Herrigel (Tübingen: Mohr, 1923-24).\n\n\n\nHartmann\n\nZur Grundlegung der Ontologie (Berlin: Walter De Gruyter, 1935).\n\nb. Secondary Literature\n\nBambach, Charles R., Heidegger, Dilthey and the Crisis of Historicism (Ithaca: Cornell University Press, 1995).\n\nBeiser, Frederick C., The German Historicist Tradition (Oxford: Oxford University Press, 2011).\n\nErmarth, M., Wilhelm Dilthey: The Critique of Historical Reason (Chicago: University of Chicago Press, 1978).\n\nFriedman, Michael, A Parting of the Ways: Carnap, Cassirer, Heidegger (Chicago: Open Court, 2000). Dynamics of Reason: The 1999 Kant Lectures at Stanford University (Chicago: University of Chicago Press, 2001).\n\nGlatz, Uwe B., Emil Lask (Würzburg: Königshausen und Neumann, 2001).\n\nGordon, Peter E., Continental Divide: Heidegger, Cassirer, Davos (Cambridge, MA: Harvard University Press, 2012).\n\nHartmann, E. v., Neukantianismus, Schopenhauerianismus und Hegelianismus in ihrer Stellung zu den philosophischen Aufgaben der Gegenwart (Berlin: C. Duncker, 2 nd expanded edition 1877).\n\nexpanded edition 1877). Heidegger, Martin, “Davoser Disputation zwischen Ernst Cassirer und Martin Heidegger,” in his, Kant und das Problem der Metaphysik (Frankfurt a.M.: Vittorio Klosertmann, 4 th expanded edition 1973), 246-68.\n\nexpanded edition 1973), 246-68. Holzhey, Helmut, Cohen und Natorp, 2 vols. (Basel/Stuttgart: Schwabe & Co., 1986). Historical Dictionary of Kant and Kantianism (Lanham, MD: Scarecrow Press, 2005).\n\nKöhnke, K. C., Entstehung und Aufstieg des Neukantianismus: Die deutsche Universitätsphilosophie zwischen Idealismus und Positivismus (Frankfurt am Main: Suhrkamp, 1986).\n\nKrijnen, Christian, Nachmetaphysischer Sinn: Eine problemgeschichtliche und systematische Studie zu den Prinzipien der Wertphilosophie Heinrich Rickerts (Würzburg: Königshausen & Neumann, 2001).\n\nKrijnen, Christian & Heinz, Marion (eds.), Kant im Neukantianismus (Würzburg: Königshausen & Neumann, 2007).\n\nKülpe, Oswald, The Philosophy of the Present in Germany (New York: Macmillan, 1913).\n\nLuft, Sebastian & Capeillères, Fabien, “Neo-Kantianism in Germany and France,” in The History of Continental Philosophy Volume 3: The New Century, edited by Keith Ansell-Pearson & Alan D. Schrift (Durham: Acumen, 2010), 47-85.\n\nMakkreel, Rudolph, Dilthey: Philosopher of the Human Studies (Princeton: Princeton University Press, 1993).\n\nMakkreel, Rudolph & Luft, Sebastian (eds.), Neo-Kantianism in Contemporary Philosophy (Bloomington, IN: Indiana University Press, 2010).\n\nMunk, Reinier (ed.), Hermann Cohen’s Criticial Idealism (Dordrecht: Springer, 2010).\n\nOllig, Hans-Ludwig, Der Neukantianismus (Stuttgart: Metzler, 1979). Materialien zur Neukantianismus-Diskussion (Darmstadt: Wissenschaftliche Buchgesellschaft, 1987).\n\nPoma, Andrea, The Critical Philosophy of Hermann Cohen (Albany: SUNY Press, 1997).\n\nRockmore, Tom (ed.), Heidegger, German Idealism & Neo-Kantianism (Amherst, NY: Humanity Books, 2000).\n\nSchnädelbach, Herbert, Philosophy in Germany, 1831–1933 (Cambridge: Cambridge University Press, 1984).\n\nSieg, Ulrich, Aufstieg und Niedergang des Marburger Neukantianismus: Die Geschichte einer philosophischen Schulgemeinschaft (Würzburg: Königshausen & Neumann, 1994).\n\nSkidelsky, Edward, Ernst Cassirer: The Last Philosopher of Culture (Princeton, NJ: Princeton University Press, 2008).\n\nWilley, Thomas E., Back to Kant: The Revival of Kantianism in German Social and Historical Thought, 1860-1914 (Detroit: Wayne State University Press, 1978).\n\nZijderveld, Anton C., Rickert’s Relevance: The Ontological Nature and Epistemological Functions of Values (Leiden: Brill, 2006).\n\nAuthor Information\n\nAnthony K. Jensen\n\nEmail: Anthony.Jensen@providence.edu\n\nProvidence College\n\nU. S. A."}, {"url": "https://www.rep.routledge.com/articles/thematic/neo-kantianism/v-2", "page_content": "DOI: 10.4324/9780415249126-DC055-2\n\nVersion: v2, Published online: 2022\n\nRetrieved June 11, 2023, from https://www.rep.routledge.com/articles/thematic/neo-kantianism/v-2\n\nThe term ‘neo-Kantianism’ indicates various attempts at a renewal of Kant’s philosophy in the modern context. It began with the rehabilitation of Kant to overcome the speculative turn of classical German idealism and ground philosophy in the investigation of the conditions of knowledge. In this sense, the origins of neo-Kantianism are sometimes dated back to figures opposing speculative idealism in the early nineteenth-century philosophical landscape, including Johann Friedrich Herbart, Jakob Friedrich Fries, Friedrich Eduard Beneke (Beiser 2014). Philosophers from the next generation sharing the commitment to a Kantian theory of knowledge also include Kuno Fischer, Eduard Zeller, Otto Liebmann, Jürgen Bona Meyer, Friedrich Albert Lange. More specifically, ‘neo-Kantianism’ is used to indicate a philosophical movement developed beginning in the 1870s with the intent to shed light on the basic tenets of Kant’s work and face challenges to traditional philosophy coming from nineteenth-century scientific advancements in the spirit of Kant’s critical philosophy (see, e.g., Köhnke 1991; Patton 2005; Luft 2015). The neo-Kantian movement started with Hermann Cohen’s seminal interpretation of Kant (Cohen 1871a; 1877; 1885), and subsequently flourished in German universities, with two main centres in Marburg, where Cohen was appointed lecturer in 1873, and in South West Germany.\n\nThe development of experimental methods in nineteenth-century life sciences offered important insights for the theory of knowledge, but also raised the question about the possibility of reducing cognitive processes to physical ones. Kant’s critical philosophy offered a powerful argument against materialism, by limiting the validity of causal explanations to the realm of appearances rather than replacing them with metaphysical explanations. In conjunction with the materialism controversy, the 1860s saw a resurgence of interest in classical interpretative issues concerning Kant, including the assumption of a thing in itself, its relation to the sensibility, the status of a priori elements of knowledge. Following a suggestion first made by the physiologist and physicist Hermann von Helmholtz, some of those who argued for a return to Kant believed that Kant’s a priori forms deserved an empirical explanation. In contrast with this, Cohen emphasized that the individuation of a priori elements of knowledge requires a meta-level inquiry into the presuppositions of the sciences, that is, what Kant identified as the transcendental cognition. Cohen took Kant to imply that experience is given in the fact of science, and the transcendental task is to derive the preconditions for the possibility of this fact by regressive analysis. This formulation allowed Cohen to address the controversial issues raised in the Kant scholarship by emphasizing the logical structure of experience, while considering part of Kant’s considerations about the natural sources of knowledge to be a remainder of his reliance on empirical psychology in the precritical period. At the same time, Cohen’s interpretation of Kant set the task of a novel investigation of the historically documented facts of science and culture in the wake of the transcendental method.\n\nCohen’s interpretation set a standard, not only for its contribution to the historical reconstruction of the development of Kant’s thought, but also for the idea of a fruitful correlation between interpretation and philosophical theorizing. In this sense, the revival of Kant’s critical philosophy involved also the idea of a constant renewal of it. Over the next decade, other influential interpretations were developed with various theoretical purposes, from the attempt to integrate the Kantian theory of a priori cognition with insights derived from the empiricist theory of knowledge (Riehl 1876; 1879) to the appreciation of Kant’s attempt to account for the application of universal rules of thought outside the domain of the mathematical science of nature in the third Critique (Windelband 1878–80). The Marburg School formed in the wake of Cohen’s characterization of the transcendental method. Its main representatives were Paul Natorp, who became Cohen’s colleague at Marburg in 1885, and Ernst Cassirer, who studied there from 1896 to 1899, and continued to subscribe to the methodology of his Marburg teachers throughout his intellectual career. The South West German School developed around Wilhelm Windelband’s teaching at the universities of Freiburg from 1877 to 1882, Strasbourg from 1882 to 1903, and Heidelberg from 1903 to 1915. Other leading figures of this school were Heinrich Rickert and his student Emil Lask. There were also neo-Kantians who did not strictly belong to a school or combined neo-Kantianism with other philosophical traditions. This includes, for example, Alois Riehl, Jonas Cohn, Richard Hönigswald.\n\nEach school focused on some common themes. Marburg neo-Kantians gradually broadened the scope of their research from Kant to the philosophical and scientific roots of what they called a critical or scientific form of idealism, according to which the objects of experience are constructed by scientific concepts. They sought to provide an account for the various spheres of human experience by extending the transcendental inquiry from the fact of science to the facts of culture. South West German neo-Kantians focused on the question concerning the grounds for relating unconditionally valid values to contingent experience. This led them to engage in the late nineteenth and early twentieth century debate about the possibility of an autonomous foundation of the human sciences. They pursued the project of a philosophy of culture offering a unitary account of the various human activities from the standpoint of the theory of values. These commonalities notwithstanding, neo-Kantianism was a complex movement, with internal debates and major developments within the same school, as well as connections between different schools and traditions.\n\nNeo-Kantianism dominated the philosophical scene until the early 1910s, and remained in the background of the main philosophical innovations in the German-speaking world for the next two decades until the rise of Nazism. It is considered to have made lasting contribution in epistemology, philosophy of science, history of philosophy and philosophy of culture (see, e.g., Luft and Makkreel 2010; De Warren and Staiti 2015; Edgar and Patton 2018; Kinzel and Patton 2021)."}, {"url": "https://www.rep.routledge.com/articles/thematic/neo-kantianism/v-1", "page_content": "DOI: 10.4324/9780415249126-DC055-1\n\nVersion: v1, Published online: 1998\n\nRetrieved June 11, 2023, from https://www.rep.routledge.com/articles/thematic/neo-kantianism/v-1\n\nIn contrast to earlier research, which chose to distinguish up to seven schools of thought within the field of Neo-Kantianism, more recent scholarship takes two basic movements as its starting point: the Marburg School and the Southwest German School, which are based respectively on systematically oriented works on Kant published during the 1870s and 1880s by Hermann Cohen and Wilhelm Windelband.\n\nCohen held that Kant’s concern in all three Critiques was to reveal those a priori moments which above all give rise to the domains of scientific experience, morality and aesthetics. Windelband on the other hand held that Kant’s achievement lay in the attempt to create a critical science of norms which, instead of giving a genetic explanation of the norms of logic, morality and aesthetics, aimed instead to elucidate their validity. In both approaches, an initial phase during which Kant’s doctrines were appropriated subsequently developed into the production of systems. Thus Cohen published a ‘System of Philosophy’ during the early years of the twentieth century, which consisted of the Logik der reinen Erkenntnis (Logic of Pure Knowledge) (1902), the Ethik des reinen Willens (Ethics of Pure Will) (1904) and the Ästhetik des reinen Gefühls (Aesthetics of Pure Feeling) (1912) and which radicalized the operative approach of his work on Kant. Later, Cohen conceived a Religion der Vernunft aus den Quellen des Judentums (Religion of Reason from the Sources of Judaism) (1919). Windelband, on the other hand, who made a name for himself primarily in the sphere of the history of philosophy, understood philosophy to be essentially concerned with value, anchored in transcendental consciousness. He emphatically linked the classical division of philosophy into logic, ethics and aesthetics to the values of Truth, Goodness and Beauty and also tried to situate the philosophy of religion in this context.\n\nApart from Cohen, the Marburg School is represented by Paul Natorp and Ernst Cassirer, whose early works followed Cohen’s philosophical views (compare Natorp’s interpretation of the Platonic doctrine of ideas and Cassirer’s history of the problem of knowledge), but whose later works modified his approach. Nevertheless, their extensions and developments can also be explained within the framework of the original Marburg doctrines. The ontological turn which Natorp undertook in his later years can be seen as a radicalization of Cohen’s principle of origin, which Natorp believed could not be expressed in terms of pure intellectual positing, and the operative moment introduced by Cohen lives on as a theory of creative formation in Cassirer’s theory of symbolic forms.\n\nIn addition to Windelband, the Southwest German school of Neo-Kantianism is represented by Heinrich Rickert, Emil Lask, Jonas Cohn and Bruno Bauch. Windelband instigated the systematic approach of the Southwest School, but it was left to Rickert to develop it fully. Unlike Windelband, who traced the difference between history and science back to the difference between the idiographic and the nomothetic methods, Rickert distinguished between the individualizing concepts of history and the generalizing concepts of science. During his middle period he turned his attention to the problem of articulating a system of values. In his later works, Rickert also turned towards ontology, a development which should not necessarily be interpreted as a break with the constitutional theories of his early years. In concrete terms, building on his earlier theories concerning the constitutive role of concepts in experience, Rickert henceforth distinguishes not only the realm of scientific and cultural objects and the sphere of values, but also the further ontological domains of the world of the free subject and the metaphysical world, which is the object of faith and which can only be comprehended by thinking in symbols.\n\nLask’s theoretical philosophy was characterized by a turn to objectivism. In contrast to the classical Neo-Kantian conception of knowledge, according to which everything given is determined by the forms of cognition, Lask sees matter as that element which determines meaning. Accordingly, at the centre of his theory of knowledge is not the subject’s activity in constituting the object, but the subject’s openness to the object. In the final stage of his philosophy, however, he once more attributed to the subject an autonomous role in the actualization of knowledge. Cohn contributed to Southwest German Neo-Kantianism not only his Allgemeine Ästhetik (General Theory of Aesthetics) (1901), but also works on the philosophy of culture and education as well as on the systematic articulation of values and the problem of reality. During the 1920s Cohn moved towards dialectics. In contrast to Hegel, however, he understood this to mean critical dialectics inasmuch as it does not aim to sublate or overcome opposition, but merely sets itself the unending task of attempting to resolve irreconcilable contradictions.\n\nFinally, Bauch can be regarded as the most essentially synthetic thinker of the Southwest German Neo-Kantian school. He tried to demonstrate the inseparable connectedness of individual problems which had generally been treated separately. Apart from his great Kantian monographs, these ideas are also put forward in his systematic works on the questions of theoretical and practical philosophy, such as his study Wahrheit, Wert und Wirklichkeit (Truth, Value and Reality) (1923) and his Grundzüge der Ethik (Fundamentals of Ethics) (1935).\n\nDespite the one-sidedness of its reception of Kant’s doctrines, Neo-Kantianism was important for the momentum it gave to research into Kantian philosophy during the twentieth century. Its systematic achievement lies in its development of the normative concept of validity and its programmatic outline for a philosophy of culture."}, {"url": "https://www.encyclopedia.com/humanities/encyclopedias-almanacs-transcripts-and-maps/rickert-heinrich-1863-1936", "page_content": "RICKERT, HEINRICH\n\n(1863 – 1936)\n\nHeinrich Rickert, the German neo-Kantian philosopher, was born in Danzig and received his degree in 1888 from the University of Strasbourg. In 1891 he began lecturing at Freiburg, succeeding Alois Riehl as professor in 1894. In 1916 he went to Heidelberg as successor to Wilhelm Windelband.\n\nRickert belonged to the southwestern school of neo-Kantianism. His main efforts were devoted to a study of the logical and epistemological foundations of the natural sciences and to the historical disciplines in the hope of arriving at a \"unity of reality and values.\" He departed from Wilhelm Dilthey in his criticism of Dilthey's subjective approach to the understanding of historical reality and in his attempt to find a set of more objective criteria; his departure from Windelband consisted in rejecting Windelband's separation of natural and historical disciplines and offering instead a theory that considered all reality to be historical.\n\nPhilosophy and Natural Science\n\nIn his early work, particularly in Der Gegenstand der Erkenntnis (Freiburg, 1892), Rickert raised the question of the relationship between philosophy and the natural sciences. He denied the universal validity of the method of the natural sciences and attempted to establish the primacy of practical reason as the foundation of his epistemology. He believed that only the Kantian critical method is adequate for explaining the epistemological presuppositions and limitations of the various sciences. While phenomenology may provide a method for describing the contents of consciousness, it fails to account for their intelligibility and relationship to objective reality. Hegelianism, on the other hand, in identifying the real with the rational, leaves out of account or distorts the pluralistic character of reality. Only critical philosophy yields knowledge that is both universal and necessary; it alone can explain the pluralistic, dynamic, and yet rational character of society and history. In view of the lack of philosophical attention to the historical disciplines and because the then prominent philosophical problems of Weltanschauung seemed to hinge most directly on distinguishing scientific thinking from historical thinking, Rickert devoted himself thereafter primarily to the problem of historical conceptualization (Begriffsbildung ).\n\nIndividualizing and Generalizing Thought\n\nOn the basis of Windelband's distinction between nomothetic (universal) and ideographic (particular) judgments, Rickert developed his logic of the historical disciplines. At both the scientific and the prescientific stages of conceptualization, he claimed, there are two ways of grasping reality: individualizing and generalizing. Individualizing thought is proper to historical thinking. Instead of fabricating a copy of a historical phenomenon in its complex totality, it establishes the essential relationships that bind the phenomenon to its environment and traces the various stages of its development. Philosophy studies the concept of development, while the objects of historical study are unique developments. Generalizing thought, therefore, is proper to the natural sciences but is inapplicable to history. \"Reality,\" Rickert claimed, \"becomes nature if we consider it in regard to what is general; it becomes history if we consider it in regard to the particular or individual\" (Kulturwissenschaft und Naturwissenschaft, 5th ed., p. 63).\n\nHistorical method for Rickert is highly selective, and in the selection of data, value judgments are operative from the very outset. This being the case, the determination of value criteria (Wertbegriffe ) becomes the primary concern of historical understanding. Generalizing thought is logically free of values (wertfrei ) because it constructs universally valid concepts. The particular objects to which they apply are interchangeable, and each object, abstracted from all its other relationships, functions only to illustrate the general law. Although in generalizing thought a selective process is at work to determine the common character of a group of particulars, it is the common character, expressed in a formula, that is essential. The aim of generalizing thought is precisely to free its objects from relations of value (Wertverbindungen ).\n\nKulturwissenschaft\n\nAlthough history is a science of values, this does not mean that the historian may organize his inquiry arbitrarily; in that case history would be mere propaganda. In order for history to be objective, its values (state, law, art, religion) must be universal. The universality of historical values must be established epistemologically, and the relevance of the various social phenomena with respect to these values must be demonstrated empirically. Because history is written by, about, and for civilized men, social activity must be its subject matter. Since social activity can be grasped only by individualizing thought in terms of its significance for universal values, the historian's criterion must be culture, because social activity and value most nearly converge in culture. Culture is most directly concerned with the realization of universal values: \"Culture is the common affair in the life of the nations; it is the possession with respect to the values of which the individuals sustain their significance in the recognition of all peoples, and the cultural values which adhere to this possession are therefore those which guide historical representation and conceptual formation in the selection of what is most essential\" (Die Grenzen der naturwissenschaftlichen Begriffsbildung, 2nd ed., p. 509). Thus, believing that his method made of history a logically valid discipline that deals with objective reality, Rickert called the historical sciences Kulturwissenschaft (cultural science) in preference to Dilthey's term, Geisteswissenschaft (science of the mind or spirit).\n\nUniversal History\n\nFar from being a contradiction, universal history is not only possible but is the logical outcome of the search for the value principles (Wertprinzipien ) according to which the historical process as a whole may be viewed. \"The system of values provides the possibility of systematization, and the relationship [of history] to the system of values permits of individualizing treatment\" (\"Geschichts-philosophie,\" p. 400). But precisely because the evaluation of the whole of history is involved, the system of value principles must be purely formal. \"We would need something timeless in order to extract an objective sense from the temporal course of history\" (ibid., p. 418). Like Immanuel Kant, Rickert proposed three stages in the development of civilization: dogmatism, skepticism, and criticism, the last of which was the achievement of German idealistic philosophy. While this periodization cannot be verified empirically, it is an example of the critical approach to the question of the unity of historical development. Although it is purely theoretical, it nonetheless gives an axiological grounding to the results of empirical research. In the last analysis, the problem of universal history is to introduce a method whereby the real and the ideal may be theoretically synthesized.\n\nCriticism\n\nThe principal criticism brought against Rickert is that the introduction of a transcendental system of values is unhistorical and leads to the reification of existing values (Wertabsolutierung ). In isolating universality by viewing it as a distinct realm of thought rather than as a function of all thought, Rickert actually confirmed the positivism and cultural relativism he had sought to overcome. In radically separating the universal from the particular, he was compelled to regard historical data as being identical with those of science, a series of discrete facts that differ only in the relationships in which they are observed. Nevertheless, the fruitfulness of Rickert's theory is borne out by his influence on such contemporaries as Ernst Troeltsch, Friedrich Meinecke, and Max Weber.\n\nSee also Dilthey, Wilhelm; Geisteswissenschaften; Hegelianism; Historicism; Meinecke, Friedrich; Neo-Kantianism; Phenomenology; Philosophy of History; Riehl, Alois; Troeltsch, Ernst; Weber, Max; Windelband, Wilhelm.\n\nBibliography\n\nworks by rickert\n\nDie Grenzen der naturwissenschaftlichen Begriffsbildung. Tübingen: Mohr, 1896–1902; 2nd ed., Tübingen, 1913.\n\nKulturwissenschaft und Naturwissenschaft. Tübingen, 1899; 5th ed., Tübingen, 1921.\n\nDie Probleme der Geschichtsphilosophie. Leipzig: Duncker and Humblot, 1905; 3rd ed., Heidelberg: C. Winter, 1924.\n\n\"Geschichtsphilosophie.\" In Die Philosophie im Beginn des zwanzigsten Jahrhunderts, Festschrift für Kuno Fischer, edited by Wilhelm Windelband. Heidelberg, 1907.\n\nKant als Philosoph der modernen Kultur. Tübingen: Mohr, 1924.\n\nworks on rickert\n\nBecher, E. Geisteswissenschaften und Naturwissenschaften. Munich: Duncker and Humblot, 1921.\n\nCohen, M. R. \"The Insurgence against Reason.\" Journal of Philosophy 22 (1925): 120–123.\n\nCollingwood, R. G., A. E. Taylor, and F. C. S. Schiller. \"Are History and Science Different Kinds of Knowledge?\" Mind 31 (1922): 426–466.\n\nFaust, A. Heinrich Rickert und seine Stellung innerhalb der deutschen Philosophie der Gegenwart. Tübingen: Mohr, 1927.\n\nFederici, F. La filosofia dei valori de Heinrich Rickert. Florence, 1933.\n\nGurvitch, Georges. \"La théorie des valeurs de Heinrich Rickert.\" Revue Philosophique 124 (1937): 80–85.\n\nTroeltsch, Ernst. \"Über den Begriff einer historischen Dialektik. Windelband-Rickert und Hegel.\" Historische Zeitschrift 119 (1919): 373–426.\n\nRobert Anchor (1967)"}, {"url": "https://plato.stanford.edu/entries/neo-kantianism/notes.html", "page_content": "Notes to Neo-Kantianism\n\n1. There were, of course, other members of the two schools. For reasons of space, this article covers only Cohen, Natorp, Cassirer, Windelband, Rickert, and Lask.\n\n2. Please note that this article concerns what might be called “classical” Neo-Kantianism: the self-identified philosophical schools of late nineteenth and early twentieth century Germany centered around Marburg and southwestern Germany. Many philosophers are “neo-Kantian” in the broader sense that they draw significant inspiration from aspects of Kant’s philosophy: for instance, earlier nineteenth century philosophers such as Herbart or Schopenhauer were neo-Kantian in this broad sense, as were other philosophers contemporary with the classical Neo-Kantians—for instance, Hans Vaihinger or Wilhelm Dilthey in Germany, Alois Riehl in Austria, Émile Boutroux or Léon Brunschvicg in France, and Robert Adamson or T.H. Green in Britain. There are principled reasons, articulated in section 1 of this article, for distinguishing the classical Neo-Kantians of the Marburg and SW schools from “neo-Kantians” in this broader sense. An article on neo-Kantianism in this broad sense would almost constitute a complete history of philosophy from Kant up into the twentieth century.\n\n3. Indeed, as Friedman (2000) argues, Neo-Kantianism is the common root out of which both the so-called “analytic” and “continental” traditions grew.\n\n4. Though the Southwest and Marburg Neo-Kantians did not initially present themselves as part of a common movement, this tendency softened among “third generation” Neo-Kantians, i.e., the Neo-Kantians contemporary with Cassirer and Lask. For instance, the Neo-Kantians Bruno Bauch, Jonas Cohn, and Richard Hönigswald all freely borrowed from both schools and did not emphasize the differences between the schools so strongly.\n\n5. Citing the writings of the Neo-Kantians presents some serious challenges, since few of the key works have been translated in full into English, and many of these works went through many editions, which often differ significantly from one another. To address these difficulties, the following conventions are adopted. Whenever possible, passages are cited by section number or chapter (which are usually common between editions) instead of by page number. When citing page numbers, citations are from English translations whenever an English translation is listed in Bibliography. Otherwise, the page citation is to the original language edition cited in the Bibliography (unless an original language passage is being cited that is not translated in the listed translation: such cases are noted as they arise). Translations are from the cited translations, unless otherwise noted. Whenever possible, texts with English translations are referenced over texts that currently lack English translations, in order to aid the Anglophone reader. In particular, this entry aims to refer as much as possible to English-language editions that are widely available, such as the texts collected in the Neo-Kantian Reader [abbreviation: NKR] (Luft 2015).\n\n6. As Neo-Kantians were quick to point out, this is just Kant’s old point: there is a difference between a question of fact (quid facti) and a question of justification (quid juris), between an empirical deduction that shows how we humans come to acquire some representation and transcendental deduction that shows its justification (Kant 1781/7: A84-5/B116-7). (Citations to Kant 1781/87 are according to the pagination in the first (“A”) and second (“B”) edition. Page references to Kant’s other works are to the pagination in the Akademie [Ak] edition: Kant 1902–.)\n\n7. In this respect, the Neo-Kantians followed the lead of Kant himself. In the first Critique, Kant himself characterized mathematics not in terms of its object (number and extensive magnitude), but in terms of its method (the construction of concepts). In the third Critique, Kant claims that biology is unique because of its method: the use of teleological judgments. And according to the Metaphysical Foundations of Natural Science, physics is distinctive because it delivers properly scientific knowledge by allowing for the right kind of application of mathematics.\n\n8. In this way, again, they were following Kant, whose argument in the first Critique for the objective validity of the categories utilized a more general account of the objective validity of all knowledge.\n\n9. After his retirement from Marburg in 1912, Cohen wrote a series of books in the philosophy of religion, articulating a vision of Judaism as a “religion of reason”, an “ethical monotheism”. Cohen’s book The Religion of Reason Out of the Sources of Monotheism (1919) is perhaps the most significant book in Jewish thought written in the nineteenth and twentieth centuries, and is surely (in terms of intellectual and real world impact) the most significant book produced by the Marburg Neo-Kantians. But its relations to the core doctrines of the Marburg school are indirect, and so it is not discussed in this article.\n\n10. The academic fate of the Marburg School, unfortunately, was significantly impacted by the rising tide of German anti-Semitism. Cohen was an observant Jew, and his promotion in Marburg in 1876 was made possible by a brief window of tolerance in German politics. The Marburg School was often subjected to thinly-veiled, and often even overt, anti-Semitic attacks. As institutional anti-Semitism hardened, Cohen had more difficulty placing his students, to the point that Cassirer had to struggle to find an institution that would accept his two volume Problem of Knowledge as a Habilitation. He eventually habilitated in Berlin, but was prevented from holding a professorship until after the war, when official discrimination was lessened in the Weimar Republic. (Because Cassirer was unable to hold a professorship, Hans Reichenbach, who took courses with him and always considered him his teacher, was forced to officially submit his dissertation under a different supervisor outside of Berlin.) Cassirer finally held a position in Hamburg in 1919, and indeed was the rector of the university in 1929–30, the first Jewish rector of a German university. But all of this collapsed in 1933 when Hitler was appointed Chancellor, and Cassirer was forced to flee the country.\n\n11. In keeping with the Marburg tendency, the progressive development of culture is understood very abstractly, and not as historical or temporal. Natorp’s model is the progression from a number to its successor in the natural number sequence: the progression is not temporal or arbitrary, but is grounded in a law, i.e., the axioms of arithmetic (1910: Ch.1, §5).\n\n12. There are a few reasons for this distinctive method. First, the transcendental method requires an initial stage of “data collection”, in which the goal is to lay out the detailed, concrete features of some area of culture, along with its historical development. To give systematic philosophical theories without first canvassing the history of the topic would amount to trying to carry out the second step of the transcendental method without the first. Second, the transcendental method prescribes that philosophical reflection not be done in isolation from the facts of culture. For this reason, the Marburg philosophers were keen to show that the core doctrines of past philosophers were in fact developed in continual conversation with other areas of culture, in particular with natural science. This way of doing history of philosophy—where the history of philosophy and the history of science are presented together as one narrative—culminated in Cassirer’s Problem of Knowledge. Third, the transcendental method (unlike the method of speculative idealism) is not foundationalist, but requires that philosophical reflection start up only after an area of culture has reached a stage of maturity where it can be self-reflective. Philosophy, then, always begins “in the middle”.\n\n13. In his later book on quantum mechanics, Determinism and Indeterminism in the Philosophy of Physics, Cassirer argues (1936: Ch.12) that the real philosophical significance of QM is not its conflict with an alleged classical conception of causality, but rather its requirement that we rethink what it is to be an individual particle in a determinate state (and thus rethink the concepts substance and accident), given superposition and Heisenberg uncertainty.\n\n14. Cohen (1898) recognized this possibility in his discussion of Hertz, since he allows that all three of the rival foundations for mechanics are equally consistent with the empirical data. Cassirer (1921: 354) later cited Einstein’s special theory and Lorentz’s theory as rival theories, the choice of which could not be decided on the basis of experiments alone.\n\n15. Interestingly, Cassirer argues (1921: Ch.2) that Einstein’s principle of general covariance is supported by such a regulative principle. By requiring that the laws of nature be the same for any observer, whether the observer be at rest, undergoing inertial motion, or even accelerated motion, Einstein’s theory accords with the general demand that scientific laws be “de-anthropologized” and thus made fully objective (see Ryckman 2005: 45).\n\n16. Lask self-consciously aligned himself with the Southwest school, and defended their core commitment, that the subject matter of philosophy is validity. However, he was in many ways an internal critic, who incorporated many of the ideas of Husserl’s Logical Investigations (Husserl 1900). See below, section 3.2.\n\n17. Rickert put this idea more sharply by distinguishing two kinds of generality of values. A value is “factually general” if it is held by all humans (or all members of the relevant community); a value is normatively general if its “recognition is in fact required of all members of a certain community” (Rickert 1902: 376).\n\n18. In Rickert’s The Object of Knowledge (Rickert 1915: 47, Chapter I, §7: “Das erkenntnistheoretische Subjekt”), and in Windelband’s later writings (1910: 319), the notion of a “normal” consciousness is expressed using Kant’s famous phrase “consciousness in general” from the Prolegomena (Kant 1783: §20; Ak 4:300). There, Kant argued that there is a difference between “judgments of perception”, which are subjectively valid and express only a consciousness of my own state, and “judgments of experience”, which are objectively valid and express a connection “in consciousness in general”. Rickert and Windelband self-consciously echo this argument, interpreting Kant’s distinction as a fact/value distinction: consciousness in general is what ought to be judged, not what in fact I do judge.\n\n19. This claim that every universally valid norm has an a priori basis is made the defining feature of Neo-Kantianism in Anderson 2005. It may be more accurate to restrict this to SW Neo-Kantianism, since the fact/value distinction is not thematized by the Marburg Neo-Kantians. This defining claim can again be extracted from Kant’s discussion of “consciousness in general”, given the SW Neo-Kantians’ reading of this as a normative consciousness. In Prolegomena §20, Kant argues that the ascent from consciousness of my own state to consciousness in general requires certain special a priori concepts, the categories. SW Neo-Kantianism takes on this idea as well, again interpreted normatively.\n\n20. Lask is echoing Kant’s famous analogy between what Copernicus accomplished in astronomy and what he takes himself to have accomplished in metaphysics: Kant 1781/7: Bxvi–xvii.\n\n21. Rickert replies to this criticism from Lask in Rickert 1915: 282.\n\n22. An excellent presentation and interpretation of Lask’s very difficult theory is Emundts 2008.\n\n23. Since truth becomes a kind of correspondence, Lask holds that there needs to be some way of cognizing the object, prior to the act of judging, which furnishes that against which the content of the judgment can be compared. This kind of cognition, which is passive and prior to any act of judging, Lask calls “Hingabe” [abandonment] (Lask 1912: 135, Ch.2, §2). In so doing, Lask is rejecting a fundamental Neo-Kantian commitment that all cognizing is judging. (Compare Rickert 1915: 168: “Erkennen ist immer Urteilen”.) In accepting the correspondence theory in Die Lehre vom Urteil, Lask is also departing from his own view in Lask 1911, where he rejected the correspondence theory.\n\n24. On this issue: see Beiser 2014a: Ch.4. On the place of SW Neo-Kantianism in this debate, and for an excellent treatment of the philosophy of history of SW Neo-Kantians, see Beiser 2011:, Chs. 9–11.\n\n25. Of course, Windelband (as well as Rickert) were quite clear that a historian conducting her research will need to make use of general propositions from nomothetic sciences, just as nomothetic scientists can make use of results of idiographic sciences and can even make claims about singular things (e.g., the Milky Way, the Triassic period). Nevertheless, there is still a fundamental difference in the goals of the two kinds of sciences.\n\n26. Windelband’s resistance to this positivist reductionism is another example of the non-revisionism intrinsic to the transcendental method: recognizing the autonomy of history is simply recognizing the way the best contemporary historians were in fact doing their research.\n\n27. Windelband’s claim that psychology is nomothetic is opposed to the Marburg view that psychology is the science of the subjective, and so is not nomothetic. On the Marburg view of psychology, see the Supplement, Philosophy of Psychology in the Marburg School.\n\n28. On the debate between Dilthey and Windelband and Rickert, see Makkreel 2010 and Makkreel & Luft 2010. Partially in response to Windelband’s criticisms, Dilthey 1894 introduces his well-known distinction between explanation and interpretation (or understanding), arguing that the Geisteswissenschaften depend, not on “mechanical” psychology, which “explains” mental phenomena in the nomothetic way Windelband identified, but on “descriptive” psychology, which “interprets” or “understands” some mental phenomenon. This view is like the SW view, in distinguishing history from the natural sciences in terms of a distinctive method. For Rickert’s criticism of this more mature Diltheyan position, see Rickert 1902: 369.\n\n29. Here, Rickert is drawing on the view that the content of an intuition is always potentially infinitely complex, and it is the work of a concept to select out (in accordance with certain a priori norms) certain features. See section 3.2.\n\n30. Rickert also clearly articulated two other senses of “generality” that are at play in the formation of the concepts of history. The concept of Caesar, though it only applies to one individual, Caesar, is nevertheless composed of general concepts (such as being Roman, being a soldier, being assassinated). The concept of Caesar ought also be integrated into a more “general” historical nexus, say, through showing its relation to the concept of the Late Roman Empire. In this sense, one historical individual, Caesar, is part of a larger historical individual, the Late Roman Empire.\n\n31. Rickert makes his point with some care. Of course, even natural scientists are sensitive to values, inasmuch as they are concerned with truth; but only in history do we form concepts constrained by those features of a subject that are value-relevant. Furthermore, the historian is making theoretical claims, not aesthetic or practical claims. Everyone can agree that Goethe is a historical individual, and that certain facts about him are historically relevant, whether or not one happens to like his poetry, approve of his character, or even have any personal attachment to German culture. The historian qua historian does not make determinate value judgments about her subjects. (Still less should historians argue that history acts teleologically to realize certain values, such as freedom, reason, or the will of God.)"}, {"url": "https://www.encyclopedia.com/philosophy-and-religion/philosophy/philosophy-terms-and-concepts/neo-kantianism", "page_content": "NEO-KANTIANISM\n\n\"Neo-Kantianism\" is a term used to designate a group of somewhat similar movements that prevailed in Germany between 1870 and 1920 but had little in common beyond a strong reaction against irrationalism and speculative naturalism and a conviction that philosophy could be a \"science\" only if it returned to the method and spirit of Immanuel Kant. These movements were the fulfillment of Kant's prophecy that in a hundred years his philosophy would come into its own.\n\nBecause of the complexity and internal tensions in Kant's philosophy, not all the Neo-Kantians brought the same message from the Sage of Königsberg, and the diversity of their teachings was as great as their quarrels were notorious. At the end of the nineteenth century the Neo-Kantians were as widely separated as the first-generation Kantians had been at its beginning, and the various Neo-Kantian movements developed in directions further characterized by such terms as Neo-Hegelian and Neo-Fichtean. But whereas G. W. F. Hegel, Friedrich Schelling, Johann Gottlieb Fichte, and others had used the words of Kant while being alien to their spirit, the Neo-Kantians were, on the whole, faithful to the spirit while being revisionists with respect to the letter. Attempting to legitimize their revisions by the ipsissima verba of Kant, they established the craft of \"Kant-philology\" and began an analysis of Kant's texts that had not been equaled in microscopic punctiliousness except in the exegesis of the Bible and of a few classical authors. Hans Vaihinger's immense commentary on the first seventy pages of the Critique of Pure Reason (Commentar zu Kants \"Kritik der reinen Vernunft, \" 2 vols., Berlin and Leipzig, 1881–1893) is an exemplar of this craft and industry.\n\nNeo-Kantianism grew out of the peculiar social-cultural situation of German science and philosophy, and in turn it constituted a new academic situation with many characteristics of a long intellectual fad. Most of the groups of Neo-Kantians had their own journals—the Philosophische Arbeiten at Marburg, Logos at Heidelberg, the Annalen der Philosophie und philosophischer Kritik of Vaihinger, and the Philosophische Abhandlungen at Göttingen. (Kant-Studien, like the Kant Gesellschaft, was open to all.) Doctrines were known by the names of the universities where they originated; men entered and left the movement as if it were a church or political party; members of one school blocked the appointments and promotions of members of the others; eminent Kant scholars and philosophers who did not found their own schools or accommodate themselves to one of the established schools tended to be neglected as outsiders and contemned as amateurs. As many as seven distinct schools have been described by historians, but they do not agree on the programs, heresies, and bona fide membership of each school.\n\nThe Beginnings\n\nSo far as an intellectual movement can be said to have a beginning at a specific moment of time, Neo-Kantianism began with the publication at Stuttgart in 1865 of Otto Liebmann's Kant und die Epigonen, whose motto—\"Back to Kant!\"—has become famous. German philosophy was generally weak toward the middle of the nineteenth century; there was less interest in it, and less ability among its practitioners, than at perhaps any other time in modern German history. Earlier in the century, when Kant's philosophy had been submerged first in the great idealistic systems and then in those of nature-philosophy, there had been modest calls for a return to Kant (for instance, by I. H. Fichte, the son of J. G. Fichte, and by Ernst Reinhold, the son of K. L. Reinhold) as a means of escape from the kinds of philosophy that Kant would have held to be impossible and that seemed more and more to offer nothing of value to German cultural life as a counterbalance to the materialism attendant upon the flourishing of natural science, technology, and national economy. However, in the decade preceding Liebmann's book there had been signs of change.\n\nzeller and fischer\n\nEduard Zeller (1814–1908), in his Heidelberg lecture, Ueber Bedeutung und Aufgabe der Erkenntnistheorie (published Heidelberg, 1862), called for a return to epistemology; and this, he spelled out explicitly, meant a return to Kant. Kuno Fischer (1824–1907), the greatest historian of philosophy at that time and the teacher of Liebmann, Johannes Volkelt, and Wilhelm Windelband, in 1860 published a monumental book on Kant (Kants Leben und die Grundlagen seiner Lehre, Mannheim and Heidelberg) that presented, in a form still useful although outmoded in details, a picture of Kant that could not but excite interest in and study of Kant. In 1865 Fischer initiated a great controversy with Adolf Trendelenburg on the proper interpretation of Kant's theory of space; this controversy mobilized most of the philosophical public in Germany on one side or the other, including Trendelenburg's pupil Hermann Cohen, who had hitherto concentrated mostly on Plato.\n\nhelmholtz and lange\n\nTwo other men, Hermann von Helmholtz and F. A. Lange, almost simultaneously with Liebmann made their spiritual pilgrimage to Königsberg.\n\nHelmholtz\n\nHermann von Helmholtz (1821–1894), then Germany's greatest scientist, had been arguing for years for a view whose origin he found in Kant. The doctrine of specific energies of sensory nerves had led him to a theory of the subjectivity of sensory qualities, which he regarded as signs of unknown objects interacting with our sense organs; he then extended this commonly held view to the conclusion that space itself is dependent upon our bodily constitution. This theory made it possible for Helmholtz to argue that there could be alternative spaces and geometries, each appropriate to a particular kind of nervous apparatus and necessary to the being so constituted, but none of them picturing the real structure of the world. Thus, while Helmholtz gave up Kant's theory of the unique status of Euclidean geometry, he held that his own theory of space was in keeping both with Kant's theory and with the most modern work in mathematics, physics, and physiology. Moreover, in his theory of unconscious inferences he accepted the Kantian theory that perception involves judgment. The guiding principle in such unconscious inference is the a priori principle of causation, which extends our knowledge no further than possible experience, but gives us the right to posit unknown causes of our sensations. Helmholtz vigorously rejected metaphysics but extolled philosophy as an ancilla to science. Both the strengths and the obvious weaknesses of Helmholtz's Kantianism were effective in making a return to Kant seem fruitful to science, for it meant that the greatest of German thinkers could be used on the side of science, against metaphysics.\n\nLange\n\nThe year 1866 saw the publication of Friedrich Albert Lange's Geschichte des Materialismus (Iserlohn and Leipzig; translated by E. C. Thomas as History of Materialism, 3 vols., London, 1877–1879). Lange, who was born in 1828 and died, while professor of philosophy at Marburg, in 1875, wrote his massive but readable book to point out the metaphysical mysteries and pretensions of materialism, which traditionally claimed to be only a courageous but unspeculative extension of the results of science into regions previously occupied only by theology and superstition. Like Helmholtz, Lange held that the sensible world is a product of the interaction between the human organism and an unknown reality. The world of experience is determined by this interaction, but the organism itself is only an object of experience, and it is to be understood by psychology and physiology. Causality, needed in all such sciences, is a mode of thought necessary to a mind constituted like ours; processes and principles of thought have physiological bases. Thus, materialism (although a phenomenal materialism, since matter itself is only a phenomenon) is the most likely truth about reality so far as it can be known. But what of Kant's intelligible world? Lange completely rejected Kant's teaching of the rational necessity of the structure of an intelligible but unknowable world; he held that our views of it are only products of poetic fancy (Dichtung ). While Lange defended materialism as a doctrine of reality (phenomena) that serves as a bulwark against theology and metaphysics, he held that because knowledge is not man's whole goal, Dichtung is also important. \"Man needs to supplement reality [about which materialism is the best truth we know] with an ideal world of his own creation,\" and this is a world of value \"against which neither logic nor touch of hand nor sight of eye can prevail\" (History of Materialism, Vol. III, pp. 342 and 347).\n\nTwo things stand out in the works of these precursors—if not direct progenitors—of Neo-Kantianism. Their Kantianism was exclusively theoretical, oriented entirely around the Critique of Pure Reason and neglectful or disdainful of Kant's practical philosophy. This puts them in the line of development of German positivism, a line that goes from them through Alois Riehl and the fictionalist Hans Vaihinger to Ernst Mach and Moritz Schlick. Their Kantianism was also psychological and even physiological—the a priori elements they acknowledged were dependent upon the human constitution; the transcendental and logical aspects of Kant's work were neglected or rejected. In this respect they were followed by Hans Cornelius (1863–1947) and by Richard Hönigswald (1875–1947), a pupil of Riehl.\n\nMetaphysical Neo-Kantianism\n\nTheoretical and physiological Kantianism was in the air when the twenty-five-year-old Liebmann published his manifesto. Kant und die Epigonen argued that Kant made one great mistake: believing in the existence of the thing-in-itself. This belief, however, was not an essential part of Kant's doctrine, but only a dogmatic residue that could be removed without damage to the rest of the system. However, Fichte, Schelling, Hegel, Jakob Friedrich Fries, Johann Friedrich Herbart, and Arthur Schopenhauer either did not recognize the belief that there is a thing-in-itself as an error (for instance, Schopenhauer) or, while recognizing it as an error, made analogous errors in their efforts to correct it (Fichte's transcendental ego is as unknowable and unthinkable as the thing-in-itself). The weaknesses thus introduced into their systems were fatal, since they depended upon a concept that Kant had only inadvertently admitted. Hence, none of them could be followed; one had to return to their common source, remove its error, and apply this improved Kantianism to present problems.\n\nWhile Liebmann's first book showed remnants of a psychological interpretation of Kant, his next book, Zur Analysis der Wirklichkeit (Strasbourg, 1876) argued for a strictly transcendental \"logic of facts\" whose inspiration was as much Spinozistic as Kantian. In this book Liebmann stood close to the Marburg school, at least in his conclusions. However, in his later Gedanken und Tatsachen (2 vols., Strasbourg, 1882–1901) he admitted the need and argued for the possibility of a \"critical metaphysics\" as a \"rigorous consideration of human views and hypotheses about the essence of things,\" growing out of \"deep-rooted, ineradicable spiritual needs and intellectual duty\" (ibid., 2nd ed., Vol. II, p. 113). His critical metaphysics makes hypotheses about the transcendent and the unknowable, but leaves open a field for value decisions that do not depend on claims to valid knowledge, but only on our wills as they are nurtured by culture. In this line of thought Liebmann seemed to draw closer to the Heidelberg school, but even in his earlier work there were anticipations of Windelband's famous analysis of the differences between historical and scientific knowledge.\n\nriehl\n\nLess openly metaphysical than Liebmann's was the realistic Neo-Kantianism of Alois Riehl (1844–1924). In contrast to Liebmann, Riehl insisted that Kant held to the real existence of things-in-themselves and that this concept is essential to Kant's—and to any sound—theory of knowledge. He asserted that Kant proved only that things-in-themselves cannot be known by pure reason, not that they are not known mediately in sense perception. Phenomena are simply their modes of appearance; they are not in a different ontological realm, but are merely actualizations of their Aristotelian potentialities in the context of a mind. The laws of the organization of phenomena are transcendentally (not psychologically) based on the activity of self-consciousness; their specific characteristics depend on the reality of that of which they are appearances. All knowledge is or can become scientific; philosophy is nothing but a theory of science; metaphysics is \"an opiate of the mind.\"\n\nNevertheless, Riehl believed it both unavoidable and legitimate to reason hypothetically from phenomena to reality, for metaphysical hypotheses cannot be entirely excluded from science itself. He argued, for instance, for a double-aspect psychophysical theory of the relationship between mind and the world, for a partial duplication of phenomenal laws in the real world, and for complete determinism. The tone of his philosophy, however, was somewhat positivistic; he said he acknowledged \"the metaphysical\" but not \"metaphysics.\" With wissenschaftliche (scientific) philosophy he contrasted unwissenschaftliche philosophy, or classical speculative metaphysics, which he rejected; and with both he contrasted nichtwissenschaftliche philosophy as a practical discipline for the realization of humanly created values (Wertbegung and Geistesführung ). In his later life he was most concerned with the latter.\n\nother metaphysical interpretations\n\nAnother realistic metaphysical interpretation of Kant was given by the Kant philologist Erich Adickes (1866–1928) in his Kants Lehre von der doppelten Affektion unseres Ich (Tübingen, 1929).\n\nOther attempts at \"critical metaphysics\" on a Kantian basis were made by Johannes Volkelt (1848–1930) and by Friedrich Paulsen (1846–1908). The former's Kants Erkenntnistheorie (Leipzig, 1879) and the latter's Entwicklungsgeschichte der Kantischen Erkenntnistheorie (Leipzig, 1875) tried to show that Kant himself was an idealistic metaphysician malgré lui. Later works designed to bring out the metaphysics in Kant were by Max Wundt (Kant als Metaphysiker, Stuttgart, 1924), Heinz Heimsoeth (articles collected in Studien zur Philosophie Immanuel Kants, Cologne, 1956), and Gottfried Martin (Kant, Ontologie und Wissenschaftslehre, Cologne, 1951; translated by P. G. Lucas as Kant's Metaphysics and Theory of Science, Manchester, U.K., and New York, 1955). Martin Heidegger's Kant und das Problem der Metaphysik (Bonn, 1929; translated by J. S. Churchill as Kant and the Problem of Metaphysics, Bloomington, IN, 1962) presented an extreme form of this view but falls outside the scope of Neo-Kantian intentions.\n\nMarburg Neo-Kantianism\n\nBy the standards of recent philosophy Marburg Neo-Kantianism, or panlogistic transcendental philosophy, was no less metaphysical, but by the standards of the time its orientation around the \"fact of science\" seemed to make it at least antispeculative. In launching the journal of the Marburg school, Hermann Cohen and Paul Natorp wrote: \"Whoever is bound to us stands with us on the foundation of the transcendental method.… Philosophy, to us, is bound to the fact of science, as this elaborates itself. Philosophy, therefore, to us is the theory of the principles of science and therewith of all culture\" (Philosophische Arbeiten, Vol. I, No. 1, 1906).\n\nhermann cohen\n\nHermann Cohen (1842–1918), a younger colleague of Lange's at Marburg, rejected the naturalism he believed to be inherent in the Kantianism of Helmholtz, Lange, and Liebmann. They were wrong in thinking philosophy should begin with an analysis of consciousness and should show how conscious human beings apply concepts to the data of sensation in order to produce phenomenalistic world pictures that are distinguished from things as they are. The fact to be understood is not this highly dubious psychological process; the fact is science itself and, in ethics, it is not human motives and aspirations and feelings of duty but the fact of civil society under law as constructed in the science of jurisprudence. Kant himself had tried to understand \"the fact of science and culture,\" but he failed to separate this fact from dubious psychological and phenomenological facts he seemed to be dealing with.\n\nLogic for Cohen is not at all psychologistic; it is not even formal. The very notion of formal logic presupposes something not formal: data drawn from some other source, be it pure intuition or perception. Logic, as Cohen saw it, is the logic of knowledge, not the logic of empty thought; it is the logic of truth, in which any assertion gains its status as true solely by virtue of its systematic position in a body of universal laws that, in turn, require each other on methodological grounds. Thought, Cohen taught, accepts nothing as given and is not true of anything independent of it—certainly not of intuitional data, as Kant believed. Thought generates content as well as form, and the content of self-contained thought is reality itself as object and goal of knowledge. This extravagant panlogism was based on Cohen's ingenious interpretation of the history of the differential calculus, which he saw as the logic of mathematical physics. Not number and not observed motion, as Kant believed, are given as raw data to science; rather, the mathematical differential, which is not given at all but is created by thought, is the necessary device for the creation of nature as object of possible experience: \"This mathematical generation of motion [by integration of the derivative] and thereby nature itself is the triumph of pure thinking\" (Logik der reinen Erkenntnis, Berlin, 1902, p. 20). Through an interpretation of Kant's teachings concerning intensive magnitudes of sensations, Cohen saw in the method of the calculus a paradigm of the category of origin (Ursprung ) and the logical process of production (Erzeugung ) to which every fact owes its reality; that is, its position in a logically necessary scheme.\n\nThrough the work of thought on its own materials, Cohen believed he could dispense with all independent givens in knowledge. Nothing is given (gegeben ); all is problematic (aufgegeben ). Fact is that which is completely determined by thought. The thing-in-itself is not a thing at all. It does not exist, but is only a thought of a limit (Grenzbegriff ) to our approach to a complete determination of things as they are; that is, as they would fully satisfy systematic thought.\n\nCohen's pupil Ernst Cassirer spoke of him as \"one of the most resolute Platonists that has ever appeared in the history of philosophy.\" When Cohen said, for example, \"Thinking itself produces what is to be held to be\" (ibid., p. 67; cf. p. 402), he was not speaking of thought as a process in an individual. \"Thought\" is not the name of a process, but refers only to the corpus of the unending history of science. To be, then, is to be thought, but not to be thought in somebody's consciousness; to be thought means to be asserted under valid and immanent a priori principles that inescapably determine the unique structure of mathematical physics. Cohen was as much of a dogmatist as Kant himself with regard to the structure of science.\n\nThe original stages of Cohen's teachings are found in his three commentaries on Kant (Kants Theorie der Erfahrung, Berlin, 1871; Kants Begrundung der Ethik, Berlin, 1877; Kants Begrundung der Aesthetik, Berlin, 1889), one on each Critique. They are continuous criticisms of all of Kant's \"givens\"; for example, experience, intuition, categories, duty, things-in-themselves. The final stages are contained in his three systematic works (Logik der reinen Erkenntnis, Berlin, 1902; Ethik des reinen Willens, Berlin, 1904; Aesthetik des reinen Gefühls, 2 vols., Berlin, 1912), which parallel the three Critiques. At its midpoint Cohen's thought was close to the contemporary rejections of psychologism by Alexius Meinong and Edmund Husserl; at its end it would have taken only the \"bathos of experience,\" to use Kant's words, to change it, in principle, into a kind of positivism or even historicism.\n\nnatorp\n\nThe principal thinker among the second generation of Marburg Neo-Kantians was Paul Natorp (1854–1924). It fell to him to deal with the new developments in science (especially the theory of relativity, in his Die logischen Grundlagen der exakten Wissenschaften, Leipzig, 1910) by penetrating to a deeper level of methodology than Cohen could reach in his own work, which was largely restricted to classical mathematics and physics.\n\nMore important, it was Natorp's task to introduce the whole field of psychology into the body of knowledge considered and understood in Cohen's way, and thereby to fill the lacuna Cohen left between Bewusstsein überhaupt (consciousness in general, the \"fact\" of science) and the limited individual human consciousness. Natorp's Einleitung in die Psychologie (Freiburg, 1888) and his Allgemeine Psychologie nach kritischer Methode (Tübingen, 1912) attempted, first, to apply Cohen's transcendental method to psychology instead of leaving it exposed to the naturalistic methods of Cohen's and Natorp's rivals, such as Riehl. In this attempt Natorp came close to results like those of Wilhelm Dilthey without, he thought, having to draw his relativistic, skeptical, and historicistic conclusions. And, second, these books attempted to bridge the gap between the objective world of phenomena and the nonphenomenal, nonnatural self that possessed the knowledge of the phenomenal world. Cohen had moved so far from Kant toward Hegel that it was for him an almost insignificant accident that individual men and women know anything; Bewusstheit (known-ness), not Bewusstsein (consciousness), was important for him. Natorp had to undertake another almost Copernican revolution against objective panlogism without at the same time naturalizing the knowing subject, which would have led to relativism and skepticism.\n\nHe performed the first part of his task by the classical Kantian move of seeing empirical ego and empirical object as standing in a necessary correlation with each other, not as independent phenomena; the latter part he accomplished by insisting that the pure ego cannot be an object—it is as much a Grenzbegriff as the thing-in-itself. For Natorp the objective and the subjective were not two realms, either opposed to each other or one including the other. Rather, they were two directions of knowledge, objectification and subjectification, each starting from the same phenomenon and each employing the transcendental method of categorial constitution, resolution into Ursprung and Erzeugung. Just as Cohen's antipsychologistic panlogism had brought him close to Husserl's Logische Untersuchungen, Natorp's linking of psychology and panlogism brought him close to Husserl's Ideen ; and it is easy to see how Nicolai Hartmann, Natorp's pupil, could move over into the phenomenological camp (J. Klein, \"Hartmann und die Marburger Schule,\" in Nicolai Hartmann, der Denker und sein Werk, by Heinz Heimsoeth and Robert Heiss, Göttingen, 1952).\n\ncassirer\n\nThe last great representative of Marburg Neo-Kantianism was Ernst Cassirer (1874–1945), whose works on the philosophy of science continued the line of argument initiated by Natorp and show some close resemblances to positivism. Cassirer's most important contribution, however, was to extend the Marburg conception of Erzeugung to the whole range of human culture (language, myth, art, religion, statecraft), ending not in panlogism but in \"pansymbolism.\"\n\nOther important Marburg Neo-Kantians were Rudolf Stammler (1856–1938) in the philosophy of law; Karl Vorländer (1860–1928), the historian of philosophy and the leading Kantian socialist (Kant und der Sozialismus, Berlin, 1900; Kant und Marx, Tübingen, 1911); Artur Buchenau (1879–1946), Albert Görland (1869–1952), and Arthur Liebert (1878–1946). A moderate form of Marburg Neo-Kantianism is represented in America by W. H. Werkmeister (The Basis and Structure of Knowledge, New York, 1948).\n\nG Ö ttingen Neo-Kantianism\n\nIn strong reaction against Marburg there arose, at the beginning of the twentieth century, the Neo-Friesian school in Göttingen, under the leadership of Leonard Nelson (1882–1927). Jakob Friedrich Fries (1773–1843) had interpreted Kant psychologically, not transcendentally; in this he was followed by Jürgen Bona Meyer (1829–1897) in his Kants Psychologie (Berlin, 1870). Lange and Helmholtz were psychologistic in their Kantianism, taking the results of experimental psychology as having a bearing on the a priori. Nelson, on the contrary, professed to avoid psychologism and its attendant skepticism by using psychological introspection to discover the principles of experience in the spontaneity of reason; these principles could then be deduced (in the Kantian sense) from the analysis of experience into its necessary conditions. In this, Nelson developed the views of Fries, whom he defended against the accusation of psychologism, and opposed the psychological or physiological interpretations of the experimental and empirical psychologists.\n\nKant's transcendental deduction was regarded by Nelson as circular if it was meant as a proof; it began with the experience (science, mathematics, morality) it was meant to justify. The circle might have been broken by Kant's subjective deduction, but this was jettisoned in the second edition of the Critique. Nelson proposed to reestablish it, or rather to put his own deduction into its place. Upon introspection, we find principles we know immediately to be true and that we hold by a Cartesian-like \"principle of the self-confidence of reason.\" The discovery of these self-evident principles is a psychological process; the principles, however, are not psychological but metaphysical in Kant's sense; that is, as a priori synthetic truths based on concepts, not on intuition. They are shown to be the same as those uncovered by a transcendental analysis of science and ordinary experience. (In ethics Nelson followed an analogous procedure.) In this way Nelson thought he could use psychology without falling prey to either naturalism or skepticism. A good example of his method is to be found in the well-known Das Heilige (Gotha, 1917; translated by J. W. Harvey as The Idea of the Holy, New York, 1958) by Nelson's colleague Rudolf Otto. Nelson never had the influence in Germany that was enjoyed by many other Neo-Kantians, although he was revered by many disciples in fields related to philosophy. There has recently been an increased interest in his work, and several English translations have appeared.\n\nHeidelberg Neo-Kantianism\n\nThe Heidelberg school of Neo-Kantianism, led by Windelband and Heinrich Rickert, was not restricted to the University of Heidelberg, and is sometimes known as the Baden school or the Southwest German school of Neo-Kantianism. Wilhelm Windelband (1848–1915) was the most eminent historian of philosophy of his time, with the possible exception of Dilthey. Like Dilthey, he did not succeed in working out a complete system of philosophy, but certain of his ideas were decisive for the more systematic work of his followers in Heidelberg. His most characteristic doctrine was that the epistemological problem is really a problem in axiology; a judgment is known to be true not by comparison with an object (thing-in-itself) but by its conformity to an immediately experienced obligation to believe it. The teaching for which Windelband is chiefly remembered, however, was his distinction between natural and historical sciences as nomothetic and ideographic (law-giving and picturing the unique individual), respectively. The elaboration of these two points led to the systematic priority of axiological criteria to epistemological criteria, to the theory of the parallelism of norms and cultural consciousness, and to efforts to develop a Kantian categorization of historical and cultural experience.\n\nrickert\n\nThe great system builder of the Heidelberg school was Heinrich Rickert (1863–1936), professor in Freiburg and then Windelband's successor in Heidelberg. Rickert, like Windelband, regarded judging as a form of valuing, truth being the value intended by this act. There are two realms of objects that may be judged; that is, that are objects of knowledge—the sensible world of science (about which Rickert accepted most of Kant's views) and an intelligible world of nonsensuous objects of experience that we know not by perception but by understanding (Verstehen ). These latter are cultural objects (history, art, morality, institutions). Although not reducible to sense and thus not under the categories of nature, they are not metaphysical but are within experience and correspond, roughly, to Hegel's objective spirit. Both cultural objects and nature, as objects, require (in the Kantian manner) a correlative subject that cannot be objectified. This is \"the third realm of being,\" which Rickert calls \"pro-physical\"; it is Kant's transcendental ego and Hegel's subjective spirit. There is a fourth realm of being, the metaphysical proper, which is only an object of faith (in the Kantian sense) and which we refer to in religion and in the transition from scientific philosophy to Weltanschauung.\n\nBy keeping the ethical \"this side\" of the division between the experiential and the metaphysical, Rickert was able to bring about a closer liaison between the theoretical and the practical than Kant had established. The primacy of practical reason does not, for Rickert, mark the supremacy of valuing over knowing, but signifies the valuational dimension of knowing itself. Autonomy is thus the basis not only of ethics but also of thought even in science. Rickert criticized the Kantian conception of experience as too thin; not only nature, but also history, must be categorized out of the heterogeneous continuum of data, and from these categorizations arise the nomothetic and ideographic disciplines. In all these points Rickert was under the influence of both Fichte and Hegel, but his conceptual framework remained Kantian: a transcendental nonobjectifiable basis (realm 3) for experience (realms 1 and 2) and an unknown realm of objects of faith (realm 4).\n\nothers\n\nOther important Heidelberg Neo-Kantians were Hugo Münsterberg (1863–1916), Jonas Cohn (1869–1947), Bruno Bauch (1877–1942; Wahrheit, Wert und Wirklichkeit, Leipzig, 1923), and Richard Kroner (Von Kant bis Hegel, 2 vols., Tübingen, 1921–1924). Kroner's Kant's Weltanschauung (Tübingen, 1914, translated by J. E. Smith, Chicago and Cambridge, U.K., 1956) is the only presentation in English of the characteristic Heidelberg interpretation of the historical Kant.\n\nSociological Neo-Kantianism\n\nSeveral philosophers close to Lebensphilosophie and concerned with the methodology of the Geisteswissenschaften were influenced by Kant's doctrine that we categorially construct the world of experience and that speculative metaphysics is impossible as science, but instead of having theories concerning the transcendental origin of the structural factors, they found the origin of the world of experience in the social situation. The most important of these philosophers were Wilhelm Dilthey (1833–1912), who is not usually characterized as a Neo-Kantian although Kantian elements are present in his thought, and Georg Simmel (1858–1918).\n\nAt various times Simmel took different attitudes toward, or at least emphasized different aspects of, Kantianism—the psychologistic and pragmatic, the transcendental, and the sociohistorical. He held that categories develop in the course of history, and that the structures of Hegel's objective spirit are historical products that cannot be taken ready-made for analysis in the Marburg manner. \"[Even] the kind of science humanity has at any given moment depends upon the kind of humanity it is at that moment\" (Hauptprobleme der Philosophie, Leipzig, 1910, Ch. 1). Because forms cannot be discerned except in the specific contents in which they appear, no categorial system is capable of structuring all experience. Different types of individuals have different styles for this structuring, and cultures are identified by their production of specific a priori forms for knowledge, the experience of values, and images of the world as a whole (systems of metaphysics).\n\nBetween the Heidelberg tradition and the Dilthey-Simmel position there were Max Weber (1864–1921) and Eduard Spranger. Neo-Kantian elements in the sociology of knowledge are especially clear in the works of Max Adler (Das Soziologische in Kants Erkenntniskritik, Vienna, 1924) and Karl Mannheim (1893–1947).\n\nWindelband said, \"To understand Kant means to go beyond Kant.\" Most of the philosophers dealt with here did go beyond Kant, and their later works contained little that was specifically Kantian. Even the movements as a whole were more explicitly Kantian in their early periods than in their later ones. All this was to be expected of active and creative minds and groups. By the end of World War I, Neo-Kantianism as an institution ceased to be a dominant force in German intellectual life, partly through the death of most of its leaders and partly through defection. Rapid changes in logic and natural science favored the more pragmatic systems of positivism in Berlin, Prague, and Vienna; the greater experiential resources of phenomenology favored the rival school in Freiburg, Munich, and Cologne; the German cultural crisis called for Lebensphilosophie and speculative metaphysics. None of these movements, however, was free of Kantian elements, which might not have been passed on to them but for the Neo-Kantians' rediscovery of Kant. Their Neo-Kantian heritage has given repeated confirmation of an aphorism attributed to Liebmann: \"You can philosophize with Kant, or you can philosophize against Kant, but you cannot philosophize without Kant.\"\n\nSee also Cassirer, Ernst; Causation: Philosophy of Science; Cohen, Hermann; Dilthey, Wilhelm; Fichte, Johann Gottlieb; Fischer, Kuno; Fries, Jakob Friedrich; Hegel, Georg Wilhelm Friedrich; Heidegger, Martin; Helmholtz, Hermann Ludwig von; Herbart, Johann Friedrich; Hönigswald, Richard; Husserl, Edmund; Irrationalism; Kant, Immanuel; Kantian Ethics; Lange, Friedrich Albert; Liebert, Arthur; Liebmann, Otto; Logical Knowledge; Mach, Ernst; Mannheim, Karl; Materialism; Meinong, Alexius; Natorp, Paul; Nelson, Leonard; Otto, Rudolf; Paulsen, Friedrich; Positivism; Psychologism; Rationalism in Ethics; Reinhold, Karl Leonhard; Rickert, Heinrich; Riehl, Alois; Schelling, Friedrich Wilhelm Joseph von; Schlick, Moritz; Schopenhauer, Arthur; Simmel, Georg; Spranger, (Franz Ernst) Eduard; Vaihinger, Hans; Weber, Max; Windelband, Wilhelm.\n\nBibliography\n\nStudies of and works by individual Neo-Kantians are listed in the respective articles. There is very little material in English on Neo-Kantianism, but see Ernst Cassirer, \"Neo-Kantianism,\" in Encyclopaedia Britannica, 14th ed. (1930), Vol. XVI, pp. 215–216; and R. B. Perry, Philosophy of the Recent Past (New York: Scribners, 1926), pp. 145–160. A complete history is being written by Mariano Campo; Vol. I of his Schizzo storico della esegesi e critica kantiana (Varese, 1959) covers the period up to about 1900. The most complete study, with excellent bibliographies, is K. Oesterreich in Friedrich Überwegs Grundriss der Geschichte der Philosophie, 12th ed. (Berlin, 1923), Vol. IV, pp. 410–483.\n\nG. Lehmann reports the beginnings of the movement in \"Kant im Spätidealismus und die Anfänge der neukantischen Bewegung,\" in Zeitschrift für philosophische Forschung 17 (1963): 438–457; see also his \"Voraussetzungen und Grenzen der systematischen Kantinterpretation,\" in Kant-Studien 49 (1957): 364–388.\n\nGood comparative studies of Neo-Kantianism are included in Wolfgang Ritzel, Studien zum Wandeln der Kantauffassung (Meisenheim, 1952) and H. Levy, Die Hegel-Renaissance in der deutschen Philosophie (Charlottenburg, Germany: R. Heise, 1927). Johannes Hessen, Die Religionsphilosophie des Neukantianismus (Freiburg: Herder, 1924) gives a Catholic criticism.\n\nAuthoritative presentations of two school programs are Paul Natorp, Kant und die Marburger Schule (Berlin, 1912; also in Kant-Studien 17 [1912]: 193–221) and Heinrich Rickert, Die Heidelberger Tradition und Kants Kritizismus (Berlin, 1934). The posthumously published (and incomplete) work by H. Dussort, L'école de Marburg (Paris, 1963) is excellent on the movement up through Cohen.\n\nother recommended sources\n\nAdair Toteff, Christopher. \"Neo-Kantianism: The German Idealism Movement.\" In The Cambridge History of Philosophy 1870–1945, edited by Thomas Baldwin. Cambridge, U.K.: Cambridge University Press, 2003.\n\nBrandist, Craig. \"Two Routes 'To Concreteness' in the Work of the Bakhtin Circle.\" Journal of the History of Ideas 63(3) (2002): 521–537.\n\nHallberg, Fred W. \"Neo-Kantian Constraints on Legitimate Religious Beliefs.\" American Journal of Theology and Philosophy 16(3) (1995): 279–298.\n\nKröhnke, Klaus C. The Rise of Neo-Kantianism: German Academic Philosophy Between Idealism and Positivism, translated by R. J. Hollingdale. New York: Cambridge University Press, 1991.\n\nLuthe, Rudolf. \"The Development of the Concept of Concrete Subjectivity from Kant to Neo-Kantianism.\" Journal of the British Society for Phenomenology 13 (1982): 154–167.\n\nLewis White Beck (1967)"}, {"url": "https://www.rep.routledge.com/articles/thematic/neo-kantianism/v-2/bibliography/neo-kantianism-bib", "page_content": "Bauch, B. (1907) ‘ Erfahrung und Geometrie in ihrem erkenntnistheoretischen Verhältnis ’, Kant-Studien 12: 213–235. (Offers a neo-Kantian account of the relation between geometry and experience in the light of modern axiomatics.)\n\nBeiser, F. (2011) The German Historicist Tradition, Oxford: Oxford University Press. (A helpful introduction to the late nineteenth and early twentieth century debate about historical science and the relation between history and philosophy.)\n\nBeiser, F. (2014) The Genesis of Neo-Kantianism, 1796–1880, Oxford: Oxford University Press. (A reconstruction of the genesis of neo-Kantianism dating back to the German empiricist tradition of Herbart, Fries, and Beneke.)\n\nBiagioli, F. (2016) Space, Number, and Geometry from Helmholtz to Cassirer, Cham: Springer. (Discusses the neo-Kantian debate on the Kantian theory of space and the foundations of geometry.)\n\nCassirer, E. (1902) Leibniz’ System in seinen wissenschaftlichen Grundlagen, Marburg: Elwert. (Cassirer’s interpretation of Leibniz as a precursor of critical idealism.)\n\nCassirer, E. (1906) Das Erkenntnisproblem in der Philosophie und Wissenschaft der neueren Zeit, vol. 1, Berlin: B. Cassirer. (Cassirer’s study of the history of the problem of knowledge and the relation between philosophy and the sciences in the early modern period.)\n\nCassirer, E. (1907a) Das Erkenntnisproblem in der Philosophie und Wissenschaft der neueren Zeit, vol. 2, Berlin: B. Cassirer. (Contains Cassirer’s discussion of the Kantian theory of space and time, and a defence of Cohen’s reading of Kant.)\n\nCassirer, E. (1907b) ‘Kant und die moderne Mathematik’, Kant-Studien 12, 1–40. (Presents the idea of a new investigation of the conditions of knowledge in the light of the fact of modern mathematics.)\n\nCassirer, E. (1910) Substanzbegriff und Funktionsbegriff. Untersuchungen über die Grundfragen der Erkenntniskritik, Berlin: B. Cassirer; trans. W.C. Swabey and M.C. Swabey, Substance and Function & Einstein’s Theory of Relativity, Chicago: Open Court, 1923. (Cassirer’s interpretation of Marburg neo-Kantian epistemology offering an account of scientific concept formation modelled on the mathematical concept of function.)\n\nCassirer, E. (1912) ‘ Hermann Cohen und die Erneuerung der Kantischen Philosophie ’, Kant-Studien 17: 252–273; trans. L. Patton, ‘Hermann Cohen and the Renewal of Kantian Philosophy’, in Luft (2015), pp. 221–235. (An accessible introduction to the transcendental method and to the main tenets of the critical idealism shared by Marburg neo-Kantians.)\n\nCassirer, E. (1918) Kants Leben und Lehre, Berlin: B. Cassirer; trans. J. Haden, Kant’s Life and Thought, New Haven: Yale University Press, 1981. (An accessible presentation of the Marburg interpretation of Kant.)\n\nCassirer, E. (1921) Zur Einstein’schen Relativitätstheorie, Berlin: B. Cassirer; trans. W.C. Swabey and M.C. Swabey, Substance and Function & Einstein’s Theory of Relativity, Chicago: Open Court, 1923. (A further articulation of Cassirer’s epistemology. Advocates a revision of the Kantian theory of space and time in the light of Einstein’s general relativity.)\n\nCassirer, E. (1929) Philosophie der symbolischen Formen. Dritter Teil: Phänomenologie der Erkenntnis, Berlin: B. Cassirer; trans. R. Manheim, The Philosophy of Symbolic Forms. Volume Three: The Phenomenology of Knowledge, New Haven: Yale University Press, 1957. (A further development of Cassirer’s account of scientific concept formation as rooted in more basic symbolic forms.)\n\nCassirer, E. (1936) Determinismus und Indeterminismus in der modernen Physik, Göteborg: Göteborgs Högskolas Årsskrift 42; trans. O.T. Benfey, Determinism and Indeterminism in Modern Physics, New Haven: Yale University Press, 1954. (Uses insights from critical idealism to propose an interpretation of the objects of quantum physics in structural terms.)\n\nCassirer, E. (1944) An Essay on Man: An Introduction to a Philosophy of Human Culture, New Haven: Yale University Press. (An accessible presentation of Cassirer’s philosophy of culture.)\n\nCohen, H. (1871a) Kants Theorie der Erfahrung, Berlin: Dümmler. (An interpretation of Kant’s faculties of the mind in terms of functions that together provide the structure of experience.)\n\nCohen, H. (1871b) ‘ Zur Controverse zwischen Trendelenburg und Kuno Fischer ’, Zeitschrift für Völkerpsychologie und Sprachwissenschaft 7: 249–296. (Cohen’s discussion of the Trendelenburg–Fischer controversy about the Transcendental Aesthetics and the Kantian a priori.)\n\nCohen, H. (1877) Kants Begründung der Ethik, Berlin: Dümmler. (Addresses the extension of the transcendental method from natural laws to the laws of human action.)\n\nCohen, H. (1883) Das Princip der Infinitesimal-Methode und seine Geschichte. Ein Kapitel. zur Grundlegung der Erkenntniskritik, Berlin: Dümmler. (Cohen’s interpretation of the principle of the infinitesimal method in terms of Kant’s Anticipations of Perception. Contains Cohen’s characterization of critical idealism.)\n\nCohen, H. (1885) Kants Theorie der Erfahrung, 2nd ed. Berlin: Dümmler. (The final version of Cohen’s interpretation of the Kantian theory of experience based on the transcendental method.)\n\nCohen, H. (1889) Kants Begründung der Ästhetik, Berlin: Dümmler. (Cohen’s interpretation of Kant’s Critique of the Power of Judgment.)\n\nCohen, H. (1896) ‘Einleitung mit kritischem Nachtrag zur Geschichte des Materialismus von F. A. Lange’, in the 5th ed. of Lange (1866). (A helpful characterization of the transcendental method in contrast with the physiological interpretation of the Kantian a priori.)\n\nCohen, H. (1902) System der Philosophie, Erster Teil: Logik der reinen Erkenntnis, Berlin: B. Cassirer. (Cohen’s theory of the origin of the objects of knowledge in pure thought.)\n\nCohen, H. (1904) System der Philosophie, Zweiter Teil: Ethik der reinen Willens, Berlin: B. Cassirer. (Cohen’s theory of the origin of ethical ideals in pure will.)\n\nCohen, H. (1912) System der Philosophie, Dritter Teil: Ästhetik der reinen Gefühls, Berlin: B. Cassirer. (Cohen’s theory of the origin of the objects aesthetic judgement in pure feeling.)\n\nCohen, H. (1919) Die Religion der Vernunft aus den Quellen des Judentums, Leipzig: Fock; trans. S. Kaplan, Religion of Reason: Out of the Sources of Judaism, New York: Frederick Unger, 1972. (An interpretation of Judaism as the original religion of reason.)\n\nCohn, J. (1908) Voraussetzungen und Ziele des Erkennens, Leipzig: Engelmann. (Cohn’s epistemology in the framework of the South West German neo-Kantian theory of value.)\n\nCohn J. (1914) Der Sinn der gegenwärtigen Kultur, Leipzig: Meiner. (A defence of the idea of a unitary philosophy of culture in the wake of South West German neo-Kantianism.)\n\nDe Warren, N. and Staiti, A. (eds) (2015) New Approaches to Neo-Kantianism, Cambridge: Cambridge University Press. (A collection of papers highlighting the lasting contributions of the neo-Kantian movement.)\n\nDilthey, W. (1883) Einleitung in die Geisteswissenschafte n, Leipzig: Duncker & Humblot; trans. R.A. Makkreel and F. Rodi, Introduction to the Human Sciences, in Selected Works, vol. 1. Princeton: Princeton University Press, 1989. (Dilthey’s seminal account of the foundations and the methodology of human sciences.)\n\nEdgar, S. and Patton, L. (eds) (2018) ‘Method, Science, and Mathematics: Neo-Kantianism and Analytic Philosophy’, in Journal for the History of Analytical Philosophy 6 (3). (A collection of papers addressing important themes from neo-Kantianism in analytical philosophy.)\n\nFerrari, M. (1998) ‘ Neokantismo come filosofia della cultura: Wilhelm Windelband e Heinrich Rickert ’, Revue de Métaphysique et de Morale 3: 367–388. (A helpful discussion of the idea of a neo-Kantian philosophy of culture in South West German neo-Kantianism.)\n\nFerrari, M. (2003) Ernst Cassirer. Stationen einer philosophischen Biographie: Von der Marburger Schule zur Kulturphilosophie, Hamburg: Meiner. (A helpful reconstruction of Cassirer’s relation to his Marburg teachers and of the neo-Kantian themes of his mature philosophy of culture.)\n\nFischer, K. (1860) Geschichte der neuern Philosophie, vols 3–4: Immanuel Kant, Mannheim: Bassermann. (Fischer’s presentation of Kant in his seminal handbook in the history of modern philosophy.)\n\nFlach, W. and Holzhey, H. (1980) Erkenntnistheorie und Logik im Neukantianismus, Hildesheim: Olms. (A sourcebook for theory of knowledge and logic in neo-Kantianism with a useful introduction to the original texts.)\n\nFriedman, M. (2000) A Parting of the Ways: Carnap, Cassirer, and Heidegger, Chicago: Open Court. (Offers a reconstruction of the neo-Kantian background of the confrontation between Cassirer, Heidegger, and Carnap in the late 1920s.)\n\nFriedman, M. and Nordmann, A. (eds) (2006) The Kantian Legacy in Nineteenth-Century Science, Cambridge, MA: MIT Press. (A collection of helpful papers discussing neo-Kantian themes in the philosophical reflection on science in the ninetieth century.)\n\nGiovanelli, M. (2011) Reality and Negation – Kant’s Principle of Anticipations of Perception: An Investigation of its Impact on the Post-Kantian Debate, Dordrecht: Springer. (Discusses Cohen’s interpretation of Kant and its reception in Marburg neo-Kantianism.)\n\nHatfield, G. (1990) The Natural and the Normative: Theories of Spatial Perception from Kant to Helmholtz, Cambridge, MA: MIT Press. (A helpful discussion of Helmholtz’s relation to Kant.)\n\nHeinz, M. and Krijnen, C. (eds) (2007) Kant im Neukantianismus: Fortschritt oder Rückschritt?, Würzburg: Königshausen und Neumann. (A collection of papers addressing the different interpretations of Kant in neo-Kantianism.)\n\nHelmholtz, H. v. (1855) ‘Ueber das Sehen des Menschen’, in Vorträge und Reden, 5th edn, vol. 1: 85–118, Braunschweig: Vieweg, 1903. (Presents the main ideas of a physiological interpretation of the Kantian a priori.)\n\nHelmholtz, H. v. (1867) Handbuch der physiologischen Optik, 3 vols, Leipzig: Voss. (Helmholtz’s psychological optics. Contains Helmholtz’s empirical account of the form of spatial intuition.)\n\nHelmholtz, H. v. (1921) Schriften zur Erkenntnistheorie, ed. M. Schlick and P. Hertz, Berlin: Springer; trans. M. Lowe, Epistemological Writings, Dordrecht: Reidel, 1977. (The centenary edition of Helmholtz’s papers about the empirical foundations of mathematics.)\n\nHerbart, J.F. (1825) Psychologie als Wissenschaft. Neu gegründet auf Erfahrung, Metaphysik und Mathematik, vol. 2, in Sämmtliche Werke, Leipzig: Voss, 1850. (Herbart’s psychology. Contains Herbart’s critique of Kant’s argument for the aprioricity of space.)\n\nHolzhey, H. (1986) Cohen und Natorp, 2 vols, Basel: Schwabe. (A helpful reconstruction of the theoretical differences between Cohen and Natorp. Contains previously unpublished materials documenting internal debates among Marburg neo-Kantians.)\n\nHönigswald, R. (1906) Beiträge zur Erkenntnistheorie und Methodenlehre, Leipzig: Fock. (Hönigswald’s theory of knowledge.)\n\nHönigswald, R. (1909) ‘Über den Unterschied und die Beziehungen der logischen und der erkenntnistheoretischen Elemente in dem kritischen Problem der Geometrie’, in T. Elsenhans (ed.), Bericht über den III. Internationalen Kongress für Philosophie, 1 to 5 September 1908: 887–893, Heidelberg: Winter. (Hönigswald’s discussion of the epistemological significance of geometry.)\n\nHönigswald, R. (1912) Zum Streit über die Grundlagen der Mathematik, Heidelberg: Winter. (Hönigswald’s account of the neo-Kantian debate on the foundations of mathematics.)\n\nKinzel, K. (2017) ‘Wilhelm Windelband and the Problem of Relativism’, British Journal for the History of Philosophy, 25(1): 84–107. (A helpful discussion of Windelband’s stance on relativism in the debate about the status and the method of the human sciences.)\n\nKinzel, K. and Patton, L. (eds) (2021) ‘Historical Thought in German Neo-Kantianism’, in British Journal for the History of Philosophy 29(4). (A collection of papers on historical reflection in German neo-Kantianism.)\n\nKöhnke, K.C. (1991) The Rise of Neo-Kantianism: German Academic Philosophy between Idealism and Positivism, trans. R.J. Hollingdale, Cambridge: Cambridge University Press. (An informative study of the genesis of neo-Kantianism integrating a sociological study of the development of the neo-Kantian movement with a helpful discussion of its philosophical roots.)\n\nKrijnen, C. and Orth, E.W. (eds) (1998) Sinn, Geltung, Wert. Neukantianische Motive in der modernen Kulturphilosophie, Würzburg: Königshausen & Neumann. (A collection of papers addressing the different neo-Kantian approaches to the philosophy of culture.)\n\nMormann, T. and Katz, M. (2013) ‘ Infinitesimals as an Issue of Neo-Kantian Philosophy of Science ’, HOPOS Journal 2: 236–280. (A helpful discussion of the different accounts of infinitesimals in Marburg neo-Kantianism.)\n\nLange, F.A. (1866) Geschichte des Materialismus und Kritik seiner Bedeutung in der Gegenwart, Iserlohn: J. Baedeker; 2nd edn, Iserlohn: Baedeker, 1873–5, 2 vols; trans. E.C. Thomas, History of Materialism and Criticism of Its Present Importance, Boston, MA: Osgood, 1877–81, 3 vols. (An account of the history of materialism from antiquity to the nineteenth-century materialism controversy. Points at Kant’s philosophy as a powerful resource against the materialists’ attempt at a reduction of experience to causal explanations.)\n\nLask, E. (1908) ‘ Gibt es einen Primat der praktischen Vernunft in der Logik? ’, Bericht über den III. Internationalen Kongreß der Philosophie, Heidelberg 1909: 671–677. (Draws attention to the need to account for the sphere of the unconditionally valid.)\n\nLask, E. (1911) Die Logik der Philosophie und die Kategorienlehre. Eine Studie über den Herrschaftsbereich der logischen Form, Tübingen: Mohr; trans. C. Braun, The Logic of Philosophy and the Doctrine of Categories, London: Free Association Books, 1999. (A systematization of the categories of the understanding from the standpoint of the theory of values.)\n\nLask, E. (1912) Die Lehre vom Urteil, Tübingen: Mohr. (Investigates the logical structure of judgements in terms of the theory of values.)\n\nLotze, R.H. (1874) Logik. Drei Bücher vom Denken, vom Untersuchen und vom Erkennen, 2nd edn, Leipzig: S. Hirze, 1880; trans. B. Bosanque, Logic, in Three Books: Ontology, Cosmology and Psychology, Oxford: Clarendon Press, 1884; 2nd edn, 1887. (Lotze’s seminal normative account of logic.)\n\nLuft, S. (2015) The Space of Culture: Towards a Neo-Kantian Philosophy of Culture (Cohen, Natorp, & Cassirer), Oxford: Oxford University Press. (A useful account of the main approaches to the philosophy of culture in Marburg neo-Kantianism.)\n\nLuft, S. (ed.) (2015) The Neo-Kantian Reader, New York: Routledge. (A sourcebook for German neo-Kantianism. Contains a selection of texts by key figures of the neo-Kantian movement, made available in English translations and with clear introductory sections placing the texts in their historical and philosophical context.)\n\nLuft, S. and Makkreel, R. (eds) (2010) Neo-Kantianism in Contemporary Philosophy, Bloomington: Indiana University Press. (A collection of papers addressing themes from neo-Kantianism in contemporary philosophy.)\n\nNatorp, P. (1881) Descartes’ Erkenntnistheorie. Eine Studie zur Vorgeschichte des Kritizismus, Marburg: Elwert. (Natorp’s study of the prehistory of critical idealism in early modern philosophy.)\n\nNatorp, P. (1887) ‘ Ueber objektive und subjektive Begründung der Erkenntniss ’, Philosophische Monatshefte 23: 257–286; trans. D. Kolb, ‘On the Objective and Subjective Grounding of Knowledge’, Journal of the British Society for Phenomenology 12 (1981): 245–266. (Presents the idea of a double direction of the epistemological inquiry, towards the objectification of the mind’s a priori forms, and back.)\n\nNatorp, P. (1903) Platos Ideenlehre: Eine Einführung in den Idealismus, Leipzig: Dürr. (Natorp’s interpretation of Plato’s theory of ideas.)\n\nNatorp, P. (1901) ‘ Zu den logischen Grundlagen der neueren Mathematik ’, Archiv für systematische Philosophie 7: 177–209,372–384. (Presents the plan of a transcendental investigation of the fact of modern mathematics.)\n\nNatorp, P. (1910) Die logischen Grundlagen der exakten Wissenschaften, Leipzig: Teubner. (Natorp’s major epistemological work. Presents the system of a priori syntheses lying at the foundations of mathematics and the mathematical science of nature.)\n\nNatorp, P. (1912a) Allgemeine Psychologie nach kritischer Methode, Tübingen: Mohr. (Natorp’s general psychology applying the critical method regressively, from objectifications to the psychic processes involved in cognition.)\n\nNatorp, P. (1912b) ‘ Kant und die Marburger Schule ’, Kant-Studien 17: 193–221; trans. F. Bottenberg, ‘Kant and the Marburg School’, in Luft 2015: 180–197. (An accessible presentation of the main themes of the Marburg School.)\n\nOllig, H.L. (1979) Der Neukantianismus, Stuttgart: Metzler. (An informative account of the life and works of the major figures of the neo-Kantian movement.)\n\nOrth, E.W. and Holzhey, H. (eds) (1994) Neukantianismus. Perspektiven und Probleme, Würzburg: Königshausen & Neumann. (A collection of papers about philosophically relevant themes from the various schools of neo-Kantianism.)\n\nPatton, L. (2005) ‘The Critical Philosophy Renewed’, Angelaki, 10(1): 109–118. (A useful account of the idea of a renewal of Kant’s critical philosophy from the back to Kant movement to Cohen.)\n\nPoma, A. (1997) The Critical Philosophy of Hermann Cohen, trans. J. Denton, Albany, NY: SUNY Press. (A comprehensive account of Cohen’s thought.)\n\nRickert, H. (1892) Der Gegenstand der Erkenntnis. Eine Einführung in die Transzendentalphilosophie, Tübingen: Mohr Siebeck; 2nd rev. ed. 1904, 3rd edn with major revisions 1915, 4th and 5th improved edn 1921. (Rickert’s theory of knowledge.)\n\nRickert, H. (1902) Die Grenzen der naturwissenschaftlichen Begriffsbildung. Eine logische Einleitung in die historischen Wissenschaften, Tübingen: Mohr; 2nd rev. edn 1913, 3rd and 4th improved edn 1921, 5th improved and extended edn 1929. (Rickert’s account of concept formation in historical sciences.)\n\nRickert, H. (1909). ‘ Zwei Wege der Erkenntnistheorie. Transcendentalpsychologie und Transcendentallogik ’, Kant-Studien 14: 169–228. (Rickert’s plan to integrate a transcendental-psychological approach to the theory of knowledge with a transcendental-logical one.)\n\nRickert, H. (1910) ‘ Vom Begriff der Philosophie ’, Logos 1: 1–34. (A helpful presentation of Rickert’s conception of philosophy from the standpoint of the theory of values.)\n\nRickert, H. (1911) ‘ Das Eine, die Einheit und die Eins. Bemerkungen zur Logik des Zahlbegriffs ’, Logos 2: 26–78. (Rickert’s account of the formation of numerical concepts.)\n\nRickert, H. (1921) System der Philosophie, Tübingen: J.C.B. Mohr, vol. 1. (The first volume of Rickert’s unfinished system of philosophy offering a formal classification of values.)\n\nRickert, H. (1924) Kant als Philosoph der modernen Kultur. Ein geschichtsphilosophischer Versuch, Tübingen: Mohr. (An interpretation of Kant’s critical philosophy introducing to the tasks of a modern philosophy of culture.)\n\nRiehl, A. (1876) Der Philosophische Kriticismus und seine Bedeutung für die positive Wissenschaft, vol. 1: Geschichte und Methode des philosophischen Kriticismus, Leipzig: Engelmann. (Riehl’s realist interpretation of Kant. Emphasizes the continuing influence of empiricist themes in the development of Kant’s thought.)\n\nRiehl, A. (1879) Der Philosophische Kriticismus, vol. 2: Die sinnlichen und logischen Grundlagen der Erkenntnis, Leipzig: Engelmann. (Integrates the Kantian account of a priori knowledge with an empiricist theory of knowledge.)\n\nRiehl, A. (1887) Der Philosophische Kriticismus, vol. 3: Zur Wissenschaftstheorie und Metaphysik, Leipzig: Engelmann; trans. A. Fairbanks, The Principles of the Critical Philosophy: Introduction to The Theory of Science and Metaphysics, London: Paul, Trench, Trübner, 1894. (Addresses classical metaphysical issues from the standpoint of Riehl’s theory of science.)\n\nSieg, U. (1994) Aufstieg und Niedergang des Marburger Neukantianismus. Die Geschichte einer philosophischen Schulgemeinschaft, Würzburg: Königshausen & Neumann. (An informative reconstruction of the development of Marburg neo-Kantianism.)\n\nStadler, A. (1883) Kants Theorie der Materie, Leipzig: Hirzel. (A defence of Cohen’s reading of Kant in respect to psychophysics.)\n\nTrendelenburg, F.A. (1840) Logische Untersuchungen, Berlin: Bethge. (Trendelenburg’s seminal work on logic. Contains Trendelenburg’s critique of the Kantian theory of space and time.)\n\nWindelband, W. (1878–80) Die Geschichte der neueren Philosophie in ihrem Zusammenhange mit der allgemeinen Cultur und den besonderen Wissenschaften, 2 vols., Leipzig: Breitkopf und Härtel. (Windelband’s first important work in the history of modern philosophy. Contains the core ideas of his interpretation of Kant.)\n\nWindelband, W. (1883) ‘Kritische oder genetische Methode?’, in Windelband 1915, vol. 2: 99–135; trans. A. Duncan, ‘Critical or Genetic Method?’, in Luft 2015: 271–286. (Windelband’s characterization of the critical method in reference to the theory of values.)\n\nWindelband, W. (1891) Lehrbuch der Geschichte der Philosophie, Tübingen: Mohr. (Windelband’s seminal handbook in the history of philsophy.)\n\nWindelband, W. (1882) ‘Was ist Philosophie?’, in Windelband1915, vol. 1: 1–54. (Windelband’s conception of philosophy as the science of universally valid values.)\n\nWindelband, W. (1894) ‘Geschichte und Naturwissenschaft’, in Windelband 2015, vol. 2: 136–160; trans. G. Oakes, ‘History and Natural Science’, in Luft 2015: 287–298. (Windelband’s account of the distinction between history and natural sciences. Contains the classification of the sciences into ‘nomothetic’ and ‘idiographic’.)\n\nWindelband, W. (1910) ‘Kulturphilosophie und transzendentaler Idealismus’, in Windelband 1915, vol. 2: 279–294. (A helpful presentation of the neo-Kantian philosophy of culture as rooted in Kant’s transcendental idealism.)\n\nWindelband, W. (1915) Präludien. Aufsätze und Reden zur Philosophie und ihrer Geschichte, 2 vols, 5th expanded edn (1st ed. 1883), Tübingen: Mohr Siebeck. (A collection of Windelband’s seminal essays.)"}, {"url": "https://www.britannica.com/topic/Kantianism/Nineteenth-century-Neo-Kantianism", "page_content": "The rejection of all of philosophy by positivism had the anomalous effect of evoking an awakening of Kantianism, for many thinkers wished to give to positivism itself a philosophical foundation that, while respecting the phenomenological attitude, would yet be hostile to the metaphysics of positivism, which was usually a tacit, but inconsequential, materialism. It was justifiably held that Kant could provide such a foundation because of his opposition to metaphysics and his limitation of scientific knowledge to the sphere of phenomena. The complexity of the critical philosophy was such that the theoretical criticism could be approached in diverse ways and that, through the facts themselves, diverse interpretations of the Critique of Pure Reason could be obtained. In the order of their origin (though not of their worth or importance), there thus arose currents of Kantianism that were empiricist, logicist, realist, metaphysical, axiological, and psychological—of which the most important survived into the 20th century.\n\nThe return to Kant was determined by the historical fresco of the incomparable historian of philosophy Kuno Fischer titled Kants Leben und die Grundlagen seiner Lehre (1860; “Kant’s Life and the Foundations of his Teaching”), which replaced the earlier work of the semi-Kantian Ernst Reinhold, son of the more notable Jena scholar mentioned above (published 1828–30), and especially that of the outstanding historian of philosophy Johann Eduard Erdmann (published 1834–53). In 1865 the imperative “Zurück nach Kant!” (“Back to Kant!”) reverberated through the celebrated work of the young epistemologist Otto Liebmann, Kant und die Epigonen (“Kant and his Followers”), which was destined to extricate their spirits from the positivistic morass and, at the same time, to divert the Germans from Romantic idealism.\n\nEpistemological Neo-Kantianism The empiricist, logistic, and realistic schools can be classed as epistemological. Empiricist Neo-Kantianism was represented by the erudite pioneering physicist and physiologist Hermann von Helmholtz and, in part, by Friedrich Albert Lange, author of a famous study of materialism. Helmholtz found support in Kant for his claim, first, that, although perception can represent an external thing, it usually does so in a way far removed from an actual description of its properties; second, that space and time comprise an empirical framework created for thought by the perceiving subject; and, third, that causality is an a priori law allowing the philosopher to infer a reality that is absolutely unknowable. Similarly, Lange reduced science to the phenomenal level and repudiated the thing-in-itself. Logistic Neo-Kantianism, as represented in the most well-known and flourishing school of Kantianism, that at Marburg, originated with Hermann Cohen, successor of Lange, who, in Kants Theorie der Erfahrung (1871; “Kant’s Theory of Experience”), argued that the transcendental subject is not to be regarded as a psychic being but as a logical function of thought that constructs both the form and the content of knowledge. Nothing is gegeben (“given”), he urged; all is aufgegeben (“propounded,” like a riddle) to thought—as when, in the infinitesimal calculus, the analyst generates motion by imagining thin slices of space and time and adding up their areas. Hence, experience is a perfect construction of humankind’s logical spirit. Cohen’s example inspired many authors, among them Cohen’s colleague at Marburg Paul Natorp, who, in his work on the logical foundations of the exact sciences, integrated even psychology into the Marburgian transcendentalism; and Ernst Cassirer, best known for stressing the symbolizing capacities of human beings, who, in his memorable work Das Erkenntnisproblem in der Philosophie und Wissenschaft der neueren Zeit (1906–20; The Problem of Knowledge: Philosophy, Science, and History since Hegel), transposed this same logisticism into a form that illumines the history of modern philosophy. Realistic Neo-Kantianism, the third manifestation of epistemological Neo-Kantianism, was represented in the realism of the scientific monist Alois Riehl and of his disciple Richard Hönigswald. Riehl held, in direct opposition to the Marburgian logisticism, that the thing-in-itself participates positively in the constitution of knowledge inasmuch as all perception includes a reference to things outside the subject.\n\nMetaphysical Neo-Kantianism Ten years after the appearance of the aforementioned groundbreaking book Kant und die Epigonen, its author, Otto Liebmann, introduced the new metaphysical approach in his book Zu Analysis der Wirklichkeit (1876; “On the Analysis of Reality”), which came near to the Kantianism of Marburg. The Romanticist Johannes Volkelt, in turn, took up the theme of a critical metaphysics and expressed his persisting aspirations toward the Absolute in the claim that, beyond the certainties of subjective consciousness, there exists a new kind of certainty in a transsubjective realm. Subjectivity is, thus, inevitably transcended, just as the sciences are surmounted when they presuppose a metaphysics. The influential spiritual moralist Friedrich Paulsen defended the claim that Kant had always behaved as a metaphysician, even in the Critique of Pure Reason, in spite of the epistemological restrictions that he imposed upon himself—a claim that made an impact that was felt throughout the following century."}, {"url": "https://www.cambridge.org/core/books/new-approaches-to-neokantianism/965237B89C7B01B8841692A4247E9E43", "page_content": "Primary sources\n\nThe reference system in this book is a combination of both author–date and short-title. The canonic in-text author–date system is used for primary sources, for which full references are provided in the list below, whereas references to secondary sources are provided in the footnotes. Secondary sources are cited in full on their first occurrence, and they are abbreviated in all subsequent occurrences. The decision to resort to this somewhat unorthodox method is motivated by the overwhelmingly vast amount of sources cited by the authors. Using exclusively the author–date system would have required over forty pages of bibliography at the end of the book. Using exclusively the footnote system would have led to a number of unnecessary repetitions for works that are cited frequently. Moreover, considering that not all the protagonists of the Neo-Kantian movement are very well known, it would have likely blurred the distinction between references to primary and secondary material. The present list includes all and only the works by Neo-Kantian philosophers and other major thinkers discussed in the book. It has the advantage of being compact and yet giving a comprehensive survey of the key texts of Neo-Kantianism, along with those of major figures in dialogue with the Neo-Kantian tradition.\n\nAristotle , 1976 . De anima . Cambridge University Press .\n\nAustin , John 1832 . The Province of Jurisprudence Determined . London : John Murray .\n\nBauch , Bruno 1923 a. Immanuel Kant . Berlin and Leipzig : de Gruyter . a.\n\nBauch , Bruno 1923 b. Wahrheit, Wert und Wirklichkeit . Leipzig : Meiner .\n\nBauch , Bruno 1923 c. “ Über den Begriff des Naturgesetzes ,” Kant-Studien 19 : 303 – 337 .\n\nBeneke , Friedrich Eduard 1832 . Kant und die philosophische Aufgabe unserer Zeit: Eine Jubeldenkschrift auf die Kritik der reinen Vernunft . Berlin : Ernst Siegfried Mittler .\n\nBeneke , Friedrich Eduard 1833 . Die Philosophie in ihrem Verhältnisse zur Erfahrung, zur Spekulation und zum Leben Dargestellt . Berlin : Ernst Siegfried Mittler .\n\nBona Meyer , Jürgen 1870 . Kants Psychologie . Berlin : Hertz .\n\nBrandom , Robert 1994 . Making it Explicit: Reasoning, Representing, and Discursive Commitment . Cambridge, MA : Harvard University Press .\n\nBrandom , Robert 2001 . “ Reason, Expression, and the Philosophic Enterprise ,” in Ragland , C. P. and Heidt , S. (eds.), What Is Philosophy? New Haven and London : Yale University Press , 74 – 95 .\n\nBrentano , Franz 1874 . Psychologie vom empirischen Standpunkt . Hamburg : Meiner .\n\nCarnap , Rudolf 1937 . The Logical Syntax of Language . London and New York : Kegan Paul .\n\nCarnap , Rudolf 1950 . “ Empiricism, Semantics, and Ontology ,” Revue Internationale de Philosophie 4 : 20 – 40 .\n\nCarnap , Rudolf 1999 . Der logische Aufbau der Welt . Hamburg : Meiner .\n\nCassirer , Ernst 1902 . Leibniz’ System in seinen wissenschaftlichen Grundlagen . Marburg : Elwert .\n\nCassirer , Ernst 1907 . “ Kant und die moderne Mathematik (Mit Bezug auf Bertrand Russells und Louis Couturats Werke über die Prinzipien der Mathematik) ,” Kant-Studien 12 : 1 – 49 .\n\nCassirer , Ernst 1912 . “ Hermann Cohen und die Erneuerung der Kantischen Philosophie ,” Kant-Studien 17 : 252 – 273 .\n\nCassirer , Ernst 1923 . Substance and Function . Chicago and London : Open Court .\n\nCassirer , Ernst 1927 . “ Erkenntnistheorie nebst den Grenzfragen der Logik und Denkpsychologie ,” Jahrbücher der Philosophie 3 : 31 – 92 .\n\nCassirer , Ernst 1943 . “ Hermann Cohen 1842–1918 ,” Social Research: An International Quarterly of Political and Social Science 10 : 219 – 232 .\n\nCassirer , Ernst 1944 . An Essay on Man: An Introduction to a Philosophy of Human Culture . New Haven and London : Yale University Press .\n\nCassirer , Ernst 1946 . The Myth of the State . New Haven : Yale University Press .\n\nCassirer , Ernst 1951 . The Philosophy of the Enlightenment . Princeton University Press .\n\nCassirer , Ernst 1954 . Philosophie der symbolischen Formen . Oxford : Bruno Cassirer .\n\nCassirer , Ernst 1956 a. Determinism and Indeterminism in Modern Physics . New Haven : Yale University Press . a.\n\nCassirer , Ernst 1956 b. Wesen und Wirkung des Symbolbegriffs . Darmstadt : Wissenschaftliche Buchgesellschaft .\n\nCassirer , Ernst 1963 . Rousseau, Kant and Goethe . New York : Harper & Row .\n\nCassirer , Ernst 1971 . Das Erkenntnisproblem . Hildesheim : Georg Olms .\n\nCassirer , Ernst 1975 . Freheit und Form. Studien zur deutschen Geistesgeschichte . Darmstadt : Wissenschaftliche Buchgesellschaft .\n\nCassirer , Ernst 1979 . Symbol, Myth, and Culture: Essays and Lectures of Ernst Cassirer, 1935–1945 . New Haven : Yale University Press .\n\nCassirer , Ernst 1981 . Kant’s Life and Thought . New Haven and London : Yale University Press .\n\nCassirer , Ernst 1985 . The Philosophy of Symbolic Forms , vol. III . New Haven : Yale University Press . , vol.\n\nCassirer , Ernst 1993 . Erkenntnis, Begriff, Kultur . Hamburg : Meiner .\n\nCassirer , Ernst 1994 a. Das Erkenntnisproblem in der Philosophie und Wissenschaft der neueren Zeit , 4 parts. Darmstadt : Wissenschaftliche Buchgesellschaft .\n\nCassirer , Ernst 1994 b. Substanzbegriff und Funktionsbegriff. Untersuchungen über die Grundfragen der Erkenntniskritik . Darmstadt : Wissenschaftliche Buchgesellschaft .\n\nCassirer , Ernst 1995 . Zur Metaphysik der symbolischen Formen . Hamburg : Meiner .\n\nCassirer , Ernst 1996 . The Philosophy of Symbolic Forms , vol. IV . New Haven : Yale University Press .\n\nCassirer , Ernst 1998 . Leibniz’s System in seinen wissenschaftlichen Grundlagen . In Gesammelte Werke, vol. I . Hamburg : Meiner .\n\nCassirer , Ernst 2000 . Substanzbegriff und Funktionsbegriff . In Gesammelte Werke, vol. VI . Hamburg : Meiner .\n\nCassirer , Ernst 2001 . Kants Leben und Lehre . In Gesammelte Werke, vol. VIII . Hamburg : Meiner .\n\nCassirer , Ernst 2004 . Kulturphilosophie. Vorlesungen und Vorträge 1929–1941 . Hamburg : Meiner .\n\nCassirer , Ernst 2006 . An Essay on Man: An Introduction to a Philosophy of Human Culture . XXXIII . Hamburg : Meiner . In Gesammelte Werke, vol.\n\nCassirer , Ernst 2009 a. Ausgewählter wissenschaftlicher Briefwechsel . Hamburg : Meiner .\n\nCassirer , Ernst 2009 b. Schriften zur Philosophie der symbolischen Formen . Hamburg : Meiner .\n\nCassirer , Ernst 2010 . Philosophie der symbolischen Formen , vol. III . Hamburg : Meiner .\n\nCohen , Hermann 1877 . Kants Begründung der Ethik . Berlin : Dümmler .\n\nCohen , Hermann 1889 . Kants Begründung der Ästhetik . Berlin : Dümmler .\n\nCohen , Hermann 1902 . System der Philosophie, part I : Logik der reinen Erkenntnis . Berlin : Bruno Cassirer .\n\nCohen , Hermann 1904 . Ethik des reinen Willens . Berlin : Bruno Cassirer .\n\nCohen , Hermann 1915 . Der Begriff der Religion im System der Philosophie . Giessen : Alfred Töpelmann .\n\nCohen , Hermann 1928 . “ Einleitung mit kritischem Nachtrag zu Langes Geschichte des Materialismus ,” in Schriften zur Philosophie und Zeitgeschichte . Berlin : Akademie Verlag , 1 – 29 .\n\nCohen , Hermann 1966 . Die Religion der Vernunft aus den Quellen des Judentums . Darmstadt : Joseph Melzer Verlag .\n\nCohen , Hermann 1977 . Logik der reinen Erkenntnis . In Werke, vol. V . Hildesheim, Zürich, and New York : Olms .\n\nCohen , Hermann 1984 . DasPrinzip der Infinitesimal-Methode und seine Geschichte . In Werke, vol. V . Hildesheim, Zürich, and New York : Olms .\n\nCohen , Hermann 1987 . Kants Theorie der Erfahrung . I .3. Hildesheim, Zürich, and New York : Olms . In Werke, vol..3.\n\nCohen , Hermann 1995 . Religion of Reason out of the Sources of Judaism. Simon Kaplan . Atlanta, GA : Scholars Press .\n\nCohen , Hermann 1996 . Der Begriff der Religion im System der Philosophie . In Werke, vol. X . Hildesheim, Zürich, and New York : Olms .\n\nCohen , Hermann 2001 a [1981]. Ethik des reinen Willens . VII . Hildesheim, Zürich, and New York : Olms . a [1981]. In Werke, vol.\n\nCohen , Hermann 2001 b. Kants Begründung der Ethik . In Werke, vol. VIII . Hildesheim, Zürich, and New York : Olms .\n\nComte , Auguste 1903 . A Discourse on the Positive Spirit . London : William Reeves .\n\nDedekind , Richard 1901 . “ Continuity and Irrational Numbers ,” in Essays on the Theory of Numbers . Chicago : Open Court , 1 – 27 .\n\nDeleuze , Gilles 1969 . Logique du sens . Paris : Les Éditions de Minuit .\n\nDeleuze , Gilles 1980 . Milles plateaux . Paris : Les Éditions de Minuit .\n\nDerrida , Jacques 1972 . “ La forme et le vouloir-dire. Note sur la phénoménologie du langage ,” in Marges de la Philosophie . Paris : Les Éditions de Minuit , 25 – 55 .\n\nDilthey , Wilhelm 1960 . Weltanschauungslehre: Abhandlungen zur Philosophie der Philosophie, Gesammelte Schriften , vol. VIII . Göttingen : Vandenhoeck & Ruprecht .\n\nDu Bois-Reymond , Emil 1874 . “ The Limits of Our Knowledge of Nature ,” The Popular Science Monthly 5 / 2 : 17 – 32 .\n\nDurkheim , Emil 1997 . The Division of Labor in Society . New York : The Free Press .\n\nFrege , Gottlob 1884 . Die Grundlagen der Arithmetik . Breslau : Koebner .\n\nFrege , Gottlob 1893 . Grundgesetze der Arithmetik , I . Jena : Pohle . vol.\n\nFrege , Gottlob 1918 . “ Der Gedanke. Eine logische Untersuchung ,” Beiträge zur Philosophie des Deutschen Idealismus 1 : 57 – 77 . English translation: “The Thought: A Logical Inquiry,” trans. Quinton , A. M. Marcelle , Mind 65 (1956): 289 – 311 .\n\nFrege , Gottlob 1977 . Begriffsschrift und andere Aufsätze . Hildesheim, Zürich, and New York : Olms .\n\nFrege , Gottlob 1980 . Funktion, Begriff, Bedeutung . Göttingen : Vandenhoeck & Ruprecht .\n\nFrege , Gottlob 1985 . Nachgelassene Schriften . Hamburg : Meiner .\n\nFrege , Gottlob 1993 . Logische Untersuchungen . Göttingen : Vandenhoeck & Ruprecht .\n\nFries , Jacob Friedrich 1807 . Neue oder anthropologische Kritik der Vernunft . Heidelberg : Carl Winter .\n\nGoethe , Johann Wolfgang 1907 . Maximen und Reflexionen . In Schriften der Goethe-Gesellschaft, vol. XXI . Weimar : Verlag der Goethe-Gesellschaft . . In Schriften der Goethe-Gesellschaft, vol.\n\nHabermas , Jürgen 1976 . On the Pragmatics of Social Interaction , trans. Fultner , B. . Cambridge : MIT Press .\n\nHabermas , Jürgen 1985 . The Theory of Communicative Action: Reason and the Rationalization of Society , vol. I . Boston : Beacon Press .\n\nHabermas , Jürgen 1987 . The Theory of Communicative Action: Lifeworld and System: A Critique of Functionalist Reason , vol. II . Boston : Beacon Press .\n\nHabermas , Jürgen 1993 . “ Themes in Postmetaphysical Thinking ,” in Postmetaphysical Thinking. Philosophical Essays . Cambridge, MA : MIT Press , 28 – 53 .\n\nHabermas , Jürgen 1996 . Between Facts and Norms: Contributions to a Discourse Theory of Law and Democracy . Cambridge, MA : MIT Press .\n\nHabermas , Jürgen 2005 . “ Faith and Knowledge ,” in Mendieta , E. (ed.), The Frankfurt School on Religion: Key Writings by the Major Thinkers . New York : Routledge , 101 – 115 .\n\nHabermas , Jürgen 2008 . “ Religion in the Public Sphere ,” in Between Naturalism and Religion. Philosophical Essays . Malden, MA : Polity Press , 114 – 148 .\n\nHabermas , Jürgen 2009 . “ What is Meant by ‘Post-Secular Society’? A Discussion on Islam in Europe ,” in Europe: The Faltering Project . Malden, MA : Polity Press , 59 – 78 .\n\nHammond , William 1901 . Review of W. Windelband , Platon, The Philosophical Review 10 / 4 : 430 – 436 .\n\nHartmann , Eduard 1923 . Kategorienlehre . Berlin : Dunkers .\n\nHegel , Georg Wilhelm Friedrich 1951 . Wissenschaft der Logik: Zwei Teilen . Leipzig : Meiner .\n\nHegel , Georg Wilhelm Friedrich 1952 . Phänomenologie des Geistes . Hamburg : Meiner .\n\nHegel , Georg Wilhelm Friedrich 1955 . Grundlinien der Philosophie des Rechts . Hamburg : Meiner .\n\nHegel , Georg Wilhelm Friedrich 1977 . The Phenomenology of Spirit . Oxford University Press .\n\nHegel , Georg Wilhelm Friedrich 1991 . Enzyklopädie der philosophischen Wissenschaften im Grundrisse (1830) . Hamburg : Meiner .\n\nHeidegger , Martin 1987 . Zur Bestimmung der Philosophie . In Gesamtausgabe, vol. LVI – LVII . Frankfurt am Main : Klostermann .\n\nHeidegger , Martin 1991 . Kant und das Problem der Metaphysik . In Gesamtausgabe, vol. III . Frankfurt am Main : Klostermann .\n\nHeidegger , Martin 2005 . Grundprobleme der Phänomenologie . In Gesamtausgabe, vol. LVIII . Frankfurt am Main : Klostermann .\n\nHelmoltz , Herrman 1995 . “ On the Relation of Optics to Painting ,” in Science and Culture: Popular and Philosophical Essays . University of Chicago Press , 279 – 308 . . “,” in\n\nHume , David 1985 .“ Of the Original Contract ,” in Essays: Moral, Political and Literary . Indianapolis : Liberty Fund , 465 – 487 .\n\nHusserl , Edmund 1913 . Ideen zu einer reinen Phänomenologie und phänomenologische Philosophie, book I : Allgemeine Einführung in die reine Phänomenologie . Halle : Niemeyer .\n\nHusserl , Edmund 1968 . Logische Untersuchungen, zweiter Band, erster Teil . Tübingen : Niemeyer .\n\nHusserl , Edmund 1969 . Formal and Transcendental Logic . XVII . The Hague : Martinus Nijhoff . In Husserliana, vol.\n\nHusserl , Edmund 1971 . Ideen zu einer reinen Phänomenologie und phänomenologische Philosophie, Drittes Buch: Die Phänomenologie und die Fundamente der Wissenschaften. In Husserliana , vol. V . The Hague : Martinus Nijhoff .\n\nHusserl , Edmund 1984 . Logische Untersuchungen, vol. II : Untersuchungen zur Phänomenologie und Theorie der Erkenntnis , part I . In Husserliana, vol. XIX .1 . The Hague : Martinus Nijhoff .\n\nHusserl , Edmund 1989 . Ideas Pertaining to a Pure Phenomenology and to a Phenomenological Philosophy, book II : Studies in the Phenomenology of Constitution . Dordrecht : Kluwer .\n\nHusserl , Edmund 1994 . Briefwechsel , vol. V . The Hague : Kluwer .\n\nHusserl , Edmund 2014 . Ideas for a Pure Phenomenology and Phenomenological Philosophy, book I : General Introduction to Pure Phenomenology . Indianapolis : Hackett .\n\nKant , Immanuel 1950 . Prolegomena to Any Future Metaphysics . Indianapolis : Bobbs-Merrill .\n\nKant , Immanuel 1956 . Kritik der reinen Vernunft . Hamburg : Meiner .\n\nKant , Immanuel 1978 . Prolegomena zu einer jeden künftigen Metaphysik die als Wissenschaft wird auftreten können . Frankfurt am Main : Suhrkamp .\n\nKant , Immanuel 1981 . Grounding for the Metaphysics of Morals [Groundwork] . Indianapolis : Hackett .\n\nKant , Immanuel 1983 . Perpetual Peace and Other Essays . Indianapolis : Hackett .\n\nKant , Immanuel 1996 . Practical Philosophy . Cambridge University Press .\n\nKant , Immanuel 1997 . Lectures on Ethics . Cambridge University Press .\n\nKant , Immanuel 1998 . Critique of Pure Reason . Cambridge University Press .\n\nKant , Immanuel 1999 . Religion within the Boundaries of Mere Reason and Other Writings . Cambridge University Press .\n\nKant , Immanuel 2001 . Lectures on Metaphysics . Cambridge University Press .\n\nKelsen , Hans 1911 . Hauptprobleme der Staatsrechtslehre, entwickelt aus der Lehre vom Rechtsatze . Freiburg and Leipzig : Mohr .\n\nKelsen , Hans 1998 . “ The Pure Theory of Law, ‘Labandism,’ and Neo-Kantianism: A Letter to Renato Treves ,” in Normativity and Norms: Critical Perspectives on Kelsenian Themes . Oxford : Clarendon Press , 111 – 119 .\n\nKries , Johannes 1888 . “ Über den Begriff der objectiven Möglichkeit und einige Anwendungen desselben ,” Vierteljahresschrift für wissenschaftliche Philosophie 12 : 179 – 240 , 287 – 323 , 393 – 428 .\n\nKuhn , Thomas 1970 . The Structure of Scientific Revolutions . University of Chicago Press .\n\nKuhn , Thomas 1997 . The Essential Tension: Selected Studies in Scientific Tradition and Change . University of Chicago Press .\n\nLange , Friedrich Albert 1887 . Geschichte des Materialismus und Kritik seiner Bedeutung in der Gegenwart . Iserlohn and Leipzig : J. Baedeker .\n\nLaplace , Pierre Simon 1902 . A Philosophical Essay on Probabilities . New York : John Wiley & Sons ; London: Chapman & Hall.\n\nLask , Emil 1905 . Rechtsphilosophie . Heidelberg : Carl Winter .\n\nLask , Emil 1911 . Die Logik der Philosophie und die Kategorienlehre.\n\nLask , Emil 1923 . “ Rechtsphilosophie ,” in Gesammelte Schriften , vol. I . Freiburg and Leipzig : Mohr .\n\nLeibniz , Gottfried Wilhelm 1996 . Neue Abhandlungen über den menschlichen Verstand . Hamburg : Meiner .\n\nLevy , Heinrich 1927 . Die Hegel-Renaissance in der deutschen Philosophie . Charlottenburg : Pan .\n\nLiebmann , Otto 1880 . Zur Analysis der Wirklichkeit . Strasbourg : Trübner .\n\nLiebmann , Otto 1912 . Kant und die Epigonen: Eine kritische Abhandlung . Berlin : Reuther & Reichard .\n\nLotze , Rudolf Hermann 1879 . Metaphysik . Leipzig : Hirzel .\n\nLotze , Rudolf Hermann 1882 . Grundzüge der Religionsphilosophie . Leipzig : Hirzel .\n\nLotze , Rudolf Hermann 1902 . Grundzüge der Logik und Encyclopädie der Philosophie . Leipzig : Hirzel .\n\nLotze , Rudolf Hermann 1989 a. Logik Erstes Buch: Vom Denken . Hamburg : Meiner .\n\nLotze , Rudolf Hermann 1989 b. Logik Drittes Buch: Vom Erkennen . Hamburg : Meiner .\n\nMacIntyre , Alasdair 1999 . Dependent Rational Animals: Why Human Beings Need the Virtues . Chicago : Open Court .\n\nMarck , Siegfried 1929 . Die Dialektik in der Philosophie der Gegenwart . Freiburg and Leipzig : Mohr .\n\nMarion , Jean-Luc 1989 . Réduction et donation . Paris : PUF .\n\nMaxwell , James Clerk 1859 . “ On the Stability of Saturn’s Rings ,” Monthly Notices of the Royal Astronomical Society 19 : 297 – 304 .\n\nMaxwell , James Clerk 1995 . “ Drafts of lecture on ‘Molecules’, c. August – September 1873 ,” in The Scientific Letters and Papers of James Clerk Maxwell . Cambridge University Press , 922 – 933 . . “,” in\n\nMenger , Carl 1963 . Problems of Economics and Sociology . University of Illinois Press .\n\nMerleau-Ponty , Maurice 1968 . The Visible and the Invisible . Evanston : Northwestern University Press .\n\nMerleau-Ponty , Maurice 2012 . Phenomenology of Perception . London : Routledge .\n\nMill , John Stuart 1974 . A System of Logic Ratiocinative and Inductive: Being a Connected View of the Principles of Evidence and the Methods of Scientific Investigation . Toronto and London : University of Toronto Press and Routledge & Kegan Paul .\n\nMill , John Stuart 1994 . The Logic of the Moral Sciences . Peru, IL : Open Court .\n\nMises , Ludwig 1929 . “ Soziologie und Geschichte: Epilog zum Methodenstreit in der Nationalökonomie ,” Archiv für Sozialwissenschaft und Sozialpolitik 61 / 3 : 465 – 512 .\n\nMontaigne , Michel 1958 . Essays . London : Penguin .\n\nNagaoka , Hantarō 1904 . “ Kinetics of a System of Particles Illustrating the Line and the Band Spectrum and the Phenomena of Radioactivity ,” Philosophical Magazine 7 : 445 – 455 .\n\nNatorp , Paul 1882 a. Descartes’ Erkenntnistheorie. Eine Studie zur Vorgeschichte des Kritizismus . Marburg : Elwert .\n\nNatorp , Paul 1882 b. “ Galillei als Philosoph ,” Philosphische Monatshefte 18 : 193 – 229 .\n\nNatorp , Paul 1887 . “ Ueber objektive und subjektive Begründung der Erkenntnis ,” Philosophische Monatshefte 23 : 257 – 286 .\n\nNatorp , Paul 1888 . Einleitung in die Psychologie nach kritischer Methode . Freiburg and Leipzig : Mohr .\n\nNatorp , Paul 1894 . Religion innerhalb der Grenzen der Humanität . Freiburg and Leipzig : Mohr .\n\nNatorp , Paul 1901 . “ Zur Frage der logischen Methode. Mit Beziehung auf Edmund Husserl’s ‘Prolegomena’ zur reinen Logik ,” Kant-Studien 6 : 270 – 283 .\n\nNatorp , Paul 1904 a. Allgemeine Psychologie, in Leitsätzen zu akademischen Vorlesungen . Marburg : Elwert .\n\nNatorp , Paul 1904 b. Sozialpädagogik: Theorie der Willenserziehung auf der Grundlage der Gemeinschaft . Stuttgart : Frommanns .\n\nNatorp , Paul 1910 . Die logischen Grundlagen der exakten Wissenschaften . Leipzig and Berlin : Teubner .\n\nNatorp , Paul 1912 a. Allgemeine Psychologie nach kritischer Methode . Freiburg and Leipzig : Mohr .\n\nNatorp , Paul 1912 b. “ Kant und die Marburger Schule ,” Kant-Studien 17 : 192 – 221 .\n\nNatorp , Paul 1913 . “ Recht und Sittlichkeit. Ein Beitrag zur kategorialen Begründung der praktischen Philosophie. Mit besonderer Beziehung auf Hermann Cohens ҅Ethik des reinen Willens’ und Rudolf Stammlers ‘Theorie der Rechtswissenschaft ,’” Kant Studien 18 : 1 – 79 . . “,’”\n\nNatorp , Paul 1917 . “ Husserl’s Ideen zu einer reinen Phänomenologie ,” Logos 7 : 224 – 246 .\n\nNatorp , Paul 1918 . “ Hermann Cohens philosophische Leistung unter dem Gesichtspunkte des Systems ,” Philosophische Vorträge veröffentlicht von der Kant-Gesellschaft 21 . Berlin : Reuther & Reichard .\n\nNatorp , Paul 1920 . Sozial-Idealismus: Neue Richtlinien sozialer Erziehung . Berlin : Julius Springer .\n\nNatorp , Paul 1921 . Die logischen Grundlagen der exakten Wissenschaften . Leipzig and Berlin : Teubner .\n\nNatorp , Paul 1925 a. Vorlesungen über praktische Philosophie . Erlangen : Verlag der Philosophischen Akademie . a.\n\nNatorp , Paul 1925 b. Sozialpädagogik. Theorie der Willensbildung auf der Grundlage der Gemeinschaft . Paderborn : Schöningh .\n\nNatorp , Paul 1981 . “ On the Objective and Subjective Grounding of Knowledge ,” Journal of the British Society for Phenomenology 12 : 245 – 266 .\n\nNatorp , Paul 1985 . “ Leibniz und der Materialismus. Aus dem Nachlaß hrsg. von H. Holzhey ,” Studia Leibnitiana 17 : 3 – 14 .\n\nNatorp , Paul 1994 . Platons Ideenlehre: Eine Einführung in den Idealismus . Hamburg : Meiner .\n\nNatorp , Paul 2008 . Philosophie – ihr Problem und ihre Probleme. Eine Einführung in den kritischen Idealismus . Göttingen : Ruprecht .\n\nNatorp , Paul 2013 . Allgemeine Psychologie nach kritischer Methode . Darmstadt : Wissenschaftliche Buchgesellschaft .\n\nPlato , 1977 . Phaedo . Indianapolis : Hackett .\n\nPlato , 2000 . Timaeus . Indianapolis : Hackett .\n\nPopper , Karl 1972 . Objective Knowledge: An Evolutionary Approach . Clarendon : Oxford University Press .\n\nQuine , Willard Van Orman 1969 . Ontological Relativity and Other Essays . Columbia University Press .\n\nRadbruch , Gustav 1914 . Grundzüge der Rechtsphilosophie . Leipzig : Quelle and Meyer .\n\nRadbruch , Gustav 1950 . Rechtsphilosophie; “Legal Philosophy ,” in Patterson , E. W. (ed.), trans. Wilk , H. , The Legal Philosophies of Lask, Radbruch and Dabin . Cambridge, MA : Harvard University Press , 43 – 224 . ,” in(ed.), trans.\n\nRadbruch , Gustav 2003 . Rechtsphilosophie (Studienausgabe) . Heidelberg : C. F. Müller .\n\nRanke , Leopold 1885 . Geschichten der romanischen und germanischen Völker von 1494 bis 1535 . Leipzig : Duncker & Humblot .\n\nRanke , Leopold 1890 . “ Aufsätze zur eigenen Lebensbeschreibung ,” in Zur eigenen Lebensgeschichte . Leipzig : Dunker & Humblot , 32 – 33 .\n\nRawls , John 1993 . Political Liberalism . New York : Columbia University Press .\n\nRawls , John 1999 . A Theory of Justice . Cambridge, MA : Belknap Press of Harvard University Press .\n\nRawls , John 2005 . “ The Idea of Public Reason Revisited ,” in Political Liberalism as “Lecture IX ” (expanded edition). Columbia University Press , 437 – 490 .\n\nRawls , John 2009 . A Brief Inquiry into the Meaning of Sin and Faith . Cambridge, MA : Harvard University Press .\n\nRickert , Heinrich 1888 . Zur Lehre von der Definition . Tübingen : Paul Siebeck .\n\nRickert , Heinrich 1896 . Die Grenzen der naturwissenschaftlichen Begriffsbildung: Eine logische Einleitung in die historischen Wissenschaften . Tübingen and Leipzig : Mohr .\n\nRickert , Heinrich 1899 a. Fichtes Atheismusstreit und die Kantische Philosophie . Berlin : Reuther & Reichard .\n\nRickert , Heinrich 1899 b. Kulturwissenschaft und Naturwissenschaft . Tübingen and Leipzig : Mohr .\n\nRickert , Heinrich 1900 . “ Psychophysische Causalität und psychophysischer Parallelismus ,” in Erdmann , Benno et al. (eds.), Philosophische Abhandlungen: Christoph Sigwart zu seinem siebzigsten Geburtstage . Tübingen and Leipzig : Mohr , 59 – 87 .\n\nRickert , Heinrich 1902 . Die Grenzen der naturwissenschaftlichen Begriffsbildung: Eine logische Einleitung in die historischen Wissenschaften . Tübingen and Leipzig : Mohr .\n\nRickert , Heinrich 1907 . “ Geschichtsphilosophie ,” in Windelband , W. (ed.), Die Philosophie im Beginn des 20. Jahrhunderts: Festschrift für Kuno Fischer . Heidelberg : Carl Winter’s Universitätsbuchhandlung , 321 – 342 .\n\nRickert , Heinrich 1909 . “ Zwei Wege der Erkenntnistheorie. Transcendentalpsychologie und Transcendentallogik ,” Kant-Studien 14 : 169 – 228 .\n\nRickert , Heinrich 1910 . “ Vom Begriff der Philosophie ,” Philosophische Aufsätze . Tübingen and Leipzig : Mohr , 3 – 36 . . “,” in\n\nRickert , Heinrich 1911 . “ Lebenswerte und Kulturwerte ,” Logos 2 : 131 – 166 .\n\nRickert , Heinrich 1913 . Vom System der Werte . Tübingen and Leipzig : Mohr .\n\nRickert , Heinrich 1914 . “ Über logische und ethische Geltung ,” Logos 19 : 182 – 221 .\n\nRickert , Heinrich 1921 . System der Philosophie: Erster Teil: Allgemeine Grundlegung der Philosophie . Tübingen and Leipzig : Mohr .\n\nRickert , Heinrich 1924 a. Das Eine, die Einheit und die Eins: Bemerkungen zur Logik des Zahlbegriffs . Tübingen and Leipzig : Mohr .\n\nRickert , Heinrich 1924 b. Die Probleme der Geschichtsphilosophie: eine Einführung , 2 nd edn. Heidelberg : Carl Winter .\n\nRickert , Heinrich 1926 . Kulturwissenschaft und Naturwissenschaft . Tübingen and Leipzig : Mohr .\n\nRickert , Heinrich 1928 . Der Gegenstand der Erkenntnis: Einführung in die Transzendentalphilosophie , 6 th edn. Tübingen and Leipzig : Mohr . th edn.\n\nRickert , Heinrich 1929 a. Die Grenzen der naturwissenschaftlichen Begriffsbildung: Eine logische Einleitung in die historischen Wissenschaften , 5 th edn. Tübingen and Leipzig : Mohr .\n\nRickert , Heinrich 1929 b. Wilhelm Windelband . Tübingen and Leipzig : Mohr .\n\nRickert , Heinrich 1930 . Die Logik des Prädikats und das Problem der Ontologie , 2 nd edn. Heidelberg : Carl Winter .\n\nRickert , Heinrich 1934 . Grundprobleme der Philosophie: Methodologie, Ontologie, Anthropologie . Tübingen and Leipzig : Mohr .\n\nRickert , Heinrich 1939 . Unmittelbarkeit und Sinndeutung . Tübingen and Leipzig : Mohr .\n\nRickert , Heinrich 1962 . Science and History: A Critique of Positivist Epistemology . Princeton, Toronto, New York, and London : Van Nostrand .\n\nRickert , Heinrich 1986 . The Limits of Concept Formation in Natural Science: A Logical Introduction to the Historical Sciences . Cambridge University Press .\n\nRickert , Heinrich 1999 . Philosophische Aufsätze . Tübingen and Leipzig : Mohr .\n\nRiehl , Alois 1872 . Über Begriff und Form der Philosophie: Eine allgemeine Einführung in das Studium der Philosophie . Berlin : Carl Dunckers .\n\nRiehl , Alois 1903 . Zur Einführung in die Philosophie der Gegenwart. Acht Vorträge . Teubner : Leipzig .\n\nRosenzweig , Franz 1937 . Kleinere Schriften . Berlin : Schocken Verlag .\n\nRousseau , Jean-Jacques 1984 . A Discourse on Inequality . London : Penguin .\n\nRutherford , Ernest 1911 . “ The Scattering of α and β Particles of Matter and the Structure of the Atom ,” Philosophical Magazine 21 : 669 – 688 .\n\nSchnädelbach , Herbert 1983 . Philosophie in Deutschland 1831–1933 . Frankfurt am Main : Suhrkamp .\n\nSchlick , Moritz 1979 . “ Critical or Empiricist Interpretation of Modern Physics? Remarks on Ernst Cassirer’s Einstein’s Theory of Relativity ,” in Philosophical Papers, vol. I [1909–1922] . Dordrecht, Boston, and London : Reidel , 327 – 328 .\n\nSimmel , Georg 1890 a. “ Rembrandt als Erzieher ,” Vossische Zeitung (June 1, 1890), Sunday Supplement 22 , cols. 7–10.\n\nSimmel , Georg 1890 b. Über soziale Differenzierung. Soziologische und psychologische Untersuchungen . Leipzig : Duncker & Humblot .\n\nSimmel , Georg 1902 . “ Tendencies in German Life and Though since 1870 ,” The International Monthly 5 : 93 – 111 and 166 – 184 .\n\nSimmel , Georg 1911 . Philosophische Kultur. Über das Abenteuer, die Geschlechter und die Krise der Moderne . In Gesammelte Essais. Leipzig : Werner Klinkhardt .\n\nSimmel , Georg 1917 . Der Krieg und die geistige Entscheidung . Leipzig : Duncker & Humblot .\n\nSimmel , Georg 1918 . Der Konflikt der modernen Kultur . Munich : Duncker & Humblot .\n\nSimmel , Georg 1922 . Zur Philosophie der Kunst. Philosophische und kunstphilosophische Aufsätze . Potsdam : Kiepenheuer .\n\nSimmel , Georg 1953 . Rembrandtstudien . Darmstadt : Wissenschaftliche Buchgemeinschaft .\n\nSimmel , Georg 1980 . On the History of Philosophy. In Essays on Interpretation in Social Science . Totowa, NJ : Rowman and Littlefield , 198 – 204 .\n\nSimmel , Georg 1989 –2008. Gesamtausgabe in 24 Bände . Frankfurt am Main : Suhrkamp . –2008.\n\nSimmel , Georg 1990 a. The Philosophy of Money . London : Routledge . a.\n\nSimmel , Georg 1990 b. Vom Wesen der Moderne. Essays zur Philosophie und Ästhetik . Hamburg : Junius .\n\nSimmel , Georg 1996 . Hauptprobleme der Philosophie . In Gesamtausgabe, vol. XIV . Frankfurt am Main : Suhrkamp .\n\nSimmel , Georg 2005 . Rembrandt: An Essay in the Philosophy of Art . New York : Routledge .\n\nSimmel , Georg 2010 . The View of Life: Four Metaphysical Essays : University of Chicago Press .\n\nStadler , August 1912 . Kants Teleologie und ihre erkenntnistheoretische Bedeutung . Berlin : Dümmler .\n\nStammler , Rudolf 1896 a. Die Theorie des Anarchismus . Berlin : Häring .\n\nStammler , Rudolf 1896 b. Wirtschaft und Recht nach der materialistischen Geschichtsauffassung . Leipzig : Veit and Comp . b.\n\nStammler , Rudolf 1902 . Die Lehre von dem richtigen Rechte . Berlin : Guttentag .\n\nStammler , Rudolf 1906 . “ Wesen des Rechtes und der Rechtswissenschaft ,” in Systematische Rechtswissenschaft, vol. VIII , Die Kulture der Gegenwart II . Berlin : B. G. Teubner , 1 – 59 .\n\nStammler , Rudolf 1914 . Wirtschaft und Recht nach der materialistischen Geschichtsauffassung . Leipzig : Veit and Comp .\n\nStammler , Rudolf 1922 . Lehrbuch der Rechtsphilosophie . Berlin : Walter de Gruyter .\n\nStammler , Rudolf 1923 a. “ Fundamental Tendencies in Modern Jurisprudence ,” Michigan Law Review 21 / 6 : 623 – 654 .\n\nStammler , Rudolf 1923 b. “ Fundamental Tendencies in Modern Jurisprudence (continued) ,” Michigan Law Review 21 / 8 : 862 – 903 .\n\nStammler , Rudolf 1925 . “ Legislation and Judicial Decision ,” Michigan Law Review 23 / 4 : 362 – 381 .\n\nStammler , Rudolf 2000 . Die Lehre: The Theory of Justice . Union, NJ : Lawbook Exchange .\n\nVorländer , Karl 1893 . Der Formalismus in der Kantischen Ethik in seiner Notwendigkeit und Fruchtbarkeit . Marburg : Friedrich .\n\nWeber , Max 1968 . Economy and Society: An Outline of Interpretive Sociology , trans. Roth , Guenther and Wittich , Claus . New York : Bedminster Press .\n\nWeber , Max 1977 . Critique of Stammler . New York : Free Press .\n\nWeber , Max 1978 . Economy and Society: An Outline of Interpretive Sociology . Berkeley : University of California Press .\n\nWeber , Max 1982 . Gesammelte Aufsätze zur Wissenschaftslehre . Freiburg and Leipzig : Mohr .\n\nWeber , Max 1985 . Kritische Studien auf dem Gebiet der kulturwissenschaftlichen Logik, in Gesammelte Aufsätze zur Wissenschaftslehre . Freiburg and Leipzig : Mohr , 215 – 266 .\n\nWeber , Max 2012 . Collected Methodological Writings . London : Routledge .\n\nWeiszäcker , Karl 1937 . Review of Cassirer’s Determinism and Indeterminism . Physikalische Zeitschrift 38 : 860 – 861 .\n\nWindelband , Wilhelm 1892 . Geschichte der Philosophie . Freiburg : Mohr .\n\nWindelband , Wilhelm 1894 . Geschichte und Naturwissenschaft: Rede zum Antritt des Rectorats der Kaiser-Wilhelms-Universität Strassburg. Gehalten am 1. Mai 1894 . Strasbourg : Heitz .\n\nWindelband , Wilhelm 1900 . Platon . Stuttgart : Frommann .\n\nWindelband , Wilhelm (ed.) 1907 . Die Philosophie im Beginn des 20. Jahrhunderts: Festschrift für Kuno Fischer . Heidelberg : Carl Winter .\n\nWindelband , Wilhelm 1911 . Die Geschichte der neueren Philosophie in ihrem Zusammenhange mit der Allgemeinenkultur und den besonderen Wissenschaften . Leipzig : Breitkopf & Härtel .\n\nWindelband , Wilhelm 1915 . Präludien: Aufsätze und Reden zur Philosophie und ihrer Geschichte , vol. I . Tübingen : J. C. B. Mohr .\n\nWindelband , Wilhelm 1956 . History of Ancient Philosophy . New York : Dover .\n\nWindelband , Wilhelm 1958 a. A History of Philosophy, vol. I : Greek, Roman, Medieval . New York : Harper .\n\nWindelband , Wilhelm 1958 b. A History of Philosophy, vol. II : Renaissance, Enlightenment, and Modern . New York : Harper . b.\n\nWindelband , Wilhelm 1980 . “ History and Natural Science ,” History and Theory 19 : 165 – 185 .\n\nZeller , Eduard 1877 a. “ Über Bedeutung und Aufgabe der Erkenntnistheorie (1862) ,” in Vorträge und Abhandlungen II . Leipzig : Fues , 479 – 496 ."}]}