{"Saul David is a Professor of Military History.": [{"url": "https://sauldavid.co.uk/biography/", "page_content": "Biography\n\nSaul David was born in Monmouth in 1966 and educated at Ampleforth College and Edinburgh and Glasgow Universities (History MA and PhD).\n\nHe began writing his first history book when he was twenty-five and has now completed fifteen (one edited). They include: The Homicidal Earl: The Life of Lord Cardigan (1997), a critically-acclaimed biography of the man who led the Charge of the Light Brigade; The Indian Mutiny:1857 (2002), shortlisted for the Westminster Medal for Military Literature; Zulu: The Heroism and Tragedy of the Zulu War of 1879 (2004), a Waterstone’s Military History Book of the Year; Victoria’s Wars: The Rise of Empire (2006); All the King’s Men: The British Redcoat in the Era of Sword and Musket (2012); 100 Days to Victory: How the Great War was Fought and Won, 1914-1918 (2013); Operation Thunderbolt: Flight 139 and the Raid on Entebbe (2015), made into the feature film Entebbe; The Force: The Legendary Special Ops Unit and World War II’s Mission Impossible (2019) and Crucible of Hell: Okinawa – The Last Great Battle of the Second World War (2020), shortlisted for the 2021 British Army Military Book of the Year. He was Editorial Consultant for Dorling Kindersley’s War: From Ancient Egypt to Iraq (2009) and in 2013 edited Mud & Bodies, an infantry subaltern’s Great War diary and letters.\n\nSaul has also written three historical novels set in the late Victorian period. The Times described the first, Zulu Hart (2009), as a ‘rattling good yarn’ with ‘a compelling, sexy hero who could give Cornwell’s Sharpe a run for his money’. It was a top 5 bestseller in The Independent newspaper and sold more than 100,000 copies. Hart of Empire appeared in 2011. The third in the series, The Prince and the Whitechapel Murders, was published in 2018.\n\nAn experienced broadcaster, Saul appears often on British radio and television. His TV presenting credits include the Escape From… series for Five (2004), Sky One’s genealogy series So You Think You’re Royal? (2007) and three programmes for the BBC’s flagship history series Timewatch: The Queen’s Lover (2001), The Greatest Knight (2008) and the Queen Elizabeth’s Lost Guns (February 2009). He was an on-screen expert on BBC2’s virtual battle series Time Commanders (2004) and is a regular contributor to history programmes on all channels. Two of his books – Mutiny at Salerno and Zulu – have been made into documentaries. More recently he presented Filton’s Fabulous Flying Machines for BBC1 (June 2010) and How The Rest Got Home, a 70th anniversary programme about the British soldiers who escaped from France after Dunkirk, for Radio 4 (June 2010). His 3 x 1 hour series on the history of military logistics – Bullets, Boots and Bandages: How Wars are Really Won – was aired on BBC4 in February 2012. In 2014 he presented a documentary on World War One horses for BBC4 and appeared in a Channel 5 film on The First Great Escape and two episodes of BBC2’s The Birth of Empire. In 2015 he featured in programmes on the Spanish Armada, the Duke of Wellington, the Battle of Waterloo, the history of Spain and the secret rescue of Ethiopia’s Jews. In 2106 he presented World War Two: A Timewatch Guide and Russia: A Timewatch Guide, and appeared in a six-part series on Adolf Hitler. In 2020 he presented Prince Albert: A Victorian Hero Revealed for Channel 4. In 2021 he appears in the Netflix series Road to Victory in Colour.\n\nSaul gives frequent talks about military history and has spoken at all the major literary festivals. He has also lectured at the Security Service (MI5), the National Army Musuem and the Imperial War Museum. He has led history tours to India and the Crimea, and has appeared as a guest speaker on The World ship.\n\nSaul is a Fellow of the Royal Historical Society and a Professorial Research Fellow at the University of Buckingham’s Humanities Research Institute. From 2009 to 2021, he was Professor of Military History at the University of Buckingham and Programme Director for Buckingham’s London-based MPhil in Military History.\n\nHe lives in Somerset with his wife and three daughters."}, {"url": "https://sauldavid.co.uk/", "page_content": "Saul David is a Sunday Times bestselling military historian, novelist and broadcaster.\n\nHis history books include The Indian Mutiny (shortlisted for the Westminster Medal for Military Literature), Zulu (a Waterstone's Military History Book of the Year), and Operation Thunderbolt: Flight 139 and the Raid on Entebbe Airport (an Amazon History Book of the Year). Alan Furst commented in the New York Times Book Review: 'Tense and riveting...This is the achievement of a masterly, first-rate historian.' The film rights for Operation Thunderbolt were bought by Hollywood's Participant Media and used in the making of the motion picture 'Seven Days in Entebbe' which was released worldwide in the spring of 2018. The film is co-produced by Working Title, directed by José Padilha, and stars Rosamund Pike, Daniel Brühl and Eddie Marsan.\n\nIn 2019, he brought out The Force: The legendary Special Ops Unit and WWII's Mission Impossible, which was hailed as a \"monumental achievement\" (Douglas Brinkley) and \"an essential part of anyone's library\" (Doug Stanton). Crucible of Hell: Okinawa - The Last Great Battle of the Second World War, was published in the spring of 2020 to coincide with the 75th anniversary of the campaign, and was shortlisted for the 2021 British Army's Military Book of the Year. It was described by Antony Beevor as 'Excellent...gripping narrative' and named as an Amazon.com History Book of the Month and Daily Telegraph and Times/Sunday Times History Book of the Year. In a 5-star review in the Daily Telegraph, Simon Heffer described Saul as 'peerless now among our military historians'.\n\nSBS: Silent Warriors – The Authorized Wartime History was published on 2 September 2021 to universal praise. 'A terrific book,' wrote James Holland in the Daily Telegraph, 'written with all the gusto, thrills and head excitement these SBS operations richly deserve. It really is one of the most enjoyable histories I've read in many a year.' It was an instant Sunday Times Top 10 bestseller, entering the list at No. 9 and climbing to No. 4. It was also shortlisted for the Maritime Foundation's Mountbatten Award for Best Book of 2022.\n\nSaul's latest book, Devil Dogs: First In, Last Out - King Company from Guadalcanal to the Shores of Japan, about a company of marines fighting its way through the Pacific, was published on 15 September 2022 in the UK and US. It was given a 5-star review in the Sunday Telegraph with Simon Heffer writing: 'Superb... David has a claim to be our finest living military historian.' It has been named a Times/Sunday Times and Daily Telegraph History Book of the Year.\n\nSaul has also written three bestselling historical novels, Zulu Hart, Hart of Empire and The Prince and the Whitechapel Murders.\n\nSaul has presented and appeared in history programmes for all the major TV and streaming channels. He is a Fellow of the Royal Historical Society and a Professorial Research Fellow at the Humanities Research Institute, University of Buckingham.\n\nIn 2021, Saul founded the Military History Club, offering members exclusive digital content (in the form of newsletters, podcasts, videos and magazines), but also the opportunity to engage with top military historians around the dinner table, attend book launches and bespoke history tours, and even try their hand at writing for the club’s annual e-publication Militaria. For more details and an online application form, click on the link to the club website.\n\nIn March 2022, Saul began co-hosting the Battleground podcast with fellow military historian Patrick Bishop. The podcast began with a series on the Falklands War, and has now moved on to the ongoing conflict in Ukraine. Its many guests include Sir Max Hastings, Sir Antony Beevor, Orlando Figes, Owen Matthews, Antony Loyd, Philipps O'Brien and Generals Lord Dannatt and Sir Mike Jackson. The podcast has grown in popularity and now exceeds 100,000 downloads a week Click here to listen to the podcast"}, {"url": "https://www.historyextra.com/author/sauldavid/", "page_content": "Saul David\n\nHistorian, broadcaster and author\n\nSaul David is a historian, broadcaster and author of several acclaimed works of fiction and non-fiction, including SBS Silent Warriors: The Authorised Wartime History (William Collins, 2021), Crucible of Hell: Okinawa. The Last Great Battle of the Second World War (William Collins, 2020) and Operation Thunderbolt (Hodder & Stoughton, 2015). He is Professor of Military History at the University of Buckingham and Course Director and Tutor of Buckingham’s London-based MA in Military History by Research: The Art of War from Marlborough to Montgomery, 1701–1945"}, {"url": "http://www.militaryspeakers.co.uk/speakers/saul-david/", "page_content": "Saul David is Professor of War Studies at the University of Buckingham and his manybooks include: The Homicidal Earl: The Life of Lord Cardigan (1997), a critically-acclaimed biography of the man who led the Charge of the Light Brigade; The Indian Mutiny:1857 (2002), shortlisted for the Westminster Medal for Military Literature; Zulu: The Heroism and Tragedy of the Zulu War of 1879 (2004), a Waterstone's Military History Book of the Year; and Victoria's Wars: The Rise of Empire (2006). He has also written two bestselling historical novels set in the late Victorian period. The first, Zulu Hart (2009), was described by The Times as a 'rattling good yarn' with 'a compelling, sexy hero who could give Cornwell's Sharpe a run for his money'. His latest history - All The King's Men: The British Soldier from the Restoration to Waterloo - was published in 2012. The Sunday Times wrote: 'Those wishing to immerse themselves in this golden age of British military success will relish David's fine piece of history.'\n\nAn experienced broadcaster, Saul appears often on British television and radio. In 2012 he presented Bullets, Boots and Bandages, a 3 part series on the history of military logistics for BBC4. His other TV presenting credits include the Escape From… series for Channel Five (2004), Sky One's genealogy series So You Think You're Royal? (2007) and three programmes for the BBC's flagship history series Timewatch: The Queen's Lover (2001), The Greatest Knight (2008) and Queen Elizabeth's Lost Guns (February 2009). He was an on-screen expert on BBC2′s virtual battle series Time Commanders (2004) and is a regular contributor to history programmes on all channels. Two of his books - Mutiny at Salerno and Zulu - have been made into BBC Timewatch documentaries (1999 and 2003).\n\nSaul gives frequent talks about military history and has spoken at all the major literary festivals. He has spoken to representatives of the Defence Industry at the Royal Artillery's annual dinner, and has lectured at the Security Service (MI5), the National Army Museum and the Imperial War Museum. He has led history tours to India and the Crimea, and has appeared as a guest speaker on The World ship"}, {"url": "https://aspectsofhistory.com/authors/saul-david/", "page_content": "Alan Furst commented in the New York Times Book Review: ‘Tense and riveting…This is the achievement of a masterly, first-rate historian.’ The film rights were bought by Hollywood’s Participant Media and used in the making of the motion picture ‘Entebbe’ which was released worldwide in the spring of 2018. The film is co-produced by Working Title, directed by José Padilha, and stars Rosamund Pike, Daniel Brühl and Eddie Marsan.\n\nIn 2019, he brought out The Force: The Legendary Special Ops Unit and WWII’s Mission Impossible, which was hailed as a ‘monumental achievement’ (Douglas Brinkley), ‘an essential part of anyone’s library’ (Doug Stanton), and ‘a very fine book…masterly in style’ (Alexander Rose, Wall Street Journal). His latest book, Crucible of Hell: Okinawa – The Last Great Battle of the Second World War, was published in the spring of 2020 in the UK and US to coincide with the 75th anniversary of the campaign. It has been described by Antony Beevor as ‘Excellent…gripping narrative’ and named as an Amazon.com History Book of the Month and a Times/Sunday Times Non-fiction Book of the Year. In a five-star review in the Daily Telegraph, Simon Heffer described Saul as ‘peerless now among our military historians’.\n\nHis next book, due for publication in the autumn of 2021, is SBS: Silent Warriors – The Authorized Wartime History. The book will include previously unseen documents from the SBS Association Archives, the first-time that Britain’s top-secret maritime special forces unit has opened its doors to a historian.\n\nSaul has also written three bestselling historical novels, Zulu Hart, Hart of Empire and, published in 2018, The Prince and the Whitechapel Murders. Bernard Cornwall wrote of Saul: ‘A first-rate historian, now a masterly story teller.’\n\nHe has presented and appeared in numerous historical documentaries for all the major TV and streaming channels, including BBC1, 2 and 4, ITV1, Channel 4, Channel 5, History, National Geographic, Netflix, PBS, RMC Découverte, and Discovery.\n\nHe is Professor of Military History at the University of Buckingham where he teaches a Master’s in Military History by Research."}, {"url": "https://www.buckingham.ac.uk/study-military-history/", "page_content": "Military History degrees\n\nWith Britain having recently been more heavily involved in overseas wars than at any point in the last half-century, The University of Buckingham’s Masters in Modern War Studies and Military History courses are ideal programmes to exchange thoughts on security, diplomacy and the armed forces.\n\nDirected by some of the country’s finest military historians, Professor Saul David and Professor Lloyd Clark , these rich and stimulating postgraduate programmes will let you explore your research interests. During your studies you will be given access to historical places of interest, such as the Symposium Day at the Royal Military Academy Sandhurst.\n\nThe London-based, one-year programmes give you access to some of the most eminent scholars and authors in the field through 10 bespoke research seminars held at the Reform Club in London. Previous speakers have included: Professor N.A.M. Rodger, Sir Hew Strachan, Richard Overy, Sir Richard J. Evans, David Reynolds and Gary Sheffield, and Sir Antony Beevor."}, {"url": "https://historyreclaimed.co.uk/about-history-reclaimed/", "page_content": "About History Reclaimed\n\nOur Mission\n\nThe abuse of history for political purposes is as old as history itself. In recent years, we have seen campaigns to rewrite the history of several democratic nations in a way that undermines their solidarity as communities, their sense of achievement, even their very legitimacy.\n\nThese ‘culture wars’, pursued in the media, in public spaces, in museums, universities, schools, civil services, local government, business corporations and even churches, are particularly virulent in North America, Australasia and the United Kingdom. Activists assert that ‘facing up’ to a past presented as overwhelmingly and permanently shameful and guilt-laden is the way to a better and fairer future. We see no evidence that this is true. On the contrary, tendentious and even blatantly false readings of history are creating or aggravating divisions, resentments, and even violence. We do not take the view that our histories are uniformly praiseworthy—that would be absurd. But we reject as equally absurd the claim that they are essentially shameful.\n\nWe agree that history consists of many opinions and many voices. But this does not mean that all opinions are valid, and certainly none should be imposed as a new orthodoxy. We intend to challenge distortions of history, and to provide context, explanation and balance in a debate in which dogmatism is too often preferred to analysis, and condemnation to understanding.\n\nWho We Are\n\nWe are an independent group of scholars with a wide range of opinions on many subjects, but with the shared conviction that history requires careful interpretation of complex evidence, and should not be a vehicle for facile propaganda. We have established the History Reclaimed group as a non-profit making company limited by guarantee.\n\nIn alphabetical order:\n\nBella d’Abrera\n\nis Director of the Foundations of Western Civilization Program at the Institute of Public Affairs, Australia. She holds a BA in History from the University of Monash, an MA in Spanish from the University of St Andrews and a PhD in History from the University of Cambridge. She is currently at the forefront of the ‘Culture Wars’ in Australia.\n\nDavid Abulafia, Associate Editor\n\nis Emeritus Professor of Mediterranean History at Cambridge and a Fellow of Gonville and Caius College, a Fellow of the British Academy and a Member of the Academia Europaea. His books include The Great Sea: a Human History of the Mediterranean (2011; British Academy Medal) and The Boundless Sea: a Human History of the Oceans (2019; Wolfson History Prize, 2020). He has been appointed Commendatore dell’Ordine della Stella by the President of Italy, and is a visiting Beacon Professor at the newly-founded University of Gibraltar and a Visiting Professor at the College of Europe (Warsaw). He is a director of the HR company.\n\nNigel Aston, FRHS\n\nis an Honorary Fellow in the School of History, Politics, and International Relations at the University of Leicester where he taught for twenty years until 2019. He has written and published widely on British and French eighteenth-century religious, political, and intellectual history. His most recent publication was Negotiating Toleration: Dissent and the Hanoverian Succession 1714-1760 (2019), co-edited with Benjamin Bankhurst\n\nAnna Bailey\n\nauthor of Politics Under the Influence. Vodka and Public Policy in Putin’s Russia\n\nNigel Biggar, CBE\n\nis Regius Professor of Moral and Pastoral Theology, Oxford, and Director of the McDonald Centre for Theology, Ethics, and Public Life. His works include What’s Wrong with Rights? (2020), and Between Kin and Cosmopolis: An Ethic of the Nation (2014). His latest book, Colonialism: A Moral Reckoning will be published by William Collins in 2022. He is a member of the HR editorial advisory committee.\n\nJeremy Black, MBE\n\nis Emeritus Professor of History, University of Exeter, and the author of numerous works on British and international history.\n\nTim Blanning\n\nis Emeritus Professor of Modern European History at Cambridge, a Fellow of Sidney Sussex College, and a Fellow of the British Academy. His books include The French Revolutionary Wars; The Culture of Power and the Power of Culture; The Pursuit of Glory: Europe 1648-1815; The Triumph of Music; The Romantic Revolution; Frederick the Great King of Prussia (British Academy Medal); and George I.\n\nVernon Bogdanor CBE\n\nis Professor of Government at the Institute of Contemporary British History, King’s College, London. He was formerly Professor of Government at Oxford University. He is a Fellow of the British Academy, an Honorary Fellow of the Institute for Advanced Legal Studies, a Fellow of the Royal Historical Society, and a Fellow of the Academy of the Social Sciences. He has been an adviser to a number of governments, including those of Albania, Czech Republic, Hungary, Kosovo, Israel, Mauritius, Romania, Slovakia, Sweden and Trinidad. His books include Britain and Europe in a Troubled World (Yale University Press 2020), and he is currently writing a multi-volume work on British political history from 1895 to 1997.\n\nJohn Bonnett\n\nis Assistant Professor of History at Brock University, and from 2005-2015 was a Tier II Canada Research Chair in Digital Humanities. He is the author of Emergence and Empire (2013), which received the Gertrude K. Robinson prize.\n\nEdward Chaney\n\nis Emeritus Professor at Solent University and Honorary Professor at University College, London. He has published extensively on early-modern Anglo-Italian subjects and now works on the legacy of ancient Egypt in Shakespearean England. He is a Commendatore dell’Ordine della Stella della solidarietà italiana.\n\nJonathan Clark\n\nis Hall Distinguished Professor of British History Emeritus at the University of Kansas; he was formerly a Fellow of Peterhouse, Cambridge, and of All Souls College, Oxford; and a Visiting Professor at the Committee on Social Thought of the University of Chicago. His best known books are English Society 1660-1832 and Thomas Paine: Britain, America, and France in the Age of Enlightenment and Revolution.\n\nAlka Sehgal-Cuthbert\n\nis co-editor and contributing author of What Should Schools Teach: Disciplines, Subjects and the Pursuit of Truth; she is a member of the editorial advisory committee and a director of HR\n\nMarie Kawthar Daouda\n\nis Stipendiary Lecturer in French, Oriel College, Oxford. She studied French and English literature at La Sorbonne and at the Université de Bretagne Occidentale, and is the author of L’Anti-Salomé, représentations de la féminité bienveillante au temps de la Décadence (1850-1920). She is a member of the HR editorial advisory committee.\n\nSaul David\n\nis professor of Military History at the University of Buckingham, and a Fellow of the Royal Historical Society. His thirteen books include The Indian Mutiny (2002), Victoria’s Wars (2006), Operation Thunderbolt (2015) and Crucible of Hell (2020). Website: www.sauldavid.co.uk He is a member of the HR editorial advisory committee.\n\nRuth Dudley Edwards\n\nis a D.Litt. of the National University of Ireland, and an honorary D.Litt. from Queen’s University Belfast. She won the Prize for Irish Historical Research for her biography of Patrick Pearse and the James Tait Black Memorial Prize for Biography in 1987. Among her recent work is The Seven: The Lives and Legacies of the Founding Fathers of the Irish Republic (2016). She has served as Chairwoman of the British Association for Irish Studies, and has a Facebook free-speech page and is on Twitter at @RuthDE.\n\nChristopher Dummitt\n\nis Professor of Canadian history at Trent University in Peterborough, Canada. He writes on Canadian political, cultural, and intellectual history. His most recent books include Unbuttoned: A History of Mackenzie KIng’s Secret Life (2017) and No Place for the State (2020) and he is the creator and host of the Canadian history podcast 1867 & All That.\n\nPatrice Dutil\n\nis Professor of Politics and Public Administration at Ryerson University (Toronto, Canada) as well as Senior Fellow at the Bill Graham Centre for Contemporary History at the University of Toronto. His recent books include Prime Ministerial Power in Canada: Its Origins under Macdonald, Laurier and Borden (2017) and Embattled Nation: Canada’s Wartime Election of 1917 (2017, with David MacKenzie) and an edited volume, The Unexpected Louis St-Laurent: Politics and Policies for a Modern Canada (2020). He is the founder of The Literary Review of Canada and for many years was President of the Champlain Society.\n\nBrad Faught, FRHistS\n\nis Professor and Chair, Department of History & Global Studies, Tyndale University, and Senior Fellow, Massey College, University of Toronto. His works include Kitchener: Hero and Anti-Hero (2016) and Cairo 1921: Ten Days that Made the Middle East is forthcoming\n\nNiall Ferguson\n\nis Milbank Family Senior Fellow at the Hoover Institution, Stanford University, and a senior faculty fellow of the Belfer Center for Science and International Affairs at Harvard. He is the author of sixteen books, the latest of which is Doom: The Politics of Catastrophe (2021). He holds the Benjamin Franklin Award for Public Service. He is a member of the HR editorial advisory committee.\n\nJeff Fynn-Paul\n\nis Senior Lecturer in Economic History and International Studies at Leiden University, The Netherlands. He has published widely on Iberian, Mediterranean, and Global History, is a founding editor of the Journal of Global Slavery, and a co-editor of the Studies in Global Slavery book series for Brill. Fynn-Paul won the European History Quarterly Prize in 2016. In 2020, his Spectator article “Myth of the Stolen Country” went viral, enraging large swathes of academic twitter. His book on the history of European-New World encounters will be published by Post Hill Press in 2022.\n\nZewditu Gebreyohanes, Deputy Editor\n\nis a trustee of the Victoria & Albert Museum and Director of Restore Trust, and was formerly Head of History Matters at the think tank Policy Exchange. She served on the government commission for housing and architecture ‘Building Better, Building Beautiful’ as an assistant to its Chair, the late Sir Roger Scruton, and sits on the board of the Roger Scruton Legacy Foundation. She graduated from King’s College London in 2020 with a first in PPE.\n\nBruce Gilley\n\nis Professor of Political Science, Portland State University. He is the author of “The Case for Colonialism”, The Last Imperialist: Sir Alan Burns’ Epic Defence of the British Empire, and The German Colonial Achievement and Its Aftermath. A graduate of Princeton University and the University of Oxford, he is a member of the board of the National Association of Scholars.\n\nLawrence Goldman, Executive Editor\n\nis emeritus fellow of St. Peter’s College, Oxford. He taught British and American History in Oxford for three decades, convening the History Faculty’s Special Subject on ‘Slavery and Emancipation in the United States’. For ten years 2004-14, he was the Editor of the Oxford Dictionary of National Biography. Latterly he was Director of the Institute of Historical Research, University of London. His books include a history of workers’ education, Dons and Workers (OUP, 1995); The Life of R. H. Tawney, the historian and pre-eminent British socialist thinker (Bloomsbury, 2013); a study of the mid-Victorian Social Science Association (CUP 2002) from which the Trades’ Union Congress emerged in 1868; and his forthcoming study of the history of social statistics, Victorians and Numbers (OUP, 2022) includes chapters on working-class statisticians. He is a member of the HR editorial advisory committee and a director of the company.\n\nChristopher Hallpike\n\nis Emeritus Professor of Anthropology at McMaster University, Ontario, Canada. His books include The Foundations of Primitive Thought, The Principles of Social Evolution, Ethical Thought in Increasingly Complex Societies, The Konso of Ethiopia, Bloodshed and Vengeance in the Papuan Mountains, and Do We Need God to be Good? He conducted several years’ fieldwork in Ethiopia and Papua New Guinea, and received a D.Litt from Oxford in 1989. He is also a sometime Bye Fellow of Robinson College, Cambridge.\n\nSimon Haines\n\nis CEO of the Ramsay Centre for Western Civilisation in Sydney. Currently an Adjunct Professor at the Australian Catholic University, he was from 2009 to 2020 Chair Professor of English at The Chinese University of Hong Kong, where he is a founding Fellow of the Hong Kong Academy of the Humanities. He was Reader in English, Head of English and later Head of Humanities at the Australian National University, where he taught from 1990 to 2008. He is the author or editor of five books including the prizewinning Reader in European Romanticism (2014), Poetry and Philosophy from Homer to Rousseau (2005), and Redemption in Poetry and Philosophy (2013). He is a member of the HR editorial advisory committee.\n\nSimon Heffer\n\nis Professor of Modern British History at the University of Buckingham, and a Fellow of the Royal Historical Society. He is the author of the sequence of books High Minds, The Age of Decadence and Staring at God, and editor of the complete edition of The Diaries of Henry ‘Chips’ Channon.\n\nLawrence James\n\nis the author of The Golden Warrior: the Life and Legend of Lawrence of Arabia; The Rise and Fall of the British Empire; Raj: the Making and Unmaking of British India; Churchill and Empire: Portrait of an Imperialist, and Empires in the Sun: The Struggle for the Mastery of Africa.\n\nLiam Kennedy\n\nis emeritus professor of economic history at Queen’s University Belfast and visiting professor, Ulster University. He is a member of the Royal Irish Academy. His recent books include Unhappy the Land: The Most Oppressed People Ever, the Irish? (2016) and Who Was Responsible for the Troubles? The Northern Ireland Conflict (2020). He is a member of the HR editorial advisory committee.\n\nEric Louw\n\nhas a career spanning universities in both South Africa and Australia. He has published extensively in the fields of political communication and South Africa. His books include The Rise, Fall and Legacy of Apartheid; and Roots of the Pax Americana.\n\nNoel Malcolm\n\nis a Senior Research Fellow at All Souls College, Oxford, and a Fellow of the British Academy. His books include a history of Kosovo (1998), a 3-volume critical edition of Hobbes’s Leviathan (2012), and Useful Enemies: Islam and the Ottoman Empire in Western Political Thought, 1450-1750 (2019). He was knighted, for services to scholarship, journalism and European history, in 2014.\n\nJohn Marenbon\n\nis a Senior Research Fellow at Trinity College, Cambridge, Honorary Professor of Medieval Philosophy in the University of Cambridge, Visiting Professor at the Università della Svizzera Italiana and a Fellow of the British Academy. His publications include The Philosophy of Peter Abelard (1997), Boethius (2003), The Oxford Handbook of Medieval Philosophy (ed.) (2012), Pagans and Philosophers: the problem of paganism from Augustine to Leibniz (2015), King’s Hall, Cambridge and the Fourteenth-Century Universities. New perspectives (ed.) (2020).\n\nPaul Moon\n\nis Professor of History at the Auckland University of Technology and a Fellow of the Royal Historical Society. He was shortlisted for the 2014 Ernest Scott Australasian Prize in History. Recent works include When Darkness Stays: Hōhepa Kereopa and a Tūhoe Oral History (2020) and The Rise and Fall of James Busby: His Majesty’s British Resident in New Zealand (2020)\n\nRoger Moorhouse\n\nis a visiting professor at the College of Europe in Warsaw. His recent works include Berlin at War (2010), The Devils’ Alliance: Hitler’s Pact with Stalin (2014) and First to Fight: The Polish War, 1939 (2019), which was awarded the History Prize of the Polish Foreign Ministry. A Fellow of the Royal Historical Society, he was awarded the Order of Merit of the Republic of Poland for services to Polish history in 2020.\n\nJames Orr\n\nis University Lecturer in Philosophy of Religion at Cambridge. He is the author of The Mind of God and the Works of Nature: Laws and Powers in Naturalism, Platonism, and Classical Theism (2019)\n\nCornelia van der Poll\n\nis Lecturer in Greek at St Benet’s Hall, Oxford. Her interests include Homer and early Christian literature. She is a member of the HR editorial advisory committee.\n\nGwythian Prins, FRHistS (emeritus)\n\nis Research Professor emeritus, London School of Economics having previously taught at Cambridge and been Alliance Research Professor at Columbia in New York. He is currently Visiting Research Professor, Humanities Research Institute, University of Buckingham and Director, Cambridge Security Initiative Research Unit. His research interests and publications span African cultural and medical anthropological history for which he won the Herskovits Prize, imperial histories and geopolitics with a particular specialism in applied naval, strategic and defence history. He also served a spell in the UK Defence Research Agency. He is a member of the HR editorial advisory committee.\n\nAndrew Roberts\n\nis a Visiting Professor at the War Studies Department of King’s College, London, the Lehrman Institute Distinguished Lecturer at the New-York Historical Society and the Roger & Martha Mertz Visiting Research Fellow at the Hoover Institution at Stanford University. He is the author of fifteen books, including Napoleon the Great and Churchill: Walking with Destiny.\n\nGuy Rowlands\n\nis Professor of Early Modern History and Deputy Director of the Institute for War and Strategy at the University of St Andrews. He has also taught at Oxford, Cambridge, Bristol and Durham universities, and has held research fellowships of the British Academy and Alexander von Humboldt Institution. He is the author of several books and numerous articles on war and finance in France during the 17th and 18th centuries. He is a member of the HR editorial advisory committee and a director of the HR company.\n\nMark Stocker, FSA\n\nis former Curator, Historical International Art, at the Museum of New Zealand Te Papa Tongarewa. He has taught at the universities of Canterbury and Otago. His publications include numerous contributions to The Burlington Magazine and When Britain Went Decimal: The Coinage of 1971 (2021).\n\nDoug Stokes\n\nis Professor & Head of Research and Development, Strategy and Security Institute (SSI), University of Exeter; The Thomas Telford Associate Fellow, Council on Geo-Strategy; and an advisory council member of the Free Speech Union. He is a member of the HR editorial advisory committee.\n\nRobert Tombs, Founder Editor\n\nis Emeritus Professor of French History, Cambridge, and a Fellow of St John’s College. He holds the Palmes Académiques for services to French culture. Recent works include The English and Their History (2014), Paris, bivouac des révolutions (2014), and This Sovereign Isle: Britain In and Out of Europe (2021). He is a director of the HR company.\n\nElizabeth Weiss\n\nis Professor of Anthropology, San José State University. Her most recent book, co-authored with James W. Springer, is Repatriation and Erasing the Past (2020). Sh e is a member of the HR editorial advisory committee.\n\nEditors:\n\nLawrence Goldman is Executive Editor; David Abulafia is Associate Editor; and Zewditu Gebreyohanes and Alexander Gray are Deputy Editors.\n\nRobert Tombs is the Founder Editor of History Reclaimed.\n\nEditorial advisory committee:\n\nNigel Biggar, Marie Kawthar Daouda, Saul David, Niall Ferguson, Simon Haines, Liam Kennedy, Cornelia van der Poll, Gwythian Prins, Guy Rowlands, Alka Sehgal Cuthbert, Doug Stokes, Elizabeth Weiss\n\nWebsite Administrator:\n\nMark Chaskelson (Creative Monarchy LTD)"}, {"url": "https://www.buckingham.ac.uk/courses/research/ma-military-history-by-research", "page_content": "From Marlborough to Montgomery and MacArthur\n\nEstablished in 2009, this programme in Military History enables students to choose (with guidance) their own topic of research and to pursue this under expert one-to-one supervision. But in addition to developing their own specialist research, students also meet regularly to hear, and to dine and argue with, some of the most illustrious figures in the world of Military History: speakers including Sir Antony Beevor, Sir Hew Strachan, Simon Heffer, Richard Overy, James Holland, and Saul David, among others. Dinners are in the elegant and conveniently located surroundings of the Caledonian Club, off Belgrave Square, London SW1.\n\nThe Financial Times has reviewed the course enthusiastically, noting that “Intellectually curious professionals are signing up for a new course that gives them the opportunity to exchange thoughts on security, diplomacy and the armed forces over dinner with stellar historians and military top brass.”\n\nThe programme is directed by Professor Gary Sheffield, one of Britain’s leading historians of the First World War and President of the Western Front Association, whose many books include his edition of the diaries of Field Marshal Haig, as well as biographies of Haig and Wellington, and studies of the leadership effectiveness of officers in the trenches during the Great War.\n\nFurther details of the programme are available below and in the downloadable e-brochure, accessible via the link below.\n\nApplicants who wish to speak directly with the Course Director can do so by emailing: gary.sheffield@buckingham.ac.uk\n\n2023-24 Guest seminars and dinners\n\nAll students are invited to attend the guest seminars and dinners that follow. The cost of the post-seminar dinners is included in the tuition fees.\n\nLocation: The Caledonian Club, 9 Halkin St, London, SW1X 7DR.\n\nTime: The seminars take place from 6.30pm – 8.00pm and are followed by dinner at 8.15pm.\n\nSpeakers and subjects: The speakers will include Professors Sir Hew Strachan, Richard Overy, and Saul David, talking about a range of military history subjects on the following dates:\n\nMonday 9 October 2023 Professor Matthias Ströhn (University of Buckingham) ‘The Thirty Years War and the Emergence of Modern Warfare’. Followed by dinner at 8.15pm.\n\n(University of Buckingham) ‘The Thirty Years War and the Emergence of Modern Warfare’. Followed by dinner at 8.15pm. Monday 23 October 2023 Dr Spencer Jones (University of Wolverhampton), ‘The Battle of Mons 1914 in British History’. Followed by dinner at 8.15pm.\n\n(University of Wolverhampton), ‘The Battle of Mons 1914 in British History’. Followed by dinner at 8.15pm. Monday 6 November 2023 Dr Jennifer Wellington (University College Dublin) ‘Exhibiting War: The First World War, Museums, and Memory’. Followed by dinner at 8.15pm.\n\n(University College Dublin) ‘Exhibiting War: The First World War, Museums, and Memory’. Followed by dinner at 8.15pm. Monday 20 November 2023 Professor Sir Hew Strachan (University of St Andrews) ‘The First World War and the Ukraine War’. Followed by dinner at 8.15pm.\n\n(University of St Andrews) ‘The First World War and the Ukraine War’. Followed by dinner at 8.15pm. Monday 4 December 2023 Professor Gary Sheffield (University of Buckingham) ‘The British Empire Soldier in the Desert in the Second World War’. Followed by dinner at 8.15pm.\n\n(University of Buckingham) ‘The British Empire Soldier in the Desert in the Second World War’. Followed by dinner at 8.15pm. Monday 22 January 2024 Professor Richard Overy (University of Exeter), ‘Why War?’ Followed by dinner at 8.15pm.\n\n(University of Exeter), ‘Why War?’ Followed by dinner at 8.15pm. Monday 5 February 2024 speaker and topic tba. Followed by dinner at 8.15pm.\n\nMonday 19 February 2024 Professor Jeremy Black (University of Exeter) ‘The Making of the World Naval Power,1500-1900’. Followed by dinner at 8.15pm\n\n(University of Exeter) ‘The Making of the World Naval Power,1500-1900’. Followed by dinner at 8.15pm Monday 4 March 2024 Mr Sebastian Cox (Head of Air Historical Branch, Royal Air Force) ‘The Experience of Allied Bomber Crews in the Strategic Air Offensive Against Germany, 1939-45’. Followed by dinner at 8.15pm.\n\n(Head of Air Historical Branch, Royal Air Force) ‘The Experience of Allied Bomber Crews in the Strategic Air Offensive Against Germany, 1939-45’. Followed by dinner at 8.15pm. 18 March 2024 Professor Saul David (Independent Scholar) ‘The Siege of Delhi, 1857’ Followed by dinner at 8.15pm.\n\nAssociate students\n\nFor those who wish to attend the evening guest seminar programme, but are unable to devote the time to the coursework or to register for the MA degree, there is the option of becoming an Associate Student. This status will enable the student to attend the ten guest seminars and dinners, and to meet the guest lecturers, but does not require the submission of written work. Associate Students are not registered for and do not receive, the MA degree.\n\nGraduate Study in Military History\n\nWhat our students say\n\n“I found Buckingham’s MA in Military History by Research a very rewarding experience. After a business career in the technology sector I was able to finally devote some time to my passion for Military History. The task seemed daunting at first as it had been a long time since I was last in education and I had no knowledge of how to conduct historical research. However, the introductory course of lectures provided a solid study framework and detailed follow up discussions with my tutor enabled me to focus in on a specific historical area of interest and, more importantly, identify a particular question that needed answering.\n\nThe research-based nature of the course means at this point you embark on a solo process of discovery. Reading the existing literature and sifting the archives, both online and in person, you follow leads and gradually piece together the parts of your chosen puzzle. The course is demanding and academically rigorous with a high standard of work expected. However, the tutors are excellent and always there to support and guide your progress and check your work is of the required standard. Writing the dissertation is challenging but once completed it is a very satisfying feeling to know you have contributed to the historiography and understanding of your chosen area.\n\nWhilst most students in my intake took the one-year full-time course I undertook the two-year part-time route and found it allowed me the time and space to investigate my chosen specialist area and really enjoy the whole process without pressure. If you have the time, it may be an option to consider.\n\nIf undertaking a masters currently seems too much of a commitment I would highly recommend becoming an associate just to attend the MA course’s accompanying series of illuminating evening events hosted by Professor Saul David. Each evening involves a standalone lecture given by an eminent historian followed by a dinner and conversation. It is highly enjoyable to spend time in the company of a diverse group of people with a common passion and to be able to talk to some of the biggest names in Military History. Even though I have completed my Masters I intend to be an associate for many years to come!\n\nAndrew Thompson, Master’s (distinction), 2021\n\n“The MA by Research in Military History at The University of Buckingham offers students the opportunity to channel their passion and intellectual curiosity into an academic endeavour full of reward.\n\nThe research seminars delivered by Professor Saul David equip the student early on with a solid foundation to build on, along with a road map to begin drawing out one’s chosen topic. Accompanying these are lectures from speakers at the apex of their field, which are both informative and inspiring, set within a comfortable environment conducive to open debate.\n\nMoreover, the student support at Buckingham is second to none, with administrators on hand to answer any questions and avoid any pitfalls emerging, along with librarians available to assist in seeking out rare books. Taken together, the MA by Research in Military History guarantees a unique experience and provides the necessary tools to succeed.\n\nI thoroughly enjoyed the course and found the whole experience both character building and rewarding. It provided an excellent platform to develop a keen interest into an extensive academic project, under the watchful eyes of expert supervision. I look forward to my next project within this space.”\n\nScott Sherriff, Master’s (distinction), 2020\n\n“I completed the one-year Research MA in Military History in 2012 and subsequently went on to complete a PhD also at The University of Buckingham.\n\nLike most students, I embarked on the MA course with a longstanding interest in military history but little understanding of the skills and disciplines involved in academic research. The unique and exciting quality of the Buckingham programme is that it enables an interested amateur as I certainly was then to tackle a historical question that is entirely new and to produce a work that can withstand rigorous professional scrutiny within an incredibly short timescale.\n\nIf the opportunity provided by the Buckingham course is exciting, its strength lies in the way it combines three elements which support and guide the student. The first is a well-crafted introduction to research techniques backed by exercises to develop research and writing skills. This element is relevant and practical and it is adjusted to the needs of the individual. The second is the series of general interest lectures over the first half of the year all provided by first rank historians. These expose students to new historical problems and the latest research and the format over dinner allows genuinely stimulating debate. They provide invaluable context for the student’s individual work. However, the critical element that stands out at Buckingham is the quality of the individual guidance and supervision in selecting a research topic and then executing successive stages. I cannot rate too highly the individual supervision that I and my fellow students received. I think PhD students at the best universities would count themselves fortunate to receive the tailored support of this quality and care and not least time from some of the best historians in the United Kingdom.\n\nI would also like to commend the general administration of the Buckingham MA programme. It is a complex programme with diverse students with different requirements, a complex lecture programme and no dedicated Buckingham owned site in London. Yet the execution from logistics around successive lectures through to the examination of the final thesis and the monitoring of academic standards was close to perfect.”\n\nDr Andy Boyd, PhD, 2015\n\nFor further details contact:\n\nHumanities Research Admissions on +44 (0)1280 827514\n\nEmail: humanitiespg-admissions@buckingham.ac.uk"}, {"url": "https://www.enlightenmentevents.com/uncategorized/webinar-military-history-in-fact-and-fiction-professor-saul-david/", "page_content": "Webinar – Military History in Fact and Fiction – Professor Saul David\n\n\n\nSaul David joins us for the first in a series of webinars on August 15th. Titled, ‘Military History in Fact and Fiction’ Professor David talks about his experiences of seeing his factual history book Operation Thunderbolt turned into a movie and acting as a consultant on the film.\n\nHe will also be discussing the latest instalment in his (fictional) Zulu Hart series – The Prince and the Whitechapel Murders. This is the third fictional outing for late Victorian soldier George Hart and sees him involved with both royalty and the Jack the Ripper story.\n\nSaul David is Professor of War Studies at the University of Buckingham and the bestselling author of Zulu Hart, the first novel in the George Hart series, as well as several critically-acclaimed history books, including The Indian Mutiny: 1857 (shortlisted for the Westminster Medal for Military Literature), Zulu: The Heroism and Tragedy of the Zulu War of 1879 (a Waterstone`s Military History Book of the Year) and, most recently, Victoria`s Wars: The Rise of Empire.\n\nAn experienced broadcaster, Saul David has presented and appeared in history programmes for all the major TV channels and is a regular contributor to Radio 4. Visit Saul`s website at www.sauldavid.co.uk.\n\nAttendance is free and can be booked here: REGISTER FOR WEBINAR"}, {"url": "https://militaryhistoryclub.org/", "page_content": "Members have exclusive access to the MHC’s annual history tour.\n\nThe Military History Club Battlefield Tour to Normandy – 13-17 July 2022\n\nIntroduction:\n\nThe tour will visit the battle sites of the battle of Normandy. On 6 June 1944, the largest armada the world had ever seen appeared on the shores of northern France to open the “second front” and defeat the Wehrmacht. The fighting was hard and bloody for both sides, and it was not until August that the German defensive line could be broken. Allied material superiority was facing a numerically weaker German force which, however, often showed a fanatical will to fight – and die. In contrast to most tours, which concentrate very much on the Allied experience of the campaign, we will be looking at “both sides of the hill” and analyse both the Allied and German armies, their strategies and operational plans, and we will see how these played out on the (tactical) ground for the GI, the Tommy, and the Landser in Normandy in the summer of 1944.\n\nThe tour will be led by Prof Matthias Strohn, Visiting Professor of Military Studies at the Humanities Research Institute at the University of Buckingham, and, as Senior Associate Fellow, Head of Historical Analysis at the British Army’s think tank, CHACR. Matthias holds a commission in the German Army and has, among other deployments, served on the defence attaché staffs at the German embassies in Paris, London and Madrid. He has led over 100 battlefield tours and staff rides. In a previous deployment at the Royal Military Academy Sandhurst, he was responsible for Normandy Scholar, a joint academic-military exercise, which takes about 750 Army cadets to Normandy.\n\nDay One:\n\nMeet at Ashford International station, travel on Coach via Eurotunnel to Bayeux. Walking tour of Bayeux and introduction to the Normandy campaign\n\nDay Two:\n\nThe British Sector:\n\nWe explore the airborne attacks on Merville Battery and Pegasus Bridge. We then move on to Gold Beach to analyse the British landings and German counter-measures, and hear about the only VC won on D-Day. We finish the day at the new British D-Day memorial\n\nDay Three:\n\nThe British Sector:\n\nWe visit the German radar station at Douvres, which held out against British attacks until 17 June. We explore the German battery at Longues sur Mer and the Mulberry harbour at Arromanches before moving inland and analysing the battles at Hill 122, the ‘Verdun of Normandy’. Visit the Bayeux Tapestry Museum\n\nDay Four:\n\nThe American Sector:\n\nTravel to Omaha beach where we learn about the difficult landings and “the beast of Omaha”. Visit the US cemetery before moving on to Pointe du Hoc to learn about the US Ranger attack on the formidable German defensive position. We visit the German military cemetery at La Cambe and finish the day at the Bayeux Battle of Normandy Museum\n\nDay Five:\n\nReturn to England\n\nThroughout the tour we will be staying in the Hotel Churchill in Bayeux (http://www.hotel-churchill.fr/en/). We considered booking a chateau hotel in the countryside. But the Churchill has the advantage of being situated in the centre of Bayeux, which makes it easy to explore the city on foot. All meals (including non-alcoholic drinks and one alcoholic drink per meal) and entrance fees are included in the tour price of £1,550 for single occupant, and £1,400pp for two sharing a room.\n\nPraise for Saul David and Matthias Ströhn’s previous tours\n\nMadrid and The Battlefields of the Spanish Civil War, 20-24 October 2021:\n\nJeremy Archer: ‘Rack my brain as I might, I cannot think of a single thing that I would have done differently. Our trip was a truly excellent balance between warfare, culture and rest and recuperation. Matthias, I really don’t know how you manage to remain completely unflustered, “keeping your head when all about you are losing theirs …” Thank you particularly for making, re-making and then re-re-making the arrangements under such challenging circumstances. I am already looking forward to Northern Italy next year.’\n\nJim Ferguson: ‘Thank you again for another excellent tour. Battlefield tours just would not be the same without your knowledge, perspective and unerring instinct for an excellent restaurant! Already looking forward to 2022.’\n\nJonathan Skan: ‘Seeing the places where actual events took place really brought everything to life and I shall always remember standing on the Republican start-line overlooking Brunetta and viewing the countryside where all-arms warfare was put into practice for the first time. I can only imagine how many hours you had to spend organising our four days in Madrid, but I enjoyed it hugely and look forward to next year’s adventure.’"}], "Saul David is a Senior Fellow.": [{"url": "https://petersfraserdunlop.com/clients/saul-david/", "page_content": "Saul David was born in Monmouth in 1966 and educated at Ampleforth College and Edinburgh and Glasgow Universities (History MA and PhD).\n\nHe began writing his first history book when he was twenty-five and has now completed fifteen (one edited). They include: The Homicidal Earl: The Life of Lord Cardigan (1997), a critically-acclaimed biography of the man who led the Charge of the Light Brigade; The Indian Mutiny:1857 (2002), shortlisted for the Westminster Medal for Military Literature; Zulu: The Heroism and Tragedy of the Zulu War of 1879 (2004), a Waterstone’s Military History Book of the Year; Victoria’s Wars: The Rise of Empire (2006); All the King’s Men: The British Redcoat in the Era of Sword and Musket (2012); 100 Days to Victory: How the Great War was Fought and Won, 1914-1918 (2013); Operation Thunderbolt: Flight 139 and the Raid on Entebbe (2015), made into the feature film Entebbe; The Force: The Legendary Special Ops Unit and World War II’s Mission Impossible (2019) and Crucible of Hell: Okinawa – The Last Great Battle of the Second World War (2020), shortlisted for the 2021 British Army Military Book of the Year. He was Editorial Consultant for Dorling Kindersley’s War: From Ancient Egypt to Iraq (2009) and in 2013 edited Mud & Bodies, an infantry subaltern’s Great War diary and letters. His most recent books are SBS: Silent Warriors, the first authorised history of the Special Boat Service (2021), and Devil Dogs (2022).\n\nSaul has also written three historical novels set in the late Victorian period. The Times described the first, Zulu Hart (2009), as a ‘rattling good yarn’ with ‘a compelling, sexy hero who could give Cornwell’s Sharpe a run for his money’. It was a top 5 bestseller in The Independent newspaper and sold more than 100,000 copies. Hart of Empire appeared in 2011. The third in the series, The Prince and the Whitechapel Murders, was published in 2018.\n\nAn experienced broadcaster, Saul appears often on British radio and television. His TV presenting credits include the Escape From… series for Five (2004), Sky One’s genealogy series So You Think You’re Royal? (2007) and three programmes for the BBC’s flagship history series Timewatch: The Queen’s Lover (2001), The Greatest Knight (2008) and the Queen Elizabeth’s Lost Guns (February 2009). He was an on-screen expert on BBC2’s virtual battle series Time Commanders (2004) and is a regular contributor to history programmes on all channels. Two of his books – Mutiny at Salerno and Zulu – have been made into documentaries. More recently he presented Filton’s Fabulous Flying Machines for BBC1 (June 2010) and How The Rest Got Home, a 70th anniversary programme about the British soldiers who escaped from France after Dunkirk, for Radio 4 (June 2010). His 3 x 1 hour series on the history of military logistics – Bullets, Boots and Bandages: How Wars are Really Won – was aired on BBC4 in February 2012. In 2014 he presented a documentary on World War One horses for BBC4 and appeared in a Channel 5 film on The First Great Escape and two episodes of BBC2’s The Birth of Empire. In 2015 he featured in programmes on the Spanish Armada, the Duke of Wellington, the Battle of Waterloo, the history of Spain and the secret rescue of Ethiopia’s Jews. In 2016 he presented World War Two: A Timewatch Guide and Russia: A Timewatch Guide, and appeared in a six-part series on Adolf Hitler. In 2020 he presented Prince Albert: A Victorian Hero Revealed for Channel 4. In 2021 he appears in the Netflix series Road to Victory in Colour.\n\nSaul gives frequent talks about military history and has spoken at all the major literary festivals. He has also lectured at the Security Service (MI5), the National Army Musuem and the Imperial War Museum. He has led history tours to India and the Crimea, and has appeared as a guest speaker on The World ship.\n\nSaul is a Fellow of the Royal Historical Society, Professor of Military History at the University of Buckingham and Programme Director for Buckingham’s London-based MPhil in Military History.\n\nHe lives in Somerset with his wife and three daughters."}, {"url": "https://sauldavid.co.uk/biography/", "page_content": "Biography\n\nSaul David was born in Monmouth in 1966 and educated at Ampleforth College and Edinburgh and Glasgow Universities (History MA and PhD).\n\nHe began writing his first history book when he was twenty-five and has now completed fifteen (one edited). They include: The Homicidal Earl: The Life of Lord Cardigan (1997), a critically-acclaimed biography of the man who led the Charge of the Light Brigade; The Indian Mutiny:1857 (2002), shortlisted for the Westminster Medal for Military Literature; Zulu: The Heroism and Tragedy of the Zulu War of 1879 (2004), a Waterstone’s Military History Book of the Year; Victoria’s Wars: The Rise of Empire (2006); All the King’s Men: The British Redcoat in the Era of Sword and Musket (2012); 100 Days to Victory: How the Great War was Fought and Won, 1914-1918 (2013); Operation Thunderbolt: Flight 139 and the Raid on Entebbe (2015), made into the feature film Entebbe; The Force: The Legendary Special Ops Unit and World War II’s Mission Impossible (2019) and Crucible of Hell: Okinawa – The Last Great Battle of the Second World War (2020), shortlisted for the 2021 British Army Military Book of the Year. He was Editorial Consultant for Dorling Kindersley’s War: From Ancient Egypt to Iraq (2009) and in 2013 edited Mud & Bodies, an infantry subaltern’s Great War diary and letters.\n\nSaul has also written three historical novels set in the late Victorian period. The Times described the first, Zulu Hart (2009), as a ‘rattling good yarn’ with ‘a compelling, sexy hero who could give Cornwell’s Sharpe a run for his money’. It was a top 5 bestseller in The Independent newspaper and sold more than 100,000 copies. Hart of Empire appeared in 2011. The third in the series, The Prince and the Whitechapel Murders, was published in 2018.\n\nAn experienced broadcaster, Saul appears often on British radio and television. His TV presenting credits include the Escape From… series for Five (2004), Sky One’s genealogy series So You Think You’re Royal? (2007) and three programmes for the BBC’s flagship history series Timewatch: The Queen’s Lover (2001), The Greatest Knight (2008) and the Queen Elizabeth’s Lost Guns (February 2009). He was an on-screen expert on BBC2’s virtual battle series Time Commanders (2004) and is a regular contributor to history programmes on all channels. Two of his books – Mutiny at Salerno and Zulu – have been made into documentaries. More recently he presented Filton’s Fabulous Flying Machines for BBC1 (June 2010) and How The Rest Got Home, a 70th anniversary programme about the British soldiers who escaped from France after Dunkirk, for Radio 4 (June 2010). His 3 x 1 hour series on the history of military logistics – Bullets, Boots and Bandages: How Wars are Really Won – was aired on BBC4 in February 2012. In 2014 he presented a documentary on World War One horses for BBC4 and appeared in a Channel 5 film on The First Great Escape and two episodes of BBC2’s The Birth of Empire. In 2015 he featured in programmes on the Spanish Armada, the Duke of Wellington, the Battle of Waterloo, the history of Spain and the secret rescue of Ethiopia’s Jews. In 2106 he presented World War Two: A Timewatch Guide and Russia: A Timewatch Guide, and appeared in a six-part series on Adolf Hitler. In 2020 he presented Prince Albert: A Victorian Hero Revealed for Channel 4. In 2021 he appears in the Netflix series Road to Victory in Colour.\n\nSaul gives frequent talks about military history and has spoken at all the major literary festivals. He has also lectured at the Security Service (MI5), the National Army Musuem and the Imperial War Museum. He has led history tours to India and the Crimea, and has appeared as a guest speaker on The World ship.\n\nSaul is a Fellow of the Royal Historical Society and a Professorial Research Fellow at the University of Buckingham’s Humanities Research Institute. From 2009 to 2021, he was Professor of Military History at the University of Buckingham and Programme Director for Buckingham’s London-based MPhil in Military History.\n\nHe lives in Somerset with his wife and three daughters."}, {"url": "https://sauldavid.co.uk/", "page_content": "Saul David is a Sunday Times bestselling military historian, novelist and broadcaster.\n\nHis history books include The Indian Mutiny (shortlisted for the Westminster Medal for Military Literature), Zulu (a Waterstone's Military History Book of the Year), and Operation Thunderbolt: Flight 139 and the Raid on Entebbe Airport (an Amazon History Book of the Year). Alan Furst commented in the New York Times Book Review: 'Tense and riveting...This is the achievement of a masterly, first-rate historian.' The film rights for Operation Thunderbolt were bought by Hollywood's Participant Media and used in the making of the motion picture 'Seven Days in Entebbe' which was released worldwide in the spring of 2018. The film is co-produced by Working Title, directed by José Padilha, and stars Rosamund Pike, Daniel Brühl and Eddie Marsan.\n\nIn 2019, he brought out The Force: The legendary Special Ops Unit and WWII's Mission Impossible, which was hailed as a \"monumental achievement\" (Douglas Brinkley) and \"an essential part of anyone's library\" (Doug Stanton). Crucible of Hell: Okinawa - The Last Great Battle of the Second World War, was published in the spring of 2020 to coincide with the 75th anniversary of the campaign, and was shortlisted for the 2021 British Army's Military Book of the Year. It was described by Antony Beevor as 'Excellent...gripping narrative' and named as an Amazon.com History Book of the Month and Daily Telegraph and Times/Sunday Times History Book of the Year. In a 5-star review in the Daily Telegraph, Simon Heffer described Saul as 'peerless now among our military historians'.\n\nSBS: Silent Warriors – The Authorized Wartime History was published on 2 September 2021 to universal praise. 'A terrific book,' wrote James Holland in the Daily Telegraph, 'written with all the gusto, thrills and head excitement these SBS operations richly deserve. It really is one of the most enjoyable histories I've read in many a year.' It was an instant Sunday Times Top 10 bestseller, entering the list at No. 9 and climbing to No. 4. It was also shortlisted for the Maritime Foundation's Mountbatten Award for Best Book of 2022.\n\nSaul's latest book, Devil Dogs: First In, Last Out - King Company from Guadalcanal to the Shores of Japan, about a company of marines fighting its way through the Pacific, was published on 15 September 2022 in the UK and US. It was given a 5-star review in the Sunday Telegraph with Simon Heffer writing: 'Superb... David has a claim to be our finest living military historian.' It has been named a Times/Sunday Times and Daily Telegraph History Book of the Year.\n\nSaul has also written three bestselling historical novels, Zulu Hart, Hart of Empire and The Prince and the Whitechapel Murders.\n\nSaul has presented and appeared in history programmes for all the major TV and streaming channels. He is a Fellow of the Royal Historical Society and a Professorial Research Fellow at the Humanities Research Institute, University of Buckingham.\n\nIn 2021, Saul founded the Military History Club, offering members exclusive digital content (in the form of newsletters, podcasts, videos and magazines), but also the opportunity to engage with top military historians around the dinner table, attend book launches and bespoke history tours, and even try their hand at writing for the club’s annual e-publication Militaria. For more details and an online application form, click on the link to the club website.\n\nIn March 2022, Saul began co-hosting the Battleground podcast with fellow military historian Patrick Bishop. The podcast began with a series on the Falklands War, and has now moved on to the ongoing conflict in Ukraine. Its many guests include Sir Max Hastings, Sir Antony Beevor, Orlando Figes, Owen Matthews, Antony Loyd, Philipps O'Brien and Generals Lord Dannatt and Sir Mike Jackson. The podcast has grown in popularity and now exceeds 100,000 downloads a week Click here to listen to the podcast"}, {"url": "http://www.militaryspeakers.co.uk/speakers/saul-david/", "page_content": "Saul David is Professor of War Studies at the University of Buckingham and his manybooks include: The Homicidal Earl: The Life of Lord Cardigan (1997), a critically-acclaimed biography of the man who led the Charge of the Light Brigade; The Indian Mutiny:1857 (2002), shortlisted for the Westminster Medal for Military Literature; Zulu: The Heroism and Tragedy of the Zulu War of 1879 (2004), a Waterstone's Military History Book of the Year; and Victoria's Wars: The Rise of Empire (2006). He has also written two bestselling historical novels set in the late Victorian period. The first, Zulu Hart (2009), was described by The Times as a 'rattling good yarn' with 'a compelling, sexy hero who could give Cornwell's Sharpe a run for his money'. His latest history - All The King's Men: The British Soldier from the Restoration to Waterloo - was published in 2012. The Sunday Times wrote: 'Those wishing to immerse themselves in this golden age of British military success will relish David's fine piece of history.'\n\nAn experienced broadcaster, Saul appears often on British television and radio. In 2012 he presented Bullets, Boots and Bandages, a 3 part series on the history of military logistics for BBC4. His other TV presenting credits include the Escape From… series for Channel Five (2004), Sky One's genealogy series So You Think You're Royal? (2007) and three programmes for the BBC's flagship history series Timewatch: The Queen's Lover (2001), The Greatest Knight (2008) and Queen Elizabeth's Lost Guns (February 2009). He was an on-screen expert on BBC2′s virtual battle series Time Commanders (2004) and is a regular contributor to history programmes on all channels. Two of his books - Mutiny at Salerno and Zulu - have been made into BBC Timewatch documentaries (1999 and 2003).\n\nSaul gives frequent talks about military history and has spoken at all the major literary festivals. He has spoken to representatives of the Defence Industry at the Royal Artillery's annual dinner, and has lectured at the Security Service (MI5), the National Army Museum and the Imperial War Museum. He has led history tours to India and the Crimea, and has appeared as a guest speaker on The World ship"}, {"url": "https://www.independent.co.uk/news/people/profiles/passed-failed-an-education-in-the-life-of-saul-david-historian-and-broadcaster-844773.html", "page_content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nProfessor Saul David, 42, is the author of, among other books, Zulu and Mutiny at Salerno, which were turned into BBC2 documentaries. He presented The Greatest Knight for Timewatch in January, and is now filming Secrets of Elizabeth's Armada for the autumn. He will discuss Victoria's Wars, his latest book out in paperback, at this weekend's Althorp Literary Festival in Northampton\n\nTo get to Welsh Newton Primary School, which was (just) in England, my cousins and I would walk over the fields in a straggling line, across the border into Wales, and back again into England. We lived near Monmouth in lots of different buildings on my grandparents' big farm. At school there were more Davids than any other name: more than 20 of us cousins out of 40 pupils. When my older cousins moved on, the school had to close.\n\nIt was very old-fashioned. My brother was dyslexic and the headmaster was pretty tough on him: \"He's not really trying.\" When I was six or seven, we went to the nearest English primary school, St Weonards, about seven miles away. The teaching was good and this was the start of my beginning to shine as a student. I can trace my love of history to that school thanks to the fascinating classes of Mrs Tabor – history was her favourite subject. I think I also got the telly bug at that time when two series of The Survivors [a cult TV sci-fi] were filmed at my house and we all appeared as extras. I felt I was a star!\n\nI passed the 11-plus but it was decided that I should take the Common Entrance exam to Monmouth School, the nearest independent. I was never entirely comfortable there as they didn't have girls and they played rugby instead of football. After two years, I made a deal with my dad that if I went to the local comprehensive for three years, I would then go to his old boarding school, Ampleforth, for my sixth form.\n\nMy aunt was deputy head of John Kyrle High School, and she has always been slightly miffed that I don't mention it in my CV. I had a great time but it was the early days of it going comprehensive and, in retrospect, I realise that the education was pretty poor. It has improved hugely, I gather. I left with only seven O-levels, yet had the second- best results. I got an A in English language, but failed literature: a D. I asked for it to be re-marked and the report said: \"We think we marked you too highly.\"\n\nI died my hair blond in the summer, and at Ampleforth they said, \"You look like the guy in Bucks Fizz\", so that became my nickname. Once I'd adapted to being away from home, I loved Ampleforth. I thought then that the best history master was the one who spoon-fed us, but in fact the other master was the clever one: he made us think for ourselves. I got ABC in my A-levels and distinction in my history S-level.\n\nI got in to Trinity College, Dublin, but my LEA changed its policy of paying fees at \"foreign\" universities, so I chose Edinburgh instead, another Celtic capital. I was slightly disappointed with the quality of the teaching, although it had some fabulous historians. I worked hard at my four-year MA, but got a 2.1. That was a big disappointment as I wanted to write about history and thought I needed a First.\n\nBut I did it anyway, and at 31 I got fantastic reviews for my fourth book, The Homicidal Earl: I was a \"rising star\". On the same day I was offered a scholarship for a doctorate at Glasgow University. My best book came out of the research I did there, The Indian Mutiny. Now that I'm Visiting Professor in Military History at Hull University, I'll be telling my PhD students, \"Choose an original subject – but one that you can also sell as a book.\""}, {"url": "https://whitehorseinn.org/", "page_content": "From disciple to betrayer, Judas Iscariot is a figure with whom not many would choose to associate. It’s hard to imagine how someone could walk with Jesus and yet betray him. So why would Christ choose someone like Judas? Are we all just like him in more ways than we realize? In this episode of White Horse Inn, hosts Michael Horton, Justin Holcomb, Bob Hiller, and Walter Strickland discuss what we can learn from the story of Judas Iscariot and his kiss of betrayal.\n\nON THIS EPISODE:\n\nMichael Horton is White Horse Inn’s founder and co-host. In addition to serving as a J. Gresham Machen Professor of Systematic Theology and Apologetics at Westminster Seminary California, he is a minister in the United Reformed Churches. He is the author of more than 30 books.\n\nis White Horse Inn’s founder and co-host. In addition to serving as a J. Gresham Machen Professor of Systematic Theology and Apologetics at Westminster Seminary California, he is a minister in the United Reformed Churches. He is the author of more than 30 books. Justin Holcomb is a Senior Fellow with Sola Media’s Theo Global. He also serves as a professor and Episcopal priest. He is the author or editor of more than 20 books.\n\nis a Senior Fellow with Sola Media’s Theo Global. He also serves as a professor and Episcopal priest. He is the author or editor of more than 20 books. Bob Hiller is the Senior Pastor of Community Lutheran Church in Escondido, California. He is also the author of Finding Christ in the Straw.\n\nis the Senior Pastor of Community Lutheran Church in Escondido, California. He is also the author of Finding Christ in the Straw. Walter Strickland is Assistant Professor of Systematic and Contextual Theology at Southeastern Baptist Theological Seminary. He has contributed to, edited, and authored multiple books in his areas of research interest, which include the African American theological tradition, education theory, and theology of work.\n\nCHECK OUT THIS MONTH’S OFFERS:"}, {"url": "https://militaryhistoryclub.org/", "page_content": "Members have exclusive access to the MHC’s annual history tour.\n\nThe Military History Club Battlefield Tour to Normandy – 13-17 July 2022\n\nIntroduction:\n\nThe tour will visit the battle sites of the battle of Normandy. On 6 June 1944, the largest armada the world had ever seen appeared on the shores of northern France to open the “second front” and defeat the Wehrmacht. The fighting was hard and bloody for both sides, and it was not until August that the German defensive line could be broken. Allied material superiority was facing a numerically weaker German force which, however, often showed a fanatical will to fight – and die. In contrast to most tours, which concentrate very much on the Allied experience of the campaign, we will be looking at “both sides of the hill” and analyse both the Allied and German armies, their strategies and operational plans, and we will see how these played out on the (tactical) ground for the GI, the Tommy, and the Landser in Normandy in the summer of 1944.\n\nThe tour will be led by Prof Matthias Strohn, Visiting Professor of Military Studies at the Humanities Research Institute at the University of Buckingham, and, as Senior Associate Fellow, Head of Historical Analysis at the British Army’s think tank, CHACR. Matthias holds a commission in the German Army and has, among other deployments, served on the defence attaché staffs at the German embassies in Paris, London and Madrid. He has led over 100 battlefield tours and staff rides. In a previous deployment at the Royal Military Academy Sandhurst, he was responsible for Normandy Scholar, a joint academic-military exercise, which takes about 750 Army cadets to Normandy.\n\nDay One:\n\nMeet at Ashford International station, travel on Coach via Eurotunnel to Bayeux. Walking tour of Bayeux and introduction to the Normandy campaign\n\nDay Two:\n\nThe British Sector:\n\nWe explore the airborne attacks on Merville Battery and Pegasus Bridge. We then move on to Gold Beach to analyse the British landings and German counter-measures, and hear about the only VC won on D-Day. We finish the day at the new British D-Day memorial\n\nDay Three:\n\nThe British Sector:\n\nWe visit the German radar station at Douvres, which held out against British attacks until 17 June. We explore the German battery at Longues sur Mer and the Mulberry harbour at Arromanches before moving inland and analysing the battles at Hill 122, the ‘Verdun of Normandy’. Visit the Bayeux Tapestry Museum\n\nDay Four:\n\nThe American Sector:\n\nTravel to Omaha beach where we learn about the difficult landings and “the beast of Omaha”. Visit the US cemetery before moving on to Pointe du Hoc to learn about the US Ranger attack on the formidable German defensive position. We visit the German military cemetery at La Cambe and finish the day at the Bayeux Battle of Normandy Museum\n\nDay Five:\n\nReturn to England\n\nThroughout the tour we will be staying in the Hotel Churchill in Bayeux (http://www.hotel-churchill.fr/en/). We considered booking a chateau hotel in the countryside. But the Churchill has the advantage of being situated in the centre of Bayeux, which makes it easy to explore the city on foot. All meals (including non-alcoholic drinks and one alcoholic drink per meal) and entrance fees are included in the tour price of £1,550 for single occupant, and £1,400pp for two sharing a room.\n\nPraise for Saul David and Matthias Ströhn’s previous tours\n\nMadrid and The Battlefields of the Spanish Civil War, 20-24 October 2021:\n\nJeremy Archer: ‘Rack my brain as I might, I cannot think of a single thing that I would have done differently. Our trip was a truly excellent balance between warfare, culture and rest and recuperation. Matthias, I really don’t know how you manage to remain completely unflustered, “keeping your head when all about you are losing theirs …” Thank you particularly for making, re-making and then re-re-making the arrangements under such challenging circumstances. I am already looking forward to Northern Italy next year.’\n\nJim Ferguson: ‘Thank you again for another excellent tour. Battlefield tours just would not be the same without your knowledge, perspective and unerring instinct for an excellent restaurant! Already looking forward to 2022.’\n\nJonathan Skan: ‘Seeing the places where actual events took place really brought everything to life and I shall always remember standing on the Republican start-line overlooking Brunetta and viewing the countryside where all-arms warfare was put into practice for the first time. I can only imagine how many hours you had to spend organising our four days in Madrid, but I enjoyed it hugely and look forward to next year’s adventure.’"}, {"url": "https://www.grace-life.org/2020/06/saul-david/", "page_content": "Wednesday 06/10/20\n\nSeries: Thru the Bible\n\nShare this:\n\nThru the Bible: 1Samuel 20-25\n\n1 Samuel 20:1-42,\n\nThe relationship Jonathan and David had was special and pure. Many have attempted to to assign filthy homosexual intentions in their relationship but such was not the case. God knit these two men’s hearts together in a covenant friendship where the love one had for the other was the type of love God commanded in His law should exist between all His covenant children. To love others AS you love yourself. That is the exact way these two friends loved each other.\n\nWhen these passages say that they kissed it has the same meaning as it would say in an Italian home. They would kiss the cheek.\n\nContrary to the way it is most often used today, the word kiss in the ancient world was rarely used in a romantic way.\n\nIn the overwhelming number of cases it was an exchange between family or friends who were dear to heart and was on the checks.\n\n“(1) David fled from Naioth in Ramah and came to Jonathan and asked, “What have I done? What did I do wrong? How have I sinned against your father so that he wants to take my life?” “(2) Jonathan said to him, “No, you won’t die. Listen, my father doesn’t do anything, great or small, without telling me. So why would he hide this matter from me? This can’t be true.” “(3) But David said, “Your father certainly knows that you have come to look favorably on me. He has said, ‘Jonathan must not know of this, or else he will be grieved.'” David also swore, “As surely as the LORD lives and as you yourself live, there is but a step between me and death.” “(4) Jonathan said to David, “Whatever you say, I will do for you.” “(5) So David told him, “Look, tomorrow is the New Moon, and I’m supposed to sit down and eat with the king. Instead, let me go, and I’ll hide in the field until the third night. (6) If your father misses me at all, say, ‘David urgently requested my permission to quickly go to his town Bethlehem for an annual sacrifice there involving the whole clan.’ (7) If he says, ‘Good,’ then your servant is safe, but if he becomes angry, you will know he has evil intentions. (8) Deal faithfully with your servant, for you have brought me into a covenant before the LORD with you. If I have done anything wrong, then kill me yourself; why take me to your father?” “(9) “No!” Jonathan responded. “If I ever find out my father has evil intentions against you, wouldn’t I tell you about it?” (10) So David asked Jonathan, “Who will tell me if your father answers you harshly?” (11) He answered David, “Come on, let’s go out to the field.” So both of them went out to the field. (12) “By the LORD, the God of Israel, if I sound out my father by this time tomorrow or the next day and I find out that he is favorable toward you, and if I do not send for you and tell you, (13) then may God punish Jonathan and do so severely. If my father intends to bring evil on you, then I will tell you, and I will send you away, and you will go in peace. May the LORD be with you, just as He was with my father. (14) If I continue to live, treat me with the LORD’s faithful love, but if I die, (15) don’t ever withdraw your faithful love from my household–not even when the LORD cuts off every one of David’s enemies from the face of the earth.” (16) Then Jonathan made a covenant with the house of David, saying, “May the LORD hold David’s enemies accountable.” (17) Jonathan once again swore to David in his love for him, because he loved him as he loved himself.” “(18) Then Jonathan said to him, “Tomorrow is the New Moon; you’ll be missed because your seat will be empty. (19) The following day hurry down and go to the place where you hid on the day this incident began and stay beside the rock Ezel. (20) I will shoot three arrows beside it as if I’m aiming at a target. (21) Then I will send the young man and say, ‘Go and find the arrows!’ Now, if I expressly say to the young man, ‘Look, the arrows are on this side of you–get them,’ then come, because as the LORD lives, it is safe for you and there is no problem. (22) But if I say this to the youth: ‘Look, the arrows are beyond you!’ then go, for the LORD is sending you away. (23) As for the matter you and I have spoken about, the LORD will be a witness between you and me forever.” (24) So David hid in the field. At the New Moon, the king sat down to eat the meal. (25) He sat at his usual place on the seat by the wall. Jonathan sat facing him and Abner took his place beside Saul, but David’s place was empty. (26) Saul did not say anything that day because he thought, “Something unexpected has happened; he must be ceremonially unclean–yes, that’s it, he is unclean.” (27) However, the day after the New Moon, the second day, David’s place was still empty, and Saul asked his son Jonathan, “Why didn’t Jesse’s son come to the meal either yesterday or today?” “(28) Jonathan answered, “David asked for my permission to go to Bethlehem. (29) He said, ‘Please let me go because our clan is holding a sacrifice in the town, and my brother has told me to be there. So now, if you are pleased with me, let me go so I can see my brothers.’ That’s why he didn’t come to the king’s table.” “(30) Then Saul became angry with Jonathan and shouted, “You son of a perverse and rebellious woman! Don’t I know that you are siding with Jesse’s son to your own shame and to the disgrace of your mother? (31) Every day Jesse’s son lives on earth you and your kingship are not secure. Now send for him and bring him to me–he deserves to die.” “(32) Jonathan answered his father back: “Why is he to be killed? What has he done?” (33) Then Saul threw his spear at Jonathan to kill him, so he knew that his father was determined to kill David. (34) He got up from the table in fierce anger and did not eat any food that second day of the New Moon, for he was grieved because of his father’s shameful behavior toward David.” “(35) In the morning Jonathan went out to the field for the appointed meeting with David. A small young man was with him. (36) He said to the young man, “Run and find the arrows I’m shooting.” As the young man ran, Jonathan shot an arrow beyond him. (37) He came to the location of the arrow that Jonathan had shot, but Jonathan called to him and said, “The arrow is beyond you, isn’t it?” (38) Then Jonathan called to him, “Hurry up and don’t stop!” Jonathan’s young man picked up the arrow and returned to his master. (39) He did not know anything; only Jonathan and David knew the arrangement. (40) Then Jonathan gave his equipment to the young man who was with him and said, “Go, take it back to the city.” (41) When the young man had gone, David got up from the south side of the stone Ezel, fell with his face to the ground, and bowed three times. Then he and Jonathan kissed each other and wept with each other, though David wept more.” “(42) Jonathan then said to David, “Go in the assurance the two of us pledged in the name of the LORD when we said: The LORD will be a witness between you and me and between my offspring and your offspring forever.” Then David left, and Jonathan went into the city.”\n\nTheirs was a relationship based upon covenant and trust. It is a fitting example of the type of relationship we are to experience with God.\n\n1 Samuel 21:1-15,\n\n“(1) David went to Ahimelech the priest at Nob. Ahimelech was afraid to meet David, so he said to him, “Why are you alone and no one is with you?” “(2) David answered Ahimelech the priest, “The king gave me a mission, but he told me, ‘Don’t let anyone know anything about the mission I’m sending you on or what I have ordered you to do.’ I have stationed my young men at a certain place. (3) Now what do you have on hand? Give me five loaves of bread or whatever can be found.” “(4) The priest told him, “There is no ordinary bread on hand. However, there is consecrated bread, but the young men may eat it only if they have kept themselves from women.” “(5) David answered him, “I swear that women are being kept from us, as always when I go out to battle. The young men’s bodies are consecrated even on an ordinary mission, so of course their bodies are consecrated today.” “(6) So the priest gave him the consecrated bread, for there was no bread there except the bread of the Presence that had been removed from before the LORD. When the bread was removed, it had been replaced with warm bread.” “(7) One of Saul’s servants, detained before the LORD, was there that day. His name was Doeg the Edomite, chief of Saul’s shepherds. (8) David said to Ahimelech, “Do you have a spear or sword on hand? I didn’t even bring my sword or my weapons since the king’s mission was urgent.” “(9) The priest replied, “The sword of Goliath the Philistine, whom you killed in the valley of Elah, is here, wrapped in a cloth behind the ephod. If you want to take it for yourself, then take it, for there isn’t another one here.” “There’s none like it!” “David said. “Give it to me.” “(10) David fled that day from Saul’s presence and went to King Achish of Gath. (11) But Achish’s servants said to him, “Isn’t this David, the king of the land? Don’t they sing about him during their dances: Saul has killed his thousands, but David his tens of thousands?” “(12) David took this to heart and became very afraid of King Achish of Gath, (13) so he pretended to be insane in their presence. He acted like a madman around them, scribbling on the doors of the gate and letting saliva run down his beard. (14) “Look! You can see the man is crazy,” Achish said to his servants. “Why did you bring him to me? (15) Do I have such a shortage of crazy people that you brought this one to act crazy around me? Is this one going to come into my house?”\n\nLying and deception is in these people’s blood – dating back to Abraham. I am not sure why these are not repented of or at least spoken against in scripture but here they are, casually mentioned in passing and David even placed this last example as the prelude to one of his Psalms.\n\nPsalms 34:1-22, “(1) I will praise the LORD at all times; His praise will always be on my lips. (2) I will boast in the LORD; the humble will hear and be glad. (3) Proclaim with me the LORD’s greatness; let us exalt His name together. (4) I sought the LORD, and He answered me and delivered me from all my fears. (5) Those who look to Him are radiant with joy; their faces will never be ashamed. (6) This poor man cried, and the LORD heard him and saved him from all his troubles. (7) The angel of the LORD encamps around those who fear Him, and rescues them. (8) Taste and see that the LORD is good. How happy is the man who takes refuge in Him! (9) Fear the LORD, you His saints, for those who fear Him lack nothing. (10) Young lions lack food and go hungry, but those who seek the LORD will not lack any good thing. (11) Come, children, listen to me; I will teach you the fear of the LORD. (12) Who is the man who delights in life, loving a long life to enjoy what is good? (13) Keep your tongue from evil and your lips from deceitful speech. (14) Turn away from evil and do what is good; seek peace and pursue it. (15) The eyes of the LORD are on the righteous, and His ears are open to their cry for help. (16) The face of the LORD is set against those who do what is evil, to erase all memory of them from the earth. (17) The righteous cry out, and the LORD hears, and delivers them from all their troubles. (18) The LORD is near the brokenhearted; He saves those crushed in spirit. (19) Many adversities come to the one who is righteous, but the LORD delivers him from them all. (20) He protects all his bones; not one of them is broken. (21) Evil brings death to the sinner, and those who hate the righteous will be punished. (22) The LORD redeems the life of His servants, and all who take refuge in Him will not be punished.”\n\n1 Samuel 22:1-23,\n\nThis chapter gives testament to just how darkened a mind can become. Saul orders the execution of the Lord’s Priests and later (in the next chapter) believes God is with him and was handing David over to him.\n\n“(1) So David left Gath and took refuge in the cave of Adullam. When David’s brothers and his father’s whole family heard, they went down and joined him there. (2) In addition, every man who was desperate, in debt, or discontented rallied around him, and he became their leader. About 400 men were with him. (3) From there David went to Mizpeh of Moab where he said to the king of Moab, “Please let my father and mother stay with you until I know what God will do for me.” (4) So he left them in the care of the king of Moab, and they stayed with him the whole time David was in the stronghold.” “(5) Then the prophet Gad said to David, “Don’t stay in the stronghold. Leave and return to the land of Judah.” So David left and went to the forest of Hereth.” “(6) Saul heard that David and his men had been discovered. At that time Saul was in Gibeah, sitting under the tamarisk tree at the high place. His spear was in his hand, and all his servants were standing around him. (7) Saul said to his servants, “Listen, men of Benjamin: Is Jesse’s son going to give all of you fields and vineyards? Do you think he’ll make all of you commanders of thousands and commanders of hundreds? (8) That’s why all of you have conspired against me! Nobody tells me when my own son makes a covenant with Jesse’s son. None of you cares about me or tells me that my son has stirred up my own servant to wait in ambush for me, as is the case today.” “(9) Then Doeg the Edomite, who was in charge of Saul’s servants, answered: “I saw Jesse’s son come to Ahimelech son of Ahitub at Nob. (10) Ahimelech inquired of the LORD for him and gave him provisions. He also gave him the sword of Goliath the Philistine.” (11) The king sent messengers to summon Ahimelech the priest, son of Ahitub, and his father’s whole family, who were priests in Nob. All of them came to the king. “(12) Then Saul said, “Listen, son of Ahitub!” “I’m at your service, my lord,” he said. (13) Saul asked him, “Why did you and Jesse’s son conspire against me? You gave him bread and a sword and inquired of God for him, so he could rise up against me and wait in ambush, as is the case today.” “(14) Ahimelech replied to the king: “Who among all your servants is as faithful as David? He is the king’s son-in-law, captain of your bodyguard, and honored in your house. (15) Was today the first time I inquired of God for him? Of course not! Please don’t let the king make an accusation against your servant or any of my father’s household, for your servant didn’t have any idea about all this.” “(16) But the king said, “You will die, Ahimelech–you and your father’s whole family!” (17) Then the king ordered the guards standing by him, “Turn and kill the priests of the LORD because they sided with David. For they knew he was fleeing, but they didn’t tell me.” But the king’s servants would not lift a hand to execute the priests of the LORD. (18) So the king said to Doeg, “Go and execute the priests!” So Doeg the Edomite went and executed the priests himself. On that day, he killed 85 men who wore linen ephods. (19) He also struck down Nob, the city of the priests, with the sword–both men and women, children and infants, oxen, donkeys, and sheep.” “(20) However, one of the sons of Ahimelech son of Ahitub escaped. His name was Abiathar, and he fled to David. (21) Abiathar told David that Saul had killed the priests of the LORD. (22) Then David said to Abiathar, “I knew that Doeg the Edomite was there that day and that he was sure to report to Saul. I myself am responsible for the lives of everyone in your father’s family. (23) Stay with me. Don’t be afraid, for the one who wants to take my life wants to take your life. You will be safe with me.”\n\n1 Samuel 23:1-29,\n\n“(1) It was reported to David: “Look, the Philistines are fighting against Keilah and raiding the threshing floors.” (2) So David inquired of the LORD: “Should I launch an attack against these Philistines?” The LORD answered David, “Launch an attack against the Philistines and rescue Keilah.” (3) But David’s men said to him, “Look, we’re afraid here in Judah; how much more if we go to Keilah against the Philistine forces!” (4) Once again, David inquired of the LORD, and the LORD answered him: “Go at once to Keilah, for I will hand the Philistines over to you.” (5) Then David and his men went to Keilah, fought against the Philistines, drove their livestock away, and inflicted heavy losses on them. So David rescued the inhabitants of Keilah. (6) Abiathar son of Ahimelech fled to David at Keilah, and he brought an ephod with him.” “(7) When it was reported to Saul that David had gone to Keilah, he said, “God has handed him over to me, for he has trapped himself by entering a town with barred gates.” (8) Then Saul summoned all the troops to go to war at Keilah and besiege David and his men.” “ (9) When David learned that Saul was plotting evil against him, he said to Abiathar the priest, “Bring the ephod.” (10) Then David said, “LORD God of Israel, Your servant has heard that Saul intends to come to Keilah and destroy the town because of me. (11) Will the citizens of Keilah hand me over to him? Will Saul come down as Your servant has heard? LORD God of Israel, please tell Your servant.” The LORD answered, “He will come down.” (12) Then David asked, “Will the citizens of Keilah hand me and my men over to Saul?” “They will,” the LORD responded. (13) So David and his men, numbering about 600, left Keilah at once and moved from place to place. When it was reported to Saul that David had escaped from Keilah, he called off the expedition. (14) David then stayed in the wilderness strongholds and in the hill country of the Wilderness of Ziph. Saul searched for him every day, but God did not hand David over to him. (15) David was in the Wilderness of Ziph in Horesh when he saw that Saul had come out to take his life.” “(16) Then Saul’s son Jonathan came to David in Horesh and encouraged him in his faith in God, (17) saying, “Don’t be afraid, for my father Saul will never lay a hand on you. You yourself will be king over Israel, and I’ll be your second-in-command. Even my father Saul knows it is true.” (18) Then the two of them made a covenant in the LORD’s presence. Afterwards, David remained in Horesh, while Jonathan went home.” “(19) Some Ziphites came up to Saul at Gibeah and said, “David is hiding among us in the strongholds in Horesh on the hill of Hachilah south of Jeshimon. (20) Now, whenever the king wants to come down, let him come down. Our part will be to hand him over to the king.” (21) “May you be blessed by the LORD,” replied Saul, “for you have taken pity on me. (22) Go and check again. Investigate and watch carefully where he goes and who has seen him there; they tell me he is extremely cunning. (23) Look and find out all the places where he hides. Then come back to me with accurate information, and I’ll go with you. If it turns out he really is in the region, I’ll search for him among all the clans of Judah.” (24) So they went to Ziph ahead of Saul.” “Now David and his men were in the wilderness near Maon in the Arabah south of Jeshimon, (25) and Saul and his men went to look for him. When David was told about it, he went down to the rock and stayed in the Wilderness of Maon. Saul heard of this and pursued David there. (26) Saul went along one side of the mountain and David and his men went along the other side. Even though David was hurrying to get away from Saul, Saul and his men were closing in on David and his men to capture them. (27) Then a messenger came to Saul saying, “Come quickly, because the Philistines have raided the land!” (28) So Saul broke off his pursuit of David and went to engage the Philistines. Therefore, that place was named the Rock of Separation. (29) From there David went up and stayed in the strongholds of En-gedi.”\n\n1 Samuel 24:1-22,\n\nDavid spares Saul’s life because he believes Saul to still be God’s anointed and God honors David’s conscience concerning this. Yet, later David intended to kill a man’s servants just for snubbing him. The morality seems more than just a little off, but we are dealing with a time of relative light – where men who loved God did so as best as they understood, but their understanding and follow through was often poor.\n\nOne thing seems for certain, David was a man of passion – like Peter and God seems to like passion!\n\n“(1) When Saul returned from pursuing the Philistines, he was told, “David is in the wilderness near En-gedi.” (2) So Saul took 3,000 of Israel’s choice men and went to look for David and his men in front of the Rocks of the Wild Goats. (3) When Saul came to the sheep pens along the road, a cave was there, and he went in to relieve himself. David and his men were staying in the back of the cave, (4) so they said to him, “Look, this is the day the LORD told you about: ‘I will hand your enemy over to you so you can do to him whatever you desire.'” Then David got up and secretly cut off the corner of Saul’s robe. (5) Afterwards, David’s conscience bothered him because he had cut off the corner of Saul’s robe. (6) He said to his men, “I swear before the LORD: I would never do such a thing to my lord, the LORD’s anointed. I will never lift my hand against him, since he is the LORD’s anointed.” (7) With these words David persuaded his men, and he did not let them rise up against Saul. Then Saul left the cave and went on his way.” “(8) After that, David got up, went out of the cave, and called to Saul, “My lord the king!” When Saul looked behind him, David bowed to the ground in homage. (9) David said to Saul, “Why do you listen to the words of people who say, ‘Look, David intends to harm you’? (10) You can see with your own eyes that the LORD handed you over to me today in the cave. Someone advised me to kill you, but I took pity on you and said: I won’t lift my hand against my lord, since he is the LORD’s anointed. (11) See, my father! Look at the corner of your robe in my hand, for I cut it off, but I didn’t kill you. Look and recognize that there is no evil or rebellion in me. I haven’t sinned against you even though you are hunting me down to take my life. (12) “May the LORD judge between you and me, and may the LORD take vengeance on you for me, but my hand will never be against you. (13) As the old proverb says, ‘Wickedness comes from wicked people.’ My hand will never be against you. (14) Who has the king of Israel come after? What are you chasing after? A dead dog? A flea? (15) May the LORD be judge and decide between you and me. May He take notice and plead my case and deliver me from you.” “(16) When David finished saying these things to him, Saul replied, “Is that your voice, David my son?” Then Saul wept aloud (17) and said to David, “You are more righteous than I, for you have done what is good to me though I have done what is evil to you. (18) You yourself have told me today what good you did for me: when the LORD handed me over to you, you didn’t kill me. (19) When a man finds his enemy, does he let him go unharmed? May the LORD repay you with good for what you’ve done for me today. (20) “Now I know for certain you will be king, and the kingdom of Israel will be established in your hand. (21) Therefore swear to me by the LORD that you will not cut off my descendants or wipe out my name from my father’s family.” (22) So David swore to Saul. Then Saul went back home, and David and his men went up to the stronghold.”\n\n1 Samuel 25:1-44,\n\nFor all his quickness to passion, David was also quick to listen and judge his own heart. This too is a reason for God calling David a man after His Own Heart.\n\n“(1) Samuel died, and all Israel assembled to mourn for him, and they buried him by his home in Ramah. David then went down to the Wilderness of Paran. (2) A man in Maon had a business in Carmel; he was a very rich man with 3,000 sheep and 1,000 goats and was shearing his sheep in Carmel. (3) The man’s name was Nabal, and his wife’s name, Abigail. The woman was intelligent and beautiful, but the man, a Calebite, was harsh and evil in his dealings. (4) While David was in the wilderness, he heard that Nabal was shearing sheep, (5) so David sent 10 young men instructing them, “Go up to Carmel, and when you come to Nabal, greet him in my name. (6) Then say this: ‘Long life to you, and peace to you, to your family, and to all that is yours. (7) I hear that you are shearing. When your shepherds were with us, we did not harass them, and nothing of theirs was missing the whole time they were in Carmel. (8) Ask your young men, and they will tell you. So let my young men find favor with you, for we have come on a feast day. Please give whatever you can afford to your servants and to your son David.'” “(9) David’s young men went and said all these things to Nabal on David’s behalf, and they waited. (10) Nabal asked them, “Who is David? Who is Jesse’s son? Many slaves these days are running away from their masters. (11) Am I supposed to take my bread, my water, and my meat that I butchered for my shearers and give them to men who are from I don’t know where?” “(12) David’s men retraced their steps. When they returned to him, they reported all these words. (13) He said to his men, “All of you, put on your swords!” So David and all his men put on their swords. About 400 men followed David while 200 stayed with the supplies. (14) One of Nabal’s young men informed Abigail, Nabal’s wife: “Look, David sent messengers from the wilderness to greet our master, but he yelled at them. (15) The men treated us well. When we were in the field, we weren’t harassed and nothing of ours was missing the whole time we were living among them. (16) They were a wall around us, both day and night, the entire time we were herding the sheep. (17) Now consider carefully what you must do, because there is certain to be trouble for our master and his entire family. He is such a worthless fool nobody can talk to him!” “(18) Abigail hurried, taking 200 loaves of bread, two skins of wine, five butchered sheep, a bushel of roasted grain, 100 clusters of raisins, and 200 cakes of pressed figs, and loaded them on donkeys. (19) Then she said to her male servants, “Go ahead of me. I will be right behind you.” But she did not tell her husband Nabal. (20) As she rode the donkey down a mountain pass hidden from view, she saw David and his men coming toward her and met them. (21) David had just said, “I guarded everything that belonged to this man in the wilderness for nothing. He was not missing anything, yet he paid me back evil for good. (22) May God punish me, and even more if I let any of his men survive until morning.” (23) When Abigail saw David, she quickly got off the donkey and fell with her face to the ground in front of David. (24) She fell at his feet and said, “The guilt is mine, my lord, but please let your servant speak to you directly. Listen to the words of your servant. (25) My lord should pay no attention to this worthless man Nabal, for he lives up to his name: His name is Nabal, and stupidity is all he knows. I, your servant, didn’t see my lord’s young men whom you sent. (26) Now my lord, as surely as the LORD lives and as you yourself live, it is the LORD who kept you from participating in bloodshed and avenging yourself by your own hand. May your enemies and those who want trouble for my lord be like Nabal. (27) Accept this gift your servant has brought to my lord, and let it be given to the young men who follow my lord. (28) Please forgive your servant’s offense, for the LORD is certain to make a lasting dynasty for my lord because he fights the LORD’s battles. Throughout your life, may evil not be found in you. (29) “When someone pursues you and attempts to take your life, my lord’s life will be tucked safely in the place where the LORD your God protects the living. However, He will fling away your enemies’ lives like stones from a sling. (30) When the LORD does for my lord all the good He promised and appoints you ruler over Israel, (31) there will not be remorse or a troubled conscience for my lord because of needless bloodshed or my lord’s revenge. And when the LORD does good things for my lord, may you remember me your servant.” “(32) Then David said to Abigail, “Praise to the LORD God of Israel, who sent you to meet me today! (33) Blessed is your discernment, and blessed are you. Today you kept me from participating in bloodshed and avenging myself by my own hand. (34) Otherwise, as surely as the LORD God of Israel lives, who prevented me from harming you, if you had not come quickly to meet me, Nabal wouldn’t have had any men left by morning light.” (35) Then David accepted what she had brought him and said, “Go home in peace. See, I have heard what you said and have granted your request.” “(36) Then Abigail went to Nabal, and there he was in his house, feasting like a king. Nabal was in a good mood and very drunk, so she didn’t say anything to him until morning light. (37) In the morning when Nabal sobered up, his wife told him about these events. Then he had a seizure and became paralyzed. (38) About 10 days later, the LORD struck Nabal dead.” “(39) When David heard that Nabal was dead, he said, “Praise the LORD who championed my cause against Nabal’s insults and restrained His servant from doing evil. The LORD brought Nabal’s evil deeds back on his own head.” Then David sent messengers to speak to Abigail about marrying him. (40) When David’s servants came to Abigail at Carmel, they said to her, “David sent us to bring you to him as a wife.” (41) She bowed her face to the ground and said, “Here I am, your servant, to wash the feet of my lord’s servants.” (42) Then Abigail got up quickly, and with her five female servants accompanying her, rode on the donkey following David’s messengers. And so she became his wife. (43) David also married Ahinoam of Jezreel, and the two of them became his wives. (44) But Saul gave his daughter Michal, David’s wife, to Palti son of Laish, who was from Gallim.”\n\nBlessings!\n\n\n\n\n\nI hope this teaching will challenge you and encourage you to place your trust in the Lord Jesus Christ as Savior and Lord.\n\nYou have a special place in God’s family & kingdom. If you do not know Him, please use our ‘Contact Us‘ page and reach out so we may have the privilege of introducing you to the Lord. Neither money nor attendance at our church will be mentioned.\n\nIf you have been spiritually fed by this ministry and wish to give, we truly appreciate that and you may do so here, but all outreaches of this ministry are FREE for you and anyone to enjoy at no cost.\n\nBlessings!"}, {"url": "https://www.crosswalk.com/faith/bible-study/what-can-we-learn-from-the-relationship-between-david-and-saul.html", "page_content": "What Is the Story of David and Saul?\n\nWhile there are a few Psalms and other places in Scripture dealing with their relationship, the most prominent place to observe the relationship between these two men is 1 Samuel 15-31. The reader can see a definite shift in the narrative between 1 Samuel 15 and 16. Saul is rejected by the LORD in one chapter and the boy David is anointed by the Lord as the king to take his place. The readers of 1 Samuel are given clues to the rejection of Saul and the rise of David, but as the story played out in real-time it would have likely been far more jolting to David.\n\nOT scholar, Robert Bergen, has argued pretty definitively that the narrator of 1 Samuel portrays David as the most loyal and devoted of Saul’s citizens. When Saul was tormented by an evil spirit, it was David who stepped in. When Saul’s army was on the brink of humiliation it was the young David who rose to Goliath’s challenge. He did everything that Saul asked of him. But in 1 Samuel 18 we read that Saul became jealous of the accolades given to David. Everything goes south in the relationship from this point forward.\n\nFrom David’s perspective, there is no indication that he knew anything was going on until Jonathan (Saul’s son and David’s best friend) warned David of Saul’s murderous intentions. At this point, David was also Saul’s son-in-law. Saul had given his daughter, Michal, to David as an attempt to ensnare him. But to David, this would have been further evidence of his favor with the king. How confusing it must have been for David to realize that even his marriage was an attempt by Saul to keep power.\n\nJonathan was able to keep Saul’s jealousy at bay for a season, but eventually, Saul was overcome and obsessed with removing this threat, David, from his kingdom. David had to flee. The rest of 1 Samuel is David running from Saul until it ends with Saul’s death. It is during this time that many Psalms were written by David (Psalm 18, 57, 59, 63, 70, and 142). At one climactic point in the narrative, Saul is relieving himself in the very cave in which David was hiding. Saul has no idea that David is present. Saul’s life was in David’s hands, but David responded with integrity and preserved Saul but cut off a piece of his robe. Later when the two meet and Saul realizes that David could have killed him exclaims thusly:\n\n“You are more righteous than I,” he said. “You have treated me well, but I have treated you badly. You have just now told me about the good you did to me; the Lord delivered me into your hands, but you did not kill me. When a man finds his enemy, does he let him get away unharmed? May the Lord reward you well for the way you treated me today. I know that you will surely be king and that the kingdom of Israel will be established in your hands. Now swear to me by the Lord that you will not kill off my descendants or wipe out my name from my father’s family.” (1 Samuel 24:17-21)\n\nThis is an apt summary of their relationship. David was the man with integrity (at least at this stage of his life) and Saul was the one who was rejected by the LORD. Saul was the one who held power but through his grasping of that power, he eventually forfeited it. David was the one with real power as exemplified in his self-control in that cave where he could have taken Saul’s life. David was, in a sense, loyal to Saul even after Saul’s death. David kept this vow and honored Saul’s family line."}, {"url": "https://www.amazon.co.uk/kindle-dbs/entity/author/B001JS8PNQ?pageSize=12&page=2&langFilter=default", "page_content": "'David is extremely good at interweaving the different stands of his narrative. He has an eye for the apt quotation and the telling anecdoate… He is a historian of enormous promise who might one day become the Hibbert of the next generation.' Amanda Foreman, Sunday Times\n\n\n\n\n\nA wonderful portrait of George IV and his time - the first in 25 years.\n\n\n\n\n\nDescribed by the Duke of Wellington as 'the most extraordinary compound of talent, wit, buffoonery, obstinacy and good feeling that I ever saw in one character in my life', George Augustus Frederick, Prince of Wales, later George IV, was a highly controversial figure. He courted both Whigs and Tories in his attempts to establish the Regency during the 'madness' of his father, George III. Scandalous liaisons with prostitutes and duchesses, and his 'secret' marriage to the Catholic Mrs Fitzherbert, tested his duty - to nation and to family. Yet his support for overseas campaigns against Napoleon, culminating in such historic victories as Trafalgar and Waterloo, consolidated Britain's status as the pre-eminent world power amid the great social and economic upheavals of the Industrial Revolution.\n\n\n\n\n\nDrawing on a wealth of original accounts of life in Georgian Britain, Saul David has created a masterly portrait - of a flamboyant, opportunistic and influential figure, and of a nation in a time of great change.\n\n\n\n\n\nSaul David is Professor of War Studies at the University of Buckingham and the author of several critically-acclaimed history books, including The Indian Mutiny: 1857 (shortlisted for the Westminster Medal for Military Literature), Zulu: The Heroism and Tragedy of the Zulu War of 1879 (a Waterstone's Military History Book of the Year) and Victoria's Wars: The Rise of Empire.\n\n\n\n\n\nSaul David also writes acclaimed historical fiction. Zulu Hart, the first in the George Hart series, was a bestseller in 2009, followed by Hart of Empire in 2010.\n\n\n\n\n\nAn experienced broadcaster, Saul David has presented and appeared in history programmes for all the major TV channels and is a regular contributor to Radio 4.\n\n\n\n\n\nPraise for Saul's books:\n\n\n\n\n\n'I do not think there is a better one-volume account of this rogue prince. The author knows his stuff, weaves his way deftly through the politicking of the era without making it boring, and splendidly brings to life the endless amours of the man with a long succession of mistresses.' Roy Strong, Country Life\n\n\n\n\n\n'Lively and lucid… David has insight, scholarly understanding and flashes of wit worthy of the Regency satirists themselves.' Jenny Uglow, TLS\n\n\n\n\n\n'Filled with swashbuckling derring-do, the reek of blood and gunpowder, combined with shrewd analysis of power, war and psychology' Simon Sebag Montefiore\n\n\n\n\n\n'Those wishing to immerse themselves in this golden age of British military success will relish David's fine piece of history' Sunday Times\n\n\n\n\n\n'A first-rate historian, now a masterly story-teller' Bernard Cornwell\n\n\n\n\n\n'David is a popular historian with a rare talent . . . An unashamed crowd-pleaser with a compelling, sexy hero who could give Cornwell's Sharpe a run for his money.' The Times"}], "Saul David is affiliated with the University of Buckingham.": [{"url": "https://sauldavid.co.uk/biography/", "page_content": "Biography\n\nSaul David was born in Monmouth in 1966 and educated at Ampleforth College and Edinburgh and Glasgow Universities (History MA and PhD).\n\nHe began writing his first history book when he was twenty-five and has now completed fifteen (one edited). They include: The Homicidal Earl: The Life of Lord Cardigan (1997), a critically-acclaimed biography of the man who led the Charge of the Light Brigade; The Indian Mutiny:1857 (2002), shortlisted for the Westminster Medal for Military Literature; Zulu: The Heroism and Tragedy of the Zulu War of 1879 (2004), a Waterstone’s Military History Book of the Year; Victoria’s Wars: The Rise of Empire (2006); All the King’s Men: The British Redcoat in the Era of Sword and Musket (2012); 100 Days to Victory: How the Great War was Fought and Won, 1914-1918 (2013); Operation Thunderbolt: Flight 139 and the Raid on Entebbe (2015), made into the feature film Entebbe; The Force: The Legendary Special Ops Unit and World War II’s Mission Impossible (2019) and Crucible of Hell: Okinawa – The Last Great Battle of the Second World War (2020), shortlisted for the 2021 British Army Military Book of the Year. He was Editorial Consultant for Dorling Kindersley’s War: From Ancient Egypt to Iraq (2009) and in 2013 edited Mud & Bodies, an infantry subaltern’s Great War diary and letters.\n\nSaul has also written three historical novels set in the late Victorian period. The Times described the first, Zulu Hart (2009), as a ‘rattling good yarn’ with ‘a compelling, sexy hero who could give Cornwell’s Sharpe a run for his money’. It was a top 5 bestseller in The Independent newspaper and sold more than 100,000 copies. Hart of Empire appeared in 2011. The third in the series, The Prince and the Whitechapel Murders, was published in 2018.\n\nAn experienced broadcaster, Saul appears often on British radio and television. His TV presenting credits include the Escape From… series for Five (2004), Sky One’s genealogy series So You Think You’re Royal? (2007) and three programmes for the BBC’s flagship history series Timewatch: The Queen’s Lover (2001), The Greatest Knight (2008) and the Queen Elizabeth’s Lost Guns (February 2009). He was an on-screen expert on BBC2’s virtual battle series Time Commanders (2004) and is a regular contributor to history programmes on all channels. Two of his books – Mutiny at Salerno and Zulu – have been made into documentaries. More recently he presented Filton’s Fabulous Flying Machines for BBC1 (June 2010) and How The Rest Got Home, a 70th anniversary programme about the British soldiers who escaped from France after Dunkirk, for Radio 4 (June 2010). His 3 x 1 hour series on the history of military logistics – Bullets, Boots and Bandages: How Wars are Really Won – was aired on BBC4 in February 2012. In 2014 he presented a documentary on World War One horses for BBC4 and appeared in a Channel 5 film on The First Great Escape and two episodes of BBC2’s The Birth of Empire. In 2015 he featured in programmes on the Spanish Armada, the Duke of Wellington, the Battle of Waterloo, the history of Spain and the secret rescue of Ethiopia’s Jews. In 2106 he presented World War Two: A Timewatch Guide and Russia: A Timewatch Guide, and appeared in a six-part series on Adolf Hitler. In 2020 he presented Prince Albert: A Victorian Hero Revealed for Channel 4. In 2021 he appears in the Netflix series Road to Victory in Colour.\n\nSaul gives frequent talks about military history and has spoken at all the major literary festivals. He has also lectured at the Security Service (MI5), the National Army Musuem and the Imperial War Museum. He has led history tours to India and the Crimea, and has appeared as a guest speaker on The World ship.\n\nSaul is a Fellow of the Royal Historical Society and a Professorial Research Fellow at the University of Buckingham’s Humanities Research Institute. From 2009 to 2021, he was Professor of Military History at the University of Buckingham and Programme Director for Buckingham’s London-based MPhil in Military History.\n\nHe lives in Somerset with his wife and three daughters."}, {"url": "http://www.militaryspeakers.co.uk/speakers/saul-david.aspx", "page_content": "Saul David is Professor of War Studies at the University of Buckingham and his manybooks include: The Homicidal Earl: The Life of Lord Cardigan (1997), a critically-acclaimed biography of the man who led the Charge of the Light Brigade; The Indian Mutiny:1857 (2002), shortlisted for the Westminster Medal for Military Literature; Zulu: The Heroism and Tragedy of the Zulu War of 1879 (2004), a Waterstone's Military History Book of the Year; and Victoria's Wars: The Rise of Empire (2006). He has also written two bestselling historical novels set in the late Victorian period. The first, Zulu Hart (2009), was described by The Times as a 'rattling good yarn' with 'a compelling, sexy hero who could give Cornwell's Sharpe a run for his money'. His latest history - All The King's Men: The British Soldier from the Restoration to Waterloo - was published in 2012. The Sunday Times wrote: 'Those wishing to immerse themselves in this golden age of British military success will relish David's fine piece of history.'\n\nAn experienced broadcaster, Saul appears often on British television and radio. In 2012 he presented Bullets, Boots and Bandages, a 3 part series on the history of military logistics for BBC4. His other TV presenting credits include the Escape From… series for Channel Five (2004), Sky One's genealogy series So You Think You're Royal? (2007) and three programmes for the BBC's flagship history series Timewatch: The Queen's Lover (2001), The Greatest Knight (2008) and Queen Elizabeth's Lost Guns (February 2009). He was an on-screen expert on BBC2′s virtual battle series Time Commanders (2004) and is a regular contributor to history programmes on all channels. Two of his books - Mutiny at Salerno and Zulu - have been made into BBC Timewatch documentaries (1999 and 2003).\n\nSaul gives frequent talks about military history and has spoken at all the major literary festivals. He has spoken to representatives of the Defence Industry at the Royal Artillery's annual dinner, and has lectured at the Security Service (MI5), the National Army Museum and the Imperial War Museum. He has led history tours to India and the Crimea, and has appeared as a guest speaker on The World ship"}, {"url": "https://www.buckingham.ac.uk/courses/research/ma-military-history-by-research", "page_content": "From Marlborough to Montgomery and MacArthur\n\nEstablished in 2009, this programme in Military History enables students to choose (with guidance) their own topic of research and to pursue this under expert one-to-one supervision. But in addition to developing their own specialist research, students also meet regularly to hear, and to dine and argue with, some of the most illustrious figures in the world of Military History: speakers including Sir Antony Beevor, Sir Hew Strachan, Simon Heffer, Richard Overy, James Holland, and Saul David, among others. Dinners are in the elegant and conveniently located surroundings of the Caledonian Club, off Belgrave Square, London SW1.\n\nThe Financial Times has reviewed the course enthusiastically, noting that “Intellectually curious professionals are signing up for a new course that gives them the opportunity to exchange thoughts on security, diplomacy and the armed forces over dinner with stellar historians and military top brass.”\n\nThe programme is directed by Professor Gary Sheffield, one of Britain’s leading historians of the First World War and President of the Western Front Association, whose many books include his edition of the diaries of Field Marshal Haig, as well as biographies of Haig and Wellington, and studies of the leadership effectiveness of officers in the trenches during the Great War.\n\nFurther details of the programme are available below and in the downloadable e-brochure, accessible via the link below.\n\nApplicants who wish to speak directly with the Course Director can do so by emailing: gary.sheffield@buckingham.ac.uk\n\n2023-24 Guest seminars and dinners\n\nAll students are invited to attend the guest seminars and dinners that follow. The cost of the post-seminar dinners is included in the tuition fees.\n\nLocation: The Caledonian Club, 9 Halkin St, London, SW1X 7DR.\n\nTime: The seminars take place from 6.30pm – 8.00pm and are followed by dinner at 8.15pm.\n\nSpeakers and subjects: The speakers will include Professors Sir Hew Strachan, Richard Overy, and Saul David, talking about a range of military history subjects on the following dates:\n\nMonday 9 October 2023 Professor Matthias Ströhn (University of Buckingham) ‘The Thirty Years War and the Emergence of Modern Warfare’. Followed by dinner at 8.15pm.\n\n(University of Buckingham) ‘The Thirty Years War and the Emergence of Modern Warfare’. Followed by dinner at 8.15pm. Monday 23 October 2023 Dr Spencer Jones (University of Wolverhampton), ‘The Battle of Mons 1914 in British History’. Followed by dinner at 8.15pm.\n\n(University of Wolverhampton), ‘The Battle of Mons 1914 in British History’. Followed by dinner at 8.15pm. Monday 6 November 2023 Dr Jennifer Wellington (University College Dublin) ‘Exhibiting War: The First World War, Museums, and Memory’. Followed by dinner at 8.15pm.\n\n(University College Dublin) ‘Exhibiting War: The First World War, Museums, and Memory’. Followed by dinner at 8.15pm. Monday 20 November 2023 Professor Sir Hew Strachan (University of St Andrews) ‘The First World War and the Ukraine War’. Followed by dinner at 8.15pm.\n\n(University of St Andrews) ‘The First World War and the Ukraine War’. Followed by dinner at 8.15pm. Monday 4 December 2023 Professor Gary Sheffield (University of Buckingham) ‘The British Empire Soldier in the Desert in the Second World War’. Followed by dinner at 8.15pm.\n\n(University of Buckingham) ‘The British Empire Soldier in the Desert in the Second World War’. Followed by dinner at 8.15pm. Monday 22 January 2024 Professor Richard Overy (University of Exeter), ‘Why War?’ Followed by dinner at 8.15pm.\n\n(University of Exeter), ‘Why War?’ Followed by dinner at 8.15pm. Monday 5 February 2024 speaker and topic tba. Followed by dinner at 8.15pm.\n\nMonday 19 February 2024 Professor Jeremy Black (University of Exeter) ‘The Making of the World Naval Power,1500-1900’. Followed by dinner at 8.15pm\n\n(University of Exeter) ‘The Making of the World Naval Power,1500-1900’. Followed by dinner at 8.15pm Monday 4 March 2024 Mr Sebastian Cox (Head of Air Historical Branch, Royal Air Force) ‘The Experience of Allied Bomber Crews in the Strategic Air Offensive Against Germany, 1939-45’. Followed by dinner at 8.15pm.\n\n(Head of Air Historical Branch, Royal Air Force) ‘The Experience of Allied Bomber Crews in the Strategic Air Offensive Against Germany, 1939-45’. Followed by dinner at 8.15pm. 18 March 2024 Professor Saul David (Independent Scholar) ‘The Siege of Delhi, 1857’ Followed by dinner at 8.15pm.\n\nAssociate students\n\nFor those who wish to attend the evening guest seminar programme, but are unable to devote the time to the coursework or to register for the MA degree, there is the option of becoming an Associate Student. This status will enable the student to attend the ten guest seminars and dinners, and to meet the guest lecturers, but does not require the submission of written work. Associate Students are not registered for and do not receive, the MA degree.\n\nGraduate Study in Military History\n\nWhat our students say\n\n“I found Buckingham’s MA in Military History by Research a very rewarding experience. After a business career in the technology sector I was able to finally devote some time to my passion for Military History. The task seemed daunting at first as it had been a long time since I was last in education and I had no knowledge of how to conduct historical research. However, the introductory course of lectures provided a solid study framework and detailed follow up discussions with my tutor enabled me to focus in on a specific historical area of interest and, more importantly, identify a particular question that needed answering.\n\nThe research-based nature of the course means at this point you embark on a solo process of discovery. Reading the existing literature and sifting the archives, both online and in person, you follow leads and gradually piece together the parts of your chosen puzzle. The course is demanding and academically rigorous with a high standard of work expected. However, the tutors are excellent and always there to support and guide your progress and check your work is of the required standard. Writing the dissertation is challenging but once completed it is a very satisfying feeling to know you have contributed to the historiography and understanding of your chosen area.\n\nWhilst most students in my intake took the one-year full-time course I undertook the two-year part-time route and found it allowed me the time and space to investigate my chosen specialist area and really enjoy the whole process without pressure. If you have the time, it may be an option to consider.\n\nIf undertaking a masters currently seems too much of a commitment I would highly recommend becoming an associate just to attend the MA course’s accompanying series of illuminating evening events hosted by Professor Saul David. Each evening involves a standalone lecture given by an eminent historian followed by a dinner and conversation. It is highly enjoyable to spend time in the company of a diverse group of people with a common passion and to be able to talk to some of the biggest names in Military History. Even though I have completed my Masters I intend to be an associate for many years to come!\n\nAndrew Thompson, Master’s (distinction), 2021\n\n“The MA by Research in Military History at The University of Buckingham offers students the opportunity to channel their passion and intellectual curiosity into an academic endeavour full of reward.\n\nThe research seminars delivered by Professor Saul David equip the student early on with a solid foundation to build on, along with a road map to begin drawing out one’s chosen topic. Accompanying these are lectures from speakers at the apex of their field, which are both informative and inspiring, set within a comfortable environment conducive to open debate.\n\nMoreover, the student support at Buckingham is second to none, with administrators on hand to answer any questions and avoid any pitfalls emerging, along with librarians available to assist in seeking out rare books. Taken together, the MA by Research in Military History guarantees a unique experience and provides the necessary tools to succeed.\n\nI thoroughly enjoyed the course and found the whole experience both character building and rewarding. It provided an excellent platform to develop a keen interest into an extensive academic project, under the watchful eyes of expert supervision. I look forward to my next project within this space.”\n\nScott Sherriff, Master’s (distinction), 2020\n\n“I completed the one-year Research MA in Military History in 2012 and subsequently went on to complete a PhD also at The University of Buckingham.\n\nLike most students, I embarked on the MA course with a longstanding interest in military history but little understanding of the skills and disciplines involved in academic research. The unique and exciting quality of the Buckingham programme is that it enables an interested amateur as I certainly was then to tackle a historical question that is entirely new and to produce a work that can withstand rigorous professional scrutiny within an incredibly short timescale.\n\nIf the opportunity provided by the Buckingham course is exciting, its strength lies in the way it combines three elements which support and guide the student. The first is a well-crafted introduction to research techniques backed by exercises to develop research and writing skills. This element is relevant and practical and it is adjusted to the needs of the individual. The second is the series of general interest lectures over the first half of the year all provided by first rank historians. These expose students to new historical problems and the latest research and the format over dinner allows genuinely stimulating debate. They provide invaluable context for the student’s individual work. However, the critical element that stands out at Buckingham is the quality of the individual guidance and supervision in selecting a research topic and then executing successive stages. I cannot rate too highly the individual supervision that I and my fellow students received. I think PhD students at the best universities would count themselves fortunate to receive the tailored support of this quality and care and not least time from some of the best historians in the United Kingdom.\n\nI would also like to commend the general administration of the Buckingham MA programme. It is a complex programme with diverse students with different requirements, a complex lecture programme and no dedicated Buckingham owned site in London. Yet the execution from logistics around successive lectures through to the examination of the final thesis and the monitoring of academic standards was close to perfect.”\n\nDr Andy Boyd, PhD, 2015\n\nFor further details contact:\n\nHumanities Research Admissions on +44 (0)1280 827514\n\nEmail: humanitiespg-admissions@buckingham.ac.uk"}, {"url": "https://www.penguin.co.uk/authors/22126/saul-david.html", "page_content": "Saul David's All The King's Men is a thrilling history of the British Redcoat from the English Civil War to Waterloo.\n\n\n\nBetween 1660 and 1815 British supremacy on foreign soil was near total. Central to this success was the humble redcoat soldier who showed heroism in battle and stoicism in peace, despite appalling treatment. This is their story: of brutal discipline and inedible food, of loyalty and low pay, of barracks and battlefield - of victory, defeat, life and death.\n\n\n\nPraise for All The King's Men:\n\n\n\n'An extraordinary story, packed with drama, incident and great characters...All The King's Men is all you could hope for...Quite an achievement', Patrick Bishop, Country Life\n\n\n\n'A heady mixture of heroism, incompetence, devilish tactics and plain good luck', Sunday Times\n\n\n\n'Filled with swashbuckling derring-do, the reek of blood and gunpowder, combined with shrewd analysis of power, war and psychology', Simon Sebag Montefiore\n\n\n\nSaul David is Professor of War Studies at the University of Buckingham and the author of several critically acclaimed books, including The Indian Mutiny: 1857, Zulu and, most recently, Victoria's Wars: The Rise of Empire. He recently presented 'Bullets, Boots and Bandages' for BBC 4 and is a regular contributor to Radio 4."}, {"url": "https://www.penguin.co.uk/books/53965/the-indian-mutiny-by-saul-david/9780141005546", "page_content": "In The Indian Mutiny: 1857 Saul David explores one of Britain's most harrowing colonial battles.\n\n\n\nIn 1857 the native troops of the Bengal army rose against their colonial masters. The ensuing insurrection was to become the bloodiest in the history of the British Empire.Combining formidable storytelling with ground-breaking research, Saul David narrates a tale at once heart-rendingly tragic and extraordinarily compelling. David provides new and convincing evidence that the true causes of the mutiny were much more complex, and disturbing, than previously assumed.\n\n\n\n'A fine achievement by a huge new talent' William Dalrymple, Sunday Times\n\n\n\nSaul David is Professor of War Studies at the University of Buckingham and the author of several critically acclaimed history books, including The Indian Mutiny: 1857 (shortlisted for the Westminster Medal for Military Literature), Zulu: The Heroism and Tragedy of the Zulu War of 1879 (a Waterstone's Military History Book of the Year) and, most recently, Victoria's Wars: The Rise of Empire."}, {"url": "https://www.buckingham.ac.uk/", "page_content": "Explore our University\n\nLet our students and staff show you what it's like to live and study at Buckingham\n\nCome on in →"}, {"url": "https://www.amazon.co.uk/Saul-David/e/B001JS8PNQ", "page_content": "A Times History Book of the Year 2022\n\nFrom Sunday Times bestselling historian Saul David, the dramatic tale of the first American troops to take the fight to the enemy in the Second World War, and also the last.\n\nThe ‘Devil Dogs’ of K Company, 3/5 Marines, were part of the legendary first Marine Division. They landed on the beaches of Guadalcanal in the Solomon Islands in 1942 – the first US ground offensive of the war – and were present when Okinawa, Japan’s most southerly prefecture, finally fell to American troops after a bitter struggle in June 1945. In between they fought in the ‘Green Hell’ of Cape Gloucester on the island of New Britain, and across the coral wasteland of Peleliu in the Palau Islands, a campaign described by one K Company veteran as ‘thirty days of the meanest, around-the-clock slaughter that desperate men can inflict on each other.’\n\nOrdinary men from very different backgrounds, and drawn from cities, towns, and settlements across America, the Devil Dogs were asked to do something extraordinary: take on the victorious Imperial Japanese Army, composed of some of the most effective soldiers in world history – and defeat it. This is the story of how they did just that and, in the process, forged bonds of brotherhood that still survive today.\n\nRemarkably, the company contained an unusually high number of talented writers, whose first-hand accounts and memoirs provide the colour, emotion, and context for this extraordinary story. In Devil Dogs, award-winning historian Saul David sets the searing experience of K Company into the broader context of the brutal war in the Pacific and does for the U.S. Marines what Band of Brothers did for the 101st Airborne.\n\nGripping, intimate, authoritative and far-reaching, this is a unique and incredibly personal narrative of war.\n\nSaul David’s previous book SBS -Silent Warriors was in the Sunday Times Bestseller Chart in the 35th and 36th week of 2021."}, {"url": "https://www.historyextra.com/author/sauldavid/", "page_content": "Saul David\n\nHistorian, broadcaster and author\n\nSaul David is a historian, broadcaster and author of several acclaimed works of fiction and non-fiction, including SBS Silent Warriors: The Authorised Wartime History (William Collins, 2021), Crucible of Hell: Okinawa. The Last Great Battle of the Second World War (William Collins, 2020) and Operation Thunderbolt (Hodder & Stoughton, 2015). He is Professor of Military History at the University of Buckingham and Course Director and Tutor of Buckingham’s London-based MA in Military History by Research: The Art of War from Marlborough to Montgomery, 1701–1945"}, {"url": "https://www.buckingham.ac.uk/study-medicine-and-health/", "page_content": "Medicine and Health degrees\n\nOur Schools of Medicine and Allied Health are hubs for professional healthcare training based at both Buckingham and Crewe. We offer a range of Medicine and Health Sciences courses, from the MB ChB Medicine, and Biomedical Science, to postgraduate courses for healthcare professionals.\n\nOur unique 4.5-year, GMC-accredited medicine programme will develop you into a competent, safe and caring doctor, well equipped to progress in your chosen area. We introduce patient contact from as early as term one, giving you plenty of opportunities to interact and shadow leading practitioners. You will be taught both on-campus and at our clinical placements at nearby hospitals.\n\nOur Medicine and Health Science courses are suited to both UK and international students. As an independent medical school, we have no cap on international student places.\n\nWe also offer a range of healthcare courses, including medicine, at our brand new Health Sciences campus in Crewe, based in Cheshire in North West England."}, {"url": "https://www.hachette.com.au/saul-david/", "page_content": "Saul David\n\nSaul David is Professor of War Studies at the University of Buckingham and the author of several critically-acclaimed history books, including The Indian Mutiny: 1857 'shortlisted for the Westminster Medal for Military Literature', Zulu: The Heroism and Tragedy of the Zulu War of 1879 'a Waterstone's Military History Book of the Year' and, most recently, Victoria's Wars: The Rise of Empire.\n\nAn experienced broadcaster, Saul David has presented and appeared in history programmes for all the major TV channels and is a regular contributor to Radio 4.\n\nVisit Saul's website at www.sauldavid.co.uk."}], "Saul David is affiliated with the Royal United Services Institute.": [{"url": "https://sauldavid.co.uk/", "page_content": "Saul David is a Sunday Times bestselling military historian, novelist and broadcaster.\n\nHis history books include The Indian Mutiny (shortlisted for the Westminster Medal for Military Literature), Zulu (a Waterstone's Military History Book of the Year), and Operation Thunderbolt: Flight 139 and the Raid on Entebbe Airport (an Amazon History Book of the Year). Alan Furst commented in the New York Times Book Review: 'Tense and riveting...This is the achievement of a masterly, first-rate historian.' The film rights for Operation Thunderbolt were bought by Hollywood's Participant Media and used in the making of the motion picture 'Seven Days in Entebbe' which was released worldwide in the spring of 2018. The film is co-produced by Working Title, directed by José Padilha, and stars Rosamund Pike, Daniel Brühl and Eddie Marsan.\n\nIn 2019, he brought out The Force: The legendary Special Ops Unit and WWII's Mission Impossible, which was hailed as a \"monumental achievement\" (Douglas Brinkley) and \"an essential part of anyone's library\" (Doug Stanton). Crucible of Hell: Okinawa - The Last Great Battle of the Second World War, was published in the spring of 2020 to coincide with the 75th anniversary of the campaign, and was shortlisted for the 2021 British Army's Military Book of the Year. It was described by Antony Beevor as 'Excellent...gripping narrative' and named as an Amazon.com History Book of the Month and Daily Telegraph and Times/Sunday Times History Book of the Year. In a 5-star review in the Daily Telegraph, Simon Heffer described Saul as 'peerless now among our military historians'.\n\nSBS: Silent Warriors – The Authorized Wartime History was published on 2 September 2021 to universal praise. 'A terrific book,' wrote James Holland in the Daily Telegraph, 'written with all the gusto, thrills and head excitement these SBS operations richly deserve. It really is one of the most enjoyable histories I've read in many a year.' It was an instant Sunday Times Top 10 bestseller, entering the list at No. 9 and climbing to No. 4. It was also shortlisted for the Maritime Foundation's Mountbatten Award for Best Book of 2022.\n\nSaul's latest book, Devil Dogs: First In, Last Out - King Company from Guadalcanal to the Shores of Japan, about a company of marines fighting its way through the Pacific, was published on 15 September 2022 in the UK and US. It was given a 5-star review in the Sunday Telegraph with Simon Heffer writing: 'Superb... David has a claim to be our finest living military historian.' It has been named a Times/Sunday Times and Daily Telegraph History Book of the Year.\n\nSaul has also written three bestselling historical novels, Zulu Hart, Hart of Empire and The Prince and the Whitechapel Murders.\n\nSaul has presented and appeared in history programmes for all the major TV and streaming channels. He is a Fellow of the Royal Historical Society and a Professorial Research Fellow at the Humanities Research Institute, University of Buckingham.\n\nIn 2021, Saul founded the Military History Club, offering members exclusive digital content (in the form of newsletters, podcasts, videos and magazines), but also the opportunity to engage with top military historians around the dinner table, attend book launches and bespoke history tours, and even try their hand at writing for the club’s annual e-publication Militaria. For more details and an online application form, click on the link to the club website.\n\nIn March 2022, Saul began co-hosting the Battleground podcast with fellow military historian Patrick Bishop. The podcast began with a series on the Falklands War, and has now moved on to the ongoing conflict in Ukraine. Its many guests include Sir Max Hastings, Sir Antony Beevor, Orlando Figes, Owen Matthews, Antony Loyd, Philipps O'Brien and Generals Lord Dannatt and Sir Mike Jackson. The podcast has grown in popularity and now exceeds 100,000 downloads a week Click here to listen to the podcast"}, {"url": "https://rusi.org/about/our-purpose/our-history/", "page_content": "The Royal United Services Institute has been at the heart of military and security thinking for over 190 years. The Duke of Wellington and a number of other senior military commanders established the Institute in 1831, and some of the most influential thinkers in the 19th and 20th centuries worked or spoke at RUSI.\n\nRUSI has been at the centre of policymaking and thinking on defence and security from the rise of the British Empire to its transformation and dissolution, through both World Wars and the Cold War. The Institute is now documenting the ‘new disorder’ of the contemporary world, and it remains an intrinsic part of the research and debate that surrounds military and security thinking.\n\nFoundations\n\nThe Duke of Wellington's support was instrumental in the Institute’s creation, beginning in 1831 when the Naval and Military Museum was founded. It was renamed as the United Services Institution in 1839, and although royal patronage was assured from the start, this was formally granted though an Act of Parliament in 1860 as a mark of the Institute’s growing importance.\n\nRUSI's influence continued to grow as a result of developments in the latter half of the 19th century. British complacency in security and defence policy was gravely exposed by strategic developments during this period, including wars in Europe, the Russian expansion into Central Asia, and developments in naval technology. RUSI would serve as the prime platform for debates in the field of defence and technological innovation. As early as the Crimean War, a lecture at the Institute envisaged a future age in which observation balloons would be able to take pictures of the enemy’s positions on a battlefield and send these to commanders in the field in real time.\n\nRole in the 19th Century\n\nThroughout the 19th century, RUSI stimulated and maintained a vigorous military membership who saw it as a forum – indeed, the only forum – where military policy could be discussed and questioned among fellow professionals, regardless of rank or title. It provided an important thread of military history and, as its role developed, an understanding of British defence and security policy in the international arena.\n\nRUSI was the model for similar institutes across the world, creating an international network of scholars and members who all saw the concept of a united services institute as an important part of their professional milieu.\n\n20th and 21st Century Developments\n\nA minimal in-house staff ensured that until the mid-20th century, the driving force within the Institute came from active members, who were usually junior officers. In the 1960s, a group of such officers, in a letter to The Times, publicly argued for an independent think tank for the academic study of national defence. This initiative, which caught the attention of Lord Mountbatten and elicited his support, marked the beginning of a slow but sure expansion of the Institute's activities.\n\nThe early 1990s saw a marked expansion of RUSI’s professional activities. The Institute’s building benefited from much-needed repairs and refurbishment, and it developed an extensive programme of events to complement its research activities. An evolving structure saw the studies section first split into two departments in the mid-1990s (Military Sciences and International Security Studies) and then, in response to the September 11 terrorist attacks on the US, a third department was introduced to focus on issues of Homeland Security and Resilience.\n\nFrom the late 2000s, RUSI re-orientated itself to become a fully-fledged think tank, with research at the heart of its activities and income base. RUSI’s research agenda diversified further, analysing the urgent security questions of our age. In 2015, the Institute took the historic step of appointing its first woman and first American Director-General, Dr Karin von Hippel. Since then, RUSI’s research portfolio has expanded even further, covering financial crime, nuclear proliferation and cyber security.\n\nThroughout its over 190 years of existence, the Institute has remained faithful to its heritage and founding principles, continuing in its mission to generate evidence-based and independent debate on issues of security and defence.\n\nRUSI is recognised as one of the top global think tanks on security, and in 2020 it was named ‘Think Tank of the Year’ by Prospect magazine."}, {"url": "https://www.rusi.org/explore-our-research/research-groups/international-security/", "page_content": "The team delivers policy-driven research and analysis on the leading developments in global politics including the international impact of Russia’s invasion of Ukraine and the rise of China.\n\nDrawing on extensive regional expertise, experience, and language skills, the International Security team comprises researchers drawn from government, diplomacy, academia, the military, and the private sector. The London-based team is supported by an international network of associates including former government ministers, senior civil servants, and other officials.\n\nWith the international environment becoming increasingly volatile, we have launched the International Security in Transformation initiative to examine key developments reshaping security politics around the globe, identify trends disrupting businesses and markets, and highlight opportunities for new forms of cooperation.\n\nThe initiative also explores the impact on the UK as an international actor. It identifies ways in which the UK can best manage risks and exploit opportunities in the fast-changing international context."}, {"url": "http://www.militaryspeakers.co.uk/speakers/saul-david/", "page_content": "Saul David is Professor of War Studies at the University of Buckingham and his manybooks include: The Homicidal Earl: The Life of Lord Cardigan (1997), a critically-acclaimed biography of the man who led the Charge of the Light Brigade; The Indian Mutiny:1857 (2002), shortlisted for the Westminster Medal for Military Literature; Zulu: The Heroism and Tragedy of the Zulu War of 1879 (2004), a Waterstone's Military History Book of the Year; and Victoria's Wars: The Rise of Empire (2006). He has also written two bestselling historical novels set in the late Victorian period. The first, Zulu Hart (2009), was described by The Times as a 'rattling good yarn' with 'a compelling, sexy hero who could give Cornwell's Sharpe a run for his money'. His latest history - All The King's Men: The British Soldier from the Restoration to Waterloo - was published in 2012. The Sunday Times wrote: 'Those wishing to immerse themselves in this golden age of British military success will relish David's fine piece of history.'\n\nAn experienced broadcaster, Saul appears often on British television and radio. In 2012 he presented Bullets, Boots and Bandages, a 3 part series on the history of military logistics for BBC4. His other TV presenting credits include the Escape From… series for Channel Five (2004), Sky One's genealogy series So You Think You're Royal? (2007) and three programmes for the BBC's flagship history series Timewatch: The Queen's Lover (2001), The Greatest Knight (2008) and Queen Elizabeth's Lost Guns (February 2009). He was an on-screen expert on BBC2′s virtual battle series Time Commanders (2004) and is a regular contributor to history programmes on all channels. Two of his books - Mutiny at Salerno and Zulu - have been made into BBC Timewatch documentaries (1999 and 2003).\n\nSaul gives frequent talks about military history and has spoken at all the major literary festivals. He has spoken to representatives of the Defence Industry at the Royal Artillery's annual dinner, and has lectured at the Security Service (MI5), the National Army Museum and the Imperial War Museum. He has led history tours to India and the Crimea, and has appeared as a guest speaker on The World ship"}, {"url": "https://sourcewatch.org/index.php?title=Royal_United_Services_Institute", "page_content": "\"The Royal United Services Institute (RUSI) is an independent think tank engaged in cutting edge defence and security research. A unique institution, founded in 1831 by the Duke of Wellington, RUSI embodies nearly two centuries of forward thinking, free discussion and careful reflection on defence and security matters.\" [1]\n\nThe Royal United Services Institute (RUSI) is a London-based centre for defence studies.\n\nIntroduction\n\nThe RUSI website says: \"Founded in 1831 by the Duke of Wellington and based in the centre of Whitehall, London, the Royal United Services Institute (RUSI) (www.rusi.org) is the oldest institute of its kind in the world. It aims to be the 'Professional Forum in the UK for those Concerned with National and International Defence and Security'. Its purpose is to study, promote debate, report and provide options on all issues relating to national and international defence and security.\" [1]\n\nRUSI's place at the heart of the British Establishment is symbolised by its Whitehall location, a short walk away from the Ministry of Defence (MoD).\n\nRUSI's stated aims\n\nThe Institute claims to have four principle roles:\n\n\"Through its research programmes (www.rusi.org/research), to promote the study of selected national and international defence and security issues thus making an independent and original contribution to thinking about defence and international security policy\";\n\n\"Through its programme of lectures, conferences and seminars, to provide a forum for discussion (www.rusi.org/events) of all aspects of national and international defence and security, set in a wide international context, bringing together participants from the armed forces, politicians, the civil and diplomatic services, embassies and high commissions in London, industry, commerce, media, police, academia and a wide range of other disciplines\";\n\n\"Through its Journal (www.rusi.org/journal) and other publications (www.rusi.org/publications), to assist in creating informed opinion and extending knowledge of national and international defence and security matters\"; and\n\n\"To encourage the maximum participation of individual, corporate, and diplomatic members in these roles.\"\n\nGeorge W. Bush addresses RUSI\n\nThe important role played by RUSI within the UK military-industrial complex was attested to when George W. Bush visited London in November 2003. The only speech he made during the entire visit was co-hosted by RUSI [2]. Critics pointed to the anti-democratic symbolism of this, given that he had declined to address Parliament. The WSWS wrote \"Despite his paeans to democracy, Bush chose not to address the House of Commons, the proverbial 'Mother of Parliaments', because of concern that antiwar MPs might disrupt the speech or heckle him. Instead, he spoke before a carefully vetted audience assembled under the auspices of the Royal United Services Institute and the International Institute for Strategic Studies.\" [3].\n\nPatron: Her Majesty the Queen President: His Royal Highness The Duke of Kent KG, GCMG, GCVO, ADC Senior Vice-President: General (Ret'd) David H. Petraeus Chairman: The Rt Hon the Lord Hague of Richmond Vice-Chairman: Sir John Scarlett KCMG OBE Vice-Presidents: The Rt Hon. the Lord Hutton of Furness, Vice Admiral Rory McLean CB OBE\n\nTRUSTEES\n\nADVISORY BOARD\n\nPeople (2015)\n\nAccessed November 2015: [3]\n\nVice-Presidents\n\nTrustees\n\nAdvisory Council\n\nEx-Officio\n\nWeb: https://rusi.org\n\nResources and articles\n\nRelated SourceWatch articles\n\nStaff\n\nRUSI website\n\nThis is Worcestershire, \"Demonstrators target technology conference\", 22 Sept, 2003. Article about a RUSI arms conference targeted by peace protesters.\n\nReferences"}, {"url": "https://rusi.org/people/giampaolo/", "page_content": "David is the founder and Chief Executive of Pi Capital; a unique investor network that finds growth equity and alternative asset investment opportunities for its members. David previously founded, built up and sold several businesses and health club chains in the US and Europe.\n\nHe has financial interests in several other businesses and industries (both as an angel investor or co-investor) and has been involved as an investor, advisor and board member of some of the largest and most successful health & fitness companies in world including Fitness First,24 Hour Fitness and Zumba Fitness.\n\nHe is currently a partner at Saranac Partners, on the Board of Directors of Zumba Fitness, Smartmatic,Fourth Hospitality and Coalition for Inclusive Capitalism. David is a senior advisor to AMG (Affiliated Managers Group, Inc.), BC Partners. and a trustee of Speakers4Schools.org, a Patron of Pro Bono Economics and a member of the YPO and CEO global business organizations."}, {"url": "https://www.rusi.org/explore-our-research/publications/rusi-journal/history-royal-united-services-institute/", "page_content": "BY SHELFORD BIDWELL\n\nThis article appeared in the RUSI Journal in 1991.\n\nThe origin of our Institute, today deeply concerned with the problems of national and international security lies, paradoxically, in an era when Britain had emerged safely and victoriously from the ordeal of a long war when there was every hope for a long peace. The armed forces of the Crown have never stood higher in the public regard than they did fourteen years after the Battle of Waterloo. The Royal Navy and the Army were conscious of duty well done. Nelson, the dead hero, was already part of the national myth. Our living hero, Wellington, enjoyed a pre-eminence as a soldier and later as a statesman among his countrymen, never surpassed by anyone except Winston Churchill.\n\nSuccessful armed forces can all too easily sink into authoritarianism, brooking no criticism, rejecting any analysis of the lessons of the immediate past, having become the mental prisoners of a successful but obsolescent technique of warfare. The great Duke himself, whose carefully contrived victories in the Peninsula had laid the foundations of the Army's traditions, was in some respects the most obdurate authoritarian ever to command British troops, the persistent opponent of every innovation except, strangely, what was to become RUSI.\n\nThe old campaigner\n\nIt would not have been remarkable if a small coterie of professionally-minded officers had formed an association to study the lessons of the late war. A core already existed in the subscribers to Colbourn's United Service Journal (no connection with the future RUSI Journal), and the process was started in February 1829 by a letter to that periodical signed by ‘An old Egyptian Campaigner’. Paraphrasing his florid style, he argued that ‘a United Service Museum’ should be formed, managed entirely by naval and military officers, and under patronage of the monarch, then King George IV, and the commanders-in-chief of the armed forces. Such an institution would prove that the two professions have entered the lists of science, and are ready to contend for honours ‘tam Artibus quam Armis’. The enthusiastic response may well have exceeded the worthy ‘Old Campaigner’s' expectations. It encouraged a Commander Henry Downes Royal Navy to assemble a group with a view to forming a committee for action, to which King George’s First ADC was commanded to convey ‘His Majesty’s gracious and high approbation of the undertaking and of the principles on which it is proposed to conduct it', which were stated to be suitable for 'a strictly scientific and professional society, and not a club'. The death of the King delayed matters, but the Duke of Clarence expressed his readiness to become a patron so, encouraged by the powerful support of the Duke of Wellington, the First ADC, Sir Herbert Taylor, re-submitted the project to King William IV, and was able to assure the committee that ‘it could proceed under his Majesty's gracious auspices.’\n\nOn 25 June 1831 the committee met in the Thatched House Tavern in St James Street, then a popular resort of officers in London, long since vanished. The chair was taken by Major General Sir Howard Douglas, in his person a symbol of the ‘United Service’: a soldier who was the leading expert on naval gunnery. The resolution that the institution be established was put by the future Viscount Hardinge of Lahore, Field Marshal, Secretary of State for War and Governor General of India, seconded by the future Admiral Francis Beaufort, the famous hydrographer. The first title adopted was ‘the Naval and Military Museum’, altered in 1839 to ‘the United Service Institution’, and to ‘the Royal United Service Institution’ by Royal Charter of Incorporation in 1860, retained until the present day when our longer but more explicit title was adopted to make our role clear to the general public.\n\nThe RUSI needs YOU\n\nThere seems to have been no doubt in the mind of the founding committee about of the role of the Institute. The museum and library were the vehicles, but intellectual drive would depend on the imagination and liberty to freely express their ideas of the ordinary members. To this end the founders were politically astute enough to invite thirty of the most distinguished officers of the day to become vice-presidents, but they also perceived that the future of the Institution would depend on attracting as many of the youngest and most junior officers as possible, fixing the subscription for them as low as 10s. per annum. They hoped for 100 per cent recruitment, but though they were disappointed in this, a healthy number joined. (The best young officers are by no means all of a studious or analytic turn of mind. In the 1970s a discreet piece of ‘market research’ revealed that the junior membership was largely from those officers who aspired to staff training and the Joint Services Staff College).\n\nExactly to define the mission of an institution whose studies include the whole spectrum of defence is virtually impossible. The version adopted for inclusion in the Royal Charter was ‘The promotion and advancement of Naval and Military science and Literature’. If ‘military’ in its wider sense is taken to embrace air power, that serves for today. Though lacking the precision necessary for terms of reference, it is concise, indicates the aim and permits flexibility at times of violent change. Progress was rapid and fruitful. Gifts to the Museum flowed in, the library was established, and a regular series of lectures and meetings inaugurated. In 1843 nineteen lectures were delivered and seven papers read. In 1841 the membership had risen to 4243. In 1857 the Journal began publication. A gold medal for essays submitted in alternate years on naval and military subjects was inaugurated in 1878, but superseded in 1900 by the Chesney award, and the Trench Gascoigne Prize for submissions by officers under thirty years of age was instituted.\n\nWhere the Chairmen and Councils equally command our admiration is in the hard work of financial management and administration. In those early years the Whitehall area was quite undeveloped. By careful investment the Council was able to accumulate funds to buy land and premises to accommodate the new Institute, complete with show rooms and a lecture theatre at a cost of £10,000. Then, in 1871, regardless of the previous expressions of goodwill and promises on the part of the Government, the Treasury gave the Institute four months notice to quit, without compensation, as the land was required for development. Vigorous protests secured a stay of execution, but positive help came from Queen Victoria herself, who allotted the Banqueting Hall to accommodate the contents of the Museum. An appeal for funds by Council was generously met, with the Queen, the Prince of Wales and the Dukes of Edinburgh, Connaught and Cambridge heading the list, raising the £23,000 required to lease a plot of land adjacent to the Banqueting Hall and build new offices, a library and a lecture theatre. The new building was opened by the Prince of Wales in 1895. The Institute was thus administratively secure for the foreseeable future, but in 1962 the Government reclaimed the Banqueting Hall, and the exhibits, by then, it must be admitted of purely antiquarian value, were dispersed. In 1970 the lease expired, and the terms for renewal were more than the Institute could afford, but long, tough and patient negotiations enabled the Institute to continue as a tenant.\n\nNew Direction\n\nThe 1960s saw the beginning of a fundamental change in the mission, or at least the way the mission was interpreted, and the way the Institute managed the intellectual side of its affairs. So far the more active members had done most of the work, providing the flow of papers and ideas, while the in-house staff was run with the utmost economy. For instance, Captain E Altham (1931) combined the roles of Secretary, Editor of the journal and Higher Executive Officer. In 1961 Brigadier Stephenson as Director had only a part-time editor as assistant. As in 1829, the spur of action was applied by relatively junior officers, although unlike the anonymous ‘Old Campaigner’ and Commander Downes, they were greatly to distinguish themselves later in their careers. In 1963 the future Marshal of the RAF and Chief of the Defence Staff Lord Cameron, Admiral Sir Louis le Bailly and Brigadier Kenneth Hunt, then students at the Imperial Defence College, wrote a letter published in The Times, arguing that the country lacked an independent `think tank' for the academic study of national defence, and that the need could be met by developing and widening the activities of the RUSI. This caught the attention of Lord Mountbatten, who gave it his support, although it was to be twenty year before sufficient staff of the right calibre could be afforded and assembled to carry out the essential in-house research and compose and edit an adequate range of publications. A beginning was made in 1968, when Air Vice-Marshal S W B Menaul was appointed Director General, and extended the publications to monographs on defence subjects, the reports of the seminars h introduced and the union with Brassey's Publications t produce the Defence Year book, assisted only by an Editor, a Librarian and a Secretary who doubled as treasury and house administrator. The road to the present satisfactory state of our affairs, as set out in the Chairman Council's report to the AGM of 1991, has been a tough one, the achievement, we must all gratefully recognise of the imaginative and energetic staff of the Institute under the Director, and the constant watchfulness, tact and voluntary labour of successive distinguished Chairmen of Council; as in the 1870s and 1970s, so now.\n\nBrigadier R G S Bidwell was a Vice President of the RUSI. He was Editor of the RUSI Journal from 1971-1975 and Deputy Director from 1973. He is the author of several twentieth century military history titles, the most recent being Tug of War: The Battle for Italy 1943-1945, with Dominic Graham, published in 1986."}, {"url": "https://rusi.org/about/our-purpose/our-history/", "page_content": "The Royal United Services Institute has been at the heart of military and security thinking for over 190 years. The Duke of Wellington and a number of other senior military commanders established the Institute in 1831, and some of the most influential thinkers in the 19th and 20th centuries worked or spoke at RUSI.\n\nRUSI has been at the centre of policymaking and thinking on defence and security from the rise of the British Empire to its transformation and dissolution, through both World Wars and the Cold War. The Institute is now documenting the ‘new disorder’ of the contemporary world, and it remains an intrinsic part of the research and debate that surrounds military and security thinking.\n\nFoundations\n\nThe Duke of Wellington's support was instrumental in the Institute’s creation, beginning in 1831 when the Naval and Military Museum was founded. It was renamed as the United Services Institution in 1839, and although royal patronage was assured from the start, this was formally granted though an Act of Parliament in 1860 as a mark of the Institute’s growing importance.\n\nRUSI's influence continued to grow as a result of developments in the latter half of the 19th century. British complacency in security and defence policy was gravely exposed by strategic developments during this period, including wars in Europe, the Russian expansion into Central Asia, and developments in naval technology. RUSI would serve as the prime platform for debates in the field of defence and technological innovation. As early as the Crimean War, a lecture at the Institute envisaged a future age in which observation balloons would be able to take pictures of the enemy’s positions on a battlefield and send these to commanders in the field in real time.\n\nRole in the 19th Century\n\nThroughout the 19th century, RUSI stimulated and maintained a vigorous military membership who saw it as a forum – indeed, the only forum – where military policy could be discussed and questioned among fellow professionals, regardless of rank or title. It provided an important thread of military history and, as its role developed, an understanding of British defence and security policy in the international arena.\n\nRUSI was the model for similar institutes across the world, creating an international network of scholars and members who all saw the concept of a united services institute as an important part of their professional milieu.\n\n20th and 21st Century Developments\n\nA minimal in-house staff ensured that until the mid-20th century, the driving force within the Institute came from active members, who were usually junior officers. In the 1960s, a group of such officers, in a letter to The Times, publicly argued for an independent think tank for the academic study of national defence. This initiative, which caught the attention of Lord Mountbatten and elicited his support, marked the beginning of a slow but sure expansion of the Institute's activities.\n\nThe early 1990s saw a marked expansion of RUSI’s professional activities. The Institute’s building benefited from much-needed repairs and refurbishment, and it developed an extensive programme of events to complement its research activities. An evolving structure saw the studies section first split into two departments in the mid-1990s (Military Sciences and International Security Studies) and then, in response to the September 11 terrorist attacks on the US, a third department was introduced to focus on issues of Homeland Security and Resilience.\n\nFrom the late 2000s, RUSI re-orientated itself to become a fully-fledged think tank, with research at the heart of its activities and income base. RUSI’s research agenda diversified further, analysing the urgent security questions of our age. In 2015, the Institute took the historic step of appointing its first woman and first American Director-General, Dr Karin von Hippel. Since then, RUSI’s research portfolio has expanded even further, covering financial crime, nuclear proliferation and cyber security.\n\nThroughout its over 190 years of existence, the Institute has remained faithful to its heritage and founding principles, continuing in its mission to generate evidence-based and independent debate on issues of security and defence.\n\nRUSI is recognised as one of the top global think tanks on security, and in 2020 it was named ‘Think Tank of the Year’ by Prospect magazine."}, {"url": "https://sourcewatch.org/index.php?title=Royal_United_Services_Institute", "page_content": "\"The Royal United Services Institute (RUSI) is an independent think tank engaged in cutting edge defence and security research. A unique institution, founded in 1831 by the Duke of Wellington, RUSI embodies nearly two centuries of forward thinking, free discussion and careful reflection on defence and security matters.\" [1]\n\nThe Royal United Services Institute (RUSI) is a London-based centre for defence studies.\n\nIntroduction\n\nThe RUSI website says: \"Founded in 1831 by the Duke of Wellington and based in the centre of Whitehall, London, the Royal United Services Institute (RUSI) (www.rusi.org) is the oldest institute of its kind in the world. It aims to be the 'Professional Forum in the UK for those Concerned with National and International Defence and Security'. Its purpose is to study, promote debate, report and provide options on all issues relating to national and international defence and security.\" [1]\n\nRUSI's place at the heart of the British Establishment is symbolised by its Whitehall location, a short walk away from the Ministry of Defence (MoD).\n\nRUSI's stated aims\n\nThe Institute claims to have four principle roles:\n\n\"Through its research programmes (www.rusi.org/research), to promote the study of selected national and international defence and security issues thus making an independent and original contribution to thinking about defence and international security policy\";\n\n\"Through its programme of lectures, conferences and seminars, to provide a forum for discussion (www.rusi.org/events) of all aspects of national and international defence and security, set in a wide international context, bringing together participants from the armed forces, politicians, the civil and diplomatic services, embassies and high commissions in London, industry, commerce, media, police, academia and a wide range of other disciplines\";\n\n\"Through its Journal (www.rusi.org/journal) and other publications (www.rusi.org/publications), to assist in creating informed opinion and extending knowledge of national and international defence and security matters\"; and\n\n\"To encourage the maximum participation of individual, corporate, and diplomatic members in these roles.\"\n\nGeorge W. Bush addresses RUSI\n\nThe important role played by RUSI within the UK military-industrial complex was attested to when George W. Bush visited London in November 2003. The only speech he made during the entire visit was co-hosted by RUSI [2]. Critics pointed to the anti-democratic symbolism of this, given that he had declined to address Parliament. The WSWS wrote \"Despite his paeans to democracy, Bush chose not to address the House of Commons, the proverbial 'Mother of Parliaments', because of concern that antiwar MPs might disrupt the speech or heckle him. Instead, he spoke before a carefully vetted audience assembled under the auspices of the Royal United Services Institute and the International Institute for Strategic Studies.\" [3].\n\nPatron: Her Majesty the Queen President: His Royal Highness The Duke of Kent KG, GCMG, GCVO, ADC Senior Vice-President: General (Ret'd) David H. Petraeus Chairman: The Rt Hon the Lord Hague of Richmond Vice-Chairman: Sir John Scarlett KCMG OBE Vice-Presidents: The Rt Hon. the Lord Hutton of Furness, Vice Admiral Rory McLean CB OBE\n\nTRUSTEES\n\nADVISORY BOARD\n\nPeople (2015)\n\nAccessed November 2015: [3]\n\nVice-Presidents\n\nTrustees\n\nAdvisory Council\n\nEx-Officio\n\nWeb: https://rusi.org\n\nResources and articles\n\nRelated SourceWatch articles\n\nStaff\n\nRUSI website\n\nThis is Worcestershire, \"Demonstrators target technology conference\", 22 Sept, 2003. Article about a RUSI arms conference targeted by peace protesters.\n\nReferences"}, {"url": "https://rusi.org/explore-our-research/publications/commentary/more-open-stay-secret-uk-intelligence-agency-openness-and-public/", "page_content": "GCHQ’s Director of Strategy, Policy and Engagement, Jo Cavan, joined Nicky Campbell’s BBC Radio 5 Live phone-in, responding to questions from listeners about the agency. ‘It’s a common myth we’re reading everybody’s emails’, she said. ‘We’re not listening to everybody’s calls … it would be morally wrong’. ‘Amena’, a first-generation British Bangladeshi, also spoke to BBC Radio 1’s Newsbeat a week later. ‘There’s a common misconception that you’ve got to be a nerd [to work in intelligence]’. Just last week, a senior MI5 officer, known only as Director K, also spoke to The Telegraph on hostile state activity and the need for an overhaul of the Official Secrets Act to challenge ‘increasingly damaging activity’.\n\nThat the UK’s intelligence community now has a voice is welcome. Traditionally, the UK’s agencies took a neither seen nor heard approach, with fictional depictions often filling the void. Previously, it was also up to ministers to praise the work of MI5, GCHQ and SIS – a mode of communication that would be risky now. In 2019, research by the Hansard Society found that the public had little trust in ministers and even MPs, with just 33% saying they had confidence in government. The same polling found that Britons had more faith in the military (74%) and judiciary (62%). New work by the Institute for Public Policy Research found the picture remained the same.\n\nRecent polling by YouGov suggests that on the issue of ‘trust’, the UK public have relatively high levels of it for the UK’s agencies. 58% of those surveyed said they had a ‘great deal’ or ‘some’ trust, as opposed to 16% who had ‘not much’ and 7% no trust at all. The message is clear that, if public trust in politicians is low, the agencies themselves need to be increasingly prominent in their messaging. The issue – as it always has been – is how do they get that message across?\n\nPolling suggests that, despite trusting the agencies, Britons have – as I previously wrote – little understanding about what they do. Nor do they go and read statements on websites or the reports of the Intelligence and Security Committee to find out more. It is not good enough having a website; the people the agencies want to recruit often do not visit. The message is that if the agencies want to contribute to discussions, and reach out to new audiences, they should do it themselves in imaginative ways. The coverage of C’s speech is a good example: agencies need to be more prominent in the headlines, not just be heard about when things go wrong.\n\nEngagement may not always be a success, and can often be cringeworthy when it goes wrong. TikToker Elise Lamsdale’s video criticising an SIS recruitment site featuring Star Wars, Dungeons and Dragons and geeks recently went viral. ‘Which boomer signed off on this?’ she complained. The site, ‘GeeksLikeYou’ – an attempt to build on the earlier #SecretlyWereJustLikeYou campaign – also referenced Bond and gaming culture. ‘Our ideal candidate isn’t Pierce Brosnan in GoldenEye. (Sorry, Pierce.) It’s you: the geek who knows that GoldenEye was the best game on the N64’, it says on the frontpage, while helpfully pointing out that SIS is in no way linked to Daniel Craig or Brosnan."}]}