{"Saul David presented the television documentary The Real Crime of Jack the Ripper.": [{"url": "https://www.bbc.co.uk/programmes/m0003wdk", "page_content": "Presented by Emilia Fox and Professor David Wilson, this documentary casts new light on the Jack the Ripper case, identifying another victim and naming the killer.\n\nIn 1888 the most infamous serial killer of all time, Jack the Ripper, began his reign of terror in the East End of London. Between August and November, five horrifically violent murders took place in Whitechapel. There was a huge manhunt, but the Ripper was never caught. Since then there has been endless speculation about who the Ripper was, what motivated his crimes, and how the killer escaped justice.\n\nPresented by the star of BBC One drama Silent Witness Emilia Fox and Britain’s top criminologist Professor David Wilson, this documentary casts new light on the Jack the Ripper case. Together Emilia and David look at the Ripper’s modus operandi using modern technology - like a digital autopsy table - and recreating the murder sites to help understand the extraordinary risks the Ripper took to kill his victims. Also, using the Home Office Large Major Enquiry System (HOLMES), a bespoke computer system used by the police to help detect patterns in criminal activity, and evidence uncovered within the investigation, results strongly indicate that Martha Tabram was in fact the first Ripper victim.\n\nConvinced that Martha Tabram was the Ripper’s first victim, Emilia and David ask a geographical profiling expert to take a fresh look at the pattern of Ripper murder sites, which takes the investigation in a completely different direction, ultimately identifying the most likely suspect.\n\nThe debate about Jack the Ripper’s true identity is already over 130 years old and is sure to continue, but this documentary casts new light onto the case and is as definitive as could be in naming the killer."}, {"url": "https://docuwiki.net/index.php?title=Jack_the_Ripper:_The_Definitive_Story", "page_content": "From DocuWiki\n\nedit] General Information\n\nHistory Documentary hosted by Paul Begg, published by Channel 5 in 2011 - English narration\n\nedit] Cover\n\nedit] Information\n\nJack the Ripper murdered and horribly mutilated at least five helpless prostitutes in the East End of London in 1888. Never caught, never certainly identified, over a century of theories and speculation has obscured the story of what really happened. Using state-of-the-art CGI and actor recreations, this documentary drama plunges the viewer into the heart of Victorian Whitechapel and challenges them to investigate the slayings for themselves. This 90 minute documentary, written by and featuring many of the world's leading authorities, tells the story of Jack the Ripper from the first murder to examination of the men policemen at the time thought was the killer. You will also be taken back to the streets of of the East End of 1888. Amazingly detailed and closely researched graphics show you what the streets were really like, what the witnesses actually saw and why the gas-lit warren of passage and alleys made Jack impossible to catch. Everything right down to the street lighting is reproduced as accurately as it is possible to get. Using the actual statements of witnesses, the evidence presented in the coroner's court, and official police documents, this film reconstructs the horror that was Jack the Ripper in astonishingly accurate detail. Forget what you've seen before, this is the definitive story. Narrated by Paul Begg, co-author of the \"Jack the Ripper A to Z\", and author of \"Jack the Ripper: The Facts\" and \"Jack the Ripper: The Definitive History\". Stunning CGI visuals created by artist Jaakko Luukanen. Contributing experts were: Robert Anderson, Bill Beadle, Neil Bell, John Bennett, Lars Davidsson, Richard Jones, Donald Rumbelow, Neal Shelden, Lindsay Sivitar, Nevill Swanson, and Gareth Williams. Written and Narrated by Paul Begg & John Bennett ; A Bulls Eye Lantern Production for Five in Association with Crime & Investigation Network\n\n\n\n\n\nedit] Screenshots\n\nedit] Technical Specs\n\nVideo Codec: x264 CABAC High@L4.1\n\nVideo Bitrate: CRF @18 / 2 445 kb/s\n\nVideo Resolution: 1280x720\n\nDisplay Aspect Ratio: 16:9\n\nFrames Per Second: 25.000\n\nAudio Codec: AC3\n\nAudio Bitrate: 384kb/s CBR 48000 Hz\n\nAudio Streams: 6\n\nAudio Languages: english\n\nRunTime Per Part: 44 mn 50 s\n\nNumber Of Parts: 2\n\nPart Size: 879 MB - 928 MB\n\nSource: HDTV\n\nEncoded by: SFM\n\nedit] Links\n\nedit] Release Post\n\nedit] Related Documentaries\n\n\n\n\n\nedit] ed2k Links\n\n\n\n"}, {"url": "https://www.history.com/news/has-jack-the-rippers-identity-been-revealed", "page_content": "In the early morning hours of September 30, 1888, police discovered the mutilated body of Catherine Eddowes, her throat slit and left kidney removed, in London’s Mitre Square. Eddowes had been the second prostitute inside of an hour found murdered in that section of the city, and the slaying bore the grisly signatures of the serial killer who for weeks had been terrorizing London’s East End—Jack the Ripper.\n\nAs police from Scotland Yard completed their work, Acting Sergeant Amos Simpson reportedly made an odd request to take home a blood-splattered shawl—blue and dark brown with a pattern of Michaelmas daisies at either end—found at the crime scene as a gift for his seamstress wife. His superiors granted permission, but unsurprisingly, the present was not well received.\n\nSimpson’s horrified wife stashed the seven-foot-long fabric found next to Jack the Ripper’s fourth victim in a box. It was never worn or washed as the search for one of the world’s most notorious killers grew colder and colder. The person responsible for killing at least five Londoners between August and November 1888 was never found, and authorities officially closed the file in 1892.\n\nWho Was Jack the Ripper?\n\nThe slayings never faded from public consciousness, however. Legions of “Ripperologists” have developed their own theories over the decades, and the lineup of possible suspects has included the father of Winston Churchill, “Alice’s Adventures in Wonderland” author Lewis Carroll, and Prince Albert Victor, grandson of Queen Victoria and second in line to the British throne.\n\nSome have even speculated that Jack the Ripper was in actuality Jill the Ripper, and female suspects include Mary Pearcey, who was executed in 1890 after butchering her lover’s wife and child with a carving knife in a similar manner to the notorious serial killer.\n\nThe Victorian-era shawl reportedly taken by Simpson passed from generation to generation of the policeman’s descendants until it was put up for auction in 2007 and purchased by Russell Edwards, an English businessman and self-confessed “armchair detective” who was fascinated by the coldest of cold cases. Although the silk fabric was frayed and aging, it still contained valuable DNA evidence since it was never washed.\n\nDid DNA Analysis Find the Killer?\n\nNow, after more than three years of scientific analysis, Russell says that Jack the Ripper’s true identity has been found interwoven in the ragged, 126-year-old shawl, and he fingers Polish immigrant Aaron Kosminski as the serial killer in his book “Naming Jack the Ripper.”\n\nEdwards enlisted forensic geneticist Dr. Jari Louhelainen of Liverpool John Moores University in 2011 to study the shawl using a level of analysis that was only possible in the last decade. Louhelainen identified the dark splotches on the shawl as stains “consistent with arterial blood spatter caused by slashing.” He also discovered evidence of split body parts, consistent with a kidney removal, as well as the presence of seminal fluid.\n\nLouhelainen found the mitochondrial DNA taken from the shawl matched that taken from Karen Miller, a direct descendant of Eddowes, as well as a female descendant of Kosminski’s sister, Matilda, who provided swabs of mitochondrial DNA from the inside of her mouth.\n\nPolice who worked the case at the time of the murders would not have been surprised to see Kosminski’s name linked to the crime. At the time of the murders, Kosminski was among the handful of primary suspects. The youngest of seven children, Kosminski was born in Klodawa, Poland, in 1865. After the death of his father, the family fled the pogroms flamed by Poland’s Russians rulers and immigrated to London’s Whitechapel section in 1881.\n\nLikely a paranoid schizophrenic, Kosminski, whose occupation was listed as hairdresser, was admitted into an asylum in 1891 after attacking his sister with a knife. In the mid-1890s, a witness identified him as the person attacking one of the victims but refused to testify. Lacking any hard evidence, police never arrested Kosminski for the crimes. He remained institutionalized until his death in 1919 from gangrene.\n\nEdwards has long theorized that the shawl was of too fine a quality to have been worn by a London prostitute and belonged to Jack the Ripper, not Eddowes. Using nuclear magnetic resonance, another Liverpool John Moores University scientist, Dr. Fyaz Ismail, determined that the fabric’s age predated the 1888 murders and was likely made near St. Petersburg, Russia. The region of Poland where Kosminski was born was under Russian control, and it would not have been unusual for Russian goods to have been traded there.\n\n“I’ve spent 14 years working on it, and we have definitively solved the mystery of who Jack the Ripper was,” Edwards told London’s Independent newspaper. “Only non-believers that want to perpetuate the myth will doubt. This is it now—we have unmasked him.”\n\n‘Ripperologists’ Weigh In\n\nMany Ripperologists, however, are not so certain. The report has generated plenty of skeptics, some of whom have noted that the laboratory analysis has yet to be published in a peer-reviewed scientific journal and that Louhelainen was only able to test mitochondrial DNA, which is passed down from mothers to children and offers much less of a unique identifier than nuclear DNA. Many people can share similar mitochondrial DNA signatures.\n\nOther critics refute the notion that Simpson was even at the crime scene the night of the Eddowes murder and note that the shawl may have been contaminated over the decades since it has been held by many members of the Eddowes family.\n\nIn addition, this is not the first time that DNA evidence has supposedly cracked the case. American crime novelist Patricia Cornwell asserted that DNA samples found on the taunting letters sent by Jack the Ripper to Scotland Yard matched those of post-Impressionist painter Walter Sickert.\n\nAnd a 2006 study by Australian scientist Ian Findlay extracted DNA from the saliva on the letters and determined that it was likely that the sender was a woman. So even with the latest news, it’s unlikely the debate on Jack the Ripper’s identity will suddenly abate."}, {"url": "https://documentaryheaven.com/jack-ripper-case-reopened/", "page_content": "In 1888, the most infamous serial killer of all time began his reign of terror in Londons East End. The identity of this man who has become known as Jack The Ripper remains a mystery to this day.\n\nNow with the help of some of the countries top criminal investigators, actor Emilia Fox alongside Britain’s top criminologist Professor David Wilson are going to reopen the ripper files. At the age of 29 Wilson became the youngest ever prisoner governor in England and has met virtually every recent British serial killer.\n\nAlong with Wilson’s expertise this film will also use modern techniques and technology to investigate the Whitechapel Murders. Relying on top investigators and geo-profiling experts to explore Jack The Rippers psychology, Emilia and Wilson discover the Ripper’s modus operandi in order to better understand the extraordinary risks the Ripper took to kill his victims."}, {"url": "https://www.history.com/topics/european-history/jack-the-ripper", "page_content": "Jack the Ripper terrorized London in 1888, killing at least five women and mutilating their bodies in an unusual manner, indicating that the killer had a substantial knowledge of human anatomy. The culprit was never captured—or even identified—and Jack the Ripper remains one of England’s, and the world’s, most infamous criminals.\n\nAll five killings attributed to Jack the Ripper took place within a mile of each other, in or near the Whitechapel district of London’s East End, from August 7 to September 10, 1888. Several other murders occurring around that time period have also been investigated as the work of “Leather Apron” (another nickname given to the murderer).\n\nA number of letters were allegedly sent by the killer to the London Metropolitan Police Service (often known as Scotland Yard), taunting officers about his gruesome activities and speculating on murders to come. The moniker “Jack the Ripper” originates from a letter—which may have been a hoax—published at the time of the attacks.\n\nDespite countless investigations claiming definitive evidence of the brutal killer’s identity, his or her name and motive are still unknown.\n\nVarious theories about Jack the Ripper’s identity have been produced over the past several decades, which include claims accusing the famous Victorian painter Walter Sickert, a Polish migrant and even the grandson of Queen Victoria. Since 1888, more than 100 suspects have been named, contributing to widespread folklore and ghoulish entertainment surrounding the mystery."}, {"url": "https://www.bbc.co.uk/mediacentre/latestnews/2018/ripper", "page_content": "It is remarkable to think that today’s scientific techniques can be used to help try and tackle unanswered questions which are more than a century old — Craig Hunter, BBC Commissioning Editor\n\nBetween August and November 1888, five horrifically violent murders took place in Whitechapel. The victims were all poor, working-class women. A huge manhunt ensued involving hundreds of officers, but Jack the Ripper was never caught.\n\nNow, in a new BBC One science documentary, the latest police cold case techniques will be applied to these gruesome murders. Using original crime scene photographs and a virtual reality dissection table, actor Emilia Fox and Professor David Wilson, Emeritus Professor of Criminology, will be joined by some of the country’s top forensic and crime experts to re-analyse the murders. Using 21st century technology, they hope to get closer than anyone has before to answer some vital questions, including who was Jack the Ripper, what motivated his crimes, how did he escape justice, and could he have been responsible for even more brutal murders?\n\nEmilia says: “Having worked on crime drama for many years this project has been a truly fascinating insight into how current real police procedure, forensics and technology can be applied to the most famous of unsolved historical crimes - the Jack the Ripper murders. Working alongside Professor David Wilson, a leading expert in the psychology of criminals, we have approached it as a cold case might be investigated now, and with the help of other leading experts, have taken another look at the mind and actions of this brutal murderer. This documentary appealed to me hugely because of my interest in crime, forensics and pathology and also because it looks at the victims - the women Jack the Ripper chose and what left them so vulnerable to his brutality. It’s been an immense privilege to get this behind-the-scenes insight into real crime-solving on such a fascinating case.”\n\nCraig Hunter, BBC Commissioning Editor, says: “Jack the Ripper is synonymous with murder and intrigue - even if you don’t know all the details, you will have heard of the case. It is remarkable to think that today’s scientific techniques can be used to help try and tackle unanswered questions which are more than a century old.\"\n\nJack The Ripper (w/t), a 1x60’ programme for BBC One, is made by BBC Studios. The Executive Producer is Steve Crabtree and it was commissioned by Charlotte Moore, Director, Content and Tom McDonald, Head of Commissioning, Natural History and Specialist Factual. The Commissioning Editor is Craig Hunter. It will tx later this year.\n\nNotes to Editors\n\nDavid Wilson is Emeritus Professor of Criminology and founding Director of the Centre For Applied Criminology at Birmingham City University - one of the university’s 'research centres of excellence'. He is the former Editor of the prestigious Howard Journal of Criminal Justice, which is produced five times per year. Prior to taking up his academic appointment in September 1997, David was Senior Policy Advisor to the Prison Reform Trust, and between October 1983-April 1997 he worked as a Prison Governor.\n\nTD"}, {"url": "https://www.britannica.com/biography/Jack-the-Ripper", "page_content": "All of Jack the Ripper’s victims were prostitutes, and all but one were killed while soliciting customers on the street. In each instance the victim’s throat was cut, and the body was mutilated in a manner indicating that the murderer had at least some knowledge of human anatomy.\n\nJack the Ripper was an English serial killer. Between August and November 1888, he murdered at least five women—all prostitutes—in or near the Whitechapel district of London’s East End. Jack the Ripper was never identified or arrested. Today the murder sites are the locus of a macabre tourist industry in London.\n\nJack the Ripper, pseudonymous murderer of at least five women in or near the Whitechapel district of London’s East End between August and November 1888. The case is one of the most famous unsolved mysteries of English crime.\n\nSome dozen murders between 1888 and 1892 have been speculatively attributed to Jack the Ripper, but only five of those, all committed in 1888, were linked by police to a single murderer. The so-called “canonical five” victims were Mary Ann Nichols (whose body was found on August 31), Annie Chapman (found September 8), Elizabeth Stride (found September 30), Catherine (Kate) Eddowes (found September 30), and Mary Jane Kelly (found November 9). According to the common assumption of the time, all the victims were prostitutes and all but one of them, Kelly, was murdered while soliciting on the street. That belief was subsequently taken for granted in books about the crimes, which typically offered conjectures as to the true identity of Jack the Ripper and reported graphic details of the murders he committed (many of these books, however, were based on fraudulent claims and documents). In a radical departure from that genre, The Five: The Untold Lives of the Women Killed by Jack the Ripper (2019), the British social historian Hallie Rubenhold argued that Nichols, Chapman, and Eddowes were not prostitutes; that Stride had resorted to soliciting only occasionally, during periods of desperate poverty and emotional suffering (but there is no evidence to show that she had been soliciting when she was murdered); and that the only verifiable prostitute among the five was Kelly. In Rubenhold’s view, the notion that Jack the Ripper was a murderer of prostitutes was a consequence of the misogynistic and class-based prejudices characteristic of the Victorian era.\n\nBritannica Quiz Famous Serial Killers\n\nIn each instance, the victim’s throat was cut, and the body was usually mutilated in a manner indicating that the murderer had at least some knowledge of human anatomy. On one occasion, half of a human kidney, which may have been extracted from a murder victim, was mailed to the police. The authorities also received a series of taunting notes from a person calling himself Jack the Ripper and purporting to be the murderer. Strenuous and sometimes curious efforts were made to identify and trap the killer, all to no avail. A great public uproar over the failure to arrest the murderer was raised against the home secretary and the London police commissioner, who resigned soon afterward.\n\nThe case has retained its hold on the popular imagination, in part because known instances of serial murder were much rarer at the time than they are today. Jack the Ripper has provided themes for numerous literary and dramatic works. Perhaps the most notable was the horror novel The Lodger (1913) by Marie Adelaide Lowndes, which inspired numerous films, including Alfred Hitchcock’s The Lodger: A Story of the London Fog (1927).\n\nThe most commonly cited suspects are Montague Druitt, a barrister and teacher with an interest in surgery who was said to be insane and who disappeared after the final murders and was later found dead; Michael Ostrog, a Russian criminal and physician who had been placed in an asylum because of his homicidal tendencies; and Aaron Kosminski, a Polish Jew and a resident of Whitechapel who was known to have a great animus toward women (particularly prostitutes) and who was hospitalized in an asylum several months after the last murder. Several notable Londoners of the era, such as the painter Walter Sickert and the physician Sir William Gull, also have been subjects of such speculation. The murder sites have become the locus of a macabre tourist industry in London."}, {"url": "https://www.imdb.com/list/ls079111466/", "page_content": "This list includes stories about the actual Jack the Ripper case, then there are ones that have Jack the Ripper as a supporting, passing, or background character, others that are contemporary settings with Jack the Ripper style murders, and lastly some of these are related to Jack the Ripper in name alone. Most of them are complete rubbish...and almost all of them get the facts totally wrong. Also, I'm not planning on including shorts, documentaries, and video games, but there may be a few exceptions if they are good, popular, or noteworthy enough.\n\n\n\nI included my scores of the films and television programs I have seen more recently, with brief explanations where needed. I did not factor in the accuracy of the facts on the case, unless it was meant to be a documentary."}, {"url": "https://www.thefactsite.com/jack-the-ripper-facts/", "page_content": "By no means was Jack the Ripper the first serial killer. However, until this madman struck, his was the first case to stir up a worldwide media frenzy.\n\nEven over 100 years later, everyone knows his nickname, and the mystery surrounding these attacks are scrutinized.\n\nAnd that’s the million-dollar question: Who was Jack the Ripper?\n\nIf you were clicking on this article for a big reveal, unfortunately, we can’t give that to you.\n\nNo one can for certain! But we can take a look at his profile and the most likely suspects.\n\nGuess who it was as much as you’d like, but don’t expect a definitive answer from anyone.\n\nThe Profile of a Killer.\n\nIf you didn’t already know, Jack the Ripper was an unidentified person who committed a string of horrific serial murders in 1888.\n\nHis signature included mutilation or dismemberment of the victims who were all women.\n\nDue to the fact that he seemed to only target alcoholic prostitutes, authorities assessed that he was likely a male seeking easy prey.\n\nAs they put the pieces together, it was also figured that he was either abused or deserted by his mother when he was a child.\n\nThis was the most likely reason why he only killed women.\n\nBased on the time of the murders, there are a few extra details we can ascertain.\n\nThe killings typically took place on the weekends, and only ever between the hours of 12 AM and 6 AM.\n\nThese facts break down to mean two things: he probably had a job, but was single and had no family ties.\n\nHow the cases tied together.\n\nDuring the time of the Ripper killings, there was already a high amount of violence against women occurring in the same area.\n\nIn those days, the East End of London was considered the slums. A large number of attacks and murders happened specifically in the poverty-stricken district, Whitechapel.\n\nA string of 11 murders occurred between April 1888, and February 1891. They were all performed in terrible methods, but five of them, in particular, were able to be tied together.\n\nThese women are considered the canonical five of Jack the Ripper. Any other victims are speculation and unable to be confirmed.\n\nThe other five women were considered acts of gang violence. Similarly, no one was caught for these crimes either, so it is impossible to rule out Jack the Ripper for these as well.\n\nHowever, the canonical five all shared the same detail: they were killed by their throats being slit.\n\nFor four of them, other awful wounds and mutilations were inflicted.\n\nBut for the other, she only had one laceration and it is theorized that the Ripper may have been interrupted before he could carry out any other abominations.\n\nEven though these five had a connection, there is still no sure way to tell if Jack had other victims or not.\n\nThe Search for a Maniac.\n\nDuring this hunt, over 2,000 people were interviews, 300 plus were investigated, and 80 were detained.\n\nIt was determined by the lacerations on the victims, that the killer had knowledge of human anatomy and thus could potentially be either a butcher or work in the medical field.\n\nAs a result, 76 butchers and slaughterers were visited, and the examination of all the employees included the last 6 months.\n\nThe case remained open until 1892 when the authorities officially closed the file based on lack of evidence and success.\n\nThe Unusual Suspects.\n\nToday, there are over 100 hypotheses regarding Jack the Ripper’s true identity. Those who study about Jack the Ripper are called “Ripperologists”.\n\nTheir theories range from people like Winston Churchill’s dad, the author of Alice in Wonderland, Lewis Carroll, and the grandson of Queen Victoria.\n\nSome have even speculated that Jack the Ripper was in fact Jill the Ripper.\n\nSpecifically, one Mary Pearcey was caught and executed in 1890 for butchering her lover’s wife and child in a similar style to the Ripper.\n\nUnfortunately, there isn’t enough surviving forensic evidence about the case to determine any of these theories. However, we can narrow it down to the top 5 most likely.\n\nWas it Montague John Druitt?\n\nStarting with bachelor number one! Montague John Druitt didn’t have any scientific or concrete evidence convicting him, but the timeline of his life is eerily close.\n\nDruitt lived only a few miles away from the location of the murders in Whitechapel, and it was reported that he was seen in the area around the same time as the Ripper murders.\n\nEven though he was a well-educated man coming from Oxford, many believed him to be “sexually insane” which would be a factor in the mutilations of the women.\n\nThe biggest factor for believing it was Druitt, is the fact that Druitt’s body was found just seven weeks after the probable last victim of Jack the Ripper.\n\nHe was found at the bottom of the River Thames, his death ruled a suicide. Is it possible that after Montague’s last strike, he went fully insane and killed himself?\n\nWas it Carl Feigenbaum?\n\nWhile experts believe Jack was in his mid-20’s to mid-’30s, this next suspect is an exception.\n\nCarl was a 54-year old German sailor who was documented working near Whitechapel every single night of the five main murders.\n\nWhile docked in the area, he was usually spotted at nearby brothels to add to the possibility.\n\nEven worse, he was known to be a psychopath and confessed to mutilating women. Even his own lawyer was convinced his client was Jack the Ripper!\n\nAround 1890, Carl emigrated to America where he was convicted of murdering a woman and sent straight to the electric chair.\n\nRipperologists say there are many prominent likenesses to the Ripper murders and Carl’s victims in the States.\n\nWas it Francis Craig?\n\nRecently, many people have come to believe that the Ripper was in fact the husband of one of the victims.\n\nFrancis Craig was a reporter during the murders, covering the police courts and investigations on crimes in the East End where the murders took place.\n\nSome have suggested that Craig had a personality disorder, such as schizotypal.\n\nHe only lived a few minutes away from the first murder scene of Jack the Ripper, which gives him the convenience of killing in his area.\n\nCraig married Elizabeth Davies, who is believed to have an alias for being a prostitute – Mary Jane Kelly, Jack the Ripper’s last victim.\n\nRipperologists say that when Craig found out his wife was working as a prostitute, he started planning her murder.\n\nHe only killed the four other women in order to cover up his involvement.\n\nWas it Walter Sickert?\n\nWalter Sickert was notorious for painting prostitutes. Some say he would add clues and symbols into his artwork about the Jack the Ripper killings.\n\nProfessionals claim that the resemblances are so similar to the real crime scenes, that only the real murderer could have painted them.\n\nWhile there is less evidence against him than some of the other accusations, the similarities of his painting are too close to ignore.\n\nWas it Aaron Kosminski?\n\nThere are many highly-regarded police officers that hold firm to the polish barber, Aaron Kosminski as being the Ripper.\n\nRussian-born, Kosminski moved to London in the early 1880s and was living in Whitechapel during the murders, working as a hairdresser.\n\nIn fact, he was known to be misogynistic with homicidal tendencies and was sent to an asylum in 1889.\n\nDuring the murders, Aaron was among the few primary suspects.\n\nA witness even said he was the person attacking one of the victims, however, they declined to testify. There was never any hard evidence, so an arrest was impossible.\n\nOne thing that has always tied Aaron to the killings, is a shawl that was found at the scene of one of the victims, Catherine Eddowes.\n\nThe shawl was covered in blood and it was originally thought to be Catherine’s.\n\nHowever, one researcher claims that the quality was too expensive to have been owned and worn by a London prostitute of that time.\n\nMeaning: the shawl may have belonged to Jack the Ripper.\n\nLater, the fabric was found to have been made in Russia. During the time of Kosminski living in Poland, it was under Russian control and normal for Russian goods to be traded there.\n\nAdditionally, Aaron’s mitochondrial DNA was found on the shawl.\n\nHowever, that doesn’t to much in the case of proving anything, because this type of DNA is likely to match with many other people’s.\n\nSo who done it?\n\nBased on the information above, who do you believe to be the most likely suspect?\n\nPersonally, it’s hard to ignore that Druitt killed himself shortly after the last victim, but with all the evidence against the other men, it’s difficult to narrow down.\n\nIt is widely believed that after the final killing, the Ripper stopped due to his death, imprisonment, emigration, or institutionalization.\n\nWe will probably never have a definitive answer to this question, but it is still fascinating to research.\n\nWhoever Jack the Ripper was is long gone, and only he will ever know the full truth."}], "Saul David appeared in the television documentary The Battle of Waterloo.": [{"url": "https://sauldavid.co.uk/biography/", "page_content": "Biography\n\nSaul David was born in Monmouth in 1966 and educated at Ampleforth College and Edinburgh and Glasgow Universities (History MA and PhD).\n\nHe began writing his first history book when he was twenty-five and has now completed fifteen (one edited). They include: The Homicidal Earl: The Life of Lord Cardigan (1997), a critically-acclaimed biography of the man who led the Charge of the Light Brigade; The Indian Mutiny:1857 (2002), shortlisted for the Westminster Medal for Military Literature; Zulu: The Heroism and Tragedy of the Zulu War of 1879 (2004), a Waterstone’s Military History Book of the Year; Victoria’s Wars: The Rise of Empire (2006); All the King’s Men: The British Redcoat in the Era of Sword and Musket (2012); 100 Days to Victory: How the Great War was Fought and Won, 1914-1918 (2013); Operation Thunderbolt: Flight 139 and the Raid on Entebbe (2015), made into the feature film Entebbe; The Force: The Legendary Special Ops Unit and World War II’s Mission Impossible (2019) and Crucible of Hell: Okinawa – The Last Great Battle of the Second World War (2020), shortlisted for the 2021 British Army Military Book of the Year. He was Editorial Consultant for Dorling Kindersley’s War: From Ancient Egypt to Iraq (2009) and in 2013 edited Mud & Bodies, an infantry subaltern’s Great War diary and letters.\n\nSaul has also written three historical novels set in the late Victorian period. The Times described the first, Zulu Hart (2009), as a ‘rattling good yarn’ with ‘a compelling, sexy hero who could give Cornwell’s Sharpe a run for his money’. It was a top 5 bestseller in The Independent newspaper and sold more than 100,000 copies. Hart of Empire appeared in 2011. The third in the series, The Prince and the Whitechapel Murders, was published in 2018.\n\nAn experienced broadcaster, Saul appears often on British radio and television. His TV presenting credits include the Escape From… series for Five (2004), Sky One’s genealogy series So You Think You’re Royal? (2007) and three programmes for the BBC’s flagship history series Timewatch: The Queen’s Lover (2001), The Greatest Knight (2008) and the Queen Elizabeth’s Lost Guns (February 2009). He was an on-screen expert on BBC2’s virtual battle series Time Commanders (2004) and is a regular contributor to history programmes on all channels. Two of his books – Mutiny at Salerno and Zulu – have been made into documentaries. More recently he presented Filton’s Fabulous Flying Machines for BBC1 (June 2010) and How The Rest Got Home, a 70th anniversary programme about the British soldiers who escaped from France after Dunkirk, for Radio 4 (June 2010). His 3 x 1 hour series on the history of military logistics – Bullets, Boots and Bandages: How Wars are Really Won – was aired on BBC4 in February 2012. In 2014 he presented a documentary on World War One horses for BBC4 and appeared in a Channel 5 film on The First Great Escape and two episodes of BBC2’s The Birth of Empire. In 2015 he featured in programmes on the Spanish Armada, the Duke of Wellington, the Battle of Waterloo, the history of Spain and the secret rescue of Ethiopia’s Jews. In 2106 he presented World War Two: A Timewatch Guide and Russia: A Timewatch Guide, and appeared in a six-part series on Adolf Hitler. In 2020 he presented Prince Albert: A Victorian Hero Revealed for Channel 4. In 2021 he appears in the Netflix series Road to Victory in Colour.\n\nSaul gives frequent talks about military history and has spoken at all the major literary festivals. He has also lectured at the Security Service (MI5), the National Army Musuem and the Imperial War Museum. He has led history tours to India and the Crimea, and has appeared as a guest speaker on The World ship.\n\nSaul is a Fellow of the Royal Historical Society and a Professorial Research Fellow at the University of Buckingham’s Humanities Research Institute. From 2009 to 2021, he was Professor of Military History at the University of Buckingham and Programme Director for Buckingham’s London-based MPhil in Military History.\n\nHe lives in Somerset with his wife and three daughters."}, {"url": "https://aspectsofhistory.com/authors/saul-david/", "page_content": "Alan Furst commented in the New York Times Book Review: ‘Tense and riveting…This is the achievement of a masterly, first-rate historian.’ The film rights were bought by Hollywood’s Participant Media and used in the making of the motion picture ‘Entebbe’ which was released worldwide in the spring of 2018. The film is co-produced by Working Title, directed by José Padilha, and stars Rosamund Pike, Daniel Brühl and Eddie Marsan.\n\nIn 2019, he brought out The Force: The Legendary Special Ops Unit and WWII’s Mission Impossible, which was hailed as a ‘monumental achievement’ (Douglas Brinkley), ‘an essential part of anyone’s library’ (Doug Stanton), and ‘a very fine book…masterly in style’ (Alexander Rose, Wall Street Journal). His latest book, Crucible of Hell: Okinawa – The Last Great Battle of the Second World War, was published in the spring of 2020 in the UK and US to coincide with the 75th anniversary of the campaign. It has been described by Antony Beevor as ‘Excellent…gripping narrative’ and named as an Amazon.com History Book of the Month and a Times/Sunday Times Non-fiction Book of the Year. In a five-star review in the Daily Telegraph, Simon Heffer described Saul as ‘peerless now among our military historians’.\n\nHis next book, due for publication in the autumn of 2021, is SBS: Silent Warriors – The Authorized Wartime History. The book will include previously unseen documents from the SBS Association Archives, the first-time that Britain’s top-secret maritime special forces unit has opened its doors to a historian.\n\nSaul has also written three bestselling historical novels, Zulu Hart, Hart of Empire and, published in 2018, The Prince and the Whitechapel Murders. Bernard Cornwall wrote of Saul: ‘A first-rate historian, now a masterly story teller.’\n\nHe has presented and appeared in numerous historical documentaries for all the major TV and streaming channels, including BBC1, 2 and 4, ITV1, Channel 4, Channel 5, History, National Geographic, Netflix, PBS, RMC Découverte, and Discovery.\n\nHe is Professor of Military History at the University of Buckingham where he teaches a Master’s in Military History by Research."}, {"url": "https://sauldavid.co.uk/", "page_content": "Saul David is a Sunday Times bestselling military historian, novelist and broadcaster.\n\nHis history books include The Indian Mutiny (shortlisted for the Westminster Medal for Military Literature), Zulu (a Waterstone's Military History Book of the Year), and Operation Thunderbolt: Flight 139 and the Raid on Entebbe Airport (an Amazon History Book of the Year). Alan Furst commented in the New York Times Book Review: 'Tense and riveting...This is the achievement of a masterly, first-rate historian.' The film rights for Operation Thunderbolt were bought by Hollywood's Participant Media and used in the making of the motion picture 'Seven Days in Entebbe' which was released worldwide in the spring of 2018. The film is co-produced by Working Title, directed by José Padilha, and stars Rosamund Pike, Daniel Brühl and Eddie Marsan.\n\nIn 2019, he brought out The Force: The legendary Special Ops Unit and WWII's Mission Impossible, which was hailed as a \"monumental achievement\" (Douglas Brinkley) and \"an essential part of anyone's library\" (Doug Stanton). Crucible of Hell: Okinawa - The Last Great Battle of the Second World War, was published in the spring of 2020 to coincide with the 75th anniversary of the campaign, and was shortlisted for the 2021 British Army's Military Book of the Year. It was described by Antony Beevor as 'Excellent...gripping narrative' and named as an Amazon.com History Book of the Month and Daily Telegraph and Times/Sunday Times History Book of the Year. In a 5-star review in the Daily Telegraph, Simon Heffer described Saul as 'peerless now among our military historians'.\n\nSBS: Silent Warriors – The Authorized Wartime History was published on 2 September 2021 to universal praise. 'A terrific book,' wrote James Holland in the Daily Telegraph, 'written with all the gusto, thrills and head excitement these SBS operations richly deserve. It really is one of the most enjoyable histories I've read in many a year.' It was an instant Sunday Times Top 10 bestseller, entering the list at No. 9 and climbing to No. 4. It was also shortlisted for the Maritime Foundation's Mountbatten Award for Best Book of 2022.\n\nSaul's latest book, Devil Dogs: First In, Last Out - King Company from Guadalcanal to the Shores of Japan, about a company of marines fighting its way through the Pacific, was published on 15 September 2022 in the UK and US. It was given a 5-star review in the Sunday Telegraph with Simon Heffer writing: 'Superb... David has a claim to be our finest living military historian.' It has been named a Times/Sunday Times and Daily Telegraph History Book of the Year.\n\nSaul has also written three bestselling historical novels, Zulu Hart, Hart of Empire and The Prince and the Whitechapel Murders.\n\nSaul has presented and appeared in history programmes for all the major TV and streaming channels. He is a Fellow of the Royal Historical Society and a Professorial Research Fellow at the Humanities Research Institute, University of Buckingham.\n\nIn 2021, Saul founded the Military History Club, offering members exclusive digital content (in the form of newsletters, podcasts, videos and magazines), but also the opportunity to engage with top military historians around the dinner table, attend book launches and bespoke history tours, and even try their hand at writing for the club’s annual e-publication Militaria. For more details and an online application form, click on the link to the club website.\n\nIn March 2022, Saul began co-hosting the Battleground podcast with fellow military historian Patrick Bishop. The podcast began with a series on the Falklands War, and has now moved on to the ongoing conflict in Ukraine. Its many guests include Sir Max Hastings, Sir Antony Beevor, Orlando Figes, Owen Matthews, Antony Loyd, Philipps O'Brien and Generals Lord Dannatt and Sir Mike Jackson. The podcast has grown in popularity and now exceeds 100,000 downloads a week Click here to listen to the podcast"}, {"url": "https://www.history.com/news/7-things-you-may-not-know-about-the-battle-of-waterloo", "page_content": "1. When Napoleon met his Waterloo, he wasn’t actually in Waterloo.\n\nIn spite of its moniker, the battle was waged three miles south of the town of Waterloo in the villages of Braine-l’Alleud and Plancenoit along the Mont Saint Jean Ridge. While the French referred to the military clash as the “Battle of Mont Saint-Jean,” it became known in most of the world as the “Battle of Waterloo” because the Duke of Wellington, who led the victorious forces, made his headquarters in the village and the dateline written on the official report he sent back to Britain ultimately became linked in popular memory with the battle. “Napoleon never set a foot in Waterloo—it’s a fact,” Belgian historian and former Waterloo resident Bernard Coppens told the Wall Street Journal.\n\n2. British troops comprised only a minority of Wellington’s forces.\n\nThe Duke of Wellington may have been British, but the army he led into battle was a multi-national force with soldiers from Ireland, Wales and Scotland (Wellington himself was born in Ireland and of Anglo-Irish ancestry.) Approximately half of Wellington’s forces hailed from German states, and Dutch and Belgian soldiers fought in sizable numbers as well. In addition to Wellington’s army, more than 50,000 Prussians under Marshal Gebhard Leberecht von Blucher arrived at the battlefield in the late afternoon and turned the tide of the fight.\n\n3. A defeated Napoleon considered an escape to the United States.\n\nFollowing the Battle of Waterloo, Napoleon returned to Paris, where he was forced to abdicate on June 22, 1815. He fled to the coastal city of Rochefort, from where he likely intended to sail to the United States, which had just concluded its own war with Great Britain. “You must have heard of the new misfortune of the emperor,” wrote one of Napoleon’s relatives to another in the wake of his abdication. “He’s going to the United States, where we shall all join him.” British ships, however, had blockaded Rochefort, and the former emperor did not want to risk the potential embarrassment of being caught hiding on board a vessel. With his passage to the United States blocked, Napoleon surrendered to a British warship on July 15, 1815, and three months later he was exiled to the remote South Atlantic island of St. Helena, where he lived out his final six years until his death in 1821. Napoleon’s brother Joseph, the deposed king of Spain, was able to make safe passage to the United States from another French port and lived in New Jersey for 15 years. Fleeing Bonapartists also established the short-lived Vine and Olive Colony in Alabama as a safe haven.\n\n4. Wet weather caused a fatal delay by Napoleon.\n\nHeavy rain fell upon the region around Waterloo on the night before the battle. Napoleon’s artillery was among his greatest strengths, but the French emperor feared that the soggy and muddy conditions would bog down the advance of his men, horses and heavy guns. Hoping that the ground would dry, Napoleon waited until midday to launch his attack. The delay would prove costly as it ultimately allowed Blucher’s Prussian army to join the fight before the French could defeat Wellington’s forces.\n\n5. Hemorrhoids may have been Napoleon’s true Waterloo.\n\nAs detailed in Phil Mason’s book “Napoleon’s Hemorrhoids: And Other Small Events That Changed History,” some scholars believe the French military leader suffered a painful bout of hemorrhoids on the morning of the Battle of Waterloo that prevented him from riding his horse to survey the battlefield as was his custom and could have contributed to his defeat. However, Waterloo expert Alasdair White told the New York Times that the story is “an absolute myth” concocted by Napoleon boosters because they “cannot believe that the great man lost, so there must have been something wrong with him.”\n\n6. Scavengers harvested “Waterloo teeth” from dead soldiers to make dentures.\n\nWithin hours of the battle’s end, locals employing pliers as well as small hammers and chisels began to remove the front teeth from tens of thousands of soldiers lying dead on the battlefield. With demand for human teeth high, the looters sold the pilfered teeth to dentists who crafted them into dentures. According to England’s National Army Museum, English dentists did nothing to conceal their sources, advertising the dentures as “Waterloo teeth” or “Waterloo ivory.” Even by the time of the Civil War, English dentists continued to do a brisk trade importing the teeth of fallen soldiers, still referred to as “Waterloo teeth.”\n\n7. The Duke of Wellington pocketed a sizable tribute.\n\nThe peace treaty agreed to between France and the European powers in November 1815 reduced the size of French territory and required the defeated country to pay an enormous indemnity over the course of five years. In recognition of his service, Parliament awarded the Duke of Wellington 200,000 British pounds, equivalent to 15 million British pounds today, according to the Royal Engineers Museum."}, {"url": "https://www.nationalgeographic.co.uk/history-and-civilisation/2017/11/how-the-battle-of-waterloo-changed-the-world", "page_content": "Did researching and writing this book change your view of Napoleon?\n\nYes, it made me admire him far more than I used to. He’s an incredibly intelligent man. He’s an attractively intelligent man.\n\nYou and I would enjoy having dinner with Napoleon. He’d be a very amusing and stimulating companion. In many ways, he was also an enlightened ruler. His Code Napoleon is an extremely enlightened law code. At the same time this is a man who had a very, very low threshold for boredom. I think he was addicted to war. General Robert E. Lee, at Fredericksburg said, “It is well that war is so dreadful, otherwise we would grow too fond of it.”\n\nNapoleon would never have agreed with that. War was his drug. There’s no evidence that Wellington enjoyed war. He said after Waterloo, and I believe him, “I pray to God that I have fought my last battle.” He spent much of the battle saying to the men, “If you survive, if you just stand there and repel the French, I’ll guarantee you a generation of peace.” He thought the point of war was peace.\n\nHow did Waterloo change the world?\n\nThe 19th century is Britain’s century. Waterloo finishes any hopes of France’s rivaling Britain as the dominant power in the world. That is what they were actually fighting over. That fight goes all the way back to the Seven Years War. That is a great British victory because it gets rid of France from Canada. But the moment you remove France from Canada, the Thirteen Colonies no longer need the Red Coats.\n\nSo, the unforeseen consequence is the American Revolution. The French are the Americans' strongest allies. The largest army at Yorktown was the French army. They see that as a huge victory for France. In 1976, at the Bicentennial, they issued a stamp showing a bare-breasted Marianne hacking down a British lion. At her feet is a tiny baby wearing a sash. On the sash it says, Les Etats Unis (The United States).\n\nHow did writing this book affect you, personally? Will it be your last nonfiction work?\n\nIt’s definitely my last nonfiction book. More than anything, it saddened me. There were a couple of passages in a memoir I just couldn’t reread. They’re so horrible, especially about the horses. There was a huge cavalry attack by the French on the British lines.\n\nSomebody described the French cavalry as the most beautiful troops in the world. But the attack was ill-timed, so they die in their hundreds because they thought the British were retreating. Horses are herd animals. A horse that has lost its rider, instead of doing the sensible thing, which is trotting the hell away from the battlefield and finding a nice pasture, would come back again and again. So all these riderless horses would charge with the other horses. The horses suffered terribly.\n\nI end the book with a letter written by an Irishman, who commanded a British battalion. He’s writing to his wife: a letter many, many soldiers have written and many wrote just before Waterloo, which they hope is not going to be delivered. It’s this beautiful love letter that is incredibly touching. It’s plain that Arthur Heyland loved his wife and children. Sure enough, he did die the next day. I defy people to read that letter and not feel tearful. That sadness, the waste—that’s what I felt.\n\nThis interview has been edited and condensed.\n\nSimon Worrall curates Book Talk. Follow him on Twitter or at simonworrallauthor.com."}, {"url": "https://johnmurphyeditor.com/documentary/waterloos-warriors/", "page_content": "2015 Tile Films/Caledonia TV Dir: Ruán Magan\n\nTG4 Version Titled – WATERLOO: NA LAOCHRA GAEL\n\nBBC Version Titled – THE SCOTS AT WATERLOO\n\nINT Version Titled – WATERLOO’S WARRIORS\n\nI was thrilled to edit these documentaries marking the Irish and Scottish involvement in the battle of Waterloo on its 200th anniversary. There are 2 one hour docs for the international market, a 90minute feature length version for TG4 and a one hour special on the Scots for BBC Scotland. Each version was its own challenge and I think all 3 are enjoyable in different ways. Cutting the BBC doc meant I actually got to go and edit in Glasgow for a few weeks which I enjoyed immensely. I also throughly enjoyed working with the director Ruan Magan and Producer Stephen Rooke and the gang at Tile Films around the corner from me here on Baggot Street.\n\nAbout the Show…\n\nThe film will reveal the stories of the Irish and Scottish men and women who lived and died at the Battle of Waterloo. It will be broadcast on 18th June 2015, the 200th anniversary of this epic battle, one of the key events in world history.\n\nNarrated by Manchán Magan, the docudrama stars GAA commentator Mícheál Ó Muircheartaigh as the Kerry Waterloo veteran Muiris Ó Sé, Steve Wall (‘The Walls’, ‘The Stunning’) as the Duke of Wellington, and Olwen Fouéré (‘Ballykissangel’, ‘Space Truckers’) as army wife Jenny Griffiths.\n\nThe docudrama covers events that occurred in Waterloo, Belgium on 18th June 1815. The battle for the future of Europe is underway, as Napoleon’s French army engages the Duke of Wellington’s redcoats. Amid all the noise, smoke and blood of the battlefield, it’s no surprise to hear Irish being spoken. This is because Wellington’s “British” army contained thousands of Irishmen, many of whom were native Irish speakers. There were also many Scots in the army, and together these Celtic troops played a vital role in the battle. Now, 200 years on, this feature-length docudrama uses first-hand accounts and rare Irish language documents to tell the story of Waterloo from the perspective of “Na Laochra Gael”. The docudrama is a co-production between leading Irish TV production company Tile Films and Scotland’s Caledonia TV. The two companies renew the successful co-production partnership behind the recent, highly acclaimed docudrama ‘After Braveheart’ (RTÉ / BBC, 2015).\n\nThe docudrama was produced by Stephen Rooke and Seona Robertson, directed by Ruán Magan and written by Les Wilson with Tony Deegan serving as Line Producer. It was posted at EMC Post Production in Dun Laoghaire. Sound mixing was carried out in Avatar Audio Post Production in Dublin.\n\nOther key crew members include Ronan Fox (Lighting Cameraman), John Murphy (Editor), Killian Fitzgerald (Dubbing Mixer), Ronan Coleman (Music Composer), Ciara Walsh (Post Production Supervisor), Cillian Duffy (Online Editor), Gary Curran (Colourist), Eugene McCrystal (Visual Effects) and Thomas Fitzgerald (Graphics).\n\nDirector Ruán Magan says, “The first-hand accounts show that these men and women were unusually brave. From Lizzie McMullen’s rescue of her wounded husband, to Muiris Ó Sé’s poignant recollections, these are riveting stories and I was glad to have the opportunity to bring them to life”. Producer Stephen Rooke was similarly enthusiastic: “I was astounded to learn that there were so many Irish and Scots at Waterloo,” he says. “We knew this could be an amazing documentary, and it also gave us an opportunity to renew our very productive partnership with Caledonia TV in Scotland.”\n\nWaterloo was the last major formal pitched battle in history, a gory spectacle with 200,000 men fighting on a couple of square miles of ground. Through gritty drama re-enactments and archive imagery, this docu-drama recreates the key moments of the battle. It also features contributions from leading historians and commentators Dr Máire Cronin, Professor Saul David, Dr Aoife Bhreathnach and Páraic Breathnach.\n\n‘Waterloo: Na Laochra Gael’ was produced with the support of TG4, BBC Scotland, the Broadcasting Authority of Ireland’s Sound & Vision Funding Scheme, Flame Distribution and Section 481, Ireland’s Film Tax Corporation Credit."}, {"url": "https://www.britannica.com/event/Battle-of-Waterloo", "page_content": "Napoleon’s return and the allied response\n\nHaving been exiled to the island of Elba in May 1814, Napoleon returned to France on March 1, 1815, landing near Cannes with 1,000 men. He won support from the rural peasantry as he marched toward Paris, and Louis XVIII fled the country prior to Napoleon’s arrival in the capital on March 20. In a treaty of alliance signed on March 25, Great Britain, Prussia, Austria, and Russia each vowed to maintain 150,000 men in the field until Napoleon had been overthrown. Shortly thereafter it was decided that the allied armies, comprising a total of about 794,000 troops, should assemble along the French frontier and march on Paris by convergent routes. The time needed for the Russians to reach the Rhine would delay the invasion until early July, and that allowed Napoleon the opportunity to organize his defenses. Napoleon could command over 160,000 first-line troops, but he was forced to relegate many of them to border defense. Because Louis XVIII, who had been restored to the throne upon Napoleon’s first abdication, had abolished conscription, Napoleon was not immediately able to draw on the vast number of trained men who had returned to civilian life. To address that shortfall, he quickly set about raising troops for an early campaign. All undischarged soldiers were summoned to arms, and in eight weeks 80,000 men were added to the army. At the beginning of June—too late for use in the Waterloo campaign—the conscription class of 1815 was ordered to mustering points, and Napoleon hoped to have more than 500,000 men under arms before autumn. By April 27 Napoleon had decided to attack Wellington and Blücher in the southern Netherlands (now Belgium), in the hope of defeating them before the Austrians and Russians could bring their forces to bear.\n\nThe allied campaign against Napoleon began in earnest in early June, but the armies that had assembled in Belgium were of dubious quality. Blücher’s four corps included many inexperienced conscripts among their 120,000 men. Wellington, whose forces numbered more than 93,000 before the campaign began, characterized his own army as “infamous.” Of the 31,000 British troops under his command, most had never been under fire. Many of the 29,000 Netherlanders under William, Prince of Orange (later William II), were unreliable, having served under Napoleon little more than a year before. The remainder of that polyglot army was made up of some 16,000 Hanoverians, roughly 6,800 Brunswickers, and the 6,300 men of George III’s German Legion. Only the last contingent, veterans of the Peninsular War, could be safely trusted in a crisis. Thus, the majority of the troops arrayed against Napoleon were no match for the highly enthusiastic and largely veteran French force. Wellington and Blücher had agreed to come to each other’s assistance should either be attacked, but the lack of any real preparation prior to June 15 shows that little serious attention had been given to such a possibility."}, {"url": "https://www.britannica.com/event/Battle-of-Waterloo/The-first-hours-of-battle", "page_content": "The first hours of battle\n\nThe site of the battle on June 18 comprised two low ridges separated by a valley that was at no point more than 1,200 yards (1.1 km) in breadth. Wellington’s first line of defense was an unpaved road from Braine-l’Alleud, which ran just south of the village of Mont-Saint-Jean along the crest of the northern ridge. Its thick hedges offered excellent cover, and most of Wellington’s troops were placed on the ridge’s reverse slope to shelter them from the French artillery. Two advance posts located about 500 yards (450 metres) in front of the main line added greatly to the natural strength of the position and proved critical in the battle to come: the château and its grounds at Hougoumont and, roughly 1,100 yards (1 km) to its east, the farm and sandpit at La Haye Sainte. Less important outposts were at the farms of La Haye and Papelotte, farther to the east. Although Wellington had made expert use of the terrain, his 67,661 men and 156 guns would barely suffice to preserve his front until evening against Napoleon’s 71,947 men and 246 guns. Napoleon drew up his forces on the southern ridge centred on La Belle Alliance, 1,200 yards (1.1 km) south of Wellington’s position.\n\nBefore assaulting the centre of the British line, Napoleon ordered a diversion against Hougoumont. The sodden ground compelled Napoleon to delay the start of hostilities, and at 11:35 am the first shots of the Battle of Waterloo were fired by one of Marshal Honoré Charles Reille’s artillery divisions. Thus began a mismanaged attack on the château which would absorb increasing numbers of French troops without drawing defenders from Wellington’s centre. For an hour and a half the battle was confined to Hougoumont. At 1 pm, when he was about to instruct the great battery of 80 guns near La Belle Alliance to cannonade the enemy centre, the emperor perceived a mass of troops emerging from the woods of Chapelle Saint-Lambert, 6 miles (10 km) to the northeast. He soon learned that it was the IV Corps (30,000 strong) of Friedrich Wilhelm, Freiherr (baron) von Bülow, and that it was being followed by the bulk of the Prussian army. A hurried dispatch was sent to Grouchy, ordering him to rejoin the main body of the French army and engage Bülow, but the message did not reach him until 5:00 pm. By that point, Grouchy had become completely entangled with Johann Adolf Thielmann’s III Corps at Wavre, and, even if he had been free to march at once, he could not have reached Napoleon until well after nightfall.\n\nNapoleon still hoped to defeat Wellington before the Prussians could arrive in force. Two cavalry divisions were sent to form a screen in Bülow’s path, and a corps under Georges Mouton, count de Lobau, was placed behind them. By 1:30 pm those arrangements had been completed. The battery near La Belle Alliance opened fire, and 18,000 infantry under Ney and Drouet advanced on the allied centre a half hour later. No cavalry accompanied the attack, and the British infantry met Drouet’s men with maximum firepower. Many of the attackers marched in an unusual formation: in three divisional columns, 200 men wide and 24–27 ranks deep. Thus, they were unable to return fire effectively and were very vulnerable to artillery. La Haye Sainte was attacked but not taken, and Papelotte was occupied. Wellington’s cavalry commander, Henry Paget, earl of Uxbridge (later 1st marquess of Anglesey), now threw his horsemen against the disorganized French columns and the numerically inferior cavalry coming up behind. The French withdrew from Papelotte in good order, but elsewhere they failed to stem the advance of the enemy horsemen. Flushed with success, Lord Edward Somerset and Sir William Ponsonby’s cavalry ignored Uxbridge’s call to return and charged the French lines. Ponsonby was killed and 2,500 English horsemen—a third of those taking part—were lost in a largely pointless action. In spite of that reverse, Wellington had surmounted the first crisis. Drouet’s corps had been driven back from the slopes before the British lines with severe casualties and the loss of 3,000 prisoners.\n\nIt was now 3:00 pm, and the intensity of the fighting briefly slackened. The exception was at Hougoumont, where 1,200 allied troops continued to hold off many times their number of French. Napoleon ordered Ney to seize La Haye Sainte quickly in preparation for an assault by Drouet’s and Reille’s corps and elements of the Imperial Guard. The two brigades of infantry that Ney dispatched to La Haye Sainte were repulsed, and Ney then committed the bulk of the French cavalry to a fatally dangerous course of action. Mistaking the movement of wounded men and empty ammunition wagons from Wellington’s centre for a weakening of the front, just after 4:00 pm Ney brought up Édouard-Jean-Baptiste Milhaud’s two divisions of cavalry to seize, as he thought, that chance of deciding the battle. Worse still, without consulting his superiors, Charles Lefebvre-Desnouettes ordered his cavalry division to follow Milhaud. The British responded by forming infantry squares—hollow defensive formations several ranks deep that had proven to be especially effective at breaking cavalry charges. Although the French horsemen were extremely determined, a massed cavalry attack had little chance of success when delivered virtually without infantry and close artillery support against unbroken English squares. English gunners took a heavy toll of the 5,000 cuirassiers (heavy cavalry) mounting the slopes between Hougoumont and La Haye Sainte. Driven off by Uxbridge’s remaining cavalry, the cuirassiers reformed, but their second attack also failed. Although very critical of Ney’s premature use of unaccompanied cavalry, Napoleon decided to stand by Ney’s action. François-Étienne Kellermann’s two cavalry divisions were sent to support Ney, and they were joined—possibly without Napoleon’s orders—by Claude-Étienne Guyot’s division of cavalry from the Guard. There were now 9,000 cavalry about to attack on a front reduced to 500 yards (450 metres) by the zones of fire around Hougoumont and La Haye Sainte.\n\nBritannica Quiz France: A History Quiz\n\nMeanwhile, on the French right flank, at about 4:30 pm and after an 11-hour march through difficult country, Bülow’s leading divisions opened fire from Paris Wood on the French cavalry screen. Lobau resolved to engage the Prussians before Bülow could deploy the rest of his force, and he held his ground, though increasingly outnumbered. Blücher, who had accompanied Bülow’s corps, switched the Prussian attack to Plancenoit, forcing Lobau to fall back and detach a brigade to defend the village. Sheer numbers eventually forced the French out of Plancenoit, and Napoleon dispatched Philippe-Guillaume Duhesme’s division of the Young Guard to recover it. Duhesme’s success there relieved the pressure on the French right flank for the moment."}, {"url": "https://www.history.com/topics/british-history/battle-of-waterloo", "page_content": "The Battle of Waterloo, which took place in Belgium on June 18, 1815, marked the final defeat of Napoleon Bonaparte, who conquered much of Europe in the early 19th century. Napoleon rose through the ranks of the French army during the French Revolution, seized control of the French government in 1799 and became emperor in 1804. Through the Napoleonic Wars, he expanded his empire across western and central Europe. The Battle of Waterloo, in which Napoleon’s forces were defeated by the Prussians and the British (led by the Duke of Wellington), marked the end of his reign and of France’s domination in Europe.\n\nNapoleon’s Rise to Power\n\nNapoleon Bonaparte, born in 1769 on the Mediterranean island of Corsica, rose rapidly through the ranks of France’s military and proved himself a talented and daring leader.\n\nAfter seizing political power in France in a 1799 coup d’état, he was given the title of first consul and became France’s leading political figure.\n\nIn 1804, he crowned himself the emperor of France in a lavish ceremony. Under Napoleon, France engaged in a successful series of battles against various coalitions of European nations, and the French empire expanded across much of western and central Europe.\n\nBattle of Leipzig\n\nIn 1812, Napoleon led a disastrous invasion of Russia in which his army was forced to retreat and suffered massive casualties. At the same time, the Spanish and Portuguese, with assistance from the British, drove Napoleon’s forces from the Iberian Peninsula in the Peninsular War (1808-1814).\n\nIn the 1813 Battle of Leipzig, also known as the Battle of Nations, Napoleon’s army was defeated by a coalition that included Austrian, Prussian, Russian and Swedish troops. Afterward, Napoleon retreated to France, where in March 1814 coalition forces captured Paris.\n\nNapoleon’s Abdication and Return\n\nOn April 6, 1814, Napoleon, then in his mid-40s, was forced to abdicate the throne, ending some 25 years of warfare. With the Treaty of Fontainebleau, he was exiled to Elba, a Mediterranean island off the coast of Italy.\n\nLess than a year later, on February 26, 1815, Napoleon escaped Elba and sailed to the French mainland with a group of more than 1,000 supporters. On March 20, he returned to Paris, where he was welcomed by cheering crowds.\n\nThe new king, Louis XVIII, fled, and Napoleon embarked on what came to be known as his Hundred Days campaign.\n\nNapoleon Marches on Belgium\n\nUpon Napoleon’s return to France, a coalition of allies—the Austrians, British, Prussians and Russians—who considered the French emperor an enemy began to prepare for war. Napoleon raised a new army and planned to strike preemptively, defeating the allied forces one by one before they could launch a united attack against him.\n\nIn June 1815, Napoleon’s forces marched into Belgium, where separate armies of British and Prussian troops were camped. Napoleon rallied his troops by declaring “For all Frenchmen who have the courage, the moment has come to conquer or perish!”\n\nAt the Battle of Ligny, on June 16, Napoleon used his superior artillery to defeat the Prussians under the command of Gebhard von Blucher. However, the French were unable to totally destroy the Prussian army, which quickly regrouped and retreated to a position not far from the village of Waterloo in modern-day Belgium.\n\nArthur Wellesley, Duke of Wellington\n\nTwo days later, on June 18, 1815, Napoleon led his army of some 72,000 troops against the 68,000-man British army, which had also taken up a position near Waterloo, where they were able to communicate with their Prussian allies.\n\nThe British army, which included Belgian, Dutch and German troops, was commanded by Arthur Wellesley, the Duke of Wellington, who had gained prominence fighting against the French during the Peninsular War. Wellington, a known expert at defensive combat, directed his troops to take an advantageous position along a ridge.\n\nREAD MORE: 7 Things You May Not Know About the Battle of Waterloo\n\nBattle of Waterloo Begins\n\nIn a critical blunder, Napoleon waited until midday to give the command to attack in order to let the waterlogged ground dry after the previous night’s rainstorm. The delay gave Blucher’s remaining Prussian troops, who, by some accounts, numbered more than 30,000, time to march to Waterloo and join the battle against the French later that day.\n\nAlthough Napoleon’s troops mounted a vigorous attack against the British, Wellington’s position along and behind a ridge top — which had negated an early offensive bombardment by Napoleon — and the afternoon arrival of Blucher’s Prussian army turned the tide against the French.\n\nBy evening, all sides in the bloody battle had sustained heavy losses. Napoleon made one final push toward Wellington’s ridgeline position with his finest troops, the French Imperial Guard. But British guardsmen and light infantry were able to repel the French Imperial Guard advance, and Napoleon’s now-outnumbered army soon retreated in chaos.\n\nThe Prussian cavalry attacked and harried the retreating French troops long into the night. By some estimates, the French suffered almost 40,000 casualties (including dead, wounded or taken prisoner), while British and Prussian casualties numbered some 22,000. An estimated 10,800 men — most of them French soldiers — died in the Battle of Waterloo.\n\nReportedly fatigued and in poor health during the Belgian campaign, Napoleon committed tactical errors and acted indecisively. He also was blamed for appointing inadequate commanders who failed to communicate adequately and coordinate their strategy.\n\nUltimately, the Battle of Waterloo marked the end of Napoleon’s storied military career. He reportedly rode away from the battle in tears.\n\nThough he emerged victorious, the Duke of Wellington later reflected on the the horrific costs of that victory: “My heart is broken by the terrible loss I have sustained in my old friends and companions and my poor soldiers. Believe me, nothing except a battle lost can be half so melancholy as a battle won.”\n\nWellington went on to serve as British prime minister, while Blucher, in his 70s at the time of the Waterloo battle, died a few years later.\n\nDid you know? Today, the expression that someone has “met their Waterloo” means the person has suffered a decisive, final defeat.\n\nNapoleon’s Final Years\n\nAfter their crushing defeat at the Battle of Waterloo, the French dream of dominating Europe was over, as was Napoleon’s leadership. A few days after his humiliating rout at Waterloo, on June 22, 1815, Napoleon once again abdicated the throne of France.\n\nThat October, he was exiled to the remote, British-held island of Saint Helena, in the South Atlantic Ocean. He died there on May 5, 1821, at age 51, most likely from stomach cancer.\n\nNapoleon was buried on the island. However, in 1840, his remains were returned to France and entombed in a crypt at the Les Invalides military complex in Paris, where other French military leaders are interred.\n\nSources\n\nBattle of Waterloo. National Army Museum (U.K.).\n\nBattle of Waterloo. BritishBattles.com.\n\nThe Battle of Waterloo. The Telegraph.\n\nHow Did Napoleon Manage to Lose the Battle of Waterloo? Napoleon.org."}, {"url": "https://www.imdb.com/search/keyword/?keywords=battle-of-waterloo", "page_content": "TV Episode (11)\n\nFeature Film (5)\n\nShort Film (2)\n\nTV Mini-Series (1)\n\nTV Movie (1)\n\nTV Series (1)\n\nVideo (1)\n\n\n\nDrama (10) History (8) Documentary (6) War (5) Biography (4) Comedy (4) Romance (4) Action (3) Adventure (3) Animation (3) Fantasy (3) Short (3) Sci-Fi (2) Family (1) Mystery (1)\n\nBattle Of Waterloo\n\nYear 1815 (6)\n\n1810s (5)\n\n19th Century (5)\n\nNapoleon Bonaparte (5)\n\nBattle (4)\n\nEuropean History (4)\n\nFrench History (4)\n\nNapoleon (4)\n\nNapoleonic Wars (4)\n\nReference To Napoleon Bonaparte (4)\n\nBrussels Belgium (3)\n\nDuke (3)\n\nFrench Revolution (3)\n\nWaterloo (3)\n\nAbdication (2)\n\nBased On Novel (2)\n\nBased On True Story (2)\n\nBattle Of Leipzig (2)\n\nBrother Sister Relationship (2)\n\nCavalry (2)\n\nConqueror (2)\n\nContinental System (2)\n\nCorsica (2)\n\nCoup D'etat (2)\n\nDancing (2)\n\nDefeat (2)\n\nDuchess (2)\n\nDuke Of Wellington (2)\n\nExile (2)\n\nFrance (2)\n\nFrench Army (2)\n\nFrench Empire (2)\n\nFrench Invasion Of Russia (2)\n\nHusband Wife Relationship (2)\n\nMilitary (2)\n\nNapoleonic War (2)\n\nOne Word Title (2)\n\nPeninsular War (2)\n\nPeriod Drama (2)\n\nPeterloo Massacre (2)\n\nPolitics (2)\n\nPrussia (2)\n\nReference To Josephine Bonaparte (2)\n\nReference To Louis Xviii (2)\n\nReference To Napoleon (2)\n\nRise And Fall (2)\n\nSaint Helena Island (2)\n\nSoldier (2)\n\nTitle Spoken By Character (2)\n\nWar Of The Seventh Coalition (2)\n\n1790s (1)\n\n1800s (1)\n\n18th Century (1)\n\n1930s (1)\n\n1938 (1)\n\n1990s (1)\n\n2000s (1)\n\n30s (1)\n\n35mm (1)\n\nAbsolutism (1)\n\nActing (1)\n\nAction Hero (1)\n\nActor (1)\n\nAdjutant (1)\n\nAdulterous Wife (1)\n\nAdventure Hero (1)\n\nAfternoon Tea (1)\n\nAmbition (1)\n\nAncestor Descendant Relationship (1)\n\nAnthropomorphic Animal (1)\n\nAntique Car (1)\n\nAristocrat (1)\n\nArmy (1)\n\nArthur Wellesley 1st Duke Of Wellington (1)\n\nAustrian Empire (1)\n\nBacklot (1)\n\nBanishment (1)\n\nBased On History (1)\n\nBased On Play By Same Name (1)\n\nBased On Real Person (1)\n\nBattle Of Aspern Essling (1)\n\nBattle Of Austerlitz (1)\n\nBattle Of Borodino (1)\n\nBattle Of Vimeiro (1)\n\nBattle Of Wagram (1)\n\nBayonet (1)\n\nBeauty Sleep (1)\n\nBelgium (1)\n\nBest Friend (1)\n\nBirthday Cake (1)\n\nBlacklist (1)\n\nBlockade (1)\n\nBloodless Coup (1)\n\nBlu Ray Special Feature (1)\n\nBoarding House (1)\n\nBoarding School (1)\n\nBonus Feature (1)\n\nBourbon Monarchy (1)\n\nBoy (1)\n\n\n\nIMDb user rating (average) 1 1.1 1.2 1.3 1.4 1.5 1.6 1.7 1.8 1.9 2.0 2.1 2.2 2.3 2.4 2.5 2.6 2.7 2.8 2.9 3.0 3.1 3.2 3.3 3.4 3.5 3.6 3.7 3.8 3.9 4.0 4.1 4.2 4.3 4.4 4.5 4.6 4.7 4.8 4.9 5.0 5.1 5.2 5.3 5.4 5.5 5.6 5.7 5.8 5.9 6.0 6.1 6.2 6.3 6.4 6.5 6.6 6.7 6.8 6.9 7.0 7.1 7.2 7.3 7.4 7.5 7.6 7.7 7.8 7.9 8.0 8.1 8.2 8.3 8.4 8.5 8.6 8.7 8.8 8.9 9.0 9.1 9.2 9.3 9.4 9.5 9.6 9.7 9.8 9.9 10 to 10 9.9 9.8 9.7 9.6 9.5 9.4 9.3 9.2 9.1 9.0 8.9 8.8 8.7 8.6 8.5 8.4 8.3 8.2 8.1 8.0 7.9 7.8 7.7 7.6 7.5 7.4 7.3 7.2 7.1 7.0 6.9 6.8 6.7 6.6 6.5 6.4 6.3 6.2 6.1 6.0 5.9 5.8 5.7 5.6 5.5 5.4 5.3 5.2 5.1 5.0 4.9 4.8 4.7 4.6 4.5 4.4 4.3 4.2 4.1 4.0 3.9 3.8 3.7 3.6 3.5 3.4 3.3 3.2 3.1 3.0 2.9 2.8 2.7 2.6 2.5 2.4 2.3 2.2 2.1 2.0 1.9 1.8 1.7 1.6 1.5 1.4 1.3 1.2 1.1 1 Number of votes to »"}]}