{"Tomasz Lis is a graduate of the University of Warsaw and the National School of Public Administration.": [{"url": "https://commons.wikimedia.org/wiki/Category:Tomasz_Lis", "page_content": "Award received\n\nPolish Journalist of the Year (1999)\n\nPolish Journalist of the Year (2006)\n\nPolish Journalist of the Year (2009)\n\nOfficer of the Order of Polonia Restituta (2014)\n\nHyena of the Year\n\nGrand Press Awards\n\nWiktory\n\nTelekamery\n\nKisiel Prize"}, {"url": "https://www.europeanpressprize.com/laureate/tomasz-lis/", "page_content": "Tomasz Lis\n\nTomasz Lis began his career in 1990 in TVP (Polish Public Television) after winning an open competition for the post of a newsreader for TVP’s main evening news, the most widely watched in Poland ‘Wiadomości’. Between 1994 and 1997 he held the position of a senior correspondent for TVP in Washington, D.C. From 1997 to 2004 he worked for the TVN network, where he created and anchored the news broadcast FAKTY – second in viewership after TVP’s (Polish Public Television) ‘Wiadomości’. From 2006 to 2007 he was associated with Polsat Network, being a Member of Polsat’s Board of Directors. While at Polsathe was an author and host of Poland’s most watched political talk-show at the time ‘What’s with Poland?”. From 2008 till 2016 he anchored his own political talk-show TOMASZ LIS LIVE the most watched political show in Poland rating and viewership-wise.\n\nHis cooperation with TVP ended when representatives of Law and Justice Party took over public television in Poland and dismissed all independent journalists.\n\nIn February 2012, he founded ‘NaTemat’, a news website, featuring columnists and various news sources. In March 2012 he became editor-in-chief of the current affairs weekly ‘Newsweek Polska’. He is also an author of non-fiction political books with “Co z tą Polską?” (What’s with Poland?) published in 2003 with which became a bestseller in Poland, selling over 100,000 copies.\n\nDuring the past 17 years of his career he has interviewed a number of key figures in world politics. Among them are Bill Clinton, George Bush Sr., George W. Bush, Michail Gorbachev, Dmitri Medvedev, Tony Blair, Gordon Brown, Yitzhak Rabin, Benjamin Netanyahu, Hillary Clinton, Condoleezza Rice and Colin Powell.\n\nTomasz was awarded nine ‘Wikotor’s’ the equivalent of the American Emmy Awards. Awarded, as he only journalist in Poland, “Journalist of the Year’ prize by PRESS magazine in 1999, 2007 and 2009.\n\nTomasz Lis was selected for the the 2017 European Press Prize shortlist with his columns for Newsweek Polska"}, {"url": "https://prabook.com/web/tomasz.lis/1790909", "page_content": "Tomasz Lis\n\njournalist television presenter\n\nMarch 6, 1966 Zielona Góra, Lubusz Voivodeship, Poland\n\nTomasz Lis began his career in TVP (Polish Public Television) in 1990 after winning an open competition for the post of a newsreader. From 1994 to 1997: correspondent in Washington, District of Columbia for TVP. From 1997 to 2004: co-author of “Fakty TVN” on Polish television station TVN. From 2006 to 2007: editor-in-chief of \"Wydarzenia\" on Polsat. In 2003 he published his book Company z tą Polską? (What\"s with Poland?) which became a bestseller in Poland (selling over 100,000 copies). From late 2010 to February 2012: editor-in-chief of the current affairs weekly \"Wprost.\" In March 2012 he became editor-in-chief of \"Newsweek Polska.\" In December 2015 he received \"Hyena 2015\" from Association of Polish Journalists. \"Hyena 2015\" is awarded annually to a journalist voted the most biased by the association and in violation of ethical and professional norms. The incident that led to the award was to distribute during the Presidential campaign posts of daughter of President of Poland, that were not in fact written by her. Tomasz Lis apologised for the incident that the award focused on and deemed selecting him a politically motivated decision. Nevertheless, on March 8, 2016 he had again distributed false posts of senate candidate as real posts, thus violating basic journalistic ethics such as verification of sources. The couple divorced on June 27, 2006. They have two daughters: Pola (born in 1996) and Iga, born in 2000. In 2007 married a well-known Polish journalist, Hanna Smoktunowicz."}, {"url": "https://www.celebsagewiki.com/tomasz-lis", "page_content": "Age, Biography and Wiki\n\nTomasz Lis was born on 6 March, 1966 in Zielona Gora, Poland, is a Journalist, author, TV presenter. Discover Tomasz Lis's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 57 years old?\n\nPopular As N/A Occupation Journalist, author, TV presenter Age 57 years old Zodiac Sign Pisces Born 6 March 1966 Birthday 6 March Birthplace Zielona Gora, Poland Nationality Polish\n\nWe recommend you to check the complete list of Famous People born on 6 March. He is a member of famous Journalist with the age 57 years old group.\n\nTomasz Lis Height, Weight & Measurements\n\nAt 57 years old, Tomasz Lis height not available right now. We will update Tomasz Lis's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Tomasz Lis's Wife?\n\nHis wife is Hanna Lis (m. 2007), Kinga Rusin (m. 1994–2006)\n\nFamily Parents Not Available Wife Hanna Lis (m. 2007), Kinga Rusin (m. 1994–2006) Sibling Not Available Children Iga Lis, Pola Lis\n\nTomasz Lis Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Tomasz Lis worth at the age of 57 years old? Tomasz Lis’s income source is mostly from being a successful Journalist. He is from Polish. We have estimated Tomasz Lis's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Journalist\n\nTomasz Lis Social Network\n\nTimeline"}, {"url": "https://thecorporateasylum.com/wef/tomasz-lis/", "page_content": "Know the election was stolen?\n\nSo Do We! Think Mandates are Evil?\n\nDo Not Comply!\n\nThe Asylum is Free.\n\nFreedom is Earned.\n\nBROWSE NOW\n\nThe state of the here and now"}, {"url": "https://en.uw.edu.pl/education/degree-programmes-1st-2nd-and-long-cycle-studies-bachelor-and-master/", "page_content": "The University of Warsaw is among the top 3% of the world’s universities according to global ranking such as Times Higher Education World University Ranking (THE), Quaquarelli Symmonds World University Ranking (QS), Academic Ranking of World Universities (ARWU).\n\nIn 2021, the university performed very well in Shanghai’s Global Ranking of Academic Subjects (GRAS 2021), which included nine scientific disciplines taught at the university. Mathematics and Physics were ranked 76-100 worldwide in their categories, respectively. Read more about the international position and the quality of education at UW\n\nThe candidates are offered:"}, {"url": "https://memim.com/tomasz-lis.html", "page_content": "Tomasz Lis ( born March 6, 1966 in Zielona Góra ) is a Polish political journalist.\n\nAfter graduation, he studied journalism at the University of Warsaw. While still a student of the fourth year of study, he won an open competition for TV journalists of state television. On 3 May 1990 he made ​​his debut as host of the evening journals. Soon he was promoted to first parliamentary reporter. In 1992, he studied at Loyola University in New Orleans. From 1994 to 1997 he was the rapporteur of the Polish state television in the United States.\n\nSince 1997, he hosted the private TV station TVN, the news program \" Fakty \" (facts ). In the fall of 2003, he published the book \" Co z Tá Polska? \" ( What about go to Poland? ) Out with a circulation of over 100,000 copies. After the success of the book he was traded as a presidential candidate. In 2004 he was dismissed from TVN.\n\nOn 1 September 2005, he was a board member and program director of the private television station Polsat. With the journalist Hanna Smoktunowicz it led the news program \" Wydarzenia \" (events). For unknown reasons, he left Polsat on 20 September 2007. Shortly thereafter, in November 2007, he was engaged as advisor to the board of the magazine publisher Edipresse Polska.\n\nSince 25 February 2008, he moderated in the second program of state television ( TVP 2) his program \" Tomasz Lis na żywo \" ( Tomasz Lis live). On 25 May 2010 he was also chief editor of the weekly news magazine Wprost. Every Friday he takes on the morning show in TOK FM radio part. In February 2012, he was discharged at Wprost and three weeks later was editor of the competing weekly Newsweek Polska.\n\nFor his varied work he received several major Polish media awards. Ten times the he was \" Wiktor \" award, including the \" Super Wiktor \" in 2006. During the years 1999, 2007 and 2009 he was awarded \" Journalist of the Year \" twice (2002 and 2005), he received the \" telephoto camera \".\n\nFamily\n\nIn July 1994, Tomasz Lis married the journalist Kinga Rusin. They were divorced in June 2006. In October 2007, he married the TV presenter and colleague Hanna Smoktunowicz.\n\nWorks"}, {"url": "http://www.studyinpoland.pl/en/university?school=5", "page_content": "University of Warsaw\n\nfounded in 1816\n\nthe largest university in Poland and the best research centre in the country\n\noccupies 1st place in the national rankings of universities\n\nbelongs to the top 3% of universities in the world according to global rankings such as Times Higher Education World University Ranking (THE), Quaquarelli Symmonds World University Ranking (QS), Academic Ranking of World Universities (ARWU)\n\nholds very good positions in international comparative evaluations of the quality of education: 17 programmes provided by UW have been listed in QS World University Rankings by Subject 2019; 11 subjects run by UW were ranked in the Shanghai Ranking of Academic Subjects 2019 (Physics and Mathematics were ranked 51-75 worldwide)\n\nbelongs to the 4EU+ European University Alliance selected by the European Commission for funding in the ‘European Universities’ call for proposals, launched as part of the 2019 Erasmus+ programme\n\nawarded the “HR Excellence in Research” title by the European Commission for adopting the principles of the European Charter for Researchers, which means that UW offers a friendly working environment and transparent recruitment procedure\n\ndistinguished by the European Commission for its participation in the Erasmus+ programme\n\nWhy University of Warsaw?\n\nInternational position\n\nTaking into account the total number of research universities that reaches 20 thousand, the University of Warsaw is among the top 3% of the world’s best universities. According to international rankings, it also is the best university in Poland and one of the leading ones in this region of Europe. In addition, the University of Warsaw holds very good positions in comparative evaluations of the quality of education, in particular study programmes, such as the Quacquarelli Symonds World University Ranking and Eduniversal Best Masters and MBA Worldwide. 19 programmes provided by UW have been listed in QS World University Rankings by Subject 2021. 11 subjects run by UW were ranked in the Shanghai Ranking of Academic Subjects 2019 (Physics and Mathematics were ranked 51-75 worldwide).\n\nThe quality of education\n\nThe quality of education at the University of Warsaw is confirmed by the annual appraisals conducted by the university itself which show that the majority of students are satisfied with their selection of the university and the education programme. The University’s strongest points are: its prestige, development opportunities, the study environment. The quality of education is also confirmed by research conducted with the University’s graduates. The University of Warsaw conducts the largest research enterprise of its kind in Europe by monitoring the careers of former students. Results demonstrate that having a diploma from the University of Warsaw is a definite asset in the job market; 94% of respondents have found employment after graduation.\n\nThe broad offer\n\nApproximately 40,000 people study at the University of Warsaw. The candidates are offered a very broad range of courses in the fields of humanities, social sciences and natural sciences, as well as many interdisciplinary courses combining knowledge and skills of many disciplines:\n\nUniversity of research\n\nThe leading concepts of the University’s activity are the unity of teaching and research, and the harmonious development of all branches of knowledge represented in its curriculum. The University employs 4,000 scholars, 1/5 of whom hold professorial titles. Their scientific enquiry extends over 1,400 research topics; students who they concurrently teach have the opportunity of joining in their research projects. The University’s research teams have won worldwide recognition in many areas of knowledge and have joined international research programmes.\n\nIn the heart of Europe\n\nThe University of Warsaw community includes 4,800 foreigners: students, doctoral students, employees and grantees of, among others, the Erasmus+ programme. With respect to academic exchanges, the University of Warsaw stands out not only in Poland, but also internationally, being one of the leaders of the European Commission ranking issued as part its assessment of student exchange at over 3,000 institutions of higher education in the entire Europe. The University of Warsaw is most popular among students from Belarus, China, France, Germany, Italy, Spain, Turkey and Ukraine.\n\nThe academic city\n\nThe University is located in the capital of Poland, one of the most dynamically developing European cities. Warsaw is the centre of political and economic life and has a lively social and cultural scene.\n\nTwo faces\n\nThe University’s historical Main Campus, located in the very heart of Warsaw, is renowned for its splendid architecture. Its imposing buildings, some going back to the 17th century, are one of the city’s main tourist attractions. The opening of the nearby University Library building, which took place at the very end of the millennium, marked a new chapter in the history of the University’s architecture. New buildings, completed in the following years, are modern, functional and moreover architecturally interesting. The Natural Sciences campus consists of imposing structures with state-of-the-art laboratories."}]}