{"Tomasz Lis began his career in journalism in the 1980s, working for the Polish daily newspaper Gazeta Wyborcza.": [{"url": "https://www.europeanpressprize.com/laureate/tomasz-lis/", "page_content": "Tomasz Lis\n\nTomasz Lis began his career in 1990 in TVP (Polish Public Television) after winning an open competition for the post of a newsreader for TVP’s main evening news, the most widely watched in Poland ‘Wiadomości’. Between 1994 and 1997 he held the position of a senior correspondent for TVP in Washington, D.C. From 1997 to 2004 he worked for the TVN network, where he created and anchored the news broadcast FAKTY – second in viewership after TVP’s (Polish Public Television) ‘Wiadomości’. From 2006 to 2007 he was associated with Polsat Network, being a Member of Polsat’s Board of Directors. While at Polsathe was an author and host of Poland’s most watched political talk-show at the time ‘What’s with Poland?”. From 2008 till 2016 he anchored his own political talk-show TOMASZ LIS LIVE the most watched political show in Poland rating and viewership-wise.\n\nHis cooperation with TVP ended when representatives of Law and Justice Party took over public television in Poland and dismissed all independent journalists.\n\nIn February 2012, he founded ‘NaTemat’, a news website, featuring columnists and various news sources. In March 2012 he became editor-in-chief of the current affairs weekly ‘Newsweek Polska’. He is also an author of non-fiction political books with “Co z tą Polską?” (What’s with Poland?) published in 2003 with which became a bestseller in Poland, selling over 100,000 copies.\n\nDuring the past 17 years of his career he has interviewed a number of key figures in world politics. Among them are Bill Clinton, George Bush Sr., George W. Bush, Michail Gorbachev, Dmitri Medvedev, Tony Blair, Gordon Brown, Yitzhak Rabin, Benjamin Netanyahu, Hillary Clinton, Condoleezza Rice and Colin Powell.\n\nTomasz was awarded nine ‘Wikotor’s’ the equivalent of the American Emmy Awards. Awarded, as he only journalist in Poland, “Journalist of the Year’ prize by PRESS magazine in 1999, 2007 and 2009.\n\nTomasz Lis was selected for the the 2017 European Press Prize shortlist with his columns for Newsweek Polska"}, {"url": "https://prabook.com/web/tomasz.lis/1790909", "page_content": "Tomasz Lis\n\njournalist television presenter\n\nMarch 6, 1966 Zielona Góra, Lubusz Voivodeship, Poland\n\nTomasz Lis began his career in TVP (Polish Public Television) in 1990 after winning an open competition for the post of a newsreader. From 1994 to 1997: correspondent in Washington, District of Columbia for TVP. From 1997 to 2004: co-author of “Fakty TVN” on Polish television station TVN. From 2006 to 2007: editor-in-chief of \"Wydarzenia\" on Polsat. In 2003 he published his book Company z tą Polską? (What\"s with Poland?) which became a bestseller in Poland (selling over 100,000 copies). From late 2010 to February 2012: editor-in-chief of the current affairs weekly \"Wprost.\" In March 2012 he became editor-in-chief of \"Newsweek Polska.\" In December 2015 he received \"Hyena 2015\" from Association of Polish Journalists. \"Hyena 2015\" is awarded annually to a journalist voted the most biased by the association and in violation of ethical and professional norms. The incident that led to the award was to distribute during the Presidential campaign posts of daughter of President of Poland, that were not in fact written by her. Tomasz Lis apologised for the incident that the award focused on and deemed selecting him a politically motivated decision. Nevertheless, on March 8, 2016 he had again distributed false posts of senate candidate as real posts, thus violating basic journalistic ethics such as verification of sources. The couple divorced on June 27, 2006. They have two daughters: Pola (born in 1996) and Iga, born in 2000. In 2007 married a well-known Polish journalist, Hanna Smoktunowicz."}, {"url": "https://www.axelspringer.com/en/ax-press-release/tomasz-lis-appointed-new-editor-in-chief-of-newsweek-poland", "page_content": "Der 46-Jährige gehört zu den anerkanntesten Journalisten Polens und wurde bereits dreimal als „Journalist of the Year“ ausgezeichnet. NEWSWEEK Polen erscheint beim Joint Venture Ringier Axel Springer Media.\n\nNEWSEEK Poland, published by Ringier Axel Springer Poland has appointed Tomasz Lis, 46, as new editor-in chief. He succeeds Wojciech Maziarski, 52, who is leaving the company. Tomas Lis has worked as editor-in-chief for the Polish weekly Wprost over the last two years.\n\nEdyta Sadowska, CEO of Ringier Axel Springer Polska „ We are all looking forward to Tomasz Lis, who is such an experienced journalist and media manager. This appointment is another step towards our objective to become the leading weekly news magazine in Poland.”\n\nTomasz Lis is one of the most recognized Polish journalists. He began his career in 1990 in “Wiadomości”, the main news edition of public broadcasting corporation (TVP). From 1994 to 1997 he worked as TVP correspondent in Washington D.C. Between 1997 and 2004 he created and led “Fakty”, the main edition of news in Polish private television TVN, and later “Wydarzenia” in Polsat Television, where he also created program “What’s with Poland?” For the past two years he has worked as chief editor of Wprost weekly, and since 2008 he is author of “Tomasz Lis na żywo” program in TVP2 channel. He was awarded the title “Journalist of the Year” three times (1999, 2007 and 2009) and nine times received “Wiktor” award for TV personalities."}, {"url": "https://dbpedia.org/page/Tomasz_Lis", "page_content": "Tomasz Rafał Lis (* 6. März 1966 in Zielona Góra, Polen) ist ein polnischer politischer Journalist. (de)\n\nTomasz Rafał Lis, né le 6 mars 1966 à Zielona Góra, est un journaliste polonais connu notamment pour animer des émissions alternativement pour la télévision publique Telewizja Polska (TVP), et les grandes chaînes commerciales TVN et Polsat. Dans la presse écrite, il est successivement rédacteur en chef des hebdomadaires Wprost (2010-2012) puis Newsweek (édition polonaise) depuis 2012. Il est cofondateur et copropriétaire du site Internet NaTemat.pl. (fr)\n\nTomasz Rafał Lis [ˈtɔmaʂ ˈlis] (born 6 March 1966 in Zielona Góra) is a Polish journalist and former TV anchor of “TVN Fakty” (\"TVN Facts\") and “Wydarzenia” (\"Events\"). (en)\n\nTomasz Rafał Lis (ur. 6 marca 1966 w Zielonej Górze) – polski dziennikarz i publicysta. W latach 1990–1997 dziennikarz Telewizji Polskiej; prowadzący programu TVP1 Wiadomości, główny sprawozdawca parlamentarny, w latach 1994–1997 korespondent TVP w Stanach Zjednoczonych. W latach 1997–2004 dziennikarz telewizji TVN; współtwórca, szef redakcji i prowadzący główne wydanie Faktów. W latach 2004–2007 związany z telewizją Polsat, jako komentator Wydarzeń, członek zarządu i dyrektor programowy. W latach 2008–2016 prowadzący autorski program publicystyczny Tomasz Lis na żywo, na antenie TVP2. Jako dziennikarz prasowy związany m.in. z dziennikiem „Polska The Times” i „Gazetą Wyborczą”. W latach 2010–2012 redaktor naczelny tygodnika „Wprost”, w latach 2012–2022 redaktor naczelny tygodnika „Newsweek Polska”. Trzykrotny laureat nagrody Grand Press dla dziennikarza roku (1999, 2007, 2009), dziewięciokrotny laureat Wiktorów, w tym Super Wiktora (2006), dwukrotny laureat Telekamer (2002, 2006), laureat Nagrody Kisiela (2005).W 2014 za wybitne osiągnięcia w działalności na rzecz wolności słowa w Polsce i wkład w rozwój wolnych mediów i niezależnego dziennikarstwa, został odznaczony przez prezydenta RP Krzyżem Oficerskim Orderu Odrodzenia Polski. (pl)"}, {"url": "https://peoplepill.com/people/tomasz-lis/", "page_content": "Tomasz Rafał Lis [ˈtɔmaʂ ˈlis] () (born 6 March 1966 in Zielona Góra) is a Polish journalist and former TV anchor of “TVN Fakty” (\"TVN Facts\") and “Wydarzenia” (\"Events\").\n\nLife and career\n\nHe was born on 6 March 1966 in Zielona Góra to parents Stefan and Wanda (née Adamkiewicz). He attended the Edward Dembowski High School No. 1 in Zielona Góra. He subsequently graduated from the Faculty of Journalism and Political Sciences at the University of Warsaw. He began his career in 1984 publishing an article in a pro-Soviet newspaper Standard for the Young (Sztandar Młodych), an organ of the Union of Socialistic Youth in Poland (Związek Socjalistycznej Młodzieży Polskiej). In 1992, he received a scholarship and studied for a year at the Loyola University New Orleans. After the fall of communism in Poland, he worked in the Public Television Polish Television (TVP) after winning an open competition for the post of a newsreader.\n\nFrom 1994 to 1997: correspondent in Washington, D.C. for TVP.\n\nFrom 1997 to 2004: co-author of “Fakty TVN” on Polish television station TVN.\n\nFrom 2006 to 2007: editor-in-chief of \"Wydarzenia\" on Polsat.\n\nIn 2003 he published his book Co z tą Polską? (What's with Poland?) which became a bestseller in Poland (selling over 100,000 copies).\n\nFrom late 2010 to February 2012: editor-in-chief of the current affairs weekly \"Wprost.\"\n\nIn March 2012 he became editor-in-chief of \"Newsweek Polska.\"\n\nIn 2017 Tomasz Lis was shortlisted for the European Press Prize, for his columns in Newsweek Polska.\n\nAwards\n\nWiktor Award (9-time laureate)\n\nSuper Wiktor Award (2006)\n\nJournalist of the Year (1997), (2007), (2009)\n\nTelekamera Award (2002), (2006)\n\nKisiel Prize (2005)\n\nOfficer's Cross of the Order of Polonia Restituta (2014)\n\nHyena of the Year (2015)\n\nFamily\n\nHe married Kinga Rusin in June 1994. The couple divorced on June 27, 2006. They have two daughters: Pola (born in 1996) and Iga, born in 2000. In 2007 married a well-known Polish journalist, Hanna Smoktunowicz."}, {"url": "https://www.celebsagewiki.com/tomasz-lis", "page_content": "Age, Biography and Wiki\n\nTomasz Lis was born on 6 March, 1966 in Zielona Gora, Poland, is a Journalist, author, TV presenter. Discover Tomasz Lis's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 57 years old?\n\nPopular As N/A Occupation Journalist, author, TV presenter Age 57 years old Zodiac Sign Pisces Born 6 March 1966 Birthday 6 March Birthplace Zielona Gora, Poland Nationality Polish\n\nWe recommend you to check the complete list of Famous People born on 6 March. He is a member of famous Journalist with the age 57 years old group.\n\nTomasz Lis Height, Weight & Measurements\n\nAt 57 years old, Tomasz Lis height not available right now. We will update Tomasz Lis's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Tomasz Lis's Wife?\n\nHis wife is Hanna Lis (m. 2007), Kinga Rusin (m. 1994–2006)\n\nFamily Parents Not Available Wife Hanna Lis (m. 2007), Kinga Rusin (m. 1994–2006) Sibling Not Available Children Iga Lis, Pola Lis\n\nTomasz Lis Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Tomasz Lis worth at the age of 57 years old? Tomasz Lis’s income source is mostly from being a successful Journalist. He is from Polish. We have estimated Tomasz Lis's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Journalist\n\nTomasz Lis Social Network\n\nTimeline"}, {"url": "https://thesaxon.org/tomasz-lis-made-a-statement-the-case-is-related-to-his-work-as-the-editor-in-chief-of-newsweek-polska/", "page_content": "Spread the love\n\nKiev still denies having totally lost this city in the Donetsk region.\n\nUkrainian soldiers take position near Bakhmout. The paramilitary group Wagner claims to have given way to the regular forces of the Russian army in this city in the Donetsk region which Kiev denies having lost entirely to Moscow.\n\nThe paramilitary group Wagner claims Thursday to have given way to the Russian regular army in Bakhmout, eastern Ukraine. Confirming this partial withdrawal, the Ukrainian government however asserts that it has not completely lost control of the city.\n\nThe paramilitary group Wagner, which at the weekend claimed the capture of Bakhmout in eastern Ukraine, began on Thursday the transfer to the Russian regular army of its positions in the devastated city.\n\nFor now, Wagner Group boss Yevgeny Prigozhin says that by June 1, the bulk [of his units] will relocate to chainstays from the rear.\n\nUkraine's Deputy Defense Minister Hanna Maliar confirmed the partial withdrawal, saying that the Russian military replaced Wagner's forces around Bakhmout, but [that] Wagner's fighters remain in the city itself.\n\nMs Maliar also claimed that Ukrainian forces still had a hold on the outskirts, in the south-west of this city in the Donetsk region.\n\nUkraine, which still denies the total loss of Bakhmout, says it is betting on a breakthrough around this city to achieve its tactical encirclement.\n\nThe [Russian] enemy is trying to stop our advance on the flanks with artillery fire. It is reinforcing the flanks with additional units, Ms. Maliar said. a battle ignited in the summer of 2022 that proved the longest and deadliest of the Russian offensive.\n\nWagner's boss, Yevgueni Prigojine, had estimated, on Wednesday, the number of deaths in the ranks of his group at 10,000 detainees, recruited in Russian prisons and a similar proportion, not precisely quantified, of his professional fighters.\n\nThe Ukrainian Air Force also reported a new Russian attack of 36 Iranian-made Shahed drones, all of which were destroyed, stressing that ;presumably targeted military infrastructure and sites in southern Ukraine.\n\nRussia continues to terrorize Ukraine with its night attacks, Mr. Zelensky denounced.\n\nRussian authorities on the Crimean peninsula, annexed in 2014 by Moscow, have for their part says it shot down six Ukrainian drones during the night.\n\nJapan meanwhile announced that it had launched fighters on Thursday after detecting two Russian reconnaissance planes near its shores, one in the Pacific Ocean and the other in the Sea of ​​Japan.\n\nThis incident, which is not the first of its kind, comes a few days after the presence of Volodymyr Zelensky at the G7 summit which was organized in Hiroshima.\n\nOn the diplomatic level, the Russian Ministry of Foreign Affairs announced that Li Hui , sent by Beijing to Europe to discuss a political settlement of the conflict in Ukraine, would visit Moscow on Friday for consultations on this subject.\n\nWith information from Agence France-Presse, Reuters, and ;The Guardian"}, {"url": "https://buzzsumo.com/journalist/tomasz-lis-4397374/", "page_content": "Find out everything there is to know\n\nPublication resume, most loved topics, and more. Find out everything there is to know about a journalist, in our 500k+ database.\n\nStart a 30-day free trial of BuzzSumo.\n\nSTART YOUR FREE TRIAL\n\nAlready registered? Log in to your account"}, {"url": "https://commons.wikimedia.org/wiki/Category:Tomasz_Lis", "page_content": "Award received\n\nPolish Journalist of the Year (1999)\n\nPolish Journalist of the Year (2006)\n\nPolish Journalist of the Year (2009)\n\nOfficer of the Order of Polonia Restituta (2014)\n\nHyena of the Year\n\nGrand Press Awards\n\nWiktory\n\nTelekamery\n\nKisiel Prize"}, {"url": "https://memim.com/tomasz-lis.html", "page_content": "Tomasz Lis ( born March 6, 1966 in Zielona Góra ) is a Polish political journalist.\n\nAfter graduation, he studied journalism at the University of Warsaw. While still a student of the fourth year of study, he won an open competition for TV journalists of state television. On 3 May 1990 he made ​​his debut as host of the evening journals. Soon he was promoted to first parliamentary reporter. In 1992, he studied at Loyola University in New Orleans. From 1994 to 1997 he was the rapporteur of the Polish state television in the United States.\n\nSince 1997, he hosted the private TV station TVN, the news program \" Fakty \" (facts ). In the fall of 2003, he published the book \" Co z Tá Polska? \" ( What about go to Poland? ) Out with a circulation of over 100,000 copies. After the success of the book he was traded as a presidential candidate. In 2004 he was dismissed from TVN.\n\nOn 1 September 2005, he was a board member and program director of the private television station Polsat. With the journalist Hanna Smoktunowicz it led the news program \" Wydarzenia \" (events). For unknown reasons, he left Polsat on 20 September 2007. Shortly thereafter, in November 2007, he was engaged as advisor to the board of the magazine publisher Edipresse Polska.\n\nSince 25 February 2008, he moderated in the second program of state television ( TVP 2) his program \" Tomasz Lis na żywo \" ( Tomasz Lis live). On 25 May 2010 he was also chief editor of the weekly news magazine Wprost. Every Friday he takes on the morning show in TOK FM radio part. In February 2012, he was discharged at Wprost and three weeks later was editor of the competing weekly Newsweek Polska.\n\nFor his varied work he received several major Polish media awards. Ten times the he was \" Wiktor \" award, including the \" Super Wiktor \" in 2006. During the years 1999, 2007 and 2009 he was awarded \" Journalist of the Year \" twice (2002 and 2005), he received the \" telephoto camera \".\n\nFamily\n\nIn July 1994, Tomasz Lis married the journalist Kinga Rusin. They were divorced in June 2006. In October 2007, he married the TV presenter and colleague Hanna Smoktunowicz.\n\nWorks"}]}