{"Véra Korène was best known for her roles in the films La Grande Illusion (1937) and La Règle du Jeu (1939).": [{"url": "https://www.britannica.com/topic/Grand-Illusion", "page_content": "Grand Illusion, French La Grande Illusion, French war film, released in 1937, that was directed by Jean Renoir. Elegant, humane, and affecting, it has been recognized as a profound statement against war and is often ranked among the greatest films ever made.\n\nDuring World War I, a French plane piloted by two officers—a wealthy aristocrat, Captain de Boeldieu (played by Pierre Fresnay), and a working-class mechanic, Lieutenant Maréchal (Jean Gabin)—is shot down by a German pilot, Captain von Rauffenstein (Erich von Stroheim). Upon learning that the surviving Frenchmen are fellow officers, von Rauffenstein, also an aristocrat, invites them to lunch before they are transported to a prisoner-of-war camp. He is especially cordial to de Boeldieu, with whom, he learns, he shares friends. Transcending national boundaries even during wartime, the two enjoy a mutual respect based on social rank; they have more in common with each other than with the lower classes of their own countries.\n\nBritannica Quiz Best Picture Movie Quote Quiz\n\nDespite the favourable treatment accorded them, de Boeldieu and Maréchal, along with fellow captive Lieutenant Rosenthal (Marcel Dalio), plot to escape from the camp and, later, from the fortress prison to which they are transferred. At the prison, de Boeldieu agrees to distract the German guards so that Maréchal and Rosenthal can flee. After de Boeldieu sets the plan in motion by playing a flute atop a tower, von Rauffenstein pleads with him to surrender and then reluctantly shoots him. Though intended to cause only a wound, the shot proves fatal. Before he dies, de Boeldieu expresses his pity for von Rauffenstein, who will have to witness the decline of the European aristocracy and find a purpose and a role in the new order to come. Meanwhile, Maréchal and Rosenthal find refuge with a German widow (Dita Parlo), who shelters them on her farm and with whom Maréchal falls in love, before finally escaping across the border into Switzerland.\n\nWith Grand Illusion, Renoir provides a multilayered perspective on class, war, nationalism, and prejudice. For example, the film’s treatment of Rosenthal—an affluent Jewish banker who generously shares his food with his fellow inmates— has been interpreted as an effort by Renoir to combat anti-Semitism during the rise of Nazi Germany. De Boeldieu’s sacrifice for his working-class comrades, furthermore, symbolically mirrors the changing social order of Europe. In addition, Rosenthal points out the ultimate “grand illusion”: that the current war will end all wars. The performances by Jean Gabin and Erich von Stroheim are exceptional, although the latter, having spent years away from his native Austria, reportedly struggled to speak German. Grand Illusion was the first non-English-language film to be nominated for an Academy Award as best picture. However, the work was so despised by the Nazis that they confiscated and destroyed prints of the film during their World War II occupation of France."}, {"url": "https://www.moma.org/calendar/events/8619", "page_content": "La Grande Illusion. 1937. France. Directed by Jean Renoir. Screenplay by Charles Spaak and Jean Renoir. With Jean Gabin, Pierre Fresnay, Erich von Stroheim, Marcel Dalio, Gaston Modot. 35mm. In French; English subtitles. 114 min.\n\nRenoir’s Grand Illusion is his best-known film—and one of his most personal—including reminiscences of his World War I experience in the French Flying Corps and paying homage to an early mentor, Erich von Stroheim, who appears here as the elegantly civilized commandant of a maximum-security German prison camp. The escape of two French officers is presented as an intellectual game that depends upon the cooperation of soldiers of different nations; the act of parting from the other prisoners, indicated by an emotional series of farewells, dominates the film.\n\n“While Grand Illusion may be considered the preeminent antiwar movie, it is far more inclusive and universal than that, posing questions about human existence that offer much food for thought. The film is a passionate statement of Renoir’s belief in the commonality of all human beings, regardless of race, class, or nationality, which was to become a pervasive theme in his career. It is that passion, that emotional intensity, that makes Renoir’s entire body of work so distinctive. Whether his films are directed at conjugal love, nature, the theater, the Paris that was, or prisoners of war, Renoir makes the viewer complicit in his obsessive devotion to his subjects” (from MoMA Highlights).\n\nGrand Illusion was named Best Foreign Film by both the National Board of Review and the New York Film Critics Circle, and received an Oscar nomination for Best Picture—a first for a foreign-language film. For its 1999 reissue, Rialto struck new 35mm prints for the first time in decades and created the first new translation (by Lenny Borger) since its original release. “If I had only one film to save, it would be *Grand Illusion*” (Orson Welles)."}, {"url": "https://www.sensesofcinema.com/2016/cteq/la-grande-illusion/", "page_content": "At the end of La Grande Illusion (Jean Renoir, 1937), two prisoners of war, working class engineer Marechal (Jean Gabin) and wealthy Jew Rosenthal (Marcel Dalio) attempt an escape from a German patrol across a snowy mountainside. There are shots, then an order that guns be put down: “They are over the border.” The men are no longer in Germany but in neutral Switzerland. The camera pans to show two small, dark figures, black shapes against the white, white snow on which no dividing line can be seen. “Are you sure that’s Switzerland?”, Marechal asks moments before. “It’s all so alike.” Rosenthal, the man with the map (who has possibly the least illusions of anyone in this film) comments, “Of course. You can’t see frontiers. They were invented by men. Nature doesn’t care.”\n\nRenoir believed in“ the division of the world by horizontal frontiers, and not into compartments enclosed in vertical frontiers”, class rather than nationality. Associated with the Popular Front , class is central to Renoir’s work. And yet nothing in this film is easy to categorise. Even horizontal frontiers are invented by men, and men are still a part of nature, who doesn’t care for such divisions. If the class system is a machine, then human connections, human idiosyncrasy, human nature, are the spanner in the works.\n\nMarechal has been shot down and taken prisoner with the aristocratic de Boeldieu (Pierre Fresnay). They stay together throughout various incarcerations and escape attempts. They support each other against criticisms but are in many ways the two people between whom the most stringent border is maintained. It is maintained by de Boeldieu and continually assaulted by Marechal. In a final attempt, before his escape, Marechal makes his most focused attack on de Boeldieu’s reserve: “We’ve been together eighteen months and still you call me ‘vous’ .” “I say ‘vous’ to my mother and ‘vous’ to my wife,” De Boeldieu replies. It’s a chilling moment. De Boeldieu’s separation from fellow prisoners is easily explained by class differences. Such a separation from those most intimate to him is different.\n\nVon Rauffenstein (Eric von Stroheim), head of Winterborn camp, recognises de Boeldieu at once as a fellow aristocrat. They understand each other. Unlike other characters, they slip easily from language to language, share memories, acquaintances, values. Von Rauffenstein seems almost infatuated by de Boeldieu, yet de Boeldieu retains with von Rauffenstein the same cool distance he has with Marechal. Linked by class, they are not truly united.\n\nThe First World War marked radical changes in society. While dying de Boeldieu tell von Rauffenstein that for people like them, death at war is a “good solution”, an exit from a life that even von Rauffenstein admits is “useless”. De Boeldieu understands what is changing and his own inability (or his lack of desire) to change with it. von Rauffenstein has refused, till now, to recognise this. He tries to force his life into the pattern he desires. No wonder he must be held together by a corset of leather and metal.\n\nAnd yet de Boeldieu is not simply an aristocrat who would rather die than change. Unlike von Rauffenstein, he does not despise Marechal. Incapable of being intimate with him, he respects him. He may not want to change but he can enable change, by enabling the escape of both Marechal and Rosenthal, the working classes and the Jews, twin horrors of the French aristocracy. This is no altruistic self-sacrifice. De Boeldieu dies wearing the white gloves that link him to von Rauffenstein and baffle Marechal. He owns his death. He looks like the Pied Piper, sitting on the snowy roof with his little flute, but it is only himself that he leads away. As he climbs higher, the shadow of the staircase thrown on the castle walls reminds one of the inside working of a clock. De Boeldieu is caught in the machinery of change but unlike von Rauffenstein he works his own way out. He is the author of his fairy tale .\n\nMarechal cannot break down the barriers between himself and de Boeldieu, but he can negotiate another complex relationship with the ‘other’- with Rosenthal. Rosenthal is generous. He shares what he has, takes his turn. One senses that he knows how fragile his acceptance by others is. He calls himself a “Jew”, talks about miserliness, so no on else can do it first. And indeed, at his lowest moment, Marechal says what we know to be true:“ I never could stick Jews.” That this is true is important, because when Marechal returns, we understand that he realises how little a part being a Jew actually is of what constitutes Rosenthal. He’s simply human. When, at the end of the film, Marechal says, with love: “Goodbye you dirty Jew.”\n\nRosenthal bats back, “Goodbye old mate.” In this exchange Marechal has what he couldn’t get from de Boeldieu: an honest acknowledgment of difference alongside a genuine equality of friendship – class displaced by humanity. This is the hope of a future is worth having.\n\nBut maybe this future is illusory. An early idea for the film’s end was a scene at Maxim’s, where Marechal and Rosenthal agree to meet after the war. At their table are two empty chairs. They have either died or retreated back into their differences. The present ending is superior but such a bleak idea is worth examining, especially in relation to the film’s title. In Les Regles du Jeu Renoir writes and speaks a critical line: “…on this earth there is one thing which is terrible, and that is that everyone has their own good reasons.”\n\nNo act is arbitrary, Renoir understands, and we must understand that no part of his work is arbitrary. Despite his human connection with Rosenthal and later with Elsa, Marechal nastily snubs the black officer who shares a room with him at Wintersborn. Like de Boeldieu’s comment that he says ‘vous’ to his wife, this moment is quickly passed over, but we should not be quick to discount it. Many borders are redrawn in this film (between gender, race, class and sex), but not all. Perhaps it is the idea that they could be that is the great – and sweet – illusion.\n\nLe Grande Illusion (1937 France 114 mins)\n\nProd. Co: Réalisations d’Art Cinématographique Prod: Albert Pinkovitch and Frank Rollmer Dir: Jean Renoir Scr: Jean Renoir and Charles Spaak Phot: Christian Matras Mus: Joseph Kosma Ed: Marthe Huguet and Marguerite Renoir Prod Des: Eugène Lourié\n\nCast: Jean Gabin, Dita Parlo, Pierre Fresnay, Erich von Stroheim\n\nEndnotes"}, {"url": "http://www.frenchfilms.org/review/la-grande-illusion-1937.html", "page_content": "Film Review\n\nI\n\nLa Grande Illusion\n\nLa Grande illusion\n\nLa Belle équipe\n\nLa Grande illusion\n\nLes Bas-fonds\n\nLa Grande illusion\n\nLa Grande illusion\n\nLa Grande illusion\n\nLa Grande illusion\n\nLa Grande illusion\n\nLa Grande illusion\n\nLa Grande illusion\n\nThe Great Illusion\n\nillusion\n\nLes Evasions du Capitaine Maréchal\n\nalways\n\nLa Grande illusion\n\nLa Grande illusion\n\n© James Travers 2011\n\nThe above content is owned by frenchfilms.org and must not be copied.\n\nNext Jean Renoir film:\n\nLa Bête humaine (1938)"}, {"url": "https://www.imdb.com/title/tt0028950/reviews", "page_content": "9 /10\n\n'La Grande Illusion' is one of those films that reaffirm a film lover's belief that cinema as an art form can be used by filmmakers to bring people together.\n\n\n\nThe screenplay for the film written by Renoir and Charles Spaak is extremely deep and multi layered. Although the film is set during the WW1 era, the timing of the making and release of the film is very important. This was released when the Nazi party in Germany was becoming more and more powerful and another global war was imminent. I can't help but think that this film was Renoir's attempt to make people stray away from the extremism that they were getting influenced by. Although it didn't achieve its intended objective, one can't help but admire the artist's intentions.\n\n\n\nIf one has to summarise 'La Grande Illusion' in one phrase, I think the phrase to be used is 'the power of humanism'. Renoir loves every single character in the film. Not just the French soldiers, even the German soldiers get treated with respect. The Germans are not stereotypical caricatures as is found in some other films of this era. The German officers treat their French prisoners with kindness. This shows Renoir understood that there were ordinary, innocent German people who were caught in the middle of the wars being instigated by the politicians in power.\n\n\n\nApart from underlining the humanism and the similarity between the soldiers on all sides, the film also works on other themes. The film explores the changing times. We see the men who have been detached from the outside world due to the war feel surprised when they hear that women are keeping their hair short. One of them equates this appearance with the appearance of a boy. This is clearly Renoir commenting upon the progress women were making at the time in trying to gain equality. We also get the angle of the changing nature of the class distinctions. Rauffenstein and Boeldieu belonged to the higher classes. They understand and respect each other even though they belong to Germany and France respectively. We see them reminisce about the old times and talk about how they feel out of place in a fast changing world where the class distinctions are getting distorted as they embark on an era where people belonging to lower classes as well as Jews will be equal to them. We also get a subtle introspection on the concept of masculinity in this changing society.\n\n\n\nRenoir through his visuals shows how all the characters are at times literally and at times thematically trapped by the war. We get his signature shots of frames within frame to metaphorically imply that the characters are trapped. Every character, be it French or German is trapped mentally and physically by the war. Even a high officer like Rauffenstein feels trapped in his claustrophobic chamber. They are all detached from the outside world. They want freedom, but are apprehensive about whether they will be ready for what awaits them on the outside once they get their 'freedom'. This internal apprehension of not being ready to live on the outside reminded me of 'The Shawshank Redemption'.\n\n\n\nLike Powell & Pressburger did with 'The Life and Death of Colonel Blimp', Renoir is bidding farewell to an era where even wars were fought with a gentlemanly attitude. Although he does touch upon the class distinctions and some other aspects that plagued that earlier era, but he is primarily concerned with the humanism of that characters. So, we see the kindness between soldiers belonging to different nations. This can lead to a a criticism that the film is a bit overly romanticised and is a bit of a wish fulfillment exercise as it doesn't depict the brutalities of war. But I think a brutally real account of WW1 was never Renoir's vision. In the midst of the rise of the Nazi Party and the huge possibility of another war, he wanted to make a film that makes the viewers renounce extremism and in the process instill the spirit of a unified Europe, no matter how unrealistic it may seem. This is why I think 'La Grande Illusion' will work brilliantly as a double feature with Kubrick's 'Paths of Glory'. While the first shows soldiers from different nations treating each other with kindness, the latter shows French officers being monstrously merciless to their own French colleagues.\n\n\n\nRenoir's visual style is beyond impressive. He uses very little editing in most scenes, instead he constantly keeps moving the camera to reveal other characters in the room or to reveal new parts of the interior which were earlier not visible in the frame. He also uses deep focus effectively to make the visual language of the film very character-inclusive in the sense that all the characters find importance in a scene. This inclusive nature of his style executed by tracking shots is epitomised by the famous scene involving the singing of 'La Marseillaise', a scene where he practically uses no cuts.\n\n\n\nPerformance wise, I'll give special mention to Jean Gabin, Erich von Stroheim and Pierre Fresnay.\n\n\n\n'La Grande Illusion' is a film that I can watch over and over again and get something new out of it on each viewing. It is rich in humanism, thematic depth and Renoir's brilliant directorial skills. The title of the film itself is layered and open to many interpretations. What was the grand illusion? Is it the illusion that one can achieve freedom from the suffering by escaping from prison camps or is it the illusion that the world that awaits these soldiers after the war ends will be the same as the one that they left behind? Or is war itself the grand illusion that creates barriers between human beings who are all the same, but get divided based on geographical borders? Maybe it is one of them, maybe it is all of them."}, {"url": "https://movie.douban.com/subject/1294808/", "page_content": "影片以第一次世界大战为背景，讲述三名法国俘虏在德国集中营越狱的故事。\n\n三名法国飞行员在一次任务执行中被德军击落，波迪奥、迈克和罗森塔尔三人被带到战俘集中营。波迪奥与德军监狱长罗芬斯坦都是贵族出身，有着共同的政治见解，二人在狱中成为朋友。三人随后发现狱友正进行越狱计划，他们挖出一条逃跑的通道。迈克和罗森塔尔也加入了挖掘行动。最后他们集体越狱，德军全力追捕，在逃亡中，波迪奥被罗芬斯坦击倒，两名法国俘虏迈克和罗森塔尔逃到一个德国农妇家中，在她的帮助下，二人经过种种波折逃到瑞士。\n\n本片是最早的越狱片之一，被评为最伟大的“越狱电影”之一，同时也是导演让·雷诺阿的反战杰作。"}, {"url": "https://archive.org/details/1937lagrandeillusion", "page_content": "The subtitles are burned in. https://archive.org/download/1937lagrandeillusion/1937%20la_grande_illusion_1937___5a8f7ca95fab1.mp4 - 409.9M, 'source=\"original\"'>ffprobe -i \"1937 la_grande_illusion_1937___5 a8f7ca95fab1.mp4 ffprobe version git-2020-06-20-29ea4e1 Copyright (c) 2007-2020 the FFmpeg developersbuilt with gcc 9.3.1 (GCC) 20200523configuration: --enable-gpl --enable-version3 --enable-sdl2 --enable-fontconfig --enable-gnutls --enable-iconv --enable-libass --enable-libdav1d --enable-libbluray --enable-libfreetype --enable-libmp3lame --enable-libopencore-amrnb --enable-libopencore-amrwb --enable-libopenjpeg --enable-libopus --enable-libshine --enable-libsnappy --enable-libsoxr --enable-libsrt --enable-libtheora --enable-libtwolame --enable-libvpx --enable-libwavpack --enable-libwebp --enable-libx264 --enable-libx265 --enable-libxml2 --enable-libzimg --enable-lzma --enable-zlib --enable-gmp --enable-libvidstab --enable-libvmaf --enable-libvorbis --enable-libvo-amrwbenc --enable-libmysofa --enable-libspeex --enable-libxvid --enable-libaom --enable-libgsm --disable-w32threads --enable-libmfx --enable-ffnvcodec --enable-cuda-llvm --enable-cuvid --enable-d3d11va --enable-nvenc --enable-nvdec --enable-dxva2 --enable-avisynth --enable-libopenmpt --enable-amflibavutil 56. 55.100 / 56. 55.100libavcodec 58. 93.100 / 58. 93.100libavformat 58. 47.100 / 58. 47.100libavdevice 58. 11.100 / 58. 11.100libavfilter 7. 86.100 / 7. 86.100libswscale 5. 8.100 / 5. 8.100libswresample 3. 8.100 / 3. 8.100libpostproc 55. 8.100 / 55. 8.100Input #0, mov,mp4,m4a,3gp,3g2,mj2, from 'C:\\Users\\1937 la_grande_illusion_1937___5 a8f7ca95fab1.mp4 ':Metadata:major_brand : isomminor_version : 512compatible_brands: isomiso2avc1mp41title : La grande illusion 1937 - Studio Canal Blu-rayencoder : Lavf58.3.100\n\nDuration: 01:53:42.33, start: 0.000000, bitrate: 503 kb/s Duration: 01:53:42.33, start: 0.000000, bitrate: 503 kb/s\n\nChapter #0:0: start 0.000000, end 489.958000 Chapter #0:0: start 0.000000, end 489.958000\n\nMetadata: Metadata:\n\ntitle : 00:00:00.000 title : 00:00:00.000\n\nChapter #0:1: start 489.958000, end 1052.167000 Chapter #0:1: start 489.958000, end 1052.167000\n\nMetadata: Metadata:\n\ntitle : 00:08:09.917 title : 00:08:09.917\n\nChapter #0:2: start 1052.167000, end 1788.333000 Chapter #0:2: start 1052.167000, end 1788.333000\n\nMetadata: Metadata:\n\ntitle : 00:17:32.167 title : 00:17:32.167\n\nChapter #0:3: start 1788.333000, end 2106.125000 Chapter #0:3: start 1788.333000, end 2106.125000\n\nMetadata: Metadata:\n\ntitle : 00:29:48.333 title : 00:29:48.333\n\nChapter #0:4: start 2106.125000, end 2698.625000 Chapter #0:4: start 2106.125000, end 2698.625000\n\nMetadata: Metadata:\n\ntitle : 00:35:06.125 title : 00:35:06.125\n\nChapter #0:5: start 2698.625000, end 3438.000000 Chapter #0:5: start 2698.625000, end 3438.000000\n\nMetadata: Metadata:\n\ntitle : 00:44:58.625 title : 00:44:58.625\n\nChapter #0:6: start 3438.000000, end 3790.958000 Chapter #0:6: start 3438.000000, end 3790.958000\n\nMetadata: Metadata:\n\ntitle : 00:57:18.000 title : 00:57:18.000\n\nChapter #0:7: start 3790.958000, end 4366.542000 Chapter #0:7: start 3790.958000, end 4366.542000\n\nMetadata: Metadata:\n\ntitle : 01:03:10.958 title : 01:03:10.958\n\nChapter #0:8: start 4366.542000, end 5343.875000 Chapter #0:8: start 4366.542000, end 5343.875000\n\nMetadata: Metadata:\n\ntitle : 01:12:46.500 title : 01:12:46.500\n\nChapter #0:9: start 5343.875000, end 5937.833000 Chapter #0:9: start 5343.875000, end 5937.833000\n\nMetadata: Metadata:\n\ntitle : 01:29:03.875 title : 01:29:03.875\n\nChapter #0:10: start 5937.833000, end 6421.792000 Chapter #0:10: start 5937.833000, end 6421.792000\n\nMetadata: Metadata:\n\ntitle : 01:38:57.833 title : 01:38:57.833\n\nChapter #0:11: start 6421.792000, end 6822.333000 Chapter #0:11: start 6421.792000, end 6822.333000\n\nMetadata: Metadata:\n\ntitle : 01:47:01.667 title : 01:47:01.667\n\nStream #0:0(und): Video: h264 (High) (avc1 / 0x31637661), yuv420p, 496x360 [SAR Stream #0:0(und): Video: h264 (High) (avc1 / 0x31637661), yuv420p, 496x360 [SAR 495:496 DAR 11:8], 383 kb/s, 24 fps, 24 tbr, 12288 tbn, 48 tbc (default) DAR 11:8], 383 kb/s, 24 fps, 24 tbr, 12288 tbn, 48 tbc (default)\n\nMetadata: Metadata:\n\nhandler_name : VideoHandler handler_name : VideoHandler\n\nStream #0:1(fra): Audio: aac (LC) (mp4a / 0x6134706D), 44100 Hz, stereo, fltp, 117 kb/s (default) Stream #0:1(fra): Audio: aac (LC) (mp4a / 0x6134706D), 44100 Hz, stereo, fltp, 117 kb/s (default)\n\nMetadata: Metadata:\n\nhandler_name : SoundHandler handler_name : SoundHandler\n\nStream #0:2(und): Data: bin_data (text / 0x74786574) Stream #0:2(und): Data: bin_data (text / 0x74786574)\n\nMetadata: Metadata:\n\nhandler_name : SubtitleHandler handler_name : SubtitleHandler\n\nUnsupported codec with id 100359 for input stream 2 Unsupported codec with id 100359 for input stream 2\n\n- October 13, 2020Info on this video file via ffprobe"}, {"url": "https://fr.wikipedia.org/wiki/V%C3%A9ra_Kor%C3%A8ne", "page_content": "Véra Korène, nom de scène de Rebecca Vera Koretzky, est une actrice française d'origine juive russe, directrice de théâtre, née le à Bakhmout et morte le à Louveciennes.\n\nVéra Korène nait dans une famille juive, qui après la Révolution russe, quitte la Russie pour Paris.\n\nElle est admise au Conservatoire où elle a notamment pour professeur Firmin Gémier. Elle entre ensuite à la Comédie-Française dont elle devient sociétaire en 1936. Elle fait parallèlement une courte carrière au cinéma, interrompue par la Guerre et par les lois de Vichy : déchue de sa nationalité française par décret du 29 octobre 1940 et exclue de la Société des comédiens-français à partir du 1er novembre 1940 , elle est contrainte de quitter la France. Elle se réfugie au Canada, puis partage son exil entre Hollywood et le Brésil.\n\nDe retour en France en 1945, elle est réintégrée à la Comédie-Française et retrouve avec succès les planches, où en 1950 elle met en scène les Sincères de Marivaux.\n\nEn 1952, au théâtre romain de Fourvière, elle adapte, met en scène et joue Le Martyre de saint Sébastien de Gabriele D'Annunzio et Debussy. D'où trois disques.\n\nEn 1956, elle quitte le Français pour prendre la direction du théâtre de la Renaissance où elle monte notamment les Séquestrés d'Altona de Jean-Paul Sartre (1960) et Qui a peur de Virginia Woolf ? d’Edward Albee (1962).\n\nEn 1978, Véra Korène quitte le théâtre et met un terme à sa longue carrière artistique.\n\nElle est inhumée au cimetière parisien de Pantin, 86e division[1]."}, {"url": "https://www.bfi.org.uk/sight-and-sound/features/la-grande-illusion-1937-jean-renoir-greatest-films-poll", "page_content": "Sign up for Sight & Sound’s Weekly Film Bulletin and more News, reviews and archive features every Friday, and information about our latest magazine once a month. Email Sign up\n\nLike all enduring classics, Jean Renoir’s La Grande Illusion (1937) comes to us encumbered with a lot of baggage.\n\nA resounding success in its time, made by the most canonical French filmmaker of the interwar era, it has been laden with prizes, consistently screened and much written about. This is a film with a legend. Yet at the same time it has not been untouched by controversy, while its status in the film canon is less secure than it might seem. The release of a new digital print by StudioCanal is a good opportunity to look at the reception of this mythic work both in its 1930s context and via its fluctuating reputation since, as a test not just of how a great work can mean so many different things to different people at different times, but also of the variability of critical agendas.\n\nLa Grande Illusion follows French prisoners of war in two German camps during World War I. The core group of officers includes the working-class Maréchal (Jean Gabin), the aristocrat de Boeldieu (Pierre Fresnay), the wealthy Jewish bourgeois Rosenthal (Marcel Dalio) and the comic music-hall actor Cartier (Julien Carette). Their attempt to tunnel out of the first camp (Hallbach) is foiled at the last moment by a transfer to the forbidding fortress of Wintersborn (in real life the Haut-Koenigsbourg chateau in Alsace) where they meet again the German officer glimpsed in the film’s prologue, Captain von Rauffenstein (Eric von Stroheim). From there, thanks to the sacrifice of de Boeldieu, Maréchal and Rosenthal finally escape. After being rescued by German widow Elsa (Dita Parlo), they eventually make it across the border to Switzerland.\n\nAn explicitly anti-war film, La Grande Illusion advocates human solidarity across national and class barriers: the French and German aristocrats bond over memories of Maxim’s and horses while the lower ranks on both sides are unanimous in their opinion that the war has gone on too long. Meanwhile the well-supplied Rosenthal shares food parcels with his comrades while de Boeldieu, knowing that his class is doomed, sacrifices himself to further the escape of his commoner fellow officers (“a nice present from the French revolution”, von Rauffenstein remarks).\n\nIn its time\n\nShot in the winter of 1936-37 and released on 8 June 1937, La Grande Illusion was a combination of autobiography, humanist statement and political tract. It bore the marks of the Popular Front’s left-leaning politics, in which Renoir had been closely involved; but with the Popular Front on the wane, those politics were already less clear-cut than in the director’s three 1936 films Le Crime de Monsieur Lange, Les Bas-fonds and the Communist-sponsored documentary La vie est à nous!.\n\nA transitional film in this respect, before the noir pessimism of Renoir’s 1938 Zola adaptation La Bête humaine, La Grande Illusion is about class solidarity rather than class struggle. Its pacifism makes sense against a backdrop of international tension marked by the mounting threat of fascism and world war. Equally importantly, it was part of the strong current of anti-war feeling in France in the wake of World War I. In French that war was known as ‘la der des ders’ (‘the last of the last’) – and perhaps the most poignant of the multiple meanings of the title ‘grand illusion’ was the recognition that, sadly, it wouldn’t be the last.\n\nLa Grande Illusion (1937)\n\nIn the details of its narrative, La Grande Illusion was also auto­biographical, based on Renoir’s own memories of the war, in which he served as a pilot until he was shot down in April 1915 (Gabin wears Renoir’s old uniform in the film). To his own recollections he added those of his friend Pinsard, another pilot. Trouble flared when Renoir and scriptwriter Charles Spaak failed to acknowledge that their screenplay also drew on Jean des Vallières’s novel Kavalier Scharnhorst, leading to a plagiarism case. While there are similarities between the book and the film, they remain relatively minor. More significant were Spaak’s input and changes in the cast, especially the inclusion of von Stroheim and the consequent expansion of von Rauffenstein’s part (Renoir greatly admired the Austrian as a director).\n\nAs Martin O’Shaughnessy details in his excellent 2009 book on the film, while there was a consensus about the brilliance of La Grande Illusion from the point of view of style and performances, critics tended to address its subject-matter: “Its success was never narrowly cinematic because of its direct and obvious connection with the pressing issues of its day.” With the exception of a few right-wing writers – including fascist novelist Louis-Ferdinand Céline, who in his book Bagatelles pour un massacre odiously berated the sympathetic portrayal of the Jewish Rosenthal – most critics liked the film.\n\nThis consensus reflects both the film’s artistic success and its ability to express contradictory points of view – for instance, while national barriers are criticised as artificial, the film also indulges in national stereotypes. With the exception of Germany, where it was banned as Goebbels’s “cinematic enemy number 1”, La Grande Illusion was a triumph on the international scene too. It managed to please both Fascist Italy and Franklin D. Roosevelt, winning a raft of prizes including the ‘International Jury Cup’ at Venice and the New York Film Critics’ Circle award.\n\nMuch more controversial was the film’s French reception on its reissue in 1946. The audience still loved it, but this time round the critics were far less enthusiastic. Some cuts were made to the scenes concerning Rosenthal, as well as to the romantic episode between Maréchal and Elsa. Renoir’s adoption of US nationality in the same year may have accounted for some of the flak; but that aside, in the aftermath of World War II and the revelations of the Holocaust, three areas in particular appeared problematic: the film’s pacifism; its view of war as steeped in chivalry, with sympathetic portrayals of ‘good Germans’; and the representation of Rosenthal, which was now read as having anti-Semitic resonances.\n\nThe latter issue gave rise to a long series of debates that still continue today, centred on whether or not the film’s recourse to anti-Semitic stereotypes (Rosenthal as rich banker) and directly anti-Semitic remarks (Maréchal to Rosenthal: “I could never abide Jews”) were meant as a critique of anti-Semitism. The other questions, however, quickly receded into the background. On the one hand, the heated political divisions that informed film criticism in France gave way to other agendas; on the other, the reconstruction of Europe soon made the film’s pacifism and advocacy of rapprochement between nations seem relevant once again.\n\nIn and out of the canon\n\nAs it became detached from these polarised debates, La Grande Illusion was poised to start a different career as a classic. The 1950s saw the beginning of retrospective assessments of the history of cinema, marked by the appearance of a number of polls, in particular in Belgium in 1952 and 1958. Significantly, the 1952 list by the Brussels Cinémathèque and the 1958 list compiled on the occasion of the Brussels World Fair both included La Grande Illusion among the top ten (or 12) best films ever made. It’s worth looking at this a little closer.\n\nLa Grande Illusion (1937)\n\nThe only French film by a French director included in 1958 (at no.5), La Grande Illusion figured in a list topped by Eisenstein’s Battleship Potemkin and also including Chaplin’s The Gold Rush, De Sica’s Bicycle Thieves, Dreyer’s The Passion of Joan of Arc, von Stroheim’s Greed, Griffith’s Intolerance, Pudovkin’s Mother, Welles’s Citizen Kane and Dovzhenko’s Earth. It’s a list strong in great films with ‘great themes’, in keeping with the period’s humanist ethos – something that would be disparaged by New Wave critics such as Claude Chabrol.\n\nIndeed, as a response Cahiers du cinéma offered its own list (compiled by Bazin, Chabrol, Godard, Rohmer, Rivette and Truffaut, among others) in December 1958. This was their choice: Murnau’s Sunrise; Renoir’s La Règle du jeu; Rossellini’s Journey to Italy; Eisenstein’s Ivan the Terrible; Griffith’s Birth of a Nation; Welles’s Confidential Report (aka Mr Arkadin); Dreyer’s Ordet; Mizoguchi’s Ugetsu Monogatari; Vigo’s L’Atalante; von Stroheim’s The Wedding March; Hitchcock’s Under Capricorn and Chaplin’s Monsieur Verdoux.\n\nThere are many things to say about the differences between the two lists, such as the choice by Cahiers of both more modernist films (Journey to Italy) and more intimate drama (L’Atalante). Suffice it here to point out (beyond Cahiers’ typical provocation, replacing Citizen Kane with Confidential Report) the crucial shift from La Grande Illusion to La Règle du jeu – a momentous switch that would be echoed in many subsequent surveys, and notably in the ten-yearly Sight & Sound polls.\n\nThere, only La Règle du jeu appears in the top ten (at no.10 in 1952, no.3 in 1962, no.2 in 1972, 1982 and 1992, and no.3 in 2002). Knocked out of the A list, La Grande Illusion ends up among the also-rans – for instance appearing at no.38 in the 2002 Sight & Sound’s critics’ list. Similarly, Cahiers du cinéma’s 2008 list of ‘100 Greatest Films’ includes La Règle du jeu at no.3 and La Grande Illusion at no.68. Many other examples could be quoted that all illustrate the same basic shift in critical tastes.\n\nAs Robin Wood remarked, “In the days when film’s importance was attributed to the importance of its subject, [La Grande Illusion] was widely regarded as Renoir’s masterpiece,” but with the advent of auteurism in the 1950s, “it came to be perceived as a less personal, less intimate and less complex work.” I agree with Wood that this is a misconception, but it’s worth looking more closely at the reasons why the new critical consensus arose and endured.\n\nThe ‘easy’ accessibility of La Grande Illusion, its balanced structure in three acts (Hallsbach, Wintersborn, Elsa), the complex yet apparently seamless cinematography and the presence of major stars all signal a harmonious, classic film, whose subject is cohesion between individuals and nations. By contrast, the more ‘de-centred’ aesthetics of La Règle du jeu echo its theme of social disintegration. Thus for Truffaut, the fact that La Grande Illusion “is perhaps the least eccentric of all of Renoir’s French movies” is a reason to dampen his praise. When we add the presence of serious subject–matter – of a ‘great theme’, in Chabrol’s terms – we can almost see traces of New Wave accusations against the ‘tradition of quality’. Hence Truffaut also downplays La Grande Illusion for “serving a patriotic theme”.\n\nLa Grande Illusion (1937)\n\nLa Grande Illusion’s popular success (it was the top-ranking film of 1937 at the French box office) is also a factor. In the Renoir canon, a legend has grown around La Règle du jeu’s supposed hostile reception in 1939. This has been shown by Renoir scholars Claude Gauteur and Christopher Faulkner to be a vast exaggeration, but the legend has endured that the film was ‘misunderstood’ at the time of its release, adding to its mystique and prestige. As Peter Wollen has pointed out, today’s highly ranked films like Citizen Kane and La Règle du jeu have the added aura of films maudits. This is not the case for La Grande Illusion, which along with Les Bas-fonds and La Bête humaine did very well commercially. Not coincidentally, all three starred Gabin, the leading French star of the time.\n\nThe use of actors is another key factor in the subsequent reputation of the film within the Renoir canon, for two reasons. First, another Renoir legend (initiated by Bazin) is that one of the director’s hallmarks was to use actors ‘against the grain’ – so for instance in La Règle du jeu there are relative unknowns (Nora Gregor), non-professionals (Renoir himself) or actors deliberately out of their expected register (Roland Toutain, a comic, as the tragic aviator Jurieux). In La Grande Illusion, on the contrary, the stars all work brilliantly within their registers – and consequently met with public approval. Gabin, Fresnay, Dalio and Carette, among others, give fabulous performances that were valued not just by the audience but by Renoir himself. As he said, “Each time I see the picture, I’m impressed by one idea. It is that you don’t do anything with bad actors… I know that I owe so much to the actors.”\n\nThe second point is the question of stars and authorship. Renoir’s happy sharing of the credit with his actors did not fit well with the auteur theory that advocated the director’s single vision. At the level of production, Gabin was instrumental in getting the film off the ground. At the level of reception, while Renoir was recognised and rewarded as the director of La Grande Illusion, the film was also seen as a great ensemble piece and, for a significant part of the audience, a ‘Gabin film’. By contrast, in those terms, La Règle du jeu cannot be anything but a ‘Renoir film’.\n\nIt’s clear that the critical debates that have shaped the reception of La Grande Illusion are, as ever, historically grounded. The film has ridden waves of critical approval and disapproval, yet through them continued to meet popular success. As a viewer’s comment on IMDb put it when La Grande Illusion dropped out of the website’s top 250 films in 2010 (typically, comparing it to La Règle du jeu), “This is a film that you can both appreciate AND enjoy!” While the immediate topic of the film is a specific war, the virulent debates in 1946 show its significance to a later war – and, consequently, its ability to speak to us today; issues of war, class and national conflicts have, sadly, not lost their relevance.\n\nIn its ensemble perfection, La Grande Illusion is also a snapshot of French cinema of the late 1930s at its absolute best. It is a classic in the terms defined by Frank Kermode: that is, a film not frozen in time, but open to different readings across times and cultures. In all these senses, then, Bazin’s verdict is as true today as it was when he wrote it in the late 1950s: “It is not enough to say that it has retained its power… the stature of the film remained undiminished by the passage of time.”"}, {"url": "https://newrepublic.com/article/118332/world-war-i-film-la-grande-illusion", "page_content": "I urge you to read Macdonald’s book and to see Renoir’s film. It would not surprise me if in the United States in any year now twenty thousand people see La Grande Illusion. I am guessing, taking into account repertory revivals, Netflix rentals, classes and seasons on Renoir, and so on. That is good news, sustained by the movie being available on a good DVD in a world where the library for books has plenty of material on and by Renoir himself. Yet I would not be surprised to hear that only a few hundred will see the movie this year projected as film on a big screen. Is this worth bothering about when the technology is impatient and can easily tell us, what does it matter if the film is preserved?\n\nNicholas Macdonald, who is sixty-nine, and has made documentary films, understands our changing history with old films. For a time La Règle du Jeu, the other Renoir classic, often mentioned in the same breath as La Grande Illusion, was lost. In part that was because it was a flop in 1939, and then it was banned and the negative destroyed. But in the 1950s, La Regle was restored. It began to come into its own. There is now a fine DVD. And at a respectable dinner party, where most of the guests have graduated college, you can mention Jean Renoir along with the Cloud and the World Cup and expect to be understood. That’s right, people will say, the son of the painter, and they’ll recall the couple of titles I’ve mentioned. But La Chienne, Toni, Le Crime de Monsieur Lange, The River, French Cancan, The Golden Coach? Less likely. Then try these names: Alexander Dovzhenko, Max Ophüls, Luis Buñuel. . . .\n\n“Isn’t he the fellow who sliced the woman’s eye?—I remember seeing that in college!” That is correct. I feel now that Buñuel is as great a movie director as Renoir—and his credits go from Un Chien Andalou (the one with the eye), through Los Olvidados, Él, Viridiana, The Exterminating Angel, Belle de Jour, The Discreet Charm of the Bourgeoisie, That Obscure Object of Desire. This is a great record, even if, by temperament, Buñuel was less comfortable or humanistic than Renoir. And I fear that Buñuel is being forgotten, just as I believe the evolution in movie appreciation of the 1960s and 1970s (in which Dwight Macdonald was a significant figure) is waning. So those people at the dinner party know Hitchcock and Orson Welles, but the memory is fading for Preston Sturges, Howard Hawks, and many others."}]}