{"Véra Korène died in Paris in 1956.": [{"url": "https://peoplepill.com/people/vera-korene/", "page_content": "Véra Korène (June 6, 1901 – November 19, 1996), was a Russian-born French actress and singer.\n\nBorn Rébecca Véra Korestzky in Russia of Jewish heritage, she fled the Revolution and settled in Paris, France.\n\nUsing the Francized name Korène, she began her career in the theatre but also appeared in a number of films during the 1930s. A mainstay of the Parisian stage, in the 1950s she organized her own theatre production company, putting on performances at the Comédie Française. In 1956 she was named director of the Théâtre de la Renaissance, a position she held until 1978.\n\nVéra Korène died in 1996 in Louveciennes in a senior citizen's home and was interred in the Cimetière de Pantin in the Parisian suburb of Pantin.\n\nPartial Filmography:\n\nThe Faceless Voice (1933)\n\nBelle de nuit (1933)\n\nSecond Bureau (1935)\n\nSept hommes, une femme (1936)\n\nL'Argent (1936)\n\nLe batelier de la Volga (1936)\n\nAu service du tsar (1936)\n\nDeuxième Bureau (Second Bureau) (1936)\n\nTamara la complaisante (1937)\n\nDouble crime sur la ligne Maginot (1937)\n\nLa danseuse rouge, 1937 (The Red Dancer) (1937)\n\nCafé de Paris (1938)\n\nLa Brigade sauvage (1939)"}, {"url": "https://www.encyclopedia.com/religion/encyclopedias-almanacs-transcripts-and-maps/korene-vera", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "http://dictionary.sensagent.com/vera%20korene/en-en/", "page_content": "Véra Korène (June 6, 1901 – November 19, 1996), was a Russian-born French actress and singer.\n\nBorn Rébecca Véra Korestzky in Russia of Jewish heritage, she fled the Revolution and settled in Paris, France.\n\nUsing the Francized name Korène, she began her career in the theatre but also appeared in a number of films during the 1930s. A mainstay of the Parisian stage, in the 1950s she organized her own theatre production company, putting on performances at the Comédie Française. In 1956 she was named director of the Théâtre de la Renaissance, a position she held until 1978.\n\nVéra Korène died in 1996 in Louveciennes in a senior citizen's home and was interred in the Cimetière de Pantin in the Parisian suburb of Pantin.\n\nPartial Filmography:"}, {"url": "https://www.findagrave.com/memorial/11312174/v%C3%A9ra-kor%C3%A8ne", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://musicbrainz.org/artist/307dbb95-8c66-4ce9-adf7-8530540c4f01", "page_content": "Véra Korène ~ Person\n\nDiscography\n\nShowing official release groups by this artist ."}, {"url": "https://www.celebsagewiki.com/vera-korene", "page_content": "Age, Biography and Wiki\n\nVéra Korène (Rebecca Véra Koretzky) was born on 17 July, 1901 in Bakhmut, Yekaterinoslav Governorate, Russian Empire [now Artemivsk, Donetsk Oblast, Ukraine], is an Actress. Discover Véra Korène's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of Véra Korène networth?\n\nPopular As Rebecca Véra Koretzky Occupation actress Age 95 years old Zodiac Sign Cancer Born 17 July 1901 Birthday 17 July Birthplace Bakhmut, Yekaterinoslav Governorate, Russian Empire [now Artemivsk, Donetsk Oblast, Ukraine] Date of death 20 November, 1996 Died Place Louveciennes, Yvelines, France Nationality Ukraine]\n\nWe recommend you to check the complete list of Famous People born on 17 July. She is a member of famous Actress with the age 95 years old group.\n\nVéra Korène Height, Weight & Measurements\n\nAt 95 years old, Véra Korène height not available right now. We will update Véra Korène's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nVéra Korène Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Véra Korène worth at the age of 95 years old? Véra Korène’s income source is mostly from being a successful Actress. She is from Ukraine]. We have estimated Véra Korène's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actress\n\nVéra Korène Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://musicbrainz.org/artist/307dbb95-8c66-4ce9-adf7-8530540c4f01/releases", "page_content": "Véra Korène ~ Person\n\nReleases\n\nShowing releases by this artist. Show Various Artist releases instead"}, {"url": "https://www.wikizero.com/www//V%C3%A9ra_Kor%C3%A8ne", "page_content": "Véra Korène (6 June 1901 – 19 November 1996) was a Russian-born French actress and singer.\n\nBorn Rébecca Véra Korestzky in Russia of Jewish heritage, she fled the Revolution and settled in Paris, France.\n\nUsing the Francized name Korène, she began her career in the theatre but also appeared in a number of films during the 1930s. A mainstay of the Parisian stage, in the 1950s she organized her own theatre production company, putting on performances at the Comédie Française. In 1956 she was named director of the Théâtre de la Renaissance, a position she held until 1978.\n\nVéra Korène died in 1996 in Louveciennes in a senior citizen's home and was interred in the Cimetière de Pantin in the Parisian suburb of Pantin."}, {"url": "https://fr.wikipedia.org/wiki/V%C3%A9ra_Kor%C3%A8ne", "page_content": "Véra Korène, nom de scène de Rebecca Vera Koretzky, est une actrice française d'origine juive russe, directrice de théâtre, née le à Bakhmout et morte le à Louveciennes.\n\nVéra Korène nait dans une famille juive, qui après la Révolution russe, quitte la Russie pour Paris.\n\nElle est admise au Conservatoire où elle a notamment pour professeur Firmin Gémier. Elle entre ensuite à la Comédie-Française dont elle devient sociétaire en 1936. Elle fait parallèlement une courte carrière au cinéma, interrompue par la Guerre et par les lois de Vichy : déchue de sa nationalité française par décret du 29 octobre 1940 et exclue de la Société des comédiens-français à partir du 1er novembre 1940 , elle est contrainte de quitter la France. Elle se réfugie au Canada, puis partage son exil entre Hollywood et le Brésil.\n\nDe retour en France en 1945, elle est réintégrée à la Comédie-Française et retrouve avec succès les planches, où en 1950 elle met en scène les Sincères de Marivaux.\n\nEn 1952, au théâtre romain de Fourvière, elle adapte, met en scène et joue Le Martyre de saint Sébastien de Gabriele D'Annunzio et Debussy. D'où trois disques.\n\nEn 1956, elle quitte le Français pour prendre la direction du théâtre de la Renaissance où elle monte notamment les Séquestrés d'Altona de Jean-Paul Sartre (1960) et Qui a peur de Virginia Woolf ? d’Edward Albee (1962).\n\nEn 1978, Véra Korène quitte le théâtre et met un terme à sa longue carrière artistique.\n\nElle est inhumée au cimetière parisien de Pantin, 86e division[1]."}, {"url": "https://music.metason.net/artistinfo?name=V%C3%A9ra%20Kor%C3%A8ne", "page_content": "ArtistInfo App\n\nAcknowledgements\n\nArtistInfo for iOS and ArtistInfo for Mac are presenting musicians, composers and producers that are envolved in the musical work that you are listening to in Apple Music, iTunes, or Spotify. Discover new music via the network among artists. Manage your favorite musicians and albums via iCloud and share recommendations with your friends via email, AirDrop, or Social Media.To all the music fans that are contributing on Discogs MusicBrainz and Wikipedia . Thanks to Franz Flückiger for providing Storygram used to visualize band membership."}]}