{"Nodar Kumaritashvili was the first athlete to die in competition at the Olympic Games since the death of Danish cyclist Knud Enemark Jensen at the 1960 Summer Olympics.": [{"url": "https://www.nbcnewyork.com/news/sports/beijing-winter-olympics/beijing-olympics-bring-back-memories-of-luge-danger-after-death-in-vancouver-in-2010/3536668/", "page_content": "Luge, one of the world's fastest and most dangerous sports, kicked off competition Saturday at the 2022 Beijing Olympics.\n\nThe nail-biting sport continues to be a Winter Olympics favorite, but its massive speed and high intensity action can be treacherous.\n\nIn the first heat of the luge men's singles competition, Ukraine's Andriy Mandziy faceplanted during the end of his run but was able to walk off the track after sliding to the finish.\n\nGet Tri-state area news and weather forecasts to your inbox. Sign up for NBC New York newsletters.\n\nWith speeds that can reach over 90 mph, luge is one of the most dangerous sports at the Olympic Games.\n\nAccidents and injuries are common during competition.\n\nTwelve years ago, Georgian luger Nodar Kumaritashvili died before the Opening Ceremony of the 2010 Vancouver Olympics after losing control of his sled on a training run and hitting a steel pole that was unpadded.\n\nThe International Luge Federation conducted an investigation where they determined that human error was the cause of the deadly training run crash. While there was no indication that the accident was caused by deficiencies in the track, it was later redesigned with higher walls and padded beams, now meant to limit speeds to just about 87 miles per hour.\n\nAnd two weeks before the start of the 1964 Innsbruck Games, Polish-born British luger Kazimierz Kay-Skrzypeski died on the luge track during a practice run.\n\nTeam USA Luger Emily Sweeney discusses her rebound after breaking her neck and how her military service is similar to being in the Olympics.\n\nHow does luge work?\n\nLuge is a one or two-person event where an athlete lies on their back on a flat sled and races down a specially designed ice track.\n\nIf a slider crosses the finish line without his sled, the run is thrown out, which means automatic disqualification since all of the run times count toward the final score. However, the slider can cross the finish line carrying their sled, and the run will still count.\n\nWhat equipment is used in luge?\n\nThe equipment involved is relatively simple. It includes gloves, boots, a helmet and the sled.\n\nThe sled is made from fiberglass and steel and is custom-made for the athlete based on their height and weight.\n\nThe sled rides on two sharp-bottomed blades known as runners, the only part of the sled that makes contact with the ice.\n\nWhat are the different events in luge?\n\nThere are four luge events that take place at the Olympics: men's singles, women singles, mens doubles and mixed team relay event.\n\nThe mixed team relay event was added to the program in 2014.\n\nEach nation is allowed to enter a maximum of three men, three women, two doubles teams and one relay team. No more than 106 luge athletes can participate at the Games.\n\nWhich countries are good at luge?\n\nGermany is the most dominant when it comes to luge.\n\nSince the addition of luge in the 1964 Winter Games, German athletes have won 81 of the 141 medals awarded for it, and 34 of 48 gold medals.\n\nIn the singles events, a German man or woman has taken home 20 out of the 30 combined Olympic titles.\n\nAustria’s Olympic luge team has won the second-most medals (22) and third-most golds (six).\n\nItaly follows behind with 22 total medals and the second-most golds (seven).\n\nWho won gold in luge at the 2018 Winter Olympics?\n\nAustrian David Gleirscher took men’s singles gold in 2018, adding to the country’s legacy in the sport. Austria’s 22 total luge medals are the most in Olympic history for a non-German country.\n\nGerman Natalie Geisenberger is the two-time defending Olympic champion in women’s singles entering Beijing and has continued her dominance in the sport with four world championship medals since the last Winter Olympics."}, {"url": "https://www.independent.co.uk/news/world/saba-nodar-kumaritashvili-olympics-beijing-b2005629.html", "page_content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nWhen Saba Kumaritashvili takes to the ice in Beijing, his cousin’s presence will no doubt loom large over the race.\n\nThe 21-year-old is set to make his Olympic debut in the luge almost exactly 12 years to the day that 21-year-old Nodar Kumaritashvili was killed in a horror crash during his own Olympic debut.\n\nNodar was participating in a training run on 12 February 2010 just hours before the Winter Olympics Opening Ceremony would get underway in Vancouver.\n\nHe was traveling at around 90mph down the Whistler Sliding Centre track when he lost control of his sled on the 16th - and final - curve.\n\nNodar was thrown from the sled feet first and sent flying over the ice wall where he plowed head-on into an exposed metal post.\n\nA coroner later ruled that he died instantly on impact.\n\nNodar’s sled continued down to the finish line and stopped the timer as it crossed.\n\nNow, more than a decade on, Saba hopes to finish the race his cousin started and take home a medal for their home country of Georgia in the 2022 Beijing Winter Olympics.\n\nSaba said in a recent interview with the Associated Press that he can feel Nodar’s “strength” with him as he heads to the Games.\n\n“Thinking about him is painful but gives me strength as well,” he said.\n\n“Every generation of our family had at least one luge sportsman, and now my father and I are continuing this tradition and following Nodar’s footsteps.”\n\nThe 21-year-old got into the sport at a young age and made his debut competition just last year in the 2021 Nations Cup in Sigulda.\n\nAccording to his bio page on the Beijing 2022 website, Saba is 47th in the World Cup rankings.\n\nIt seems there was never any doubt that Saba would persevere with the sport even in the face of unspeakable tragedy.\n\nNodar Kumaritashvili flies off the track in the horror crash that killed him (PETER PARKS / AFP / GETTY IMAGES)\n\nSaba and Nodar both come from a long line of lugers.\n\nIt was Aleko Kumaritashvili, Saba’s great-grandfather, who introduced the sport to the country of Georgia back in the 1970s and built its first luge track in the family’s hometown of Bakuriani’s in 1973.\n\n“My great-grandfather laid the foundation for this sport” and went on to become its national coach, Saba told AP.\n\nThe passion for luging then continued through the generations.\n\nSaba’s grandfather Felix and uncle David (Nodar’s father) were both several-time champion lugers when Georgia was part of the Soviet Union.\n\nAt one point, Felix was the coach for the French National Luge Team before becoming the president of Georgia’s national luge federation and its national coach, according to an online obituary.\n\nFelix coached many luge athletes during his career, including Nodar at the time of his fatal crash.\n\nSaba’s father is now president of the national federation following Felix’s death in 2020.\n\nDespite their multi-generational success in the sport, it wasn’t until 2010 when Nodar became the first in the family to head to the Olympic Games.\n\nAfter his cousin’s dreams were cut short in the training rounds, Saba will now become the first to compete for a medal.\n\nNodar Kumaritashvili during a training run at the Vancouver Olympics (AFP/Getty)\n\nEven after Nodar’s death, the family were determined not to hang up their sleds.\n\nIn an interview in 2014 - four years on from his son’s death - his father David spoke of his plans for his 18-month-old grandson Nikayo to “continue our luging dynasty”.\n\n“At three we’ll start training him,” he said at the time.\n\nErin Hamlin, the first singles slider ever to win an Olympic medal in luge for Team USA, told The Independent she isn’t surprised to see Nodar’s cousin continuing the family tradition even in light of his death.\n\n“I don’t think it’s surprising,” she said. “The family has a lot of connection to the sport.”\n\nIt was Ms Hamlin’s second Olympic Games in Vancouver when the luge community was rocked by Nodar’s horrific crash.\n\nHis death made him the first athlete to die in Olympic training or competition in almost half a century after luger Kazimierz Kay-Skrzypecki died in a crash during practice in the 1964 Games.\n\nMs Hamlin said “there was a lot of shock” at Nodar’s death but says it never even crossed her mind to pull out of the competition.\n\n“Obviously it shook us all. You never want to see something like that happen,” she said.\n\n“But I was never in a mindset that I wouldn’t compete. I was comfortable on the track.”\n\nThe same mentality appears to be true of Saba.\n\nMs Hamlin added: “There’s risks every time you slide. I was never fearful about continuing to slide.\n\n“The track was definitely fast and challenging but it was new and most new tracks are challenging to figure out and come with risk. I enjoyed the track quite a bit.”\n\nQuestions were instantly raised after Nodar’s death about the safety of the track.\n\nThe Whistler course was the fastest track in Olympic history and speeds of 96 miles per hour had been recorded ahead of the Games.\n\nThe 16th curve where Nodar had flown off the track had earned the nickname the “Thunderbird”.\n\nDavid revealed that his son had told him just three days before his death that he was “very scared” of the turn where he flipped off the sled.\n\n“Dad, I’m very scared of this spot on the track,” he recalled to ABC News .\n\n“It’s very, very fast. But don’t worry, I’ll handle it well.”\n\nDavid said he urged him not to “risk it” but that his son was insistent that he was going to go for it.\n\n“What will be, will be,” he recalled him saying.\n\nNodar’s father David Kumaritashvili at his son’s grave in Bakuriani, Georgia, in 2014 (AP)\n\nIt was Nodar’s fifth and final training run before he would have competed in the Games the following day when tragedy struck.\n\nThe track was hurriedly altered following the crash in time for the first race less than 24 hours later.\n\nThe start was lowered in an effort to reduce the speed.\n\nThe exposed metal poles which Nodar struck were covered with a 12-foot-high wall made of wood and padding.\n\nAnd the Thunderbird was reconfigured so that the sleds didn’t slide too high on the walls.\n\nInternational Luge Federation officials said at the time that the changes were made with the “emotional component” of the athletes in mind and insisted that there were no “deficiencies in the track”.\n\nInstead, they said that the crash was caused by errors made by Nodar when he “did not compensate properly to make correct entrance into Curve 16”.\n\nFor several athletes, the last-minute change in start proved difficult.\n\nMs Hamlin had been expected to take home at least bronze but ended up missing out on the medal table. She won bronze four years later in Sochi.\n\nShe told The Independent that Nodar’s death did lead to changes in the sport in terms of focusing on safety over speed.\n\n“I think it was a movement where everyone stopped to look at ways we could try to see if it was possible to make the track safer,” she said.\n\n“There wasn’t much that could be done other than moving the starts as it was kind of a freak accident.\n\n“But the trend of just building faster and faster tracks did change.”\n\nNodar’s sled is seen just after the fatal crash. It crossed the finish line moments after he was killed (AP)\n\nFor Saba, he feels he is now ready to represent his family - particularly his cousin - in Beijing.\n\n“I worked hard and believed in myself strongly,” he said.\n\n“Now I feel happy and satisfied that I’ve achieved one of my goals… I think every sportsman’s goal and dream is to be competing in the Olympic Games, so two years ago I decided to achieve this goal. And here I am.”\n\nHe added: “I am happy and proud that I have the opportunity to represent my family and country at these Olympics.\n\n“Now I feel responsibility to them, because they expect good results from me. It’s really big motivation, so I will try to do my best for them.”"}, {"url": "https://www.nytimes.com/2010/02/13/sports/olympics/13luge.html", "page_content": "VANCOUVER, British Columbia \u0097 The Vancouver Olympics were set to open with the most daunting and dangerous collection of events the Winter Games had ever seen, but before the competitions even began, a luge athlete died in a high-speed crash that overshadowed Friday night’s opening ceremony and intensified concerns over the safety of the Games.\n\nThe athlete, Nodar Kumaritashvili of the Republic of Georgia, lost control of his sled near the end of his training run while traveling nearly 90 miles an hour \u0097 about as fast as any luger had ever gone before the Whistler Sliding Centre track was completed in 2007.\n\nThe sled, with Kumaritashvili riding atop on his back, feet first, bounced off a side wall and threw Kumaritashvili over the short ice-covered concrete wall on the left. He slammed into vertical supports that hold a canopy and lights over the course. Medics arrived immediately, and Kumaritashvili was pronounced dead at a hospital.\n\nKumaritashvili, from Borjomi, Georgia, was 21.\n\nHours after the accident, Georgia’s Olympic athletes wore black armbands as they marched in the opening ceremony."}, {"url": "https://sports.yahoo.com/luge-killed-his-cousin-he-slid-to-the-olympics-anyway-135739005.html", "page_content": "Luge killed his cousin. He slid to the Olympics anyway\n\nYANQING, China — Nodar Kumaritashvili was four curves away from Georgian Olympic history when, on that chilling day in 2010, he lost control.\n\nOne moment, he was furthering a family legacy, whizzing down a luge track, completing one last training run before the Games.\n\nThe next, he flew off his sled, over an icy wall, and into a metal pole.\n\nHe would’ve been the first Georgian luger to compete at the Olympics. Instead, he died.\n\nScroll to continue with content Ad ADVERTISEMENT\n\nNow, 12 years later, his cousin is.\n\nSaba Kumaritashvili thought about Nodar this week, as he prepared to slide down a rock-hard track here in Yanqing. He pulled his hips forward and clenched his lips, then pushed back, and flung himself into this treacherous, frozen strait. He careened around corners, and flirted with walls, and hit 78 miles per hour.\n\nBut he “wasn’t afraid,” he said after his second run.” Tragedy never threatened to drive him away from the sport.\n\nInstead, he said, “after Nodar, I didn’t want luge to die in Georgia. I wanted to keep it going.”\n\nSo he did what so many members of his family had done for decades. His story, like Nodar’s, is so much more than a crash or a single-minded Olympic pursuit. It begins with his great grandfather, Aleko, who laid the groundwork, literally. Aleko oversaw the construction of Georgia’s first luge track in the 1970s. His son and grandson took advantage. Saba’s grandfather, Felix, slid to the Junior European Championships a few years later. Saba’s uncle — Nodar’s father — then won a USSR youth championship in the final years before the Soviet split. Multiple family members, including Saba’s father, have run the Georgian luge federation since.\n\nDavid Kumaritashvili, father of the Georgia luger Nodar Kumaritashvili who killed on an Olympic training run, shows a photo his son e-mailed from the 2010 Vancouver Olympics. (AP)\n\nSo luge, naturally, entered Saba’s life at an early age, just as it had Nodar’s. His parents guided him into the sport. “I think they wanted it more than me,” he said. Nodar, he said, was also one of his reasons.\n\nAdvertisement\n\nThe cousins were 12 years apart. Saba was 9 in 2010 when Nodar did what so many other family members had dreamed of, and then what every luger fears. Saba doesn’t “remember much of him, only moments.” But enough to have Nodar at the forefront of his mind when he posed with Olympic rings, and walked the Olympic track, and stepped into Friday’s Opening Ceremony.\n\nHis continued participation in luge made some family members apprehensive. But Saba never wavered.\n\nNodar had laid down a path. Saba followed it. Nodar was 21 when he qualified for the 2010 Olympics. Saba was 21 when he did last month, and when he completed his final run here on Sunday, with smile and a shake of his head.\n\nHe did not win a medal. He didn’t come close, finishing 31st of 34 in the men’s singles competition.\n\nBut he was here. He was emotional. He was proud of himself. And he was happy.\n\n“Very happy,” he said. \"I’ve done what I needed.”"}, {"url": "https://olympics.nbcsports.com/2022/01/26/saba-kumaritashvili-nodar-luge-georgia-olympics/", "page_content": "Luge is Saba Kumaritashvili‘s family business. His great-grandfather is credited with bringing the sport to their homeland, the former Soviet republic of Georgia, more than a half-century ago. His father runs the national federation, as his relatives have for decades.\n\nAt home, his family is synonymous with sliding.\n\nAt the Olympics, his family is synonymous with sadness.\n\nHe qualified for the Beijing Games with hopes of changing that.\n\nIt’s been 12 years since his cousin, Nodar Kumaritashvili, died in a training accident at the Vancouver Games, a death that still haunts the sport, especially so every four years when the Olympics roll around and the memories get rekindled. Nodar was 21 when he would have made his Olympic debut; Saba is 21 now, about to make his Olympic debut.\n\nPut simply, Saba slides for his country. For his family. And for Nodar.\n\n“Every generation of our family had at least one luge sportsman, and now my father and I are continuing this tradition and following Nodar’s footsteps,” Saba Kumaritashvili said in an interview with The Associated Press. “Thinking about him is painful but gives me strength as well.”\n\nIt is that strength that got him here, even while he knows that some in his family are nervous whenever he takes the ice because of what happened to his cousin.\n\nNodar Kumaritashvili was killed Feb. 12, 2010, after losing control of his sled during a training run just hours before the Vancouver Games officially opened. He would have raced the next day, becoming the first in his family to compete on sliding’s biggest stage.\n\nHis cousin now has that chance.\n\n“I am happy and proud that I have opportunity to represent my family and country at these Olympics,” Saba Kumaritashvili said. “Now I feel responsibility to them, because they expect good results from me. It’s really big motivation, so I will try to do my best for them.”\n\nThat is what Nodar Kumaritashvili was trying to do 12 years ago.\n\nThe crash happened at 10:50 a.m. on a Friday, with most people already turning their attention to the opening ceremony taking place that night. The Whistler, Canada, track has 16 curves, and Nodar Kumaritashvili appeared to lose control around the 13th turn. His 176-pound body was no match for the gravitational forces, which sent him careening along the ice-covered walls of the track. The last impact with one of those walls knocked him off his sled and sent him flying across the track, his arms and legs flailing.\n\nHis body sailed over the wall of the track near the finish line, the back of his head striking a metal post outside of the track. Rescue workers got to him within seconds to no avail. He was pronounced dead after 59 minutes of resuscitation efforts, though a coroner’s report later revealed his head injuries were so traumatic that he died instantly.\n\nHis last recorded speed was 89.4 mph, which almost certainly was the fastest of his career. Some of the world’s best sliders had said that week that the track was too fast and too dangerous; after Nodar Kumaritashvili’s death, Olympic officials made several changes, including having competitors begin from a lower spot on the track in an effort to reduce speeds.\n\n“I won’t forget every detail of that day, that’s for sure,” said Erin Hamlin, a former women’s luge world champion who competed for the U.S. at the Vancouver Games. “And I don’t think any athlete who raced in Whistler will.”\n\nGerman slider Felix Loch, who won the gold medal in men’s luge at those Olympics, went to Georgia two months later and tearfully presented the Kumaritashvili family with a gold medal of its own – because Nodar’s death, in Loch’s words, changed the sport. There have been other gifts: paintings, photos, books, even letters from some of the first responders who remain haunted that his life couldn’t be saved. His headstone in Georgia is adorned by a massive bronze sculpture of him on a sled, not far from where his actual sled and the damaged helmet he wore for his last ride are displayed.\n\nSomehow, Saba was never deterred. The family, he decided, had unfinished Olympic business.\n\n“I worked hard and believed in myself strongly,” he said. “Now I feel happy and satisfied that I’ve achieved one of my goals. … I think every sportsman’s goal and dream is to be competing in the Olympic Games, so two years ago I decided to achieve this goal. And here I am.”\n\nHe is one of nine athletes from Georgia, and the only one from a sliding sport, to qualify for the Beijing Olympics.\n\nThat Saba Kumaritashvili could endure the family anguish and still follow his cousin’s path to an Olympics has drawn admiration from other sliders.\n\n“He saw through the haze,” said former U.S. luge athlete and Olympian Christian Niccum, who competed in the 2010 games. “It was a terrible accident. An accident. These things happen in life and it’s awful, but we can either live in fear from it or learn from it, grow from it and keep going. That’s why I think he’s an excellent story.”\n\nThe family’s relationship with luge is believed to go back to at least the early 1970s when Aleko Kumaritashvili – “my great-grandfather laid the foundation for this sport,” Saba said – oversaw the building of a short training track. Soviet officials helped build a more complete track around 1973, and Aleko Kumaritashvili served as the country’s coach.\n\nIt has been part of the family makeup ever since. Saba and Nodar took similar paths to the Olympics; both were introduced to the sport by their family as kids, then got into international sliding and did enough to qualify for the Games despite not having World Cup circuit experience.\n\nSaba insists he is ready.\n\n“I look at his story as what the Olympics are all about,” Niccum said. “It’s what life is about. It’s what every motivational story there is talks about. It’s perseverance. Forgetting about the past, the fears of the past, the tragedies of the past and looking forward, not living in fear or letting anything slow you down.”\n\nOlympicTalk is on Apple News. Favorite us!"}, {"url": "https://time.com/5155540/athletes-who-have-died-competing-in-the-olympics/", "page_content": "With sports like skeleton, which sends competitors head-first down an ice track, and gymnastics, which hurtles athletes through the air, the Olympic Games are not for the faint of heart.\n\nAnd while accidents and injuries are common during competition, it’s rare that an athlete dies while competing in their sport.\n\nWhile some athletes have died at the Olympics due to illness, car crashes and even terrorism, these athletes died while competing in or practicing official Olympic sports at the Games.\n\nWinter Olympics\n\n1964 – Ross Milne – Alpine Skiing\n\nAustralian skier Ross Milne died after flying off the course and crashing into a tree while training at 1964’s Innsbruck Games in Austria. Initially, the International Olympic Committee claimed Milne was too young and inexperienced for the slope, according to the Australian Olympic Committee. But Milne’s crash was caused by him swerving to avoid a crowd of contestants a spot on the course that was not meant for stopping.\n\n1964 – Kazimierz Kay-Skrzypecki – Luge\n\nThe same year that Milne died, British luger Kazimierz Kay-Skrzypecki was also killed in a training wreck, according to the Washington Post. She was the only luger to die during the Olympics until 2010 when Georgian luger Nodar Kumaritashvili died, according to the International Business Times.\n\n2010 – Nodar Kumaritashvili – Luge\n\nGeorgian luger Nodar Kumaritashvili died before the Opening Ceremony in Vancouver, Canada, after losing control of his sled on a training run, and hitting a steel pole beside the track, Reuters reported. In light of the accident, a wall was later raised and the ice profile of the track was altered. Reuters added that lugers also get more training runs to get a better feel on the track.\n\nThe anniversary of Kumaritashvili’s death was noted on the luge track at the 2018 PyeongChang Games Monday.\n\nSummer Olympics\n\n1912 – Francisco Lazaro – Marathon Runner\n\nFrancisco Lazaro from Portugal died a day after he collapsed from sunstroke and heart trouble in a Stockholm hospital, according to the Olympic Forum of Portugal, a center for Olympic studies founded by University of Lisbon professors. Dope: A History of Performance Enhancement in Sports from the Nineteenth Century to Today notes that this was the first death of an athlete at the Olympics during a competition. Lazaro had run just over 19 miles prior to collapsing.\n\n1960 – Knut Jensen – Cycling\n\nIn the middle of a road race, Danish cyclist Knut Jensen collapsed and fractured his skull, CBS reported. It was later revealed that Jensen had taken stimulants before the race. Dope cites Jensen’s death as the first connected to performance enhancing drugs at the Olympics. However, about a year later, the New York Times reported that his cause of death was due to heatstroke.\n\nContact us at letters@time.com."}, {"url": "https://www.theguardian.com/sport/2010/feb/13/luge-death-winter-olympics-kumaritashvili", "page_content": "The Olympic juggernaut rolls on in Vancouver – a $6bn (£4bn) celebration of sporting excellence and Canadian pride that has been seven years in the planning and waits for no man, not even one who lost his life in pursuit of what organisers called \"his Olympic dream\", but which others suggested was a tragedy waiting to happen.\n\nThe glittering opening ceremony was dedicated to the memory of 21-year-old Georgian athlete Nodar Kumaritashvili, who was killed after losing control of his luge in practice on the final turn of the Whistler sliding track.\n\nThe crowd rose as the Georgian team, their national flag draped in black, made its entrance into the arena. \"May you carry his Olympic dream on your shoulders and compete with his spirit in your heart,'' John Furlong, the head of the Vancouver games organising committee (Vanoc), told the athletes after they had taken their seats.\n\nStirring words, but as Furlong tried to frame Kumaritashvili's death in a way that appealed to the sentimental instincts of the global audience, a more prosaic expression of the Olympic dream was taking place on the hill, where organisers issued a statement announcing the men's luge event, in which the Georgian was due to compete, would go ahead as scheduled at 5pm local time.\n\n\"The technical officials of the FIL [International Luge Federation] were able to retrace the path of the athlete and concluded there was no indication that the accident was caused by deficiencies in the track,'' said the statement, before adding that changes would be made to the track at the spot where Kumaritashvili began to lose control of his luge.\n\nWhen the mourning phase is over, no doubt lawyers acting on behalf of the luger's family will seek to find out why it was necessary to make alterations if the track had no role to play in his death. It will draw attention to complaints from other competitors about a facility that has stretched the boundaries of safety in what is already a dangerous sport. \"We are not crash-test dummies,'' an Australian competitor said on Thursday.\n\nYet if these are issues for the lawyers somewhere down the line, more immediate questions may be asked by the Canadians of themselves, who, in pursuit of their own Olympic dream – 30 medals at least, with as many golds as possible – appear to have forgotten that national ­characteristic for which they are best known: politeness.\n\n\"Some say what defines us/is something as simple as please and thank you/and as for you're welcome/well we say that too,'' wrote Shane Kozycan in \"We Are More\", a poem he delivered during the opening ceremony.\n\nIn normal times perhaps, but in the run-up to these games, the hosts – or at least the Canadian Olympic Committee – seemed to have mislaid their manners. \"Own the podium,\" it implored its athletes in an initiative aimed at ensuring the host nation finishes at the top of the medals table at these games. Money has been poured into training, while a hard-edged approach has been adopted in dealing with other teams, most noticeably in granting them only limited access to facilities such as the sliding track.\n\nSuch behaviour is within the Olympic rules, but it came across as distinctly un-Canadian at the time, and in the context of Friday's death it seemed like a terrible misjudgment. Steven Holcomb of the US bobsleigh team said: \"This track is one of the fastest and most difficult in the world, so I think keeping it closed and not letting people have access… made it very difficult. Then you have Olympic ice, which is even faster. Little mistakes become big mistakes, and big mistakes end in tragedy.''\n\nKumaritashvili was one of those who had relatively limited experience on the track. He spent a week there in November during training, according to reports, and had gone down the track 26 times in total. He had crashed once, as had the double Olympic champion, Armin Zöggeler of Italy.\n\n\"It would be speculation if I said the time period of practice was sufficient or was not,'' said Georgia's minister of sport Nikolos Rurua, before defending the luger against suggestions that he was inexperienced – or simply not good enough – to be competing at Olympic level. Rurua said: \"He was a very progressive, strong athlete. It was his wish to compete at the Olympics, and he underwent a rigorous qualifying process. He was 44th in world rankings.\"\n\nYet if the formalities of Olympic diplomacy required the minister to leave it at that, so sparing the feelings of the hosts, Holcomb felt no such compunction. \"They limited the amount of access and training time we had on the track, while they let Canadians train on it as much as they wanted,\" he said. \"There were smaller nations that have never been down here before. It is kind of unfair and now it is a tragedy.'' So much for the Olympic dream."}, {"url": "https://www.nytimes.com/2014/02/02/sports/olympics/a-swift-and-fatal-luge-plunge-and-then-an-abyss-of-sorrow.html", "page_content": "BAKURIANI, Georgia — To reach this tiny skiing village, carved into the north side of the Trialeti mountain range, one must weave through a long progression of switchbacks rising more than a mile above sea level. When it is snowing — which is often — the trip from the capital city of Tbilisi can take nearly three hours.\n\nDodo Kumaritashvili makes the journey back and forth almost every week. Her daughter has a baby girl, and so Dodo goes to Tbilisi to help take care of her granddaughter. Upon returning home one weekend recently, Dodo entered her house and called out, “I’m home, son.” Then she began cooking.\n\nDodo’s son, Nodar, has been dead for four years. But she makes food for him every day, usually fruit or cake or meat but never soup, not even on the coldest days. Her son hated soup. When she finishes cooking, she brings the food into her son’s room and sits among the photographs and trophies and posters on the walls. After a few hours, she clears the food away and gives it to children who live nearby.\n\nNodar Kumaritashvili died at 21 in a luge crash on the eve of the 2010 Winter Olympics in Vancouver. It was a tragedy that stunned the sports world — he was the first athlete to die in Olympic training or competition since 1964 — and the accident compelled organizers for this month’s Olympics in Sochi, Russia, to re-evaluate the design of their luge track. The Sochi track, which will hold its first competition on Saturday, is intentionally slower, with an unprecedented three uphill sections."}, {"url": "https://news.yahoo.com/athletes-died-while-competing-olympics-234044645.html", "page_content": "These Athletes Have Died While Competing in the Olympics Over the Years\n\nWith sports like skeleton, which sends competitors head-first down an ice track, and gymnastics, which hurtles athletes through the air, the Olympic Games are not for the faint of heart.\n\nAnd while accidents and injuries are common during competition, it’s rare that an athlete dies while competing in their sport.\n\nWhile some athletes have died at the Olympics due to illness, car crashes and even terrorism, these athletes died while competing in or practicing their sports.\n\nWinter Olympics\n\n1964 – Ross Milne – Alpine Skiing\n\nAustralian skier Ross Milne died after flying off the course and crashing into a tree while training at 1964’s Innsbruck Games in Austria. Initially, the International Olympic Committee claimed Milne was too young and inexperienced for the slope, according to the Australian Olympic Committee. But Milne’s crash was caused by him swerving to avoid a crowd of contestants a spot on the course that was not meant for stopping.\n\n1964 – Kazimierz Kay-Skrzypecki – Luge\n\nThe same year that Milne died, British luger Kazimierz Kay-Skrzypecki was also killed in a training wreck, according to the Washington Post. She was the only luger to die during the Olympics until 2010 when Georgian luger Nodar Kumaritashvili died, according to the International Business Times.\n\n2010 – Nodar Kumaritashvili – Luge\n\nGeorgian luger Nodar Kumaritashvili died before the Opening Ceremony in Vancouver, Canada, after losing control of his sled on a training run, and hitting a steel pole beside the track, Reuters reported. In light of the accident, a wall was later raised and the ice profile of the track was altered. Reuters added that lugers also get more training runs to get a better feel on the track.\n\nThe anniversary of Kumaritashvili’s death was noted on the luge track at the 2018 PyeongChang Games Monday.\n\nSummer Olympics\n\n1912 – Francisco Lazaro – Marathon Runner\n\nFrancisco Lazaro from Portugal died a day after he collapsed from sunstroke and heart trouble in a Stockholm hospital, according to the Olympic Forum of Portugal, a center for Olympic studies founded by University of Lisbon professors. Dope: A History of Performance Enhancement in Sports from the Nineteenth Century to Today notes that this was the first death of an athlete at the Olympics during a competition. Lazaro had run just over 19 miles prior to collapsing.\n\n1960 – Knut Jensen – Cycling\n\nIn the middle of a road race, Danish cyclist Knut Jensen collapsed and fractured his skull, CBS reported. It was later revealed that Jensen had taken stimulants before the race. Dope cites Jensen’s death as the first connected to performance enhancing drugs at the Olympics. However, about a year later, the New York Times reported that his cause of death was due to heatstroke."}, {"url": "https://abcnews.go.com/WN/Olympics/olympic-luger-nodar-kumaritashvili-crashes-dies/story?id=9821494", "page_content": "Feb. 12, 2010 — -- An Olympic luger crashed and died just hours before the opening ceremonies for the Winter Olympics today after the sled he was riding flew off the track at nearly 90 mph and flung the athlete into a steel pole.\n\nNodar Kumaritashvili from the Republic of Georgia was training for the luge competition when the accident occured, just a few hours before the Vancouver Games were to begin, according to the International Olympic Committee.\n\nThe 21-year-old lost control of his sled near the finish of the track that is believed to be the fastest in the world.\n\nA speed monitor on the track noted Kumaritashvili's speed as being 144.3 kilometers per hour, or 89.6 mph, at the time of the crash.\n\nRuben Gonzalez, a member of the Argentinian luge team who witnessed the crash, told ABC News Sports Radio, \"Everybody gasped, a collective gasp, and I've been in the sport since '84, and I've never seen anybody fly out of a track before.\"\n\nGonzalez, who had trained with Kumaritashvili for the past two years, called Kumaritashvil \"a solid guy,\" and said he was respected by his peers.\n\n\"He was having a good run and he just made a mistake at the last curve and just came out, hit a pole,\" he said.\n\n\"It was a pretty horrific accident,\" said ABC News' Michael Kriesel, who saw the video of the crash. The video has since been yanked from Internet sites like YouTube.\n\n\"He was sliding and it looked like it was a pretty good time into his practice session and he went flying over the wall into the air and then hit a post,\" said Kriesel. \"When he hit the post he didn't really bounce off that much, he just stayed where he was and then officials came over and tended to him.\"\n\nRescue workers performed chest compressions and mouth-to-mouth resuscitation less than a minute after the crash, and then quickly airlifted the luger to a trauma center in Whistler.\n\nThe head of Georgia's delegation, Irakly Japaridze, said in a press conference this afternoon that the country's team stay and compete in the Winter games despite the tragedy, according to ESPN.\n\n\"We are all in deep shock,\" Japaridze said. Kumaritashvili died just hours before the opening ceremony, which was dedicated to him and the seven remaining members of the Georgian delegation, who wore black armbands as they marched behind a black-trimmed flag. Most of the crowd rose to give respectful applause. There were also plans to lower the Olympic and Canadian flags to half staff.\n\nMore than 50,000 ticket-holders packed into the stadium for the evening extravaganza, the first Olympic opening or closing ceremony ever held indoors.\n\nLuge Track at Winter Olympics Breathtakingly Fast\n\nA joint statement from the International Olympic Committee, the Games' organizing committee VANOC and the International Luge Federation offered condolences to the luger's family.\n\n\"The whole Olympic family is struck by this tragedy, which clearly casts a shadow over these Games,\" said IOC President Jacques Rogge.\n\nAt a press conference late Friday, Rogge became emotional, taking off his glasses to wipe away his tears.\n\n\"Sorry it's a bit difficult to remain composed,\" said Rogge, adding that now is not the time to \"talk about investigations.\"\n\nSpeaking for the International Luge Federation, President Josef Fendt called the accident, \"The gravest thing that can happen in sport.\"\n\nThe statement also confirmed that there is an investigation underway into the circumstances of the accident and that training has since been suspended.\n\nEven before Kumaritashvili's tragic accident there was criticism brewing of the high speeds the luge track allows athletes to reach. There was also question as to how the unusually warm temperatures may have impacted the safety of the luge tracks.\n\nBut Gonzalez said that despite what the critics say, the higher the temperature, the easier the track is on a luger beacuse the ice is \"softer and easier to navigate.\" He added that he believes the real safety problem is the height of the wall on the side of the luge, which he says is not tall enough.\n\nMore than a dozen athletes have crashed during training runs here, including four Americans.\n\nIt was just a year ago, the International Luge Federation President said that the wooden protective devices near the track's curb are too short and that they needed to be lengthened to keep lugers from flying off the track.\n\n\"I agree one hundred percent,\" said Gonzalez about the President's comments, \"My response is, why didn't they do it?\"\n\nAn Australian athlete said late today, the track is too much. \"To what extent are we just...crash test dummies?\" asked luger Hannah Campbell-Pegg. \"I mean, this is our lives.\"\n\nSome of other lugers said that the breathtaking speed of the track surprised them when they first rode it.\n\n\"The track is super fast and I'll tell you, when I first got here it felt like a blur,\" said American luger Tony Benshoof. \"It took me about 10 or 12 runs before it started slowing down in my mind.\"\n\nBenshoof estimated that he and his fellow lugers will \"hit 100 miles per hour during the race\" which even the thrill-seeker admitted would be \"very very fast.\"\n\n\"Pretty much from the top down you've got your hands full. There's a lot of really tricky corners,\" said Benshoof.\n\nBut American luger Erin Hamlin told ABC News Radio that speed is part of the sport.\n\n\"The reason we do this sport is to go fast,\" said Hamlin. \"I think I can say that for everyone, and you've got to have the extreme factor in there sometimes. It keeps it interesting.\"\n\nThe Associated Press contributed to this report"}]}