{"Leana de Bruin was the captain of the New Zealand national netball team.": [{"url": "https://www.silverferns.co.nz/silver-ferns/history/centurions/leana-de-bruin.html", "page_content": "No nonsense defender Leana de Bruin fashioned a stellar career after making New Zealand her home in 2000.\n\nA player who got better with age, the in-circle defender began her international career in South Africa where she played in 34 Tests for her country of birth.\n\nOnce cemented in the Silver Ferns, there was no stopping the hard-working defender who led by example with her consistently strong performances.\n\nAble to play both in-circle defensive positions with equal authority, the willowy de Bruin delivered on all fronts, backing up her tight and effective circle presence with strong through-court drives and support play.\n\nNaturally athletic, de Bruin’s mobility, strength in the air, long reach and uncompromising attitude were the perfect assets for a top line defender.\n\nDe Bruin thrived with age and responsibility to become a fine on-court leader. She notched a significant personal milestone at Netball World Cup SYDNEY 2015 when becoming the fifth Silver Fern to achieve 100 Test Caps.\n\nDe Bruin is one of a select group to have played in five Netball World Cups – 1999 (for South Africa) and 2003, 2007, 2011 and 2015 (for the Silver Ferns). She has also played in the 2006, 2010 and 2014 Commonwealth Games."}, {"url": "https://www.nzherald.co.nz/sport/netball-former-silver-fern-leana-de-bruin-returns-to-the-northern-stars/WB7WHGEJUXVAVH7WAJJQIB3TFQ/", "page_content": "Leana de Bruin is set to return to the national league. Photo / Photosport\n\nLeana de Bruin is set to return to the national league. Photo / Photosport\n\nFormer Silver Fern Leana De Bruin will return to the ANZ Premiership next year.\n\nDe Bruin, 41, was one of four new faces named in the Northern Stars squad for the 2019 season, after playing for Australia's Adelaide Thunderbirds this year.\n\nStars head coach Kiri Wills was excited by the return of her former captain alongside the signing of defender Storm Purvis from the Northern Mystics.\n\nWills said that in addition to their defensive talents, De Bruin and Purvis would also provide leadership support for 2018 captain Grace Kara.\n\n\"Leana and Storm will bring strong on and off-court leadership to the team and combined with the return from injury of Kayla Cullen and Kate Burley, they will be a handful for the opposition teams,\" Wills said.\n\nLeana De Bruin spent this year in Australia, playing for the Adelaide Thunderbirds. Photo / Getty\n\nAs well as Kara, Cullen and Burley, the Stars have also retained Maia Wilson, Holly Fowler and Ellen Halpenny from this year's team.\n\nDe Bruin and Purvis will join newbies Mila Reuelu-Buchanan - moving north from the Central Pulse - and Australian import Charlee Hodges.\n\nReuelu-Buchanan had a strong season with the winning Central Beko team and was an impact player for the Pulse. She was also a key player in the New Zealand Under-21 World Youth Cup team, forming a formidable partnership with Wilson.\n\nHodges has played the last two seasons with the Adelaide Thunderbirds, and Wills is excited to use her at her favoured goal attack position.\n\n\"She is exactly the kind of GA I like to work with and will fit into our game plans and strategies with Maia and Ellen very well. She's super quick and will go to the post,\" said Wills.\n\nThe Stars will be without midcourter Fa'amu Ioane, who has recently undergone an ACL reconstructive surgery, due to the quick turnaround of seasons ahead of June's Netball World Cup.\n\nShooter Paula Griffin will be taking a break from netball next year.\n\nNorthern Stars' 2019 ANZ Premiership squad:\n\nKate Burley, Kayla Cullen, Leana de Bruin, Holly Fowler, Ellen Halpenny, Charlee Hodges, Grace Kara, Storm Purvis, Mila Reuelu-Buchanan, Maia Wilson"}, {"url": "https://www.nowtolove.co.nz/celebrity/celeb-news/former-silver-fern-leana-de-bruin-on-why-shes-leaving-nz-34666", "page_content": "The netball star is moving across the ditch but vows she will return.\n\nIt’s one of those lessons you tend to learn with age – how to trust your gut. Former Silver Fern Leana de Bruin wishes she’d learnt it a little earlier in life, with the stunning netballer admitting there have been a few instances where a bit of trusting her first instincts would have come in handy. “I’ve learnt a few lessons along the way,” Leana says with a wry smile. So when it came to making the decision to move across the Tasman for a one-year contract with the Adelaide Thunderbirds, Leana (40) knew what she had to do – and three months later, the star defender knows her gut was 100% spot on. While it’s a big call to leave New Zealand – pulling her seven-year-old son Caleb out of his school and leaving her partner behind – Leana says she wasn’t quite ready to leave netball behind. Plus, she knew if she turned down this opportunity to play in Australia’s netball league, she’d always wonder, ‘what if?’. “I was definitely at a bit of a crossroads,” says Leana, who last year captained new team the Northern Stars in New Zealand’s new ANZ Premiership.\n\nCaleb is heading to Adelaide with Leana.\n\n“I was thinking, ‘ Do I retire? Do I go one more year?’ And then, all of a sudden, this came up. So I figured if they thought I was still good enough to be there, then I’d give it one more year. Plus, I still have a lot of fire in my belly.” She continues, “I did get a little overwhelmed making the decision. I did feel responsible for the Stars in some way – we didn’t do as well as we’d hoped this year and I know there’s huge potential. “But, at the same time, I’d reached the stage in my career where, and it sounds so horrible, I had to be a little bit selfish and do what I wanted.” So Leana and Caleb are preparing to make the move to Adelaide in the New Year, with the duo both very excited to experience a new city, culture and in Leana’s case, some of South Australia’s famous wine! “Well, I won’t be able to enjoy it too much during the season, but after the season is a different story!” she laughs.\n\nThe star represented New Zealand 104 times before retiring from international netball in 2016.\n\n“But we are really looking forward to it. I asked Caleb about it, because this would mean spending less time with his dad [Leana’s ex-husband Quinton]. But, as Caleb pointed out, it’s not forever and he said to me, ‘Mum, we’ll just FaceTime him!’ I video call my parents every Sunday in South Africa, it’s a bit of a tradition, so Caleb said, ‘If you do that with your mum and dad, I’ll do it with mine.’ It was very cute.” Leana, who describes herself as a farm girl who doesn’t have a lot of love for big cities, is adamant that this is a one-year move – home for both her and Caleb is their farmhouse in the Waikato. “I definitely can’t see myself living in Australia,” she tells. “I have a partner here. He was very supportive as well. He said if I didn’t do it, I’d regret it one day. It’s better to know than wonder! And Adelaide is only a flight away.” She acknowledges that playing for an Australian team for the first time in her career was a big decision. Leana, who has represented New Zealand 104 times and her native South Africa in 34 tests, feels a huge loyalty to Aotearoa and the people here who gave her the opportunities that have led her to this point."}, {"url": "https://www.starsnetball.co.nz/stars/news/stars-captain-confirmed.html", "page_content": "STARS CAPTAIN CONFIRMED\n\nLeana de Bruin will lead the Northern Stars for the inaugural season of the ANZ Premiership, named as the first captain of New Zealand’s newest professional sports team.\n\n\n\nWhile de Bruin says the news may not come as a huge surprise for some, coach Julie Hoornweg involved the rest of the team before making the decision. “Although it may be expected, you don’t know for sure how the other players feel” she said, “obviously I’m not getting any younger and Julie may have wanted to look to the future, so it’s a real privilege.”\n\n\n\nSenior midcourter Courtney Tairi and young defender Holly Fowler will support de Bruin as part of a leadership group.\n\n\n\nThe Silver Ferns centurion, who has now retired from international netball, is relishing the chance to lend her experience, tactical nous and professional attitude to the Stars, and is excited by the young talent in the team. “It’s great to see how they take on board what you tell them” de Bruin said, “I’m looking forward to seeing how they continue to grow.”\n\n\n\nde Bruin is eager to see how it all comes together on court when the Stars join the other five ANZ Premiership teams for the pre-season tournament at Te Wānanga o Raukawa in Otaki. “We haven’t played together at all, so I have no idea what to expect, but every week we’ve become fitter, more agile and used to the way Julie trains. She’s really open and honest, and there are no shortcuts”, de Bruin said of Hoornweg’s style. “It’s a bit of old-school.”\n\n\n\nThe pre-season tournament well be played on March 10-12 and the ANZ Premiership begins on March 26."}, {"url": "https://www.starsnetball.co.nz/stars/news/de-bruin-returns-to-northern-stars-captaincy-role.html", "page_content": "De Bruin returns to Northern Stars captaincy role\n\nNorthern Stars inaugural captain Leana De Bruin returns to lead the team in the 2019 ANZ Premiership, with Ellen Halpenny named vice-captain.\n\nDe Bruin, 41, returns to the squad after captaining the Adelaide Thunderbirds in the 2018 Australian netball league.\n\n“I’m honoured to be in this position again with the support of Kiri and the team and I’m looking forward to the challenge,” says De Bruin.\n\nOver the first two ANZ Premiership seasons the Stars have managed four wins each year, a statistic De Bruin is hungry to turn around.\n\n“Last time I was captain of the Stars the results weren’t that great, but I believe we have a team to really push to go far this year and build our younger players for the future.”\n\nHead Coach Kiri Wills says De Bruin’s selection was a no brainer for the management team who made the final decision.\n\n“Leana has huge leadership experience and I know the younger players in our team will thrive under her guidance.”\n\nWills added, “in terms of vice captaincy, we felt that Ellen was here in 2018, she understands what my coaching philosophy is about and where the Stars are heading as a franchise. Ellen is also a great team player who is not afraid to have tough conversations with her team mates.”\n\nDe Bruin and Halpenny played together previously for four seasons at the WBOP Magic between 2013 – 2016 and represented New Zealand at the 2014 Commonwealth Games.\n\n“Ellen has really matured since our earlier years of playing together, she’s such a smart player and tells you how it is and I’m excited to see how she grows in this role,” says De Bruin.\n\nHalpenny was shocked at the unexpected selection and says she’s excited at the opportunity to lead a great group of players.\n\n“I definitely wasn’t expecting this, but it’s an honour especially with a slightly new team. Every player brings something different to the team and that’s a huge part of the Stars culture, we accept differences and keep moving forward together,” says Halpenny.\n\nThe Northern Stars will play the Northern Mystics on Saturday 2nd February in Whangarei in an open to the public pre-season game, before all teams gather in Otaki for the ANZ Premiership pre-season tournament from 8-10 February.\n\nNorthern Stars ANZ Premiership season memberships now on sale here."}, {"url": "https://www.stuff.co.nz/sport/netball/97286144/a-day-in-the-life-of-former-silver-fern-leana-de-bruin", "page_content": "Leana de Bruin arrived in New Zealand from South Africa to play for the Ferns aged 23. De Bruin, now 40, has been playing netball for various regional teams ever since, and lives on a farm in the Waikato.\n\nEach week we ask a well-known Kiwi to share a photo memory. Leana de Bruin, a former Silver Fern who will play for Adelaide next year, is a commentator for this month's Constellation Cup.\n\nLEANA: I must confess I had to put a brave face on, being the new kid on the block from South Africa. My English wasn't the greatest and I was quite shy. I didn't feel very well on our little boat trip over there, but I had to be brave because I didn't want to come across as a bit of a wuss. We went for a few runs in the Stewart Island bush, which was pretty cool, because not many people go there.\n\nIn 1999, the World Champs was played in Christchurch and I played for South Africa then. They chose a world sevens team to come and play against New Zealand in 2000.\n\nSUPPLIED Leana De Bruin is pictured with Bernice Mene, on a Stewart Island beach, during a team photo shoot in 2003.\n\nOur manager for that team was one of the ladies down in Invercargill. She asked if I'd like to come and play for a season in New Zealand. I was like, \"Oh why not?\"\n\nREAD MORE:\n\n* Leana de Bruin links with Adelaid Thunderbirds\n\n* In my beauty bag: Silver Fern Leana de Bruin\n\nI had no idea what Invercargill was like. My brother's a pilot in South Africa and one of his co-workers was from New Zealand. When I told him I was going to Invercargill, he looked at me like, \"What have you done!\"\n\nNetball in South Africa wasn't very good and I thought it was a great opportunity to come and learn from the Kiwis. I was pretty nervous, I'm not going to lie about that, especially as my English wasn't great. I knew the basics to help myself but certainly didn't back myself to hold a conversation. Being put into a team with legends like Bernice (Mene) and Lesley Nicol, and Donna Loffhagen, and Adine Wilson - those are big names I'd looked up to and all of a sudden I was in their team.\n\nThey'd come through the ranks together and they'd been there for a while, but they were awesome - Kiwis are just so amazing making you feel welcome.\n\nI find Kiwis talk really fast. (Now I'm one of those who talks really fast when I get excited.) So I had to listen really carefully. But it wasn't so bad because at the end of the day all I needed to understand in English on the netball court is netball terms, which wasn't a problem. It was more in the day-to-day conversations, the confidence thing was a barrier.\n\nWe only played one season together and then she stopped but what I do really remember about Bernice is her laugh - she's got a really contagious laugh. She was real down-to-earth; she was an idol for lots of people and an amazing player but she didn't let that go to her head, she was humble and easy to talk to. She was the one who really explained stuff to me. She didn't get frustrated, she was willing to help.\n\nThe challenging thing for me last year when I did commentating for the first time was, I'd just got out of the team, and I had to talk about my teammates. It does make it challenging to commentate when things aren't going right. But at the end of the day, I've got a different hat on now and that's kind of how I see it. I told them: \"Just play well, then I don't have to say bad things about you.\" Easy.\n\nThe Constellation Cup screens on SKY Sport 3 on October 8 at 2pm, and on SKY Sport 2 on October 11 at 9.30pm, and on October 14 at 5pm."}, {"url": "https://www.stuff.co.nz/sport/netball/4992413/Southern-Steel-star-named-in-dream-team", "page_content": "ALL STAR: Leana de Bruin was a tower of strength in an underperforming Southern Steel side all season.\n\nLeana de Bruin was a tower of strength in an underperforming Southern Steel side all season and has been rewarded with selection in the inaugural trans-Tasman netball All Star Team.\n\nde Bruin saw off the challenge of outstanding Queensland Firebirds defender Laura Geitz to claim the goal keep spot in the paper team. She was one of three Kiwi players to be picked, along with Northern Mystics' duo Anna Scarlett and New Zealand netball's rising star Kayla Cullen. Former internationals Tania Dalton and Liz Ellis and a panel of netball writers selected the team.\n\nde Bruin had arguably the most impressive season of her netball career this year and was at the top of the trans-Tasman league statistics for intercepts and deflections.\n\nShe formed a formidable combination in the Steel defensive circle with Te Huinga Reo Selby-Rickit.\n\nWith the world championships in Singapore in July and so much competition for places in the Silver Ferns' defensive end, de Bruin said she targeted a strong season in her bid to make the New Zealand goal keep position her own.\n\nThe 44-cap Silver Fern was playing down her selection in the ANZ Championship All Star team yesterday, however.\n\n\"It was a bit of a surprise. I thought Laura Geitz would have been there. She had a very good season. I think in probably two or three games, I could have done better. It was pretty good from a personal point of view (this season), but hard from a team point of view.\"\n\nde Bruin has been with Steel for two years and the franchise will be doing everything they can to retain her for 2012.\n\nThe 33-year-old is based in Hamilton and has previously said that Steel coach Robyn Broughton was a key factor in her decision to commute to Invercargill.\n\nWith a question mark over Broughton's future as Steel coach, de Bruin could be tempted to sign for a North Island franchise.\n\nWhen asked about her future with Steel yesterday, she remained non-committal.\n\n\"That's really hard for me to answer. I don't know, we'll have to wait and see. I've got to look after myself.\"\n\nMeanwhile, applications for Steel's head coaching job closed yesterday and interviews will be conducted on Saturday by Tracey Fear from Netball New Zealand's high-performance programme, Southern TeamCo board member Doreen Evans, Steel boss Julie Paterson and former Silver Ferns coach Dame Lois Muir.\n\nPaterson was reluctant to confirm the exact number of applications, but The Southland Times understands five people applied, with several expressions of interest.\n\nBroughton has not returned calls all week and the chances of her re-applying for her old job seem unlikely.\n\nMagic assistant coach and former Steel assistant coach Marg Foster confirmed last night she had not put her hat in the ring.\n\n\"I loved my time down there. If Rob (Broughton) had retired, I could've put my name in. I don't think it's appropriate, though, with the loyalty type of thing.\"\n\nFoster had applied for the Canterbury Tactix coaching role and met franchise boss Peter Smith last week.\n\nSteel assistant coach Jo Cunningham said she had decided not to apply and would coach Southland in this year's NPC competition again with Reinga Te Huia. \"I mulled it over for a bit. I'm feeling comfortable with the decision,\" she said.\n\nNew Zealand under-21 coach Janine Southby and former Southland NPC coach and current New Zealand secondary schools assistant coach Natalie Avellino are believed to have applied for the position.\n\nbrendon.egan@stl.co.nz\n\nGS, Romelda Aiken (Firebirds); GA, Sharelle McMahon (Vixens); WA, Emily Beaton (Thunderbirds); C, Natalie von Bertouch (Thunderbirds); WD, Kayla Cullen (Mystics); GD, Anna Scarlett (Mystics); GK, Leana de Bruin (Steel).\n\nCoach, Roselee Jencke (Firebirds)"}, {"url": "https://www.stuff.co.nz/sport/netball/89724673/leana-de-bruin-to-captain-northern-stars-in-maiden-season", "page_content": "The former Silver Fern Leana de Bruin will be a player the Northern Stars rely on heavily in their first season.\n\nLeana de Bruin has been named the inaugural captain of New Zealand's newest netball team, the Northern Stars.\n\nThe 39-year-old de Bruin retired from international netball last year, having played 104 tests for New Zealand and 34 for South Africa. She played for Waikato-Bay of Plenty Magic last year, before deciding to head north and join the fledgeling team.\n\nGiven her experience, de Bruin was the natural choice to lead the Stars in their first campaign in the newly formed ANZ Championship.\n\n\"Although it may be expected, you don't know for sure how the other players feel\" de Buin said.\n\nREAD MORE\n\n* De Bruin set to return for Magic\n\n* Busy times for Solia\n\n* Langman enjoying starting from scratch\n\n\"Obviously I'm not getting any younger and Julie (Hoornweg, Stars coach) may have wanted to look to the future, so it's a real privilege.\"\n\nSenior midcourter Courtney Tairi will support de Bruin as vice captain.\n\nDe Bruin says she's looking forward to passing on everything she's learned about the game to the younger players in this team.\n\n\"It's great to see how they take on board what you tell them\" de Bruin said, \"I'm looking forward to seeing how they continue to grow.\"\n\nDe Bruin says she's eager to see how it all comes together on court when the Stars join the other five teams for the pre-season tournament at Te Wānanga o Raukawa in Otaki.\n\n\"We haven't played together at all, so I have no idea what to expect,\" she said.\n\n\"But every week we've become fitter, more agile and used to the way Julie trains. She's really open and honest, and there are no shortcuts, it's a bit of old-school.\""}, {"url": "https://www.stuff.co.nz/sport/rugby/super-rugby/118627943/former-silver-fern-leana-de-bruin-trades-netball-for-rugby-working-at-the-chiefs", "page_content": "The Chiefs have taken a punt on a rookie ahead of the 2020 Super Rugby season, throwing a work lifeline to former Silver Fern Leana de Bruin.\n\nAfter a stellar career on the netball court, the 42-year-old has switched codes, to now be employed as the club's commercial executive, in a role she hopes is a first step on the way to one day running a sporting franchise herself.\n\nDe Bruin played 104 tests for New Zealand, following 34 for her native South Africa, featuring at five World Cups and three Commonwealth Games. Her last game on the domestic scene was the Northern Stars' ANZ Premiership grand final loss to the Central Pulse in June last year.\n\nMARTY MELVILLE/PHOTOSPORT Last year's ANZ Premiership grand final loss with the Northern Stars was Leana de Bruin's final domestic netball game.\n\nAnd then came the stark realisation - 'I need to find a job'.\n\nREAD MORE:\n\n* 'Holiday's over' for Barrett\n\n* Fatialofa's surgery success\n\n* Sopoaga deal 'a clumsy mistake'\n\n* Carbery in doubt for Ireland\n\nDe Bruin told Stuff that when an opportunity she had eyed up fell through, things became \"a bit of a panic\", with a CV not featuring much aside from 'netball player'.\n\nShe had completed a degree in communications in 2007, but in being a single mum (to now 10-year-old son Caleb) living on a farm, and with plenty of sporting commitments, never really felt the time, or need, to put it into action.\n\nGETTY IMAGES Leana de Bruin played 104 tests for the Silver Ferns, after 34 for South Africa.\n\n\"That was probably the biggest thing for me, realising that you can have a degree but if you don't have the experience, it's quite hard to get in a role to get your income at a level that you're used to,\" de Bruin said.\n\n\"So that was a big shock for me.\"\n\nNow she's just thankful the Chiefs handed her a debut in August last year.\n\nAdvertising for the new role, the club didn't get a desired candidate in the first round of recruitment, before Judy Clement - the Chiefs' previous personal development manager - suggested de Bruin, who she had connections with, might be a good fit. A meeting with chief executive Michael Collins and general manager commercial Kate Shirtcliff sealed the deal.\n\nBut as good as that worked out, it's certainly not the way de Bruin advises any other athletes to go about it.\n\nCHRIS SYMES/PHOTOSPORT Leana de Bruin has also tried her hand at some TV commentary work.\n\n\"If I look back now, I would probably do a few things differently,\" she said, noting she would be smarter with her money try harder to get work experience in her field.\n\n\"Even if I spent five hours a week [working] somewhere. But at the time you think 'Oh, it'll be alright and you'll be fine afterwards'. But it is a bit of a panic stage when your plan B doesn't quite happen, and that can happen even if you have signed the contract.\n\n\"I think that's the biggest lesson I can give any athlete out there - get the experience, so you don't go from what I used to earn to starting at the bottom, because that's quite frightening.\n\n\"But you live and you learn, and I'm just grateful for having that opportunity.\"\n\nCHRISTEL YARDLEY/STUFF Leana de Bruin, pictured with son Caleb, is now getting used to the oval ball.\n\nDe Bruin is not short on variety in her role. It has her looking after sponsors, taking care of a couple of accounts, helping run player promotions and the community engagement programme, as well as data entry to track the likes of sponsorship and tickets.\n\nOn game nights - which can be 12-hour-plus days - she will be in the corporate lounges coordinating with hosts, and be responsible for 800 to 1100 VIPs.\n\nShirtcliff admits \"it's kind of a baptism of fire\", but that her new recruit has been a fabulous addition. It also helps she's a familiar face, with many sponsors already having a rapport from her days at the Waikato-Bay of Plenty Magic.\n\n\"She's such a personable person and loves interacting with people, she's made for a role where she deals with people, for sure,\" Shirtcliff said.\n\nMARK TAYLOR/STUFF A 'people person' - Leana de Bruin's bubbly personality is one which is well suited to her new role.\n\n\"She's just got so much energy. And the thing I've been most impressed with is she just takes things on so quickly.\"\n\nDe Bruin said the job had been \"a big learning curve\" so far, with the biggest adjustment being the lack of downtime compared to what athletes are used to.\n\nHaving been on 'the other side' of the high performance environment, she has been given a rather different view, but definitely sees an overlap too.\n\n\"One thing that really stands out to me is how many people it really takes to make a game happen,\" she said.\n\n\"As an athlete you kind of just rock up and you play for your hour and for that hour you really need to perform. Since August I've been working on my first home game, which is in February.\n\nMARK BRAKE/GETTY IMAGES \"As an athlete you kind of just rock up and you play for your hour\" - Leana de Bruin now has a new appreciation of the work behind the scenes.\n\n\"There's a lot of stuff as an athlete that you don't even know that you do that helps you in the workforce.\n\n\"The pressures are the same - we've got to deliver good qualities to our sponsors and our fans out there, making quick decisions and stuff like that.\"\n\nLearning about all the different parts of the business has also been helpful for an aspirational de Bruin, who has reached the pinnacle in one field and now has high hopes to do similarly in another.\n\n\"I don't know whether I'm punching here, but being a CEO of a franchise would be awesome. My passion is sport and if I can run things well enough to be at the top that's where I would like to head.\""}, {"url": "https://www.stuff.co.nz/sport/netball/106484530/leana-de-bruin-returns-to-northern-stars-for-2019-national-netball-premiership", "page_content": "Leana de Bruin will be back in purple with the Northern Stars next season.\n\nFormer Silver Fern Leana de Bruin will return to the Northern Stars for next year's national netball premiership.\n\nThe Stars became the first franchise to reveal their playing roster for 2019 on Wednesday, with the veteran defender the most notable inclusion.\n\nDe Bruin captained the Stars in their first season, in 2017, but spent this year in Australia, playing for the Adelaide Thunderbirds, who finished last in Super Netball, losing all 14 of their matches.\n\nShe is one of four new faces for next year, joined by fellow international defender Storm Purvis, who moves across Auckland from the Northern Mystics; under-21 international midcourter Mila Reuelu-Buchanan, who moves north from the Central Pulse, where she was a fringe player; and young Australian shooter Charlee Hodges.\n\nREAD MORE: Grace Kara opens up on Silver Ferns snub\n\nMaia Wilson, Grace Kara, Kayla Cullen, Kate Burley, Holly Fowler and Ellen Halpenny will all return from this year's squad, which finished last on the ladder. Cullen didn't feature for the Stars in 2018 as she recovered from knee surgery.\n\n\"It is vital for the team to maintain such a solid core of athletes to ensure continuity and connections, this group will provide the back bone for our team,\" said coach Kiri Wills.\n\n\"Leana and Storm will bring strong on and off court leadership to the team and combined with the return from injury of Kayla Cullen and Kate Burley, they will be a handful for the opposition teams.\"\n\nMidcourter Fa'amu Ioane tore the anterior cruciate ligament in her left knee during the season just gone and her rehabilitation is set to rule her out for the 2019 season, which will begin early in the year with the Netball World Cup taking place in England in June.\n\nShooter Paula Griffin will be taking a break from the game in 2019, after an impressive campaign during the 2018 ANZ Premiership.\n\nEnglish captain Ama Agbeze, defender Olivia Coughlan and young midcourter Christina Oscar join them in not returning for next season.\n\nNorthern Stars' 2019 ANZ Premiership squad: Kate Burley, Kayla Cullen, Leana de Bruin, Holly Fowler, Ellen Halpenny, Charlee Hodges, Grace Kara, Storm Purvis, Mila Reuelu-Buchanan, Maia Wilson"}], "Leana de Bruin was the captain of the Silver Ferns from 2006 to 2011.": [{"url": "https://www.silverferns.co.nz/silver-ferns/history/centurions/leana-de-bruin.html", "page_content": "No nonsense defender Leana de Bruin fashioned a stellar career after making New Zealand her home in 2000.\n\nA player who got better with age, the in-circle defender began her international career in South Africa where she played in 34 Tests for her country of birth.\n\nOnce cemented in the Silver Ferns, there was no stopping the hard-working defender who led by example with her consistently strong performances.\n\nAble to play both in-circle defensive positions with equal authority, the willowy de Bruin delivered on all fronts, backing up her tight and effective circle presence with strong through-court drives and support play.\n\nNaturally athletic, de Bruin’s mobility, strength in the air, long reach and uncompromising attitude were the perfect assets for a top line defender.\n\nDe Bruin thrived with age and responsibility to become a fine on-court leader. She notched a significant personal milestone at Netball World Cup SYDNEY 2015 when becoming the fifth Silver Fern to achieve 100 Test Caps.\n\nDe Bruin is one of a select group to have played in five Netball World Cups – 1999 (for South Africa) and 2003, 2007, 2011 and 2015 (for the Silver Ferns). She has also played in the 2006, 2010 and 2014 Commonwealth Games."}, {"url": "https://www.stuff.co.nz/sport/netball/97286144/a-day-in-the-life-of-former-silver-fern-leana-de-bruin", "page_content": "Leana de Bruin arrived in New Zealand from South Africa to play for the Ferns aged 23. De Bruin, now 40, has been playing netball for various regional teams ever since, and lives on a farm in the Waikato.\n\nEach week we ask a well-known Kiwi to share a photo memory. Leana de Bruin, a former Silver Fern who will play for Adelaide next year, is a commentator for this month's Constellation Cup.\n\nLEANA: I must confess I had to put a brave face on, being the new kid on the block from South Africa. My English wasn't the greatest and I was quite shy. I didn't feel very well on our little boat trip over there, but I had to be brave because I didn't want to come across as a bit of a wuss. We went for a few runs in the Stewart Island bush, which was pretty cool, because not many people go there.\n\nIn 1999, the World Champs was played in Christchurch and I played for South Africa then. They chose a world sevens team to come and play against New Zealand in 2000.\n\nSUPPLIED Leana De Bruin is pictured with Bernice Mene, on a Stewart Island beach, during a team photo shoot in 2003.\n\nOur manager for that team was one of the ladies down in Invercargill. She asked if I'd like to come and play for a season in New Zealand. I was like, \"Oh why not?\"\n\nREAD MORE:\n\n* Leana de Bruin links with Adelaid Thunderbirds\n\n* In my beauty bag: Silver Fern Leana de Bruin\n\nI had no idea what Invercargill was like. My brother's a pilot in South Africa and one of his co-workers was from New Zealand. When I told him I was going to Invercargill, he looked at me like, \"What have you done!\"\n\nNetball in South Africa wasn't very good and I thought it was a great opportunity to come and learn from the Kiwis. I was pretty nervous, I'm not going to lie about that, especially as my English wasn't great. I knew the basics to help myself but certainly didn't back myself to hold a conversation. Being put into a team with legends like Bernice (Mene) and Lesley Nicol, and Donna Loffhagen, and Adine Wilson - those are big names I'd looked up to and all of a sudden I was in their team.\n\nThey'd come through the ranks together and they'd been there for a while, but they were awesome - Kiwis are just so amazing making you feel welcome.\n\nI find Kiwis talk really fast. (Now I'm one of those who talks really fast when I get excited.) So I had to listen really carefully. But it wasn't so bad because at the end of the day all I needed to understand in English on the netball court is netball terms, which wasn't a problem. It was more in the day-to-day conversations, the confidence thing was a barrier.\n\nWe only played one season together and then she stopped but what I do really remember about Bernice is her laugh - she's got a really contagious laugh. She was real down-to-earth; she was an idol for lots of people and an amazing player but she didn't let that go to her head, she was humble and easy to talk to. She was the one who really explained stuff to me. She didn't get frustrated, she was willing to help.\n\nThe challenging thing for me last year when I did commentating for the first time was, I'd just got out of the team, and I had to talk about my teammates. It does make it challenging to commentate when things aren't going right. But at the end of the day, I've got a different hat on now and that's kind of how I see it. I told them: \"Just play well, then I don't have to say bad things about you.\" Easy.\n\nThe Constellation Cup screens on SKY Sport 3 on October 8 at 2pm, and on SKY Sport 2 on October 11 at 9.30pm, and on October 14 at 5pm."}, {"url": "https://www.stuff.co.nz/sport/netball/83250423/silver-fern-leana-de-bruin-retires-from-international-netball", "page_content": "Leana De Bruin snares the ball for the Silver Ferns as she is pushed by Jamaican superstar Jhaniele Fowler-Reid at the Commonwealth Games in Glasgow.\n\n﻿\n\nSilver Fern Leana de Bruin has called time on her international netball career.\n\nThe defender announced her retirement on Wednesday, saying her body was telling her it was the right time to walk away after nearly 20 years competing at the test level.\n\nAnthony Au-Yeung/ Photosport.nz Leana de Bruin and Casey Kopua eye each other during the national anthem singing ahead of a test against South Africa.\n\nIt brings to a close her impressive international career which included 138 tests - 104 for New Zealand and 34 for her country of birth, South Africa.\n\nThe 39-year-old has been a world champion and Commonwealth Games gold medallist. She played at three Commonwealth Games (2006, 2010, 2014) and a record five World Cups (1999 with South Africa and 2003, 2007, 2011 and 2015 with New Zealand).\n\nREAD MORE:\n\n* Netball hopefuls to learn selection fate in letter\n\n* Noeline Taurua opens up on Silver Ferns snub, move to Aussie\n\n* Southern Steel defender Jane Watson could be on Silver Ferns' radar\n\nLeana de Bruin is looking forward to being a rugby-mum watching her son Caleb de Bruin after retiring from international netball.\n\nAfter a strong season with the Magic in the Trans-Tasman Championship, which saw her lead her team to back-to-back New Zealand conference titles, de Bruin said she felt the time was right.\n\n\"I have had a fantastic season with the Magic and an incredible career with the Silver Ferns. I came into trials ready to give it my best, but my body was telling me it was time,\" de Bruin said.\n\nMatt King Leana de Bruin played 104 tests for the Silver Ferns since her debut in 2003.\n\n\"When I first pulled on the black dress in 2003 against England I never would have thought I'd go on to play 100 test matches for the Silver Ferns. The support that I have received along this journey is something that I will forever be grateful for.\n\n\"This is the end of one very long and memorable chapter, but for now I'm looking forward to further ways I can give back to netball and of course being a rugby mum and spending more time with my son Caleb. We're both excited about the adventures we have in front of us.\"\n\n\n\nSilver Ferns coach Janine Southby said de Bruin was an incredible servant to the game.\n\n\n\n\"De Bruin has had a remarkable Netball career and has been a cornerstone of the Silver Ferns defensive end for over a decade,\" she said.\n\n\"Her passion for the game and the Black Dress is an example to all, as is her work ethic, leadership and determination to be the best.\"\n\nde Bruin had a nomadic career in the provincial form of the game.\n\nShe spent time at the Southern Sting, Capital Shakers, Waikato-Bay of Plenty Magic and the Northern Force in the old National Bank Cup.\n\nShe played for the Northern Mystics, the Magic and the Southern Steel in the Trans Tasman Championship."}, {"url": "https://www.chiefs.co.nz/news-item/former-silver-fern-leana-de-bruin-shifts-career-to-chiefs-rugby-club", "page_content": "Former international netballer Leana de Bruin has shifted her career from the netball court to the high paced commercial environment of the Chiefs Rugby Club.\n\n\n\nDe Bruin forged her career in netball, having been an international netballer for 16 years. The in-circle defender began her international career in South Africa where she played 34 Tests for her country of birth. De Bruin made New Zealand home in 2001.\n\n\n\nDebuting for the Silver Ferns in February 2003 against the England Roses was the start of a stellar career for the hard-working defender. Consistently a strong performer, she was a tight and effective circle defender who provided powerful through-court drives and support play.\n\n\n\nShe notched a significant personal milestone at the 2015 Netball World Cup in Sydney when becoming the fifth Silver Fern to achieve 100 Test Caps.\n\n\n\nDe Bruin is one of a select group to have played in five Netball World Cups – 1999 (for South Africa) and 2003, 2007, 2011 and 2015 (for New Zealand). She has also played in the 2006, 2010 and 2014 Commonwealth Games.\n\n\n\nDe Bruin hung up her netball shoes following her final season in the ANZ Premiership with the Northern Stars in 2019. In September 2019, De Bruin’s career shifted from the netball court to the high paced environment of the Chiefs Rugby Club. The newly appointed Commercial Executive for the Club is striving in her new role. With a focus on connecting with sponsors and co-ordinating sponsor events alongside player community engagements, her bubbly personality and hard-working attitude is proving to be a valuable asset to the Chiefs Rugby Club."}, {"url": "https://www.nowtolove.co.nz/celebrity/celeb-news/former-silver-fern-leana-de-bruin-on-why-shes-leaving-nz-34666", "page_content": "The netball star is moving across the ditch but vows she will return.\n\nIt’s one of those lessons you tend to learn with age – how to trust your gut. Former Silver Fern Leana de Bruin wishes she’d learnt it a little earlier in life, with the stunning netballer admitting there have been a few instances where a bit of trusting her first instincts would have come in handy. “I’ve learnt a few lessons along the way,” Leana says with a wry smile. So when it came to making the decision to move across the Tasman for a one-year contract with the Adelaide Thunderbirds, Leana (40) knew what she had to do – and three months later, the star defender knows her gut was 100% spot on. While it’s a big call to leave New Zealand – pulling her seven-year-old son Caleb out of his school and leaving her partner behind – Leana says she wasn’t quite ready to leave netball behind. Plus, she knew if she turned down this opportunity to play in Australia’s netball league, she’d always wonder, ‘what if?’. “I was definitely at a bit of a crossroads,” says Leana, who last year captained new team the Northern Stars in New Zealand’s new ANZ Premiership.\n\nCaleb is heading to Adelaide with Leana.\n\n“I was thinking, ‘ Do I retire? Do I go one more year?’ And then, all of a sudden, this came up. So I figured if they thought I was still good enough to be there, then I’d give it one more year. Plus, I still have a lot of fire in my belly.” She continues, “I did get a little overwhelmed making the decision. I did feel responsible for the Stars in some way – we didn’t do as well as we’d hoped this year and I know there’s huge potential. “But, at the same time, I’d reached the stage in my career where, and it sounds so horrible, I had to be a little bit selfish and do what I wanted.” So Leana and Caleb are preparing to make the move to Adelaide in the New Year, with the duo both very excited to experience a new city, culture and in Leana’s case, some of South Australia’s famous wine! “Well, I won’t be able to enjoy it too much during the season, but after the season is a different story!” she laughs.\n\nThe star represented New Zealand 104 times before retiring from international netball in 2016.\n\n“But we are really looking forward to it. I asked Caleb about it, because this would mean spending less time with his dad [Leana’s ex-husband Quinton]. But, as Caleb pointed out, it’s not forever and he said to me, ‘Mum, we’ll just FaceTime him!’ I video call my parents every Sunday in South Africa, it’s a bit of a tradition, so Caleb said, ‘If you do that with your mum and dad, I’ll do it with mine.’ It was very cute.” Leana, who describes herself as a farm girl who doesn’t have a lot of love for big cities, is adamant that this is a one-year move – home for both her and Caleb is their farmhouse in the Waikato. “I definitely can’t see myself living in Australia,” she tells. “I have a partner here. He was very supportive as well. He said if I didn’t do it, I’d regret it one day. It’s better to know than wonder! And Adelaide is only a flight away.” She acknowledges that playing for an Australian team for the first time in her career was a big decision. Leana, who has represented New Zealand 104 times and her native South Africa in 34 tests, feels a huge loyalty to Aotearoa and the people here who gave her the opportunities that have led her to this point."}, {"url": "https://www.nzherald.co.nz/sport/news/article.cfm?c_id=4&objectid=12111686", "page_content": "Leana de Bruin is set to return to the national league. Photo / Photosport\n\nLeana de Bruin is set to return to the national league. Photo / Photosport\n\nFormer Silver Fern Leana De Bruin will return to the ANZ Premiership next year.\n\nDe Bruin, 41, was one of four new faces named in the Northern Stars squad for the 2019 season, after playing for Australia's Adelaide Thunderbirds this year.\n\nStars head coach Kiri Wills was excited by the return of her former captain alongside the signing of defender Storm Purvis from the Northern Mystics.\n\nWills said that in addition to their defensive talents, De Bruin and Purvis would also provide leadership support for 2018 captain Grace Kara.\n\n\"Leana and Storm will bring strong on and off-court leadership to the team and combined with the return from injury of Kayla Cullen and Kate Burley, they will be a handful for the opposition teams,\" Wills said.\n\nLeana De Bruin spent this year in Australia, playing for the Adelaide Thunderbirds. Photo / Getty\n\nAs well as Kara, Cullen and Burley, the Stars have also retained Maia Wilson, Holly Fowler and Ellen Halpenny from this year's team.\n\nDe Bruin and Purvis will join newbies Mila Reuelu-Buchanan - moving north from the Central Pulse - and Australian import Charlee Hodges.\n\nReuelu-Buchanan had a strong season with the winning Central Beko team and was an impact player for the Pulse. She was also a key player in the New Zealand Under-21 World Youth Cup team, forming a formidable partnership with Wilson.\n\nHodges has played the last two seasons with the Adelaide Thunderbirds, and Wills is excited to use her at her favoured goal attack position.\n\n\"She is exactly the kind of GA I like to work with and will fit into our game plans and strategies with Maia and Ellen very well. She's super quick and will go to the post,\" said Wills.\n\nThe Stars will be without midcourter Fa'amu Ioane, who has recently undergone an ACL reconstructive surgery, due to the quick turnaround of seasons ahead of June's Netball World Cup.\n\nShooter Paula Griffin will be taking a break from netball next year.\n\nNorthern Stars' 2019 ANZ Premiership squad:\n\nKate Burley, Kayla Cullen, Leana de Bruin, Holly Fowler, Ellen Halpenny, Charlee Hodges, Grace Kara, Storm Purvis, Mila Reuelu-Buchanan, Maia Wilson"}, {"url": "https://www.nowtolove.co.nz/health/fitness/temepara-bailey-leana-de-bruin-silver-ferns-out-of-retirement-40629", "page_content": "Bursting into the Weekly's photoshoot, a whirlwind of long limbs and tanned skin, Temepara Bailey and Leana de Bruin are a flurry of excitement. Fit, fabulous and raring to go, the former Silver Ferns are fresh from training. With only weeks to go until the first match of the ANZ Premiership, the newly minted Northern Stars teammates have been hitting the court hard in preparation. However, pulling on matching bibs and dresses – for the first time since 2011 – was never the plan for either Temepara (43) or Leana (41). \"Oh God, has it been that long since we last played together?!\" Leana asks Temepara, her eyes wide as she lets out an incredulous laugh. \"I think so!\" Temepara replies. \"Wow. Okay. Wow!\"\n\nTeammates once more! The friends played for the Silver Ferns for eight years.\n\nIn fact, it's officially been seven years since Temepara 'retired' from netball, however the pocket rocket midcourter − who's still stubbornly known in netball circles as 'Bubby', despite the fact she's now the grandmother of a four-year-old and a nine-month-old − can't seem to escape the game she loves. After answering an SOS from her former club, the Northern Mystics, in 2014, she's once again stepping up, this time to help out the Stars, a club she's also been assistant coach of for the last few years. The decision was huge – one that required her to move home from her new base in Thailand, and also one that asked for serious commitment to get her skills back up to a premier level. \"Yeah, I definitely didn't expect to be back!\" Temepara laughs. \"It was really because of Grace [Kara] getting pregnant, which was super-exciting. But now it's like, 'Wow. I have to get out there and practise what I preach!' As a coach and a commentator, you're always going on about what players should be doing, so now I have to make sure I'm doing it!\" \"I texted her when Grace had to withdraw,\" Leana adds, grinning. \"I remember saying, 'So, are you going to replace Grace?', not being serious or anything. And she texted back, saying, 'I am!' I rang her straight away and asked if she was serious. And she asks me, 'How do you feel about that?' I was like, 'It's awesome!'\"\n\nTemepara, who will combine her assistant coaching role with playing, admits she was a bit nervous about coming back and wasn't sure how both the netball community or the public would take the news \"But when Vlooi [Leana's nickname] said that, I felt great,\" she nods. \"I felt like I could breathe again!\""}, {"url": "https://www.nowtolove.co.nz/celebrity/celeb-news/silver-fern-leana-de-bruin-on-life-after-retirement-1854", "page_content": "Snuggling her six-year-old son Caleb, former Silver Fern Leana de Bruin (39) sighs with contentment. “I’m living the life!” she exclaims, tossing a ball to her rugby-mad little man in the backyard of their Hamilton home. After retiring from international netball last month, even Leana’s a little surprised at how happy she is post-Ferns. After all, it’s a team she was a part of for a staggering 14 years, notching up 104 test caps in the black dress, and before that, 34 for her native South Africa. It’s a game that’s given her everything – a career as a professional sportswoman, her closest friends and a new home in New Zealand. And apart from being Mum to the very energetic and vivacious Caleb, netball remains her greatest passion. Leana’s decision to hang up her now well-worn bib was incredibly tough but, as the 1.90m defender concedes, it was time.\n\n“My body couldn’t take it any more,” the no-nonsense netball stalwart says. “I went into the Silver Fern trials with an open mind, but my ankle was giving me grief the whole season. The Ferns environment is tough and I was battling. I couldn’t give 100 per cent, so I said to [Silver Ferns coach] Janine [Southby] before she made the final decision, I think it’s time. And it was. I was always going to be playing in pain and I didn’t want to do that any more.” Still, it was hard to let go of a 14-year tenure that’s seen her win a world championship, two Commonwealth Games and an ANZ Championship title. “Part of me still wanted to be a part of it,” she admits. “I wanted to finish on a game, rather than just randomly like I had to. But, unfortunately, you know, life takes funny turns. Everything happens for a reason.” And fate was the reason a 22-year-old Leana ended up in Aotearoa in the first place. After the 1999 World Championships, a World Seven invitational team was formed to play against the Silver Ferns in New Zealand, and Leana jumped at the chance to be a part of it.\n\n“The manager of that team was from Invercargill. I was chatting with her and I mentioned how cool it would be to come over and play in New Zealand, and then she asked me!” Three years later, Leana was a surprise selection for the Silver Ferns and lined up for her debut in 2003. Soon, she found herself up against her former team. “It was tough,” she nods. “The hardest part was hearing the South African national anthem. I couldn’t sing that, I had to sing the New Zealand one. That got the heartstrings, for sure. But for some reason, it also felt right, as hard as it was. I was immensely proud to be wearing that black dress.” Now Leana’s a true blue Kiwi – a fact reinforced by her New Zealand-born and All Black fanatic son Caleb, whom she’s thrilled to be spending more time with.\n\nLeana played for the Silver Ferns for the past 14 years.\n\n“He’s loving the fact I’m home a bit more now. Every afternoon, we’ll have a bit of a rugby game or a kicking contest in the backyard,” she says. “He knows everything there is to know about the All Blacks, he has the same birthday as Kieran Read, which he just thinks is the coolest thing ever. He’s playing rippa at the moment, but moves onto tackle rugby next year. “He does understand that I’m not playing with the Ferns any more, but he does keep asking when we’re going away again, because we’ve been used to travelling a lot! It is a little weird to him that all of a sudden, Mum’s home every weekend.” As far as a new plan goes, spending time with her son is at the top of Leana’s list, as well as being “a good tenant” and helping her landlords, Laurie and Jo, look after the farm and the animals. But Leana has found she’s been unable to let go of netball completely. While she currently can’t confirm if she is playing in either the new South Auckland-based team for the inaugural New Zealand elite league or is seeking an Australian contract, Leana reckons she might have one more year of domestic netball in her.\n\nAnd she’s also scored coaching gigs overseas, as well as ambassador work for Netball New Zealand. “I’m stuck in netball world!” she laughs. “I think I would have been totally depressed if I had to ask myself,\n\n‘What next?’, but the transition from player to ambassador has been quite easy. Netball New Zealand has been great.” Along with moving into a more mentor-based netball role, where she’s keen to share her experience and wisdom, she also has a very important event to plan – Caleb’s upcoming seventh birthday party. “I had planned to still be playing netball at the end of October, when his birthday is, so now that I’m not, we get to organise the party together, which is really exciting. This will only be the second time in his life that I’m home for his birthday because we’ve always been playing overseas.” She’s also looking forward to spending some more time with her new partner, who lives in South Auckland. “Yup, there’s a bit of a dude hanging around. It’s quite nice,” she says with a grin. “It’s kind of nice – well, it sounds horrible – but we’re not in each other’s face all the time! So the distance thing works. But it does help when you’re not playing; you have a bit more time to fit everything in and the headspace too.”\n\nWith her Silver Fern team mates.\n\nCaleb is keen on a caravan trip around the North Island too, but Leana admits she isn’t so sure about that plan. “Yeah, I don’t know how I feel about that,” she laughs. “I just don’t know if I’m brave enough to attempt it!” Still, Leana says she can’t quite shake a few old habits, such as keeping up with the gym sessions. “I know that sounds a bit weird, but I love training!” she tells. “Though now I can just cruise on the bike, instead of going a million miles an hour, and then afterwards, I have time to catch up with friends, have a coffee and go for a walk.”\n\nAnd while she’s blissfully happy with her new, less structured and more relaxed life, Leana knows netball will always be in her blood, and the woman her Silver Fern team-mates know as Vlooi will always be somewhere in the background, coaching, mentoring or simply as a fan. “Everyone needs a nickname in the team and mine was Vlooi,” explains Leana. “It actually means flea in Afrikaans... but I’m not tiny and I can’t jump that high. When Casey [Kopua] found that out, she started calling me fleabag.” Shaking her head, she continues, \"My maiden name is du Plooy and someone at my high school gave me that nickname because it rhymed. Irene [van Dyk] is probably the reason why it’s stuck!” It’s the friendships in the team that Leana will miss the most, especially with Irene, Maria Tutaia, Cathrine Latu, Grace Rasmussen and Anna Harrison."}, {"url": "https://www.stuff.co.nz/sport/rugby/super-rugby/118627943/former-silver-fern-leana-de-bruin-trades-netball-for-rugby-working-at-the-chiefs", "page_content": "The Chiefs have taken a punt on a rookie ahead of the 2020 Super Rugby season, throwing a work lifeline to former Silver Fern Leana de Bruin.\n\nAfter a stellar career on the netball court, the 42-year-old has switched codes, to now be employed as the club's commercial executive, in a role she hopes is a first step on the way to one day running a sporting franchise herself.\n\nDe Bruin played 104 tests for New Zealand, following 34 for her native South Africa, featuring at five World Cups and three Commonwealth Games. Her last game on the domestic scene was the Northern Stars' ANZ Premiership grand final loss to the Central Pulse in June last year.\n\nMARTY MELVILLE/PHOTOSPORT Last year's ANZ Premiership grand final loss with the Northern Stars was Leana de Bruin's final domestic netball game.\n\nAnd then came the stark realisation - 'I need to find a job'.\n\nREAD MORE:\n\n* 'Holiday's over' for Barrett\n\n* Fatialofa's surgery success\n\n* Sopoaga deal 'a clumsy mistake'\n\n* Carbery in doubt for Ireland\n\nDe Bruin told Stuff that when an opportunity she had eyed up fell through, things became \"a bit of a panic\", with a CV not featuring much aside from 'netball player'.\n\nShe had completed a degree in communications in 2007, but in being a single mum (to now 10-year-old son Caleb) living on a farm, and with plenty of sporting commitments, never really felt the time, or need, to put it into action.\n\nGETTY IMAGES Leana de Bruin played 104 tests for the Silver Ferns, after 34 for South Africa.\n\n\"That was probably the biggest thing for me, realising that you can have a degree but if you don't have the experience, it's quite hard to get in a role to get your income at a level that you're used to,\" de Bruin said.\n\n\"So that was a big shock for me.\"\n\nNow she's just thankful the Chiefs handed her a debut in August last year.\n\nAdvertising for the new role, the club didn't get a desired candidate in the first round of recruitment, before Judy Clement - the Chiefs' previous personal development manager - suggested de Bruin, who she had connections with, might be a good fit. A meeting with chief executive Michael Collins and general manager commercial Kate Shirtcliff sealed the deal.\n\nBut as good as that worked out, it's certainly not the way de Bruin advises any other athletes to go about it.\n\nCHRIS SYMES/PHOTOSPORT Leana de Bruin has also tried her hand at some TV commentary work.\n\n\"If I look back now, I would probably do a few things differently,\" she said, noting she would be smarter with her money try harder to get work experience in her field.\n\n\"Even if I spent five hours a week [working] somewhere. But at the time you think 'Oh, it'll be alright and you'll be fine afterwards'. But it is a bit of a panic stage when your plan B doesn't quite happen, and that can happen even if you have signed the contract.\n\n\"I think that's the biggest lesson I can give any athlete out there - get the experience, so you don't go from what I used to earn to starting at the bottom, because that's quite frightening.\n\n\"But you live and you learn, and I'm just grateful for having that opportunity.\"\n\nCHRISTEL YARDLEY/STUFF Leana de Bruin, pictured with son Caleb, is now getting used to the oval ball.\n\nDe Bruin is not short on variety in her role. It has her looking after sponsors, taking care of a couple of accounts, helping run player promotions and the community engagement programme, as well as data entry to track the likes of sponsorship and tickets.\n\nOn game nights - which can be 12-hour-plus days - she will be in the corporate lounges coordinating with hosts, and be responsible for 800 to 1100 VIPs.\n\nShirtcliff admits \"it's kind of a baptism of fire\", but that her new recruit has been a fabulous addition. It also helps she's a familiar face, with many sponsors already having a rapport from her days at the Waikato-Bay of Plenty Magic.\n\n\"She's such a personable person and loves interacting with people, she's made for a role where she deals with people, for sure,\" Shirtcliff said.\n\nMARK TAYLOR/STUFF A 'people person' - Leana de Bruin's bubbly personality is one which is well suited to her new role.\n\n\"She's just got so much energy. And the thing I've been most impressed with is she just takes things on so quickly.\"\n\nDe Bruin said the job had been \"a big learning curve\" so far, with the biggest adjustment being the lack of downtime compared to what athletes are used to.\n\nHaving been on 'the other side' of the high performance environment, she has been given a rather different view, but definitely sees an overlap too.\n\n\"One thing that really stands out to me is how many people it really takes to make a game happen,\" she said.\n\n\"As an athlete you kind of just rock up and you play for your hour and for that hour you really need to perform. Since August I've been working on my first home game, which is in February.\n\nMARK BRAKE/GETTY IMAGES \"As an athlete you kind of just rock up and you play for your hour\" - Leana de Bruin now has a new appreciation of the work behind the scenes.\n\n\"There's a lot of stuff as an athlete that you don't even know that you do that helps you in the workforce.\n\n\"The pressures are the same - we've got to deliver good qualities to our sponsors and our fans out there, making quick decisions and stuff like that.\"\n\nLearning about all the different parts of the business has also been helpful for an aspirational de Bruin, who has reached the pinnacle in one field and now has high hopes to do similarly in another.\n\n\"I don't know whether I'm punching here, but being a CEO of a franchise would be awesome. My passion is sport and if I can run things well enough to be at the top that's where I would like to head.\""}, {"url": "https://home.nzcity.co.nz/news/article.aspx?id=354836", "page_content": "Former Silver Fern Leana de Bruin is concerned with the development of New Zealand netball players\n\nFormer Silver Fern Leana de Bruin is concerned with the development of New Zealand netball players\n\n22 May 2022\n\nThe 44-year-old has featured in three matches in this year's ANZ Premiership, two for the Waikato Bay of Plenty Magic and one for the Stars.\n\n\n\nShe's expected to play for the Stars against the Mystics today, becoming the most capped player in the national netball league.\n\n\n\nDe Bruin says when she was asked to fill in, she assumed the Magic would have young up and coming players available.\n\n\n\n\n\n\n\nCentre pass is at 2:10pm.\n\n\n\nNETBALL COVERAGE WITH THE ANZ PREMIERSHIP - SUPPORT YOUR TEAM AND HEAD TO THE GAME.\n\n© 2023\n\nNewstalk ZB, NZCity"}]}