{"Alfred Fischer was the commandant of the Auschwitz concentration camp from May 1944 to November 1944.": [{"url": "https://www.pbs.org/auschwitz/40-45/beginnings/", "page_content": "Front gate of Auschwitz incorporating the phrase Arbeit Macht Frei, or “Work Makes You Free” (graphic reconstruction).\n\nAuschwitz,\n\nthe site of the largest mass murder in the history of the world\n\ndid not start out as a death camp. In the spring of 1940, Rudolf Höss, a captain in the SS (Schutzstaffel), the elite defense organization that answered only to Hitler and advanced his plans, became Commandant of a new Nazi concentration camp at the southwestern Polish town of Oswiecim. Auschwitz, as the Germans called it, was in territory that Hitler had invaded the previous year.\n\nPolish barracks (graphic reconstruction)\n\nHöss was directed to create a concentration camp for 10,000 prisoners, using old Polish army barracks, but as he later wrote in his memoirs, \"The task wasn’t easy. In the shortest possible time, I had to create a camp for 10,000 prisoners using the existing complex of buildings which were well constructed but were completely run down and swarming with vermin.\"\n\n\u0093True opponents of the state had to be securely locked up... Only the SS were capable of protecting the National Socialist State from all internal danger. All other organizations lacked the necessary toughness.\u0094 \u0096 Memoirs of Rudolf Höss, Commandant of Auschwitz\n\nA column of prisoners on a work assignment in Auschwitz\n\nAuschwitz I, as the camp came to be called, was built primarily to confine and oppress Polish dissidents whom the Nazis considered to be a threat to their occupation. Polish Jews were confined elsewhere, increasingly in ghettos. Höss adopted the motto of Dachau, another concentration camp where he had previously worked: Arbeit Macht Frei (\"Work Makes You Free\").\n\n\u0093Watch your bread so that no one steals it. This is what you were preoccupied with, and this was a constant vigilance.\u0094 \u0096 Kazimierz Piechowski, Polish political prisoner, Auschwitz\n\nThe Polish prisoners were subjected to appalling treatment from the SS. More than 10,000 died within twenty months. The camp received little support from Nazi headquarters and Höss often had to scrounge for supplies.\n\nJerzy Bielecki was one of the first Polish prisoners at Auschwitz. The SS thought he was with the Polish resistance and sentenced him to “hanging torture,” a brutal punishment where the prisoner carried his full body weight on his arms that were pulled behind his back in an unnatural position.\n\nJerzy Bielecki Polish political prisoner at Auschwitz \u0093He wanted to hang me on the hook. He said, ‘Stand up on your toes. Finally he hooked me and then he kicked the stool away without any warning. I just felt Jesus Mary, oh my God, the terrible pain. My shoulders were breaking out from the joints. Both arms were breaking out from the joints. I’d been moaning and he just said, \u0091Shut up you dog. You deserve it. You have to suffer.\u0092\u0094 More Witnesses\n\nWriting in his memoirs, Rudolf Höss admits that Auschwitz was a concentration camp where cruel and brutal treatment was routine. Despite this—during the early 1940s—the facility was almost a backwater in Nazi-occupied Poland.\n\nAuschwitz, however, was about to change. The town was situated on major railroad lines. Its surrounding area was rich in natural resources, particularly fresh water, lime, and coal. This made it an excellent location for IG Farben, the German industrial conglomerate, to build a factory that would manufacture war materials."}, {"url": "https://www.britannica.com/place/Buchenwald", "page_content": "Buchenwald, one of the biggest of the Nazi concentration camps established on German soil. Its name means “beech forest” in German, and it stood on a wooded hill about 4.5 miles (7 km) northwest of Weimar, Germany. Set up in 1937, it complemented the concentration camps of Sachsenhausen to the north and Dachau to the south and initially housed political prisoners and other targeted groups, including Jews.\n\nAs in those other camps, the population of Buchenwald increased rapidly after Kristallnacht in November 1938, when Jewish men aged 16–60 were arrested and incarcerated. Many of those prisoners were subsequently released if they could find a place to go outside of Germany.\n\nBritannica Quiz Pop Quiz: 17 Things to Know About World War II\n\nThe population of Buchenwald changed in number and composition. After the outbreak of World War II, Buchenwald continued to house political prisoners and, later, Poles. Most inmates worked as slave labourers at nearby work sites in 12-hour shifts around the clock. There were some 18,000 prisoners after Kristallnacht, 11,000 on the eve of the war, 63,000 by the end of 1944, and 86,000 in February 1945, when Buchenwald became the destination for some of the inmates forcibly evacuated from Auschwitz.\n\nBuchenwald gained infamy for many reasons. The camp was run with rigid discipline, and from 1939 to 1945 Ilse Koch—the “Witch of Buchenwald” and wife of the SS commandant Karl Otto Koch—was notoriously sadistic. Prisoners were ordered to be killed on a whim, and Ilse Koch reputedly had a penchant for the flayed skin of her victims, which she had made into household objects such as book covers and lampshades. Although there were no gas chambers, hundreds perished each month from disease, malnutrition, exhaustion, beatings, and executions. The bulk of the prisoners were starved and worked to the point of death in nearby stone quarries. Camp records indicate that throughout its existence some 240,000 prisoners from at least 30 countries were confined at Buchenwald. At least 10,000 were shipped to extermination camps, and some 43,000 people died at the camp.\n\nBeginning in 1942, Buchenwald contained an official department for medical research, the Division for Typhus and Virus Research of the Hygiene Institute of the Waffen-SS, whose doctors (such as Waldemar Hoven) and technicians tested the effects of viral infections and vaccines on inmates. Hoven and others were executed in 1948 for committing crimes against humanity.\n\nOn August 24, 1944, the U.S. Army Air Forces carried out an attack on a huge industrial complex adjacent to Buchenwald. The plant produced components for V-2 rockets, German “vengeance weapons” that were being used to attack civilian populations throughout Allied-controlled Europe. Although the bombing raid was one of the most precise in the war and the camp itself was not hit, hundreds of prisoners who were labouring in the factory were killed when SS guards refused to allow them to seek cover.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nOn April 6, 1945, some 28,500 prisoners were evacuated from Buchenwald on a death march on which one in four died. Just prior to the arrival of American troops—a patrol from the 6th U.S. Armored Division—on April 11, 1945, the German guards and officers fled, and inmates took over. Inmate officials were on hand to greet the liberating American troops later that day. The U.S. Army assumed control of the camp, but shortly afterward it was handed over to the Red Army because the camp now lay within the zone of Germany occupied by the Soviets. Renamed Camp No. 2, Buchenwald held German prisoners of war between 1945 and 1950, of whom 7,000 died.\n\nWhen the camp was closed in 1950, most of the buildings were destroyed, although some of the structures, such as concrete watch towers, remain. A temporary memorial, erected just after the liberation, was supplemented by a stone memorial in 1958."}, {"url": "https://www.auschwitz.org/en/museum/archives/collection/", "page_content": "Collection\n\nSignature of Dr... The collection held in the Archives of the Auschwitz-Birkenau State Museum can be divided into several parts: original documents created by camp offices while Auschwitz was in operation\n\noriginal documents created by Auschwitz prisoners outside the official camp bureaucratic structure (camp resistance movement material)\n\ncopies of documents related to Auschwitz, obtained from other institutions\n\npostwar source material (trial records, accounts and memoirs by former prisoners)\n\na collection of illustrations\n\nan audio-visual collection The documents held in the Archives were discovered for the most part on the grounds of the liberated camp or in places where they were clandestinely sent while the camp was operating. The Archives have obtained additional documents from former prisoners, their families, and various industrial facilities where there were Auschwitz sub-camps. The original documents held in the Archives represent only a part of the records produced in the camp offices during the war. As the front line approached, the Nazis hurriedly attempted to destroy as many documents as possible or to carry them away into the depths of the Reich, in order to remove evidence of the crimes committed in the camp. After liberation, the Red Army confiscated some of the records that the Germans had not managed to destroy, and shipped them to the former USSR. Some of those documents are preserved to this day in archives there.\n\nCAMP CHANCELLERY RECORDS The six departments that made up the camp administrative system produced original documents during the time when Auschwitz Concentration Camp was in operation, from the spring of 1940 to January 1945. These departments were: Department I – the office of the camp commandant\n\nDepartment II – political\n\nDepartment III – camp director\n\nDepartment IIIa – prisoner labor\n\nDepartment IV – administrative-economic\n\nDepartment V – camp hospitals In their offices, these departments created documents characteristic of their tasks.\n\nFirst page of the... Documents created in Department I (the office of the camp commandant) are related to overall matters connected with the SS garrison posted to Auschwitz. Examples of these records in the archives include: personnel files on some SS personnel from the Auschwitz camp garrison\n\na collection of the camp commandant’s orders from 1941-1944\n\ntelegrams about escapes of prisoners from Auschwitz\n\ntelegrams notifying next of kin about the deaths of prisoners in the camp\n\nthe log of remarks by the duty officer (Führer vom Dienst) with entries from May 18, 1941 to March 2, 1943\n\nDeath certificate... Documents from Department II (political department) are connected mainly with personal records on prisoners incarcerated in Auschwitz and the typical police functions of the department, including the punishment of prisoners. Especially noteworthy are: lists of the names of prisoners newly arrived in Auschwitz\n\nprisoner personal files\n\nprisoner death certificates\n\ndisciplinary reports, with requests for the punishment of prisoners\n\nEvidence book from... Department III (camp director) exercised administrative and disciplinary functions in regard to the prisoners. Noteworthy documents from this section include: the record book of the camp for Roma in Auschwitz II-Birkenau\n\nthe daily prisoner count book\n\nthe block no. 11 bunker record book\n\nprisoner block record books for blocks no. 4 and 16 in Auschwitz I and block no. 22 in the camp for female prisoners in KL Auschwitz II-Birkenau\n\nthe record book of the penal company\n\nfiles of deceased Soviet prisoners of war\n\nA prisoner's... Department IIIa dealt with all matters connected with labor assignments for the prisoners in the camp. The most important documents from this department include: correspondence among the Auschwitz labor department, various Third Reich administrative organs, and other Nazi concentration camps on matters connected with prisoner labor\n\npersonal card files on prisoners kept by the labor department (the Museum holds only copies of documents obtained from archives in Moscow)\n\nlists of bonuses for prisoners assigned to specific labor details\n\nlists of labor assignments for male and female prisoners\n\ncard files on prisoners employed in the camp as electricians and metalworkers/machinists\n\nList of property of... Department IV (administrative-economic) dealt with general matters connected with supplies of food and clothing for both SS personnel and Auschwitz prisoners. The documents connected with the functioning of this department include: the supply of fuel needed in the crematorium\n\npasses for trips by trucks sent from Auschwitz to various places (including the plant in Dessau that produced Zyklon-B gas);\n\ncard files on the outfitting and equipment of SS personnel in the camp garrison\n\ncorrespondence with next of kin of deceased prisoners concerning belongings left on deposit in the camp\n\nHospital registry... Department V was responsible for health care for the SS camp garrison. Medical care for prisoners was limited to rudimentary medical facilities commonly referred to as “hospitals.” Typical documents for this department included: record books for the camp hospitals, of which there are extant fragments for blocks no. 20, 21, and 28 at Auschwitz\n\nreports from the camp hospital on the deaths of prisoners\n\nthe record books of the camp X-ray station\n\nlists of the camp numbers of deceased prisoners\n\nreports on the removal of gold dental work from corpses of deceased prisoners\n\nvarious records from the camp hospitals in Auschwitz II-Birkenau\n\nthe record books of the prisoner hospital from Auschwitz III-Monowitz Concentration Camp in Monowice\n\ncard files with medical records of prisoners\n\na record book of deceased Soviet POWs\n\nLudwik... PRISONER CORRESPONDENCE A collection of camp correspondence by prisoners represents a separate section of the original documentation. These are camp letters and camp postcards sent through official channels from Auschwitz prisoners to their relatives in the outside world. For this official correspondence, prisoners were required to use special forms that they purchased at the camp commissary. Since they were subject to censorship by the camp administration, the letters and postcards sent by prisoners were required to be written in German. Jewish prisoners, like Soviet POWs, were denied the possibility of corresponding with their families.\n\nSS-Hygiene Institut... SS HYGIENE INSTITUTE RECORDS The archival collection also includes documentation connected with the SS and Police Hygiene Institute in Oświęcim (Hygiene Institut der Waffen-SS und Polizei Auschwitz O/S). Founded in the fall of 1942 as a branch of the SS Main Hygiene Bureau, it was subordinated to the SS Main Sanitary Bureau (SS-Hauptsanitäramt) in Berlin. It was based in the Auschwitz I Main Camp until the spring of 1943, when it was transferred to Rajsko, where it functioned until evacuation in January 1945. The Hygiene Institute performed all hygienic and bacteriological laboratory work for local SS, Wehrmacht, and police units, as well as for concentration camps (the entire Auschwitz-Birkenau complex including the sub-camps, and also Gross-Rosen Concentration Camp). The Institute analyzed samples of blood and other bodily fluids collected from camp prisoners, the SS garrison troops and their families, and armed SS and Wehrmacht formations stationed in the Oświęcim area. The analysis was mainly intended to detect cases of typhus, malaria, and syphilis. Prisoners assigned to kommandos (labor details) providing services to the Auschwitz SS garrison (in the SS kitchens and clothing and equipment stores) were subject to frequent testing. The SS Hygiene Institute had the following laboratories: bacteriological, chemical, biological, histological, serological, Wassermann, and climatological, as well as a laboratory in block no. 20 in the Auschwitz I camp and a section that produced growth media for bacteria cultures. Each of these units kept its own records, some of which survived and are now held in the Museum Archives. The principal parts of the SS Hygiene Institute collection are: the main record books (Hauptbüchern) – 9 volumes\n\nthe subsidiary record books (Nebenbüchern) – 8 volumes\n\norders for various kinds of tests on blood and other fluid samples, and the results – 62 volumes\n\nA never realised... SS ZENTRALBAULEITUNG RECORDS The Archives of the Auschwitz-Birkenau State Museum in Oświęcim also hold documents created by theSS Central Construction Board in Oświęcim (Zentralbauleitung der Waffen-SS und Polizei Auschwitz O/S). The Central Construction Board kept records on all building work at the Auschwitz-Birkenau camp complex. The most important items in this collection are: plans for the Auschwitz I and Auschwitz II-Birkenau camps\n\nplans, technical documentation, and cost estimates for various construction projects at Auschwitz-Birkenau Concentration Camp (including the plans for the gas chambers and crematoria at Auschwitz II-Birkenau Concentration Camp)\n\nA list of killed... CAMP RESISTANCE MOVEMENT MATERIALS Material connected with the camp resistance movement constitutes a separate part of the original documentation held in the archives. Noteworthy items include: periodic reports about the situation in the camp sent through clandestine channels from Auschwitz to the local resistance movement outside the camp\n\nsecret messages smuggled out of the camp by prisoners\n\nlists of deceased women prisoners compiled illegally in the camp by prisoner Antonina Piątkowska on the basis of information in the camp hospital record books\n\nTRIAL RECORDS The trial records held in our archives illustrate the ways in which Nazi war criminals were brought to justice. The majority of these materials are not originals. The most significant include: material from the trial of Rudolf Höss, the founder and first commandant of Auschwitz\n\nmaterial from the trial of 40 other members of the Auschwitz garrison who, like Höss, were tried before the Polish Supreme National Tribunal Both of these sets of documents include the indictments, testimony by former prisoners called as witnesses, explanatory statements by the accused, copies of original camp documents entered into the proceedings by the prosecution, and the verdicts and sentences.\n\nTransport list COPIES OF TRANSPORT LISTS While the majority of the documents in the archives concern registered Auschwitz prisoners, it should be noted that, thanks to cooperation with various institutions of a similar nature throughout the world, the archives have also been enriched by copies of transport lists of people deported to Auschwitz from various places where they were previously concentrated. This applies mostly to the deportation of Jews. These records include: transport lists of Jews deported to Auschwitz from the camp in Drancy near Paris\n\ntransport lists of Jews deported to Auschwitz from the camp in Westerbork in the Netherlands\n\ntransport lists of Jews deported to Auschwitz from the camp at the ghetto-city of Theresienstadt (Terezin) near Prague\n\ntransport lists of Jews deported by the Gestapo to Auschwitz from Berlin\n\nA card of an... MATERIAL ON OTHER CONCENTRATION CAMPS\n\n\n\nA separate part of the archival holdings is made up of material on other Nazi concentration camps. In this case, as well, most of the items are copies. They include: lists of prisoners sent from Dachau to Auschwitz and lists of prisoners transferred from Auschwitz to Dachau;\n\nlists of prisoners transferred from Auschwitz to Buchenwald\n\nlists of prisoners transferred from Auschwitz to Flossenbürg\n\nlists of prisoners transferred from Auschwitz to Gross-Rosen\n\nlists of prisoners transferred from Auschwitz to Stutthof\n\nlists of prisoners transferred from Auschwitz to Dachau\n\nlists of prisoners transferred from Auschwitz to Ravensbrück\n\nlists of prisoners transferred from Auschwitz to Mauthausen In the case of Mauthausen, it should be noted that the original personal file cards on the prisoners were saved after liberation thanks to the efforts of Polish prisoners, including former Auschwitz prisoners. These files are now in our archives. Since these cards accompanied prisoners when they were transferred from one Nazi concentration camp to another, many of the cards in the Mauthausen file were originally issued in Auschwitz.\n\nRECORDS FROM THE SUB-CAMPS Various records associated with the functioning of some of the Auschwitz sub-camps make up a separate part of the archival holdings. It should be noted that the completeness of these records varies greatly among the different sub-camps. In relative terms, the greatest numbers of original documents are extant from the Jawischowitz sub-camp in Jawiszowice and the Janinagrube sub-camp in Libiąż. Our archival holdings include documents related to the following Auschwitz sub-camps: Blechhammer in Sławęcice nesr Blachownia Śląska\n\nCharlottegrube in Rydułtowy\n\nChelmek in Chełmek\n\nEintrachthütte in Świętochłowice\n\nFürstengrube in Wesoła near Mysłowice\n\nGolleschau in Goleszów\n\nGünthergrube in Lędziny\n\nJaninagrube in Libiąż\n\nJawischowitz in Brzeszcze-Jawiszowice\n\nNeu-Dachs in Jaworzno\n\nTrzebinia in Trzebionka"}, {"url": "https://www.auschwitz.org/en/history/auschwitz-i/", "page_content": "The Building and Expansion of Auschwitz Concentration Camp\n\nThe basis for Auschwitz consisted of 22 prewar brick barracks buildings. Over time, the camp expanded steadily in both organizational and spatial terms. At its peak in the summer of 1944, Auschwitz covered about 40 sq. km. in the core area, and more than 40 branch camps dispersed within a radius of several hundred kilometers. At this time, there were about 135 thousand people (105 thousand registered prisoners and about 30 thousand unregistered) in the Auschwitz complex, which accounted for 25% of all the people in the entire concentration camp system.\n\n>>>ON-LINE LESSON \"AUSCHWITZ — CONCENTRATION AND EXTERMINATION CAMP\"<<<\n\n\n\nConsidering the functions of the camp, it is plain that it underwent significant evolution in the almost 5 years of its existence: from the concept of a quarantine camp, which was the starting point for the decision to found the camp in 1940 (the concept was never implemented), through concentration camp (a place for the annihilation of all prisoners by depriving them of the basic prerequisites for life), to a new type of camp combining a Dachau- or Gross-Rosen-type concentration camp with a center for immediate killing on the model of Treblinka or Bełżec.\n\nIn view of the basic functions of Auschwitz, its history may be divided into two basic periods:\n\nfrom its founding in 1940 and the deportation of the first transport of Poles, political prisoners on June 14, 1940, to the first months of 1942, when it functioned exclusively as a concentration camp—that is, predominantly a place of slow killing as the result of deliberately created, inhuman conditions, above all starvation;\n\nfrom the first months of 1942 to October 1944, when the camp continued to function as a concentration camp for prisoners of various ethnic backgrounds (from mid-1942 mainly Jews, Poles, and Gypsies), while simultaneously functioning as the largest center for the immediate, mass killing of Jews brought here within the framework of the campaign for the destruction of the entire Jewish population of Europe.\n\nIn the last two months of its existence, after the closing of the gas chambers in October 1944 in connection with the critical military situation of the Third Reich and the expected Soviet offensive, the camp entered the phase of final liquidation, which ended with the evacuation of the prisoners."}, {"url": "https://simple.wikipedia.org/wiki/Auschwitz_concentration_camp", "page_content": "Arbeit Macht Frei, meaning Work will set you free.[1] The main gate of Auschwitz I. The sign reads, meaning\n\nThe main entrance to Auschwitz II, the death camp at Auschwitz\n\nFamous photo of Hungarian Jewish children and an elderly woman on the way to the gas chambers of Auschwitz II (1944).\n\nAuschwitz was a group of concentration camps run by Nazi Germany during World War II. There were three large camps at Auschwitz, and 3 smaller ones. Auschwitz I was the main camp, which held prisoners from 1940 to 1945. Auschwitz II (Birkenau) was the largest extermination camp (death camp) run by Nazi Germany during The Holocaust. Auschwitz III (Monowitz) and the subcamps were forced labor camps where prisoners worked as slaves. These camps were established because there were too many Polish prisoners and not enough room in \"local\" prisons to hold them in.\n\nThe Auschwitz camps were in a town in Poland called Oświęcim. (\"Auschwitz\" is the German name for \"Oświęcim.\") In German, Auschwitz was called Konzentrationslager Auschwitz (KZ Auschwitz), which means \"Auschwitz concentration camp.\"\n\nThe Schutzstaffel (SS), led by Heinrich Himmler, ran the death camps and concentration camps in Nazi Germany.[2]\n\nNo one knows exactly how many people were sent to Auschwitz, or how many died there. However, historians estimate that between 1940 and 1945, the Nazis sent at least 1.3 million people to Auschwitz.[3] About 1.1 million of these people died or were killed at Auschwitz.[3]\n\nExtermination camps were different from concentration camps. Starting in 1940, the Nazis built about 150 concentration camps and many more sub-camps. However, there were only six extermination camps in Nazi Germany, all in eastern Europe:[4]\n\nAuschwitz II (Birkenau)\n\nSobibór\n\nMajdanek\n\nBełżec\n\nTreblinka\n\nChelmno\n\nIn extermination camps, almost everyone was killed right after they got to the camps. The Nazis killed about 3.0-3.5 million people in these death camps.[5][6] 90% of them were Jewish people.[7]\n\n[8] Photo of a selection. People being sent to the left will be killed in the gas chambers immediately. People being sent to the right are being chosen as slave workers\n\nEvery day, Nazi authorities brought many prisoners to Auschwitz on trains. The camp's SS doctors separated these prisoners into three groups. This was called \"selection.\" Selection was how the SS decided which of Auschwitz's camps each prisoner would go to.[8]\n\nMost prisoners sent to Auschwitz were selected for death.[8] This means the SS decided they should be killed right away. Usually, the SS put all children, most women, all elderly people, people who looked sick, and people who looked like they could not work in this group.[8][9] SS guards brought these people right to Auschwitz's gas chambers and killed them with poison gas.[9] They used a form of hydrogen cyanide, a type of poison gas called a blood agent.[10] They called this poison gas Zyklon B.[11] This gas was a very efficient way of killing the prisoners, and could kill everyone exposed to it within 20 minutes.\n\nPrimo Levi, a prisoner who survived Auschwitz, later wrote about what selections were like:\n\nIn less than ten minutes all the fit [healthy] men had been collected together in a group. [I]n [the SS guards'] rapid and summary choice each one of us had been judged capable or not of working usefully for the [Third] Reich.... [W]e know that of our [group] no more than ninety-six men and twenty-nine women entered the [camps], and that of all the others, more than five hundred in number, not one was living two days later…\n\nThus in an instant, our women, our parents, our children disappeared. We saw them for a short while as an obscure mass at the other end of the platform; then we saw nothing more.[9]\n\nForced labor [ change | change source ]\n\nThe SS selected some strong, healthy people to be slave workers. They worked at Auschwitz I; at an IG Farben factory at Auschwitz III; and at munitions factories in the sub-camps.[8] Records say that between 1940 and 1945, about 405,000 people worked as slave laborers, and about 84% of them (340,000) died.[12]\n\nOskar Schindler, a German business owner, saved about 1,000 Jews from Poland. He sent them away to his factory, and these Jews lived.[13]\n\nSpecial jobs [ change | change source ]\n\nSS officials chose a third group of people they could use for special jobs or medical experiments. For example:\n\nOne of the camp's doctors, Joseph Mengele, was interested in twins and dwarves. The SS would send these people to the camp \"hospital\" so Mengele could do medical experiments on them. [14]\n\nThe SS chose some people to help guard the other prisoners. Often, they chose violent criminals for this job. They called these people \"kapos.\" [15]\n\nThe SS also chose some people to work in and around the gas chambers and crematoria. They called these people Sonderkommando.[16]\n\nKapos and Sonderkommandos made it possible for a small number of SS guards to control tens of thousands of prisoners at Auschwitz. Altogether, about 7,000 SS members worked at Auschwitz.[17]p. 40\n\nThe camps [ change | change source ]\n\nAuschwitz I [ change | change source ]\n\nAuschwitz I was the office for all of the camps in the Auschwitz complex.\n\nThe Nazis kept prisoners at Auschwitz from 14 June 1940 until 27 January 1945.[17][18]p. 128\n\nWith latrines like these, sanitation was impossible at Auschwitz\n\nThe first prisoners at Auschwitz I were 728 people from Poland.[18] One of these prisoners was Kazimierz Albin. He survived Auschwitz. Later, he wrote about how the first day at Auschwitz began:\n\n[W]e had to line up in five rows... [SS guard] Frizsch announced: \"This is Auschwitz Concentration Camp... Any resistance or disobedience will be ruthlessly punished. Anyone disobeying superiors, or trying to escape, will be sentenced to death. Young and healthy people don't live longer than three months here. Priests one month, Jews two weeks. There is only one way out—through the crematorium chimneys.\"[19]\n\nNext were 48 homosexual men from Germany. Then Jews arrived as prisoners.\n\nFrom 1940 to 1941, at any time, there were between 13,000 and 16,000 prisoners in Auschwitz I. By 1942, there were 20,000. Most of these prisoners were not Jewish, because most of the Jewish prisoners were sent to Auschwitz II.[8]\n\nAt Auschwitz, the prisoners had to put marks on their uniforms to show why they were sent to Auschwitz. For example, Jewish prisoners had to sew two yellow triangles onto their clothes, in the shape of a Star of David.[20] Homosexual people had to sew a pink triangle onto their clothes.[21] The SS also gave each prisoner a serial number and tattooed the number on the prisoners' bodies. The SS never called prisoners by their names, only by their numbers.[22]\n\nThe living conditions at Auschwitz I were very bad. Prisoners got very little food. There was no sanitation, which made it easy for diseases to spread. Many prisoners died from diseases, starvation, and freezing to death.[23][24]\n\nOn Sundays, the prisoners had to clean their barracks, and were allowed to shower.[24]\n\nPunishments and torture [ change | change source ]\n\nBlock 11 at Auschwitz. Its purpose was to punish and torture prisoners\n\nThe SS built many types of rooms meant to punish and torture prisoners. These included:[25]\n\nStanding cells: These were rooms that were 1.5 square metres. The SS would keep four people in one of these rooms. The rooms were so small that the prisoners would have to stand all night. Then they would have to work during the day.\n\nStarvation cells: The SS would lock prisoners into these rooms, and did not give them any water or food. They would leave the prisoners to die of dehydration or starvation.\n\nSuffocation cells: These were rooms with only one small window. The SS would lock many prisoners into these rooms. As the prisoners breathed in the oxygen in the room, there would be less and less oxygen left. Eventually, there would be so little oxygen left in the room that the prisoners would suffocate.\n\nSometimes, the SS would tie a prisoner's hands behind his back and hang him by his wrists. This would break the person's shoulder joints. The SS would leave prisoners hanging like this for hours or days, sometimes until the prisoners died.[25]\n\nThe SS also hung some prisoners by the neck, so they would die a slow and painful death.[25]\n\nGas chambers [ change | change source ]\n\nThe SS tried killing prisoners with Zyklon B for the first time at Auschwitz I, on 3rd September 1941.[26]\n\nIn their first test, the SS used Zyklon B on 600 prisoners of war from the Soviet Union and about 250 Polish people.[17]p. 88[26] When the gas killed these prisoners, the SS realized that they could kill people much more quickly with Zyklon B than they could by shooting them.[26] They built a gas chamber, where they could kill over 700 people at a time.[27]p. 160 They also built a crematorium in block 11 of the camp.[27]p. 160\n\nFrom 1941 to 1942, the SS killed about 60,000 people in this gas chamber.[28][29] After 1942, they made the gas chamber an air-raid shelter for the SS to hide in if Allied planes were dropping bombs nearby.[17]pp. 123–124\n\nToday, the gas chamber still exists. It has been re-built, using its original parts. Now, it is a part of the museum at Auschwitz.[30]\n\nWomen prisoners [ change | change source ]\n\nOn 26th March 1942, the SS sent the first women prisoners to Auschwitz.[31]\n\nFrom about March 1941 to January 1945, Nazi Dr. Carl Clauberg did medical experiments on many women at Auschwitz. He wanted to find a way to sterilize millions of people as easily and quickly as possible. He tried using X-rays, surgery, and medications to sterilize women prisoners.[32] The Nazis' plan was to get rid of everyone who was not \"Aryan.\" As part of this plan, the Nazis sterilized many people so they could not have children who were not \"Aryan.\"[17]p. 73\n\nIn 1943, Heinrich Himmler ordered the SS to create a brothel in Auschwitz. Non-Jewish women prisoners were forced to work in the brothel. Prisoners who were important to the Nazis, like kapos and chefs, were allowed to use the brothel as a reward.[33] Heinrich Himmler also ordered homosexual prisoners to visit the brothel every week. He thought this would 'cure' them of being homosexual.[34]\n\nJohanna Langefeld, Maria Mandel, and Elisabeth Volkenrath were in charge of the women prisoners at Auschwitz.[35]\n\nJewish twins were kept alive to be used in Mengele's medical experiments. They were freed from Auschwitz by the Red Army in January 1945\n\nCriminal Joseph Mengele did medical experiments on many prisoners, especially twins, dwarves, and people with physical disabilities.[14] All of these experiments were very crude and painful. For example, Mengele castrated some prisoners without using any anesthetics. Many women and men died during these experiments.[14]\n\nMengele was also in charge of Auschwitz's camp \"hospital.\"[14] This was not like a regular hospital. Prisoners who were doctors, like Gisella Perl, worked there. They tried to help prisoners who were sick or hurt, but they had no medications or medical supplies, not even clean bandages or running water.[36] If patients did not get better quickly, Mengele sent them to the gas chambers, or Nazi doctors killed them by injecting them with phenol.[14]\n\nAuschwitz II (Birkenau) [ change | change source ]\n\nAuschwitz II was Auschwitz's death camp. It was also called Birkenau (pronounced \"BEER-kin-now\"[37]), which means \"the birch wood\" (forest).[38] Today, Birkenau is often just called \"Auschwitz.\"\n\nThe Nazis began building Auschwitz II in October 1941, because Auschwitz I was getting too crowded. By this time, Adolf Hitler had decided to kill all of the Jewish people.[4][39] The Nazis called this plan the \"Final Solution.\" Soon after it was built, Heinrich Himmler ordered Auschwitz II to be used as a killing center. Its goal would be to kill every prisoner that was sent there.[4]\n\nAuschwitz II had four gas chambers. The Nazis made the gas chambers look like showers. They convinced prisoners that they were going into the gas chambers to shower.[27]p. 160 Then they dropped Zyklon B into the gas chambers and killed everyone inside. The dead bodies were burned to ashes in Auschwitz II's four crematoria.[27]p. 160\n\nAuschwitz II was the largest death camp run by Nazi Germany during The Holocaust.[3] The SS killed more people at Auschwitz than in any of the other Nazi death camps.[3] The SS built Auschwitz II's gas chambers so that 2,000 people could fit inside at once.[39] This meant they were able to kill about 2,000 people every 30 minutes in the gas chambers.[39]\n\nAuschwitz III (Monowitz) [ change | change source ]\n\nAuschwitz III was also called Monowitz (pronounced \"MOW-no-vitz\"[37]). At Monowitz and the 48 subcamps around it, prisoners worked as slaves in the IG Farben factory and factories that made weapons for the German Army.[17][40]p. 53\n\nThe IG Farben factory at Monowitz opened in 1941. By October 1942, prisoners had been forced to build the Monowitz camp, so slave workers could live there. IG Farben paid for the camp to be built. This made Monowitz the first concentration camp in history to be paid for and built by a private company.[17]p. 53\n\nBetween 1941 and 1945, about 35,000 prisoners worked at the IG Farben factory. Seven out of every ten of these prisoners (about 25,000) died from starvation, disease, and being forced to work so hard.[17]pp. 51, 53, 55 The average prisoner lived for only three months after being sent to Monowitz.[17]p. 56\n\nManagers at the IG Farben factory were always trying to make the prisoners work harder. Often they threatened prisoners by saying they would be sent to the gas chambers if they did not work harder.[17]p. 56 Every month, 20% of the slave workers at the factory (one out of every five) died or were sent to the gas chambers.[41]\n\nUntil the summer of 1943, Rudolf Höss was the commander of Auschwitz.[42]p. 193 After him, Arthur Liebehenschel and Richard Baer became commanders of the camp.[43]\n\nAfter World War II, Höss wrote an autobiography. He gave many details about Auschwitz's camps.[42] At the Nuremberg Trials, he received the death penalty. He was hanged in front of the crematorium at Auschwitz I.\n\nOne of the Sonderkommando photos (cropped), showing victims from the gas chamber being burned\n\nBy 1943, many resistance groups had formed inside Auschwitz's camps. These were groups who tried to fight back against the Nazis, any way they could.[44]\n\nResistance groups helped some prisoners to escape from Auschwitz. These people brought information to the world about the killings happening at Auschwitz.[44]\n\nHowever, if one prisoner escaped, the SS killed many other prisoners. Sometimes, they brought the escaped prisoners' family members to Auschwitz. The SS did these things so that other prisoners would not try to escape. Overall, about 700 prisoners tried to escape from Auschwitz's three different camps. Of these 700, about 300 were able to escape.[44]\n\nSome of the Sonderkommando at Auschwitz fought back against the SS. For example, in 1944, some of the Sonderkommando at Auschwitz blew up one of the camp's crematoria.[44]\n\nAlso in 1944, members of the Sonderkommando secretly took pictures inside Auschwitz.[45] These are the only pictures that show the mass murder that was happening at Auschwitz.[46] Members of the Polish resistance helped sneak the photographs out of the camp.[45]\n\nThe information [ change | change source ]\n\nThe Allies got some information about Auschwitz's camps between 1941 and 1944. However, they did not believe that so many people were being killed at Auschwitz. Then two people, Rudolf Vrba and Alfred Wetzler, escaped from Auschwitz. They wrote reports about what was happening at Auschwitz. From these reports, Allied leaders learned the truth about Auschwitz in the middle of 1944.[47]\n\nDuring 1944, Allied airplanes had taken some photographs of the area, including Auschwitz.[38] However, no one studied these photographs. The first time anyone looked at these photos carefully was in the 1970s.[38]\n\nAt one time, the Allies had planned to bomb the camps. However, they decided not to, because they did not want to kill any prisoners.[48] In fact, some planes dropped bombs at nearby military targets. One bomb fell on the camp. It killed 315 prisoners and hurt 1425 more.[49]\n\nPeople still argue about what the Allies could have done to save more of the prisoners at Auschwitz.\n\nBy late 1944, the Red Army was close to Auschwitz. The SS blew up the gas chambers at Birkenau to hide what they had done. They also destroyed many other buildings and records.[17]pp. 125–127 On 17th January 1945, the camps' SS guards started to leave Auschwitz. They forced more than 58,000 prisoners to march west to the cities Gliwice or Wodzilaw. At the arrival of these cities they were transported by trains to concentration camps in Germany.[50] They left behind only those who could not march. About 38,000 prisoners died on the forced march.[17]pp. 125–127\n\nOn 27th January 1945, the soldiers in the Red Army's 322nd Infantry reached Auschwitz. They found and freed about 7,500 prisoners.[17]p. 128\n\nNobody knows exactly how many people died at Auschwitz, or other Nazi camps. The SS kept records, but they destroyed most of them.\n\nHistorians have used many different ways of estimating how many people died at Auschwitz. For example, they have studied what witnesses at the Nuremberg Trials said. Some people who survived Auschwitz also helped to estimate how many people died there.\n\nStill, many different people and governments have disagreed about this:\n\nThe communist governments of the Soviet Union and Poland said that 4 million people died at Auschwitz [17] pp. 132–133\n\nRudolf Höss said that 2.5 million to 3 million people died there [39] Later he wrote that he made a mistake, saying \"the figure of two and a half million [is] far too high.\" [42]\n\nLater he wrote that he made a mistake, saying \"the figure of two and a half million [is] far too high.\" Adolf Eichmann said the number of deaths was 2 million [42]\n\nIn 1983, French scholar George Wellers was one of the first people to use the Nazis' records about deportations to estimate the number killed at Auschwitz. He calculated that 1.613 million died, including 1.42 million Jews and 146,000 Poles. [7]\n\nAround the same time, Franciszek Piper used records of train arrivals and deportations to calculate 1.1 million Jewish deaths; 140,000-150,000 Polish deaths; and 23,000 Roma deaths.[7]\n\nThe United States Holocaust Memorial Museum says that these are \"the best estimates of the number of victims\" at Auschwitz between 1940 and 1945:[3]\n\nTotal Number\n\nSent to Auschwitz Number Killed\n\nat Auschwitz Percentage\n\nKilled Jews 1,095,000 960,000 88% Polish people 147,000 74,000 50% Roma 23,000 21,000 91% Soviet prisoners of war 15,000 15,000 100% Other people 25,000 12,000 48% Totals 1.3 million 1.08 million 83%\n\nAfter the war [ change | change source ]\n\nEyeglasses of people who were killed at Auschwitz\n\nA few years after World War II ended, the government of Poland decided to rebuild Auschwitz and put a museum there. They repaired some of the camps. Sometimes they made very small changes from the original setup.\n\nThe museum has many parts and exhibits. They include:[51]\n\nAuschwitz II and the remains of the gas chambers.\n\nAbout 110,000 men's, women's, and children's shoes. The shoes belonged to people who were killed at Auschwitz.\n\nAbout 3,800 suitcases, which people sent to Auschwitz brought with them. When people were sent to Auschwitz, the Nazis told them they were just going to another place to live. So people brought suitcases with many things they thought they would need.\n\nOther things that people sent to Auschwitz brought with them. These include over 12,000 kitchen utensils; eyeglasses; clothing; and many other things.\n\nThings the SS used to kill prisoners. These include fake shower heads for the gas chambers; cans of Zyklon B; the door of one of the gas chambers; and a crematorium.\n\nIn 1947, the museum was opened for the public.[30] Later, people scattered the ashes of Auschwitz's victims between the huts where the prisoners lived. They see the entire area as a gravesite.\n\nOther honors [ change | change source ]\n\nIn 1979, the United Nations Educational, Scientific, and Cultural Association (UNESCO) made Auschwitz a World Heritage Site.[52]\n\nAlso in 1979, Polish Pope John Paul II celebrated Mass at Auschwitz II.[53]\n\nIn the 1980s, Pope John Paul II made two people who were killed at Auschwitz into Catholic saints:\n\nMaximilian Kolbe, a Polish priest. The Nazis sent him to Auschwitz because he helped Jewish refugees. When three men escaped from Auschwitz, the SS chose ten other prisoners to be starved to death as revenge. When one of those prisoners started to cry about his family, Kolbe volunteered to be killed in his place. [54]\n\nEdith Stein, a Jewish woman who converted to Catholicism and became a Carmelite nun. The SS killed her in the gas chambers at Auschwitz.[55]\n\nIn 2005, the United Nations made 27 January the International Holocaust Remembrance Day. They chose 27 January because it is the day that the Red Army freed Auschwitz.[56]\n\nOn 27 January 2005, the European Parliament marked the anniversary of Auschwitz's liberation with a minute of silence. The European Parliament also passed a resolution saying that the murder of about 1.5 million people at Auschwitz's camps was terrible. The Parliament said they passed the resolution partly because of “the disturbing rise in antisemitism, and especially antisemitic incidents, in Europe, and for learning anew the wider lessons about the dangers of victimizing people on the basis of race, ethnic origin, religion, social classification, politics or sexual orientation.\"[57]\n\nAfter World War II, the communist governments of the Soviet Union and Poland put up a memorial sign at Auschwitz. The sign said 4 million people died at Auschwitz. After the fall of the communist government in Poland in 1989, the sign was changed to say that 1.1 million people died there. People who try to deny the Holocaust use this difference to claim that the Holocaust was propaganda.[58] However, the Holocaust is a fact of history, and the SS killed at least 1.1 million people at Auschwitz.[4][52]\n\nStarting in 1989, the Polish government and media argued that it was not fair to use the name \"Polish death camps\" to describe the Auschwitz camps.[59] They said this name made it seem like Poland ran the death camps. In fact, Nazi Germany had taken over Poland, and the Nazis ran the death camps.[17]p. 73 In 2006, the Polish government asked UNESCO to change the name of the World Heritage Site at Auschwitz. They wanted UNESCO to change the name from \"Auschwitz Concentration Camp\" to \"Former Nazi German Concentration Camp Auschwitz-Birkenau\". The Polish government thought this would avoid misleading the public and would show that Nazi Germany ran the camp, not Poland. In 2007, UNESCO agreed, and changed the site's name to \"Auschwitz Birkenau: German Nazi Concentration and Extermination Camp (1940-1945).\"[52]\n\nThe Polish government had allowed filming at the sites for two movies, and a TV series. However, in some cases, they did not allow filming inside the camps. In February 2006, Poland refused visas to some researchers from Iran who wanted to visit Auschwitz.[60] They did this because the President of Iran, Mahmoud Ahmadinejad, has denied the Holocaust, and even said that it is \"a myth.\"[61][62]\n\nReligious controversies [ change | change source ]\n\nIn 1984, the Carmelites opened a convent near Auschwitz I. Jewish groups protested, and the Carmelites removed the convent in 1993.[53]\n\nIn 1987, after Pope John Paul II beatified Edith Stein, Catholic people put up a cross near the gas chamber. After some time, a Star of David appeared at the site. Many religious symbols appeared. Finally, people removed all of them.[53]\n\nIn 1988, the Carmelites put up an 8-meter (26-foot) tall cross outside block 11 at Auschwitz.[53][63] Jewish groups protested, saying that most of the people killed at Auschwitz were Jewish. By 1998, 300 smaller crosses had appeared. Finally, people removed the smaller crosses. However, the larger cross is still there.[53]\n\nPhoto gallery [ change | change source ]\n\nMap of the three main Auschwitz camps\n\nExample of a photo taken by an Allied plane that was never studied\n\nOne of the Sonderkommando photos, showing naked women being sent to the gas chamber\n\nNazi photos of Polish prisoner Czesława Kwoka in 1942 or 1943\n\nThe cross placed by the Carmelites in front of Block 11\n\nThe inside of Auschwitz I's crematorium today\n\nRelated pages [ change | change source ]"}, {"url": "https://encyclopedia.ushmm.org/content/en/article/administration-of-the-auschwitz-camp-complex", "page_content": "Auschwitz in the Camp System\n\nAuschwitz Camp Complex: Maps\n\nThe Auschwitz concentration camp complex was subordinate to the Inspectorate of Concentration Camps. Originally subordinate to the SS Main Office, the Inspectorate was transferred to the SS Operations Main Office after World War II began. In March 1942, the Inspectorate of Concentration Camps was incorporated into the SS Economic-Administrative Main Office and remained subordinate to that agency until the end of World War II.\n\nIn November 1943, the SS decreed that Auschwitz-Birkenau and Auschwitz-Monowitz would become independent concentration camps. The commandant of Auschwitz I remained the SS garrison commander of all SS units assigned to Auschwitz and was considered the senior officer of the three commandants. SS offices for maintaining prisoner records and managing prisoner labor deployment continued to be located and centrally run from Auschwitz I. In November 1944, Auschwitz II was reunified with Auschwitz I. Auschwitz III was renamed Monowitz concentration camp.\n\nAuschwitz Camp Commandants\n\nCommanders of the Auschwitz concentration camp complex were:\n\nSS Lieutenant Colonel Rudolf Hoess from May 1940 until November 1943\n\nSS Lieutenant Colonel Arthur Liebehenschel from November 1943 until mid-May 1944\n\nSS Major Richard Baer from mid-May 1944 until January 27, 1945.\n\nCommanders of Auschwitz-Birkenau while it was independent (November 1943 until November 1944) were\n\nSS Lieutenant Colonel Friedrich Hartjenstein from November 1943 until mid-May 1944\n\nSS Captain Josef Kramer from mid-May to November 1944.\n\nThe commandant of Monowitz concentration camp was\n\nSS Captain Heinrich Schwarz from November 1943 until January 1945."}, {"url": "https://encyclopedia.ushmm.org/content/en/article/auschwitz-fuerstengrube", "page_content": "The Fürstengrube subcamp was organized in the summer of 1943 at the Fürstengrube hard coal mine in the town of Wesoła (Wessolla), now part of the city of Mysłowice (Myslowitz), approximately 30 kilometers (18.6 miles) from Auschwitz. The mine, which IG Farbenindustrie AG acquired in February 1941, was to supply hard coal for the IG Farben factory being built in Auschwitz. Besides the old Fürstengrube mine, called the Altanlage, a new mine (Fürstengrube-Neuanlage) had been designed and construction had begun; it was to provide for greater coal output in the future. Coal production at the new mine was anticipated to start in late 1943, so construction was treated as very urgent; however, that plan proved to be unfeasible.1\n\nIn the period before the Auschwitz concentration camp prisoners were sent to work at Fürstengrube, the mine employed Soviet prisoners of war (POWs), Jewish slave laborers, and forced laborers from the USSR, in addition to its regular staff. Negotiations in July 1943 between Auschwitz Commandant Rudolf Höss and representatives of IG Farbenindustrie AG and Fürstengrube GmbH led to an agreement to build a new camp for approximately 600 prisoners—increasing to 1,200 then to 1,300 later—from Auschwitz.2\n\nMainly Jews built the new camp; they lived in the mine’s forced labor camp for Jews, which was under the so-called Organisation Schmelt; that camp was called Lager Ostland. The Jewish prisoners from that camp were taken away even before the prisoners were moved from the Auschwitz concentration camp. The camp report for August 1943 no longer mentions the number of Jews employed.3 The prisoners moved from Auschwitz then continued the subcamp’s construction and expansion.\n\nIn early September 1943, the SS began moving prisoners, probably including a few German prisoner foremen, from Auschwitz to the Fürstengrube subcamp, which appears as “Lager Süd” on mine maps. On September 4, 1943, the Auschwitz labor office reported that 129 prisoners were working at the Fürstengrube subcamp; by July 1944 that number had risen to approximately 1,200, 85 to 90 percent of whom were Jews. Polish Jews were the most numerous group, but Jews from Germany, Austria, France, Belgium, the Netherlands, Czechoslovakia, Hungary, and Greece were also present. Starting in the spring of 1944, there were also several dozen non-Jewish Polish prisoners at Fürstengrube.4\n\nFor the first three months the subcamp was under the direct charge of Auschwitz headquarters; then after November 22, 1943, under Auschwitz III- Monowitz. Effective May 22, 1944, the 3rd Guard Company of Auschwitz III took charge of the guard duty.5 SS-Hauptscharführer Otto Moll was named the subcamp’s first commandant; he served in that position until March 1944. SS-Oberscharführer Max Schmidt succeeded Moll until the subcamp was shut down in January 1945. The SS staff at the beginning of 1944 consisted of 47 SS men and grew to 64 at the end of the year.\n\nPrisoners from Auschwitz who went to the Fürstengrube subcamp were mostly put to work extracting coal in the old mine and building the new one.6 Prisoners working in the old mine were divided up into three shifts: morning (5:00 A.M. to 1:00 P.M.), day (1:00 P.M. to 9:00 P.M.), and night (9:00 P.M. to 5:00 A.M.). Work at the mine was especially difficult and dangerous because of the low galleries and the abundance of water. Prisoners did not receive the required protective clothing, and they were constantly vulnerable to beatings and abuse from the mine’s civilian staff as well as prisoner foremen. The prisoners building the new mine faced equally brutal and exhausting work. They worked in one shift, a day shift, doing all sorts of construction and assembly jobs in groups of paint ers, bricklayers, welders, metalworkers, and assemblers. Additionally, when the shifts were over, many of the prisoners then had to work to expand the camp.\n\nOnly very sick prisoners were admitted to the camp infirmary. SS doctors conducted periodic selections there and among the other prisoners as well; prisoners who were no longer able to work were moved to the Birkenau hospital sector (BIIf ).7 The rotation of prisoners was significant, as new prisoners replaced those who had been selected. For example, from May 8 to 14, 1944, as many as 42 Fürstengrube prisoners entered the hospital sector of Birkenau.8\n\nIn spite of the hard conditions and fight for survival, despite the beatings and persecution, there were some poor substitutes for cultural life at the subcamp in the form of band concerts and plays.9 Some prisoners secretly drew portraits of their fellow inmates.\n\nOnly a few escapes and escape attempts from the Fürstengrube subcamp are known. Gabriel Rothkopf, a Polish Jew, escaped during the night of December 18–19, 1943, while returning from work at the old mine.10 In response, Commandant Moll personally shot a randomly selected group of prisoners in front of their fellows and left their bodies on the assembly ground until the next shift returned.11 Ivan Potekhnin, a Russian prisoner, escaped on April 15, 1944.12 In the spring of 1944, a group of prisoners dug a tunnel from a barrack, but during an inspection five German Jews were apprehended in it; they were later hanged.13 In June 1944, Commandant Schmidt shot a Rus sian prisoner who intended to escape from the subcamp.14 In late August 1944, yet another Russian prisoner was shot; he had attempted to escapein a freight car leaving the new mine construction site.15 The escape attempt of a Polish prisoner named Górewicz, working in the forge, also ended with his execution.16\n\nPolish miners on the site helped a group of Polish prisoners by smuggling messages, food, and news of the situation on the fronts. However, the camp’s political branch got word of the activity, probably in late August 1944. The prisoners were sent to Auschwitz I, and after approximately two months of interrogation, they were brought back to Fürstengrube and hanged on October 10, 1944.17\n\nIn September, November, and December 1944, the Polish and Russian prisoners were moved to the Flossenbürg, Buchenwald, and Mauthausen concentration camps. As of January 17, 1945, 1,283 prisoners, chiefly Jews, remained in the subcamp.18 On January 19, having burned the camp’s records, the SS led approximately 1,000 prisoners out of the camp, headed for Gliwice (Gleiwitz) via Mikołów.1 9 Severe cold and icy roads made the march difficult, and SS men killed anyone who fell out. On the evening of January 20, 1945, the Fürstengrube prisoners reached the Gleiwitz II subcamp, where they joined prisoners from Auschwitz III- Monowitz as well as some other subcamps. The next day, January 21, the SS loaded approximately 4,000 prisoners into open railway cars bound for Mauthausen. The authorities at Mauthausen did not accept the transport, however, as the camp was overcrowded, but sent the train on to Mittelbau-Dora, where it arrived on January 28. Out of 4,000 prisoners, only about 3,500 survived the seven-day trip.\n\nOn January 27, 1945, at about 4:00 P.M., a dozen or so SS men entered the Fürstengrube subcamp and killed most of the remaining prisoners; some they shot, and some burned to death when the SS set their barracks on fire. Only the sudden arrival of Soviet troops forced the SS to flee, thus sparing a few of the prisoners. A mine employee who was present afterward reported that they buried 239 bodies.20 About 20 prisoners survived the massacre. One of them, former prisoner Rudolf Ehrlich, testified to these events on May 9, 1945, before the Investigation Commission for German Nazi Crimes at Auschwitz.21\n\nIn a U.S. Military Court trial in Dachau from November 15 to December 13, 1945, Otto Moll, the first commandant of the Fürstengrube subcamp, was sentenced to death by hanging.22 The sentence was executed on May 28, 1946.\n\nSources\n\nThe following secondary source contains additional information: Tadeusz Iwaszko, “Podoboz 'Fürstengrube,'” Zeszyty Oswiecimskie 16 (1975): 71–151.\n\nAPMO holds materials in the Fürstengrube GmbH collection, as well as accounts of former Fürstengrube subcamp prisoners. Additional material is in APKat, Pszczyna Division, in the Fürstengrube GmbH collection. Also helpful is the account of Leo Klüger, Lache, denn morgen bist Du tot. Eine Geschichte vom Überleben (München and Zurich: Piper, 1998)."}, {"url": "https://encyclopedia.ushmm.org/content/en/article/concentration-camps-1933-39", "page_content": "Concentration camps (Konzentrationslager; abbreviated as KL or KZ) were an integral feature of the regime in Nazi Germany between 1933 and 1945.\n\nThe term concentration camp refers to a camp in which people are detained or confined, usually under harsh conditions and without regard to legal norms of arrest and imprisonment that are acceptable in a constitutional democracy.\n\nThe First Concentration Camps in Germany\n\nThe first concentration camps in Germany were established soon after Hitler's appointment as chancellor in January 1933. In the weeks after the Nazis came to power, the SA (Sturmabteilung; commonly known as the Storm Troopers), the SS (Schutzstaffel; Protection Squadrons—the elite guard of the Nazi party), the police, and local civilian authorities organized numerous detention camps to incarcerate real and perceived political opponents of Nazi policy.\n\nGerman authorities established camps all over Germany on an ad hoc basis to handle the masses of people arrested as alleged subversives. The SS established larger camps in Oranienburg, north of Berlin; Esterwegen, near Hamburg; Dachau, northwest of Munich; and Lichtenburg, in Saxony. In Berlin itself, the Columbia Haus facility held prisoners under investigation by the Gestapo (the German secret state police) until 1936.\n\nCentralization of the Concentration Camp System\n\nThe SS gained its independence from the SA in July 1934, in the wake of the Röhm purge. Hitler then authorized SS leader Heinrich Himmler to centralize the administration of the concentration camps and formalize them into a system. Himmler chose SS Lieutenant General Theodor Eicke for this task. Eicke had been the commandant of the SS concentration camp at Dachau since June 1933. Himmler appointed him Inspector of Concentration Camps, a new section of the SS subordinate to the SS Main Office.\n\nAfter December 1934, the SS became the only agency authorized to establish and manage facilities that were formally called concentration camps. Local civilian authorities did continue to establish and manage forced-labor camps and detention camps throughout Germany. In 1937, only four concentration camps were left: Dachau, near Munich; Sachsenhausen near Berlin; Buchenwald near Weimar; and Lichtenburg near Merseburg in Saxony for female prisoners.\n\nPurposes of the Camp System\n\nConcentration camps are often inaccurately compared to a prison in modern society. But concentration camps, unlike prisons, were independent of any judicial review. Nazi concentration camps served three main purposes:\n\nTo incarcerate people whom the Nazi regime perceived to be a security threat. These people were incarcerated for indefinite amounts of time.\n\n\n\nTo eliminate individuals and small, targeted groups of individuals by murder, away from the public and judicial review.\n\n\n\nTo exploit forced labor of the prisoner population. This purpose grew out of a labor shortage.\n\nConcentration Camp Administration\n\nAlready as commandant of Dachau in 1933, Eicke developed an organization and procedures to administer and guard a concentration camp. He issued regulations for the duties of the perimeter guards and for treatment of the prisoners. The organization, structure, and practice developed at Dachau in 1933–34 became the model for the Nazi concentration camp system as it expanded. Among Eicke's early trainees at Dachau was Rudolf Höss, who later commanded the Auschwitz concentration camp.\n\nSpecial “political units on alert” (Politische Bereitschaften) originally guarded the SS concentration camps. They were renamed “SS Guard Units” (SS-Wachverbände) in 1935 and “SS Death's-Head Units” (SS-Totenkopfverbände) in April 1936. One SS Death's-Head Unit was assigned to each concentration camp. After 1936, the camp administration, including the commandant, was also a part of the SS Death's-Head Unit.\n\nAlthough all SS units wore the Death's-Head symbol (skull and crossbones) on their caps, only the SS Death's-Head Units were authorized to wear the Death's Head Symbol on their lapels. The “SS Death's-Head Division” of the Waffen SS was created in 1940. Its officers were recruited from concentration camp service. They also wore the Death's-Head symbol on their lapel.\n\nThe SS Death's-Head Unit at each camp was divided into two groups. The first was the camp staff, which covered:\n\nthe commandant and his personal staff\n\na Security Police officer and an assistant to maintain and update prisoner records\n\nthe commandant of the so-called protective detention camp (Schutzhaftlagerführer) which housed the prisoners, and his staff (including the labor allocation officer, the roll call officer, and the Blockführer, who were responsible for the individual prisoner barracks)\n\nan administrative staff responsible for the fiscal and supply administration of the camp\n\nan infirmary run by an SS physician assisted by one or two SS sanitation officers and/or medical orderlies.\n\nThe second group constituted the guard detachment (SS-Wachbataillon), which prior to 1939 was at battalion strength.\n\nThe model established by Eicke in the mid-1930s characterized the concentration camp system until the collapse of the Nazi regime in the spring of 1945. The daily routine at Dachau, the methods of punishment, and the duties of the SS staff and guards became the norm, with some variation, at all German concentration camps.\n\nAuthority to Imprison People in Concentration Camps\n\nAfter 1938, authority to incarcerate persons in a concentration camp formally rested exclusively with the German Security Police (made up of the Gestapo and the Criminal Police).\n\nThe Security Police had held this exclusive authority de facto since 1936. The “legal” instrument of incarceration was either the “protective detention” (Schutzhaft) order or the “preventative detention” (Vorbeugungshaft) order. The Gestapo could issue a “protective detention” order for persons considered a political danger after 1933. The Criminal Police could issue a “preventative detention” order after December 1937 for persons considered to be habitual and professional criminals, or to be engaging in what the regime defined as “asocial” behavior. Neither order was subject to judicial review, or any review by any German agency outside of the German Security Police. As the concentration camp system expanded, the camps fell within the exclusive authority of the SS. The German judicial administration had no jurisdiction with the growing camp system.\n\nExpansion of the Camp System\n\nNazi Germany expanded by bloodless conquest into Austria and Czechoslovakia between 1938 and 1939. The numbers of those labeled as political opponents and as “asocials” in German society increased, requiring the establishment of new concentration camps.\n\nBy the time the Germans invaded Poland in September 1939, unleashing World War II, there were six concentration camps in the so-called Greater German Reich: Dachau (founded 1933), Sachsenhausen (1936), Buchenwald (1937), Flossenbürg in northeastern Bavaria near the 1937 Czech border (1938), Mauthausen, near Linz, Austria (1938), and Ravensbrück, the women's camp, established in Brandenburg Province, southeast of Berlin (1939), after the dissolution of Lichtenburg.\n\nForced Labor\n\nFrom as early as 1934, concentration camp commandants used prisoners as forced laborers for SS construction projects such as the construction or expansion of the camps themselves. By 1938, SS leaders envisioned using the supply of forced laborers incarcerated in the camps for a variety of SS-commissioned construction projects. To mobilize and finance such projects, Himmler revamped and expanded the administrative offices of the SS and created a new SS office for business operations. Both agencies were led by SS Major General Oswald Pohl, who would take over the Inspectorate of Concentration Camps in 1942.\n\nBeginning a pattern that became typical after the war began, economic considerations had an increasing impact on the selection of sites for concentration camps after 1937. For instance, Mauthausen and Flossenbürg were located near large stone quarries. Likewise, concentration camp authorities increasingly diverted prisoners from meaningless, backbreaking labor to still backbreaking and dangerous labor in extractive industries, such as stone quarries and coal mines, and construction labor.\n\nConcentration Camps after the Outbreak of World War II\n\nAfter Nazi Germany unleashed World War II in September 1939, vast new territorial conquests and larger groups of potential prisoners led to the rapid expansion of the concentration camp system to the east. The war did not change the original function of the concentration camps as detention sites for the incarceration of political enemies. The climate of national emergency that the conflict granted to the Nazi leaders, however, permitted the SS to expand the functions of the camps.\n\nThe concentration camps increasingly became sites where the SS authorities could kill targeted groups of real or perceived enemies of Nazi Germany. They also came to serve as holding centers for a rapidly growing pool of forced laborers used for SS construction projects, SS-commissioned extractive industrial sites, and, by 1942, the production of armaments, weapons, and related goods for the German war effort.\n\nDespite the need for forced labor, the SS authorities continued to deliberately undernourish and mistreat prisoners incarcerated in the concentration camps. Prisoners were used ruthlessly and without regard to safety at forced labor, resulting in high mortality rates."}, {"url": "https://encyclopedia.ushmm.org/content/en/article/auschwitz", "page_content": "Where was Auschwitz Located?\n\nAuschwitz is the German name for the Polish city Oświęcim. Oświęcim is located in Poland, approximately 40 miles (about 64 km) west of Kraków. Germany annexed this area of Poland in 1939.\n\nThe Auschwitz concentration camp was located on the outskirts of Oświęcim in German-occupied Poland. It was originally established in 1940 and later referred to as \"Auschwitz I\" or \"Main Camp.\"\n\nThe Auschwitz-Birkenau killing center, also referred to as \"Auschwitz II,\" was located near the Polish village Brzezinka (German: Birkenau). This is about 2 miles (just over 3 km) from the Main Camp. The Germans started construction on Auschwitz-Birkenau in 1941.\n\nAuschwitz III or Monowitz was located near the Polish village of Monowice (German: Monowitz). This is about 4 miles (approximately 6.5 kilometers) from the Main Camp. The Germans initially established the Buna subcamp there in 1942. In 1943, it became a concentration camp.\n\nThe Auschwitz camp complex also included numerous subcamps. The majority of these subcamps were located in the region around Auschwitz.\n\nNumber of Victims\n\nIt is estimated that the SS and police deported at least 1.3 million people to the Auschwitz camp complex between 1940 and 1945. Of these deportees, approximately 1.1 million people were murdered.\n\nThe best estimates of the number of victims at the Auschwitz camp complex, including the killing center at Auschwitz-Birkenau, between 1940 and 1945 are:\n\nDuring the Holocaust, concentration camp prisoners received tattoos only at one location, Auschwitz. Incoming prisoners were assigned a camp serial number which was sewn to their prison uniforms. Only those prisoners selected for work were issued serial numbers; those prisoners sent directly to the gas chambers were not registered and received no tattoos.\n\nAuschwitz I\n\nAuschwitz I, the main camp, was the first camp established near Oswiecim. Construction began in April 1940 in an abandoned Polish army barracks in a suburb of the city.\n\nSS authorities continuously used prisoners for forced labor to expand the camp. During the first year of the camp’s existence, the SS and police cleared a zone of approximately 40 square kilometers (15.44 square miles) as a “development zone” reserved for the exclusive use of the camp.\n\nOn May 20, 1940, the first prisoners arrived at Auschwitz. The transport consisted of some 30 German inmates, categorized as \"professional criminals.\" The SS had selected them from the Sachsenhausen concentration camp outside of Berlin. Less than a month later, on June 14, German authorities in occupied Poland deported 728 Polish prisoners from a prison in Tarnow to Auschwitz. This was the first of many transports of Poles to the Auschwitz camp.\n\nLike most German concentration camps, Auschwitz I was constructed for three purposes:\n\nTo incarcerate real and perceived enemies of the Nazi regime and the German occupation authorities in Poland for an indefinite period of time\n\nTo provide a supply of forced laborers for deployment in SS-owned construction-related enterprises (and, later, armaments and other war-related production)\n\nTo serve as a site to kill small, targeted groups of the population whose death was determined by the SS and police authorities to be essential to the security of Nazi Germany.\n\nLike some concentration camps, Auschwitz I had a gas chamber and crematorium. Initially, SS engineers constructed an improvised gas chamber in the basement of the prison block, Block 11. Later a larger, permanent gas chamber was constructed as part of the original crematorium in a separate building outside the prisoner compound.\n\nAt Auschwitz I, SS physicians carried out medical experiments in the hospital, Barrack (Block) 10. They conducted pseudoscientific research on infants, twins, and dwarfs, and performed forced sterilizations and castrations of adults. The best-known of these physicians was SS Captain Dr. Josef Mengele.\n\nWhen we think of the crimes of Nazi doctors, what comes to mind are their cruel and sometimes fatal experiments… Yet when we turn to the Nazi doctors’ role in Auschwitz, it was not the experiments that were most significant. Rather, it was his participation in the killing process—indeed his supervision of Auschwitz mass murder from beginning to end.1\n\nBetween the medical-experiments barrack and the prison block (Block 11) stood the \"Black Wall,\" where SS guards executed thousands of prisoners.\n\nAuschwitz II (Auschwitz-Birkenau)\n\nConstruction of Auschwitz II, or Auschwitz-Birkenau, began at Brzezinka in October 1941.\n\nOf the three camps established near Oswiecim, the Auschwitz-Birkenau camp had the largest total prisoner population. It was divided into ten sections separated by electrified barbed-wire fences. Like Auschwitz I, it was patrolled by SS guards, including—after 1942—SS dog handlers.\n\nThe camp included sections for women; men; a family camp for Roma (Gypsies) deported from Germany, Austria, and the Protectorate of Bohemia and Moravia; and a family camp for Jewish families deported from the Theresienstadt ghetto.\n\nAuschwitz-Birkenau was also a killing center and played a central role in the German effort to kill the Jews of Europe. Around the beginning of September, 1941, the SS at Auschwitz I conducted the first tests of Zyklon B as a mass murder agent, using Soviet POWs and debilitated Polish prisoners as victims. The “success” of these experiments led to the construction of a chamber in the crematorium of Auschwitz I that, like the subsequent gas chambers at Auschwitz, used Zyklon B to murder victims. The first transports of Jewish men, women, and children sent to Auschwitz as part of the “final solution” were murdered in this gas chamber (Crematorium I) in February and March 1942.\n\nDuring the first half of 1942, the Auschwitz SS moved the gassing operations to Auschwitz-Birkenau by converting two farmhouses just outside the camp’s fence into gas chambers. Bunker I began operating in spring 1942, the larger Bunker II in mid-summer 1942.\n\nThese gassing facilities soon proved inadequate for the task of murdering the large numbers of Jewish deportees being sent to Auschwitz. Between March and June 1943, four large crematoria were built within Auschwitz-Birkenau, each with a gas chamber, a disrobing area, and crematory ovens. Gassings ceased at Bunkers I and II when Crematoria II through V began operating, although Bunker II was put back into operation during the deportation of Hungary’s Jews in 1944. Gassing of newly arrived transports ceased at Auschwitz by early November 1944.\n\nJewish deportees arriving at Auschwitz-Birkenau immediately underwent selection. The SS staff chose some of the able-bodied for forced labor and sent the rest directly to the gas chambers, which were disguised as shower installations to mislead the victims. The belongings of all deportees were confiscated and sorted in the \"Kanada\" (Canada) warehouse for shipment back to Germany. Canada symbolized wealth to the prisoners.\n\nDeportations to Auschwitz\n\nTrains arrived at Auschwitz frequently with transports of Jews from virtually every country in Europe occupied by or allied to Germany. These transports arrived from early 1942 to early November 1944. The approximate breakdown of deportations from individual countries:\n\n\n\nHungary: 426,000\n\nPoland: 300,000\n\nFrance: 69,000\n\nNetherlands: 60,000\n\nGreece: 55,000\n\nBohemia and Moravia: 46,000\n\nSlovakia: 27,000\n\nBelgium: 25,000\n\nYugoslavia: 10,000\n\nItaly: 7,500\n\nNorway: 690\n\nOther (including concentration camps): 34,000\n\nWith the deportations from Hungary, the role of Auschwitz-Birkenau in the German plan to murder the Jews of Europe achieved its highest effectiveness. Between late April and early July 1944, approximately 440,000 Jews were deported from Hungary. Of the nearly 426,000 Hungarian Jews deported to Auschwitz, approximately 320,000 of them were sent directly to the gas chambers in Auschwitz-Birkenau. They deployed approximately 110,000 at forced labor in the Auschwitz camp complex. The SS authorities transferred many of these Hungarian Jewish forced laborers within weeks of their arrival in Auschwitz to other concentration camps in Germany and Austria.\n\nThe Prisoner Revolt at Auschwitz\n\nOn October 7, 1944, several hundred prisoners assigned to Crematorium IV at Auschwitz-Birkenau rebelled after learning that they were going to be killed. During the uprising, the prisoners killed three guards and blew up the crematorium and adjacent gas chamber. The prisoners used explosives smuggled into the camp by Jewish women who had been assigned to forced labor in a nearby armaments factory.\n\nThe Germans crushed the revolt and killed almost all of the prisoners involved in the rebellion. The Jewish women who had smuggled the explosives into the camp were publicly hanged in early January 1945.\n\nThe Auschwitz SS stopped gassing newly arrived prisoners by early November 1944. On orders from Himmler, camp officials began dismantling the crematoria. The SS destroyed the remaining gassing installations as Soviet forces approached in January 1945.\n\nAuschwitz III\n\nAuschwitz III, also called Buna or Monowitz, was established in October 1942. It housed prisoners assigned to work at the Buna synthetic rubber works, located on the outskirts of the small village of Monowice.\n\nIn the spring of 1941, German conglomerate I.G. Farben established a factory in which its executives intended to exploit concentration camp labor to manufacture synthetic rubber and fuels. I.G. Farben invested more than 700 million Reichsmarks (about 2.8 million US dollars in 1941 terms) in Auschwitz III. From May 1941 until July 1942, the SS had transported prisoners from Auschwitz I to the “Buna Detachment,” at first on foot and later by rail. (Between July and October 1942 there was a pause in transports, due to a typhus epidemic and quarantine.) With the construction of Auschwitz III in the autumn of 1942, prisoners deployed at Buna lived in Auschwitz III.\n\nAuschwitz III also had a so-called Labor Education Camp for non-Jewish prisoners who were perceived to have violated German-imposed labor discipline.\n\nAuschwitz Subcamps\n\nBetween 1942 and 1944, the SS authorities at Auschwitz established 44 subcamps. Some of them were established within the officially designated “development” zone, including Budy, Rajsko, Tschechowitz, Harmense, and Babitz. Others, such as Blechhammer, Gleiwitz, Althammer, Fürstengrube, Laurahuette, and Eintrachthuette were located in Upper Silesia north and west of the Vistula River. Some subcamps, such as Freudenthal and Bruenn (Brno), were located in Moravia.\n\nIn general, subcamps that produced or processed agricultural goods were administratively subordinate to Auschwitz-Birkenau. Subcamps whose prisoners were deployed at industrial and armaments production or in extractive industries (e.g., coal mining, quarry work) were administratively subordinate to Auschwitz-Monowitz. This division of administrative responsibility was formalized after November 1943.\n\nAuschwitz inmates were employed on huge farms, including the experimental agricultural station at Rajsko. They were also forced to work in coal mines, in stone quarries, in fisheries, and especially in armaments industries such as the SS-owned German Equipment Works (established in 1941). Periodically, prisoners underwent selection. If the SS judged them too weak or sick to continue working, they were transported to Auschwitz-Birkenau and killed.\n\nPrisoners selected for forced labor were registered and tattooed with identification numbers on their left arms in Auschwitz I. They were then assigned to forced labor at the main camp or elsewhere in the complex, including the subcamps.\n\nEvacuation of Auschwitz and its Subcamps\n\nIn mid-January 1945, as Soviet forces approached the Auschwitz concentration camp complex, the SS began evacuating Auschwitz and its subcamps.\n\nSS units forced nearly 60,000 prisoners to march west from the Auschwitz camp system. Thousands had been killed in the camps in the days before these death marches began.\n\nTens of thousands of prisoners, mostly Jews, were forced to march either northwest for 55 kilometers (approximately 30 miles) to Gliwice (Gleiwitz) or due west for 63 kilometers (approximately 35 miles) to Wodzislaw (Loslau) in the western part of Upper Silesia. Those forced to march northwest were joined by prisoners from subcamps in East Upper Silesia, such as Bismarckhuette, Althammer, and Hindenburg. Those forced to march due west were joined by inmates from the subcamps to the south of Auschwitz, such as Jawischowitz, Tschechowitz, and Golleschau.\n\nSS guards shot anyone who fell behind or could not continue. Prisoners also suffered from the cold weather, starvation, and exposure on these marches. At least 3,000 prisoners died on route to Gliwice alone. Possibly as many as 15,000 prisoners died during the evacuation marches from Auschwitz and the subcamps.\n\nUpon arrival in Gliwice and Wodzislaw, the prisoners were put on unheated freight trains and transported to concentration camps in Germany, particularly to Flossenbürg, Sachsenhausen, Gross-Rosen, Buchenwald, Dachau, and also to Mauthausen in Austria. The rail journey lasted for days. Without food, water, shelter, or blankets, many prisoners did not survive the transport.\n\nIn late January 1945, SS and police officials forced 4,000 prisoners to evacuate Blechhammer on foot. Blechhammer was a subcamp of Auschwitz-Monowitz. The SS murdered about 800 prisoners during the march to the Gross-Rosen concentration camp. SS officials also killed as many as 200 prisoners left behind in Blechhammer as a result of illness or unsuccessful attempts to hide. After a brief delay, the SS transported around 3,000 Blechhammer prisoners from Gross-Rosen to the Buchenwald concentration camp in Germany.\n\nThe Liberation of Auschwitz\n\nOn January 27, 1945, the Soviet army entered Auschwitz, Birkenau, and Monowitz and liberated about seven thousand prisoners, most of whom were ill and dying."}, {"url": "https://encyclopedia.ushmm.org/content/en/article/mauthausen", "page_content": "Establishment of the Mauthausen Camp\n\nNazi Germany incorporated Austria in the Anschluss of March 11-13, 1938. Shortly thereafter, Reichsführer-SS (SS chief) Heinrich Himmler, SS General Oswald Pohl, the chief of the SS Administration and Business Offices, and SS General Theodor Eicke, the Inspector of Concentration Camps, inspected a site they thought suitable for the establishment of a concentration camp to incarcerate, as Upper Austrian Nazi Party district leader August Eigruber put it, “traitors to the people from all over Austria.” The site was on the bank of the Danube River, near the “Wiener Graben” stone quarry, which was owned by the city of Vienna. It was located about three miles from the town of Mauthausen in Upper Austria, 12.5 miles southeast of Linz.\n\nAt the end of April 1938, the SS founded a company, German Earth and Stone Works Inc. (Deutsche Erd- und Steinwerke, GmbH-DESt), to exploit the granite which they intended to extract with concentration camp labor. In August 1938, the Inspectorate of Concentration Camps transferred approximately 300 prisoners, mostly Austrians and virtually all convicted repeat offenders or persons whom the Nazi regime classified as “asocials” from Dachau concentration camp to the Mauthausen site in order to begin construction of the new camp. By the end of 1938, Mauthausen held nearly 1,000 prisoners, still virtually all convicted criminals and asocials.\n\nPrisoners in the Camp\n\nThree months into World War II in December 1939, the number had increased to over 2,600 prisoners, primarily convicted criminals, \"asocials,\" political opponents, and religious conscientious objectors, such as Jehovah's Witnesses.\n\nAfter the Nazi regime initiated World War II, the number of prisoners arriving in Mauthausen increased dramatically and broadened in diversity. After the fall of France in June 1940, Vichy French authorities turned over to the German SS and police thousands of Spanish refugees, virtually all of whom had fought against General Francisco Franco's rebel troops during the Spanish Civil War, and who had fled to France after Franco overthrew the Spanish Republic in 1939. The SS and police incarcerated the overwhelming majority of the Spanish Republicans, more than 7,000, in Mauthausen in 1940 and 1941; individual members of the anti-Franco forces continued to trickle in to the camp until the last weeks of the war. Also incarcerated at Mauthausen were members of the International Brigades, most of them Communists of various nationalities, who had fought the Franco forces in Spain.\n\nAn estimated 197,464 prisoners passed through the Mauthausen camp system between August 1938 and May 1945. At least 95,000 died there. More than 14,000 were Jewish.\n\nPrisoners in Mauthausen: Overview\n\nDuring the war, the SS incarcerated more than 10,000 Soviet prisoners of war at Mauthausen, including 3,000 held at the Mauthausen subcamp Gusen. Nationals of virtually every German-occupied country in World War II came through Mauthausen. These included, among those prisoners who were registered:\n\nmore than 37,000 non-Jewish Poles\n\nnearly 23,000 Soviet civilians\n\nbetween 6,200 and 8,650 Yugoslav civilians\n\napproximately 6,300 Italians after September 1943\n\nat least 4,000 Czechs\n\nin 1944, 47 Allied military personnel (39 Dutchmen, 7 British soldiers and 1 US soldier), all of them agents of the British Secret Operations Executive\n\nFurther, the SS transported other thousands of prisoners to Mauthausen to be murdered without ever being registered as prisoners in the camp.\n\nCategory III Camp\n\nIn January 1941, SS General Reinhard Heydrich, the chief of the Reich Main Office for Security (Reichssicherheitshauptamt; RSHA), designated Mauthausen as a category III concentration camp, in which the SS would incarcerate only those prisoners whom the RSHA deemed to be \"severely incriminated, especially previously convicted criminals and asocials—that means protective detainees who have only remote potential for reform.\"\n\nJewish Prisoners\n\nBefore May 1944, the SS incarcerated relatively few Jews at Mauthausen. The total number of Jewish prisoners at Mauthausen between 1938 and the end of February 1944 was around 2,760. Most of them were reported dead by the end of 1943. From March through December 1944, at least 13,826 Jews arrived in Mauthausen, most of them Hungarian and Polish Jews and approximately 500 of them women. The SS had deported virtually all of them from Auschwitz-Birkenau and Plaszow camps to Mauthausen. In all, the SS registered 25,271 Jews in the Mauthausen camp complex, though the actual number of Jews, including arrivals during the last week of the war when the prisoner registration process broke down, may have pushed the number as high as 29,500.\n\nWomen Prisoners\n\nOther than four Yugoslav women whom the SS brought to Mauthausen with 46 men to be shot in April 1942, the first female prisoners in Mauthausen were two dozen women from Ravensbrück, whom the SS transferred to provide sex for favored male prisoners. The women arrived in June 1942 and lived in the first bordello established in the Nazi concentration camp system. Over the next two years, the SS brought a few hundred women to Mauthausen either to kill them or to hold them temporarily in transit before transfer to other camps.\n\nThe first women registered as prisoners at Mauthausen (as opposed to Ravensbrück, arrived on October 5, 1943. With the arrival of more women in 1944, the Inspectorate of Concentration Camps classified Mauthausen as a women's concentration camp (Frauen-Konzentrationslager) on September 15, 1944. By the end of September 1944, 459 women were in the main camp:\n\n392 political prisoners (non-Jewish)\n\n38 Jehovah's Witnesses\n\n29 so-called asocials\n\nSix months later, on March 31, 1945, the SS reported 2,252 female prisoners in the Mauthausen system. Again, the majority were non-Jewish political prisoners (1,453), but the 608 Jewish women belonged to the second largest female prisoner category. Also reported among the female prisoners were:\n\n43 Jehovah's Witnesses\n\n79 Roma (Gypsies)\n\n62 so-called asocials\n\n5 women classified as Spanish Republicans\n\n2 classified as convicted criminals\n\nBy February 1945, the SS had set aside three barracks in the main camp for female prisoners.\n\nOperation K\n\nIn March 1944, the German Armed Forces High Command (OKW) issued a decree (so-called “Bullet Decree” or “Operation K”) mandating the transport of escaped and recaptured prisoners of war, other than British and US prisoners, to Mauthausen to be shot. The decree applied to all recaptured officers and those recaptured non-commissioned officers deemed no longer capable of work. The SS imprisoned the recaptured soldiers in barrack 20 in Mauthausen and shot some of them, while beating or starving others to death. The SS incarcerated and killed approximately 5,000 recaptured prisoners of war in Mauthausen within the framework of “Operation K.” Approximately 85 percent of the recaptured prisoners were Soviet soldiers; the remainder included Polish, Yugoslav, Dutch, French, and Belgian soldiers.\n\nSections of the Mauthausen Camp\n\nThe main Mauthausen camp (Stammlager) had three principal sections:\n\nCamp I, the original protective detention camp\n\nCamp II, the camp workshop area, where prisoners were forced to work, and which the SS later converted to prisoner barracks in spring 1944\n\nCamp III, built in the spring and summer of 1944 to accommodate the influx of Hungarian Jews\n\nLocated at the opposite side of the roll call square from Camp I was a chain of long stone buildings that housed various camp services such as the prisoners' kitchen, showers, laundry, the bunker and, eventually, the gas chamber. Nearby stood the crematoria facilities along with the site where the camp staff shot prisoners.\n\nTo the west, off the entrance road to the main camp, was the so-called infirmary camp. The SS originally constructed this facility in fall 1941 for Soviet prisoners of war; hence it was frequently referred to as the \"Russian camp.\" From the spring of 1943, the camp authorities incarcerated ill or weak prisoners in this \"infirmary\" camp, where patients received little or no treatment and most eventually died.\n\nEast northeast of the main camp was the so-called tent camp, which consisted of 14 large tents with a total inner surface of 6,200 square yards. The camp authorities erected it in the autumn of 1944 to accommodate large groups of prisoners evacuated from concentration camps and forced-labor camps in the East. In the winter of 1945, the overwhelming majority of inmates in the so-called tent camp were Hungarian and Polish Jews.\n\nThe various camps were surrounded by walls and/or electrified wire. Watchtowers and SS guards surrounded the entire complex. The SS commandant's office and the barracks for the SS administrative personnel and guard units were located west of the camp.\n\nSS Staff and SS Guard Detachment\n\nMauthausen's first commandant was SS Captain Albert Sauer, who presided over the establishment of the camp on August 1, 1938 and remained commandant until February 17, 1939. SS Colonel Franz Ziereis replaced Sauer and remained the commandant of Mauthausen until May 1945.\n\nAfter March 1940, SS Captain Georg Bachmayer was 1st Protective Detention Camp commandant, with responsibility for the prisoners while they were inside the camp. In 1938-1939, the 4th Regiment (\"Ostmark\") of the SS Death's-Head Units (SS-Totenkopfverbände) guarded the perimeter of the Mauthausen concentration camp as well as prisoner work detachments deployed outside the camp. In 1940-1941, the guard unit, renamed SS Death's-Head Battalion (SS-Totenkopf-Sturmbann) and upgraded in strength to battalion size, was administratively subordinated to the Waffen SS, though the camp commandant still issued all operational orders to the battalion.\n\nBeginning in 1942, the SS authorities deployed an increasing number of ethnic German Waffen SS recruits from Slovakia, Romania, Hungary, and Croatia to serve in the Death's-Head Battalions at all concentration camps, including Mauthausen. In 1944 and 1945, Trawniki-trained guards (some of them veterans of Operation Reinhard deportation operations or killing centers), air force, and naval as well as other military personnel, and, later, municipal police (Schutzpolizei) personnel and firefighters, served in the SS Death's-Head Battalion at Mauthausen and its subcamps.\n\nKilling Operations at Mauthausen\n\nThe Mauthausen camp authorities killed specially targeted groups of persons sent to Mauthausen for that purpose. They also killed those inmates deemed too weak or sick to work.\n\nGassing and Euthanasia\n\nSeveral methods of killing were used. As in other camps, the Mauthausen authorities began to use gas as a means of killing in 1941–42. Like some other concentration camps, Mauthausen was equipped with a stationary gas chamber with the capacity to kill up to 80 people at a time by means of Zyklon B gas (prussic acid). In 1942, the Reich Security Main Office provided the camp authorities with a mobile gas van with the capacity to kill about 30 persons at a time. The SS dispatched, in addition, 2,960 prisoners from Mauthausen and 1,881 from Gusen, a total of 4.841 prisoners, to the Hartheim sanatorium and “euthanasia” killing center to be killed. German physicians and camp authorities had selected the victims within the framework of “Operation 14f13,” the extension of the Nazi “euthanasia policy” to the concentration camps.\n\nMedical Experiments\n\nGerman doctors subjected Mauthausen prisoners to pseudoscientific medical experiments, including testing levels of testosterone, experimenting with delousing chemicals, medicines for tuberculosis, and nutrition experiments. Camp physician Hermann Richter surgically removed significant organs—e.g., stomach, liver, or kidneys—from living prisoners solely in order to determine how long a prisoner could survive without the organ in question. Eduard Krebsbach, the executive camp doctor between autumn 1941 and autumn 1943, killed an undetermined number of prisoners by injecting phenol directly into their hearts.\n\nShooting, Hanging, Mistreatment, and Harsh Conditions\n\nThe SS also killed thousands of prisoners by shooting, hanging, and mistreatment. Tens of thousands more died as a direct result of the harsh living conditions in the camp, succumbing to starvation, exposure, and disease.\n\nForced Labor and Subcamps of Mauthausen\n\nFrom the beginning, camp authorities deployed Mauthausen prisoners at forced labor, constructing the camp itself or at back-breaking work in the Wiener Graben stone quarry. As labor became increasingly scarce and the forced labor of camp inmates became increasingly important, especially in war-related industries, the number of prisoners incarcerated at Mauthausen and it subcamps steadily increased. On January 1, 1945, the Mauthausen camp system had 73,351 prisoners, 959 of them women. At this time Mauthausen incarcerated more male prisoners than any other concentration camp system in Nazi Germany, and had the third largest total prisoner population, behind Buchenwald and Gross-Rosen.\n\nAfter the SS Economic-Administration Main Office (SS-Wirtschafts-Verwaltungshauptamt; WVHA) assumed control of the Inspectorate of Concentration Camps and the camp system in March 1942, the SS established hundreds of subcamps throughout the so-called Greater German Reich. Subordinate to the main concentration camps, these subcamps were generally located in the vicinity of factories, stone quarries and mines, in which SS labor allocation officers deployed prisoners transferred from the main camp. Between 1940 and 1945, the SS authorities established nearly 50 subcamps in the Mauthausen concentration camp system, most of them in 1943 and 1944.\n\nAmong the most important subcamps were:\n\nGusen (1940–1945)\n\nSteyr-Münichholz (1942–1945)\n\nEbensee (1943–1945)\n\nWiener Neudorf (1943–1945)\n\nWiener Neustadt (1943, 1944–1945)\n\nMelk (1944–1945)\n\nthe detention camp Gunskirchen (1945)\n\nAmstetten (1945)\n\nResistance at Mauthausen\n\nAs early as 1943, Spanish Republicans incarcerated inside Mauthausen, drawing upon their expertise as communist fighters and their contacts to Czech, French, and German members of the International Brigades, established small clandestine networks of resistance inside the camp. By the winter of 1944–45, these groups had established underground formations armed with weapons stolen from the camp arsenal.\n\nDuring the course of 1944, French, Czech, and Austrian camp inmates, primarily communists, formed networks of self-help and resistance. In winter 1944–45 the formation of another resistance network of Czech, Polish, German, and Austrian inmates is documented for the “infirmary” camp. Their most effective activities involved providing food for starving prisoners, hiding prisoners temporarily, often in the infirmary, and protecting prisoners against arbitrary torture and mistreatment from Kapos.\n\nOutside the Communist organizations, self-help resistance groups developed along lines of nationality. During the night of February 1–2, 1945, more than 400 Soviet prisoners of war incarcerated in barrack 20 killed the SS appointed prisoner administrators and broke out of the camp. German SS and police units, military units, units of the so-called People's Assault (Volksturm), a national conscript militia of men over 60 and youths under 18 years of age, German police officials, SA, and Nazi Party formations engaged in a massive manhunt, which they dubbed cynically a “hare shoot.” The Germans recaptured or killed virtually all of the prisoners.\n\nOn March 23, 1945, several hundred female prisoners of subcamp Amstetten, whom the SS authorities had withdrawn to Mauthausen after the Allies bombed the train station in Amstetten and killed 34 women, refused to return to Amstetten, despite the threats of Protective Detention Camp Commandant Bachmayer. This was first and only case of a mass refusal to deploy to work.\n\nLiberation of Mauthausen\n\nLiberation of Mauthausen camp and subcamps As Allied and Soviet forces advanced into Germany, the SS forcibly evacuated concentration camps near the front lines to prevent the liberation of large numbers of prisoners. Prisoners evacuated by train, by truck, and by forced march from Auschwitz, Sachsenhausen, and Gross-Rosen began arriving at Mauthausen in early 1945. As a result, the camp—as well as most subcamps—became lethally overcrowded, with existing dreadful conditions deteriorating still further. Thousands of prisoners died from starvation or disease. Typhus epidemics further reduced the camp's population.\n\nMauthausen's gas chamber remained operative until the very last days of the war. The SS murdered nearly 3,000 prisoners from the infirmary after a selection on April 20, 1945. The camp authorities carried out the last mass murder in the gas chamber on April 28, 1945. The victims were 33 Upper Austrian Social Democratic and Communist opponents of the regime.\n\nOn May 3, 1945, the SS abandoned the camp to the custody of a guard unit of 50 Viennese firefighters, who remained on the perimeter of the camp. Members of an “International Committee” formed by the prisoners in the last days of April administered the camp as units of the US Army arrived at the camp and secured the surrounding area on May 5. Further units, including the 11th Armored Division of the Third Army, arrived in the succeeding days.\n\nPostwar Trials\n\nUS troops captured Mauthausen camp commandant Franz Ziereis on May 23, 1945, in a mountain hut. Ziereis was shot in the abdomen during a reported attempt to escape and died a day or two thereafter. Before his death, former camp prisoners interrogated him in the Gusen protective detention camp; this deathbed testimony was available to prosecutors at the Nuremberg Trial. Protective detention camp commandant Georg Bachmayer chose suicide as a means of escaping justice on May 8, 1945, after he shot his wife and two children.\n\nNumerous members of the camp administrative staff and the guard units were prosecuted after the war. In a proceeding on the site of the Dachau concentration camp, a US Military Tribunal prosecuted deputy preventative detention camp commandant Hans Altfuldisch and 60 other defendants associated with Mauthausen in the spring of 1946. The tribunal convicted all 61 defendants, sentenced 58 to death and three to life imprisonment on May 13, 1946. On appeal, nine of the death sentences were commuted to prison sentences. US authorities executed 49 of the defendants and released the remaining twelve convicts in 1950 and 1951.\n\nUS military tribunals tried approximately 224 other persons associated with Mauthausen (officials, guards, prisoner functionaries, prisoners, and implicated civilians) in about 60 further proceedings at Dachau in 1947. Military judges convicted more than 90% of the defendants.\n\nAustrian authorities prosecuted and convicted several defendants associated with Mauthausen in several trials after the war. The Federal Republic of Germany also conducted numerous proceedings against persons accused of Nazi crimes at Mauthausen and its subcamps. Perhaps the most extensive German investigation involved the proceedings against Karl Schulz and Anton Streitwieser, respectively, the chief of the political department in the main camp and the commandant of several Mauthausen subcamps. US Federal civil courts stripped four former Mauthausen guards of their US citizenship during the 1980s, after the Department of Justice's Office of Special Investigations brought suit against them for participation in Nazi-sponsored persecution.\n\nAn estimated 197,464 prisoners passed through the Mauthausen camp system between August 1938 and May 1945. At least 95,000 died there. More than 14,000 were Jewish."}]}