{"Alfred Fischer was assigned to the Auschwitz concentration camp in May 1944, replacing Rudolf Höss.": [{"url": "https://encyclopedia.ushmm.org/content/en/article/auschwitz-key-dates", "page_content": "January 25, 1940\n\nThe SS decides to construct a concentration camp near Oswiecim (Auschwitz).\n\nMay–June, 1940\n\nThe first prisoners arrive at Auschwitz. On May 20, 1940, a transport arrives of about 30 German inmates, categorized as \"professional criminals.\" The SS had selected them from the Sachsenhausen concentration camp outside of Berlin. Less than a month later, on June 14, German authorities in occupied Poland deport 728 Polish prisoners from a prison in Tarnow to Auschwitz. This is the first of many transports of Poles to the Auschwitz camp.\n\nMarch 1, 1941\n\nReichsfuehrer SS and Chief of German Police Heinrich Himmler inspects Oswiecim (Auschwitz). Because nearby factories use prisoners for forced labor, Himmler is concerned about the prisoner capacity of the camp. On this visit, he orders both the expansion of Auschwitz I camp facilities to hold 30,000 prisoners and the building of a camp near Birkenau for an expected influx of 100,000 Soviet prisoners of war. Himmler also orders that the camp supply 10,000 prisoners for forced labor to construct an I.G. Farben factory complex at Dwory, about a mile away. Himmler will make additional visits to Auschwitz in 1942, when he will witness the killing of prisoners in the gas chambers.\n\nSeptember 3, 1941\n\nThe first gassings of prisoners occur in Auschwitz I. The SS tests Zyklon B gas by killing 600 Soviet prisoners of war and 250 other ill or weak prisoners. Testing takes place in a makeshift gas chamber in the cellar of Block 11 in Auschwitz I. Zyklon B was the commercial name for crystalline hydrogen cyanide gas, manufactured by I.G. Farben and normally used as an insecticide. The \"success\" of these experiments will lead to the adoption of Zyklon B as the killing agent for the yet-to-be-constructed Auschwitz-Birkenau killing center.\n\nJanuary 25, 1942\n\nSS chief Heinrich Himmler informs Richard Gluecks, the Inspector of Concentration Camps, that 100,000 Jewish men and 50,000 Jewish women would be deported from Germany to Auschwitz as forced laborers.\n\nFebruary 15, 1942\n\nThe first transport of Jews from Bytom (Beuthen) in German-annexed Upper Silesia arrives in Auschwitz I. The SS camp authorities kill all those on the transport immediately upon arrival with Zyklon B gas.\n\nDecember 31, 1942\n\nGerman SS and police authorities deported approximately 175,000 Jews to Auschwitz in 1942.\n\nJanuary 1–March 31, 1943\n\nGerman SS and police authorities deport approximately 105,000 Jews to Auschwitz.\n\nJanuary 29, 1943\n\nThe Reich Central Office for Security orders all designated Roma (Gypsies) residing in Germany, Austria, and the Protectorate of Bohemia and Moravia to be deported to Auschwitz.\n\nFebruary 26, 1943\n\nThe first transport of Roma (Gypsies) from Germany arrives at Auschwitz. Without separating families, the SS authorities house them in Section B-IIe of Auschwitz-Birkenau, which becomes known as the Zigeunerlager (\"Gypsy camp\"). By the end of 1943, more than 18,000 Roma will be incarcerated there. Eventually, as many as 23,000 Roma will be deported to the Auschwitz camp complex. Of these, approximately 21,000 will be murdered in the gas chambers or die as a result of starvation and disease.\n\nApril 1, 1943–March 1944\n\nGerman SS and police authorities deport approximately 160,000 Jews to Auschwitz.\n\nMay 2, 1944\n\nThe first two transports of Hungarian Jews arrive in Auschwitz.\n\nJuly 6, 1944\n\nThe deportation of Hungarian Jews is halted by order of Regent Miklos Horthy. The last transport from Hungary arrives on July 11.\n\nAugust 2, 1944\n\nSS camp authorities murder the last residents—up to 5,000—of the so-called Gypsy family camp in Auschwitz-Birkenau. In all the SS murdered at least 19,000 of the 23,000 Roma (Gypsies) deported to the Auschwitz concentration camp complex.\n\nApril 1944–November 1944\n\nSS and Police authorities deport more than 585,000 Jews to Auschwitz.\n\nOctober 7, 1944\n\nMembers of the Jewish prisoner \"special detachment\" (Sonderkommando) that was forced to remove bodies from the gas chambers and operate the crematoria stage an uprising. They successfully blow up Crematorium IV and kill several guards. Women prisoners had smuggled gunpowder out of nearby factories to members of the Sonderkommando. The SS quickly suppresses the revolt and kills all the Sonderkommando members. On January 6, 1945, just weeks before Soviet forces liberate the camp, the SS will also hang four women who smuggled gunpowder into the camp.\n\nNovember 25, 1944\n\nAs Soviet forces continue to approach, SS chief Heinrich Himmler orders the destruction of the Auschwitz-Birkenau gas chambers and crematoria. During this SS attempt to destroy the evidence of mass killings, prisoners will be forced to dismantle and dynamite the structures.\n\nJanuary 12, 1945\n\nA Soviet offensive breaches the German defenses on the Vistula; Soviet troops take Warsaw and advance rapidly on Krakow and Oswiecim.\n\nJanuary 17–27, 1945\n\nAs Soviet units approach, the SS evacuates to the west the prisoners of the Auschwitz concentration camp complex. Tens of thousands of prisoners, mostly Jews, are forced to march to the cities of Wodzislaw and Gliwice in the western part of Upper Silesia. During the march, SS guards shoot anyone who cannot continue. In Wodzislaw and Gliwice, the prisoners will be put on unheated freight trains and deported to concentration camps in Germany, particularly to Flossenbürg, Sachsenhausen, Gross-Rosen, Buchenwald, and Dachau, and to Mauthausen in Austria. In all, nearly 60,000 prisoners are forced on death marches from the Auschwitz camp system. As many as 15,000 die during the forced marches. Thousands more were killed in the days before the evacuation.\n\nJanuary 27, 1945\n\nSoviet troops enter the Auschwitz camp complex and liberate approximately 7,000 prisoners remaining in the camp. During the existence of Auschwitz, the SS camp authorities killed nearly one million Jews from across Europe. Other victims included approximately 74,000 Poles, approximately 21,000 Roma (Gypsies), and approximately 15,000 Soviet prisoners of war."}, {"url": "https://encyclopedia.ushmm.org/content/en/article/collections-highlight-auschwitz-through-the-lens-of-the-ss", "page_content": "In January 2007, the United States Holocaust Memorial Museum Archives received a donation of a photograph album. The inscription \"Auschwitz 21.6.1944\" on its first page signaled the uniqueness of the album—there are very few wartime photographs of the Auschwitz concentration camp complex, which included Auschwitz-Birkenau, the largest Nazi killing center.\n\n[caption=64d6d7db-7652-489e-82dc-147e8533f8ec] - [credit=64d6d7db-7652-489e-82dc-147e8533f8ec]\n\nThough his name does not appear anywhere in the album, the dates of the photographs and various decorations including adjutant cords on the uniform of the album's owner, indicate that the album almost certainly belonged to and was created by SS-Obersturmführer Karl Höcker, the adjutant to the commandant of Auschwitz, SS-Sturmbannführer Richard Baer. Höcker was stationed at Auschwitz from May 1944 until the evacuation of the camp in January 1945.\n\nThe photographs depict Höcker with other SS officers in Auschwitz in the summer and fall of 1944 and provide us with a new understanding of their lives and activities in the camp. Even in the final months of the war, after Soviet troops had liberated concentration camps and labor camps to the east, SS officers stationed at Auschwitz enjoyed social functions and formal ceremonies. The album shows Auschwitz at a pivotal time—the period during which the gas chambers were operating at maximum efficiency—as the Hungarian Jews arrived and during the last months before the evacuation of the camp. The only other known album of photographs taken at Auschwitz, published as the \"Auschwitz Album\" (first published in 1980), specifically depicts the arrival of the Hungarian Jews and the selection process that the SS imposed upon them.\n\nIn December 2006, a retired US Army Lieutenant Colonel and former member of the Counter Intelligence Corps (CIC) wrote to the United States Holocaust Memorial Museum (USHMM) Archives. As one of its many tasks as a military intelligence agency, the CIC conducted investigations of Nazi perpetrators for US prosecutors in the Judge Advocate General's Office after World War II. While stationed in Germany in 1946, this officer had found a photograph album in an abandoned apartment in Frankfurt and had taken it home with him. Now elderly, he was ready to donate the album to the Museum, but wanted his donation to remain anonymous.\n\nKarl Höcker, the SS officer who owned the album, shows up on almost every page of photographs, but rarely appears in historical records. Yet he was the adjutant to the commandant of the Auschwitz complex for some of the most murderous months of the camp's existence. Who was he? How did he get to Auschwitz? What did he do there?\n\nKarl Höcker was born in Engershausen, Germany, in December 1911, as the youngest of six children. His father, a construction worker, was killed in World War I, and his mother struggled to support the family. Höcker, who worked as a bank teller in Lubbecke, joined the SS in 1933 and the Nazi Party in 1937. He married in 1937, had a daughter in 1939 and, in October 1944, a son. Upon the outbreak of war, Höcker was assigned to the Neuengamme concentration camp and spent the entire war administering various concentration camps. In 1943, he became the adjutant to the commandant at Lublin-Majdanek.\n\nWhen SS-Sturmbannführer Richard Baer became the commandant of Auschwitz in May 1944, Höcker was also reassigned to the camp, again in the position of adjutant. Before he was executed for war crimes, Rudolf Höss, the most famous commandant of Auschwitz, described the role of the adjutant in his memoirs:\n\n[The adjutant] is the first assistant to the Kommandant. He must ensure that no important event in the camp remains unknown to the Kommandant. The adjutant is the superior of all noncommissioned officers and men of the Kommandant's staff... The officer of the day and the first watch commander report to the adjutant, present their duty reports for this information and sign them...1\n\nHöcker remained at Auschwitz until its evacuation, and then moved with Baer in January 1945 when Baer assumed command of Dora-Mittelbau. Höcker fled before the Allies liberated the camp. British troops captured him near Hamburg in possession of identification as a combat soldier. Lacking an accurate description of him, British authorities released Höcker in 1946 after only 18 months' incarceration in a prisoner-of-war camp. Until West German prosecutors began looking for him in the wake of the Eichmann trial, no one came for Karl Höcker. He resumed his life in Engershausen with his wife and two children. He had turned himself in for a de-Nazification proceeding in 1952 but did not serve any time. He took up gardening in his spare time and became the chief cashier of the regional bank in Lubbecke. Though he lost his job when he was indicted in 1963 during the Frankfurt Auschwitz proceedings in 1963-1965, he was rehired in 1970 after his release from prison."}, {"url": "https://www.history.com/topics/world-war-ii/auschwitz", "page_content": "Auschwitz, also known as Auschwitz-Birkenau, opened in 1940 and was the largest of the Nazi concentration and death camps. Located in southern Poland, Auschwitz initially served as a detention center for political prisoners. However, it evolved into a network of camps where Jewish people and other perceived enemies of the Nazi state were exterminated, often in gas chambers, or used as slave labor. Some prisoners were also subjected to barbaric medical experiments led by Josef Mengele (1911-79). During World War II (1939-45), more than 1 million people, by some accounts, lost their lives at Auschwitz. In January 1945, with the Soviet army approaching, Nazi officials ordered the camp abandoned and sent an estimated 60,000 prisoners on a forced march to other locations. When the Soviets entered Auschwitz, they found thousands of emaciated detainees and piles of corpses left behind.\n\nAuschwitz: Genesis of Death Camps\n\nAfter the start of World War II, Adolf Hitler (1889-1945), the chancellor of Germany from 1933 to 1945, implemented a policy that came to be known as the “Final Solution.” Hitler was determined not just to isolate Jews in Germany and countries annexed by the Nazis, subjecting them to dehumanizing regulations and random acts of violence. Instead, he became convinced that his “Jewish problem” would be solved only with the elimination of every Jew in his domain, along with artists, educators, Romas, communists, homosexuals, the mentally and physically handicapped and others deemed unfit for survival in Nazi Germany.\n\nDid you know? In October 1944, a group of Auschwitz \"Sonderkommando,\" young Jewish males responsible for removing corpses from crematoriums and gas chambers, staged a revolt. They assaulted their guards, using tools and makeshift explosives, and demolished a crematorium. All were apprehended and killed.\n\nTo complete this mission, Hitler ordered the construction of death camps. Unlike concentration camps, which had existed in Germany since 1933 and were detention centers for Jews, political prisoners and other perceived enemies of the Nazi state, death camps existed for the sole purpose of killing Jews and other “undesirables,” in what became known as the Holocaust.\n\nAuschwitz: The Largest of the Death Camps\n\nAuschwitz, the largest and arguably the most notorious of all the Nazi death camps, opened in the spring of 1940. Its first commandant was Rudolf Höss (1900-47), who previously had helped run the Sachsenhausen concentration camp in Oranienburg, Germany. Auschwitz was located on a former military base outside Oswiecim, a town in southern Poland situated near Krakow, one of the country’s largest cities. During the camp’s construction, nearby factories were appropriated and all those living in the area were forcibly ejected from their homes, which were bulldozed by the Nazis.\n\nAuschwitz originally was conceived as a concentration camp, to be used as a detention center for the many Polish citizens arrested after Germany annexed the country in 1939. These detainees included anti-Nazi activists, politicians, resistance members and luminaries from the cultural and scientific communities. Once Hitler’s Final Solution became official Nazi policy, however, Auschwitz was deemed an ideal death camp locale. For one thing, it was situated near the center of all German-occupied countries on the European continent. For another, it was in close proximity to the string of rail lines used to transport detainees to the network of Nazi camps.\n\nHowever, not all those arriving at Auschwitz were immediately exterminated. Those deemed fit to work were employed as slave labor in the production of munitions, synthetic rubber and other products considered essential to Germany’s efforts in World War II.\n\nAuschwitz and Its Subdivisions\n\nAt its peak of operation, Auschwitz consisted of several divisions. The original camp, known as Auschwitz I, housed between 15,000 and 20,000 political prisoners. Those entering its main gate were greeted with an infamous and ironic inscription: “Arbeit Macht Frei,” or “Work Makes You Free.”\n\nAuschwitz II, located in the village of Birkenau, or Brzezinka, was constructed in 1941 on the order of Heinrich Himmler (1900-45), commander of the “Schutzstaffel” (or Select Guard/Protection Squad, more commonly known as the SS), which operated all Nazi concentration camps and death camps. Birkenau, the biggest of the Auschwitz facilities, could hold some 90,000 prisoners.\n\nIt also housed a group of bathhouses where countless people were gassed to death, and crematory ovens where bodies were burned. The majority of Auschwitz victims died at Birkenau. More than 40 smaller facilities, called subcamps, dotted the landscape and served as slave-labor camps. The largest of these subcamps, Monowitz, also known as Auschwitz III, began operating in 1942 and housed some 10,000 prisoners.\n\nLife and Death in Auschwitz\n\nBy mid-1942, the majority of those being sent by the Nazis to Auschwitz were Jews. Upon arriving at the camp, detainees were examined by Nazi doctors. Those detainees considered unfit for work, including young children, the elderly, pregnant women and the infirm, were immediately ordered to take showers. However, the bathhouses to which they marched were disguised gas chambers. Once inside, the prisoners were exposed to Zyklon-B poison gas. Individuals marked as unfit for work were never officially registered as Auschwitz inmates. For this reason, it is impossible to calculate the number of lives lost in the camp.\n\nFor those prisoners who initially escaped the gas chambers, an undetermined number died from overwork, disease, insufficient nutrition or the daily struggle for survival in brutal living conditions. Arbitrary executions, torture and retribution happened daily in front of the other prisoners.\n\nSome Auschwitz prisoners were subjected to inhumane medical experimentation. The chief perpetrator of this barbaric research was Josef Mengele (1911-79), a German physician who began working at Auschwitz in 1943. Mengele, who came to be known as the “Angel of Death,” performed a range of experiments on detainees. For example, in an effort to study eye color, he injected serum into the eyeballs of dozens of children, causing them excruciating pain. He also injected chloroform into the hearts of twins to determine if both siblings would die at the same time and in the same manner.\n\nLiberation of Auschwitz: 1945\n\nAs 1944 came to a close and the defeat of Nazi Germany by the Allied forces seemed certain, the Auschwitz commandants began destroying evidence of the horror that had taken place there. Buildings were torn down, blown up or set on fire, and records were destroyed.\n\nIn January 1945, as the Soviet army entered Krakow, the Germans ordered that Auschwitz be abandoned. Before the end of the month, in what came to be known as the Auschwitz death marches, an estimated 60,000 detainees, accompanied by Nazi guards, departed the camp and were forced to march to the Polish towns of Gliwice or Wodzislaw, some 30 miles away. Countless prisoners died during this process; those who made it to the sites were sent on trains to concentration camps in Germany.\n\nWhen the Soviet army entered Auschwitz on January 27, they found approximately 7,600 sick or emaciated detainees who had been left behind barbed wire. The liberators also discovered mounds of corpses, hundreds of thousands of pieces of clothing and pairs of shoes and seven tons of human hair that had been shaved from detainees before their liquidation. According to some estimates, between 1.1 million to 1.5 million people, the vast majority of them Jews, died at Auschwitz during its years of operation. An estimated 70,000 to 80,000 Poles perished at the camp, along with 19,000 to 20,000 Romas and smaller numbers of Soviet prisoners of war and other individuals.\n\nAuschwitz Today\n\nToday, Auschwitz is open to the public as the Auschwitz-Birkenau Memorial and Museum. It tells the story of the largest mass murder site in history and acts as a reminder of the horrors of genocide.\n\nImages from the Death Camps Adolph Hitler and the Nazi regime set up networks of concentration camps before and during World War II to carry out a plan of genocide. Hitler's \"final solution\" called for the eradication of Jewish people and other \"undesirables,\" including homosexuals, gypsies and people with disabilities. The children pictured here were held at the Auschwitz concentration camp in Nazi-occupied Poland. Survivors at the Wobbelin concentration camp in northern Germany were found by the U.S. Ninth Army in May 1945. Here, one man breaks out in tears when he finds he is not leaving with the first group to be taken to the hospital. Survivors at Buchenwald concentration camp are shown in their barracks after liberation by the Allies in April 1945. The camp was located in a wooded area in Ettersberg, Germany, just east of Weimar. Elie Wiesel, the Nobel Prize winning author of Night, is on the second bunk from the bottom, seventh from the left. Fifteen-year-old Ivan Dudnik was brought to Auschwitz from his home in the Oryol region of Russia by the Nazis. While being rescued after the liberation of Auschwitz, he had reportedly gone insane after witnessing mass horrors and tragedies at the camp. Allied troops are shown in May 1945 discovering Holocaust victims in a railroad car that did not arrive at its final destination. It was believed this car was on a journey to the Wobbelin concentration camp near Ludwigslust, Germany where many of the prisoners died along the way. A total of 6 million lives were lost as a result of the Holocaust. Here, a pile of human bones and skulls is seen in 1944 at the Majdanek concentration camp in the outskirts of Lublin, Poland. Majdanek was the second largest death camp in Nazi-occupied Poland after Auschwitz. A body is seen in a crematory oven in the Buchenwald concentration camp near Weimar, Germany in April 1945. This camp not only imprisoned Jews, it also included Jehovah’s Witnesses, gypsies, German military deserters, prisoners of war, and repeat criminals. Auschwitz camp, as seen in April 2015. Nearly 1.3 million people were deported to the camp and more than 1.1 million perished. Although Auschwitz had the highest death rate, it also had the highest survival rate of all the killing centers. Prosthetic legs and crutches are a part of a permanent exhibition in the Auschwitz Museum. On July 14, 1933, the Nazi government enforced the “Law for Prevention of Progeny with Hereditary Diseases” in their attempt to achieve a purer “master” race. This called for the sterilization of people with mental illness, deformities, and a variety of other disabilities. Hitler later took it to more extreme measures and between 1940 and 1941, 70,000 disabled Austrians and Germans were murdered. Some 275,000 disabled people were murdered by the end of the war. A pile of footwear are also a part of the Auschwitz Museum. 1 / 10 : DeAgostini/Getty Images\n\nSoviet Red Army soldiers stand with liberated prisoners of the Auschwitz Concentration Camp in this 1945 photo. An aerial reconnaissance photograph over occupied Poland, shows Auschwitz II (Birkenau Extermination Camp) on December 21, 1944. It is one of a series of aerial photographs taken by Allied reconnaissance units under the command of the 15th U.S. Army Air Force during missions dating between April 4, 1944 and January 14, 1945. Hungarian Jews arrive in Auschwitz-Birkenau, in German-occupied Poland in June 1944. Between May 2 and July 9, more than 425,000 Hungarian Jews were deported to Auschwitz. Men selected for forced labor from amongst Hungarian Jews in Auschwitz-Birkenau, in German-occupied Poland, June 1944. In this photo taken in January 1945, survivors stand behind the gates of the camp at Auschwitz, as they watch the arrival of Soviet troops. This photo of Auschwitz survivors was taken by a Soviet photographer in February 1945 during the making of a film about the liberation of the camp. Child survivors of Auschwitz show their tattooed arms in a photo as part of the film about the camp's liberation. Soviet filmmakers dressed the children in clothing from adult prisoners A 15-year-old Russian boy, Ivan Dudnik, is rescued. The teen was brought to Auschwitz from his home in the Orel region by the Nazis. Two children pose in the Auschwitz medical station after the camp's liberation. The Soviet army entered Auschwitz on January 27, 1945 and released more than 7,000 remaining prisoners, most of whom were ill and dying. This is a card taken from hospital files produced by Soviet staff after the liberation of the camp. The information about the patient, labeled No. 16557, reads, \"Bekrie, Eli, 18 years, from Paris. alimentary dystrophy, third degree.\" This medical card shows 14-year-old Hungarian boy, Stephen Bleier. The card diagnoses Bleier with alimentary dystrophy, second degree. A Soviet army surgeon examines an Auschwitz survivor, Vienna engineer Rudolf Scherm. Seven tons of hair, shown here in a 1945 photo, were found in the camp's depots. Also recovered at the camp were some 3,800 suitcases; more than 88 pounds of eyeglasses; 379 striped uniforms; 246 prayer shawls, and more than 12,000 pots and pans brought to the camp by victims who believed they would eventually be resettled. Soviet soldiers inspect a pile of clothing items left behind at the camp on January 28, 1945. Civilians and soldiers recover corpses from the common graves of the Auschwitz-Birkenau concentration camp in this February 1945 photo. Some 1.3 million people were sent to the camp, according to the Holocaust Memorial Museum, and more than 1.1 million were killed. 1 / 15 : Sovfoto/Universal Images Group/Getty Images"}, {"url": "https://encyclopedia.ushmm.org/content/en/article/auschwitz", "page_content": "Where was Auschwitz Located?\n\nAuschwitz is the German name for the Polish city Oświęcim. Oświęcim is located in Poland, approximately 40 miles (about 64 km) west of Kraków. Germany annexed this area of Poland in 1939.\n\nThe Auschwitz concentration camp was located on the outskirts of Oświęcim in German-occupied Poland. It was originally established in 1940 and later referred to as \"Auschwitz I\" or \"Main Camp.\"\n\nThe Auschwitz-Birkenau killing center, also referred to as \"Auschwitz II,\" was located near the Polish village Brzezinka (German: Birkenau). This is about 2 miles (just over 3 km) from the Main Camp. The Germans started construction on Auschwitz-Birkenau in 1941.\n\nAuschwitz III or Monowitz was located near the Polish village of Monowice (German: Monowitz). This is about 4 miles (approximately 6.5 kilometers) from the Main Camp. The Germans initially established the Buna subcamp there in 1942. In 1943, it became a concentration camp.\n\nThe Auschwitz camp complex also included numerous subcamps. The majority of these subcamps were located in the region around Auschwitz.\n\nNumber of Victims\n\nIt is estimated that the SS and police deported at least 1.3 million people to the Auschwitz camp complex between 1940 and 1945. Of these deportees, approximately 1.1 million people were murdered.\n\nThe best estimates of the number of victims at the Auschwitz camp complex, including the killing center at Auschwitz-Birkenau, between 1940 and 1945 are:\n\nDuring the Holocaust, concentration camp prisoners received tattoos only at one location, Auschwitz. Incoming prisoners were assigned a camp serial number which was sewn to their prison uniforms. Only those prisoners selected for work were issued serial numbers; those prisoners sent directly to the gas chambers were not registered and received no tattoos.\n\nAuschwitz I\n\nAuschwitz I, the main camp, was the first camp established near Oswiecim. Construction began in April 1940 in an abandoned Polish army barracks in a suburb of the city.\n\nSS authorities continuously used prisoners for forced labor to expand the camp. During the first year of the camp’s existence, the SS and police cleared a zone of approximately 40 square kilometers (15.44 square miles) as a “development zone” reserved for the exclusive use of the camp.\n\nOn May 20, 1940, the first prisoners arrived at Auschwitz. The transport consisted of some 30 German inmates, categorized as \"professional criminals.\" The SS had selected them from the Sachsenhausen concentration camp outside of Berlin. Less than a month later, on June 14, German authorities in occupied Poland deported 728 Polish prisoners from a prison in Tarnow to Auschwitz. This was the first of many transports of Poles to the Auschwitz camp.\n\nLike most German concentration camps, Auschwitz I was constructed for three purposes:\n\nTo incarcerate real and perceived enemies of the Nazi regime and the German occupation authorities in Poland for an indefinite period of time\n\nTo provide a supply of forced laborers for deployment in SS-owned construction-related enterprises (and, later, armaments and other war-related production)\n\nTo serve as a site to kill small, targeted groups of the population whose death was determined by the SS and police authorities to be essential to the security of Nazi Germany.\n\nLike some concentration camps, Auschwitz I had a gas chamber and crematorium. Initially, SS engineers constructed an improvised gas chamber in the basement of the prison block, Block 11. Later a larger, permanent gas chamber was constructed as part of the original crematorium in a separate building outside the prisoner compound.\n\nAt Auschwitz I, SS physicians carried out medical experiments in the hospital, Barrack (Block) 10. They conducted pseudoscientific research on infants, twins, and dwarfs, and performed forced sterilizations and castrations of adults. The best-known of these physicians was SS Captain Dr. Josef Mengele.\n\nWhen we think of the crimes of Nazi doctors, what comes to mind are their cruel and sometimes fatal experiments… Yet when we turn to the Nazi doctors’ role in Auschwitz, it was not the experiments that were most significant. Rather, it was his participation in the killing process—indeed his supervision of Auschwitz mass murder from beginning to end.1\n\nBetween the medical-experiments barrack and the prison block (Block 11) stood the \"Black Wall,\" where SS guards executed thousands of prisoners.\n\nAuschwitz II (Auschwitz-Birkenau)\n\nConstruction of Auschwitz II, or Auschwitz-Birkenau, began at Brzezinka in October 1941.\n\nOf the three camps established near Oswiecim, the Auschwitz-Birkenau camp had the largest total prisoner population. It was divided into ten sections separated by electrified barbed-wire fences. Like Auschwitz I, it was patrolled by SS guards, including—after 1942—SS dog handlers.\n\nThe camp included sections for women; men; a family camp for Roma (Gypsies) deported from Germany, Austria, and the Protectorate of Bohemia and Moravia; and a family camp for Jewish families deported from the Theresienstadt ghetto.\n\nAuschwitz-Birkenau was also a killing center and played a central role in the German effort to kill the Jews of Europe. Around the beginning of September, 1941, the SS at Auschwitz I conducted the first tests of Zyklon B as a mass murder agent, using Soviet POWs and debilitated Polish prisoners as victims. The “success” of these experiments led to the construction of a chamber in the crematorium of Auschwitz I that, like the subsequent gas chambers at Auschwitz, used Zyklon B to murder victims. The first transports of Jewish men, women, and children sent to Auschwitz as part of the “final solution” were murdered in this gas chamber (Crematorium I) in February and March 1942.\n\nDuring the first half of 1942, the Auschwitz SS moved the gassing operations to Auschwitz-Birkenau by converting two farmhouses just outside the camp’s fence into gas chambers. Bunker I began operating in spring 1942, the larger Bunker II in mid-summer 1942.\n\nThese gassing facilities soon proved inadequate for the task of murdering the large numbers of Jewish deportees being sent to Auschwitz. Between March and June 1943, four large crematoria were built within Auschwitz-Birkenau, each with a gas chamber, a disrobing area, and crematory ovens. Gassings ceased at Bunkers I and II when Crematoria II through V began operating, although Bunker II was put back into operation during the deportation of Hungary’s Jews in 1944. Gassing of newly arrived transports ceased at Auschwitz by early November 1944.\n\nJewish deportees arriving at Auschwitz-Birkenau immediately underwent selection. The SS staff chose some of the able-bodied for forced labor and sent the rest directly to the gas chambers, which were disguised as shower installations to mislead the victims. The belongings of all deportees were confiscated and sorted in the \"Kanada\" (Canada) warehouse for shipment back to Germany. Canada symbolized wealth to the prisoners.\n\nDeportations to Auschwitz\n\nTrains arrived at Auschwitz frequently with transports of Jews from virtually every country in Europe occupied by or allied to Germany. These transports arrived from early 1942 to early November 1944. The approximate breakdown of deportations from individual countries:\n\n\n\nHungary: 426,000\n\nPoland: 300,000\n\nFrance: 69,000\n\nNetherlands: 60,000\n\nGreece: 55,000\n\nBohemia and Moravia: 46,000\n\nSlovakia: 27,000\n\nBelgium: 25,000\n\nYugoslavia: 10,000\n\nItaly: 7,500\n\nNorway: 690\n\nOther (including concentration camps): 34,000\n\nWith the deportations from Hungary, the role of Auschwitz-Birkenau in the German plan to murder the Jews of Europe achieved its highest effectiveness. Between late April and early July 1944, approximately 440,000 Jews were deported from Hungary. Of the nearly 426,000 Hungarian Jews deported to Auschwitz, approximately 320,000 of them were sent directly to the gas chambers in Auschwitz-Birkenau. They deployed approximately 110,000 at forced labor in the Auschwitz camp complex. The SS authorities transferred many of these Hungarian Jewish forced laborers within weeks of their arrival in Auschwitz to other concentration camps in Germany and Austria.\n\nThe Prisoner Revolt at Auschwitz\n\nOn October 7, 1944, several hundred prisoners assigned to Crematorium IV at Auschwitz-Birkenau rebelled after learning that they were going to be killed. During the uprising, the prisoners killed three guards and blew up the crematorium and adjacent gas chamber. The prisoners used explosives smuggled into the camp by Jewish women who had been assigned to forced labor in a nearby armaments factory.\n\nThe Germans crushed the revolt and killed almost all of the prisoners involved in the rebellion. The Jewish women who had smuggled the explosives into the camp were publicly hanged in early January 1945.\n\nThe Auschwitz SS stopped gassing newly arrived prisoners by early November 1944. On orders from Himmler, camp officials began dismantling the crematoria. The SS destroyed the remaining gassing installations as Soviet forces approached in January 1945.\n\nAuschwitz III\n\nAuschwitz III, also called Buna or Monowitz, was established in October 1942. It housed prisoners assigned to work at the Buna synthetic rubber works, located on the outskirts of the small village of Monowice.\n\nIn the spring of 1941, German conglomerate I.G. Farben established a factory in which its executives intended to exploit concentration camp labor to manufacture synthetic rubber and fuels. I.G. Farben invested more than 700 million Reichsmarks (about 2.8 million US dollars in 1941 terms) in Auschwitz III. From May 1941 until July 1942, the SS had transported prisoners from Auschwitz I to the “Buna Detachment,” at first on foot and later by rail. (Between July and October 1942 there was a pause in transports, due to a typhus epidemic and quarantine.) With the construction of Auschwitz III in the autumn of 1942, prisoners deployed at Buna lived in Auschwitz III.\n\nAuschwitz III also had a so-called Labor Education Camp for non-Jewish prisoners who were perceived to have violated German-imposed labor discipline.\n\nAuschwitz Subcamps\n\nBetween 1942 and 1944, the SS authorities at Auschwitz established 44 subcamps. Some of them were established within the officially designated “development” zone, including Budy, Rajsko, Tschechowitz, Harmense, and Babitz. Others, such as Blechhammer, Gleiwitz, Althammer, Fürstengrube, Laurahuette, and Eintrachthuette were located in Upper Silesia north and west of the Vistula River. Some subcamps, such as Freudenthal and Bruenn (Brno), were located in Moravia.\n\nIn general, subcamps that produced or processed agricultural goods were administratively subordinate to Auschwitz-Birkenau. Subcamps whose prisoners were deployed at industrial and armaments production or in extractive industries (e.g., coal mining, quarry work) were administratively subordinate to Auschwitz-Monowitz. This division of administrative responsibility was formalized after November 1943.\n\nAuschwitz inmates were employed on huge farms, including the experimental agricultural station at Rajsko. They were also forced to work in coal mines, in stone quarries, in fisheries, and especially in armaments industries such as the SS-owned German Equipment Works (established in 1941). Periodically, prisoners underwent selection. If the SS judged them too weak or sick to continue working, they were transported to Auschwitz-Birkenau and killed.\n\nPrisoners selected for forced labor were registered and tattooed with identification numbers on their left arms in Auschwitz I. They were then assigned to forced labor at the main camp or elsewhere in the complex, including the subcamps.\n\nEvacuation of Auschwitz and its Subcamps\n\nIn mid-January 1945, as Soviet forces approached the Auschwitz concentration camp complex, the SS began evacuating Auschwitz and its subcamps.\n\nSS units forced nearly 60,000 prisoners to march west from the Auschwitz camp system. Thousands had been killed in the camps in the days before these death marches began.\n\nTens of thousands of prisoners, mostly Jews, were forced to march either northwest for 55 kilometers (approximately 30 miles) to Gliwice (Gleiwitz) or due west for 63 kilometers (approximately 35 miles) to Wodzislaw (Loslau) in the western part of Upper Silesia. Those forced to march northwest were joined by prisoners from subcamps in East Upper Silesia, such as Bismarckhuette, Althammer, and Hindenburg. Those forced to march due west were joined by inmates from the subcamps to the south of Auschwitz, such as Jawischowitz, Tschechowitz, and Golleschau.\n\nSS guards shot anyone who fell behind or could not continue. Prisoners also suffered from the cold weather, starvation, and exposure on these marches. At least 3,000 prisoners died on route to Gliwice alone. Possibly as many as 15,000 prisoners died during the evacuation marches from Auschwitz and the subcamps.\n\nUpon arrival in Gliwice and Wodzislaw, the prisoners were put on unheated freight trains and transported to concentration camps in Germany, particularly to Flossenbürg, Sachsenhausen, Gross-Rosen, Buchenwald, Dachau, and also to Mauthausen in Austria. The rail journey lasted for days. Without food, water, shelter, or blankets, many prisoners did not survive the transport.\n\nIn late January 1945, SS and police officials forced 4,000 prisoners to evacuate Blechhammer on foot. Blechhammer was a subcamp of Auschwitz-Monowitz. The SS murdered about 800 prisoners during the march to the Gross-Rosen concentration camp. SS officials also killed as many as 200 prisoners left behind in Blechhammer as a result of illness or unsuccessful attempts to hide. After a brief delay, the SS transported around 3,000 Blechhammer prisoners from Gross-Rosen to the Buchenwald concentration camp in Germany.\n\nThe Liberation of Auschwitz\n\nOn January 27, 1945, the Soviet army entered Auschwitz, Birkenau, and Monowitz and liberated about seven thousand prisoners, most of whom were ill and dying."}, {"url": "https://encyclopedia.ushmm.org/content/en/article/auschwitz-1", "page_content": "Auschwitz Auschwitz was the largest camp established by the Germans. It was a complex of camps, including a concentration, extermination, and forced-labor camp. It was located near Cracow (Krakow), Poland. Three large camps constituted the Auschwitz camp complex: Auschwitz I, Auschwitz II (Birkenau), and Auschwitz III (Monowitz). More than one million people lost their lives at Auschwitz, nine out of ten of them Jewish. The four largest gas chambers could each hold 2,000 people at one time.\n\nA sign over the entrance to the camp read Arbeit macht frei, which means \"work makes one free.\" In actuality, the opposite was true. Labor became another form of genocide that the Nazis called \"extermination through work.\"\n\nVictims who were spared immediate death by being selected for labor were systematically stripped of their individual identities. They had their hair shaved off and a registration number tattooed on their left forearm. Men were forced to wear ragged, striped pants and jackets, and women wore work dresses. Both were issued ill-fitting work shoes, sometimes clogs. They had no change of clothing and slept in the same clothes they worked in.\n\nEach day was a struggle for survival under unbearable conditions. Prisoners were housed in primitive barracks that had no windows and were not insulated from the heat or cold. There was no bathroom, only a bucket. Each barrack held about 36 wooden bunkbeds, and inmates were squeezed in five or six across on the wooden plank. As many as 500 inmates lodged in a single barrack.\n\nInmates were always hungry. Food consisted of watery soup made with rotten vegetables and meat, a few ounces of bread, a bit of margarine, tea, or a bitter drink resembling coffee. Diarrhea was common. People weakened by dehydration and hunger fell easy victim to the contagious diseases that spread through the camp.\n\nSome inmates worked as forced laborers inside the camp, in the kitchen or as barbers, for example. Women often sorted the piles of shoes, clothes, and other prisoner belongings, which would be shipped back to Germany for use there. The storage warehouses at Auschwitz-Birkenau, located near two of the crematoria, were called \"Canada,\" because the Poles regarded that country as a place of great riches. At Auschwitz, as at hundreds of other camps in the Reich and occupied Europe where the Germans used forced laborers, prisoners were also employed outside the camps, in coal mines and rock quarries, and on construction projects, digging tunnels and canals. Under armed guard, they shoveled snow off roads and cleared rubble from roads and towns hit during air raids. A large number of forced laborers eventually were used in factories that produced weapons and other goods that supported the German war effort. Many private companies, such as I. G. Farben and Bavarian Motor Works (BMW), which produced automobile and airplane engines, eagerly sought the use of prisoners as a source of cheap labor.\n\nEscape from Auschwitz was almost impossible. Electrically charged barbed-wire fences surrounded both the concentration camp and the killing center. Guards, equipped with machine guns and automatic rifles, stood in the many watchtowers. The lives of the prisoners were completely controlled by their guards, who on a whim could inflict cruel punishment on them. Prisoners were also mistreated by fellow inmates who were chosen to supervise the others in return for special favors by the guards.\n\nCruel \"medical experiments\" were conducted at Auschwitz. Men, women, and children were used as subjects. SS physician Dr. Josef Mengele carried out painful and traumatic experiments on dwarfs and twins, including young children. The aim of some experiments was to find better medical treatments for German soldiers and airmen. Other experiments were aimed at improving methods of sterilizing people the Nazis considered inferior. Many people died during the experiments. Others were killed after the \"research\" was completed and their organs removed for further study.\n\nMost prisoners at Auschwitz survived only a few weeks or months. Those who were too ill or too weak to work were condemned to death in the gas chambers. Some committed suicide by throwing themselves against the electric wires. Others resembled walking corpses, broken in body and spirit. Yet other inmates were determined to stay alive.\n\nKey Dates\n\nMay 20, 1940\n\nAuschwitz I camp opens\n\nAuschwitz I, the main camp in the Auschwitz camp complex, is the first camp established near Oswiecim. Construction began in May 1940 in the Zasole suburb of Oswiecim, in artillery barracks formerly used by the Polish army. The camp is continuously expanded through the use of forced labor. Although Auschwitz I is primarily a concentration camp, serving a penal function, it also has a gas chamber and crematorium. An improvised gas chamber is located in the basement of the prison (Block 11). Later, a gas chamber is constructed in the crematorium.\n\nOctober 8, 1941\n\nConstruction of Auschwitz II (Birkenau) begins\n\nConstruction of Auschwitz II, or Auschwitz-Birkenau, begins in Brzezinka. Of the three camps established near Oswiecim as part of the Auschwitz camp complex, Auschwitz-Birkenau has the largest prisoner population. It is divided into nine sections separated by electrified barbed-wire fences and patrolled by SS guards and dogs. The camp includes sections for women, men, Roma (Gypsies), and families deported from the Theresienstadt ghetto. Auschwitz-Birkenau plays a central role in the German plan to exterminate the Jews of Europe. Four large crematoria buildings are constructed between March and June 1943. Each has three components: a disrobing area, a large gas chamber, and crematorium ovens. Gassing operations continue until November 1944.\n\nOctober 1942\n\nAuschwitz III camp opens\n\nThe Germans establish Auschwitz III, also called Buna or Monowitz, in Monowice to provide forced laborers for the Buna synthetic rubber works (part of the German conglomerate I.G. Farben). I.G. Farben invested more than 700 million Reichsmarks (about 1.4 million US dollars in 1942) in Auschwitz III. Prisoners selected for forced labor are registered and tattooed with identification numbers on their left arms in Auschwitz I. They are then assigned to forced labor in Auschwitz or in one of the many subcamps attached to Auschwitz III.\n\nJanuary 27, 1945\n\nSoviet army liberates Auschwitz camp complex\n\nThe Soviet army enters Auschwitz and liberates the remaining prisoners. Only a few thousand prisoners remain in the camp. Almost 60,000 prisoners, mostly Jews, were forced on a death march from the camp shortly before its liberation. During the forced evacuation of Auschwitz, prisoners were brutally mistreated and many were killed. SS guards shot anyone who fell behind. During its brief existence, nearly 1 million Jews were killed in Auschwitz. Other victims included between 70,000 and 74,000 Poles, 21,000 Roma (Gypsies), and about 15,000 Soviet prisoners of war."}, {"url": "https://encyclopedia.ushmm.org/content/en/article/blechhammer", "page_content": "The Germans established a subcamp of Auschwitz on April 1, 1944, when they placed the Jewish forced-labor camp near Blechhammer (now Blachownia Slaska) under the command of the Auschwitz III-Monowitz concentration camp.1 Initially, there were about 3,000 men and around 200 women in the camp; in the following months, over 1,000 Jewish prisoners were sent to the subcamp. A total of approximately 4,500 male and female prisoners from 15 European countries went through the subcamp.2 Blechhammer was the second-largest Auschwitz subcamp, after Monowitz, as far as prisoner population was concerned.\n\nThe camp occupied an area of almost 4 hectares (10 acres).3 It was fenced in by a concrete wall almost 4 meters (13 feet) high with concrete watchtowers. The prisoners occupied about 25 living and hospital barracks. The camp also had toilet, washroom, workshop, ware house, and bathhouse barracks.\n\nThe prisoners were guarded by SS men who belonged to the Auschwitz III 7th Guard Company, commanded by SS Hauptsturmführer Otto Brossmann and his deputy SS Untersturmführer Kurt Klipp.4\n\nLiving conditions at the Blechhammer subcamp were similar to those prevailing in other subcamps of the Auschwitz concentration camp.5 The prisoners’ wooden barracks were greatly overcrowded; there were about 1.4 square meters (15 square feet) of space per person. The prisoners slept on two or three- decker bunks. Because there were not enough toilets, washrooms, or bathhouses, the use of those facilities was limited. Camp clothing was also inadequate. Any attempts to augment it illegally met with severe punishments. Walking in wooden shoes was especially onerous for the prisoners. Camp food was also inadequate. Almost all the surviving punishment reports referring to Blechhammer prisoners have to do with illicit food dealing.6\n\nThe camp hospital was in two barracks and was supervised by SS orderlies, who were in charge of administrative and cleaning work. They treated the patients and prisoner doctors brutally. They would beat sick people waiting to be admitted to the hospital for treatment, then chase them out of the building. Not infrequently, they would also beat the prisoner doctors. The average patient population in the autumn and winter was about 100 people. As in other subcamps, the hospital was where selections took place. Those who were found to be unfit for work or further treatment were taken away to Auschwitz II-Birkenau, which often ended in their being put to death in the gas chamber. Selections were also conducted in the living quarter barracks and on the way back from work.\n\nApproximately 250 prisoners died in the camp over the nine and a half months it existed.7 The bodies of dead prisoners were burned in the camp’s own crematorium.\n\nThe prisoners were put to work building a synthetic gasoline factory owned by Oberschlesische Hydrierwerke AG (Upper Silesia Synthetic Gas Works) in Blechhammer. To the sounds of the camp orchestra, every day SS men would escort them to the work site almost five kilometers (three miles) away and put them under the supervision of civilian workers and prisoner-foremen. The SS men themselves would surround the entire construction site in a cordon until work was over and the prisoners in the respective detachments were counted. They started a search if a prisoner was missing. At that time, they tormented the prisoners, making them do punitive exercises in an attempt to force them to disclose the fugitive’s escape route or hiding place.\n\nThe prisoners were divided into a few dozen detachments of 100 to 200 persons, which were assigned to the respective construction companies.8 The labor the prisoners performed was typical construction work: excavating for foundations, building roads and structures, and transporting building materials. In the latter instance, they used prisoners to pull the wagons instead of horses or tractors. Eight prisoners would be harnessed to a wagon. They used physical coercion to force the hungry and weak prisoners to work. The prisoner-foremen supervising the prisoners during work never parted from their bats, which they put to use often. The prisoners worked all day, from dawn to dusk, for about 10 to 12 hours. They also worked at the construction site every other Sunday. On alternate Sundays, they were put to work at various jobs within the camp.\n\nAfter the bombing of the Hydrierwerke plant, Jewish prisoners were used to remove duds, during which many of them met with fatal accidents. Prisoners also died in the bombing raids themselves, as they were not allowed to enter the bomb shelters.\n\nStrict discipline prevailed in the camp. Not only were prisoners beaten randomly at work; they were also given what were called “regulation punishments.” These included whipping (from 5 to 25 lashes), punitive labor on Sundays, and confi nement in a special bunker.9 There were also executions by hanging in the camp; that is how the SS would execute prisoners for acts regarded as sabotage, among other offenses.\n\nThe Germans began evacuating the prisoners on January 21, 1945, in connection with the Rus sian winter offensive. Approximately 4,000 prisoners were driven on foot to Gross-Rosen, which was reached 10 days later.10 Weak prisoners who did not keep up in the march were shot along the way. Prisoners estimate that approximately 800 people were killed on the way. Mass graves of several dozen bodies each were found along the evacuation route after liberation.11\n\nSources\n\nAPMO contains the following relevant rec ords: Punishment Reports and Orders; Zespół Oswiadczenia, accounts of Aron Goldfinger, Luzer Markowicz, Emanuel Luftglas, Aba Sztulberg, Gita Brandsztedter-Sztulbergowa, Abram Szeftel, Lucjan Radzik, Erwin Lagus, and Carl Demerer; Kommandanturbefehle KL Auschwitz III; Materials, Catalog Nos. 597, 598, 599; Materials of the camp resistance movement; Nummernbuch; Fahrbefehle; Häftlingspersonalbogen; Prämienscheine. See also Franciszek Piper, “Das Nebenlager Blechhammer,” HvA 10 (1967): 19–39."}, {"url": "https://www.britannica.com/place/Auschwitz/The-Allied-response-to-Auschwitz", "page_content": "The Allied response to Auschwitz\n\nThroughout the camp’s history, there were numerous escape attempts, and on April 10, 1944, two Slovak Jews—Rudolph Vrba and Alfred Wetzler—successfully broke out of Auschwitz-Birkenau. After a harrowing two-week journey through Nazi-occupied Poland, they made it back to their home country. There they made contact with Slovak resistance forces and gave them a complete report on the extermination camp. Vrba and Wetzler documented the killing process and provided detailed maps of the camp’s layout. This information was passed on to Western intelligence organizations along with an urgent request to bomb Auschwitz. Part of the report was forwarded to the U.S. government’s War Refugee Board and arrived in Washington in July 1944. In August U.S. Assistant Secretary of War John J. McCloy rejected the notion of bombing Auschwitz, stating that “such an operation could be executed only by the diversion of considerable air support essential to the success of our forces now engaged in decisive operations elsewhere and would in any case be of such doubtful efficacy that it would not warrant the use of our resources.” Although the IG Farben industrial complex adjacent to Auschwitz was bombed four times in the final year of the war, the death camp and its crematoria were left untouched, a subject of controversy more than 70 years later. (See Why Wasn’t Auschwitz Bombed?)\n\nOn March 19, 1944, Germany occupied Hungary, and, while the Allies considered the ramifications of the Vrba-Wetzler report, the Nazis undertook the systematic destruction of Hungarian Jewry. Between May 15 and July 9, 1944, some 438,000 Hungarian Jews were shipped on 147 trains to Birkenau, stretching the camp’s resources for killing beyond all limits. Because the crematoria were overcrowded, bodies were burned in open pyres fueled partly by the victims’ own fat. More than two-thirds of Hungary’s Jewish population would perish in the Holocaust, and the overwhelming majority of those murders would take place at Birkenau.\n\nAs Soviet armies advanced in 1944 and early 1945, Auschwitz was gradually abandoned. On January 18, 1945, some 60,000 prisoners were marched to Wodzisław Śląski, where they were put on freight trains (many in open cars) and sent westward to concentration camps away from the front. One in four died en route from starvation, cold, exhaustion, and despair. Many were shot along the way in what became known as the “death marches.” The 7,650 sick or starving prisoners who remained were found by arriving Soviet troops on January 27, 1945."}, {"url": "https://www.ushmm.org/remember/holocaust-survivors/volunteers/alfred-muenzer", "page_content": "Alfred “Al” Münzer was born on November 23, 1941 in The Hague, Netherlands. He was the youngest of three children born to Simcha (Siegfried) and Gisele (Gitla) Münzer (sometimes Minzer). Simcha owned a men’s tailoring business and Gisele remained at home to look after Alfred and his two older sisters, Eva and Leah (Liane).\n\nWhen Alfred was born, the Netherlands was already occupied by Nazi Germany. The Nazis implemented anti-Jewish restrictions and life for Jews in the Netherlands became increasingly dangerous. The Germans began carrying out mass deportations from the Netherlands to killing centers in July 1942. Simcha was ordered to report to a German labor camp but evaded the order by checking himself into the hospital for a long overdue hernia operation. By September it became apparent that the entire family would need to go into hiding. Simcha faked a suicide attempt in order to be committed to the Ramaerkliniek, a psychiatric hospital in The Hague. Meanwhile, Gisele sold the family’s possessions and settled her children with friends and neighbors before joining Simcha at the hospital as a nurse’s assistant.\n\nEva and Leah were initially placed with two sisters, Jo and Ko van Leeuwen, who lived next-door to the Münzer family. About a year later, the girls were moved to the home of another woman, Roza Marie (Rosalia) Mazurowski. But in early 1944, the woman’s husband allegedly denounced her and the girls to the authorities. All three were arrested. Roza Marie was detained in the Scheveningen prison, known colloquially as the Oranjehotel. The girls were then sent to Westerbork transit camp. On February 8, 1944 seven-year-old Eva, five-year-old Leah were deported to Auschwitz. Seemingly by chance, Elische (Emil) Münzer, Simcha’s youngest brother, was on the same transport. They arrived at Auschwitz-Birkenau two days later and they were presumably all killed in gas chambers almost immediately upon arrival. After the war, Al learned from Red Cross documentation that Eva and Leah died in Auschwitz on February 11. On June 6, 1944, Roza Marie, who had hidden the girls, was sent to the Vught concentration camp, then to Ravensbrück concentration camp, and eventually was liberated.\n\nAlfred was put in the care of a family friend and neighbor named Annie Madna, who placed him with her sister, Jorina Polak. However, after three weeks Jorina became too nervous to keep him because her neighbor was a Nazi collaborator. Annie then placed Alfred with her ex-husband, Tolé, a native of Indonesia. For the next three years Alfred remained in Tolé’s home, looked after by their Muslim housekeeper, Mima Saïna, who became his surrogate mother. The Madnas treated him as one of their own children, but he was not allowed to leave the house for fear that someone might see him and become suspicious. He remembers hiding in the cellar when German authorities came to the house. Despite their difference in appearance, the blond-haired, blue-eyed Alfred had no sense of being different from the rest of his Indonesian-Dutch family.\n\nOn December 31, 1942, the German police carried out a raid on the Ramaerkliniek, where Al’s parents and others were hiding. Alfred’s parents were arrested and deported first to Westerbork then to Vught. In March 1944, Simcha was sent back to Westerbork and from there deported to Auschwitz, where he was registered as prisoner number 175442. In January 1945 Simcha was sent to Mauthausen concentration camp and a number of other camps before being liberated at Ebensee. He died two months later at a nearby convent where he was receiving medical treatment.\n\nAfter Simcha’s transfer, Gisele remained at Vught, where she was part of a work detail called the so-called Philips commando. This group worked for a factory run by the Philips electronics company. The hope was that this specialization would protect them from deportation. But, in June 1944, the prisoners of Philips commando were deported to Auschwitz. Many of them, including Gisele, were then sent to Reichenbach, a subcamp of Gross-Rosen. At Reichenbach, Gisele and other Dutch Jews from the Philips commando worked at one of the nearby Telefunken factories. She was sent to a series of other camps, ending up in a subcamp of Neuengamme concentration camp in northern Germany. In the spring of 1945, Gisele was ultimately liberated at the German border with Denmark in the spring of 1945 and evacuated to Sweden. In July she was repatriated to the Netherlands.\n\nWhen Gisele returned for Alfred, the three-and-a-half year-old had no memory of who she was. In order to ease the transition, Gisele invited Alfred’s surrogate mother, Mima, to continue to care for him. However, a few months later Mima died.\n\nWhen Alfred was six years old, his mother opened a cosmetics store in Holland. In 1952 they moved to Belgium where they lived until they immigrated to the United States in 1958. Today, Alfred is retired from his work as an internist and pulmonologist and lives in Washington, DC. He still maintains a close relationship with Tolé’s children and grandchildren. In 2003, Tolé Madna and Mima Saïna were honored by Yad Vashem as Righteous Among the Nations."}, {"url": "https://www.mirror.co.uk/news/uk-news/jewish-prisoners-made-daring-escape-21359289", "page_content": "After three days hidden in the stack Rudolf Vrba and Alfred Wetzler broke cover and walked 85 miles in German-occupied Poland to tell the world what was going on at the camp\n\nEyes wide with fear, Jewish prisoners Rudolf Vrba and Alfred Wetzler held their breath while the Auschwitz guard climbed on top of the woodpile they were hiding in.\n\nAnd as his dog began barking furiously, the pair could only pray the Russian tobacco and gasoline they had smeared on their bodies would put it off their scent.\n\n\"If the SS found us we’d have been killed,\" said Rudolf who had sneaked with Alfred into the hideaway in a no-man’s land between the camp’s inner and outer perimeter fences.\n\n\"We heard boots hit the earth, his shouts and the clicking of a hound’s nails above us, then silence.\"\n\nIt was a pivotal historic moment that would astonishingly help save hundreds of thousands from the camp where over a million died.\n\nBecause Rudolf and Alfred then made their great escape and walked 85 miles in German-occupied Poland to raise the alarm over Nazi plans to speed up the killings.\n\nTheir daring breakout was followed by friends Czeslaw Mordowicz and Arnost Rosin a month later in May 1944.\n\nTomorrow is the 75th anniversary of the liberation of Auschwitz. And few people today have heard of these men who alerted the Allies about the slaughter and stopped thousands more Hungarian Jews from being deported to the camp.\n\nCzechoslovakian Rudolf had the camp layout inside his head along with vital details of Nazi plans gleaned from the job that had kept him alive – sorting the belongings of Jews coming off transport trains.\n\nImage: Getty) Getty) Image: Getty) Getty)\n\nAnd his amazing memory for prisoners’ names would later be checked against records to prove his and his fellow escapees’ unbelievable stories about the camp where Angel of Death Dr Josef Mengele performed deadly experiments on prisoners.\n\nAuthor Joel C. Rosenberg, who later researched the men’s story for The Auschwitz Escape, said: “The fact they risked their lives not just to explain the fate of thousands of Jews, but to warn others is incredible.”\n\nRudolf was 17 when\n\nhe was transported to Auschwitz in June 1942. Because he was young he was made to work and was spared the gas chambers.\n\nHe heard guards boast of new camps being built in Hungary and “tasty Hungarian salami” to be made in coming months.\n\nImage: Getty) Getty)\n\nHis anger at what he had witnessed – SS officers choosing who lived and died with a flick of a hand – was boiling inside him.\n\nIn an interview after the war, Rudolf said: “When I saw the Nazis with bamboo sticks, herding old men and women and children into the gas chambers I thought, ‘It is my duty to jump on the neck of the first one’.\n\nBut I also knew the moment I made the first move I’d be killed and many others too in reprisal.”\n\nSeeking a way to strike back, Rudolf began plotting an escape with Alfred, a prisoner from his home town.\n\nAlfred, then 25, had a job as an administrator, keeping track of the transports and numbers of prisoners coming in. That information would prove vital to the Allies. The pair decided to go for it after the massacre of around 4,000 prisoners in the Czech Family Camp at Auschwitz.\n\nThey had been paraded in front of Red Cross inspectors with unshaven heads and normal clothes instead of striped uniforms to mislead them about the Final Solution. Once the inspections were over, they were murdered.\n\nRudolf and Alfred got workers on an extension to the death camp to build a woodpile with a hole to hide in.\n\nOn April 7, 1944, the two men sneaked into it. They knew from escape attempts by others that the guards would search for them for three nights before giving up.\n\nAuthor Joel said: “Russian prisoners had a pungent tobacco that would cover their scent from the dogs. They mixed it with stolen gasoline and smeared it over themselves.”\n\nOn the third night, when the SS guard around the outer fence was withdrawn, they got away and, after 15 days of walking by night, made it to the border with unoccupied Slovakia.\n\nThey took their story straight to the Jewish Council in Zilina. A secretary there, George Klein, read Rudolf’s chilling testimony and said he knew he was “looking at the truth”. The council contacted their counterparts in Budapest who were at first ­sceptical."}, {"url": "https://www.pbs.org/auschwitz/learning/timeline/1944.html", "page_content": "Key Auschwitz Related\n\nJanuary President Roosevelt creates the War Refugee Board, which works with Jewish organizations, diplomats, and resistance groups to rescue Jews from the Holocaust. After advancing up the Italian peninsula, Allied forces meet stubborn German resistance between Naples and Rome. Months of battles take tens of thousands of lives on both sides until the Allies can break through to approach Rome.\n\nFebruary Allied forces seize the Gilbert and Marshall Islands from Japanese forces.\n\nMarch As Soviet troops approach the Hungarian border, German forces occupy Hungary, which is allied with the Axis. Subsequently, Hungary requires Jews to wear a yellow star and orders Jews into ghettos. Deportations to Auschwitz begin soon thereafter.\n\nMay Rudolf Höss returns to Auschwitz to plan for the annihilation of Hungarian Jews. Nearly 440,000—half of the Jews in Hungary—are sent to Auschwitz. Many are gassed within days of their arrival. May-July: The Nazis send Hungarian Jew Joel Brandt on a mission to try to trade one million Jews to the Allies in exchange for ten thousand trucks. The British reject the offer.\n\nJune June-October: Soviet troops attack German forces, pushing them out of the USSR and into Poland. In mid-July the Soviets near Warsaw, prompting Polish resistance fighters in the city to rise up against the Germans, confident that the Soviets are on their way to liberate them. The Soviet troops stop their advance, however, giving the Germans time to crush the Warsaw rebellion in October. June 5: Allied troops enter Rome. June 6: D-Day. The Allied invasion of Europe arrives at Normandy in northwest France; thousands of troops cross the English Channel to land on several beaches, preceded by airborne troops who parachute behind German defenses. After intense morning fighting, the Allies begin to take control of the beaches. President Roosevelt discusses plans to establish the United Nations after the war. June 30: A train carrying more than 1,600 Jews leaves Budapest for Switzerland. Handpicked by Hungarian Zionist leader Rudolph Kasztner after making a deal with Adolf Eichmann, each person on the train paid the equivalent of $1,000 (U.S.) for safe passage. The train stops at the Bergen-Belsen concentration camp, where the passengers stay for months before most are finally sent on to Switzerland. June-August: The Allied troops who landed in France struggle for more than two months to solidify their hold. Not until late August do they control most of France, highlighted for the French troops by the liberation of Paris on August 24.\n\nJuly An international conference held in Bretton Woods, New Hampshire, creates plans for the International Monetary Fund and the International Bank for Reconstruction and Development to prepare for postwar economic cooperation. July 9: Hungarian leader Miklos Horthy halts deportation of Jews from Hungary to Auschwitz. July 20: An attempt to assassinate Hitler in East Prussia fails. The coup plotters had hoped to negotiate an end to the war. The Nazis hunt down many military commanders and suppress the conspiracy to overthrow Hitler. They also take in German war hero Erwin Rommel, who, although sympathetic, had not actually joined the conspiracy. He was doomed, however, for failing to warn Hitler. Thousands were killed or sent to concentration camps in retribution. July 23: An International Red Cross delegation visits the Theresienstadt ghetto. In preparation for the visit, the Nazis embark on a beautification process and show the ghetto as a model camp. The resulting Red Cross report on the treatment of Jews is favorable.\n\n\n\n1944 pocket calendar, printed by the Lodz ghetto printing house\n\nAugust August 2: The Gypsy Camp at Auschwitz is liquidated. Nazis send some four thousand Gypsies to the gas chambers. August 7-30: The Lódz ghetto is liquidated. Sixty thousand Jews and an undetermined number of Gypsies are sent to Auschwitz. August 23: A pro-German regime in Romania is overthrown. The new government declares war on Germany and fights alongside Soviet troops through Hungary and Germany. August 29-30: The last transport of Jews leaves the Lódz ghetto for Auschwitz. August-September: Allied bombers strike the IG Farben plant near Auschwitz. Requests from Jewish organizations to bomb the camp and the railways leading to it are denied by the U.S. military.\n\nOctober October 6: The Sonderkommandos at Auschwitz stage a revolt, destroying Crematorium IV. Some prisoners escape briefly but are recaptured. The SS kill many Sonderkommandos—even some who had not participated—in retaliation. October 15: As the Soviets approach the country, the Hungarian government of Miklos Horthy announces a truce with the Allied powers. Horthy is overthrown and replaced by the pro-Nazi Arrow Cross Party.\n\nNovember The last people are gassed at Auschwitz. The last recorded transport of Jewish prisoners arrives at Auschwitz. Franklin Roosevelt is reelected to a fourth term as president, with Harry Truman as vice president. November 5: Adolf Eichmann deports Jews from Budapest, forcing them to march to Austria on foot. Some 75,000 start the death marches, but many die on the way. November 14: The U.S., British, and Soviet governments agree that postwar Germany will be divided into zones of occupation governed by the victorious Allies. November 25: The SS begins the destruction of the Auschwitz crematoria."}]}