{"Alfred Fischer was responsible for the construction of the Auschwitz III-Monowitz concentration camp.": [{"url": "https://www.history.com/topics/world-war-ii/auschwitz", "page_content": "Auschwitz, also known as Auschwitz-Birkenau, opened in 1940 and was the largest of the Nazi concentration and death camps. Located in southern Poland, Auschwitz initially served as a detention center for political prisoners. However, it evolved into a network of camps where Jewish people and other perceived enemies of the Nazi state were exterminated, often in gas chambers, or used as slave labor. Some prisoners were also subjected to barbaric medical experiments led by Josef Mengele (1911-79). During World War II (1939-45), more than 1 million people, by some accounts, lost their lives at Auschwitz. In January 1945, with the Soviet army approaching, Nazi officials ordered the camp abandoned and sent an estimated 60,000 prisoners on a forced march to other locations. When the Soviets entered Auschwitz, they found thousands of emaciated detainees and piles of corpses left behind.\n\nAuschwitz: Genesis of Death Camps\n\nAfter the start of World War II, Adolf Hitler (1889-1945), the chancellor of Germany from 1933 to 1945, implemented a policy that came to be known as the “Final Solution.” Hitler was determined not just to isolate Jews in Germany and countries annexed by the Nazis, subjecting them to dehumanizing regulations and random acts of violence. Instead, he became convinced that his “Jewish problem” would be solved only with the elimination of every Jew in his domain, along with artists, educators, Romas, communists, homosexuals, the mentally and physically handicapped and others deemed unfit for survival in Nazi Germany.\n\nDid you know? In October 1944, a group of Auschwitz \"Sonderkommando,\" young Jewish males responsible for removing corpses from crematoriums and gas chambers, staged a revolt. They assaulted their guards, using tools and makeshift explosives, and demolished a crematorium. All were apprehended and killed.\n\nTo complete this mission, Hitler ordered the construction of death camps. Unlike concentration camps, which had existed in Germany since 1933 and were detention centers for Jews, political prisoners and other perceived enemies of the Nazi state, death camps existed for the sole purpose of killing Jews and other “undesirables,” in what became known as the Holocaust.\n\nAuschwitz: The Largest of the Death Camps\n\nAuschwitz, the largest and arguably the most notorious of all the Nazi death camps, opened in the spring of 1940. Its first commandant was Rudolf Höss (1900-47), who previously had helped run the Sachsenhausen concentration camp in Oranienburg, Germany. Auschwitz was located on a former military base outside Oswiecim, a town in southern Poland situated near Krakow, one of the country’s largest cities. During the camp’s construction, nearby factories were appropriated and all those living in the area were forcibly ejected from their homes, which were bulldozed by the Nazis.\n\nAuschwitz originally was conceived as a concentration camp, to be used as a detention center for the many Polish citizens arrested after Germany annexed the country in 1939. These detainees included anti-Nazi activists, politicians, resistance members and luminaries from the cultural and scientific communities. Once Hitler’s Final Solution became official Nazi policy, however, Auschwitz was deemed an ideal death camp locale. For one thing, it was situated near the center of all German-occupied countries on the European continent. For another, it was in close proximity to the string of rail lines used to transport detainees to the network of Nazi camps.\n\nHowever, not all those arriving at Auschwitz were immediately exterminated. Those deemed fit to work were employed as slave labor in the production of munitions, synthetic rubber and other products considered essential to Germany’s efforts in World War II.\n\nAuschwitz and Its Subdivisions\n\nAt its peak of operation, Auschwitz consisted of several divisions. The original camp, known as Auschwitz I, housed between 15,000 and 20,000 political prisoners. Those entering its main gate were greeted with an infamous and ironic inscription: “Arbeit Macht Frei,” or “Work Makes You Free.”\n\nAuschwitz II, located in the village of Birkenau, or Brzezinka, was constructed in 1941 on the order of Heinrich Himmler (1900-45), commander of the “Schutzstaffel” (or Select Guard/Protection Squad, more commonly known as the SS), which operated all Nazi concentration camps and death camps. Birkenau, the biggest of the Auschwitz facilities, could hold some 90,000 prisoners.\n\nIt also housed a group of bathhouses where countless people were gassed to death, and crematory ovens where bodies were burned. The majority of Auschwitz victims died at Birkenau. More than 40 smaller facilities, called subcamps, dotted the landscape and served as slave-labor camps. The largest of these subcamps, Monowitz, also known as Auschwitz III, began operating in 1942 and housed some 10,000 prisoners.\n\nLife and Death in Auschwitz\n\nBy mid-1942, the majority of those being sent by the Nazis to Auschwitz were Jews. Upon arriving at the camp, detainees were examined by Nazi doctors. Those detainees considered unfit for work, including young children, the elderly, pregnant women and the infirm, were immediately ordered to take showers. However, the bathhouses to which they marched were disguised gas chambers. Once inside, the prisoners were exposed to Zyklon-B poison gas. Individuals marked as unfit for work were never officially registered as Auschwitz inmates. For this reason, it is impossible to calculate the number of lives lost in the camp.\n\nFor those prisoners who initially escaped the gas chambers, an undetermined number died from overwork, disease, insufficient nutrition or the daily struggle for survival in brutal living conditions. Arbitrary executions, torture and retribution happened daily in front of the other prisoners.\n\nSome Auschwitz prisoners were subjected to inhumane medical experimentation. The chief perpetrator of this barbaric research was Josef Mengele (1911-79), a German physician who began working at Auschwitz in 1943. Mengele, who came to be known as the “Angel of Death,” performed a range of experiments on detainees. For example, in an effort to study eye color, he injected serum into the eyeballs of dozens of children, causing them excruciating pain. He also injected chloroform into the hearts of twins to determine if both siblings would die at the same time and in the same manner.\n\nLiberation of Auschwitz: 1945\n\nAs 1944 came to a close and the defeat of Nazi Germany by the Allied forces seemed certain, the Auschwitz commandants began destroying evidence of the horror that had taken place there. Buildings were torn down, blown up or set on fire, and records were destroyed.\n\nIn January 1945, as the Soviet army entered Krakow, the Germans ordered that Auschwitz be abandoned. Before the end of the month, in what came to be known as the Auschwitz death marches, an estimated 60,000 detainees, accompanied by Nazi guards, departed the camp and were forced to march to the Polish towns of Gliwice or Wodzislaw, some 30 miles away. Countless prisoners died during this process; those who made it to the sites were sent on trains to concentration camps in Germany.\n\nWhen the Soviet army entered Auschwitz on January 27, they found approximately 7,600 sick or emaciated detainees who had been left behind barbed wire. The liberators also discovered mounds of corpses, hundreds of thousands of pieces of clothing and pairs of shoes and seven tons of human hair that had been shaved from detainees before their liquidation. According to some estimates, between 1.1 million to 1.5 million people, the vast majority of them Jews, died at Auschwitz during its years of operation. An estimated 70,000 to 80,000 Poles perished at the camp, along with 19,000 to 20,000 Romas and smaller numbers of Soviet prisoners of war and other individuals.\n\nAuschwitz Today\n\nToday, Auschwitz is open to the public as the Auschwitz-Birkenau Memorial and Museum. It tells the story of the largest mass murder site in history and acts as a reminder of the horrors of genocide.\n\nImages from the Death Camps Adolph Hitler and the Nazi regime set up networks of concentration camps before and during World War II to carry out a plan of genocide. Hitler's \"final solution\" called for the eradication of Jewish people and other \"undesirables,\" including homosexuals, gypsies and people with disabilities. The children pictured here were held at the Auschwitz concentration camp in Nazi-occupied Poland. Survivors at the Wobbelin concentration camp in northern Germany were found by the U.S. Ninth Army in May 1945. Here, one man breaks out in tears when he finds he is not leaving with the first group to be taken to the hospital. Survivors at Buchenwald concentration camp are shown in their barracks after liberation by the Allies in April 1945. The camp was located in a wooded area in Ettersberg, Germany, just east of Weimar. Elie Wiesel, the Nobel Prize winning author of Night, is on the second bunk from the bottom, seventh from the left. Fifteen-year-old Ivan Dudnik was brought to Auschwitz from his home in the Oryol region of Russia by the Nazis. While being rescued after the liberation of Auschwitz, he had reportedly gone insane after witnessing mass horrors and tragedies at the camp. Allied troops are shown in May 1945 discovering Holocaust victims in a railroad car that did not arrive at its final destination. It was believed this car was on a journey to the Wobbelin concentration camp near Ludwigslust, Germany where many of the prisoners died along the way. A total of 6 million lives were lost as a result of the Holocaust. Here, a pile of human bones and skulls is seen in 1944 at the Majdanek concentration camp in the outskirts of Lublin, Poland. Majdanek was the second largest death camp in Nazi-occupied Poland after Auschwitz. A body is seen in a crematory oven in the Buchenwald concentration camp near Weimar, Germany in April 1945. This camp not only imprisoned Jews, it also included Jehovah’s Witnesses, gypsies, German military deserters, prisoners of war, and repeat criminals. Auschwitz camp, as seen in April 2015. Nearly 1.3 million people were deported to the camp and more than 1.1 million perished. Although Auschwitz had the highest death rate, it also had the highest survival rate of all the killing centers. Prosthetic legs and crutches are a part of a permanent exhibition in the Auschwitz Museum. On July 14, 1933, the Nazi government enforced the “Law for Prevention of Progeny with Hereditary Diseases” in their attempt to achieve a purer “master” race. This called for the sterilization of people with mental illness, deformities, and a variety of other disabilities. Hitler later took it to more extreme measures and between 1940 and 1941, 70,000 disabled Austrians and Germans were murdered. Some 275,000 disabled people were murdered by the end of the war. A pile of footwear are also a part of the Auschwitz Museum. 1 / 10 : DeAgostini/Getty Images\n\nSoviet Red Army soldiers stand with liberated prisoners of the Auschwitz Concentration Camp in this 1945 photo. An aerial reconnaissance photograph over occupied Poland, shows Auschwitz II (Birkenau Extermination Camp) on December 21, 1944. It is one of a series of aerial photographs taken by Allied reconnaissance units under the command of the 15th U.S. Army Air Force during missions dating between April 4, 1944 and January 14, 1945. Hungarian Jews arrive in Auschwitz-Birkenau, in German-occupied Poland in June 1944. Between May 2 and July 9, more than 425,000 Hungarian Jews were deported to Auschwitz. Men selected for forced labor from amongst Hungarian Jews in Auschwitz-Birkenau, in German-occupied Poland, June 1944. In this photo taken in January 1945, survivors stand behind the gates of the camp at Auschwitz, as they watch the arrival of Soviet troops. This photo of Auschwitz survivors was taken by a Soviet photographer in February 1945 during the making of a film about the liberation of the camp. Child survivors of Auschwitz show their tattooed arms in a photo as part of the film about the camp's liberation. Soviet filmmakers dressed the children in clothing from adult prisoners A 15-year-old Russian boy, Ivan Dudnik, is rescued. The teen was brought to Auschwitz from his home in the Orel region by the Nazis. Two children pose in the Auschwitz medical station after the camp's liberation. The Soviet army entered Auschwitz on January 27, 1945 and released more than 7,000 remaining prisoners, most of whom were ill and dying. This is a card taken from hospital files produced by Soviet staff after the liberation of the camp. The information about the patient, labeled No. 16557, reads, \"Bekrie, Eli, 18 years, from Paris. alimentary dystrophy, third degree.\" This medical card shows 14-year-old Hungarian boy, Stephen Bleier. The card diagnoses Bleier with alimentary dystrophy, second degree. A Soviet army surgeon examines an Auschwitz survivor, Vienna engineer Rudolf Scherm. Seven tons of hair, shown here in a 1945 photo, were found in the camp's depots. Also recovered at the camp were some 3,800 suitcases; more than 88 pounds of eyeglasses; 379 striped uniforms; 246 prayer shawls, and more than 12,000 pots and pans brought to the camp by victims who believed they would eventually be resettled. Soviet soldiers inspect a pile of clothing items left behind at the camp on January 28, 1945. Civilians and soldiers recover corpses from the common graves of the Auschwitz-Birkenau concentration camp in this February 1945 photo. Some 1.3 million people were sent to the camp, according to the Holocaust Memorial Museum, and more than 1.1 million were killed. 1 / 15 : Sovfoto/Universal Images Group/Getty Images"}, {"url": "http://70.auschwitz.org/index.php?option=com_content&view=article&id=217&Itemid=179&lang=en", "page_content": "Initially, it was one of Auschwitz sub-camps, created in October 1942 on the area of the expelled and demolished Polish village of Monowice (German: Monowitz), 6 km from Auschwitz I, in connection with the construction by a German company – IG Farbenindustrie conglomerate – of the Buna-Werke synthetic rubber and fuel plant.\n\nIn November 1943, Monowitz was raised to the status of concentration camp, to which all the “industrial” sub-camps in the Auschwitz complex were subordinated. Camp population grew progressively: from over 3,500 prisoners in December 1942 to over 6,000 in late 1943 and over 11,000 in July 1944 (mainly Jews). Prisoners were incarcerated in 60 barracks.\n\nIn January 1945, the majority of prisoners were evacuated on foot to Gliwice, from where they were transported by rail to the Buchenwald and Mauthausen camps. Nobel Prize laureate Elie Wiesel and famous Italian writer Primo Levi were among others the prisoners of the Monowitz camp.\n\nAuschwitz III-Monowitz camp was the first of three main camps of the Auschwitz complex liberated by the Red Army soldiers. It took place on Saturday, January 27, 1945 before noon. In the afternoon, the camps Auschwitz I and Auschwitz II-Birkenau were liberated.\n\n(Mini dictionary of terms from the history of Auschwitz)"}, {"url": "https://www.tracesofwar.com/sights/83417/Concentration-Camp-Auschwitz-III-Monowitz.htm", "page_content": "Concentration Camp Auschwitz III (Monowitz)\n\nThis concentration camp provided forced laborers for the construction of the adjacent factory complex, which included a production facility for synthetic rubber (buna). Many prisoners died during the construction work as a result of exhaustion or from injuries . The camp was a sub-camp of KZ Auschwitz. The factory complex was bombed four times by the USAAF in 1944. The Red Army liberated the camp on 27 January 1945.\n\n\n\nThe former camp site was built on after the war, and several barracks and parts of them were used as a garage, barn or workshop. Some of these barracks have been preserved, although in poor condition. There is also a Luftschutzbunker for the SS. On the grounds of the accompanying SS camp there is a dilapidated brick barrack, which at the time housed the administration.\n\nDo you have more information about this location? Inform us!\n\nSource\n\nText: TracesOfWar\n\nPhotos: Koos Winkelman"}, {"url": "https://www.auschwitz.org/en/history/auschwitz-iii/living-conditions-and-number-of-victims/", "page_content": "After repeated memos and complaints, SS-Obersturmbannführer Gerhard Maurer, who was responsible for the employment of concentration camp prisoners, traveled to Oświęcim on February 10, 1943. He promised IG Farben the prompt supply of another thousand prisoners, and the systematic “exchanging” of those no longer capable of hard labor at the factory. More than 10 thousand prisoners fell victim to selection during the period that the camp was in operation. They were taken to the hospital in the main camp, where most of them were killed by lethal injection of phenol to the heart, or to Birkenau, where some were liquidated after so-called “re-selection” in the BIIf prison hospital or—in the majority of cases—murdered immediately in the gas chambers. More than 1,600 prisoners other prisoners died in the hospital in Monowice, and several dozen were shot at the construction site or hanged in the camp. Summing up these figures and adding several hundred known victims in the Buna labor detail, a total of about 10 thousand Auschwitz concentration camp prisoners thus lost their lives as a result of working for IG Farben.\n\nThe number of victims of the camp in Monowice cannot be attributed solely to the difficult living conditions that were typical of almost all the components of the Auschwitz complex. Although the barracks were as overcrowded as those in Birkenau, the ones in Monowice at least had windows and were heated in the winter. An additional portion of watery soup—the so-called “Buna-Suppe”—served as a supplement, however minimal, to the insufficient food rations. It therefore seems reasonable to assume that the main reason for the high death rate among the prisoners in the Monowice camp resulted from the desire by factory management to maintain a high work rate, and that this desire was expressed in the instructions given to foremen. In practical terms, the foremen were in charge of the various labor details, and they constantly demanded that the capos and SS men enforce higher productivity by the prisoners—by beating them. The management of the IG Farben plants approved such methods, as indicated by, among other things, reports sent from Monowice to corporate headquarters in Frankfurt am Main. Maximilian Faust, the engineer in charge of construction, repeatedly stated in these reports that the only way to keep prisoner labor productivity at a satisfactory level was through the use of violence and corporal punishment. While declaring his own opposition to “flogging and mistreating prisoners to death,” Faust nevertheless added that “achieving the appropriate productivity is out of the question without the stick.”\n\nThe fact that the prisoners worked more slowly on the average than German construction workers, despite the beatings, was a source of irritation and dissatisfaction to factory management. This led to repeated requests to the camp authorities for increased numbers of SS men to supervise the prisoners, and for the supply of “more energetic capos.” Soon afterwards, a group of specially chosen German common criminal capos was sent to Monowice. When these steps failed to yield tangible results, IG Farben officials proposed the introduction of a “rudimentary piecework system” and a motivational scheme including the right to wear watches, longer hair (rejected in practice), the payment of scrip that could be used in the camp canteen (which offered cigarettes and other low-value trifles for sale), and free visits to the camp bordello (which opened in the Monowice camp in 1943).\n\nHowever, these steps had hardly any real effect on prisoner productivity. Only in December 1944, at the conference in Katowice, was attention paid to the true causes of low prisoner labor productivity: the motivational system was characterized as ineffective and the capos as “good,” but it was admitted that the prisoners worked slowly simply because they were hungry.\n\nTo an enormous degree, of course, the SS men from the garrison in Monowice were responsible for the conditions that prevailed in the camp. SS-Obersturmführer Vinzenz Schöttl held the post of Lagerführer during the period when Monowice functioned as one of the many Auschwitz sub-camps. In November 1943, after the reorganization of the administrative system and the division of Auschwitz into three quasi-autonomous components, the camp in Monowice received a commandant of its own. This was SS-Hauptsturmführer Heinrich Schwarz, who until then had been the head of the labor department and Lagerführer in the main camp. At Monowice, he was given authority over the Jawischowitz, Neu-Dachs, Fürstengrube, Janinagrube, Golleschau, Eintrachthütte, Sosnowitz, Lagischa, and Brünn (Bohemia) sub-camps. Later, the directors of new sub-camps opened at industrial facilities in Silesia and Bohemia answered to him.\n\nIn May 1944, the headquarters of a separate guard battalion (SS-Totenkopfsturmbann KL Auschwitz III) was established in Monowice. It consisted of seven companies, who were on duty in the following sub-camps:\n\n1 Company – Monowitz,\n\n2 Company – Golleschau, Jawischowitz,\n\n3 Company – Bobrek, Fürstengrube, Günthergrube, Janinagrube,\n\n4 Company – Neu-Dachs,\n\n5 Company – Eintrachthütte, Lagischa, Laurahütte, Sosnowitz II,\n\n6 Company – Gleiwitz I, II and III,\n\n7 Company – Blechhammer.\n\nIn September 1944, a total of 1,315 SS men served in these companies. The 439 of them who made up 1 Company were stationed at Monowice, and included not only guards but also the staffs of the offices and stores that saw to the needs of the remaining sub-camps."}, {"url": "https://www.auschwitz.org/en/history/auschwitz-ii/the-construction-of-the-camp/", "page_content": "Original plans called for the POWs who would be imprisoned there to build the camp themselves. Ten thousand Soviet POWs were brought from the Neuhammer am Quais (now Świętoszów) POW camp, and probably also from Lamsdorf (now Łambinowice) for this purpose in October 1941. At first, they were housed in separate, fenced-off blocks in the Auschwitz main camp. In that same month, they began being marched every day to the construction site in the village of Brzezinka.\n\nAll the Poles who lived in the village had been expelled in April 1941, and their homes demolished. Brzezinka lay within the 40 sq. km. of the so-called camp interest zone (Interessengebiet), administered by the camp. The residents of other villages in the zone shared the same fate, as had the people living in the Oświęcim suburb of Zasole at the time of the founding of the Auschwitz camp.\n\nBI, the first of the four planned Birkenau segments, was built in the village of Brzezinka over the winter of 1941/1942 and during the rest of 1942, and divided into two sectors, BIa and BIb. Including buildings added later, this segment contained 62 residential barracks in the final phase of its existence (30 brick and 32 wooden), along with 10 barracks containing washrooms and toilets, 2 kitchens, 2 bathhouses, and 2 storage barracks. Work on the second construction segment (BII) began in 1942 and was finished near the end of 1943. This segment was divided into 7 sectors of wooden barracks. Sector BIIa contained 16 residential barracks, 3 barracks containing washrooms and toilets, and a kitchen barracks. Sectors BII b, c, d, and e each contained 32 residential barracks, 6 barracks containing washrooms and toilets, and 2 kitchens. In sector BIIf there were 17 residential barracks and 1 bathhouse barracks. Thirty barracks used mainly as warehouses were built in sector BIIg, along with 1 brick bathhouse (sauna). That same year, work began on the third construction segment (BIII). The approach of the front lines in 1944 brought construction to a halt. Work on the fourth construction segment never got underway.\n\nThe construction segments were divided into sectors (“camps”) separated by electrified barbed-wire fences. Guard towers surrounded the entire camp. A three-track railroad spur and unloading ramp went into operation in May 1944.\n\nThe Germans managed to build a total of approximately 300 housing, administrative, and infrastructure barracks and buildings, 13 km. of drainage ditches, 16 km. of barbed-wire fencing, and more than 10 km. of roads within an area of about 140 hectares at Birkenau.\n\nTwo provisional gas chambers, known as bunkers 1 and 2, went into operation next to the Birkenau construction site in 1942, when Auschwitz commandant Rudolf Höss was entrusted with carrying out part of the campaign to exterminate the Jews. They were adapted farmhouses that previously belonged to expelled Poles. The first began operating in early 1942, probably in March, and the second in mid-year.\n\nThe construction of a complex of four gigantic gas chambers and crematoria began in mid-1942. The Germans estimated that 1.6 million people a year could be killed and burned there."}, {"url": "https://www.britannica.com/place/Auschwitz", "page_content": "Auschwitz , Polish Oświęcim , also called Auschwitz-Birkenau , Nazi Germany’s largest concentration camp and extermination camp . Located near the industrial town of Oświęcim in southern Poland (in a portion of the country that was annexed by Germany at the beginning of World War II ), Auschwitz was actually three camps in one: a prison camp, an extermination camp, and a slave-labour camp . As the most lethal of the Nazi extermination camps, Auschwitz has become the emblematic site of the “final solution,” a virtual synonym for the Holocaust . Between 1.1 and 1.5 million people died at Auschwitz; 90 percent of them were Jews . Also among the dead were some 19,000 Roma who were held at the camp until the Nazis gassed them on July 31, 1944—the only other victim group gassed in family units alongside the Jews. The Poles constituted the second largest victim group at Auschwitz, where some 83,000 were killed or died.\n\nAuschwitz was probably chosen to play a central role in the “final solution” because it was located at a railway junction with 44 parallel tracks—rail lines that were used to transport Jews from throughout Europe to their death. Heinrich Himmler , chief of the SS , the Nazi paramilitary corps, ordered the establishment of the first camp, the prison camp, on April 27, 1940, and the first transport of Polish political prisoners arrived on June 14. This small camp, Auschwitz I, was reserved throughout its history for political prisoners, mainly Poles and Germans.\n\nAuschwitz II (Birkenau) and Auschwitz III\n\nIn October 1941, work began on Auschwitz II, or Birkenau, located outside the nearby village of Brzezinka. There the SS later developed a huge concentration camp and extermination complex that included some 300 prison barracks; four large so-called Badeanstalten (German: “bathhouses”), in which prisoners were gassed to death; Leichenkeller (“corpse cellars”), in which their bodies were stored; and Einäscherungsöfen (“cremating ovens”). Another camp (Buna-Monowitz), near the village of Dwory, later called Auschwitz III, became in May 1942 a slave-labour camp supplying workers for the nearby chemical and synthetic-rubber works of IG Farben. In addition, Auschwitz became the nexus of a complex of 45 smaller subcamps in the region, most of which housed slave labourers. During most of the period from 1940 to 1945, the commandant of the central Auschwitz camps was SS-Hauptsturmführer (Capt.) and ultimately SS-Obersturmbannführer (Lieut. Col.) Rudolf Franz Höss (Hoess).\n\nThe death camp and slave-labour camp were interrelated. Newly arrived prisoners at the death camp were divided in a process known as Selektion. The young and the able-bodied were sent to work. Young children and their mothers and the old and infirm were sent directly to the gas chambers. Thousands of prisoners were also selected by the camp doctor, Josef Mengele, for medical experiments. Auschwitz doctors tested methods of sterilization on the prisoners, using massive doses of radiation, uterine injections, and other barbaric procedures. Experiments involving the killing of twins, upon whom autopsies were performed, were meant to provide information that would supposedly lead to the rapid expansion of the “Aryan race.”\n\nBritannica Quiz Nazi Germany Quiz\n\nSubject to harsh conditions—including inadequate shelter and sanitation—given minimal food, and worked to exhaustion, those who could no longer work faced transport back to Birkenau for gassing. German corporations invested heavily in the slave-labour industries adjacent to Auschwitz. In 1942 IG Farben alone invested more than 700 million Reichsmarks in its facilities at Auschwitz III."}, {"url": "https://www.auschwitz.org/en/museum/news/who-built-the-auschwitz-german-concentration-camp,104.html", "page_content": "Who Built the Auschwitz German Concentration Camp?\n\nWho Built the Auschwitz German Concentration Camp? A Controversial Statement by an Official of the World Jewish Congress\n\nPolish Government Calls for Name Change on UNESCO List\n\nIn late March, the Polish government requested that UNESCO change the name of the concentration camp site. Polish deputy minister of culture Tomasz Merta wrote to the UNESCO World Heritage Center in Paris asking that the site, entered on the UNESCO list as “Auschwitz Concentration Camp,” be renamed. The proposed new version is “Auschwitz-Birkenau Former Nazi German Concentration Camp.”\n\nThe change is intended as a way of correcting the unfortunate term “Polish concentration camp,” which regularly appears in the world media, and even in the German press—as in a recent issue of the news magazine Der Spiegel, for instance.\n\n“The old name is no longer comprehensible, especially to the younger generation. The new, more precise term associates the place with the Nazi regime in Germany,” said Merta, adding that he “did not expect the negative reaction to the new name. Germany today is a country that is not afraid to take responsibility for history.”\n\nCriticism from the World Jewish Congress\n\nIn the “Global News” section of the World Jewish Congress website, an item dated April 7, 2006 stated that the Polish government’s suggestion about changing the official name of the \"Auschwitz-Birkenau Concentration Camp\" to \"Former Nazi German Concentration Camp Auschwitz-Birkenau\" had met criticism. Maram Stern, deputy secretary general of the World Jewish Congress, said that \"[the Poles] want to redefine history by changing the name.\"\n\n“Although the camp had been built and run by Nazi Germany, everybody in the area had known about its existence and workers were recruited from the Polish population in the neighboring village,” the item continued. “The government in Warsaw wants the history of Auschwitz, which is listed as a UNESCO world heritage site, to be separated from Polish history and make it clear that Poland had no involvement in the death camp. Officials in Warsaw expect an answer to the renaming request from UNESCO later this year,” the item concludes.\n\nReaction from the Auschwitz-Birkenau State Museum\n\nIn response to the information contained in the item suggesting that Poles living near the camp participated in its construction, the Museum director’s office has published a letter to Maram Stern, author of this unfortunate statement, from Henryk Świebocki of the Museum Historical Research Department.\n\nThe office of the director of the Auschwitz-Birkenau State Museum in Oświęcim fully endorses Dr. Henryk Świebocki’s view of the statements by Maram Stern of the World Jewish Congress and regards Dr. Świebocki’s view of the matter as correct:\n\nOświęcim, 10 April 2006\n\nHenryk Świebocki\n\nSenior Curator\n\nThe Auschwitz-Birkenau State Museum\n\nin Oświęcim\n\nMr Maram Stern\n\nDeputy Secretary General\n\nof the World Jewish Congress\n\nWorld Jewish Congress\n\nPO Box 90400\n\nWashington,\n\nDC 20090 USA\n\nFrom the media I have learnt about your statement of 7 April 2006 in connection with renaming KL Auschwitz. Let me cite its fragment, “The Polish government redefine history by changing the name. […]Although the camp had been built and run by Nazi Germany, everybody in the area had known about its existence and workers were recruited from the Polish population in the neighboring village. The government in Warsaw wants the history of Auschwitz to be separated from Polish history and make it clear that Poland had no involvement in the death camp”.\n\nI wish to believe, that when you made the statement you were not driven by ill will. But it rather resulted from your unfamiliarity with the subject. I do not dare to suspect you of making a suggestion that Poles are, to a certain degree, responsible for Auschwitz, and “The government in Warsaw wants […] make clear that Poland had no involvement in the death camp”.\n\nAre you aware of the fact, that Auschwitz, before it became one of the death centers for Jews, had been established by Nazi Germany to exterminate Polish population? And of the fact that its first victims were Polish citizens? And that at least 75 000 Poles perished in the camp, being the second largest group of victims?\n\nAmong the victims was also my father, Karol Świebocki, a catholic, member of the Resistance Movement, who as a political prisoner survived only a month and a half in the camp and was killed in the gas chamber in Birkenau (KL Auschwitz II) at the beginning of August 1942.\n\nYou state that everybody in the area had known about the existence of the camp and workers were recruited from the Polish population. It is true. Everybody had known about the camp. Not only local population, but also the whole Poland knew the truth about KL Auschwitz, as well as the Allies, Western World, World and European Jewish Congresses, International Red Cross and Vatican. Due to secret contacts between the Polish underground, Polish local population and prisoners, documents and reports on the SS crimes were collected, handed over to the Polish Resistance Movement and then sent to the West. These materials consisted of data on the mass murder of Jews and extermination of Poles, Roma and Sinti, the Soviet POWs and other national and ethnic groups. The Polish Government in Exile in London published documents, reports and organized press conferences on the crimes being committed in Auschwitz. Even in its diplomatic notes, the Polish Government in Exile informed the Allies and neutral countries about KL Auschwitz. The public was aware of what was happening at KL Auschwitz, for instance, from BBC broadcasts, newspapers and publications or press conferences of the Polish Government in Exile in London.\n\nYou state that workers in the camp were recruited form the local Polish population. From the context, it seems to be an accusation, that they worked there. The implied meaning even suggests collaboration! I would like to explain that workers did not volunteer to work in the camp. In Poland under German occupation, there was a work constraint for people of both sexes over 14. Who did not obey the orders was subjected to persecutions, for instance: arrest, interrogation, imprisonment, concentration camp or forced labor in Germany. The workers, who were recruited from the local population, but mainly from the Upper Silesia population, were sent by German companies, which employed them, to conduct various works in the camp and adjacent area. Also, local farmers were forced to work, using their own means of transport - they had to deliver construction materials to the camp. Again, I would like to emphasize they were forced to conduct these works. Similarly, between May and June 1940, the Jewish Community from Oświęcim was forced to assign 300 Jews to work in order to prepare the grounds for the future KL Auschwitz. Should they be blamed for this?\n\nI would like to emphasize that the Polish forced workers kept secret contacts with prisoners and provided them with assistance, food, medicine and smuggled their letters out of the camp. They also smuggled out of the camp documents concerning the Nazi crimes, which were sent to the West by the Polish Resistance Movement.\n\nMiriam Jahaw, a Jewish survivor, recalls a Polish man, Oświęcim citizen, 22-year-old Janek, who as a civilian worker, electrician, worked in Birkenau (KL Auschwitz II) and helped selflessly her and her Jewish fellow prisoners to survive the camp. Secretly, risking his life, he smuggled food, medicine, cigarettes and pieces of clothes to the camp. Once Janek smuggled some yeast, which later turned out to be excellent and effective remedy for boils and open wounds of one prisoner, a Jewish woman, Lubka. Thanks to that during the selection she escaped the gas chamber. “I tried to find him after the war,” writes Miriam Jahaw-Szewach in her letter of 19 July 2004 to the Auschwitz-Birkenau State Museum in Oświęcim, “find his traces, thank him, that he passed the examination of humanity ‘in the times of disdain’, that he risked his life, showed us so much heart, understanding and provided with selfless help, unfortunately, I did not find him and I will never have a chance to tell him, how much I value his courage, which determined our survival. Until now, I have been recalling Janek with a deep emotion and I admire him for his attitude, which deserves a full recognition and gratitude.”\n\nPlease find enclosed my lecture (about assistance to KL Auschwitz prisoners) which was given at the United States Holocaust Memorial Museum in Washington in 1999. It was published in the form of an article in Australia in 2006 (Henryk Świebocki, “How Poles Reacted to the Extermination of Prisoners at KL Auschwitz.” (In:) Genocide Perspectives III. Essays on the Holocaust and Other Genocides. The Australian Institute for Holocaust and Genocide Studies. Sydney 2-6, p. 198-213). In the notes on the authors of the publication, under the name Henryk Świebocki, you can find titles of my extensive works in English and German about attitudes of Polish population towards what was happening at KL Auschwitz. I recommend that you familiarize yourself with these works and form your own view on the subject.\n\nUnfortunately, I can not offer you the last-year publication edited by me, 636 pages in length, because it was published only in Polish (Ludzie Dobrej Woli. Księga Pamięci Mieszkańców Ziemi Oświęcimskiej niosących pomoc więźniom KL Auschwitz [People of Good Will: Memorial Book of Oświęcim Land Residents Who Aided Auschwitz Concentration Camp Prisoners]. Ed. Henryk Świebocki, Oświęcim 2005). The book includes over 1200 names of Poles from the area adjacent to the camp and describes forms of their assistance as well as persecutions they suffered from the German occupant. Many of them paid with their lives for their activities. If a book is published in English, I will send it to you.\n\nYours sincerely,\n\nHenryk Świebocki"}, {"url": "https://www.britannica.com/topic/Why-wasnt-Auschwitz-bombed-717594", "page_content": "The question “Why wasn’t Auschwitz bombed?” is not only historical. It is also a moral question emblematic of the Allied response to the plight of the Jews during the Holocaust. Moreover, it is a question that has been posed to a series of presidents of the United States.\n\nIn their first meeting in 1979, President Jimmy Carter handed Elie Wiesel—a noted author and survivor of Auschwitz who was then chairman of the President’s Commission on the Holocaust—a copy of the soon-to-be-released aerial photographs of the extermination camp at Auschwitz-Birkenau (Auschwitz II), taken by American intelligence forces during World War II. Wiesel was imprisoned in Buna-Monowitz (Auschwitz III), the slave-labour camp of Auschwitz, when in August 1944 Allied planes bombed the IG Farben plant there. Of that event he wrote, “We were no longer afraid of death; at any rate, not of that death. Every bomb filled us with joy and gave us new confidence in life.”\n\nTwo months after his initial meeting with Carter, in an address at the first National Days of Remembrance ceremony at the Capitol rotunda on April 24, 1979, Wiesel responded to his gift by saying, “The evidence is before us: The world knew and kept silent. The documents that you, Mr. President, handed to the chairman of your Commission on the Holocaust, testify to that effect.” Wiesel was to repeat that accusation to Presidents Ronald Reagan and Bill Clinton. The failure to bomb Auschwitz during World War II also became part of the debate in 1999 over the Allied bombing of Kosovo.\n\nFirst to the historical issues: The question of bombing Auschwitz first arose in the summer of 1944, more than two years after the gassing of Jews had begun and at a time when more than 90 percent of the Jews who were killed in the Holocaust were already dead. It could not have arisen earlier because not enough was known specifically about Auschwitz, and the camps were outside the range of Allied bombers. By June 1944 information concerning the camps and their function was available—or could have been made available—to those undertaking the mission. German air defenses were weakened, and the accuracy of Allied bombing was increasing. All that was required was the political will to order the bombing.\n\nBefore the summer of 1944, Auschwitz was not the most lethal of the six Nazi extermination camps. The Nazis had killed more Jews at Treblinka, where between 750,000 and 900,000 Jews were killed in the 17 months of its operation, and at Belzec, where 600,000 were killed in less than 10 months. In 1943 the Nazis closed both camps. Their mission, the destruction of Polish Jewry, had been completed. But during the summer of 1944 Auschwitz overtook the other death camps not only in the number of Jews killed but in the pace of destruction. The condition of the Jews was desperate.\n\nIn March 1944 Germany invaded Hungary. In April the Nazis confined the Hungarian Jews to ghettos. Between May 15 and July 9, the Nazis deported some 438,000 Jews on 147 trains from Hungary to the death camp at Auschwitz-Birkenau. To accommodate the newly arriving Hungarian Jews, the Nazis built a railroad spur directly into Auschwitz-Birkenau. Because the Nazis sent four of five arriving Jews directly to their death, the extermination camp was strained beyond capacity. The gas chambers were operating around the clock, and the crematoria were so overtaxed that bodies were burned in open fields with body fat fueling the flames. Any interruption in the killing process might have saved thousands of lives.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nYet bombing a concentration camp filled with innocent, unjustly imprisoned civilians also posed a moral dilemma for the Allies. To be willing to sacrifice innocent civilians, one would have had to perceive accurately conditions in the camp and to presume that interrupting the killing process would be worth the loss of life in Allied bombings. In short, one would have had to know that those in the camps were about to die. Such information was not available until the spring of 1944.\n\nOn April 10, 1944, two men escaped from Auschwitz: Rudolph Vrba and Alfred Wetzler. They made contact with Slovak resistance forces and produced a substantive report on the extermination camp at Auschwitz-Birkenau. In great detail, they documented the killing process. Their report, replete with maps and other specific details, was forwarded to Western intelligence officials along with an urgent request to bomb the camps. Part of the report, forwarded to the U.S. government’s War Refugee Board by Roswell McClelland, the board’s representative in Switzerland, arrived in Washington on July 8 and July 16, 1944. While the complete report, together with maps, did not arrive in the United States until October, U.S. officials could have received the complete report earlier if they had taken a more urgent interest in it.\n\nThe Vrba-Wetzler report provided a clear picture of life and death at Auschwitz. As a result, Jewish leaders in Slovakia, some American Jewish organizations, and the War Refugee Board all urged the Allies to intervene. However, the request was far from unanimous. Jewish leadership was divided. As a general rule, the established Jewish leadership was reluctant to press for organized military action directed specifically to save the Jews. They feared being too overt and encouraging the perception that World War II was a “Jewish war.” Zionists, recent immigrants, and Orthodox Jews were more willing to press for specific efforts to save the Jews. Their voices, however, were more marginal than those of the established Jewish leadership, and their attempts were even less effective.\n\nIt would be a mistake to assume that anti-Semitism or indifference to the plight of the Jews—while present—was the primary cause of the refusal to support bombing. The issue is more complex. On June 11, 1944, the Jewish Agency executive committee meeting in Jerusalem refused to call for the bombing of Auschwitz. Jewish leadership in Palestine was clearly neither anti-Semitic nor indifferent to the situation of their brethren. David Ben-Gurion, chairman of the executive committee, said, “We do not know the truth concerning the entire situation in Poland and it seems that we will be unable to propose anything concerning this matter.” Ben-Gurion and his colleagues were concerned that bombing the camps could kill many Jews—or even one Jew. Although no specific documentation reversing the decision of June 11 has been found, officials of the Jewish Agency were forcefully calling for the bombing by July.\n\nWhat happened between the June 11 refusal to call for bombing and the subsequent action? After the Vrba-Wetzler report arrived in Palestine, the Jewish Agency executive committee had come to understand what was happening in Poland and was much more willing to risk Jewish lives in the camp rather than to permit the gassing to proceed unimpeded.\n\nJewish Agency officials appealed to British Prime Minister Winston Churchill, who told his foreign secretary Anthony Eden on July 7, “Get anything out of the Air Force you can and invoke me if necessary.” Yet the British never carried through with the bombing.\n\nRequests were also made to American officials to bomb Auschwitz. Similarly they were asked to come to the aid of the Poles in the Warsaw Uprising of 1944 by bombing the city. Yet the Americans denied the requests to bomb Auschwitz, citing several reasons: military resources could not be diverted from the war effort (as they were to support the non-Jewish Poles); bombing Auschwitz might prove ineffective; and bombing might provoke even more vindictive German action. On the other hand, the Americans did not claim that Auschwitz was outside the range of the most effective American bombers.\n\nIn fact, as early as May 1944 the U.S. Army Air Forces had the capability to strike Auschwitz at will. The rail lines from Hungary were also well within range, though for rail-line bombing to be effective it had to be sustained. On July 7, 1944, American bombers flew over the rail lines to Auschwitz. On August 20, 127 B-17s, with an escort of 100 P-51 fighter craft, dropped 1,336 500-pound bombs on the IG Farben synthetic-oil factory that was less than 5 miles (8 km) east of Birkenau. German oil reserves were a priority American target, and the Farben plant ranked high on the target list. The death camp remained untouched. It should be noted that military conditions imposed some restrictions on any effort to bomb Auschwitz. For the bombing to be feasible, it had to be undertaken by day in good weather and between July and October 1944.\n\nIn August, Assistant Secretary of War John J. McCloy wrote to Leon Kubowitzki of the World Jewish Congress, noting that the War Refugee Board had asked if it was possible to bomb Auschwitz. McCloy responded:\n\nAfter a study it became apparent that such an operation could be executed only by the diversion of considerable air support essential to the success of our forces now engaged in decisive operations elsewhere and would in any case be of such doubtful efficacy that it would not warrant the use of our resources. There has been considerable opinion to the effect that such an effort, even if practicable, might provoke even more vindictive action by the Germans.\n\nMcCloy’s response remains controversial. There had been no study on bombing Auschwitz. Instead, the War Department had decided in January that army units would not be “employed for the purpose of rescuing victims of enemy oppression” unless a rescue opportunity arose in the course of routine military operations. In February an internal U.S. War Department memo stated, “We must constantly bear in mind, however, that the most effective relief which can be given victims of enemy persecution is to insure the speedy defeat of the Axis.” No documents have been found in the records of the leaders of Army Air Forces considering the possibility of bombing Auschwitz.\n\nFor three decades the failure to bomb Auschwitz was a minor side issue to the war and the Holocaust. In May 1978 American historian David Wyman wrote an article in the magazine Commentary titled “Why Auschwitz Was Never Bombed.” His article provoked much positive response and was reinforced by the startling photographs published by two leading Central Intelligence Agency photo interpreters, Dino Brugioni and Robert Poirier. Developed with technology available in 1978, but not in 1944, these photographs seemingly gave a vivid demonstration of what U.S. intelligence could have known about Auschwitz-Birkenau, if only they had been interested. One photograph shows bombs dropping over the camp—because the pilot released the bombs early, it appeared that bombs targeted for the Farben plant were dropped on Auschwitz-Birkenau. Another pictures Jews on the way to the gas chambers. Wyman’s claims gained considerable attention, and the failure to bomb became synonymous with American indifference.\n\nIn the late 1980s and early ’90s, debate over the issue intensified. Military historians challenged Holocaust historians in an ineffectual debate characterized as the “Dialogue of the Deaf.” In 1993 both Holocaust scholars and military historians of divergent points of view addressed the issue in a symposium at the National Air and Space Museum that marked the opening of the United States Holocaust Memorial Museum. At issue was the nature of the aircraft that could have been used. Was bombing feasible, and when? From what air fields would the bombers take off, and where would they land? What airplanes would be used? What escorts would be required, and at what cost in men and material? Could lives have been saved and how many? At what cost to the Allies? But in addition to military considerations, political questions were at issue. Did the plight of the Jews matter? To whom and how deeply? Were Jews effective or ineffective in advancing the cause of their brethren abroad? Did they comprehend their plight? Were they compromised by their fears of anti-Semitism or by the fears they shared with American political leaders that the World War would be perceived as a Jewish war? Historians are uncomfortable with the counterfactual speculation “What if…” But such is the debate over bombing Auschwitz.\n\nWe know that, in the end, the pessimists won. They argued that nothing could be done, and nothing was done. The proposals of the optimists, those who argued that something could be done, were not even considered. Given what happened at Auschwitz-Birkenau during the summer of 1944, many have seen the failure to bomb as a symbol of indifference. Inaction helped the Germans achieve their goals and left the victims with little power to defend themselves. The Allies did not even offer bombing as a gesture of protest."}, {"url": "https://www.basf.com/global/en/who-we-are/history/chronology/1925-1944/1939-1945/zwangsarbeit-in-auschwitz.html", "page_content": "Extermination by labor\n\nIn 1941, the decision concerning the location of the fourth Buna plant and more plants of I.G. Farben falls on Monowitz, a village near Auschwitz in German-occupied Poland. By request of the German Wehrmacht, they should be in the east and thus out of range of Allied air power. In addition to German skilled labor and forced labor from all over Europe, prisoners of the nearby Auschwitz concentration camp are also deployed at the I.G. Farben construction site in Monowitz.\n\nIn June 1942, I.G. Farben begins constructing its own concentration camp on its factory grounds in Monowitz (Auschwitz III or Buna/Monowitz). The first 600 inmates are committed at the company’s own concentration camp in October 1942; the camp reaches its maximum occupancy of over 11,000 prisoners in July 1944.\n\nEstimates on the number of concentration camp victims in Buna/Monowitz vary. If you include the subcamps of the Buna/Monowitz concentration camp, especially in the black coal mining operation, we can estimate around 41,000 inmates in total, of which around 30,000 were killed. They fall victim to the working and living conditions either directly on the construction site or in the camp’s infirmary at the Buna/Monowitz camp. Or they are emaciated due to poor nourishment and hard labor, become sick or injured, are replaced with capable new arrivals and then sent to their death in the extermination camp Auschwitz-Birkenau.\n\n"}, {"url": "https://www.auschwitz.org/en/museum/preservation/", "page_content": "Paper consrvation... Construction... Alloy of metal... Microscope research\n\nThe Museum Preservation Department is responsible for protecting everything that remains at the Auschwitz-Birkenau Concentration Camp site. It has one of the most advanced conservation workshops in the world at its disposal, and employs a staff of highly qualified specialists in landmark preservation, as well as specialists in various technical fields. It monitors the condition of the objects at the site and carries out essential conservation work.\n\nThe Department plans and carries out renewal, conservation, and new investment projects. It oversees 155 buildings (including original camp blocks, barracks, and outbuildings), some 300 ruins and other vestiges of the camp—including the ruins of the four gas chambers and crematoria at the Auschwitz II-Birkenau site that are of particular historical significance—as well as more than 13 km. of fencing, 3,600 concrete fence posts, and many other installations. There are kilometers of roads, drainage ditches, railroad tracks including a spur and unloading platform, two original sewage-treatment plants, and fire-prevention reservoirs on grounds covering almost 200 hectares. The low-growing vegetation and the historical and postwar trees (including about 20 hectares of woods) also require ongoing conservation.\n\nThe Department devotes a large part of its efforts to the conservation of movable objects from the Museum collections. These include about 110 thousand shoes, about 3,800 suitcases, 12 thousand pots and pans, 40 kg. of eyeglasses, 470 prostheses, 570 items of camp clothing, as well as 4,5 thousand works of art. The Museum Archives hold documents that fill almost 250 meters of shelving, including 48 volumes of the so-called camp death books, 248 volumes of records from the Waffen-SS and Police Central Construction Board in Auschwitz, 64 volumes of records from the SS-Hygiene Institut, 16 volumes of personal files on prisoners, and about 8 thousand camp letters.\n\nThe Department uses the most advanced technical methods possible within the financial resources of the Museum. The emphasis falls on the greatest feasible preservation of extant original material, introducing the bare minimum of additional, clearly marked elements in order to rescue and interpret the original items while making them accessible to visitors. Necessary changes are introduced in such a way as to make them visible, and are always meticulously documented. Whenever possible, the Department carries out conservation work using discrete, reversible processes. This leaves the possibility open for carrying out new conservation, with more advanced techniques, in the future.\n\nDetailed records cover all conservation work, on individual items or entire buildings. Special folders contain not only a precise photographic record of each stage of conservation work, but also a comprehensive analysis undertaken before the start of each project, an exact description of the conservation techniques applied, and documentation of the object after the completion of conservation.\n\nCONTACT"}]}