{"Alfred Fischer was removed from his post in November 1944.": [{"url": "https://dornsife.usc.edu/news/stories/in-memoriam-alfred-al-fischer-96/", "page_content": "Emeritus Professor of Earth Sciences Alfred “Al” Fischer, a globally prominent geologist, has died. He was 96.\n\nFischer died peacefully on July 2 at Maravilla Senior Living Community in Santa Barbara, Calif.\n\nFischer made many major contributions to the understanding of environmental cyclicity, characterized by repetitive patterns of different rock layers, or strata, in the Earth.\n\n“Al Fischer was one of the most globally prominent sedimentary geologists of the second half of the 20th century,” said David Bottjer, professor of Earth sciences, biological sciences and environmental studies. “At USC he was a wonderful colleague who sparked many innovative research interactions at the intersection of Earth and life evolution, and was the prototype faculty member for our department’s now leading program in geobiology.”\n\nDescribing Fischer as a renaissance scholar, William Berelson, professor of Earth sciences and environmental studies and chair of Earth sciences said, “The breadth of Al’s influence spans generations and is global. The Earth sciences community has lost an icon.”\n\nFischer studied marine sedimentology and marine fossil fauna and was a leading scientist in the Deep Sea Drilling Project. He described in 1964 the phenomenon of rhythmically recurring sequences of sedimentary rock layers in some Keuper Formations of the Alps, first discovered in the Dachstein-Kalk (Dachstein limestone) found in the Austrian province of Salzburg. In the 1970s, he propagated the existence of global biorhythms in the fossil record and in 1977 the concept of cycles of low and high levels of biodiversity in the marine fauna over 32 million years. In 1982, he spoke in favor of the Earth’s climate alternating between ice ages and warm periods due to the Icehouse-Greenhouse concept.\n\nFischer’s work at USC Dornsife, and earlier at Princeton University, concentrated on the little-understood area of stratigraphy — the branch of geology concerned with the order and relative position of strata and their relationship to the geological time scale. He was probably one of the first people to recognize the importance of Milankovitch cycles, or orbital forcing, which show the variable amounts of sunlight hitting the Earth at a particular point over a period of time and how that changes as the Earth goes through a series of cycles. Fischer was able to show that these sequences, which were calculated theoretically in the orbital characteristics of the Earth, are mirrored in the sedimentary sequences — a huge advance in the understanding of sequence stratigraphy.\n\nAl Fischer was a leading scientist on the Deep Sea Drilling Project. Here he is pictured aboard the Glomar Challenger in the North Pacific around 1970. Photo courtesy of John McRaney.\n\nAn inspirational role model for students\n\nFischer was also a generous and devoted teacher. His elder son, Joseph Fred “Fritz” Fischer, recounts how after giving a guest lecture at Yale University in the late 1970s, his father turned down an offer to tour the university’s geology department in favor of talking to its graduate students.\n\n“The moment the students heard about it, they dashed off to quickly read up on his literature,” Fritz Fischer said. However, rather than talking about his own work, Al Fischer concentrated on the students’ efforts, sitting down with each student individually and asking about their thesis or dissertation, then making suggestions.\n\n“The students were utterly amazed,” Fritz Fischer said. “Here’s this great man, he’s made such a name for himself, and he wasn’t there to talk about himself. He was there to find out what they were doing. They all walked out of there saying, ‘Oh my God, I want to be like that man.’”\n\nFrom Nazi Germany to the United States\n\nBorn on Dec. 10, 1920, in Rothenburg, Germany, Al Fischer was the son of George Fischer, a traveling shoe salesman who made a fortune in the American Old West, retired at a young age and moved to Germany with his wife, Thea. Both parents were of German extraction, but born in the United States. The family lived in Germany for 14 years, for much of that time in an Alpine chalet where young Al Fischer developed a profound love of nature.\n\nWhen Adolf Hitler came to power, the family, deeply concerned by the direction Germany was taking, returned to the U.S. in 1935, settling in Watertown, Wis. Germany’s more advanced educational system meant that Fischer spent just a year in a U.S. high school before being admitted to a local college. He completed his sophomore year there, then transferred to the University of Wisconsin in 1938 with the expectation that he would become a forester. However, he rapidly fell in love with geology and graduated a year later, aged just 19, with his bachelor’s degree in that discipline.\n\nFollowing his graduation, on Aug. 26, 1939, he married Winnifred “Winnie” Varney, a graduate student in geography. Fischer then pursued a master’s degree in geology at the University of Wisconsin, graduating in 1940.\n\nFischer then began studying for his Ph.D., but the birth of his first child in 1941 forced him to temporarily abandon his studies and take a job teaching geology at Virginia Polytechnic Institute in Blacksburg. He remained until 1943, when the institute converted to an officer training school.\n\nWar time and post-war years\n\nAs a pre-Pearl Harbor father with a young son to look after and poor eyesight, Fischer was exempted from military service. Instead, he joined Stanolind Oil and Gas as a geologist, working first in Wichita, Kan., and then in Tallahassee, Fla., and supporting the war effort by seeking much-needed petroleum resources in the U.S.\n\nAl Fischer in Dec. 2012 in Santa Barbara, California. Photo by Jim Kennett.\n\nIn 1946, Fischer enrolled in Columbia University, completing the Ph.D. qualifying examination the same year. In 1947, he taught at the University of Rochester and from 1948 at the University of Kansas, where he was an assistant professor. That year, he also defended his Ph.D. dissertation at Columbia. During the summers of 1949 and 1950, Fischer managed a research program on the Capitan Reef Complex in the Guadalupe Mountains of West Texas, leading 15 to 20 geologists and graduate students. In 1950, he was awarded his Ph.D. from Columbia.\n\nAt the University of Kansas, he wrote a textbook on paleontology with two fellow professors, Raymond Moore and Cecil Lalicker. Published in 1952, Invertebrate Fossils (McGraw-Hill) became a classic that has endured in popularity for more than 60 years.\n\nFrom 1951–56, Fischer served as a petroleum geologist for Esso in Peru, first in Talara and then in Lima.\n\nImportant contributions in academe\n\nIn 1956, he returned to the U.S. to join Princeton. During his 28-year stay there, Fischer conducted substantial research in the Austrian and Italian Alps, worked in the Green River Basin — the watershed of the Green River, the Colorado River’s chief tributary — and drilled a core in Southern Colorado that was the focus of extensive study. He also served as visiting professor in Innsbruck, Austria, and in Berlin and Tübingen in Germany.\n\nAn avid reader of the New York Times and books on geology, Fischer also enjoyed reading fiction, writing poetry and watercolor painting. He was a keen traveler, deriving immense enjoyment from research trips, including a two-year journey around the world to look at deep sea sediments from 1970–71, armed with a 1969 Guggenheim Fellowship.\n\nPrinceton’s mandatory retirement at age 65 did not suit Fischer, who was not ready to retire, and in 1984 he joined USC Dornsife, partly also to please his wife, who had been raised in Southern California and did not like the New Jersey climate.\n\nIn 1994, Fischer was elected a member of the United States National Academy of Sciences. He was also a senior fellow of the American Association for the Advancement of Science and a fellow of the Geological Society of America, and he held honorary doctorates from the University of Tübingen.\n\nFischer was the recipient of more than 30 awards, including the 2009 Mary Clark Thompson Medal; the 1992 Gustav-Steinmann-Medaille for his pioneering insights into the rhythms of life and the Earth’s climate; the1992 Lyell Medal; the 1982 William H. Twenhofel Medal and the1972 Leopold-von-Buch-Plakette award of the German Geological Society. The honor that meant the most to him was his 1991 induction into the Academia Nazionale dei Lincei (the Italian Academy of Sciences), one of the oldest scientific academies in the world and which counts Galileo as an early inductee.\n\nFinally retired, but not really\n\nFischer officially retired from USC Dornsife in 1991 at the age of 71. Although he could no longer formally be a thesis advisor, he maintained an office on campus and continued to offer advice and help to students, even participating in field trips. It was not until the early 2000s that he began to slow down, spending more time working from home.\n\nHowever, even then Fischer continued to spearhead new research. During a 2011 field trip to look at the Monterey Formation near Morro Bay, Calif., which he attended as part of a celebration of the A. Eugene Fritsche Lifetime Award from the Pacific Section of the Society for Sedimentary Geology (SEPM), Fischer discovered that reversals in polarity of the Earth’s magnetic field bore a resemblance to some cyclic sedimentation patterns. As a result, Fischer spent the last years of his life working to determine if a relationship exists between the cycles in sedimentation and the changes in polarity in the Earth’s field and trying to relate that back to orbital forcing and the Milankovitch Cycles.\n\n“Unfortunately, he wasn’t able to carry this through to a conclusion before his death,” Fritz Fischer said. “Others are following up on it, and it will be interesting to see where this goes. This was a whole new window that my father was looking into, and it is typical of the man that he would do that.”\n\nIn 2010, Al Fischer’s wife died after suffering a stroke four years previously. They had been married for more than 70 years.\n\nFischer is survived by his children: Fritz Fischer, George William “Bill” Fischer and Lenore Ruth Fischer; his grandchildren Jon Karl Fischer, Kristina Michele Fischer, Bella Walsh and Jennifer Walsh; and great grandchildren Alexander, Nicolas and Madison Fischer, and Braiden and Justin Stanert.\n\nFischer was cremated in a private ceremony in Santa Barbara on July 14. A memorial is being planned for a later date."}, {"url": "https://peoplepill.com/people/alfred-fischer/", "page_content": "The Knight's Cross of the Iron Cross (German: Ritterkreuz des Eisernen Kreuzes) and its variants were the highest awards in the military and paramilitary forces of Nazi Germany during World War II. The Knight's Cross of the Iron Cross was awarded for a wide range of reasons and across all ranks, from a senior commander for skilled leadership of his troops in battle to a low-ranking soldier for a single act of extreme gallantry. A total of 7,321 awards were made between its first presentation on 30 September 1939 and its last bestowal on 17 June 1945. This number is based on the analysis and acceptance of the order commission of the Association of Knight's Cross Recipients (AKCR). Presentations were made to members of the three military branches of the Wehrmacht—the Heer (Army), Kriegsmarine (Navy) and Luftwaffe (Air Force)—as well as the Waffen-SS, the Reichsarbeitsdienst (RAD—Reich Labour Service) and the Volkssturm (German national militia). There were also 43 foreign recipients of the award.\n\nThese recipients are listed in the 1986 edition of Walther-Peer Fellgiebel's book, Die Träger des Ritterkreuzes des Eisernen Kreuzes 1939–1945 — The Bearers of the Knight's Cross of the Iron Cross 1939–1945. Fellgiebel was the former chairman and head of the order commission of the AKCR. In 1996, the second edition of this book was published with an addendum delisting 11 of these original recipients. Author Veit Scherzer has cast doubt on a further 193 of these listings. The majority of the disputed recipients had received the award in 1945, when the deteriorating situation of Germany during the final days of World War II left a number of nominations incomplete and pending in various stages of the approval process.\n\nListed here are the 280 Knight's Cross recipients whose last name starts with \"F\". Scherzer has challenged the validity of 12 of these listings. Georg-Wolfgang Feller, a 13th doubted recipient, is listed by the AKCR. However, the AKCR itself challenges his listing. The recipients are ordered alphabetically by last name. The rank listed is the recipient's rank at the time the Knight's Cross was awarded.\n\nBackground\n\nThe Knight's Cross of the Iron Cross and its higher grades were based on four separate enactments. The first enactment, Reichsgesetzblatt I S. 1573 of 1 September 1939 instituted the Iron Cross (Eisernes Kreuz), the Knight's Cross of the Iron Cross and the Grand Cross of the Iron Cross (Großkreuz des Eisernen Kreuzes). Article 2 of the enactment mandated that the award of a higher class be preceded by the award of all preceding classes. As the war progressed, some of the recipients of the Knight's Cross distinguished themselves further and a higher grade, the Knight's Cross of the Iron Cross with Oak Leaves (Ritterkreuz des Eisernen Kreuzes mit Eichenlaub), was instituted. The Oak Leaves, as they were commonly referred to, were based on the enactment Reichsgesetzblatt I S. 849 of 3 June 1940. In 1941, two higher grades of the Knight's Cross were instituted. The enactment Reichsgesetzblatt I S. 613 of 28 September 1941 introduced the Knight's Cross of the Iron Cross with Oak Leaves and Swords (Ritterkreuz des Eisernen Kreuzes mit Eichenlaub und Schwertern) and the Knight's Cross of the Iron Cross with Oak Leaves, Swords and Diamonds (Ritterkreuz des Eisernen Kreuzes mit Eichenlaub, Schwertern und Brillanten). At the end of 1944 the final grade, the Knight's Cross of the Iron Cross with Golden Oak Leaves, Swords, and Diamonds (Ritterkreuz des Eisernen Kreuzes mit goldenem Eichenlaub, Schwertern und Brillanten), based on the enactment Reichsgesetzblatt 1945 I S. 11 of 29 December 1944, became the final variant of the Knight's Cross authorized.\n\nRecipients\n\nService Number of presentations Posthumous presentations Heer 179 13 Kriegsmarine 17 0 Luftwaffe 65 7 Waffen-SS 19 1\n\nThe Oberkommando der Wehrmacht (Supreme Command of the Armed Forces) kept separate Knight's Cross lists, one for each of the three military branches, Heer (Army), Kriegsmarine (Navy), Luftwaffe (Air Force) and Waffen-SS. Within each of these lists a unique sequential number was assigned to each recipient. The same numbering paradigm was applied to the higher grades of the Knight's Cross, one list per grade. Of the 280 awards made to servicemen whose last name starts with \"F\", 25 were later awarded the Knight's Cross of the Iron Cross with Oak Leaves and three the Knight's Cross of the Iron Cross with Oak Leaves and Swords; 21 presentations were made posthumously. Heer members received 179 of the medals; 17 went to the Kriegsmarine, 65 to the Luftwaffe, and 19 to the Waffen-SS.\n\nThis along with the + (plus) indicates that a higher grade of Knight's Cross was awarded as well.\n\nThis along with an * (asterisk) indicates that the Knight's Cross was awarded posthumously.\n\nThis along with the ! (exclamation mark) indicates that author Walther-Peer Fellgiebel has expressed doubt regarding the veracity or formal correctness of the listing.\n\nThis along with the ? (question mark) indicates that author Veit Scherzer has expressed doubt regarding the veracity or formal correctness of the listing."}, {"url": "https://www.primidi.com/alfred_fischer_ss_officer", "page_content": "Alfred Fischer (14 December 1907 — 28 July 1945) was a Sturmbannführer (Major) in the Waffen-SS during World War II. He was awarded the Knight's Cross of the Iron Cross, which was awarded to recognize extreme battlefield bravery or successful military leadership by Nazi Germany during World War II.\n\nAlfred Fischer was born on the 14 December 1907 in Vienna, Austria. During World War II he volunteered to join the Waffen SS. He was awarded the German Cross in Gold while assigned to the I.Battalion, 5th SS Artillery Regiment SS Division Wiking in January 1943.\n\nIn March 1945 he was added to the Honour Roll Clasp of the Army and the Knight's Cross was awarded at the end of the war on the 9 May 1945, while in command of the II.Battalion, 11th SS Artillery Regiment, 11th SS Panzergrenadier Division Norland.\n\nFischer survived the war but died in the prisoner of war camp hospital at Landsberg an der Warthe, Germany now Poland on the 28 July 1945."}, {"url": "https://link.springer.com/article/10.1007/s00531-017-1563-9", "page_content": "Al Fischer comes from a German-American family and was born in Rothenburg/Fulda, Hesse, 1920. Partly, he grew up in southeastern-most Bavaria near Berchtesgaden, for much of that time in an Alpine chalet (Thalerwinkel) where the young Al Fischer was allowed to wander freely in the beautiful surroundings, thereby developing a profound love of nature. Many years later, he still referred in conversations to “meine beiden alten Tanten in Börchtesgaden” that he loved to visit over many decades.\n\nLater, he spent 5 years at high school in Wiesbaden (Hesse). In 1935, after Hitler had taken over Germany, along with his parents he moved at age 15 to his relatives in the USA and attended college in Watertown, Wisconsin. He studied geology at the University of Wisconsin, where he was awarded a bachelor’s degree in 1939 and a master’s degree in 1940, when he was not yet 20 years old.\n\nFrom 1941 to 1943 he worked at the Virginia Polytechnic Institute. In 1943–1944, he was a geologist for Stanolind Oil and Gas in Kansas, and from 1944 to 1946 a geologist in Florida. In 1947, he taught at the University of Rochester and from 1948 at the University of Kansas, where he was an assistant professor. In 1950, he gained a doctorate at Columbia University.\n\nFor 5 years from 1951 to 1956, he was a senior petroleum geologist for Esso in Peru, first in Talara and then in Lima, before becoming assistant professor in 1956 and professor in 1963 at Princeton University (Blair Professor 1970–1984). In 1984, he was appointed professor at the University of Southern California in Los Angeles, becoming emeritus professor in 1991. He also spent a year as a visiting professor at Innsbruck University (1962–1963), in particular, to interact with Bruno Sander whom he greatly admired, and he also had sabbatical leaves at the University of Tübingen, the University of Naples (1970), and the Technical University of Berlin (1973).\n\nFollowing his graduation, on August 26, 1939, he married Winnifred “Winnie” Varney, a graduate student in geography, rooted in Southern California, who died in 2010, 100 years old, after having been married to Al for more than 71 years. Al and Winnie are survived by their children Joseph Fred “Fritz” (also a petroleum geologist), George William “Bill”, and Lenore Ruth Fischer, four grandchildren, and five great grandchildren."}, {"url": "https://history.army.mil/brochures/anzio/72-19.htm", "page_content": "Twenty miles inland from Anzio on the approach to Rome were the Alban Hills, around whose southwest side ran Highway 7, a major north-south route. To the southeast of the Alban Hills was the Velletri Gap leading inland to another main north-south route, Highway 6, at Valmontone. East of the Velletri Gap were the Lepini\n\nThe landing was scheduled tentatively for late January 1944. Anzio was selected because it was considered the best site within striking distance of Rome but still within range of Allied aircraft operating from Naples. The initial beachhead was to be fifteen miles wide by seven miles deep. The terrain at Anzio consisted of rolling, often wooded farm country on a narrow coastal plain extending north from the town of Terracina to across the Tiber River. The entire region was part of an elaborate reclamation and resettlement project that had been undertaken by Mussolini to showcase Fascist agricultural improvements and was studded with pumping stations and farmhouses and crisscrossed by irrigation ditches and canals.\n\nGeneral Eisenhower formally relinquished command of Allied forces in the Mediterranean to General Sir Henry M. Wilson in early January 1944. Previously, Mediterranean strategy had been driven largely by U.S. Army Chief of Staff George C. Marshall, the leading spokesman in the Combined Chiefs of Staff, who had frequently communicated directly with his American subordinate. When Eisenhower left to prepare for Operation OVERLORD, however, Marshall lost this ability to influence Mediterranean events as planning responsibility passed to Britain's Sir Alan Brooke and the British Chiefs of Staff. General Wilson's largely British command resurrected the Anzio plan with his superior's approval. Heavily influenced by Prime Minister Winston S. Churchill, the British Chiefs of Staff continued to advocate a large Mediterranean effort as part of the \"soft underbelly\" or \"peripheral\" approach to defeating Nazi Germany. To Churchill the quick liberation of Rome offered the key to the success of this strategy and the rapid capture of Rome implicitly required a landing at Anzio. Churchill prevailed upon the Americans in early January 1944 to delay further transfers of amphibious shipping from the Mediterranean to England so that a landing could take place in Italy by the end of the month.\n\nWhen the British conducted a successful amphibious operation at Termoli on 2-3 October, landing behind German positions on the Adriatic front, hopes were raised that a similar, larger assault south of Rome could outflank the Gustav Line. Such an operation could facilitate a breakthrough along the main line of resistance in the south and cut German lines of retreat, supply, and communications. On 8 November British General Sir Harold R. L. G. Alexander, commander of the 15th Army Group (consisting of the Fifth and Eighth Armies under Lt. Gen. Mark W. Clark and General Sir Bernard L. Montgomery, respectively), passed down orders to Clark from the Combined Chiefs of Staff. They directed him to formulate a plan for landing a single division at Anzio (code-named Operation SHINGLE) on 20 December 1943 as part of a projected three-pronged Allied offensive. The subsequent lack of progress, however, and a chronic shortage of troops and shipping due to the ongoing buildup for the cross-Channel invasion of France (OVERLORD), soon made the initial landing date impractical.\n\nThe idea for an amphibious operation near Rome had originated in late October 1943 when it became obvious that the Germans were going to fight for the entire peninsula rather than withdraw to northern Italy. The Allied advance following the Salerno invasion was proving so arduous, due to poor weather, rough terrain, and stiffening resistance, that General Dwight D. Eisenhower pessimistically told the Anglo-American Combined Chiefs of Staff that there would be very hard and bitter fighting before the Allies could hope to reach Rome. As a result, Allied planners were looking for ways to break out of the costly struggle for each ridge and valley, which was consuming enormous numbers of men and scarce supplies.\n\nthe rugged Apennine Mountains overlooking scores of rain-soaked valleys, marshes, and rivers. The terrain favored the defense and, as elsewhere in Italy, was not conducive to armored warfare. Luftwaffe Field Marshal Albert Kesselring, whom Hitler had appointed as commander of all German forces in Italy on 6 November 1943, promised to hold the Gustav Line for at least six months. As long as the line was maintained it prevented the Fifth Army from advancing into the Liri valley, the most logical and direct route to the major Allied objective of Rome. The validity of Kesselring's strategy was demonstrated repeatedly between October 1943 and January 1944 as the Allies launched numerous costly attacks against well-entrenched enemy forces.\n\nFollowing the successful Allied landings at Calabria, Taranto, and Salerno in early September 1943 and the unconditional surrender of Italy that same month, German forces had quickly disarmed their former allies and begun a slow, fighting withdrawal to the north. Defending two hastily prepared, fortified belts stretching from coast to coast, the Germans significantly slowed the Allied advance before settling into the Gustav Line, a third, more formidable and sophisticated defensive belt of interlocking positions on the high ground along the peninsula's narrowest point. The Germans intended to fight for every portion of this line, set in\n\nThe location of the Allied landings, thirty miles south of Rome and fifty-five miles northwest of the main line of resistance running from Minturno on the Tyrrhenian Sea to Ortona on the Adriatic, surprised local German commanders, who had been assured by their superiors that an amphibious assault would not take place during January or February. Thus when the landing occurred the Germans were unprepared to react offensively. Within a week, however, as Allied troops consolidated their positions and prepared to break out of the beachhead, the Germans gathered troops to eliminate what Adolf Hitler called the \"Anzio abscess.\" The next four months would see some of the most savage fighting of World War II.\n\nDuring the early morning hours of 22 January 1944, troops of the Fifth Army swarmed ashore on a fifteen-mile stretch of Italian beach near the prewar resort towns of Anzio and Nettuno. The landings were carried out so flawlessly and German resistance was so light that British and American units gained their first day's objectives by noon, moving three to four miles inland by nightfall. The ease of the landing and the swift advance were noted by one paratrooper of the 504th Parachute Infantry Regiment, 82d Airborne Division, who recalled that D-day at Anzio was sunny and warm, making it very hard to believe that a war was going on and that he was in the middle of it.\n\nThis brochure was prepared in the U.S. Army Center of Military History by Clayton D. Laurie. I hope this absorbing account of that period will enhance your appreciation of American achievements during World War II.\n\nWorld War II was waged on land, on sea, and in the air over several diverse theaters of operation for approximately six years. The following essay is one of a series of campaign studies highlighting those struggles that, with their accompanying suggestions for further reading, are designed to introduce you to one of the Army's significant military feats from that war.\n\nHighly relevant today, World War II has much to teach us, not only about the profession of arms, but also about military preparedness, global strategy, and combined operations in the coalition war against fascism. During the next several years, the U.S. Army will participate in the nation's 50th anniversary commemoration of World War II. The commemoration will include the publication of various materials to help educate Americans about that war. The works produced will provide great opportunities to learn about and renew pride in an Army that fought so magnificently in what has been called \"the mighty endeavor.\"\n\nWorld War II was the largest and most violent armed conflict in the history of mankind. However, the half century that now separates us from that conflict has exacted its toll on our collective knowledge. While World War II continues to absorb the interest of military scholars and historians, as well as its veterans, a generation of Americans has grown to maturity largely unaware of the political, social, and military implications of a war that, more than any other, united us as a people with a common purpose.\n\nMountains along whose southeastern edge ran the Pontine Marshes extending to Terracina. The proposed beachhead was bounded in the north by the Moletta and Incastro Rivers, in the center by open fields leading to the villages of Padiglione and Aprilia along the Anzio-Albano Road, and in the south by the villages of Cisterna and Littoria, a provincial capital, and the Mussolini Canal.\n\nThe operations at Anzio were to be supported by a general 15th Army Group offensive. One week before the Anzio assault, the Fifth Army, consisting of the U.S. II Corps, the British 10 Corps, and the French Expeditionary Corps, would launch a massive offensive on the Gustav Line, cross the Garigliano and Rapido Rivers, strike the German Tenth Army under Lt. Gen. Heinrich van Vietinghoff in the area of Cassino, breach the enemy line there, push up the Liri valley, and link up with the forces at Anzio for the drive on Rome. Meanwhile, Allied, British, and Commonwealth forces of the Eighth Army were ordered to break through on the Adriatic front or at least tie down German forces to prevent their transfer to the Anzio area.\n\nGeneral Clark designated Maj. Gen. John P. Lucas, U.S. Army, commander of the Fifth Army's VI Corps, to lead the invasion and gave him two missions. First, Lucas was to divert enemy strength from the south and, in anticipation of a swift and violent enemy reaction, to prepare defensive positions. The vague second portion of his orders directed him to move toward the Alban Hills and points east for the link-up with the remainder of the Fifth Army on D-day plus 7. In what became a source of continued controversy, neither American interpreted these orders as specifically charging VI Corps with the immediate capture of the Alban Hills. That attitude reflected Clark's and Lucas' skepticism regarding the largely British plan and the feasibility of the overall Anzio operation. Clark in particular had been enthusiastic about the Anzio plan in its early stages, but he became increasingly pessimistic after learning that only two divisions were available for the operation. Both men expected that the assault troops would have to fight their way ashore against fierce resistance. They strongly doubted whether the small force could survive even the initial German counterattacks anticipated on D-day, let alone establish a viable beachhead. The notion that these troops could also take and hold the Alban Hills soon after landing, as implied by the British, seemed overly optimistic. Under the circumstances Clark wanted to remain flexible, and he\n\n6\n\nencouraged Lucas to do the same, leaving the decision about how far and how fast to advance to the VI Corps commander.\n\nBy the time the plans for Operation SHINGLE were finalized on 8 January, with D-day scheduled for 22 January 1944, the landing had evolved from a small, subsidiary attack into a major offensive operation behind enemy lines. For the initial assault Clark selected a combined Anglo-American force then gathering in Naples. Since the Allies wanted to land the largest possible contingent that available amphibious assault shipping allowed, the invasion force consisted of the U.S. 3d Infantry Division; the British 1st Infantry Division and 46th Royal Tank Regiment; the U.S. 751st Tank Battalion, the 504th Parachute Infantry Regiment of the 82d Airborne Division, and the 509th Parachute Infantry Battalion; two British Commando battalions; and three battalions of U.S. Army Rangers. The U.S. 45th Infantry Division and Combat Command A (CCA), a regimental-size unit of the U.S. 1st Armored Division, were directed to land as reinforcements once the beachhead was established.\n\nThe XII Tactical Air Command, the British Desert Air Force, the Coastal Air Force, and the Tactical Bomber Force, units which were supporting Allied operations throughout the entire Mediterranean theater, were directed to conduct major air assaults in support of the Anzio landings. The approximately 2,600 available Allied aircraft were to gain air superiority over the beach, provide close air support for the invading forces, and destroy enemy airfields and hinder communications. The 64th Fighter Wing was charged with protecting the battle area during the actual landings from some 2,000 German aircraft believed to be stationed in Italy and the Balkans.\n\nTo move, protect, and assist the assault forces, the Allies assembled a naval flotilla comprising vessels from six nations. Task Force 81, commanded by U.S. Rear Adm. Frank J. Lowry, contained over 250 combat-loaded vessels and amphibious assault craft of all sizes and descriptions. Admiral Lowry also commanded the 74 vessels of Task Force X-Ray, assigned to see American forces safely ashore and to support their beachhead operations, while Admiral Thomas H. Troubridge, Royal Navy, commanded the 52 ships of Task Force Peter, which was to carry, land, and support the British contingents. To obtain surprise, the Allies decided to dispense with a long preliminary naval bombardment, planning instead on a short and intense ten-minute barrage by two British assault vessels equipped with 1,500 5-inch rockets. As a diversion-\n\n7\n\nary move, other naval units were ordered to shell the coastal town of Civitavecchia, forty miles to the north.\n\nThe Allies launched their offensive in the south on 12 January 1944, with the French Expeditionary Corps assaulting Cassino and the British 10 Corps attempting to exploit previous gains on the Garigliano River. Neither attack succeeded in breaking through the Gustav Line, although limited progress was made. One week later, on 20 January, the U.S. II Corps attacked in the center of the Fifth Army front, attempting to cross the Rapido River. After two days of bitter fighting and heavy losses, the II Corps' 36th Infantry Division was forced to break off its attack. The assault on the Gustav Line, the lynch-pin of the Allied plan of which Anzio was a part, had bogged down. In the meantime, farther south, the elaborate air and sea precautions taken to mask and protect the Anzio landing force were completed. The armada set sail from Naples on 21 January.\n\nThe Anzio invasion began at 0200 on 22 January 1944 and achieved, General Lucas recalled, one of the most complete surprises in history. The Germans had already sent their regional re\n\n8\n\nserves south to counter the Allied attacks on the Garigliano on 18 January, leaving one nine-mile stretch of beach at Anzio defended by a single company. The first Allied waves landed unopposed and moved rapidly inland. On the southern flank of the beachhead the 3d Division quickly seized its initial objectives, brushing aside a few dazed patrols, while unopposed British units achieved equal success in the center and north. Simultaneously, Rangers occupied Anzio, and the 509th Parachute Infantry Battalion seized Nettuno. All VI Corps objectives were taken by noon as the Allied air forces completed 1,200 sorties against targets in and around the beachhead. On the beach itself, the U.S. 36th Engineer Combat Regiment bulldozed exits, laid corduroy roads, cleared mines, and readied the port of Anzio to receive its first landing ship, tank (LST), an amphibious assault and supply ship, by the afternoon of D-day. By midnight over 36,000 men and 3,200 vehicles, 90 percent of the invasion force, were ashore with casualties of 13 killed, 97 wounded, and 44 missing. During D-day Allied troops captured 227 German defenders.\n\nAllied units continued to push inland over the next few days to a depth of seven miles against scattered but increasing German resistance. In the center of the beachhead, on 24 January, the British 1st Division began to move up the Anzio-Albano Road toward Campoleone and, with help from the 179th Infantry Regiment of the 45th Infantry Division, captured the town of Aprilia, known as \"the Factory\" because of its cluster of brick buildings, on 25 January. Within three days the continuing Anglo-American drive pushed the Germans a further 1.5 miles north of the Factory, created a huge bulge in enemy lines, but failed to break out of the beachhead. Probes by the 3d Division toward Cisterna and by the 504th Parachute Infantry Regiment toward Littoria on 24-25 January made some progress but were also halted short of their goals by stubborn resistance. Renewed attacks on the next day brought the Americans within three miles of Cisterna and two miles beyond the west branch of the Mussolini Canal. But the 3d Division commander, Maj. Gen. Lucian K. Truscott, Jr., on orders of the corps commander, called a halt to the offensive, a pause that later lengthened into a general consolidation and reorganization of beachhead forces between 26 and 29 January.\n\nMeanwhile, the Allied troop and materiel buildup had proceeded at a breakneck pace. Despite continuous German artillery and air harassment, a constant fact of life throughout the campaign,\n\n9\n\nthe Allies off-loaded twenty-one cargo ships and landed 6,350 tons of materiel on 29 January alone, and on 1 February the port of Anzio went into full operation. Improving air defenses downed ninety-seven attacking Luftwaffe aircraft prior to 1 February, but the Germans did succeed in sinking one destroyer and a hospital ship, as well as destroying significant stocks of supplies piled on the crowded beaches. Mindful of the need for reinforcements, Lucas ordered ashore the rest of the 45th Infantry Division and remaining portions of the 1st Armored Division allotted to the Anzio operation, raising the total number of Allied soldiers in the beachhead to 61,332..\n\n10\n\nPreloaded supply trucks and DUKWs at Naples.(National Archives)\n\nThe Germans had not been idle during the week after the Anzio landing. The German Armed Forces High Command (OKW) in Berlin was surprised at the location of the landing and the efficiency with which it was carried out. Although they had considered such an attack probable for some time and had made preliminary plans for meeting it, Kesselring and his local commanders were powerless to repel the invasion immediately because of the lack of adequate reserves. Nevertheless, German reaction to the Anzio landing was swift and ultimately would prove far more powerful than anything the Allies had anticipated.\n\nUpon receiving word of the landings, Kesselring immediately dispatched elements of the 4th Parachute and Hermann Goering Divisions south from the Rome area to defend the roads leading north from the Alban Hills. Within the next twenty-four hours Hitler dispatched other units to Italy from Yugoslavia, France, and Germany to reinforce elements of the 3d Panzer Grenadier and 71st Infantry Divisions that were already moving into the Anzio area. By the end of D-day, thousands of German troops were converging on Anzio, despite delays caused by Allied air attacks.\n\n11\n\nMen and equipment move ashore south of Anzio on D-day.(National Archives)\n\nOKW, Kesselring, and Brig. Gen. Siegfried Westphal, Kesselring's chief of staff, were astonished that the Anzio forces had not exploited their unopposed landing with an immediate thrust into the virtually undefended Alban Hills on 23-24 January. As Westphal later recounted, there were no significant German units between Anzio and Rome, and he speculated that an imaginative, bold strike by enterprising forces could easily have penetrated into the interior or sped straight up Highways 6 and 7 to Rome. Instead, Westphal recalled, the enemy forces lost time and hesitated. As the Germans later discovered, General Lucas was neither bold nor imaginative, and he erred repeatedly on the side of caution, to the increasing chagrin of both Alexander and Clark.\n\nBy 24 January Kesselring, confident that he had gathered sufficient forces to contain the beachhead, transferred the Fourteenth Army headquarters under General Eberhard von Mackensen from Verona in northern Italy to Anzio. Mackensen soon controlled elements of 8 divisions, totaling 40,000 troops, with 5 more divisions on the way. Seeking to prevent a permanent Allied foothold at Anzio, Kesselring ordered a counterattack for 28 January, but Mackensen requested and received a postponement until 1 February to await further reinforcements, especially armored units that were being held up by Allied air attacks. Two days before the scheduled offensive, the Fourteenth Army numbered about 70,000\n\n12\n\ncombat troops, most already deployed in forward staging areas, with several thousand more on the way.\n\nRacing against the expected German counterattack, both the Fifth and Eighth Armies prepared to renew their stalled offensives in the south. Lucas meanwhile planned a two-pronged attack for 30 January. While one force cut Highway 7 at Cisterna before moving east into the Alban Hills, a second was to advance northeast up the Albano Road, break through the Campoleone salient, and exploit the gap by moving to the west and southwest. A quick link-up with Fifth Army forces in the south was believed\n\n13\n\nIsola Bella and Cisterna. (National Archives)\n\nstill possible even though German resistance all along the perimeter of the beachhead was becoming stronger.\n\nThe 3d Division and the 1st, 3d, and 4th Ranger Battalions under Col. William O. Darby were responsible for the initial attack on Cisterna. The 1st and 3d Rangers were to spearhead the assault by infiltrating the German lines and seizing and holding Cisterna until the 4th Rangers and 15th Infantry, 3d Division, arrived via the Conca-Cisterna Road. Meanwhile, at 0200, 30 January, the 7th Infantry, 3d Division, was to push on the left to a point above Cisterna and cut Highway 7, while the 15th Infantry passed to the right of Cisterna and cut the highway south of town. As a diversion the 504th Parachute Infantry Regiment would attack along the Mussolini Canal. Unknown to the Americans, their assault was aimed directly at the center of the area where thirty-six enemy battalions were massing for their 1 February counterattack.\n\nThe Rangers moved out at 0130 to the right of the Conca-Cisterna Road and by dawn were within 800 yards of Cisterna. But German soldiers of the 715th Motorized Infantry Division discovered the lightly armed Ranger force during the night and sprang a devastating ambush at first light. Heavy fighting broke out and the Rangers were pinned down quickly by an enemy superior in arms\n\n14\n\nand numbers. Efforts by the 4th Rangers and 15th Infantry to rescue the beleaguered units failed, and by noon armored units of the Hermann Goering Division had forced the Rangers into the open. The Americans had only grenades and bazookas for antitank weapons, and as they attempted a fighting withdrawal in small and scattered groups they were cut down mercilessly. Of the 767 men in the two battalions, only 6 eventually returned to Allied lines.\n\nIn spite of the disaster that befell the Rangers, the 7th and 15th Infantry regiments continued their attacks toward Cisterna, one soldier recalling that the defenders clung stubbornly to their entrenched positions while launching locally heavy counterattacks. Sgt. Truman O. Olson, a light machine gunner with Company B. 7th Infantry, took part in one sixteen-hour assault on entrenched enemy positions in which one-third of his company became casualties. Having seized a toehold, the survivors dug in while Sergeant Olson and his crew took their one available machine gun and placed it forward of the line to bear the brunt of an expected enemy counterattack. Although he had been firing without respite all day, Olson stuck grimly to his post throughout the night while his gun crew was killed, one by one, by accurate and overwhelming enemy fire. Weary from over twenty-four hours of continuous battle and suffering from an arm wound, Olson manned his gun alone, meeting the full force of a 200-man enemy dawn assault supported by mortars and machine guns. After thirty minutes of fighting, Olson was severely wounded, but he refused evacuation. For an hour and a half after receiving a second and subsequently fatal wound, he continued to fire his machine gun, killing at least twenty of the enemy, wounding many more, and ultimately forcing the attackers to withdraw. For his actions Sergeant Olson was posthumously awarded the Medal of Honor.\n\nWhile some progress was made by 3d Division units in the face of noticeably stronger enemy resistance, by nightfall on 31 January the Americans were still one mile from the village, battling stubbornly forward but unable to break through. On the following day fighting was equally inconclusive, and by noon it had become obvious, after three days of costly attacks and counterattacks, that the Americans could not capture Cisterna, still 1,500 yards away. Heeding intelligence reports delivered on 2 February, which indicated the arrival of new German units in the Anzio area and an imminent enemy counterattack, Truscott, on the orders of Clark and Lucas, again told his command to dig in.\n\n15\n\nThe other prong of the Allied attack launched by the British 1st Division and CCA, 1st Armored Division, toward Campoleone and the Alban Hills initially fared little better. Rain-soaked terrain, fierce enemy fire, and ubiquitous minefields slowed CCA's advance, and by nightfall on 30 January the unit was still struggling to reach its line of departure. The British succeeded in advancing two miles the first day, but they also failed to breach the German defenses. General Lucas changed plans for the second day of the attack and ordered the British to breach the enemy line along the Albano Road at Campoleone for exploitation by CCA. During the next two days the Allies reached Campoleone, penetrated the German main line, and opened a two-mile-wide gap. But the exhausted Allied troops were unable to exploit their success, and the drive ground to a halt.\n\nThe failure of the Allied breakout attempt, stymied by stiff resistance, convinced Alexander, Clark, and Lucas that an enemy counterattack must be in the offing. Reinforcements were rushed to Anzio, including 1,800 men of the American-Canadian 1st Special Service Force, elements of the British 56th Division, and additional antiaircraft and artillery units, raising the total number of Allied soldiers in the beachhead to 100,000.\n\nDespite these additions, the Fourteenth Army outnumbered the Allies at Anzio by 4 February. But the German force was a hodgepodge of rapidly thrown together units. All were critically short of ammunition, training, qualified leaders, and reserves. Allied air attacks had disrupted communications, hampered troop and supply movements, and caused morale problems. From the outset Mackensen had doubted the available force could eliminate the Anzio beachhead, but he prepared a forceful counterattack nonetheless. The 4th Parachute and 65th infantry Divisions of the I Parachute Corps were to pinch off the Campoleone salient and recapture the Factory at Aprilia. The same units would then break through to the sea along the Albano Road. Elsewhere the LXXVI Panzer Corps, consisting of the 3d Panzer Grenadier, 715th Motorized Infantry, 71st Infantry, Hermann Goering, and 26th Panzer Divisions would attack south of Cisterna along the Mussolini Canal and attempt to breach the Allied perimeter and advance on Nettuno and Anzio.\n\nThe counterattack opened with an artillery barrage on 3-4 February, followed by armored and infantry assaults which smashed into the partially prepared British 1st Division defenses in\n\n16\n\n\"The Factory.\"(National Archives)\n\nthe Campoleone salient. The British held, despite suffering 1,400 casualties, but their dangerously exposed position prompted Lucas to order their withdrawal to one mile north of the Factory and Carroceto on the night of 4-5 February, a retreat of about 2.5 miles. Although the salient was eliminated, the Germans failed to break the Allied line or retake the Factory. The undulating and soggy Albano Road area was just as inhospitable to German armor and infantry as it had been to Allied forces the week before. However, the critical situation the Germans created in the Allied center convinced Lucas to form a beachhead defense line running from the Moletta River in the north, through the fields of the central sector, to the Mussolini Canal in the south. He issued orders to all Allied troops that this was the final line of resistance to be held at all costs-the shallow beachhead precluded any further retreat.\n\nThe Germans renewed their attacks on 7 February in the weakened British 1st Division sector and, in two days of bitter fighting, pushed the British troops from the Factory and Carroceto. Although battered and exhausted, they managed to maintain a coherent line and were reinforced on 10 February by the 1st Armored Regiment, CCA, 1st Armored Division (itself at 50 percent strength), the 509th Parachute Infantry Battalion, the 504th Parachute Infantry Regiment, and the 179th and 157th regiments of\n\n17\n\nthe U.S. 45th Infantry Division. Ordered to counterattack and retake Aprilia on 11 February, the 179th Infantry and 191st Tank Battalion began a two-pronged attack seeking to outflank the Germans holding the Factory. In two days of costly, hand-to-hand fighting, the Americans failed to retake the lost ground, but inflicted heavy losses on the enemy. Lucas still expected further attacks in the weakened central sector and removed the British 1st Division from the line, replacing it with the British 56th and U.S. 45th Infantry Divisions. As an added precaution, VI Corps artillery was strengthened and Allied tactical air attacks were stepped up.\n\nSpurred by the elimination of the Campoleone salient, the Germans continued their counterattack on 16 February by moving down the Anzio-Albano Road on a four-mile front. The brunt of the assault hit the 45th Division sectors held by the 157th and 179th Infantry regiments. The initial attacks by the 3d Panzer Grenadier and 715th Motorized Infantry Divisions were beaten back with heavy losses, allowing only minor penetrations, while the 180th Infantry rebuffed lighter attacks. Just before midnight, however, enemy persistence paid off. A gap was created between the 179th and 157th Infantry, which was promptly exploited by three German regiments supported by sixty tanks. By dawn the Germans had driven a two-by-one-mile wedge in the center of the 45th Division and were poised to break the Allied line, threatening the entire beachhead. Compounding the already critical situation, the 179th Infantry attempted to withdraw in full view of the enemy the following afternoon and suffered heavy casualties. All through 16-17 February the Allies scrambled to plug the gap with hastily redeployed 90-mm. antiaircraft guns, naval gunfire, and units of the 1st Armored Division. The XII Tactical Air Command flew 730 ground support sorties and later claimed that the total weight of bombs dropped and the number of bombers employed was the greatest ever allotted up to that date in direct support of ground forces.\n\nThe Germans launched a more intense assault against the 45th Division at dawn on 18 February and destroyed one battalion of the 179th Infantry before pushing the remainder of the unit back a half mile farther to Lucas' final defensive line by midmorning. Fearing that the 179th Infantry was in danger of giving way, Lucas ordered Col. William O. Darby to take command of the unit and allow no further retreat. The regiment held, later counting 500 dead Germans in front of its positions. Elsewhere, the 180th and 157th regiments also held their positions in spite of heavy losses\n\n18\n\nduring three days of German attacks. By midday, Allied air and artillery superiority had turned the tide. When the Germans launched a final afternoon assault against the 180th and 179th regiments, it was halted by air strikes and massed mortar, machine gun, artillery, and tank fire. Subsequent enemy attacks on 19 and 20 February were noticeably weaker and were broken up by the same combination of Allied arms before ground contact was made The crisis had passed, and while harassing attacks continued until 22 February, VI Corps went over to the offensive locally and succeeded in retaking some lost ground.\n\n19\n\nThe Germans could ill afford the loss of the 5,389 men killed, wounded, and missing during their five-day counterattack. Enemy troop morale plummeted, and many units lost their offensive capability. The 65th Infantry Division's combat strength had dropped to 673 effectives by 23 February, and one regiment of the 715th Motorized Infantry Division numbered fewer than 185 men. Allied casualties numbered some 3,496 killed, wounded, or missing in addition to 1,637 nonbattle casualties from trench foot, exposure, and combat exhaustion. Allied commanders at Anzio often claimed that losses would have been lower if soldiers were periodically rotated away from the lines, but replacements simply were not available. All 96,401 Allied soldiers were required to hold the 35-mile perimeter against an estimated ten German divisions in the Fourteenth Army, totaling 120,000 men by 12 February.\n\nDespite the fact that their drive to eliminate the Anzio beachhead with an attack down the Albano Road had failed, the Germans resumed the offensive on 29 February. This time their main effort was directed against the U.S. 3d Division holding the Cisterna sector of the Allied beachhead. The LXXVI Panzer Corps, consisting of the 114th Light Infantry, 362d Infantry, 26th Panzer, and Hermann Goering Divisions began a drive to breach the outer beachhead defenses from Carano to Isola Bella, which, if successful, would be exploited by the 29th Panzer Grenadier Division all the way to Nettuno and Anzio. The Americans, however, had anticipated this move. General Truscott, who had replaced Lucas as VI Corps commander on 23 February, had reinforced the line with additional artillery. Further, he made certain that each unit had at least one battalion in reserve with additional reinforcements available at the corps level.\n\nAt midnight, 28 February, German artillery signaled the commencement of the new attack. But VI Corps and 3d Division artillery responded in mass, returning twenty shells for each one fired by the Germans, expending 66,000 rounds on 29 February alone. When the enemy infantry advanced at dawn at a half-dozen points along the 3d Division front, only one attack made any progress, penetrating 800 yards northeast of Carano before being halted with heavy losses. The other attacks fared less well amid a hail of American artillery and mortar fire. Attacking on too broad a front, the Germans lacked the overwhelming strength needed to break through anywhere, and by the end of the day they had barely dented the American line. Over the next several days, the well-en-\n\n20\n\ntrenched Americans, supported by closely coordinated artillery, armor, and air support, shattered subsequent German attacks. Even though the 7th and 15th Infantry regiments and the 509th Parachute Infantry Battalion often were hard pressed and suffered heavy losses between 1 and 4 March at the hands of the 715th and the 16th SS Panzer Grenadier Divisions, all three units held their positions and beat back successive enemy assaults. The Germans continued to seek a breakthrough, but their efforts gradually weakened. Mackensen realized that the Fourteenth Army had spent itself in a costly and futile offensive after a last German assault failed on 4 March.\n\nThe final five-day German counterattack cost 3,500 men killed, wounded, and missing, plus thirty tanks destroyed. It had failed to eliminate the beachhead, and 3d Division counterattacks quickly reclaimed all territory. From then, the Germans went over to the defensive, clearly incapable of mounting any further serious offensive action.\n\nAfter six weeks of continuous bombing, shelling, and fighting, the men of the VI Corps were as exhausted as their German adversaries. Following the collapse of the final enemy drive on 4 March, a three-month lull began. During this time both armies limited their operations to defending the positions they held at the beginning of March, while they conducted limited counterattacks and raids and marked time until the renewal of offensive operations on the southern front. Although the reinforced Fourteenth Army, totaling 135,698 troops by 15 March, considered another offensive, plans were shelved in early April in favor of conserving troop strength to counter an expected Allied spring offensive.\n\nThe VI Corps spent this time reorganizing and regrouping as well. The British 56th Division was relieved by the British 5th Division while Commando, Ranger, and parachute units were sent to England to begin preparations for OVERLORD. The U.S. 34th Infantry Division took up positions before Cisterna on 28 March, replacing the 3d Division, which had seen sixty-seven days of continuous front-line action and now reverted to corps reserve. Over 14,000 replacements arrived to fill other depleted Allied units, bringing VI Corps to its full combat strength of 90,000 men in six divisions. In preparation for its role in the spring offensive, VI Corps received Combat Command B (CCB) of the U.S. 1st Armored Division, giving the beachhead forces a complete armored division.\n\n21\n\nOn 22 May the entire U.S. 36th Infantry Division landed, bringing the total number of Allied troops at Anzio to seven full divisions.\n\nDuring March, all of April, and the first part of May 1944, recalled one veteran, the Anzio beachhead resembled the Western Front during World War I. The vast majority of Allied casualties during this period were from air and artillery attacks, including fire from \"Anzio Annie,\" a 280-mm. German railway gun which fired from the Alban Hills. During March, shrapnel caused 83 percent of all 3d Division casualties, and other units experienced similar rates. The Anzio beachhead became a honeycomb of wet and muddy trenches, foxholes, and dugouts. Yet the Allied troops made the best of a bad situation, and one soldier recalled that during these months the fighting was light and living was leisurely.\n\nSupply problems at Anzio, originally one of the main concerns of Allied planners, never reached a crisis stage. Beginning on 28 January, six LSTs left Naples daily for Anzio, each carrying 1,500 tons of cargo distributed among fifty combat-loaded trucks. Driving off the ships at Anzio, the trucks moved directly to front-line positions with ammunition, fuel, and rations and were replaced on the LSTs by the fifty empty trucks that had made the voyage the previous day. In addition to LSTs, fifteen smaller vessels arrived each week, and every ten days four massive Liberty ships delivered heavier equipment. Between 22 January and 1 June over 531,511 long tons of supplies were unloaded at Anzio, a daily average of 3,920 tons.\n\nOn the night of 11-12 May, the Fifth and Eighth Armies launched their long-awaited spring offensive against the Gustav Line. Stymied in attempts to break through at Cassino in February, March, and April, the Allies initially encountered little success in their new drive. Nonetheless, the Germans abandoned Monte Cassino after a week of heavy fighting by Polish forces, and the French Expeditionary Corps and U.S. II Corps succeeded in breaking the Gustav Line by 15 May. The II Corps continued its drive north toward Terracina, which fell on 23-24 May, and raced toward the Anzio beachhead against rapidly crumbling German resistance as enemy troops began withdrawing northeast toward Rome.\n\nOn 5 May General Clark gave General Truscott orders for a new Allied offensive code-named BUFFALO. The VI Corps was to break out of the beachhead on the Cisterna front at Cori, at the base of the Lepini Mountains, and at Velletri near the base of the Alban Hills. Once the breakout occurred, the Anzio units were to\n\n23\n\nPatrol moving through Cisterna.(National Archives)\n\ndrive east through the Velletri Gap to Valmontone, cut Highway 6, the main German route of retreat, and trap the bulk of the enemy forces withdrawing north through the Liri valley. The basic operational concept had been dictated to Clark by Alexander, who was acting on Churchill's desire to destroy the entire Tenth Army south of Rome at Valmontone. Clark, however, had little faith in the feasibility of the plan. Furthermore, he believed that most of the recognition for Allied gains thus far obtained in Italy had been attributed unjustly to British forces, and he wanted the Fifth Army to have the singular honor of liberating Rome. He therefore informed Truscott that the VI Corps was to be prepared at any moment during the breakout to swing north for a rapid advance on the Italian capital, especially if stiff enemy resistance was encountered on the route to Valmontone or if the British advance up the Liri valley was slower than planned.\n\nThe U.S. 1st Armored Division was to make the initial assault out of the beachhead, supported by the 3d Division and 1st Special Service Force. The 45th Division was to move beyond Carano on the left as far as the Campoleone-Cisterna railroad, while the 36th Infantry Division exploited the expected breakthrough.\n\n24\n\nAt 0545, 23 May, a 45-minute Allied artillery barrage opened on the Cisterna front, followed by armor and infantry attacks along the entire line from Carano to the Mussolini Canal. Although resistance was very stiff, by evening the 1st Special Service Force and 1st Armored Division had breached the enemy main line of resistance, while the XII Tactical Air Command completed the last of 722 sorties. The following day VI Corps forces cut Highway 7 above Cisterna and encircled the town, the scene of continued heavy fighting by desperate enemy forces. The town finally fell on 25 May at the cost of 476 Americans killed, 2,321 wounded, and 75 missing.\n\nEarlier on 25 May, at 0730, troops of the 91st Reconnaissance Squadron, 85th Infantry Division, U.S. II Corps, racing north from Terracina across the Pontine Marshes, met soldiers of the 1st Battalion, 36th Engineer Combat Regiment, from the Anzio beachhead, effecting the long-planned and longer-awaited link-up between Fifth Army forces. With the physical juncture of the II and VI Corps, the beachhead ceased to exist and the formerly isolated soldiers became the left flank of the Fifth Army. Clark personally greeted the II Corps troops three hours later.\n\nMeanwhile, the breakout west was proving costly to the VI Corps. The 1st Armored Division lost 100 armored vehicles in the first day alone, while the entire corps took over 4,000 casualties in the first five days of the offensive. Allied troops, however, counted 4,838 enemy prisoners, including 1,000 in Cisterna, and destroyed or damaged 2,700 enemy vehicles.\n\nOn the same day that the Fifth Army front merged with the Anzio beachhead, General Clark also split Truscott's forces into two parts, sending the 3d Division, the 1st Special Service Force, and elements of the 1st Armored Division toward Valmontone. This thrust, however, proved insufficient, and most of the Tenth Army escaped north to fight again. In the meantime the 45th and 34th Infantry Divisions, along with the rest of the Fifth Army, joined in the hot pursuit of German forces falling back on Rome, a scarce thirty miles distant. Americans liberated the Italian capital on 4 June 1944.\n\nAnalysis\n\nDuring the four months of the Anzio Campaign the Allied VI Corps suffered over 29,200 combat casualties (4,400 killed, 18,000 wounded, 6,800 prisoners or missing) and 37,000 noncombat casualties. Two-thirds of these losses, amounting to 17 percent of VI Corps\n\n25\n\n\"Anzio Harbor Under German Bombardment\" by Edward A. Reep.(Army Art Collection)\n\neffective strength, were inflicted between the initial landings and the end of the German counteroffensive on 4 March. Of the combat casualties, 16,200 were Americans (2,800 killed, 11,000 wounded, 2,400 prisoners or missing) as were 26,000 of the Allied noncombat casualties. German combat losses, suffered wholly by the Fourteenth Army, were estimated at 27,500 (5,500 killed, 17,500 wounded, and 4,500 prisoners or missing)-figures very similar to Allied losses.\n\nThe Anzio Campaign continues to be controversial, just as it was during its planning and implementation stages. The operation clearly failed in its immediate objectives of outflanking the Gustav Line, restoring mobility to the Italian campaign, and speeding the capture of Rome. Allied forces were quickly pinned down and contained within a small beachhead, and they were effectively rendered incapable of conducting any sort of major offensive action for four months pending the advance of Fifth Army forces to the south. Anzio failed to be the panacea the Allies sought. As General Lucas repeatedly stated before the landing, which he always considered a gamble, the paltry allotments of men and supplies were not commensurate with the high goals sought by British planners. He steadfastly maintained that under the circumstances the small Anzio\n\n26\n\nforce accomplished all that could have been realistically expected. Lucas' critics charge, however, that a more aggressive and imaginative commander, such as a Patton or Truscott, could have obtained the desired goals by an immediate, bold offensive from the beachhead. Lucas was overly cautious, spent valuable time digging in, and allowed the Germans to prepare countermeasures to ensure that an operation conceived as a daring Allied offensive behind enemy lines became a long, costly campaign of attrition.\n\nYet the campaign did accomplish several goals. The presence of a significant Allied force behind the German main line of resistance, uncomfortably close to Rome, represented a constant threat. The Germans could not ignore Anzio and were forced into a response, thereby surrendering the initiative in Italy to the Allies. The 135,000 troops of the Fourteenth Army surrounding Anzio could not be moved elsewhere, nor could they be used to make the already formidable Gustav Line virtually impregnable. The Anzio beachhead thus guaranteed that the already steady drain of scarce German troop reserves, equipment, and materiel would continue unabated, ultimately enabling the 15th Army Group to break through in the south. But the success was costly.\n\n27\n\nFurther Readings\n\nFor additional reading see William L. Allen, Anzio: Edge of Disaster (1978); Fred Sheehan, Anzio: Epic of Bravery (1964); and Martin Blumenson, Anzio: The Gamble That Failed (1963). For a British perspective, see Wynford Vaughan-Thomas, Anzio (1961). The official U.S. Army histories, which include Martin Blumenson, Salerno to Cassino (1969); Ernest F. Fisher, Jr., Cassino to the Alps (1977); and the War Department Historical Division, Anzio Beachhead, 22 January-25 May 1944 (1948), remain the most comprehensive histories available on the overall operational and tactical aspects of the Anzio Campaign.\n\nCMH Pub 72-19\n\nCover: Men come ashore from LCIs at Anzio on D-day.(National Archives)"}, {"url": "https://www.moma.org/artists/26130", "page_content": "If you would like to reproduce an image of a work of art in MoMA’s collection, or an image of a MoMA publication or archival material (including installation views, checklists, and press releases), please contact Art Resource (publication in North America) or Scala Archives (publication in all other geographic locations).\n\nMoMA licenses archival audio and select out of copyright film clips from our film collection. At this time, MoMA produced video cannot be licensed by MoMA/Scala. All requests to license archival audio or out of copyright film clips should be addressed to Scala Archives at [email protected]. Motion picture film stills cannot be licensed by MoMA/Scala. For access to motion picture film stills for research purposes, please contact the Film Study Center at [email protected]. For more information about film loans and our Circulating Film and Video Library, please visit https://www.moma.org/research/circulating-film.\n\nIf you would like to reproduce text from a MoMA publication, please email [email protected]. If you would like to publish text from MoMA’s archival materials, please fill out this permission form and send to [email protected]."}, {"url": "https://www.axishistory.com/axis-nations/119-germany-waffen-ss/germany-waffen-ss-divisions/1265-5-ss-panzer-division-wiking", "page_content": "5. SS-Panzer-Division Wiking\n\nDetails Published: 17 December 2010 17 December 2010 Last Updated: 18 October 2014 18 October 2014\n\nThe 5. SS-Panzer-Division Wiking was formed in December 1940 around the Germania regiment from the SS-Division Verfügungstruppe (later renamed Das Reich).\n\nIt took part in the invasion of the USSR attached to Heeresgruppe Süd and during the advance took part in several encirclements of Soviet troops before reaching Rostov November 1941. During the winter it was pressed back by the Soviet advances. In the spring it once again went on the offensive, this time towards the Caucasus. It was however soon forced to retreat to avoid being cut off. It was held in reserve during the battle at Kursk 1943 and following that failure it retreated and was trapped in the Cherkassy pocket. It managed to break out of that pocket but lost all it's tanks and suffered heavy losses in the process.\n\nIt withdrew to Cholm to be reform, with the exception of a Kampfgruppe that remained at the front, and was sent to Poland July 1944 where it fought at the Vistula and took part in the crushing of the Warsaw Uprising. It was sent to Hungary in December 1944 where it took part in the failed attempt to relieve Budapest. It withdrew through Hungary and Czechoslovakia before surrendering in Austria.\n\n\n\nThe Wiking divison is often listed as only fighting on the Eastern Front against the Soviet Red Army but that is not correct. The SS-Kampfgruppe Wiking (in some sources listed as Kampfgruppe Nicolussi-Leck) led by SS-Hauptsturmführer Karl Nicolussi-Leck was sent to Germany in April 1945 to pick up new tanks at Paderborn with about 150 men. After skirmishing with both US and British forces they were forced to change their plans and search for vehicles elsewhere. On the 6th they located 13 Schützenpanzerwagen (SdKfz. 250 and 251) in a Heer vehicle depot near Bückeburg and two days later they located seven Jagdpanthers at the M.N.H assembly facility at Hannover-Laatzen. They would use these vehicles successfully in fighting the US 84th Infantry Division under the command of Major General Alexander Bolling until the 16th when Nicolussi-Leck was forced to surrender.\n\n\n\nHerbert Otto Gille famously threatened Weltanschauungsoffizier (political indoctrination officer) Ernst Fick in January 1942 with a disrobing detail to remove his Brownshirt saying the wear of such clothing is frowned upon within the SS-Panzer Artillerie Regiment 5. (12)\n\n\n\nSee also SS-Division Wiking at Rostov July 1942 and Operations of Encircled Forces: German Experiences in Russia.\n\n\n\n\n\nKnown war crimes\n\nThis division was for a long time regarded as one of the few larger Waffen-SS units not involved in war-crimes however research made public in recent years have shown this to be incorrect.\n\n\n\nSoldiers from the division took part in the murder of hundreds of Jews in the castle at Zloczow (Zolochiv) during the first days of July 1941 together with Ukrainian militia. The massacre was put to an end by soldiers from 295. Infanterie-Division at the order of Oberstleutnant Helmuth Groscurth. (7)\n\n\n\nOn 9 July 1941 soldiers from the division took part in the massacre of Jews in Lviv in revenge of the death of Hilmar Wäckerle, commander of SS-Infanterie-Regiment Westland. (9)\n\n\n\nIn Zhitomir soldiers from the division took part in the rounding up and killing of commissars and officials July 1941. (6)\n\n\n\nEinsatzkommando 11 of Einsatzgruppe D and a mobile gassing van was travelling together with the division in 1942 murdering people seen as undesirable. (3)\n\n\n\nSonderkommando Jankuhn led by Dr Herbert Jankuhn of the SS-Ahnenerbe was attached to Wiking and the division supported them in their plunder of artifacts from the Black Sea area in 1942. (4)\n\n\n\nGeneral der Gebirgstruppen Karl Eglseer, commander of 4. Gebirgs-Division, complained about indiscipline and widespread looting by soldiers from Wiking in April 1942 when the divisions served near each other in the River Mius area. The Slovakian Generals Gustav Malár and Jozef Turanec, commanders of Slovak Mobile Division that served next to Wiking during this period, also raised the same criticism. (5)\n\nThe Finnish volunteers distributed among the units of the Wiking divisions instead of serving in the Finnisches Freiwilligen-Bataillon der Waffen-SS wrote in letters home and in their diaries about how the Soviet POWs and civilians were treated badly or even killed by soldiers from the division during the early phase of the war on the Eastern Front. (8)\n\n\n\nSoldiers from the Wiking division were involved in the killing of Hungarian Jews in March/Aril 1945. (10) On 17 November 2009 Adolf Storms was charged with the murder of 58 Hungarian Jewish forced labourers near Deutsch Schuetzen in Austria on 29 March 1945 but he died before he could be brought to trial. (11)\n\n\n\nDivisional commander SS-Brigadeführer Felix Steiner stated about the infamous Commissar Order (that Soviet political commissars captured should be shot immediately) that \"No rational unit commander could comply with such an Order\" (2) in a discussion with his superior General der Infanterie Gustav von Wietersheim on 4 July 1941 who shared his dislike of the order.\n\n\n\n\n\nLineage\n\nSS-Division (mot) Germania (Nov 1940 - Jan 1941)\n\nSS-Division (mot) Wiking (Jan 1941 - Nov 1942)\n\nSS-Panzergrenadier-Division Wiking (Nov 1942 - Oct 1943)\n\n5. SS-Panzer-Division Wiking (Oct 1943 - May 1945)\n\n\n\n\n\nCommanders\n\nSS-Obergruppenführer Felix Steiner (1 Dec 1940 - 1 May 1943)\n\nSS-Obergruppenführer Herbert Gille (1 May 1943 - 20 July 1944)\n\nSS-Standartenführer Johannes Mühlenkamp (20 July 1944 - 9 Oct 1944) (1)\n\nSS-Oberführer Karl Ullrich (9 Oct 1944 - 5 May 1945)\n\n\n\n\n\nChief of Staff\n\nSS-Sturmbannführer Günther Ecke (? Mar 1941 - 7 Sep 1941)\n\nSS-Haupsturmführer Erwin H. Reichel (? Sep 1941 - ? 1942)\n\nSS-Sturmbannführer Manfred Schönfelder (? 1942 - 1 July 1944)\n\nSS-Sturmbannführer Richard Pauly (1 Aug 1944 - ? Aug 1944)\n\nMajor Kleine (? Aug 1944 - ?)\n\nMajor Braun (? 1945 - ? 1945)\n\nSS-Sturmbannführer Willi Klose (? 1945 - ? 1945)\n\n\n\n\n\nQuartermaster\n\nSS-Hauptsturmführer Erwin H. Reichel (? Mar 1941 - ? Sep 1941)\n\nSS-Hauptsturmführer Hans Sporn (? 1941 - ? 1941)\n\nSS-Hauptsturmführer Kille (? 1941 - ? 1941)\n\nSS-Hauptsturmführer Wilhelm Büthe (? 1941 - ? 1942)\n\nSS-Sturmbannführer Manfred Schönfelder (? 1942 - ? 1942)\n\nSS-Hauptsturmführer Wilhelm Büthe (? 1942 - ? 1943)\n\nSS-Sturmbannführer Hans Scharff (? 1943 - ? 1944)\n\nSS-Obersturmführer Manfred Schönfelder (1 July 1944 - ? July 1944)\n\nSS-Obersturmführer Dr. Heinz Fischer (1 Aug 1944 - 1 Mar 1945)\n\nSS-Sturmbannführer Franz Meyer (? Mar 1945 - ? May 1945)\n\n\n\n\n\nArea of operations\n\nGermany (Dec 1940 - June 1941)\n\nEastern front, southern sector (June 1941 - Apr 1944)\n\nPoland (Apr 1944 - Jan 1945)\n\nHungary (Jan 1945 - Apr 1945)\n\nAustria (Apr 1945 - May 1945)\n\n\n\n\n\nManpower strength\n\nJune 1941 19.377\n\nDec 1942 15.928\n\nDec 1943 14.647\n\nJune 1944 17.368\n\nDec 1944 14.800\n\n\n\nNon-Germans in the Wiking-division, 22 June 1941\n\n- 216 Danes\n\n- 631 Dutch\n\n- 421 Finns (Finnisches Freiwilligen-Bataillon der Waffen-SS)\n\n- 294 Norwegians\n\n- 1 Swede\n\n- 1 Swiss\n\nThis was out of a total of 19.377 men.\n\n\n\nNon-Germans in the Wiking-division, 19 September 1941\n\n- 251 Danes\n\n- 821 Dutch\n\n- 291 Norwegians\n\n- 45 Flemish\n\n- 8 Swedes\n\n\n\n\n\nHonor titles\n\nThe Vikings - in German Wikinger – were of course the dwellers of Scandinavia, who traveled around Europe’s shores from the 8th to the 11th century as pirates, merchants and founders of states.\n\n\n\n\n\nThe term \"Wiking\" was also used by the Waffen-SS volunteer movement post-war, the magazine Wiking-Ruf was published by HIAG (Hilfsgemeinschaft auf Gegenseitigkeit der Angehörigen der ehemaligen Waffen-SS, Mutual Help Association of Former Waffen-SS Members) 1951-1958, the logo of the magazine can be seen above, note the Waffen-SS unit symbols displayed on the shields.\n\n\n\nTwo of the division’s regiments were also named:\n\nSS-Pz. Gren. Regt. 9 „Germania“\n\n“Germania” is Latin for the German word Germanien, the land north of the Danube and east of the Rhine up to the Vistula that was occupied by the Germanen, the ancient Germans. Germanien or, respectively Germania, was also used in the Middle Ages as Germany’s name. Furthermore, it is the name of the symbolic personification of Germanien in female form dating back to ancient Roman times, which became a symbol for the unified German Empire in 1871.\n\nSS-Pz. Gren. Regt. 10 „Westland“\n\nAn honor title with a purely geographical meaning, the regiment’s name translates as “Western Land” and was chosen as this regiment was composed of Dutchmen and Flemings, while the division’s Scandinavians formed regiment “Nordland” (= “Northern Land”, see 11. SS division.)\n\n\n\n\n\nHolders of high awards\n\nHolders of the Close Combat Clasp in Gold (20)\n\nHolders of the Commendation Certificate of the Commander-in-Chief of the Army (4)\n\n- Bühler, Karl-Heinz, 25.12.1944 (4961), SS-Sturmbannführer, Kdr. II./SS-Pz.Art.Rgt. 5\n\n- Bünning, Hans, 25.12.1944 (4962), SS-Obersturmbannführer, Rgts.Fhr. SS-Pz.Art.Rgt. 5\n\n- Holemar, Karl, 05.09.1942 (1199), SS-Sturmmann, 8./SS-Schtz.Rgt. “Westland”\n\n- Zäh, Fritz, 25.12.1944 (4963), SS-Hauptsturmführer, Battr.Chef 5./SS-Pz.Art.Rgt. 5\n\nHolders of the German Cross in Gold (180)\n\nHolders of the German Cross in Silver (3)\n\n- Muster, Dr. Siegfried, 10.02.1945, SS-Sturmbannführer, Abt.Arzt IV./SS-Pz.Art.Rgt. 5\n\n- Schopper, Dr. Hubert, 10.02.1945, SS-Hauptsturmführer, Truppenarzt I./SS-Pz.Art.Rgt. 5\n\n- Weise, Erich, 00.03.1945, SS-Obersturmführer d.R., TFK I im SS-Pz.Rgt. 5\n\nHolders of the Honor Roll Clasp of the Heer (17)\n\nHolders of the Knight's Cross (67, including four unofficial/unconfirmed)\n\nHolders of the Knight’s Cross of the War Merit Cross with Swords (1)\n\n- Weise, Erich, 16.11.1943, SS-Untersturmführer d.R., Werkmeister im SS-Pz.Rgt. 5\n\nHolders of the Finnish Order of the Cross of Liberty, 1st Class with Swords (2)\n\n- Steiner, Felix, 16.06.1942, SS-Gruppenführer u. Generalleutnant d. W-SS, Kdr. SS-Div. “Wiking”\n\n- Gille, Herbert Otto, 06.03.1943, SS-Brigadeführer u. Generalmajor d. W-SS, Kdr. SS-Pz.Gren.Div. “Wiking”\n\n\n\n\n\nOrder of battle (Dec 1940)\n\nStab\n\nSS-Regiment Germania\n\nSS-Regiment Nordland\n\nSS-Regiment Westland\n\nSS-Artillerie-Regiment 5\n\nSS-Nachrichten-Abteilung 5\n\nSS-Pionier-Bataillon 5\n\nSS-Panzerjäger-Abteilung 5\n\nSS-Aufklärungs-Abteilung 5\n\n1. und 2. Sanitärs-Kompanie\n\n1-3 Werkstatt-Kompanie\n\n\n\n\n\nOrder of battle (26 May 1941)\n\nStab\n\nSS-Infanterie-Regiment Germania\n\nSS-Infanterie-Regiment Nordland\n\nSS-Infanterie-Regiment Westland\n\nSS-Artillerie-Regiment 5\n\nSS-Artillerie-Meßbatterie\n\nSS-Nachrichten-Abteilung 5\n\nSS-Pionier-Bataillon 5\n\nSS-Panzerjäger-Abteilung 5\n\nSS-Aufklärungs-Abteilung 5\n\nSS-Fla-M.G.-Bataillon\n\nNachschub-Dienste\n\nSanitäts-Dienste\n\nOrdnungsdienste\n\n\n\n\n\nOrder of battle\n\nSS-Panzergrenadier Regiment 9 Germania\n\nSS-Panzergrenadier Regiment 10 Westland\n\nSS-Panzer Regiment 5\n\nSS-Panzer Artillerie Regiment 5\n\nFinnisches Freiwilligen-Bataillon der Waffen-SS (until 1943)\n\nEstnisches SS-Freiwilligen-Panzer-Grenadier-Bataillon Narwa (1943-1944)\n\nSS-Panzerjäger-Abteilung 5\n\nSS-Sturmgeschütz-Abteilung 5\n\nSS-Sturmgeschütz-Batterie 5\n\nSS-Flak-Abteilung 5\n\nSS-Werfer-Abteilung 5\n\nSS-Panzer-Nachrichten-Abteilung 5\n\nSS-Panzer-Aufklärungs-Abteilung 5\n\nSS-Panzer-Pionier-Bataillon 5\n\nSS-Dina 5\n\nSS-Instandsetzungs-Abteilung 5\n\nSS-Wirtschafts-Bataillon 5\n\nSS-Sanitäts-Abteilung 5\n\nSS-Feldlazarett 5\n\nSS-Kriegsberichter-Zug 5\n\nSS-Feldgendarmerie-Trupp 5\n\nSS-Feldersatz-Bataillon 5\n\n\n\n\n\nNotable members\n\nAlfred-Ingemar Berndt (SS-Brigadeführer and Ministerialdirektor, Deputy Reichs Press Chief, served with Rommel in Africa, KIA 21 Mar 1945 in Hungary)\n\nGösta Borg (Active in the German radio-propaganda aimed at Sweden, the Köningsbergsradion, 1945, post-war wrote the book \"Det röda massanfallet\" about his experiences in the Waffen-SS)\n\nFritz Darges (Adjutant to Adolf Hitler 1943-1944 and to Martin Bormann 1936-1939)\n\nSS-Untersturmführer Kurt Eggers (poet and war correspondent, he was killed while attached to Wiking, the unit SS-Standarte Kurt Eggers was named for him after his death in 1943)\n\nJohannes Hendrik \"Henk\" Feldmeijer (Voorman, leader, of the Germaansche-SS in Nederland, the Dutch SS)\n\nOtto Förschner (commandant of Dora-Mittelbau)\n\nKurt Gerstein (After being attached to the division March-May 1941 he was transferred and ended up as Head of Technical Disinfection Services and witnesses gassing in Belez and reported about the Holocaust to Swedish diplomat Göran von Otter and members of the Catholic Church in 1942, post-war he wrote the famous Gerstein Report)\n\nBruno Gesche (Commander of the SS-Begleitkommando des Führers, Hitlers bodyguard unit, served with in the RFSS division in 1945 after he was removed from his command)\n\nHerbert Otto Gille (Holder of the Knight's Cross with Oak Leaves, Swords and Diamonds)\n\nPer Imerslund (Norwegian writer, prominent in the pre-war Nazi groups in Norway, fought with the fascist Falange in the Spanish Civil War)\n\nDr Herbert Jankuhn (famous archeologist and member of SS-Ahnenerbe served on the division staff 1943-1945)\n\nFredrik Jensen (the only Norwegian recipient of the German Cross in Gold)\n\nChristian Peder Kryssing (Danish officer who reached the highest Waffen-SS rank of any non-German, SS-Brigadeführer)\n\nNiels Kryssing (son of Christian Peder Kryssing, the highest ranking non-German in the Waffen-SS, KIA 1943)\n\nHans Lindén (Swedish volunteers KIA 30 December 1941 while serving with SS-Flak-Abteilung 5. The section for Waffen-SS volunteers \"Kampavdelning Hans Lindén\" set up by Sveaborg, part of the largest Swedish Nazi party Svensk Socialistisk Samling (SSS) was named in his honour)\n\nJoseph Mengele (the infamous camp doctor served in the Pionier Battalion, where he also was awarded the Iron Cross, during his time in the Waffen-SS)\n\nOla Olin (the only Finnish recipient of the German Cross in Gold to recieve it during the time Finland was at war with Germany)\n\nArtur Phleps (Later SS-Obergruppenführer and commander of V. SS-Freiwilligen-Gebirgskorps)\n\nOlof Sandström (Active in the German radio-propaganda aimed at Sweden, the Köningsbergsradion, 1943-1944)\n\nChristian Frederick von Schalburg (Landsungdomsfører, youth leader, of Danmarks Nationalsocialistiske Arbejderparti (DNSAP), the Danish Nazi Party, KIA 1 March 1942 as commander of Freikorps Danmark. The Schalburg Cross was created and the Danish SS was named the Schalburgkorpset in his honour)\n\nAnton Streitwieser (commandant of Melk, a sub-camp of Mauthausen 1944-1945)\n\nLauri Törni (\"Larry Thorne\", fought under three flags: Finnish during the Winter War and Continuation War, German in 1941 and again after the Finnish peace with the USSR and finally US as a member of the U.S. Army Special Forces in the Vietnam War)\n\nHilmar Wäckerle (first SS commandant of Dachau, KIA as commander of the regiment Westland 2 July 1941)\n\n\n\n\n\nOfficers serving in the Einsatzgruppen and Concentration Camps\n\nConcentration Camps 45\n\n(includes officers serving in the Einsatzgruppen or Concentration Camps either prior to or after service in this unit)\n\n\n\n\n\nInsignia\n\nThe tactical marking of the division was a \"Sonnenrad\", a sun wheel swastika.\n\n\n\nThe \"Wiking\" cuff title was authorized for this unit on 1 September 1942.\n\n\n\n(Courtesy of Relics of the Reich)\n\n\n\nThe \"Germania\" cuff title was authorized for SS-Panzergrenadier Regiment 9 Germania from September 1936. They also wore a \"G\" on their shoulder boards.\n\nThe \"Nordland\" cuff title was authorized for SS-Grenadier Regiment Nordland. They also wore a \"N\" on their shoulder boards.\n\nThe \"Westland\" cuff title was authorized for SS-Panzergrenadier Regiment 10 Westland. They also wore a \"W\" on their shoulder boards.\n\n\n\n\n\nPropaganda\n\nAn example of the propaganda produced about the division: \"Aufbruch: Briefe von Germanischen Freiwilligen Der SS-Division Wiking\" (1943)\n\n\n\n\n\nIn fiction\n\nThe 1977 Dutch movie \"Soldaat van Oranje\" (\"Soldier of Orange\") directed by Paul Verhoeven features soldiers from this unit.\n\n\n\nThe 2002 Russian movie \"Zvezda\" (\"The Star\") directed by Nikolai Lebedev features soldiers from the Wiking division.\n\n\n\nA Swedish volunteers in the Wiking division is the main character in the Swedish vampire movie \"Frostbiten\" (\"Frostbite\"), directed by Anders Banke, from 2006.\n\n\n\nReconnaissance soldiers from the Wiking division on the Eastern Front in 1942\n\n\n\n(Courtesy of Hjalmar)\n\n\n\nPanthers being delivered by train to the Wiking division (sometimes incorrectly identified as belonging to the Nordland division)\n\n\n\n(Courtesy of Hjalmar)\n\n\n\nAn office of the Danish Nazi party Danmarks Nationalsocialistiske Arbejderparti (DNSAP) being used as a recruitment center for Regiment Nordland\n\n\n\n(Courtesy of Die Deutsche Wochenschau/Ivan)\n\n\n\nA SdKfz 251 from the Wiking division captured and used by the Polish forces with the nickname \"Szary Wilk\" during the Warsaw Uprising\n\n\n\n(Courtesy of Peter)\n\n\n\nPanzer III of the Wiking division in June 1942\n\n\n\n(Courtesy of Bundesarchiv/Wikimedia, licensed under Creative Commons Attribution ShareAlike 3.0 Germany)\n\n\n\nHeinrich Himmler visiting the Wiking division in 1942\n\n\n\n(Courtesy of Bundesarchiv/Wikimedia, licensed under Creative Commons Attribution ShareAlike 3.0 Germany)\n\n\n\nFleeing civilians passing a Marder II during the crushing of the Warsaw Uprsing in 1944\n\n\n\n(Courtesy of Bundesarchiv/Wikimedia, licensed under Creative Commons Attribution ShareAlike 3.0 Germany)\n\nA panther of II./SS-Panzer Regiment 5 in January 1944\n\n\n\n(Courtesy of Bundesarchiv/Wikimedia, licensed under Creative Commons Attribution ShareAlike 3 0 Germany)\n\nFootnotes\n\n1. SS-Oberführer Dr. jur. Eduard Deisenhofer was ordered to take command of Wiking from 20 July to 11 August 1944 but never took the command, instead SS-Standartenführer Johannes Mühlenkamp served as first temporary and then permanent commander.\n\n2. Quote from \"Panttipataljoona\" by Mauno Jokipii, page 115-116.\n\n3. \"The Master Plan: Himmler’s Scholars & The Holocaust\" by Heather Pringle.\n\n4. \"The Master Plan: Himmler’s Scholars & The Holocaust\" by Heather Pringle and \"Murderous Elite: The Waffen-SS and its complete record of war crimes\" by James Pontolillo, page 68.\n\n5. \"Axis Slovakia: Hitler's Slavic Wedge 1938-1945\" by Mark W.A. Axworthy.\n\n6. \"SS-Wiking: The History of the Fifth SS Division 1941 - 1945\" by Rupert Butler, \"Valhalla's Warriors: A history of the Waffen-SS on the Eastern Front 1941-1945\" by Terry Goldsworthy.\n\n7. \"SS-Wiking: The History of the Fifth SS Division 1941 - 1945\" by Rupert Butler, \"The Origins of the Final Solution\" by Christopher R. Browning, \"Valhalla's Warriors: A history of the Waffen-SS on the Eastern Front 1941-1945\" by Terry Goldsworthy, \"Zloczow, Juli 1941: Die Wehrmacht und der Beginn des Holocaust in Galizien\" by Bernd Boll.\n\n8. \"Panttipataljoona\" by Mauno Jokipii.\n\n9. \"Masters of Death: The SS Einsatzgruppen and the Invention of the Holocaust\" by Richard Rhodes, \"The SS: Alibi of a Nation 1922-45\" by Gerald Reitlinger.\n\n10. \"The Death Marches of Hungarian Jews Through Austria in the Spring of 1945\" by Eleonore Lappin and \"Murderous Elite: The Waffen-SS and its complete record of war crimes\" by James Pontolillo, page 56.\n\n11. 'Ex-Nazi' charged with 58 murders, BBC News 17 November 2009 - http://news.bbc.co.uk/2/hi/europe/8364447.stm, 90-year-old charged in Germany for Nazi-era crimes, Washington Post 17 November 2009 - http://www.washingtonpost.com/wp-dyn/content/article/2009/11/17/AR2009111700539.html, Nazi war crimes suspect Adolf Storms dies before trial, BBC News 6 July 2010 - http://news.bbc.co.uk/2/hi/world/europe/10530176.stm.\n\n12. \"Die Generale der Waffen-SS und der Polizei\" by Andreas Schulz, Günther Wegman and Dieter Zinke.\n\nSources used\n\nEinsatzgruppen Operational Situation Report #19\n\nChristopher Ailsby - Hitler's Renegades: Foreign nationals in the service of the Third Reich\n\nJohn R. Angolia - Cloth insignia of the SS\n\nAndrej Angrick - Besatzungspolitik und Massenmord: Die Einsatzgruppe D in der südlichen Sowjetunion, 1941-1943\n\nMark W.A. Axworthy - Axis Slovakia: Hitler's Slavic Wedge 1938-1945\n\nRoger James Bender & Hugh Page Taylor - Uniforms, Organization and History of the Waffen-SS, vol 2\n\nBernd Boll - Zloczow, Juli 1941: Die Wehrmacht und der Beginn des Holocaust in Galizien\n\nChristopher R. Browning - The Origins of the Final Solution\n\nPhilip H Buss - Divisional signs of the Waffen-SS (Military Advisor, vol 19, number 4)\n\nRupert Butler - SS-Wiking: The History of the Fifth SS Division 1941 - 1945\n\nGeorges M. Croisier - Waffen-SS (PDF)\n\nLars Ericson - Svenska frivilliga: Militära uppdrag i utlandet under 1800- och 1900-talen\n\nLars Ericson Wolke - Joseph Goebbels: En biografi\n\nKen Estes - A European Anabasis: Western European Volunteers in the German Army and SS, 1940-1945\n\nTerry Goldsworthy - Valhalla's Warriors: A history of the Waffen-SS on the Eastern Front 1941-1945\n\nLars Gyllenhaal & Lennart Westberg - Svenskar i krig 1914-1945\n\nMauno Jokipii - Panttipataljoona\n\nEwald Klapdor - Viking Panzers: The German SS 5th Tank Regiment in the East in World War II\n\nDr. K-G Klietmann - Die Waffen-SS: eine Dokumentation\n\nEleonore Lappin - The Death Marches of Hungarian Jews Through Austria in the Spring of 1945\n\nKurt Mehner - Die Waffen-SS und Polizei 1939-1945\n\nLynn H. Nicholas - The Rape of Europa: The Fate of Europe's Treasures in the Third Reich and the Second World War\n\nJames Pontolillo - Murderous Elite: The Waffen-SS and its complete record of war crimes\n\nHeather Pringle - The Master Plan: Himmler’s Scholars & The Holocaust\n\nGerald Reitlinger - The SS: Alibi of a Nation 1922-45\n\nRichard Rhodes - Masters of Death: The SS Einsatzgruppen and the Invention of the Holocaust\n\nMarc J. Rikmenspoel - Waffen-SS Encyclopedia\n\nAndreas Schulz & Günther Wegmann - Die Generale der Waffen-SS und der Polizei, Vol 1\n\nNiclas Sennerteg - Tyskland talar: Hitlers svenska radiostation\n\nGeorge H. Stein - The Waffen-SS: Hitler's Elite Guard at War 1939-1945\n\nJames C. Steuard - Tactical Markings of the Waffen-SS, Part 3 (in AFV-G2 Vol 4 No 5)\n\nFrank Thayer - The Norwegian SS volunteers (in The Military Advisor, Vol 11 No 1)\n\nFrank Thayer - Shoulder strap cyphers of the SS (in The Military Advisor, Vol 9 No 1)\n\nGordon Williamson & Thomas McGuirl - German military cuffbands 1784-present\n\nGordon Williamson - The Waffen-SS: 1. to 5. Divisions\n\nMark C. Yerger - Waffen-SS Commanders: The Army, corps and divisional leaders of a legend (2 vol)\n\n\n\n\n\nReference material on this unit\n\nMassimiliano Afiero - Wiking: la Waffen SS europea\n\nGünter Bernau - SS-Panzer-Artillerie-Regiment 5 in der Panzer-Division Wiking\n\nOdd Helge Brugrand - 16 år og Hitlers soldat: historien om Ivar Skarlo, en norsk soldat på Østfronten\n\nRupert Butler - SS-Wiking: The History of the Fifth SS Division 1941 - 1945\n\nFritz Hahl - Mit Westland im Osten\n\nRolf Ivar Jordbruen - Helvete på jord: en frontkjempers historie\n\nEwald Klapdor - Viking Panzers: The German SS 5th Tank Regiment in the East in World War II\n\nJean Mabire - Die SS-Panzer-Division \"Wiking\"\n\nJean Mabire - La Panzerdivision Wiking: la lutte finale, 1943-1945\n\nDennis Oliver - Viking Summer: 5.SS-Panzer-Division in Poland, 1944\n\nPaul Österling, Ron Ehrlings & Hans Fishcher - Standartenführer Johannes Mühlenkamp: Kommandeur Des SS-Panzerregiments 5 Wiking Und Seine Männer\n\nRolf Proschek - Werweht Sind Die Spuren\n\nJacek Solarz - Wiking 1941-1945\n\nPeter Strassner - European Volunteers: The 5. SS-Panzerdivision \"Wiking\"\n\nRegimentskameradschaft \"Westland\" - Panzergrenadiere der Panzerdivision \"Wiking\" im Bild\n\nJonathan Trigg - Hitler's Vikings: The History of the Scandinavian Waffen-SS: The Legions, the SS Wiking and the SS Nordland\n\nEgil Ulateig & Geir Brenden - Nordmennene på Østfronten\n\nHendrick Verton - In the Fire of the Eastern Front: The Experiences Of A Dutch Waffen-SS Volunteer On The Eastern Front 1941-45\n\nJan Vincx & Viktor Schotanius - Nederlandse vrijwilligers in Europese krijgsdienst 1940-1945 Vol 4: 5e SS-Pantser Divisie Wiking en kleinere strijdformaties\n\nRobert G. Wróblewski - Dywizja Wiking w Polsce\n\nMark C. Yerger - German Cross in Gold: Holders of the SS and Police, Volume 7, Wiking\n\nMark C. Yerger - German Cross in Gold: Holders of the SS and Police, Volume 8, Wiking"}, {"url": "https://forum.axishistory.com/viewtopic.php?t=109497", "page_content": "#2\n\nPost by Dieter Zinke » 10 Oct 2006, 15:54\n\nThe proposal for the KC from his units, arrived on 11.01.1945, was refused by the HPA (Heerespersonalamt), date unknown.\n\nThe Ehrenblattspange was awarded on 05.03.1945, it seems instead of the KC.\n\nA proposal from the HPA for the bestowal with the KC does not exist in the archives in Berlin before the date 11.05.1945 when another proposal of his units arrived at the HPA.\n\nThe 11.05.1945 as the date for the bestowal with the KC is an assumption of the OdR a long time after the war - and this is definitively illegal.\n\nKrätschmer assummed the date 09.05.1945. This is illegal too.\n\n\n\nConsequently Veit Scherzer cancelled him as a KC-holder. He never was !!\n\n\n\nDieter Z."}, {"url": "https://news.usc.edu/125246/in-memoriam-alfred-fischer-96-prominent-geologist/", "page_content": "BY Susan Bell July 24, 2017\n\nProfessor Emeritus of Earth Sciences Alfred “Al” Fischer, a globally prominent geologist, has died. He was 96.\n\nFischer died July 2 at Maravilla Senior Living Community in Santa Barbara.\n\nFischer made major contributions to the understanding of environmental cyclicity, characterized by repetitive patterns of different rock layers, or strata, in the Earth.\n\n“Al Fischer was one of the most globally prominent sedimentary geologists of the second half of the 20th century,” said David Bottjer, professor of Earth sciences, biological sciences and environmental studies at the USC Dornsife College of Letters, Arts and Sciences. “At USC he was a wonderful colleague who sparked many innovative research interactions at the intersection of Earth and life evolution, and was the prototype faculty member for our department’s now leading program in geobiology.”\n\nThe breadth of Al’s influence spans generations and is global. The Earth sciences community has lost an icon. William Berelson\n\nDescribing Fischer as a renaissance scholar, William Berelson, professor of Earth sciences and environmental studies and chair of Earth sciences said, “The breadth of Al’s influence spans generations and is global. The Earth sciences community has lost an icon.”\n\nFischer studied marine sedimentology and marine fossil fauna and was a leading scientist in the Deep Sea Drilling Project. In 1964, he described the phenomenon of rhythmically recurring sequences of sedimentary rock layers in some Keuper Formations of the Alps, first discovered in the Dachstein-Kalk (Dachstein limestone) found in the Austrian province of Salzburg. In the 1970s, he propagated the existence of global biorhythms in the fossil record and in 1977 the concept of cycles of low and high levels of biodiversity in the marine fauna over 32 million years. In 1982, he spoke in favor of the Earth’s climate alternating between ice ages and warm periods due to the Icehouse-Greenhouse concept.\n\nFischer’s work at USC Dornsife, and earlier at Princeton University, concentrated on the little-understood area of stratigraphy — the branch of geology concerned with the order and relative position of strata and their relationship to the geological time scale. He was probably one of the first people to recognize the importance of Milankovitch cycles, or orbital forcing, which show the variable amounts of sunlight hitting the Earth at a particular point over a period of time and how that changes as the Earth goes through a series of cycles. Fischer was able to show that these sequences, which were calculated theoretically in the orbital characteristics of the Earth, are mirrored in the sedimentary sequences — a huge advance in the understanding of sequence stratigraphy.\n\nAn inspirational role model for students\n\nFischer was also a generous and devoted teacher. His elder son, Joseph Fred “Fritz” Fischer, recounted how after giving a guest lecture at Yale University in the late 1970s, his father turned down an offer to tour the university’s geology department in favor of talking to its graduate students.\n\n“The moment the students heard about it, they dashed off to quickly read up on his literature,” Fritz Fischer said. However, rather than talking about his own work, Al Fischer concentrated on the students’ efforts, sitting down with each student individually and asking about their thesis or dissertation, then making suggestions.\n\n“The students were utterly amazed,” Fritz Fischer said. “Here’s this great man, he’s made such a name for himself and he wasn’t there to talk about himself. He was there to find out what they were doing. They all walked out of there saying, ‘Oh my God, I want to be like that man.’”\n\nFrom Germany to the U.S.\n\nBorn on Dec. 10, 1920, in Rothenburg, Germany, Al Fischer was the son of George Fischer, a traveling shoe salesman who made a fortune in the American Old West, retired at a young age and moved to Germany with his wife, Thea. Both parents were of German extraction, but born in the United States. The family lived in Germany for 14 years, for much of that time in an Alpine chalet where young Al Fischer developed a profound love of nature.\n\nThe family, deeply concerned by the direction Germany was taking, returned to the U.S. in 1935, settling in Watertown, Wis. Fischer spent a year in a U.S. high school before being admitted to a local college. He completed his sophomore year there, then transferred to the University of Wisconsin in 1938 with the expectation that he would become a forester. However, he rapidly fell in love with geology and graduated a year later, at the age of 19, with his bachelor’s degree in that discipline.\n\nFollowing his graduation, on Aug. 26, 1939, he married Winnifred “Winnie” Varney, a graduate student in geography. Fischer then pursued a master’s degree in geology at the University of Wisconsin, graduating in 1940.\n\nFischer then began studying for his PhD, but the birth of his first child in 1941 forced him to temporarily abandon his studies and take a job teaching geology at Virginia Polytechnic Institute in Blacksburg. He remained until 1943, when the institute converted to an officer training school.\n\nWartime and postwar years\n\nAs a pre-Pearl Harbor father with a young son to look after and poor eyesight, Fischer was exempted from military service. Instead, he joined Stanolind Oil and Gas as a geologist, working first in Wichita, Kansas, and then in Tallahassee, Fla., and supporting the war effort by seeking much-needed petroleum resources in the U.S.\n\nIn 1946, Fischer enrolled in Columbia University, completing the PhD qualifying examination the same year. In 1947, he taught at the University of Rochester and from 1948 at the University of Kansas, where he was an assistant professor. During the summers of 1949 and 1950, Fischer managed a research program on the Capitan Reef Complex in the Guadalupe Mountains of West Texas, leading 15 to 20 geologists and graduate students. In 1950, he was awarded his PhD from Columbia.\n\nAt the University of Kansas, he wrote a textbook on paleontology with two fellow professors, Raymond Moore and Cecil Lalicker. Published in 1952, Invertebrate Fossils (McGraw-Hill) has endured in popularity for more than 60 years.\n\nFrom 1951-56, Fischer served as a petroleum geologist for Esso in Peru, first in Talara and then in Lima.\n\nImportant contributions in academe\n\nIn 1956, he returned to the U.S. to join Princeton. During his 28-year stay at the university, Fischer conducted substantial research in the Austrian and Italian Alps, worked in the Green River Basin — the watershed of the Green River, the Colorado River’s chief tributary — and drilled a core in Southern Colorado that was the focus of extensive study. He also served as visiting professor in Innsbruck, Austria, and in Berlin and Tübingen in Germany.\n\nAn avid reader of The New York Times and books on geology, Fischer also enjoyed reading fiction, writing poetry and watercolor painting. He was a keen traveler, deriving immense enjoyment from research trips, including a two-year journey around the world to look at deep sea sediments from 1970–71, armed with a 1969 Guggenheim Fellowship.\n\nPrinceton’s mandatory retirement at age 65 did not suit Fischer, who was not ready to retire, and in 1984 he joined USC Dornsife.\n\nFischer was the recipient of more than 30 awards, including the 2009 Mary Clark Thompson Medal; the 1992 Gustav-Steinmann-Medaille for his pioneering insights into the rhythms of life and the Earth’s climate; the 1992 Lyell Medal; the 1982 William H. Twenhofel Medal and the1972 Leopold-von-Buch-Plakette award of the German Geological Society. The honor that meant the most to him was his 1991 induction into the Academia Nazionale dei Lincei (the Italian Academy of Sciences), one of the oldest scientific academies in the world and which counts Galileo as an early inductee.\n\nFinally retired, but not really\n\nFischer officially retired from USC Dornsife in 1991 at the age of 71, but maintained an office on campus and continued to offer advice and help to students, even participating in field trips. It was not until the early 2000s that he began to slow down, spending more time working from home.\n\nHowever, even then Fischer continued to spearhead new research. During a 2011 field trip to look at the Monterey Formation near Morro Bay, which he attended as part of a celebration of the A. Eugene Fritsche Lifetime Award from the Pacific Section of the Society for Sedimentary Geology, Fischer discovered that reversals in polarity of the Earth’s magnetic field bore a resemblance to some cyclic sedimentation patterns. As a result, Fischer spent the last years of his life working to determine if a relationship exists between the cycles in sedimentation and the changes in polarity in the Earth’s field and trying to relate that back to orbital forcing and the Milankovitch Cycles.\n\n“Unfortunately, he wasn’t able to carry this through to a conclusion before his death,” Fritz Fischer said. “Others are following up on it, and it will be interesting to see where this goes. This was a whole new window that my father was looking into and it is typical of the man that he would do that.”\n\nIn 2010, Al Fischer’s wife died four years after suffering a stroke. Fischer is survived by his children: Fritz Fischer, George William “Bill” Fischer and Lenore Ruth Fischer; his grandchildren Jon Karl Fischer, Kristina Michele Fischer, Bella Walsh and Jennifer Walsh; and great grandchildren Alexander, Nicolas and Madison Fischer, and Braiden and Justin Stanert.\n\nFischer was cremated in a private ceremony in Santa Barbara on July 14. A memorial is being planned for a later date.\n\nMore stories about: Earth Sciences, Environment, Obituaries"}, {"url": "https://www.automotivehalloffame.org/honoree/alfred-j-fisher/", "page_content": "The family that built the body of Detroit’s automobile industry\n\nA GM president once said “When one Fisher Brother cuts himself shaving, they all bleed.” Schooled by their parents in cooperation and inspired by their father’s commitment to quality in the carriage-building trade, the Fisher Brothers had a natural-born plan for success. The two eldest of the seven brothers, Fred and Charles, came to Detroit from their Norwalk, Ohio home in the early 1900’s to join the growing automotive industry. They found work at the C. R. Wilson Company, a manufacturer of horse-drawn carriages that was beginning to make automobile bodies. The brothers learned the trade over the next several years and in 1908, secured financing from their uncle to found the Fisher Body Company.\n\nThe five younger brothers (William, Lawrence, Edward, Alfred, and Howard) soon joined the business. Each of them brought new skills and differing opinions, but shared a sense of unity and a common goal of outstanding craftsmanship. By 1914, the Fisher Body Company had become the largest auto-body manufacturer in the world having produced 370,000 car bodies for customers like Ford, Cadillac, Studebaker, Buick, Oldsmobile, Packard, and Chevrolet. At its peak, the company employed over 100,000 workers across 40 plants, including the Albert Kahn-designed Fisher Body 21 on Piquette Ave. In 1919, the brothers sold 60% of the company to General Motors. The brothers sold their remaining stake in 1926, and Fisher Body became the in-house coachbuilding division of GM. The brothers would resign from GM in 1944 to pursue other interests, including the construction of the Fisher Building on W. Grand Blvd. in Detroit.\n\nIn the ensuing decades, Fisher Body would spearhead numerous developments for General Motors, including the one-piece “turret top” roof, GM’s first unibody car (the Corvair), and GM’s first all–metric vehicle (the Chevette). Though GM continued to use the Fisher Body name on their cars into the 1990’s, the company was dissolved into other GM divisions in 1984. The last of the Fisher brothers passed away in January of 1972. In addition to brilliantly serving the automotive industry for half a century, the Fishers donated millions of dollars to schools, churches, and other charitable causes. By working together as a close-knit family, the Fisher family helped Detroit become a manufacturing titan and an epicenter for innovation."}]}