{"Kermit Davis led the Blue Raiders to five NCAA Tournament appearances.": [{"url": "https://olemisssports.com/sports/mens-basketball/roster/coaches/kermit-davis/730", "page_content": "COACHING CAREER Year(s) School Position 2019-2023 Ole Miss Head Coach 2003-18 Middle Tennessee Head Coach 1998-2002 LSU Associate Head Coach 1997 Idaho Head Coach 1995-96 Utah State Associate Head Coach 1994 Chipola JC Head Coach 1992-93 Chipola JC Associate Head Coach 1991 Texas A&M Head Coach 1989-90 Idaho Head Coach 1987-88 Idaho Assistant Coach 1985-86 Southwest Mississippi CC Head Coach 1983-84 Mississippi State Graduate Assistant\n\nHEAD COACHING RECORD Year(s) School Record (Postseason) 2022-23 Ole Miss 10-18 2021-22 Ole Miss 13-19 2020-21 Ole Miss 16-12 (NIT First Round) 2019-20 Ole Miss 15-17 2018-19 Ole Miss 20-13 (NCAA First Round) 2017-18 Middle Tennessee 25-8 (NIT Second Round) 2016-17 Middle Tennessee 31-5 (NCAA Second Round) 2015-16 Middle Tennessee 25-10 (NCAA Second Round) 2014-15 Middle Tennessee 19-17 (CIT First Round) 2013-14 Middle Tennessee 24-9 2012-13 Middle Tennessee 28-6 (NCAA First Four) 2011-12 Middle Tennessee 27-7 (NIT Quarterfinals) 2010-11 Middle Tennessee 16-16 2009-10 Middle Tennessee 19-14 (CIT First Round) 2008-09 Middle Tennessee 18-14 2007-08 Middle Tennessee 17-15 2006-07 Middle Tennessee 15-17 2005-06 Middle Tennessee 16-12 2004-05 Middle Tennessee 19-12 2003-04 Middle Tennessee 17-12 2002-03 Middle Tennessee 16-14 1996-97 Idaho 13-17 1993-94 Chipola JC 27-5 (State Semifinals) 1990-91 Texas A&M 8-21 1989-90 Idaho 25-6 (NCAA First Round) 1988-89 Idaho 25-6 (NCAA First Round) 1985-86 Southwest Mississippi CC 22-11 1984-85 Southwest Mississippi CC 17-9 Totals 27 seasons 543-342 (.614) Division I 25 seasons 477-317 (.601) at Ole Miss 5 seasons 74-79 at Middle Tennessee 16 seasons 332-188 (winningest coach in program history) at Texas A&M 1 season 8-21 at Idaho 3 seasons 63-29\n\nKermit Davis spent five seasons at the helm of Ole Miss Basketball. A nine-time conference coach of the year, Davis left the Rebels 29th among active Division I head coaches with 477 career wins over 25 seasons, including stints at Middle Tennessee, Idaho and Texas A&M. In 28 seasons as a college basketball head coach, he amassed 543 wins.Davis coached four all-conference players during his four seasons in Oxford, including a trio of First Team All-SEC guards. Devontae Shuler was the latest Rebel to finish his collegiate career with First Team All-SEC honors along with winning the C Spire Howell Trophy as the best men’s basketball player in the state of Mississippi. Prior to Shuler, Breein Tyree earned first team accolades in back-to-back seasons (2018-19, 2019-20). Tyree’s game blossomed in Davis’ system, ranking in the conference’s top three in scoring as a junior (third-17.9 ppg) and as a senior (second-19.7 ppg). Current Sacramento King Terence Davis also found success under his new head coach as a senior (2018-19) before becoming the first Rebel in more than a decade to play in the NBA.Davis took Ole Miss to new heights in recruiting, signing the No. 12 class in the nation for the 2022-23 season (per ESPN), as well as the two highest ranked recruits in program history at the time. Matthew Murrell broke the record first as part of the 2020 class before 2021 Mississippi Gatorade Player of the Year Daeshun Ruffin became Ole Miss’ top rated recruit. Ruffin also became the first McDonald’s All-American to sign with the Rebels out of high school. Both cracked the top-40 nationally when they signed to continue their careers at Ole Miss.Murrell and Ruffin had breakout seasons in 2021-22 under Davis, a year in which the Rebels notched two more AP Top-25 victories -- their fifth within a calendar year. Ole Miss tied a program record with its fourth-straight top-25 win after the Rebels took down No. 18 Memphis, 67-63, in front of a sellout crowd at SJB Pavilion on Dec. 4. That streak dated back to the previous season after the Rebels took down No. 10 Tennessee (52-50), No. 10 Missouri (80-59) and No. 24 Missouri (60-53) in the February of 2021. Ole Miss added a fifth AP Top-25 win in the span of a calendar year after a thrilling 76-72 victory at No. 25 LSU on Feb. 1, 2022, the first Rebel win in Baton Rouge since March 9, 2013.After being the last team from a Power 5 conference to start the 2020-21 season due to a COVID-19 outbreak within the program, Davis’ Rebels made a late season run that nearly resulted in an NCAA Tournament berth. Boasting the SEC’s best scoring defense, allowing only 65.4 ppg, the Rebels won 10 of their final 13 games. Two of those victories were over top-10 teams. Ole Miss finished the season 3-0 against top-25 opponents, one of only four teams to go undefeated versus ranked teams during the 2020-21 campaign. Just missing out on March Madness, the Rebels received a No. 1 seed in the NIT to make their second postseason. While Shuler led the way as a First Team All-SEC guard, graduate transfer Romello White made an impact in his only season by setting the school record for field goal percentage in a single season (64.9 percent).During his second season, Davis earned his 500th career win as a head coach. With defense a common emphasis to his teams, Ole Miss finished the 2020 season ranked 15th nationally in three-point field goal percentage defense (29.2). The 2019-20 campaign was highlighted by a comeback victory over Penn State in the NIT Tip-Off, in which the Rebels trailed by as many as 21 points in the second half, and a 25-point victory over rival Mississippi State. The win over the Bulldogs was Ole Miss’ fifth-largest margin of victory in the SEC’s most-played rivalry.After leading Middle Tennessee to conference championships and NCAA Tournament runs, the Leakesville, Mississippi, native returned to his home state as the 22nd permanent head coach of the Ole Miss basketball program, as announced on March 15, 2018.Davis wasted no time making an impact in Oxford. With the Rebels coming off a last-place finish in 2017-18, the media picked Ole Miss to land at the bottom of the SEC standings again in 2018-19. However, Davis led one of the biggest turnaround seasons in the nation. Behind the play of All-SEC guards Tyree (first team) and Terence Davis (second team), the Rebels posted a 20-13 record to earn a spot in the NCAA Tournament for the first time in four years. With a return to March Madness for the sixth time in his career, Davis joined a list of 63 coaches in college basketball history to take three different schools to the NCAA Tournament.Ole Miss won 13 of its first 15 games to begin the Davis era, which included victories against top-15 teams Auburn and Mississippi State to vault the Rebels into the national rankings for the first time in six years. Davis became the first Ole Miss head coach to win his first three SEC games. The Rebels ended the conference slate with a 10-8 mark, good enough for a tie for sixth in the standings. Davis was named SEC Coach of the Year by his peers and the Associated Press, earning conference coach of the year accolades for the ninth time in his career. He became the sixth Ole Miss coach to earn SEC Coach of the Year honors, while joining Andy Kennedy as the only Rebel coaches to collect the award in their first year in Oxford.Davis brought an excited brand of basketball to The Pavilion, as Ole Miss led the SEC in increased attendance for conference games (23.75 percent). The Rebels sold out five home games in his first year, exceeding the four sellouts combined over the first two and a half seasons in The Pavilion.Prior to returning to his home state, Davis guided Middle Tennessee to league titles in six of his last nine years in Murfreesboro, between Conference USA and the Sun Belt. Middle Tennessee was one of five programs he led to conference championships.Under Davis’ watch, Middle Tennessee made the 2013, 2016 and 2017 NCAA tournaments and defeated No. 2 seed Michigan State and No. 5 seed Minnesota in back-to-back seasons.With a 25-8 record in 2018, Middle Tennessee reached the 24-win mark for the sixth time in seven seasons, which in turn led to six postseason appearances during that period. The Blue Raiders won consecutive Conference USA regular season titles in Davis’ final two years, posting a 33-3 mark in C-USA play.Davis’ Blue Raiders posted a 31-5 record in 2017, including a 17-1 mark in Conference USA play, setting a school record for overall victories and a C-USA record for league wins. Middle Tennessee swept the conference regular season and tourney titles on its way to a second consecutive NCAA Tournament berth that saw them topple No. 5 seed Minnesota, 81-72, in Milwaukee.The Blue Raiders finished the 2016 season with a 25-10 mark and won their first Conference USA Tournament title just three years into their tenure. In the Big Dance, Davis led the Raiders to St. Louis as a No. 15 seed against Tom Izzo’s No. 2 seed and second-ranked Michigan State Spartans, directing one of the biggest upsets in NCAA Tournament history as the Blue Raiders captured a 90-81 win to move into the second round.Middle Tennessee was a giant killer under Davis, posting a 12-11 record against seven different Power 5 teams from 2012 through 2018. Over the final three seasons, the Blue Raiders boasted a 7-1 record against the SEC and Big Ten, including the two NCAA Tournament wins.Defense has long been a staple for Davis’ squads, as the Blue Raiders ranked top two in C-USA in scoring defense in each of his final four seasons. That style of play correlated to tremendous success on the road, including a 23-3 record away from home over his last two campaigns.With Davis’ emphasis on academics, Middle Tennessee was one of only six teams in 2017 and one of only seven in 2016 with a 100 percent graduation rate and also win an NCAA Tournament game that season – joining Kansas, Villanova, Duke, Notre Dame and Butler in both seasons as well as Iowa in 2016. Davis graduated 52 consecutive MT student-athletes that exhausted their eligibility.Davis excelled in ramping up fan support during his tenure as well, frequently surpassing season attendance marks while averaging a home crowd of nearly 7,000 in his final season. A Murphy Center attendance record of 11,807 was set for Western Kentucky in 2004, while 11,802 fans were on hand for the Tennessee game in 2009.Davis coached 25 all-conference players and five players of the year at Middle Tennessee and signed five top-25 recruiting classes, including the No. 11 class in 2004. He left Murfreesboro as the all-time winningest coach for both the school and the Sun Belt Conference.Before arriving at Middle Tennessee in 2002, Davis spent five seasons as the associate head coach at LSU under John Brady. With Davis assembling multiple top-five recruiting classes, the Tigers captured the SEC title in 2000 and reached the Sweet 16 for the first time in 13 years.In two tours of duty as Idaho head coach in 1997 and from 1989-90, Davis compiled a 63-29 record, the best three-year total in the program’s history, and earned NCAA Tournament berths in 1989 and 1990.Davis took the helm at Idaho before the 1989 season after two years as an assistant coach under Tim Floyd, and at the time, was the youngest Division I head coach in the nation at age 28. It was not the first time Davis had been the country’s youngest head coach. When he was hired as the head coach at Southwest Mississippi Community College in 1984, he became the youngest junior college coach in the nation at age 24. His youth served him well at Southwest Mississippi, as he put together a 39-20 record in two seasons. His 1986 squad won 22 games, posting the school’s first 20-win season in 17 years.After spending two seasons as the head coach at Idaho, Davis went on to become the head coach at Texas A&M for the 1991 campaign. From Texas A&M, Davis moved on to serve as associate head coach at Chipola Junior College for two seasons before ascending to the top spot for the 1994 campaign. During his season as the team’s head coach, Chipola finished the season ranked No. 4 in the national polls and posted a 27-5 record, giving the team the second-most wins in school history.From Chipola, Davis moved on to serve as associate head coach at Utah State from 1995-96. With the Aggies, Davis coached under Larry Eustachy, and the pair combined to win the Big West championship in 1995.The son of former Mississippi State head coach Kermit Davis Sr., the younger Davis played for the Bulldogs and graduated from MSU in 1982, before beginning his coaching career at his alma mater as a graduate assistant.He and his wife, Betty, have two daughters, Ally and Claire.Bachelor’s in Business Administration (1982) - Mississippi StateMaster of Arts in Teaching (1984) - Mississippi State2019 SEC Coach of the Year (league, AP)2019 Jim Phelan Award finalist (CollegeInsider.com)2017 TSWA Coach of the Year2017 NABC District 11 Coach of the Year2017 Conference USA Coach of the Year (league)2016 Daily News Journal Sportsperson of the Year2013 Sun Belt Coach of the Year (league, CollegeInsider.com)2012 NABC District 24 Coach of the Year2012 Sun Belt Coach of the Year (league, CollegeInsider.com)2010 Sun Belt Coach of the Year (CollegeInsider.com)2008 Sun Belt Coach of the Year (CollegeInsider.com)2003 Sun Belt Coach of the Year (league)1990 Big Sky Coach of the Year (league)1989 Big Sky Coach of the Year (league)- Nine seasons of 24 or more wins as a head coach- Nine-time conference coach of the year- Winningest head coach in Middle Tennessee history- Winningest head coach in Sun Belt conference history- Youngest Division I head coach in the nation at Idaho at age 28- Youngest junior college coach in the nation at Southwest Mississippi at age 24"}, {"url": "https://www.espn.com/mens-college-basketball/story/_/id/22838525/mississippi-introduces-kermit-davis-coach", "page_content": "OXFORD, Miss. -- Kermit Davis was comfortable at Middle Tennessee, but after 16 seasons he was ready for the challenge of leading a program in the Southeastern Conference.\n\nThe 58-year-old has been given that opportunity at Mississippi, where he was introduced as coach on Monday. The introduction came less than 24 hours after Middle Tennessee fell to Louisville in the second round of the National Invitation Tournament.\n\n\"It was just one of those things that I knew it was the right place for me,\" Davis said.\n\nDavis, a native of Leakesville, Mississippi, replaces Andy Kennedy, who coached Ole Miss for 12 seasons and was the winningest coach in program history before he resigned with two weeks left in a disappointing season.\n\nDavis will earn a base salary of $2.5 million annually on a four-year contract, which is the longest allowed by state law. He can earn incentives for accomplishments like boosting average attendance and conference championships.\n\nMiddle Tennessee became one of the best mid-majors in the nation under Davis' guidance. In his 11th season, Davis led the Blue Raiders back to the NCAA tournament after a 12-year absence. The Blue Raiders had upset wins in the NCAA tournament in both 2016 and 2017, beating Michigan State and Minnesota, respectively.\n\nHe is taking over a program at Ole Miss that last made the tournament in 2015. Ole Miss is coming off a 12-20 season and finished last in the SEC with a 5-13 record.\n\n\"We're not going to have eight or nine years [of rebuilding] here,\" Davis said. \"We've got to improve those [returning] guys. There's talent in that locker room. We've got to individually get their development to go up.\"\n\nMaybe the most notable portion of Davis' contract is the bump in assistant pay. The salary pool Davis will have to work with has been pushed to $900,000, and two of those positions have already been filled.\n\nMiddle Tennessee assistants Win Case and Ronnie Hamilton will come with Davis to Ole Miss. Davis said the third assistant position could be filled by a current member of the Ole Miss staff or he could open up the spot for a national search.\n\nDavis has some experience in the SEC. He was the associate head coach at LSU for five seasons under then-coach John Brady before taking the Middle Tennessee job in 2002.\n\nDavis' father, also named Kermit Davis, coached at Mississippi State from 1970-1977. Davis played for the Bulldogs and served as a graduate assistant there.\n\n\"Nobody wants to beat Mississippi State's tail more than Kermit Davis,\" Davis said."}, {"url": "https://olemisssports.com/sports/mens-basketball/roster/coaches/kermit-davis/629", "page_content": "COACHING CAREER Year(s) School Position 2019-2023 Ole Miss Head Coach 2003-18 Middle Tennessee Head Coach 1998-2002 LSU Associate Head Coach 1997 Idaho Head Coach 1995-96 Utah State Associate Head Coach 1994 Chipola JC Head Coach 1992-93 Chipola JC Associate Head Coach 1991 Texas A&M Head Coach 1989-90 Idaho Head Coach 1987-88 Idaho Assistant Coach 1985-86 Southwest Mississippi CC Head Coach 1983-84 Mississippi State Graduate Assistant\n\nHEAD COACHING RECORD Year(s) School Record (Postseason) 2022-23 Ole Miss 10-18 2021-22 Ole Miss 13-19 2020-21 Ole Miss 16-12 (NIT First Round) 2019-20 Ole Miss 15-17 2018-19 Ole Miss 20-13 (NCAA First Round) 2017-18 Middle Tennessee 25-8 (NIT Second Round) 2016-17 Middle Tennessee 31-5 (NCAA Second Round) 2015-16 Middle Tennessee 25-10 (NCAA Second Round) 2014-15 Middle Tennessee 19-17 (CIT First Round) 2013-14 Middle Tennessee 24-9 2012-13 Middle Tennessee 28-6 (NCAA First Four) 2011-12 Middle Tennessee 27-7 (NIT Quarterfinals) 2010-11 Middle Tennessee 16-16 2009-10 Middle Tennessee 19-14 (CIT First Round) 2008-09 Middle Tennessee 18-14 2007-08 Middle Tennessee 17-15 2006-07 Middle Tennessee 15-17 2005-06 Middle Tennessee 16-12 2004-05 Middle Tennessee 19-12 2003-04 Middle Tennessee 17-12 2002-03 Middle Tennessee 16-14 1996-97 Idaho 13-17 1993-94 Chipola JC 27-5 (State Semifinals) 1990-91 Texas A&M 8-21 1989-90 Idaho 25-6 (NCAA First Round) 1988-89 Idaho 25-6 (NCAA First Round) 1985-86 Southwest Mississippi CC 22-11 1984-85 Southwest Mississippi CC 17-9 Totals 27 seasons 543-342 (.614) Division I 25 seasons 477-317 (.601) at Ole Miss 5 seasons 74-79 at Middle Tennessee 16 seasons 332-188 (winningest coach in program history) at Texas A&M 1 season 8-21 at Idaho 3 seasons 63-29\n\nKermit Davis spent five seasons at the helm of Ole Miss Basketball. A nine-time conference coach of the year, Davis left the Rebels 29th among active Division I head coaches with 477 career wins over 25 seasons, including stints at Middle Tennessee, Idaho and Texas A&M. In 28 seasons as a college basketball head coach, he amassed 543 wins.Davis coached four all-conference players during his four seasons in Oxford, including a trio of First Team All-SEC guards. Devontae Shuler was the latest Rebel to finish his collegiate career with First Team All-SEC honors along with winning the C Spire Howell Trophy as the best men’s basketball player in the state of Mississippi. Prior to Shuler, Breein Tyree earned first team accolades in back-to-back seasons (2018-19, 2019-20). Tyree’s game blossomed in Davis’ system, ranking in the conference’s top three in scoring as a junior (third-17.9 ppg) and as a senior (second-19.7 ppg). Current Sacramento King Terence Davis also found success under his new head coach as a senior (2018-19) before becoming the first Rebel in more than a decade to play in the NBA.Davis took Ole Miss to new heights in recruiting, signing the No. 12 class in the nation for the 2022-23 season (per ESPN), as well as the two highest ranked recruits in program history at the time. Matthew Murrell broke the record first as part of the 2020 class before 2021 Mississippi Gatorade Player of the Year Daeshun Ruffin became Ole Miss’ top rated recruit. Ruffin also became the first McDonald’s All-American to sign with the Rebels out of high school. Both cracked the top-40 nationally when they signed to continue their careers at Ole Miss.Murrell and Ruffin had breakout seasons in 2021-22 under Davis, a year in which the Rebels notched two more AP Top-25 victories -- their fifth within a calendar year. Ole Miss tied a program record with its fourth-straight top-25 win after the Rebels took down No. 18 Memphis, 67-63, in front of a sellout crowd at SJB Pavilion on Dec. 4. That streak dated back to the previous season after the Rebels took down No. 10 Tennessee (52-50), No. 10 Missouri (80-59) and No. 24 Missouri (60-53) in the February of 2021. Ole Miss added a fifth AP Top-25 win in the span of a calendar year after a thrilling 76-72 victory at No. 25 LSU on Feb. 1, 2022, the first Rebel win in Baton Rouge since March 9, 2013.After being the last team from a Power 5 conference to start the 2020-21 season due to a COVID-19 outbreak within the program, Davis’ Rebels made a late season run that nearly resulted in an NCAA Tournament berth. Boasting the SEC’s best scoring defense, allowing only 65.4 ppg, the Rebels won 10 of their final 13 games. Two of those victories were over top-10 teams. Ole Miss finished the season 3-0 against top-25 opponents, one of only four teams to go undefeated versus ranked teams during the 2020-21 campaign. Just missing out on March Madness, the Rebels received a No. 1 seed in the NIT to make their second postseason. While Shuler led the way as a First Team All-SEC guard, graduate transfer Romello White made an impact in his only season by setting the school record for field goal percentage in a single season (64.9 percent).During his second season, Davis earned his 500th career win as a head coach. With defense a common emphasis to his teams, Ole Miss finished the 2020 season ranked 15th nationally in three-point field goal percentage defense (29.2). The 2019-20 campaign was highlighted by a comeback victory over Penn State in the NIT Tip-Off, in which the Rebels trailed by as many as 21 points in the second half, and a 25-point victory over rival Mississippi State. The win over the Bulldogs was Ole Miss’ fifth-largest margin of victory in the SEC’s most-played rivalry.After leading Middle Tennessee to conference championships and NCAA Tournament runs, the Leakesville, Mississippi, native returned to his home state as the 22nd permanent head coach of the Ole Miss basketball program, as announced on March 15, 2018.Davis wasted no time making an impact in Oxford. With the Rebels coming off a last-place finish in 2017-18, the media picked Ole Miss to land at the bottom of the SEC standings again in 2018-19. However, Davis led one of the biggest turnaround seasons in the nation. Behind the play of All-SEC guards Tyree (first team) and Terence Davis (second team), the Rebels posted a 20-13 record to earn a spot in the NCAA Tournament for the first time in four years. With a return to March Madness for the sixth time in his career, Davis joined a list of 63 coaches in college basketball history to take three different schools to the NCAA Tournament.Ole Miss won 13 of its first 15 games to begin the Davis era, which included victories against top-15 teams Auburn and Mississippi State to vault the Rebels into the national rankings for the first time in six years. Davis became the first Ole Miss head coach to win his first three SEC games. The Rebels ended the conference slate with a 10-8 mark, good enough for a tie for sixth in the standings. Davis was named SEC Coach of the Year by his peers and the Associated Press, earning conference coach of the year accolades for the ninth time in his career. He became the sixth Ole Miss coach to earn SEC Coach of the Year honors, while joining Andy Kennedy as the only Rebel coaches to collect the award in their first year in Oxford.Davis brought an excited brand of basketball to The Pavilion, as Ole Miss led the SEC in increased attendance for conference games (23.75 percent). The Rebels sold out five home games in his first year, exceeding the four sellouts combined over the first two and a half seasons in The Pavilion.Prior to returning to his home state, Davis guided Middle Tennessee to league titles in six of his last nine years in Murfreesboro, between Conference USA and the Sun Belt. Middle Tennessee was one of five programs he led to conference championships.Under Davis’ watch, Middle Tennessee made the 2013, 2016 and 2017 NCAA tournaments and defeated No. 2 seed Michigan State and No. 5 seed Minnesota in back-to-back seasons.With a 25-8 record in 2018, Middle Tennessee reached the 24-win mark for the sixth time in seven seasons, which in turn led to six postseason appearances during that period. The Blue Raiders won consecutive Conference USA regular season titles in Davis’ final two years, posting a 33-3 mark in C-USA play.Davis’ Blue Raiders posted a 31-5 record in 2017, including a 17-1 mark in Conference USA play, setting a school record for overall victories and a C-USA record for league wins. Middle Tennessee swept the conference regular season and tourney titles on its way to a second consecutive NCAA Tournament berth that saw them topple No. 5 seed Minnesota, 81-72, in Milwaukee.The Blue Raiders finished the 2016 season with a 25-10 mark and won their first Conference USA Tournament title just three years into their tenure. In the Big Dance, Davis led the Raiders to St. Louis as a No. 15 seed against Tom Izzo’s No. 2 seed and second-ranked Michigan State Spartans, directing one of the biggest upsets in NCAA Tournament history as the Blue Raiders captured a 90-81 win to move into the second round.Middle Tennessee was a giant killer under Davis, posting a 12-11 record against seven different Power 5 teams from 2012 through 2018. Over the final three seasons, the Blue Raiders boasted a 7-1 record against the SEC and Big Ten, including the two NCAA Tournament wins.Defense has long been a staple for Davis’ squads, as the Blue Raiders ranked top two in C-USA in scoring defense in each of his final four seasons. That style of play correlated to tremendous success on the road, including a 23-3 record away from home over his last two campaigns.With Davis’ emphasis on academics, Middle Tennessee was one of only six teams in 2017 and one of only seven in 2016 with a 100 percent graduation rate and also win an NCAA Tournament game that season – joining Kansas, Villanova, Duke, Notre Dame and Butler in both seasons as well as Iowa in 2016. Davis graduated 52 consecutive MT student-athletes that exhausted their eligibility.Davis excelled in ramping up fan support during his tenure as well, frequently surpassing season attendance marks while averaging a home crowd of nearly 7,000 in his final season. A Murphy Center attendance record of 11,807 was set for Western Kentucky in 2004, while 11,802 fans were on hand for the Tennessee game in 2009.Davis coached 25 all-conference players and five players of the year at Middle Tennessee and signed five top-25 recruiting classes, including the No. 11 class in 2004. He left Murfreesboro as the all-time winningest coach for both the school and the Sun Belt Conference.Before arriving at Middle Tennessee in 2002, Davis spent five seasons as the associate head coach at LSU under John Brady. With Davis assembling multiple top-five recruiting classes, the Tigers captured the SEC title in 2000 and reached the Sweet 16 for the first time in 13 years.In two tours of duty as Idaho head coach in 1997 and from 1989-90, Davis compiled a 63-29 record, the best three-year total in the program’s history, and earned NCAA Tournament berths in 1989 and 1990.Davis took the helm at Idaho before the 1989 season after two years as an assistant coach under Tim Floyd, and at the time, was the youngest Division I head coach in the nation at age 28. It was not the first time Davis had been the country’s youngest head coach. When he was hired as the head coach at Southwest Mississippi Community College in 1984, he became the youngest junior college coach in the nation at age 24. His youth served him well at Southwest Mississippi, as he put together a 39-20 record in two seasons. His 1986 squad won 22 games, posting the school’s first 20-win season in 17 years.After spending two seasons as the head coach at Idaho, Davis went on to become the head coach at Texas A&M for the 1991 campaign. From Texas A&M, Davis moved on to serve as associate head coach at Chipola Junior College for two seasons before ascending to the top spot for the 1994 campaign. During his season as the team’s head coach, Chipola finished the season ranked No. 4 in the national polls and posted a 27-5 record, giving the team the second-most wins in school history.From Chipola, Davis moved on to serve as associate head coach at Utah State from 1995-96. With the Aggies, Davis coached under Larry Eustachy, and the pair combined to win the Big West championship in 1995.The son of former Mississippi State head coach Kermit Davis Sr., the younger Davis played for the Bulldogs and graduated from MSU in 1982, before beginning his coaching career at his alma mater as a graduate assistant.He and his wife, Betty, have two daughters, Ally and Claire.Bachelor’s in Business Administration (1982) - Mississippi StateMaster of Arts in Teaching (1984) - Mississippi State2019 SEC Coach of the Year (league, AP)2019 Jim Phelan Award finalist (CollegeInsider.com)2017 TSWA Coach of the Year2017 NABC District 11 Coach of the Year2017 Conference USA Coach of the Year (league)2016 Daily News Journal Sportsperson of the Year2013 Sun Belt Coach of the Year (league, CollegeInsider.com)2012 NABC District 24 Coach of the Year2012 Sun Belt Coach of the Year (league, CollegeInsider.com)2010 Sun Belt Coach of the Year (CollegeInsider.com)2008 Sun Belt Coach of the Year (CollegeInsider.com)2003 Sun Belt Coach of the Year (league)1990 Big Sky Coach of the Year (league)1989 Big Sky Coach of the Year (league)- Nine seasons of 24 or more wins as a head coach- Nine-time conference coach of the year- Winningest head coach in Middle Tennessee history- Winningest head coach in Sun Belt conference history- Youngest Division I head coach in the nation at Idaho at age 28- Youngest junior college coach in the nation at Southwest Mississippi at age 24"}, {"url": "https://mtsusidelines.com/2017/11/15/mens-basketball-kermit-davis-continues-to-build-his-legacy-at-mtsu/", "page_content": "Photo by Devin P. Grimes / MTSU Sidelines\n\nWalking into Murphy Center is stepping into the house that Kermit Davis built.\n\nOn the walls in the foyer, murals of NCAA tournament victories capture the games’ biggest moments. Banners of past championships and tournament appearances hang from the ceilings. A wall that runs the length of the men’s basketball locker room lists all the accomplishments of the program’s history.\n\nDavis, head coach of men’s basketball at Middle Tennessee State University for 16 years, is currently building the program to become one of the top mid-major basketball schools in the nation.\n\nDavis has dedicated nearly 40 years of his life to the sport. The game was in his blood and couldn’t help but have an effect on his life and career. Davis was born in Leakesville, Mississippi, the son of Kermit Davis Sr., who was the head coach at Mississippi State University for seven years.\n\nDavis began his college basketball career as a player at a junior college for two years before transferring to Mississippi State. Following his graduation, Davis then became a graduate assistant there, which helped him prepare for his coaching opportunities to come.\n\n“I learned so much,” Coach Davis said. “I played for two really good coaches, Jim Hatfield and Bob Boyd, who was my coach as a senior.”\n\nDavis said he played sparingly at Mississippi State, and he learned more about how to be a coach as a player than a graduate assistant. However, Davis said the transition was easy because he’s always wanted to be a coach.\n\nDavis received his head coaching opportunity at a junior college before moving on to become an assistant at the University of Idaho. Eventually, Davis was promoted to head coach at Idaho in 1988 and became the youngest head coach at the NCAA Division I level.\n\nAfterwards, Davis spent seasons at Texas A&M as the head coach, and zt Utah State and Louisiana State University as an assistant coach before arriving at MTSU.\n\nCoach Davis moved to MTSU in 2002 and is now preparing to enter his 16th season at the helm. Davis found instant success in his new home at the glass house.\n\n“We had all looked at Middle Tennessee from afar and just the area, we thought it had a great chance,” Davis said. “The (former) athletic director, Boots Donnelly, was the reason I got involved. He was the ex-football coach, and one of my best friends, John L. Smith, knew Coach Donnelly, so he connected us.”\n\nThe Blue Raiders experienced four winning seasons in Davis’ first four years at MTSU. However, Davis and the Blue Raiders didn’t taste postseason play until 2010 in the College Insider Tournament. Only a few seasons later, Davis and the Blue Raiders hit their stride. In 2011, the Blue Raiders’ dominance began.\n\nDavis led the Blue Raiders to a 27-7 record for the 2011-12 season and a 28-6 season in 2012-13. They were named regular season champions in the Sunbelt Conference for both seasons.\n\nThe longtime coach is said to have changed the culture of MTSU basketball when he arrived on campus and is now reaping the long-term payoff.\n\n“We’ve had a lot of stability here, which has been good,” Davis said. “The main thing is, we’ve had an unbelievable, fun time watching it grow from way, way back.”\n\nThe Blue Raiders were in the Sun Belt Conference until the 2013 season when they migrated over to Conference USA. The Blue Raiders didn’t miss a beat with Davis’ guidance. In the first season in their new conference, the Blue Raiders finished atop the standings yet again with a 24-9 record and the arrival of Reggie Upshaw.\n\nUpshaw is a respected MTSU legend, and he helped Davis further the program’s success and stability. Davis and Upshaw captured the first conference tournament in MTSU history in 2016 and punched their ticket to the NCAA Tournament for the first time since 1989.\n\nMTSU was placed in the tournament as the 15th seed within their region. The Blue Raiders were major underdogs, facing the second-seeded Michigan State Spartans, who were favorites to win the national title. However, Davis willed his program and players to one of the most improbable upsets in college basketball history.\n\nThe Blue Raiders took down the Spartans 90-81, but were unable to move on further in the tournament after a loss to the Syracuse Orangemen in the second round.\n\nBut Davis and the Blue Raiders did not stop there. They returned the following season and outdid themselves and their prior season. Davis led the Blue Raiders to the best regular season record in program history (31-5), and the team dominated in conference play (17-1).\n\nDavis won his second consecutive conference championship and took his Blue Raiders to the NCAA tournament again where they surpassed the first round against the Minnesota Golden Gophers, but failed to move on past the second round once more.\n\nThe Blue Raiders lost Upshaw and one of the most productive transfers in MTSU history , JaCorey Williams, to graduation after the 2016-17 season. There was also speculation that Davis would not return to MTSU. Despite reports that he was being coveted for other head coaching jobs across the nation, Davis signed a new contract through 2024 to stay at MTSU this past offseason.\n\nDavis said the decision was an easy one because of two major factors.\n\n“Number one: quality of life. My wife and daughter love Murfreesboro as well as I do,” Davis said. “Number two: winning. The expectations of where we think we can take the program. When you equate all of that, I think I have one of the best jobs in college basketball.”\n\nDavis plans to continue to build the program and hopes for the MTSU brand to become recognizable across the nation. Davis has instilled a mentality and culture that has brought respect to the university from outsiders looking in.\n\n“The biggest thing about our culture is that we lost two great players like Reggie (Upshaw) and JaCorey (Williams), and the league still picks us to win the league,” Davis said. “I have great assistant coaches and great stability with that, too.”\n\nDavis, his staff and players will look to make a third consecutive NCAA tournament appearance while also striving to “three-peat” as C-USA champions.\n\n“Now you walk in the arena, there’s new hallways and equipment, but 16 years ago these walls were green. I went down my first week tearing stuff down,” Davis said. “All they had was bulletin boards. One night I came in late around 10 o’clock at night and tore down every bulletin board I could find. We secretly painted the walls just so we could start from scratch.”\n\nDavis understands there is more work to be done to achieve the expectations he has for MTSU basketball.\n\n“This arena and program has evolved. We’re not there yet, but it has been fun.”\n\nTo contact Sports Editor Rusty Ellis (@RustyEllis13), email sports@mtsusidelines.com.\n\nFor more sports stories, follow us on Facebook at MTSU Sidelines and on Twitter and Periscope at @Sidelines_Sport."}, {"url": "https://sports.yahoo.com/ole-miss-fires-mens-basketball-coach-kermit-davis-143709857.html", "page_content": "The Rebels are 2-13 in the SEC with three conference games to go\n\nKermit Davis and Ole Miss went 2-13 through the first 15 games of SEC play this season. (Photo by Matthew Maxey/Icon Sportswire via Getty Images)\n\nMississippi has made a men’s basketball coaching change.\n\nThe school announced Friday that Kermit Davis had been fired. Ole Miss is 10-18 overall and 2-13 in the SEC with three regular-season games to go.\n\n\"We thank Coach Davis for his dedication to the Ole Miss basketball program and our student-athletes,\" Ole Miss athletic director Keith Carter said in a statement. \"No one wanted to bring a title home to Mississippi more than him, and we appreciate the passion for that goal that he shared with our team every day. As he has throughout his career, Coach Davis worked tirelessly to produce a winner, and we wish him, Betty and his family the very best in the future.\"\n\nScroll to continue with content Ad ADVERTISEMENT\n\nDavis was hired at Ole Miss after the 2017-18 season after a long run at Middle Tennessee State. The Rebels made the NCAA tournament in his first season and were ranked as high as 18th in the AP Top 25. But Mississippi hasn’t made the NCAA tournament since and has finished above .500 just once in those succeeding seasons. Davis leaves Ole Miss with a career record of 74-79 at the school.\n\nThe Rebels were 13-19 a season ago and finished 4-14 in the SEC. Only Georgia had a worse record. But Davis stayed on as Mississippi’s coach as six teams in the conference hired new coaches in the offseason, including Missouri and Georgia, the teams directly next to Ole Miss in the 2021-22 standings.\n\nNow Ole Miss is the first SEC team to make a coaching change in 2022-23. Assistant coach Win Case will be the team's interim coach for the remainder of the season.\n\n\"My family and I are extremely thankful for the opportunity to lead the Ole Miss men's basketball program the past five years,\" Davis said. \"We appreciate Chancellor [Glenn] Boyce, Keith Carter, the staff and players for their support and work ethic on behalf of our program, and I wish Ole Miss the best going forward. Oxford is a special place to live and work.\"\n\nA Mississippi native and graduate of Mississippi State, Davis was at MTSU for nearly two decades before he came to Ole Miss. The Blue Raiders went 332-188 in his time with the school and won six regular-season conference titles. MTSU made three NCAA tournament appearances in Davis’ tenure and won 24 or more games on six different occasions."}, {"url": "https://www.mensbasketballhoopscoop.com/kermit-davis-basketball/", "page_content": "Kermit Davis Basketball Coach resurrects his career after being connected with Syracuse University NCAA issues in the 90’s.\n\nKermit Davis Basketball Coach knows that he has made some mistakes in his job that almost killed his coaching career and wound up putting two programs on NCAA probation. Coach Kermit Davis led his Blue Raiders against the Syracuse Orange in the second round of the 2017 NCAA Tournament. The Blue Raiders were everyone’s media darling after they beat Michigan State in the first round with a 90-81 win.\n\nThe Syracuse game is a reminder of one of his darkest moments in his coaching career. In 1990, Coach Kermit Davis was one of the up and coming basketball coaches in the country at the age of 30. He was the head men’s basketball coach at Texas A&M and had just finished a two-year stretch at Idaho that had them winning 50 games with just 12 losses. Coach Davis took Idaho to two NCAA Tournament appearances which never happens there.\n\nRight before Coach Davis got to Texas A&M, he met an NYC street agent named Rob Johnson. Johnson was controlling the transfer of Syracuse player Tony Scott. The Syracuse Post-Standard was looking into possible NCAA violations with Jim Boeheim and the Syracuse Program. That information led him to Kermit Davis.\n\nThe Syracuse Post-Standard found telephone records that had Johnson linked to Kermit Davis and his Texas A&M coaches as being an improper representative of the Syracuse basketball program. Johnson had them in contact with former SU player, Conrad McRae, Tony Scott, and other players too.\n\nThe NCAA investigators found that Texas A&M had improper contact and gave them two years probation, one-year NCAA tournament ban, and scholarship / recruiting restrictions. It was another example of a big program doing something wrong, so the NCAA slapped the little program carefully.\n\nKermit Davis Basketball Coach had to resign after his only one season at Texas A&M. It was his one big coaching break, and it only lasted one season. He was a rising star in the basketball coaching profession, and now he was an outcast.\n\nIt was 30 years ago that he got the job at Texas A&M and he made some real mistakes. It changed his life and his coaching career almost ended in College Station, Texas.\n\nClick on the pdf link to download the Kermit Davis Basketball Coach – 2017 Nike Clinic Notes:\n\n2017 Nike Clinic Notes\n\nLearn how he resurrected his basketball coaching career!\n\nHe started it over in a little town in Florida, Marianna which had 9000 population. It’s located in the panhandle where Florida, Alabama, and Georgia touch. Davis took an assistant job at Chipola Junior College. Davis was an assistant coach for two years and then got promoted to head coach where they went 27-5. He got hired as an assistant coach at Utah State. A couple of years later, Idaho gave him another chance to be their head coach.\n\nKermit Davis Basketball Coach spent one year at Idaho and then joined John Brady at LSU as an assistant coach. LSU is in the SEC and his father Kermit Davis Sr had been the head coach at Mississippi State for seven years when he was a youngster. It was a great move for him to be with a close friend at LSU. Coach Davis was an assistant coach for John Brady for five years and then got the associate head coach role. He had never been able to get another head coaching job in the NCAA, except at Idaho, because of the Texas A&M scandal.\n\nMiddle Tennessee came open in 2002, and they had an opening for head coach. Coach Davis tried to contact the Athletic Director / legendary football coach, Boots Donnelly. Coach Donnelly won’t call him back. Coach Davis had a friend that was the football coach at Louisville, John Smith. They had known each other for several years. Coach Smith called Kermit Davis to see if he would like to get involved in the MTSU job. Coach Davis said that the athletic director wouldn’t call him back.\n\nCoach Smith got off the phone with Coach Davis, and five minutes later, Boots Donnelly was calling Coach Davis. They met each other at the Final Four in Atlanta. They both connected well. Both coaches were old school, and Donnelly liked Davis. Coach Donnelly was never about his past and the stigma of hiring a coach with a NCAA history. Donnelly called Joe Biddle, Nashville sports columnist, to gauge what the media would think of the Davis hire.\n\nBiddle knew Kermit Davis’ history and his family in college basketball. Biddle told Donnelly that he should hire him and not worry. He said that if Kermit jaywalked that the NCAA would bury him and that Kermit Davis would be the cleanest hire that he could make.\n\nBoots Donnelly hired Davis, and it was one of the best hires in the history of the school. Davis has to lead the Blue Raiders to 12 winning seasons in his 14 years there. Davis got the Coach of the Year award in the Sun Belt Conference his first year and received it two more times in 2012 and 2013.\n\nThis year was the second trip to the NCAA Tournament in the Kermit Davis Basketball Coach era. Kermit Davis Basketball Coach could have had his career end in 1991 in College Station. He built his career back up from the bottom and learned all the way in his journey.\n\nHis trouble with the NCAA taught him to be a better person and a lot better coach, because of it.\n\nWhat is next for the Middle Tennesse Blue Raider program?\n\nThe men’s basketball program has been on the upswing over the past two years. They have won two Conference USA tournament championships, Regular Season Title, and two HUGE wins over Big Ten schools. Coach Kermit Davis is making this program go national now.\n\nIn 2016, They were the 15th seed in the NCAA Tournament and played Michigan State Spartans that had Denzel Valentine. Most media types thought that the Spartans should have been a one seed. The Blue Raiders were an 18 point underdog in the game. At one time, Tom Izzo called a timeout, the Blue Raiders were perfect from the floor and had a 15-2 lead on Michigan State. The Spartans cut the lead down but never came back, and Middle Tennessee shocked the world with a 90-81 win which was one of the biggest upsets in the NCAA Tournament."}, {"url": "https://olemisssports.com/sports/football/roster/coaches/kermit-davis/520", "page_content": "COACHING CAREER Year(s) School Position 2019-2023 Ole Miss Head Coach 2003-18 Middle Tennessee Head Coach 1998-2002 LSU Associate Head Coach 1997 Idaho Head Coach 1995-96 Utah State Associate Head Coach 1994 Chipola JC Head Coach 1992-93 Chipola JC Associate Head Coach 1991 Texas A&M Head Coach 1989-90 Idaho Head Coach 1987-88 Idaho Assistant Coach 1985-86 Southwest Mississippi CC Head Coach 1983-84 Mississippi State Graduate Assistant\n\nHEAD COACHING RECORD Year(s) School Record (Postseason) 2022-23 Ole Miss 10-18 2021-22 Ole Miss 13-19 2020-21 Ole Miss 16-12 (NIT First Round) 2019-20 Ole Miss 15-17 2018-19 Ole Miss 20-13 (NCAA First Round) 2017-18 Middle Tennessee 25-8 (NIT Second Round) 2016-17 Middle Tennessee 31-5 (NCAA Second Round) 2015-16 Middle Tennessee 25-10 (NCAA Second Round) 2014-15 Middle Tennessee 19-17 (CIT First Round) 2013-14 Middle Tennessee 24-9 2012-13 Middle Tennessee 28-6 (NCAA First Four) 2011-12 Middle Tennessee 27-7 (NIT Quarterfinals) 2010-11 Middle Tennessee 16-16 2009-10 Middle Tennessee 19-14 (CIT First Round) 2008-09 Middle Tennessee 18-14 2007-08 Middle Tennessee 17-15 2006-07 Middle Tennessee 15-17 2005-06 Middle Tennessee 16-12 2004-05 Middle Tennessee 19-12 2003-04 Middle Tennessee 17-12 2002-03 Middle Tennessee 16-14 1996-97 Idaho 13-17 1993-94 Chipola JC 27-5 (State Semifinals) 1990-91 Texas A&M 8-21 1989-90 Idaho 25-6 (NCAA First Round) 1988-89 Idaho 25-6 (NCAA First Round) 1985-86 Southwest Mississippi CC 22-11 1984-85 Southwest Mississippi CC 17-9 Totals 27 seasons 543-342 (.614) Division I 25 seasons 477-317 (.601) at Ole Miss 5 seasons 74-79 at Middle Tennessee 16 seasons 332-188 (winningest coach in program history) at Texas A&M 1 season 8-21 at Idaho 3 seasons 63-29\n\nKermit Davis spent five seasons at the helm of Ole Miss Basketball. A nine-time conference coach of the year, Davis left the Rebels 29th among active Division I head coaches with 477 career wins over 25 seasons, including stints at Middle Tennessee, Idaho and Texas A&M. In 28 seasons as a college basketball head coach, he amassed 543 wins.Davis coached four all-conference players during his four seasons in Oxford, including a trio of First Team All-SEC guards. Devontae Shuler was the latest Rebel to finish his collegiate career with First Team All-SEC honors along with winning the C Spire Howell Trophy as the best men’s basketball player in the state of Mississippi. Prior to Shuler, Breein Tyree earned first team accolades in back-to-back seasons (2018-19, 2019-20). Tyree’s game blossomed in Davis’ system, ranking in the conference’s top three in scoring as a junior (third-17.9 ppg) and as a senior (second-19.7 ppg). Current Sacramento King Terence Davis also found success under his new head coach as a senior (2018-19) before becoming the first Rebel in more than a decade to play in the NBA.Davis took Ole Miss to new heights in recruiting, signing the No. 12 class in the nation for the 2022-23 season (per ESPN), as well as the two highest ranked recruits in program history at the time. Matthew Murrell broke the record first as part of the 2020 class before 2021 Mississippi Gatorade Player of the Year Daeshun Ruffin became Ole Miss’ top rated recruit. Ruffin also became the first McDonald’s All-American to sign with the Rebels out of high school. Both cracked the top-40 nationally when they signed to continue their careers at Ole Miss.Murrell and Ruffin had breakout seasons in 2021-22 under Davis, a year in which the Rebels notched two more AP Top-25 victories -- their fifth within a calendar year. Ole Miss tied a program record with its fourth-straight top-25 win after the Rebels took down No. 18 Memphis, 67-63, in front of a sellout crowd at SJB Pavilion on Dec. 4. That streak dated back to the previous season after the Rebels took down No. 10 Tennessee (52-50), No. 10 Missouri (80-59) and No. 24 Missouri (60-53) in the February of 2021. Ole Miss added a fifth AP Top-25 win in the span of a calendar year after a thrilling 76-72 victory at No. 25 LSU on Feb. 1, 2022, the first Rebel win in Baton Rouge since March 9, 2013.After being the last team from a Power 5 conference to start the 2020-21 season due to a COVID-19 outbreak within the program, Davis’ Rebels made a late season run that nearly resulted in an NCAA Tournament berth. Boasting the SEC’s best scoring defense, allowing only 65.4 ppg, the Rebels won 10 of their final 13 games. Two of those victories were over top-10 teams. Ole Miss finished the season 3-0 against top-25 opponents, one of only four teams to go undefeated versus ranked teams during the 2020-21 campaign. Just missing out on March Madness, the Rebels received a No. 1 seed in the NIT to make their second postseason. While Shuler led the way as a First Team All-SEC guard, graduate transfer Romello White made an impact in his only season by setting the school record for field goal percentage in a single season (64.9 percent).During his second season, Davis earned his 500th career win as a head coach. With defense a common emphasis to his teams, Ole Miss finished the 2020 season ranked 15th nationally in three-point field goal percentage defense (29.2). The 2019-20 campaign was highlighted by a comeback victory over Penn State in the NIT Tip-Off, in which the Rebels trailed by as many as 21 points in the second half, and a 25-point victory over rival Mississippi State. The win over the Bulldogs was Ole Miss’ fifth-largest margin of victory in the SEC’s most-played rivalry.After leading Middle Tennessee to conference championships and NCAA Tournament runs, the Leakesville, Mississippi, native returned to his home state as the 22nd permanent head coach of the Ole Miss basketball program, as announced on March 15, 2018.Davis wasted no time making an impact in Oxford. With the Rebels coming off a last-place finish in 2017-18, the media picked Ole Miss to land at the bottom of the SEC standings again in 2018-19. However, Davis led one of the biggest turnaround seasons in the nation. Behind the play of All-SEC guards Tyree (first team) and Terence Davis (second team), the Rebels posted a 20-13 record to earn a spot in the NCAA Tournament for the first time in four years. With a return to March Madness for the sixth time in his career, Davis joined a list of 63 coaches in college basketball history to take three different schools to the NCAA Tournament.Ole Miss won 13 of its first 15 games to begin the Davis era, which included victories against top-15 teams Auburn and Mississippi State to vault the Rebels into the national rankings for the first time in six years. Davis became the first Ole Miss head coach to win his first three SEC games. The Rebels ended the conference slate with a 10-8 mark, good enough for a tie for sixth in the standings. Davis was named SEC Coach of the Year by his peers and the Associated Press, earning conference coach of the year accolades for the ninth time in his career. He became the sixth Ole Miss coach to earn SEC Coach of the Year honors, while joining Andy Kennedy as the only Rebel coaches to collect the award in their first year in Oxford.Davis brought an excited brand of basketball to The Pavilion, as Ole Miss led the SEC in increased attendance for conference games (23.75 percent). The Rebels sold out five home games in his first year, exceeding the four sellouts combined over the first two and a half seasons in The Pavilion.Prior to returning to his home state, Davis guided Middle Tennessee to league titles in six of his last nine years in Murfreesboro, between Conference USA and the Sun Belt. Middle Tennessee was one of five programs he led to conference championships.Under Davis’ watch, Middle Tennessee made the 2013, 2016 and 2017 NCAA tournaments and defeated No. 2 seed Michigan State and No. 5 seed Minnesota in back-to-back seasons.With a 25-8 record in 2018, Middle Tennessee reached the 24-win mark for the sixth time in seven seasons, which in turn led to six postseason appearances during that period. The Blue Raiders won consecutive Conference USA regular season titles in Davis’ final two years, posting a 33-3 mark in C-USA play.Davis’ Blue Raiders posted a 31-5 record in 2017, including a 17-1 mark in Conference USA play, setting a school record for overall victories and a C-USA record for league wins. Middle Tennessee swept the conference regular season and tourney titles on its way to a second consecutive NCAA Tournament berth that saw them topple No. 5 seed Minnesota, 81-72, in Milwaukee.The Blue Raiders finished the 2016 season with a 25-10 mark and won their first Conference USA Tournament title just three years into their tenure. In the Big Dance, Davis led the Raiders to St. Louis as a No. 15 seed against Tom Izzo’s No. 2 seed and second-ranked Michigan State Spartans, directing one of the biggest upsets in NCAA Tournament history as the Blue Raiders captured a 90-81 win to move into the second round.Middle Tennessee was a giant killer under Davis, posting a 12-11 record against seven different Power 5 teams from 2012 through 2018. Over the final three seasons, the Blue Raiders boasted a 7-1 record against the SEC and Big Ten, including the two NCAA Tournament wins.Defense has long been a staple for Davis’ squads, as the Blue Raiders ranked top two in C-USA in scoring defense in each of his final four seasons. That style of play correlated to tremendous success on the road, including a 23-3 record away from home over his last two campaigns.With Davis’ emphasis on academics, Middle Tennessee was one of only six teams in 2017 and one of only seven in 2016 with a 100 percent graduation rate and also win an NCAA Tournament game that season – joining Kansas, Villanova, Duke, Notre Dame and Butler in both seasons as well as Iowa in 2016. Davis graduated 52 consecutive MT student-athletes that exhausted their eligibility.Davis excelled in ramping up fan support during his tenure as well, frequently surpassing season attendance marks while averaging a home crowd of nearly 7,000 in his final season. A Murphy Center attendance record of 11,807 was set for Western Kentucky in 2004, while 11,802 fans were on hand for the Tennessee game in 2009.Davis coached 25 all-conference players and five players of the year at Middle Tennessee and signed five top-25 recruiting classes, including the No. 11 class in 2004. He left Murfreesboro as the all-time winningest coach for both the school and the Sun Belt Conference.Before arriving at Middle Tennessee in 2002, Davis spent five seasons as the associate head coach at LSU under John Brady. With Davis assembling multiple top-five recruiting classes, the Tigers captured the SEC title in 2000 and reached the Sweet 16 for the first time in 13 years.In two tours of duty as Idaho head coach in 1997 and from 1989-90, Davis compiled a 63-29 record, the best three-year total in the program’s history, and earned NCAA Tournament berths in 1989 and 1990.Davis took the helm at Idaho before the 1989 season after two years as an assistant coach under Tim Floyd, and at the time, was the youngest Division I head coach in the nation at age 28. It was not the first time Davis had been the country’s youngest head coach. When he was hired as the head coach at Southwest Mississippi Community College in 1984, he became the youngest junior college coach in the nation at age 24. His youth served him well at Southwest Mississippi, as he put together a 39-20 record in two seasons. His 1986 squad won 22 games, posting the school’s first 20-win season in 17 years.After spending two seasons as the head coach at Idaho, Davis went on to become the head coach at Texas A&M for the 1991 campaign. From Texas A&M, Davis moved on to serve as associate head coach at Chipola Junior College for two seasons before ascending to the top spot for the 1994 campaign. During his season as the team’s head coach, Chipola finished the season ranked No. 4 in the national polls and posted a 27-5 record, giving the team the second-most wins in school history.From Chipola, Davis moved on to serve as associate head coach at Utah State from 1995-96. With the Aggies, Davis coached under Larry Eustachy, and the pair combined to win the Big West championship in 1995.The son of former Mississippi State head coach Kermit Davis Sr., the younger Davis played for the Bulldogs and graduated from MSU in 1982, before beginning his coaching career at his alma mater as a graduate assistant.He and his wife, Betty, have two daughters, Ally and Claire.Bachelor’s in Business Administration (1982) - Mississippi StateMaster of Arts in Teaching (1984) - Mississippi State2019 SEC Coach of the Year (league, AP)2019 Jim Phelan Award finalist (CollegeInsider.com)2017 TSWA Coach of the Year2017 NABC District 11 Coach of the Year2017 Conference USA Coach of the Year (league)2016 Daily News Journal Sportsperson of the Year2013 Sun Belt Coach of the Year (league, CollegeInsider.com)2012 NABC District 24 Coach of the Year2012 Sun Belt Coach of the Year (league, CollegeInsider.com)2010 Sun Belt Coach of the Year (CollegeInsider.com)2008 Sun Belt Coach of the Year (CollegeInsider.com)2003 Sun Belt Coach of the Year (league)1990 Big Sky Coach of the Year (league)1989 Big Sky Coach of the Year (league)- Nine seasons of 24 or more wins as a head coach- Nine-time conference coach of the year- Winningest head coach in Middle Tennessee history- Winningest head coach in Sun Belt conference history- Youngest Division I head coach in the nation at Idaho at age 28- Youngest junior college coach in the nation at Southwest Mississippi at age 24"}, {"url": "https://bleacherreport.com/articles/2765671-kermit-davis-says-ole-miss-basketball-will-respect-flag-national-anthem", "page_content": "Mark Humphrey/Associated Press\n\nAt his introductory press conference on Monday, Mississippi head basketball coach Kermit Davis said his team won't participate in protests during the national anthem.\n\nPer Rob Dauster of NBC Sports, Davis had this response when asked about how he was going to run his program:\n\n“What is Ole Miss Basketball going to look like? It’s going to be relentless, athletic, explosive, a team that’s going to have to play on and on and on to beat. It’s going to be a team that’s going to be unselfish. We’re going to play fast and smart in transition. We’re going to try to get easy baskets. We’re going to try to play with great body language. We’re going to be a respectful team that respects the flag and the National Anthem. All those things from culture is what we’re about. It’s who we’re going to be.”\n\nWhile players taking a knee during the national anthem was a frequent topic of discussion in the NFL, it wasn't common practice in college basketball.\n\nThe most high-profile kneeling in college basketball involved nearly half of the Vanderbilt women's team during an Oct. 29 exhibition against Marian University.\n\nThe College of Coastal Georgia, which plays in the NAIA, also had men's and women's basketball players kneel during the national anthem. One member of the school's board of trustees resigned in November to protest the players' choice.\n\nDavis was hired by Ole Miss to take over the program after Andy Kennedy resigned in February. The 58-year-old has spent the past 16 seasons at Middle Tennessee where he led the Blue Raiders to three NCAA tournament appearances, including an upset of No. 2 Michigan State in 2016."}, {"url": "https://www.clarionledger.com/story/sports/college/ole-miss/2018/03/15/what-know-what-said-ole-miss-hire-kermit-davis/427640002/", "page_content": "OXFORD — Kermit Davis is officially Ole Miss' men's basketball coach.\n\nAfter heavy speculation the past week or so, the university announced Davis' hire Thursday morning. Davis is the 22nd head coach in Rebels history and comes to Oxford with five NCAA Tournament appearances under his belt, spanning from his time at Idaho to his current position at Middle Tennesse State.\n\nSource:Kermit Davis expected to be named Ole Miss' next men's basketball coach\n\nThe move brings an end to a coaching search which lasted a month and began when Andy Kennedy stepped down in February.\n\nRoss Bjork's statement: \"After assessing the entire landscape of college basketball and speaking to basketball experts across the country to determine the greatest fit for Ole Miss Basketball, the answer was clear: Kermit Davis is the best coach and best leader to take our program to the next level in the SEC and NCAA.\"\n\nBjork also highlighted Davis' \"energy, drive and vision\" for Ole Miss' program. Davis will be introduced during a press conference at Ole Miss at 5:30 p.m. Monday.\n\nDavis' statement: \"I'm incredibly honored and excited to be the basketball coach at the University of Mississippi. We are extremely grateful to Chancellor (Jeff) Vitter and Ross for giving me the opportunity to lead such a prestigious program in the best basketball league in America. Coming back to my home state of Mississippi to build a national brand is absolutely a dream come true for us. I am Mississippi made and cannot wait to join the rest of the Ole Miss family.\"\n\nKellenberger:Hiring Kermit Davis is OK, but it doesn't change Ole Miss basketball\n\nAccording to a source, Davis is expected to bring two Middle Tennesse State assistants, Ronnie Hamilton and Win Case, with him to Oxford. The Blue Raiders are still alive in the NIT.\n\nOn Tuesday night, MTSU beat Vermont, 91-64, in the opening round of the tournament. Now it prepares to face Louisville on the road at 5:30 p.m. Sunday.\n\nDavis led the Blue Raiders to the NCAA Tournament the previous two seasons, and three times in his 16-year tenure. He's also won seven league titles between the Sun Belt and Conference USA the past nine seasons.\n\nChris Massaro, MTSU athletic director, in a statement on Davis: \"There have been some watershed moments that will always be embedded in our school's history during his time as head coach of the Blue Raiders.\n\n\n\n\"Speaking on behalf of the entire Blue Raider family, we will all miss Kermit and his family immensely. Ole Miss has made a great hire, and I know they will do well.\"\n\nStory continues after gallery\n\nDavis will coach Middle Tennessee State through the entirety of its NIT run. In their press release on Davis, the Blue Raiders announced they have begun a national search for his replacement.\n\nSouthern Miss coach Doc Sadler, who coached against Davis the past few seasons and essentially knocked the Blue Raiders out of the NCAA Tournament picture earlier this month: \"The thing that you knew playing Kermit's team was that they're going to be so well-prepared. They were going to do what they wanted him to do and you were going to have to play awfully well, make some shots to have a chance to win. I don't think there's any greater compliment than to have total respect from your peers. Fans and all that stuff are one thing, but to have respect from your peers is the ultimate compliment. That's something Kermit has.\""}, {"url": "https://www.oxfordeagle.com/2018/03/15/5-things-know-ole-miss-basketball-coach-kermit-davis/", "page_content": "5 things to know about Ole Miss basketball coach Kermit Davis Published 9:58 am Thursday, March 15, 2018\n\nOle Miss on Thursday ushered in a new era in men’s basketball with the hiring of Kermit Davis.\n\nDavis, who takes over for the school’s all-time winningest coach in Andy Kennedy, spent the previous 16 years at Middle Tennessee State, building the Blue Raiders into one of the nation’s top mid-major programs. Davis went 332-187 at MTSU and led the Blue Raiders to five regular-season conference championships and three NCAA Tournaments, the most recent trip coming in 2017.\n\nHere are five things to know about the Rebels’ new coach:\n\nEmail newsletter signup\n\nBack at home\n\nComing to Ole Miss means a return to where it all started for Davis, a Mississippi native who grew up in Leakesville and played at Mississippi State. Davis’ first college coaching job came as a graduate assistant for the Bulldogs during the 1983-84 season before he got his first crack as a head coach at Southwest Mississippi Community College in Summit.\n\nHis father, Kermit Sr., coached Mississippi State in the 1970s.\n\nVeteran in the game\n\nDavis’ coaching career spans more than three decades and eight stops, including two stints as the head coach at Idaho (1988-90; 1996-97) and a cup of coffee as Texas A&M’s coach during the 1990-91 season. Other stops as an assistant have included Chipola Junior College (one season as the head coach), Utah State and LSU.\n\nDavis won a pair of Big Sky regular-season and tournament championships during his first stint at Idaho and has earned Coach of the Year honors in three different conferences (Big Sky, Sun Belt, Conference USA).\n\nCareer resurrection\n\nDavis resigned after his only season at Texas A&M because of recruiting violations involving former Syracuse transfer Tony Scott that resulted in sanctions for the school and a two-year show-cause penalty for Davis, who, at 30 years old, was the youngest Division I coach at the time.\n\nDavis ended up at Chipola JC before returning to the Division I level as an assistant at Utah State in 1996. He went on to spend five seasons on John Brady’s staff at LSU before MTSU made him their head coach in 2002. Davis hasn’t had any run-ins with the NCAA since.\n\nDefense, defense, defense\n\nMTSU’s rise under Davis was due in large part to an amoeba 1-3-1 half-court defense, which is designed to use his players’ length and athleticism to trap ballhandlers once they cross half court and force lob passes over the top of the zone, making it more difficult for teams to get into their half-court sets and avoid turnovers. Davis goes into further detail about his defense in this video.\n\nThe Blue Raiders rank 28th nationally in points allowed per game, 12th in 3-point field-goal percentage defense and 33rd in adjusted defensive efficiency this season, according to KenPom.com. By contrast, Ole Miss is 163rd in adjusted defensive efficiency and was among the SEC’s worst in scoring defense, field-goal percentage defense and 3-point field-goal percentage defense.\n\nBig-boy success\n\nIn order to beef up a slate that was usually light in terms of Conference USA competition, MTSU often scheduled games against Power Five programs in the non-conference under Davis. And the Blue Raiders usually won them.\n\nTeams such as UCLA, Cincinnati, Southern Cal, Miami, Florida, Vanderbilt, Auburn and Ole Miss have appeared on the Blue Raiders’ schedule the last handful of years. Of course, the Blue Raiders sent shockwaves through the college basketball world in the 2016 NCAA Tournament with their 15-2 upset of perennial power Michigan State before following it up with a win over fifth-seeded Minnesota in last year’s tournament.\n\nOne of MTSU’s seven losses this season came against Auburn — the Blue Raiders’ only loss in their last eight games against SEC and Big Ten competition — but Ole Miss knows about Davis’ success against high-major programs as well as anybody. MTSU has won the last four meetings between the teams, including a 15-point victory in Oxford last season and a 19-point throttling in Murfreesboro back in December."}], "Kermit Davis led a first-round upset of Michigan State in 2016.": [{"url": "https://www.espn.com/blog/collegebasketballnation/post/_/id/113056/middle-tennessee-state-shocks-the-world-but-not-itself-by-beating-michigan-state", "page_content": "Middle Tennessee coach Kermit Davis and F Reggie Upshaw recap their 90-81 win over Michigan State, as the Blue Raiders become the eighth 15 seed to defeat a 2 seed in the NCAA tournament. (3:14)\n\nMiddle Tennessee's Upshaw: We were ready to lay it all out on the line (3:14)\n\nST. LOUIS –- The small but boisterous Middle Tennessee cheering section started yelling \"Biggest upset ever!\" as the Blue Raiders ran off the Scottrade Center court Friday.\n\nIt was hard to argue the point. The No. 15 seed had just knocked off No. 2 seed Michigan State 90-81 in quite probably the most earth-rattling first-round game ever. While seven other 15th-seeded teams had registered wins in the NCAA tournament, none of them did so over the wise-guy favorite to claim the national championship, as the Spartans had been.\n\nFor an upset so large, however, the Blue Raiders remained relatively subdued afterward. They didn't jump on the scorers table. Their coach didn't dance (though Kermit Davis is an excellent dancer). Their postgame comments and tone could have been confused for a regular-season Conference USA victory, if you didn't know better.\n\nMiddle Tennessee expected to win all along, which made this upset even more remarkable.\n\nJaqawn Raymond (10) said he wasn't surprised at all that Middle Tennessee upset Michigan State. AP Photo/Charlie Riedel\n\n\"We're not surprised at all,\" senior guard Jaqawn Raymond said. \"We knew, if we just played our game, what the outcome would be.\"\n\nIt might have been nice if they had let the rest of America know beforehand, since 97.8 percent of all brackets submitted on ESPN.com picked Michigan State to survive the first round. But at least they served notice right from the opening tipoff on how this game would go, racing out to -- and how poetic is this -- a 15-2 lead.\n\nThe Blue Raiders would never trail, and even as Michigan State threatened again and again to tie the score or take the lead in the second half, Middle Tennessee calmly kept answering with big plays. This was a Cinderella that acted like the Big Bad Wolf, constantly attacking and never panicking.\n\n\"All my teammates, including myself, we weren't scared of the moment,\" forward Perrin Buford said.\n\nWhat created this confidence, especially against a program that usually owns the month of March? It helps that Middle Tennessee has veteran players, such as seniors Buford and Darnell Harris and junior Reggie Upshaw Jr. The players bonded on a preseason trip to the Bahamas and while winning the Great Alaska Shootout in November. Davis has been at the school for 14 years, building a culture and a system.\n\nThe season's turning point, though, came after a 78-72 home loss to Western Kentucky on Feb. 25. Leading scorer Giddy Potts suffered a concussion during that game and couldn't play on Feb. 27 against Marshall. The Blue Raiders had no choice but to come together; they beat the Thundering Herd 83-74 and went on to win the C-USA tournament two weeks later.\n\n\"That loss really touched us,\" Buford said. \"We just told each other, 'Hey, we've got each other's back and let's do this now.' And that's what we've been doing ever since.\"\n\nPlaying Tournament Challenge? Don't forget to check your brackets! Bracket busted? We have you covered with a Second Chance Bracket!\n\nDavis drew up a perfect game plan against Michigan State, switching every screen on defense and having his team push the pace after made baskets. The Blue Raiders knew they could beat the Spartans off the bounce, and they lived through a dream shooting night (56 percent from the field, 58 percent from the 3-point line) in which their misses often circled the rim.\n\n\"I haven't seen that my whole career, much less an NCAA tournament game,\" a bleary-eyed Michigan State coach Tom Izzo said of Middle Tennessee's offensive tour de force.\n\nThe Blue Raiders also pressured Denzel Valentine into six turnovers, and dared other Spartans to beat them. Upshaw said the team had its best practices of the season in the days after Selection Sunday.\n\n\"We were so well prepared,\" assistant coach Win Case said. \"We knew every single thing that [Michigan State] did, from their man defense to the zone.\"\n\nMichigan State's best chance to make Middle Tennessee wobble came at the final media timeout. The Spartans had cut the lead to three points and had two free throws coming up. But the underdog would still not cower.\n\n\"We looked at each other, and said, 'Let's enjoy this. Let's have fun right here,' \" Davis said. \"And I think they just played relaxed and real confident.\"\n\nThe Blue Raiders would outscore the Spartans 14-2 over the final three-and-a-half minutes, capped by Upshaw's dunk and bicep flex in the closing seconds to erase all doubt. The school most people couldn't locate on a map had changed the entire geography of this tournament bracket.\n\n\"The majority of people don't know where Middle Tennessee is,\" Raymond said. \"Most people know where Nashville is, but they don't know Murfreesboro. They're going to know after tonight.\"\n\nRaymond said that more matter-of-factly than through giddiness. Players like Potts talked about \"unfinished business\" and turned their attention to Sunday's unexpected second-round matchup against Syracuse. This was not a locker room full of wide-eyed disbelief.\n\n\"It wasn't over-jubilation, which I liked,\" Davis said. \"I thought our guys handled themselves well.\"\n\nThey handled themselves like a team that expected to beat Michigan State, even when no one else thought they could."}, {"url": "https://www.espn.com/mens-college-basketball/story/_/id/22838525/mississippi-introduces-kermit-davis-coach", "page_content": "OXFORD, Miss. -- Kermit Davis was comfortable at Middle Tennessee, but after 16 seasons he was ready for the challenge of leading a program in the Southeastern Conference.\n\nThe 58-year-old has been given that opportunity at Mississippi, where he was introduced as coach on Monday. The introduction came less than 24 hours after Middle Tennessee fell to Louisville in the second round of the National Invitation Tournament.\n\n\"It was just one of those things that I knew it was the right place for me,\" Davis said.\n\nDavis, a native of Leakesville, Mississippi, replaces Andy Kennedy, who coached Ole Miss for 12 seasons and was the winningest coach in program history before he resigned with two weeks left in a disappointing season.\n\nDavis will earn a base salary of $2.5 million annually on a four-year contract, which is the longest allowed by state law. He can earn incentives for accomplishments like boosting average attendance and conference championships.\n\nMiddle Tennessee became one of the best mid-majors in the nation under Davis' guidance. In his 11th season, Davis led the Blue Raiders back to the NCAA tournament after a 12-year absence. The Blue Raiders had upset wins in the NCAA tournament in both 2016 and 2017, beating Michigan State and Minnesota, respectively.\n\nHe is taking over a program at Ole Miss that last made the tournament in 2015. Ole Miss is coming off a 12-20 season and finished last in the SEC with a 5-13 record.\n\n\"We're not going to have eight or nine years [of rebuilding] here,\" Davis said. \"We've got to improve those [returning] guys. There's talent in that locker room. We've got to individually get their development to go up.\"\n\nMaybe the most notable portion of Davis' contract is the bump in assistant pay. The salary pool Davis will have to work with has been pushed to $900,000, and two of those positions have already been filled.\n\nMiddle Tennessee assistants Win Case and Ronnie Hamilton will come with Davis to Ole Miss. Davis said the third assistant position could be filled by a current member of the Ole Miss staff or he could open up the spot for a national search.\n\nDavis has some experience in the SEC. He was the associate head coach at LSU for five seasons under then-coach John Brady before taking the Middle Tennessee job in 2002.\n\nDavis' father, also named Kermit Davis, coached at Mississippi State from 1970-1977. Davis played for the Bulldogs and served as a graduate assistant there.\n\n\"Nobody wants to beat Mississippi State's tail more than Kermit Davis,\" Davis said."}, {"url": "https://mtsusidelines.com/2016/03/18/kermit-davis-i-thought-about-my-dad/", "page_content": "Photo by Sarah Grace Taylor // Managing Editor\n\nIt was the biggest win for Middle Tennessee in school history.\n\nMTSU became the eighth No. 15 seed to beat a No. 2 seed, defeating Michigan State 90-81 at the Scottrade Center.\n\nPrior to the win, the Blue Raiders had an all-time record of 0-22 against top-ten ranked teams, and hadn’t beaten a Big Ten opponent since Michigan back in 1986.\n\nThe last team to upset Michigan State in the first round (George Mason, 2006) went on a run to the Final Four.\n\nEven with a monumental upset by MTSU head coach Kermit Davis and his Blue Raiders, something more important came across his mind after the final buzzer.\n\n“You know, I thought about my dad because he couldn’t be here. He’s got a little touch of pneumonia and he’s 80,” Davis explained. “My mother couldn’t come, too. I looked straight across and my wife and Betty and Claire and Ally and my brother and sister were here, along with some good pals. Just a lot of things that go through it, families and the coaches’ wives.\n\n“And I felt a tremendous joy for Murfreesboro and Middle Tennessee State University.”\n\nDavis’ father, Kermit Davis, Sr., was once a head coach as well, with the same roots at Mississippi State University.\n\nThe elder Davis was the head coach at Mississippi State for seven seasons, being named SEC coach of the year in the 1971 season.\n\nAlso in attendance was Davis’ daughter, Ally Davis, who attends almost every MTSU game.\n\n“She’s something,” Davis said with a smile. “My oldest daughter, Ally, is 28 and has Down Syndrome. She was born when I was an assistant coach at the University of Idaho working with Tim Floyd. So Ally puts everything, trust me, into perspective. She keeps us right on our toes all the time.”\n\nMuch like any game inside the Murphy Center, Ally’s presence calmed Kermit Davis and MTSU on its biggest stage.\n\n“It was so funny. We’re fixing to play the game… and Ally has to eat at every game,” Davis said. “They’re sitting right across [from me], and walking down the steps. And about 30 seconds before tip-off, I saw [Ally] walking down the steps with her pizza. She was more worried about getting something to eat at lunch. But it kind of puts a calmness to you.\n\n“And she’ll look forward to a really big hug, that’s for sure.”\n\nFor more sports stories, follow us at www.mtsusidelines.com, on Facebook at MTSU Sidelines and on Twitter at @Sidelines_Sport.\n\nTo contact Sports Editor Connor Grott, email sports@mtsusidelines.com or follow him on Twitter at @Connor_Grott."}, {"url": "https://apnews.com/article/andy-enfield-oral-roberts-golden-eagles-mens-basketball-coaching-basketball-march-madness-d9da692c60ac7d587158855c5345b530", "page_content": "Oral Roberts head coach Paul Mills looks on during the second half of a first-round game against Ohio State in the NCAA men's college basketball tournament, Friday, March 19, 2021, at Mackey Arena in West Lafayette, Ind. Oral Roberts won in overtime. (AP Photo/Robert Franklin)\n\nOral Roberts head coach Paul Mills looks on during the second half of a first-round game against Ohio State in the NCAA men's college basketball tournament, Friday, March 19, 2021, at Mackey Arena in West Lafayette, Ind. Oral Roberts won in overtime. (AP Photo/Robert Franklin)\n\nINDIANAPOLIS (AP) — Dunk City’s thrilling NCAA Tournament run as a No. 15 seed in 2013 gave a rocket-boost to Andy Enfield’s coaching career that landed him at USC after just two seasons with Florida Gulf Coast.\n\nWhen 15th-seeded Hampton shocked Iowa State in 2001, the image of Steve Merfeld celebrating — arms and legs extended, lifted off the floor by one of his players — became one of the lasting images of March Madness. Merfeld’s time at Hampton lasted one more season before he jumped to a bigger job.\n\nIn 2016, Kermit Davis led 15th-seeded Middle Tennessee to an upset of No. 2 seed Michigan State in his 14th season with the Blue Raiders. Two seasons later, Davis jumped from Conference USA to the Southeastern Conference and became coach at Mississippi.\n\nA bracket-busting NCAA Tournament victory can change the trajectory of a coach’s career. With a 75-72 overtime stunner of second-seeded Ohio State on Friday, Oral Roberts coach Paul Mills’ stock likely went soaring.\n\nOral Roberts became just the ninth No. 15 seed to beat a No. 2 since the tournament expanded to 64 teams in 1985.\n\n“Once the buzzer went off, it’s more a feeling of relief, probably, than anything else,” Mills said.\n\nFour of the last five coaches to win in the NCAA Tournament with a No. 15 seed jumped to another job in a bigger conference within three seasons of their big win.\n\nMills, a former Baylor assistant under Scott Drew, is in his fourth season at Oral Roberts. The Golden Eagles have made steady improvement during his tenure, reaching the NCAA Tournament for the first time since 2008.\n\nBut their first tournament victory since 1974 made Oral Roberts and its 48-year-old coach the biggest story in sports for at least a day.\n\n“Paul Mills to many of us was an outstanding coach four hours ago,” ESPN analyst and former college coach Fran Fraschilla said. “But the fact that he’s knocked off Ohio State the way Oral Roberts did has given him great currency.\n\n“A win like this validates Paul Mills not only with the general public, but it validates him with his peers. It validates him with basketball fans and it validates him, unfortunately for Oral Roberts, with the next AD thinking of hiring a guy like Paul.”\n\nMills wasn’t the only former Baylor assistant to Drew to make a mark on the first day of the first round: No. 13 seed North Texas and fourth-year coach Grant McCasland also beat a Big Ten power in overtime, knocking off fourth-seeded Purdue.\n\n“It does open up an unbelievable amount of opportunity because it’s instant equity, a win like that and an upset like that in the NCAA Tournament,” former Nebraska coach Tim Miles said.\n\nMerfeld had Hampton back in the tourney as Mid-Eastern Athletic Conference champs the season after that memorable win against Iowa State. The next year, he landed at Evansville in the Missouri Valley, but it never quite clicked there and he was let go after five losing seasons.\n\nIn 2012, two No. 15s advanced out of the first round. Lehigh stunned Duke with future NBA star C.J. McCollum and Norfolk State bounced Missouri.\n\nAnthony Evans spent one more season as Norfolk State coach in the MEAC before becoming head coach at Florida International in Conference USA. Five losing seasons later, he was out. Lehigh coach Brett Reed stayed put and just finished his 14th season at the school.\n\nNo coach has parlayed an unexpected star turn in March into a meteoric rise like Enfield. Florida Gulf Coast’s “Dunk City” team in 2013 became the first 15 seed to reach the Sweet 16.\n\nAfter just 69 games as a college head coach, Enfield went from making $157,000 per year in the Atlantic Sun Conference to a Pac-12 job with an annual salary of well over $1 million.\n\n“It’s a lot easier to hire a hot name out of the NCAA Tournament and if he doesn’t work out the athletic director can always say, ‘Look, we thought we were hiring a superstar based on what he did at X school,’” Fraschilla said.\n\nThe Trojans are in the NCAA Tournament this season for the third time in eight seasons under Enfield, a No. 6 seed facing Drake on Saturday afternoon.\n\nDavis was the antithesis of Enfield, an established, veteran coach with a long track record of success — just not in the NCAA. Then his Middle Tennessee team beat mighty Michigan State as a 15 seed.\n\n“Rightly or wrongly, the emphasis is on the NCAA tournament,” Miles said. “It’s almost like the guy’s an overnight sensation and it only took him 15 years to get their. But that’s just the way it is.”\n\nFraschilla led Manhattan College to a 13-over-4 upset of Oklahoma in 1995. Two years later, he took the St. John’s job and then went to New Mexico, but never won another NCAA Tournament game.\n\nWhether Friday’s upset turns out to be the peak of Mills’ coaching career or the first of many March moments, he might never top the feeling of leading Oral Roberts past Ohio State.\n\n“It will be one of the greatest days of his career no matter what happens from here,” Fraschilla said. “He can go to the Naismith Hall of Fame in 25 years and he’ll remember this day forever because of what it means to him, his team, his school and his family.”\n\n___\n\nFollow Ralph D. Russo at https://twitter.com/ralphDrussoAP and listen at https://westwoodonepodcasts.com/pods/ap-top-25-college-football-podcast/\n\n___\n\nMore AP college basketball coverage: https://apnews.com/hub/college-basketball and updated bracket: https://apnews.com/hub/ncaa-mens-bracket"}, {"url": "https://www.dnj.com/story/sports/college/mtsu/2016/03/19/mtsus-upset-win-helps-kermit-davis-dad-feel-better/82031826/", "page_content": "Aldo Giovanni Amato\n\nUSA TODAY NETWORK – Tennessee\n\nST. LOUIS — Kermit Davis Sr. was not able to make it to St. Louis to see his son capture the biggest win of his career.\n\nDavis Sr., 80, is back home in Mississippi with pneumonia but was able to cheer on Kermit Davis Jr. and the No. 15 seed Blue Raiders as they upset No. 2 Michigan State 90-81 Friday night.\n\n“I tell you what, I coached for many years and was part of many great teams,” Davis Sr. said by phone. “That game last night made me feel about as good as I ever felt.”\n\nDavis Sr. coached at Mississippi State from 1971 to 1977 and was named Southeastern Conference coach of the year his first year.\n\nWhen he talked with his son before Friday night’s game, Davis Sr. said he could hear the confidence in his son’s voice.\n\n“The big thing that he told me was that when I said people were calling Michigan State one of the best teams in the nation, he said, 'I'm looking at it as good as they are,'” Davis Sr. said. “As a coach, I would just say go have a good time.\n\n“And that’s what they did. He has some real strong guys on that team.”\n\nAmato: Family comes first for Kermit Davis\n\nDavis prepared to take on another coaching great\n\nDavis Sr. added that although he couldn’t witness the upset in person, he was happy his son was surrounded by his wife and kids.\n\nFather and son talked by phone again after the game.\n\n“As a father, I told him I felt bad we couldn't be there,” Davis Sr. said. “We were here watching the game.\n\n“It was a great moment we had as father and son. I said, ‘I love you Kermit,’ and he said, ‘I love you dad.’ The best thing in the world is your children. How they carry themselves, what type of person they are. I'm just so proud of him.”\n\nMTSU men's round of 32 capsule\n\nMad tweets, good tweets\n\nAfter pulling off one of the biggest upsets in NCAA Tournament history, one might expect a little bit more attention.\n\nThat’s exactly what happened to MTSU players as soon as they got back to their locker room Friday.\n\n“Of course you know our phones were buzzing nonstop from the time we got out the game to this morning,” guard Jaqawn Raymond said Saturday. “There were some mad tweets, of course, and some good tweets.\n\n“We just took it all in and we left that yesterday and we’re moving forward to tomorrow.”\n\nRaymond and other players said they got up to 100 texts and Snapchat messages after Friday’s win.\n\n“All those guys in my fraternity went crazy,” said Chase Miller, a freshman guard who is redshirting. “I got 185-plus (messages).”\n\nPotts’ weight loss\n\nOne of the more colorful quotes to come out of Saturday’s news conferences was Davis talking about guard Giddy Potts’ weight loss.\n\nDavis said Potts showed up to campus out of shape as a freshman but has made progress in his time in Murfreesboro.\n\n“Well we tried to get him to go to only one bowl of ranch with everything instead of two bowls so that was a start,” Davis said. “His eating habits were just poor and he had never really trained.\n\n“He just walked into the weight room as strong as any football guy on our campus. He’s just country strong.”\n\nPotts is down to about 220 pounds and his body fat percentage shrunk as he became more aware of training.\n\n“I think if he can get down to maybe seven or eight pounds less, he’ll become even more athletic,\" Davis said.\n\nMTSU shocks Michigan State in NCAA Tournament\n\nCase’s impact\n\nOne of the things discussed Saturday was assistant coach Win Case’s impact on the team.\n\nCase, who won two national titles at Oklahoma City University and also played alongside Kansas coach Bill Self at Oklahoma State.\n\nIt was Self who encouraged Case to head to Murfreesboro because of Davis’ “underrated value.”\n\n“Bill called me and said, ‘I’m going to tell you right now, Kermit Davis is one of the best coaches out there,'” Case said. “I thought I knew a lot about basketball before I got to MTSU. But it’s just amazing how good (Davis) is.”\n\nCase said Self called him Friday night to congratulate his old teammate on the upset.\n\nPastor jumped for joy\n\nMTSU alumnus Jacob Armstrong, who is the pastor at Providence United Methodist Church in Mt. Juliet, watched from the stands in amazement as his alma mater kept its lead over Michigan State for the entire game.\n\n“It was totally unbelievable. It was like a dream,” Armstrong said. “The whole game we just sat there, ‘Is this really happening?’”\n\nArmstrong, 35, graduated from MTSU in 2002 and made a promise to himself to watch the Blue Raiders play in the NCAA Tournament someday. So on Friday morning, he and three of his friends from church drove to St. Louis, bought tickets on the street and watched the rare upset.\n\n“It was very exciting,\" Armstrong said. \"They played their hearts out and there’s a lot of good Middle Tennessee people here cheering them on.”\n\nWhen MTSU player Reggie Upshaw made a pivotal dunk with 39 seconds left, Armstrong didn’t hold back.\n\n“That was my favorite part. It was such a strong move and so much energy and passion. I may have been screaming my guts out,” Armstrong said.\n\nShirts for sale\n\nMTSU's win over Michigan State was so big, sports apparel store Fanatics is selling shirts to commemorate the win.\n\nReach Aldo Amato at 615-278-5109 and on Twitter @Aldo_Amato\n\nNEXT GAME\n\nNo. 15 MTSU (25-9​) vs. No. 10 SYRACUSE (20-13)​\n\nWhen: 5:10 p.m. Sunday\n\nTV/radio: TNT/102.5-FM, 89.5-FM"}, {"url": "https://www.tennessean.com/story/sports/2016/03/19/mtsu-reflects-its-coach-kermit-davis-triumph-over-michigan-state-ncaa-tournament-upset/81986030/", "page_content": "Joe Rexrode\n\nDetroit Free Press\n\nST. LOUIS — They were charging now, the Michigan State Spartans, a national title favorite to many, an all-time favorite team of Tom Izzo’s, a deficit chopped from 13 to three.\n\nMiddle Tennessee State had played extremely well. Better than that. The Blue Raiders had dropped the jaw of anyone with a bracket, and they had pushed the Spartans on the court at Scottrade Center like no one could have reasonably guessed.\n\nBut now it was a TV timeout, 3:34 left, a 77-74 lead and Michigan State’s Colby Wollenman going to the line for two. A few thousand fans in green sensed a takeover. About 250 in blue stood nervously.\n\nMTSU senior guard Perrin Buford would have none of it.\n\n“He said something I’ll never forget,’” MTSU coach Kermit Davis recalled after the upset shocker that just shook this tournament, on his phone as the team bus approached the team hotel. “He said, ‘Come on guys, this is fun.’ ”\n\nMTSU shocks Michigan State in NCAA Tournament\n\nSo of course Buford barged in for a layup 13 seconds later. And then he grabbed a key offensive rebound. And when Giddy Potts picked up a loose ball and got a jumper to rattle in with 59 seconds left, you knew — this was actually going to happen.\n\nMidwest region No. 15 seed Middle Tennessee State 90, No. 2 seed Michigan State 81. The unranked, mid-major, relatively anonymous Blue Raiders over Izzo, Denzel Valentine and the No. 2-ranked, blue-blooded Spartans.\n\nIt was an unforgettable performance by an unflappable team. And yes, an incredible outcome.\n\n“We weren’t scared of the moment,” Buford said.\n\nNo, they owned it. Biggest upset in tournament history? Arguably. Biggest win in school history? Certainly.\n\nMTSU claims school's biggest win of all time\n\nMTSU has two previous NCAA wins, one over Kentucky in 1982, but that Kentucky team was not this Michigan State team — and this MTSU team has every right to believe it can parlay this into a Sunday win over No. 10 seed Syracuse and a Sweet 16.\n\nToughest loss in Izzo’s 21-year head coaching career? His tears said it all.\n\n“They outplayed us,” Izzo said of the Blue Raiders. “I mean, there's no way I can put it any differently. They deserved to win.”\n\nHighlight of Davis’ 21-year head coaching career, the last 14 spent building a consistent winner at MTSU?\n\n“It really is,” Davis said of his first NCAA win in four tries, the first two of which came when he was a much younger man at Idaho in 1989 and ’90.\n\nAnd it wasn’t just the way the Blue Raiders won the game that smacked you in the face on press row — Reggie Upshaw spearheading an afternoon full of aggressive drives and clutch shots and grown-up rebounds. It was the way they conducted themselves in the wake of the win.\n\nSmiles and hugs, yes, but this was not the euphoria of a team that had just scored its crowning achievement. These were not tearful hugs. The Blue Raiders were mature and calm, just as they had been the day before the game.\n\n“That’s our team,” Davis said. “And I was so proud to see them react that way.”\n\nIt seems those players take on his personality. He talked Thursday about their “quiet confidence,” and they expressed their belief that they belonged on the same court with Michigan State. Maybe someone should have listened.\n\nNotes: Michigan State players in shock after loss to Middle Tennessee\n\nDavis has a team with veterans and shooters at every position. It just stayed within two of the top rebounding team in the nation, and it deftly mixes defenses. Valentine hasn’t been that frazzled all season.\n\nThe Blue Raiders don’t have to be done here, not with poise like that. It guided those huddles.\n\nDavis got a little jolt of it before the game when he looked into the stands for his wife and two daughters. He spotted his 28-year-old daughter, Ally, who has Down syndrome.\n\n“About 30 seconds before tipoff, I saw her walking down the steps with her pizza,” he said of Ally. “She was more worried about getting something to eat at lunch. But it kind of puts a calmness to you.”\n\nReactions to MTSU's win over Michigan State\n\nThe first call Davis made after the game went to his parents, who weren’t in St Louis. His father, Kermit Sr., the former head coach at Mississippi State, has pneumonia and couldn’t make the trip.\n\n“And now,” Davis said on his cell phone, shortly after an ESPN interview, the team bus soon to pull into the team hotel, “I can’t wait to hug my wife and my daughters.”\n\nThose may have been tearful.\n\nJoe Rexrode is the Michigan State beat writer for the Detroit Free Press. He will become a columnist for The Tennessean in April."}, {"url": "https://www.outkick.com/kermit-davis-ole-miss-basketball-coach-fired-call-recruits-character-hot-board/", "page_content": "Videos by OutKick\n\nKermit Davis and Ole Miss mutually agreed to part ways amid a disastrous SEC run last week. The 63-year-old had been the head coach of the men’s basketball program since 2018 and went 74-79 in just under five years.\n\nAlthough Davis is no longer with the program, he’s still going out of his way to support the program. His remarkable character was on full display over the weekend.\n\nDavis, who might be most famous for Middle Tennessee State’s upset of No. 2-seed Michigan State in the first round of the 2016 NCAA Tournament, is a fantastic human being. Although he couldn’t find a path to success in Oxford, he landed the school’s first-ever five-star recruit, the No. 34 overall recruiting class in 2021, the No. 27 class in 2022, and the No. 20 class in 2023.\n\nTalented players want to play for Davis and it’s not hard to see why.\n\nOle Miss played its first game without him on Saturday and stomped LSU. The Rebels won their 11th game of the season 82-69 with interim head coach Win Case.\n\nFollowing the win, Davis retweeted a post that celebrated the success. He is proud of his guys and will continue to support them even now that he’s gone. A lot of coaches would completely disassociate with the program that let them go.\n\nThat was not all.\n\nCase revealed during his postgame media appearance that Davis actually called the recruits that he was actively trying to get to commit to Ole Miss after the two sides parted ways. He told them what a special place it is and encouraged them to keep their interest in the program and university.\n\nConsidering that Davis is no longer the head coach, and a Mississippi State grad, his willingness and desire to call up recruits with nothing but kind things to say is pretty cool. Shoutout to Kermit Davis!"}, {"url": "https://www.celebsagewiki.com/kermit-davis", "page_content": "Age, Biography and Wiki\n\nKermit Davis was born on 14 December, 1959 in Leakesville, MS, is an American basketball coach. Discover Kermit Davis's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 63 years old?\n\nPopular As N/A Occupation N/A Age 63 years old Zodiac Sign Sagittarius Born 14 December 1959 Birthday 14 December Birthplace Leakesville, MS Nationality MS\n\nWe recommend you to check the complete list of Famous People born on 14 December. He is a member of famous Coach with the age 63 years old group.\n\nKermit Davis Height, Weight & Measurements\n\nAt 63 years old, Kermit Davis height not available right now. We will update Kermit Davis's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Ally Davis, Claire Davis\n\nKermit Davis Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Kermit Davis worth at the age of 63 years old? Kermit Davis’s income source is mostly from being a successful Coach. He is from MS. We have estimated Kermit Davis's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Coach\n\nKermit Davis Social Network\n\nInstagram Linkedin Twitter Kermit Davis Twitter Facebook Wikipedia Kermit Davis Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.jacksonfreepress.com/news/2018/mar/19/ole-miss-hires-middle-tennessee-coach-kermit-davis/", "page_content": "Kermit Davis turned Middle Tennessee into one of the best mid-major programs in the country during his 16 seasons at the school.\n\nMississippi believes he can have the same kind of success in the Southeastern Conference.\n\nUniversity officials announced Thursday the 58-year-old Davis will be the next Rebels men's basketball coach and he'll be officially introduced on campus Monday. The coach will continue to lead Middle Tennessee this month during the NIT and the Blue Raiders' second-round game at Louisville is on Sunday.\n\n\"I'm incredibly honored and excited to be the basketball coach at the University of Mississippi,\" Davis said in a statement. \"We are extremely grateful to Chancellor Vitter and (athletic director Ross Bjork) for giving me the opportunity to lead such a prestigious program in the best basketball league in America.\"\n\nDavis has coached at Middle Tennessee since 2002 and led the program to the NCAA Tournament in 2013, 2016 and 2017, scoring upset wins over Michigan State in 2016 and Minnesota in 2017. The Mississippi native also led the Blue Raiders to league titles in seven of the last nine seasons during time in Conference USA and the Sun Belt.\n\nDavis has also coached at Idaho and Texas A&M. He resigned in 1991 after just one season at Texas A&M because of an NCAA investigation into recruiting violations. The program was eventually given two years of probation and a one-year postseason ban.\n\nBut there were no similar problems at Middle Tennessee, and he slowly built a powerhouse program.\n\nMiddle Tennessee won the Conference USA regular-season championship this season, but lost to Southern Miss in the conference tournament and had to settle for the NIT instead of a fourth NCAA Tournament appearance.\n\nDavis thanked Middle Tennessee in a statement, including a \"special appreciation to all of our former players, assistant coaches and support staff that put forth so much sweat equity into Middle Tennessee Basketball throughout our 16 years!\"\n\nDavis will take over an Ole Miss program that finished with a 12-20 record this season, including a 5-13 mark in the Southeastern Conference.\n\nHe replaces Andy Kennedy, who resigned in February after nearly 12 years leading the Rebels.\n\nOle Miss was often competitive under Kennedy but made the NCAA Tournament just twice during his tenure.\n\nThat level of success was acceptable when the Rebels played games at Tad Smith Coliseum, which was considered one of the SEC's worst facilities. But Ole Miss built a $100 million arena a few years ago called The Pavilion and expectations soared.\n\nInstead of improving, Ole Miss regressed, and now Davis will get a chance to try to push the Rebels toward the top of the SEC.\n\n\"After assessing the entire landscape of college basketball and speaking to basketball experts across the country to determine the greatest fit for Ole Miss Basketball, the answer was clear — Kermit Davis is the best coach and best leader to take our program to the next level in the SEC and NCAA,\" Bjork said."}, {"url": "https://www.espn.com/mens-college-basketball/story/_/id/16992328/middle-tennessee-state-blue-raiders-coach-kermit-davis-gets-raise-8-year-extension", "page_content": "MURFREESBORO, Tenn. -- Middle Tennessee coach Kermit Davis has agreed to an eight-year contract extension that includes a raise after leading the Blue Raiders to an NCAA tournament upset of Michigan State this past season.\n\nSchool officials announced Monday that Davis' contract runs through the 2023-24 season and that he will make a total of $565,000 annually. Middle Tennessee athletic department spokesman Mark Owens said Davis' base salary goes from $375,000 in 2015-16 to $465,000 in the new deal. Davis also makes $100,000 for radio and television responsibilities.\n\nThe (Murfreesboro) Daily News Journal first reported Davis' extension.\n\nDavis owns a 413-250 record in 21 seasons overall, including a 276-175 record in 14 seasons at Middle Tennessee. The Blue Raiders went 25-10 this past season and earned their first NCAA tournament victory since 1989."}]}