{"Daniel Ménard graduated from the Royal Military College of Canada in 1983 and was commissioned as an infantry officer.": [{"url": "https://www.ctvnews.ca/world/former-canadian-brigadier-general-could-be-released-from-afghan-jail-soon-1.1663176", "page_content": "Former Canadian brigadier-general Daniel Menard, who was demoted over a sexual relationship with a subordinate and now works for a private security firm, could be released from an Afghan jail within days after being detained for three weeks, CTV News has learned.\n\nMenard, who serves as GardaWorld’s managing director for Afghanistan, has done “nothing wrong,” a source told CTV’s Mercedes Stephenson.\n\nThat source says it is not uncommon for foreign contractors to be jailed in Afghanistan due to government corruption.\n\nThe source says Menard has his authority for release, which needs to be stamped by Afghan authorities, and he could be out by the end of the weekend, if not sooner.\n\nMenard has been with GardaWorld since Nov. 2011, according to his profile on the company’s website.\n\nAs part of the job, Menard oversees GardaWorld’s “commercial, operations and projects throughout the country, including existing and new contracts with the U.S. government, non-governmental and commercial clients.”\n\nIn a statement to CTV News, a spokesperson for the Department of Foreign Affairs said department officials “have been in contact with the subject, and are providing him with consular assistance.”\n\nMenard led Canadian Forces in Afghanistan before being stripped of his command and sent home in June 2010 after an affair with a subordinate came to light.\n\nMilitary rules prohibit sexual relations between soldiers while deployed, even if they are married.\n\nMenard, who was married with two children, began an affair with Master Cpl. Bianka Langlois after they met in Canada in 2008. Their relationship carried on after they were deployed to Afghanistan between Nov. 2009 and Apr. 2010. The affair became public in May 2010 and Menard was sent home. He was to assume command of the army in Quebec. However, he resigned that November and left the military the following month.\n\nMenard pleaded guilty to having improper relations with a corporal under his command and attempting to impede an investigation into the relationship.\n\nIn July, 2011 Menard was fined $7,000 and demoted to colonel, though the reduction in rank was symbolic because Menard had already retired.\n\nFor her part in the affair, Langlois was convicted of one count of conduct to the prejudice of good order and disciplined and fined $700."}, {"url": "https://www.cbc.ca/news/politics/daniel-m%C3%A9nard-ex-canadian-general-jailed-in-afghanistan-to-be-released-1.2516788", "page_content": "A former Canadian brigadier-general who has spent the last three weeks in an Afghan jail is expected to be released \"imminently,\" according to the company he works for.\n\nDaniel Ménard, now the Afghanistan head for private security corporation GardaWorld, was allegedly detained on gun smuggling charges, an accusation that has not been confirmed.\n\nWednesday, a GardaWorld spokeskman told CBC News Ménard was detained by Afghan officials because of \"administrative issues related to licensing of the company's work in Afghanistan.\"\n\nA newspaper carrying a report from Kabul on Thursday alleged Ménard's run-in with the law centred on accusations of possessing military equipment without permission, including 129 rifles and 148 radios.\n\nBut later in the day, a company spokesman told CBC News the \"issue has been resolved.\"\n\n\"[Ménard] has his release authority,\" Farquhar said. \"That should happen imminently.\"\n\nMénard is GardaWorld's managing director in Afghanistan, where he's responsible for the company's operations, \"including existing and new contracts with the U.S. government, non-governmental and commercial clients,\" according to the company's​ website.\n\nOfficials at the Afghan embassy in Ottawa say they have yet to hear full details on the case from Kabul.\n\n\"Reports received thus far by the embassy on the developments surrounding Mr. Ménard’s arrest in Kabul are sketchy,\" the embassy said in a statement.\n\n\"All we can say at this point is that an investigation is underway to determine his role in the alleged 'gun smuggling.'\"\n\nBut now it appears as if those allegations may have been settled.\n\nMénardonce headed Canada's military mission in Afghanistan. His tenure in the country was cut short in 2010 when he was charged with fraternization for having a sexual liaison with a female subordinate.\n\nHe was charged and later pleaded guilty to two counts of conduct to the prejudice of good order and discipline, in violation of the National Defence Act.\n\nBy the time he was convicted, Ménard had already left the military, but was symbolically reduced in rank. He was also fined $7,000.\n\nTough rules\n\nAfghanistan has tough rules for private military contractors regarding the possession and use of weapons and other military gear.\n\nIt's those rules – and the way the Afghan government enforces them – that Canadian security consultant Alan Bell says could be to blame for Ménard's detention.\n\nBell's Globe Risk International has done security work in Afghanistan on behalf of clients like the Canadian Foreign Affairs department. In fact, Bell says he once even reported to Ménard during a stint in Kandahar province.\n\nAfghanistan's rules for private security contractors were toughened significantly several years ago.\n\n\"This was for licensing purposes and for generating revenue for the Afghanistan government,\" Bell said. \"It was also a way of tying a weapon to an individual if that weapon was ever used illegally.\"\n\nIt's happened to a lot of companies. - Alan Bell, security consultant\n\nThat Afghan system's rules require security companies to keep accurate, detailed records of all military equipment uses in Afghanistan including rifles, radios, ballistic helmets and other gear. Bell says those records are sent to Afghanistan's Interior Ministry along with licence fees.\n\nAfghan officials frequently audit security companies to ensure they only have the weapons they have licences to support.\n\nBell says these audits can frequently cause trouble for security companies in Afghanistan, in part because the requirements are onerous, but also because the Afghan system frequently doesn't operate with the same business ethics that Western companies are used to.\n\n\"It's happened to a lot of companies. These people turn up out of the blue and try to audit their weapons and what they have what they don't have,\" Bell said. \"When there is an audit and they find you've got X amount of weapons that haven't been listed or licensed, they take that very seriously.\n\n\"If you get caught, then you have a problem. They will arrest usually the country manager because is the one that is on the ground all the time,\" Bell said.\n\n\"They've arrested a lot of [expatriates] over the years and they fine then, they fine the company. They usually confiscate the equipment that wasn't registered with them, and then you carry on business as normal.\n\n\"Then [Interior Ministry officials] go on to another company and do the same things.\"\n\nIt appears it's a situation similar to this that has Ménard spending time in jail. GardaWorld does lots of work in Afghanistan, including, at times, for the Canadian government.\n\nIt's also had more than one rules run-in with Afghan authorities.\n\nGardaWorld faced similar problem in 2012\n\nIn 2012, two British employees of GardaWorld were arrested by Afghan authorities and faced similar accusations after being found with 30 allegedly unlicensed AK-47s. At the time, GardaWorld maintained its employees were planning to buy the weapons but wanted to test their functionality on a range first.\n\nGardaWorld also faced a forced shutdown of its operations as a result of those arrests.\n\nThat dispute occurred in the early days of an Afghan government plan to take over and \"Afghanize\" most of the work undertaken by private security contractors in the war-torn country.\n\nBell says these latest accusations levelled against GardaWorld and Ménard remind him of that 2012 dispute.\n\n\"This is down to hard cash at the end of the day and whether Garda did have equipment that wasn't registered or not,\" Bell said. \"[Garda] obviously had their reason for doing that, now they've been found out so consequently they will have to pay the fines and then it will be business as usual and next week it will be another company.\n\n\"This has happened so many times with so many companies. It isn't rare.\"\n\nCanada's Foreign Affairs Department said it is aware of the arrest, and that \"consular services are being provided to a Canadian citizen who has been detained in Afghanistan.\""}, {"url": "https://www.cbc.ca/news/canada/montreal/ex-canadian-forces-commander-daniel-m%C3%A9nard-loses-rank-1.1108899", "page_content": "Retired brigadier-general Daniel Ménard was symbolically stripped of his rank and fined after pleading guilty to charges of violating military conduct laws and impeding an investigation.\n\nThe former commander of the Canadian Forces in Afghanistan admitted Thursday to a sexual liaison that wrecked his career and resulted in him being sent back to Canada in disgrace.\n\nA serious offence Ménard violated article 129 of the National Defence Act, which states, \"Any act, conduct, disorder or neglect to the prejudice of good order and discipline is an offence and every person convicted thereof is liable to dismissal with disgrace from Her Majesty's service or to less punishment.\" To the Canadian Forces, having intimate relationships with subordinates in a theatre of war can create serious ethical dilemmas, as retired Lt.-Col. Gilles Paradis explains: \"It's a matter of discipline and cohesiveness between the troops. Imagine, for instance, you send 10 soldiers in the field on patrol, and it's a very dangerous mission. The [commanding officer] is a a sergeant and he has a relationship with one his female soldiers, and he has to send someone ahead on a dangerous path where you could find some explosive device, and he never chooses that person. He always sends someone else. What would be the impact amongst his 10 soldiers, knowing that there's a personal relationship which has developed between those two. The other soldiers will lose confidence and will come to think that he is protecting his girlfriend.\"\n\nMénard was charged with two counts of conduct to the prejudice of good order and discipline, in violation of the National Defence Act.\n\nOne charge related to an alleged \"intimate personal relationship\" with a corporal under his command; the second charge was for allegedly trying to impede a military police investigation into the affair.\n\nLawyers for Ménard and the military jointly recommended a reduction in rank to colonel, which is symbolic as he is retired, and a fine of $7,000. On Thursday afternoon, a judge agreed to those penalties.\n\nMénard was initially also charged with four counts of obstructing justice, which were withdrawn before Thursday's hearing.\n\nMénard apologized to his wife and children when he pleaded guilty at a court martial in Montreal.\n\n\"I was humiliated and lost my reputation in my community,\" he said. \"I deeply regret my conduct.\"\n\nMénard served as top officer for Task Force Kandahar beginning in November 2009 but was relieved of duty following allegations that he had a sexual relationship with a subordinate, Master Cpl. Bianka Langlois. His guilty plea came at the start of his military trial.\n\nA former senior military official told CBC News earlier that if Ménard behaved as alleged, and did so during a mission, he should be punished.\n\nMaster Cpl. Bianka Langlois was charged with violating military fraternization regulations. (Courtesy of Global TV) \"I can probably name a half-dozen generals who have married, divorced and married, junior ranks people and such, so the question of fraternization is a very broad one,\" said Pat Stogran, the former Veterans Ombudsman and a retired Canadian colonel who went on several missions.\n\n\"But in an operational theatre, absolutely no question, it's reprehensible conduct of the highest order and you know he's got no business being in command.\"\n\nMénard, who had been based at CFB Valcartier near Quebec City, resigned on Dec. 17, 2010.\n\nLanglois was convicted of one count of conduct to the prejudice of good order and discipline. She was reprimanded and fined $700.\n\nIn May 2010, Ménard was fined $3,500 for mishandling a weapon.\n\nHe was handed the fine — the stiffest fine ever levied on a soldier for this offence — after pleading guilty to an offence under the National Defence Act in a court in Gatineau, Que.\n\nThe incident occurred as Ménard and his boss, Gen. Walt Natynczyk, were about to board a Blackhawk helicopter at Kandahar Airfield.\n\nMénard said he was loading his C8 carbine, when it went off. No one was injured and nothing was damaged, but the National Defence Act makes it an offence to accidentally discharge a weapon."}, {"url": "https://www.cbc.ca/news/politics/ex-general-daniel-m%C3%A9nard-s-move-to-uae-cost-national-defence-40k-1.2541044", "page_content": "National Defence paid nearly $40,000 to move a disgraced general to the United Arab Emirates after he was court-martialled for having sex with a subordinate and trying to cover it up, expense records for the military's top brass show.\n\nThe revelation about former brigadier-general Daniel Ménard is in the same set of records that show retired lieutenant-general Andrew Leslie was allowed to claim more than $72,000 for a move within Ottawa after he left the military.\n\nMénard, who was relieved in 2010 as combat commander in Kandahar, had already resigned from the military when he pleaded guilty in 2011 to having improper relations with a corporal under his command, and trying to impede an investigation into their affair.\n\nHis name recently reappeared in the headlines after Ménard was detained in Afghanistan in his current role as an executive for a private security company.\n\nThe Department of National Defence allows a retiring member of the Canadian Forces up to two years to claim a final relocation expense, which is then approved and audited. It also pays the full relocation costs for serving members.\n\nPolicy under scrutiny\n\nThe policy is under scrutiny following revelations about how much it cost to relocate Leslie — a high-profile adviser to the Liberals on defence and foreign policy who is widely expected to run in the next federal election — from his east Ottawa home to a new house just minutes away.\n\nBut the full list of expenses, which outlines the moving costs paid to senior military leaders between 2008 and 2013, raises questions that go well beyond Menard and Leslie.\n\nIt shows at least three other officers billed taxpayers in 2010 a total of $47,495 for moves between Afghanistan and Ottawa, Halifax and Kingston, Ont.\n\nThe members were deployed as part of the Canadian mission; it's unclear what the expenses entailed. The largest of those three claims totalled almost $38,000.\n\nLeslie, in defending his expenses on the weekend, said he was entitled to make the claim. The Liberals described the release of the information as a political smear by Conservatives eager to dent Leslie's political ambitions."}, {"url": "https://www.cbc.ca/news/politics/daniel-menard-former-canadian-general-still-in-afghan-jail-1.2535691", "page_content": "A retired former Canadian general who was removed from command in Afghanistan after he was caught having sex with a subordinate remains in jail in that country facing charges of gun smuggling.\n\nDaniel Menard's employer, the Canadian security company GardaWorld in a statement to CBC News confirmed their employee was still in prison – even though the company had been told two weeks ago that he would soon be released.\n\n“We had understood Mr. Menard’s release to be imminent. We are continuing to work with the Afghan authorities to resolve the matter and secure Dan’s release as soon as possible,\" GardaWorld spokesman Joe Gavaghan told CBC News.\n\nAt the end of January, CBC News reported Menard's release was imminent, based on that assurance from GardaWorld.\n\nA company spokesman told CBC News Ménard, who was reduced in rank to colonel following the affair, was detained by Afghan officials because of \"administrative issues related to licensing of the company's work in Afghanistan,\" but that \"issue has been resolved,\" and \"[Ménard] has his release authority.\"\n\nSketchy details\n\nBack then, the Afghan Embassy in Ottawa said the details it was hearing from Kabul were \"sketchy.\"\n\n\"All we can say at this point is that an investigation is underway to determine his role in the alleged gun smuggling,\" a spokesman told CBC News.\n\nA newspaper carrying a report from Kabul at the time also alleged Ménard's run-in with the law centred on accusations of possessing military equipment without permission, including 129 rifles and 148 radios.\n\nMénard is GardaWorld's managing director in Afghanistan, where he's responsible for the company's operations, \"including existing and new contracts with the U.S. government, non-governmental and commercial clients,\" according to the company's​ website.\n\nMénard once headed Canada's military mission in Afghanistan. His tenure in the country was cut short in 2010 when he was charged with fraternization for having a sexual liaison with a female subordinate.\n\nHe was charged and later pleaded guilty to two counts of conduct to the prejudice of good order and discipline, in violation of the National Defence Act.\n\nBy the time he was convicted, Ménard had already left the military, but was reduced in rank. He was also fined $7,000.\n\nIn 2012, two British employees of GardaWorld were arrested by Afghan authorities and faced similar accusations after being found with 30 allegedly unlicensed AK-47s. At the time, GardaWorld maintained its employees were planning to buy the weapons but wanted to test their functionality on a range first.\n\nGardaWorld also faced a forced shutdown of its operations as a result of those arrests."}, {"url": "https://www.theglobeandmail.com/news/national/daniel-menard-scandal-leaves-military-reeling/article4392497/", "page_content": "Brigadier-General Daniel Ménard was relieved as commander of the Afghan mission on Saturday.BLAIR GABLE Share\n\nThe reputation and morale of Canada's military, still reeling from allegations that a base commander committed multiple murders, has suffered another blow with the dismissal of its top soldier in Afghanistan for breaking the rules on personal relationships in the field.\n\nBrigadier-General Daniel Ménard was removed from command following allegations he had an intimate relationship with a member of his staff. The subordinate involved has been sent home, according to a military spokesman.\n\nBrigadier-General Jonathan Vance, Gen. Ménard's predecessor, will be returning to Kandahar this week to assume command less than a year after he left, arriving as coalition troops are poised to launch a major operation in Kandahar in June that is cast as the defining moment of the war.\n\nWhile Canadian military commanders in Afghanistan sought to down play the controversy as a personal ordeal, military observers and former officers said Gen. Ménard's dismissal could be damaging to the morale of the troops on the ground, and possibly taint Canadians' image of the armed forces.\n\nIt will certainly \"take away some of the glitter\" that was associated with Canadian soldiers' performance in Afghanistan, said Michel Drapeau, a professor of military law and a former armed forces colonel.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIt is particularly unfortunate that it comes so soon after Colonel Russell Williams, the former base commander at CFB Trenton, was charged with multiple murders and sexual assaults, he said. While the allegations against Gen. Ménard are in no way similar, they will add to the public's concern about the quality of leadership in the armed forces and raise worries within the Forces as well, he said. \"People in the military [will say]'Here we go again,'\"\n\nHowever, the greatest impact, Mr. Drapeau said, will be on the morale of troops in Afghanistan who served under Gen. Ménard. \"It's devastating,\" he said. \"They [put]all of their trust and respect in him, and they were prepared to follow him into battle ... Their sense of confidence in leadership will take a hit.\"\n\nMilitary historian Jack Granatstein said it is important to note that the allegations against Gen. Ménard are \"infinitely less serious\" than those against Col. Williams. If proven, they will primarily demonstrate \"stupidity on the part of a commanding officer who's job it is to set an example.\"\n\nGen. Ménard commanded 2,800 Canadian soldiers in southern Afghanistan, as well as a contingent of American troops serving under Canadian command.\n\nThe allegations against him caused military command to \"lose confidence\" in his \"capacity to command,\" the military said in a brief statement. Military rules strictly forbid any kind of intimacy on deployments, including relationships of an emotional, romantic or sexual nature.\n\nGen. Ménard, is 42 and married with two children. Major Daryl Morrell, senior public affairs officer with Joint Task Force Afghanistan, said it was \"too early to speculate on the charges\" Gen. Ménard could face, because they won't be known until the military completes its investigation.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLieutenant-General Marc Lessard, commander of Canadian forces overseas, made a brief visit to Afghanistan several weeks ago, before Gen. Ménard went on a three-week leave, from which he has just returned. However, reporters at Kandahar Air Field were told the allegations were only revealed to Gen. Lessard on Saturday. Lt.-Gen. Lessard acted immediately to replace Gen. Ménard.\n\nColonel Simon Hetherington, previously Brig.-Gen. Ménard's second-in-command, is now acting commander until Gen. Vance arrives. He sought to down play any consequences the allegations could have on the military's reputation.\n\n\"The allegations against Brig-Gen. Ménard are that - they're allegations,\" Col. Hetherington said. \"It's a personal thing, so I don't see that as any sort of mark against the institution at all,\" he added.\n\nDefence Minister Peter MacKay declined to comment on the case while it was under investigation by the military.\n\nMichael Byers, a professor of political science at the University of British Columbia, said that while it is clearly discouraging for troops to see a senior officer accused of breaking the rules, it also tells the public that those rules are being applied at all levels.\n\n\"I'm encouraged by the fact that Ménard was removed from his post, since it suggests that the Forces are taking the rules, and the rights and interests of female soldiers, seriously,\" Prof. Byers said.\n\nRetired major-general Lewis Mackenzie said the fact that Gen. Ménard was the commander in Afghanistan raises the situation above a minor issue, because he would be the one to make final decisions in other cases of inappropriate behaviour. \"He's the last level of authority in the theatre in disciplinary matters.\"\n\nDouglas Bland, the chair of defence management studies at the Queen's University School of Policy Studies, said the military has moved quickly to deal with leadership issues since the Somalia inquiry, when problems in command were linked to the fatal beating of a teenager by two Canadian soldiers during a humanitarian mission in Somalia. \"That is a sign of their sensitivity and seriousness about maintaining good order and discipline across the forces,\" he said.\n\nBut Prof. Bland said the rules prohibiting personal relationships are essential, especially in combat zones, \"where the integrity of the unit is supreme,\" and must be followed, particularly, by the highest-ranking soldiers.\n\nThis is not the first time controversy has dogged Gen. Ménard.\n\nLast week he was fined $3,500 for accidentally firing his rifle at Kandahar Air Field in March. He had failed to switch is C8 carbine rifle to the \"safe\" position before departing in a helicopter with his boss, General Walter Natynczyk.\n\nNobody was injured, but the incident qualifies as an offence under the National Defence Act, with a maximum penalty of dismissal from the military. At a military hearing into the incident, Gen. Ménard's defence lawyer argued for leniency, noting the commander reported the mishap to investigators and discussed the incident openly with his soldiers.\n\nBrig.-Gen Ménard joined the Canadian forces in 1984 and was posted to the Royal 22nd Regiment where initially served as a platoon commander.\n\nHe rose quickly through the ranks, serving in Great Britain, Berlin, Germany and Bosnia. He assumed command of Task Force Kandahar in November.\n\nWith a report from Erin Anderssen in Ottawa"}, {"url": "https://www.cbc.ca/news/politics/daniel-m%C3%A9nard-ex-canadian-general-released-from-afghan-prison-1.2543215", "page_content": "Daniel Ménard, the former Canadian brigadier-general held in an Afghan jail on gun-running charges, has been released from prison.\n\nMénard had been imprisoned since January in his current role as an executive for private security company GardaWorld.\n\nA newspaper carrying a report from Kabul on Jan. 30 alleged Ménard's run-in with the law centred on accusations of possessing military equipment without permission, including 129 rifles and 148 radios.\n\nGardaWorld later told CBC News the issue had been resolved and that Ménard's release \"should happen imminently,\" but word of his actual release did not come until this week.\n\nGardaWorld confirmed Ménard's release in a statement to CBC News on Wednesday.\n\n\"This situation was about the administration of a license, as we disclosed previously, and not about gun-running,\" spokesman Joe Gavaghan said in an email to CBC News.\n\nMénard was formerly a military commander for Canada's mission in Afghanistan. His tenure in the country was cut short in 2010 when he was charged with fraternization for having a sexual liaison with a female subordinate.\n\nHe was charged and later pleaded guilty to two counts of conduct to the prejudice of good order and discipline, in violation of the National Defence Act.\n\nIt was recently revealed National Defence paid nearly $40,000 to move Ménard to the United Arab Emirates, according to a set of documents containing expense records for the military's top brass."}, {"url": "https://www.canada.ca/en/department-national-defence/news/2020/05/more-than-230-new-officers-graduate-from-rmc-in-virtual-ceremony.html", "page_content": "May 21, 2020 – Kingston, Ont. – National Defence / Canadian Armed Forces\n\nThe Royal Military College of Canada (RMC) today hosted a virtual convocation and commissioning ceremony to celebrate the Class of 2020.\n\nThe two-hour ceremony held in historic Currie Hall was organized to respect provincial regulations of physical distancing and was also live streamed on the RMC Facebook page. It featured the projected images of graduates and award winners as their names were read.\n\nThe ceremony included a pre-recorded video message by the Minister of National Defence Harjit S. Sajjan, in his position as RMC Chancellor and President. The Class of 2020 also received video messages from the Chief of Defence Staff General Jonathan Vance, Retired Lieutenant-General, Senator, and celebrated humanitarian Roméo Dallaire, and Canadian astronaut Colonel Chris Hadfield, all former cadets.\n\nIn his role as Vice-Chancellor of RMC, the Commandant, Brigadier-General Sébastien Bouchard conferred (in absentia) more than 300 graduate and undergraduate degrees to the Class of 2020, and officially announced the commissioning of 235 Officer and Naval Cadets of the fourth-year class who successfully completed all requirements to become second-lieutenants and acting sub-lieutenants in the Canadian Armed Forces.\n\nThe ceremony can be viewed at https://www.facebook.com/RMCCanadaCMR."}, {"url": "https://www.ctvnews.ca/politics/dnd-paid-40k-for-disgraced-former-general-daniel-menard-s-move-1.1691277", "page_content": "The Department of National Defence paid nearly $40,000 to move a disgraced former brigadier-general from the Montreal area to the United Arab Emirates, according to the same documents that brought to light another former general’s controversial $72,000 move within Ottawa.\n\nAccording to the documents, the department paid the $40,000 to move former brigadier-general Daniel Menard, who was demoted and later pleaded guilty to having improper relations with a subordinate, so he could take up his new job with private security firm GardaWorld as head of its Afghanistan operations.\n\nMenard led Canadian Forces in Afghanistan before being stripped of his command and sent home in June 2010 after his affair with the subordinate came to light. Menard resigned in November 2010 and left the military the following month.\n\nIn July 2011, Menard was fined and demoted to colonel after pleading guilty to improper relations with a corporal under his command and obstruction of justice for trying to impede an investigation into the affair.\n\nThe documents that shed light on Menard’s move are the same that showed that taxpayers paid $72,000 to move retired lieutenant-general Andrew Leslie from one home in Ottawa to another a four-minute drive away in 2012. The figure includes moving costs and real-estate fees.\n\nIn all, the defence department has covered nearly $600,000 to move dozens of generals and admirals over the past five years either within the same city or just outside the city limits, the documents show.\n\nThe costs were covered under a program that allows members of the Canadian Forces who have served for more than 20 years to expense one last move after they retire. The benefit is administered through the Canadian Forces Integrated Relocation Program.\n\nDefence Minister Rob Nicholson says that the federal government is now reviewing the policy. In a statement issued Monday evening, Nicholson said the costs of Leslie’s move “appear grossly excessive, demonstrating a clear lack of judgment and Liberal sense of entitlement.”\n\nThe statement noted several times that Leslie is now an advisor to Liberal Leader Justin Trudeau. It is believed that Leslie will run for the Liberals as a star candidate in the next federal election.\n\nLiberal sources have told CTV News that they believe Leslie is being singled out by the federal government because of his ties to the party, which will not ask him to repay the funds.\n\nIn an interview with CTV News that aired on Sunday, Leslie accused the Conservatives of targeting him with a “smear campaign.”\n\n“We were always comforted by the knowledge that when it came time to hang up my spurs, I could go somewhere exactly where we wanted to go, where we wanted to retire to, where we essentially wanted to settle down for the rest of our lives,” he said.\n\n“And the current policy, a Conservative-managed policy, is that there is no differentiation between rank, and you can either move next door or you can move to the other side of the country.”\n\nGovernment officials said Sunday that nobody was available to comment on Leslie’s charge that he’s the victim of a smear campaign.\n\nIn a written statement, Leslie said that a third party supplier oversaw each step of the moving process, and every expense received “independent approvals.” Leslie told CTV that he only “roughly” knew the costs of the move until CTV first reported on it over the weekend.\n\nIn his Monday statement, Nicholson said Leslie “falsely asserted that he was unaware of the costs he was billing taxpayers,” saying that service men and women submit their bills for reimbursement.\n\n“The policy was never intended to have taxpayers pay $72,000 for generals to move between mansions within the same city,” Nicholson said.\n\nWith a report from CTV’s Ottawa Bureau Chief Robert Fife"}, {"url": "https://www.rmc-cmr.ca/en/history/douglas-delaney", "page_content": "Dr. Doug Delaney holds the Canada Research Chair in War Studies. Canada Research Chair in War Studies on the Canada Research Chair's website.\n\nA retired infantry officer with more than twenty-seven years of service in the Canadian Armed Forces, his military career began when he entered Royal Roads Military College at Victoria, British Columbia in 1983. Four years later, he graduated from the Royal Military College of Canada (RMC) at Kingston Ontario with BA (Honours) in History. Commissioned into Princess Patricia’s Canadian Light Infantry (PPCLI) as a second-lieutenant, he served for four years with the Third Battalion of his regiment at Victoria, B.C, where he held appointments as rifle platoon commander, intelligence officer and company second-in-command. In 1991, Captain Delaney was posted to the Canadian Airborne Regiment at Petawawa, Ontario, where served as a rifle platoon commander in 2 Airborne Commando and as a reconnaissance platoon commander. From 1993 to 1996, he was a staff officer (plans) at 1st Canadian Division Headquarters. In 1996, he returned to regimental duty with 1 PPCLI, where he held the posts of adjutant and company commander. In 2000, after finally completing his MA in War Studies through part-time study at RMC, then-Major Delaney returned to his alma mater to pursue a doctorate in War Studies, which he completed in 2003.\n\nLieutenant-Colonel (retired) Delaney’s military qualifications include Canadian land forces command and staff course, combat team commander, combat intelligence officer, basic parachutist, and military freefall parachutist. He has completed three operational tours of duty: Cyprus (1988), Somalia (1992-1993) and Kosovo (1999)."}]}