{"Daniel Ménard was responsible for the Canadian Forces' operations in the Kandahar region, and was in command of the Canadian Forces during the Battle of Panjwaii in 2006.": [{"url": "https://www.cbc.ca/news/politics/daniel-m%C3%A9nard-ex-canadian-general-jailed-in-afghanistan-to-be-released-1.2516788", "page_content": "A former Canadian brigadier-general who has spent the last three weeks in an Afghan jail is expected to be released \"imminently,\" according to the company he works for.\n\nDaniel Ménard, now the Afghanistan head for private security corporation GardaWorld, was allegedly detained on gun smuggling charges, an accusation that has not been confirmed.\n\nWednesday, a GardaWorld spokeskman told CBC News Ménard was detained by Afghan officials because of \"administrative issues related to licensing of the company's work in Afghanistan.\"\n\nA newspaper carrying a report from Kabul on Thursday alleged Ménard's run-in with the law centred on accusations of possessing military equipment without permission, including 129 rifles and 148 radios.\n\nBut later in the day, a company spokesman told CBC News the \"issue has been resolved.\"\n\n\"[Ménard] has his release authority,\" Farquhar said. \"That should happen imminently.\"\n\nMénard is GardaWorld's managing director in Afghanistan, where he's responsible for the company's operations, \"including existing and new contracts with the U.S. government, non-governmental and commercial clients,\" according to the company's​ website.\n\nOfficials at the Afghan embassy in Ottawa say they have yet to hear full details on the case from Kabul.\n\n\"Reports received thus far by the embassy on the developments surrounding Mr. Ménard’s arrest in Kabul are sketchy,\" the embassy said in a statement.\n\n\"All we can say at this point is that an investigation is underway to determine his role in the alleged 'gun smuggling.'\"\n\nBut now it appears as if those allegations may have been settled.\n\nMénardonce headed Canada's military mission in Afghanistan. His tenure in the country was cut short in 2010 when he was charged with fraternization for having a sexual liaison with a female subordinate.\n\nHe was charged and later pleaded guilty to two counts of conduct to the prejudice of good order and discipline, in violation of the National Defence Act.\n\nBy the time he was convicted, Ménard had already left the military, but was symbolically reduced in rank. He was also fined $7,000.\n\nTough rules\n\nAfghanistan has tough rules for private military contractors regarding the possession and use of weapons and other military gear.\n\nIt's those rules – and the way the Afghan government enforces them – that Canadian security consultant Alan Bell says could be to blame for Ménard's detention.\n\nBell's Globe Risk International has done security work in Afghanistan on behalf of clients like the Canadian Foreign Affairs department. In fact, Bell says he once even reported to Ménard during a stint in Kandahar province.\n\nAfghanistan's rules for private security contractors were toughened significantly several years ago.\n\n\"This was for licensing purposes and for generating revenue for the Afghanistan government,\" Bell said. \"It was also a way of tying a weapon to an individual if that weapon was ever used illegally.\"\n\nIt's happened to a lot of companies. - Alan Bell, security consultant\n\nThat Afghan system's rules require security companies to keep accurate, detailed records of all military equipment uses in Afghanistan including rifles, radios, ballistic helmets and other gear. Bell says those records are sent to Afghanistan's Interior Ministry along with licence fees.\n\nAfghan officials frequently audit security companies to ensure they only have the weapons they have licences to support.\n\nBell says these audits can frequently cause trouble for security companies in Afghanistan, in part because the requirements are onerous, but also because the Afghan system frequently doesn't operate with the same business ethics that Western companies are used to.\n\n\"It's happened to a lot of companies. These people turn up out of the blue and try to audit their weapons and what they have what they don't have,\" Bell said. \"When there is an audit and they find you've got X amount of weapons that haven't been listed or licensed, they take that very seriously.\n\n\"If you get caught, then you have a problem. They will arrest usually the country manager because is the one that is on the ground all the time,\" Bell said.\n\n\"They've arrested a lot of [expatriates] over the years and they fine then, they fine the company. They usually confiscate the equipment that wasn't registered with them, and then you carry on business as normal.\n\n\"Then [Interior Ministry officials] go on to another company and do the same things.\"\n\nIt appears it's a situation similar to this that has Ménard spending time in jail. GardaWorld does lots of work in Afghanistan, including, at times, for the Canadian government.\n\nIt's also had more than one rules run-in with Afghan authorities.\n\nGardaWorld faced similar problem in 2012\n\nIn 2012, two British employees of GardaWorld were arrested by Afghan authorities and faced similar accusations after being found with 30 allegedly unlicensed AK-47s. At the time, GardaWorld maintained its employees were planning to buy the weapons but wanted to test their functionality on a range first.\n\nGardaWorld also faced a forced shutdown of its operations as a result of those arrests.\n\nThat dispute occurred in the early days of an Afghan government plan to take over and \"Afghanize\" most of the work undertaken by private security contractors in the war-torn country.\n\nBell says these latest accusations levelled against GardaWorld and Ménard remind him of that 2012 dispute.\n\n\"This is down to hard cash at the end of the day and whether Garda did have equipment that wasn't registered or not,\" Bell said. \"[Garda] obviously had their reason for doing that, now they've been found out so consequently they will have to pay the fines and then it will be business as usual and next week it will be another company.\n\n\"This has happened so many times with so many companies. It isn't rare.\"\n\nCanada's Foreign Affairs Department said it is aware of the arrest, and that \"consular services are being provided to a Canadian citizen who has been detained in Afghanistan.\""}, {"url": "https://www.cbc.ca/news/politics/daniel-m%C3%A9nard-ex-canadian-general-released-from-afghan-prison-1.2543215", "page_content": "Daniel Ménard, the former Canadian brigadier-general held in an Afghan jail on gun-running charges, has been released from prison.\n\nMénard had been imprisoned since January in his current role as an executive for private security company GardaWorld.\n\nA newspaper carrying a report from Kabul on Jan. 30 alleged Ménard's run-in with the law centred on accusations of possessing military equipment without permission, including 129 rifles and 148 radios.\n\nGardaWorld later told CBC News the issue had been resolved and that Ménard's release \"should happen imminently,\" but word of his actual release did not come until this week.\n\nGardaWorld confirmed Ménard's release in a statement to CBC News on Wednesday.\n\n\"This situation was about the administration of a license, as we disclosed previously, and not about gun-running,\" spokesman Joe Gavaghan said in an email to CBC News.\n\nMénard was formerly a military commander for Canada's mission in Afghanistan. His tenure in the country was cut short in 2010 when he was charged with fraternization for having a sexual liaison with a female subordinate.\n\nHe was charged and later pleaded guilty to two counts of conduct to the prejudice of good order and discipline, in violation of the National Defence Act.\n\nIt was recently revealed National Defence paid nearly $40,000 to move Ménard to the United Arab Emirates, according to a set of documents containing expense records for the military's top brass."}, {"url": "https://www.cbc.ca/news/politics/daniel-menard-former-canadian-general-still-in-afghan-jail-1.2535691", "page_content": "A retired former Canadian general who was removed from command in Afghanistan after he was caught having sex with a subordinate remains in jail in that country facing charges of gun smuggling.\n\nDaniel Menard's employer, the Canadian security company GardaWorld in a statement to CBC News confirmed their employee was still in prison – even though the company had been told two weeks ago that he would soon be released.\n\n“We had understood Mr. Menard’s release to be imminent. We are continuing to work with the Afghan authorities to resolve the matter and secure Dan’s release as soon as possible,\" GardaWorld spokesman Joe Gavaghan told CBC News.\n\nAt the end of January, CBC News reported Menard's release was imminent, based on that assurance from GardaWorld.\n\nA company spokesman told CBC News Ménard, who was reduced in rank to colonel following the affair, was detained by Afghan officials because of \"administrative issues related to licensing of the company's work in Afghanistan,\" but that \"issue has been resolved,\" and \"[Ménard] has his release authority.\"\n\nSketchy details\n\nBack then, the Afghan Embassy in Ottawa said the details it was hearing from Kabul were \"sketchy.\"\n\n\"All we can say at this point is that an investigation is underway to determine his role in the alleged gun smuggling,\" a spokesman told CBC News.\n\nA newspaper carrying a report from Kabul at the time also alleged Ménard's run-in with the law centred on accusations of possessing military equipment without permission, including 129 rifles and 148 radios.\n\nMénard is GardaWorld's managing director in Afghanistan, where he's responsible for the company's operations, \"including existing and new contracts with the U.S. government, non-governmental and commercial clients,\" according to the company's​ website.\n\nMénard once headed Canada's military mission in Afghanistan. His tenure in the country was cut short in 2010 when he was charged with fraternization for having a sexual liaison with a female subordinate.\n\nHe was charged and later pleaded guilty to two counts of conduct to the prejudice of good order and discipline, in violation of the National Defence Act.\n\nBy the time he was convicted, Ménard had already left the military, but was reduced in rank. He was also fined $7,000.\n\nIn 2012, two British employees of GardaWorld were arrested by Afghan authorities and faced similar accusations after being found with 30 allegedly unlicensed AK-47s. At the time, GardaWorld maintained its employees were planning to buy the weapons but wanted to test their functionality on a range first.\n\nGardaWorld also faced a forced shutdown of its operations as a result of those arrests."}, {"url": "https://www.cbc.ca/news/canada/montreal/ex-canadian-forces-commander-daniel-m%C3%A9nard-loses-rank-1.1108899", "page_content": "Retired brigadier-general Daniel Ménard was symbolically stripped of his rank and fined after pleading guilty to charges of violating military conduct laws and impeding an investigation.\n\nThe former commander of the Canadian Forces in Afghanistan admitted Thursday to a sexual liaison that wrecked his career and resulted in him being sent back to Canada in disgrace.\n\nA serious offence Ménard violated article 129 of the National Defence Act, which states, \"Any act, conduct, disorder or neglect to the prejudice of good order and discipline is an offence and every person convicted thereof is liable to dismissal with disgrace from Her Majesty's service or to less punishment.\" To the Canadian Forces, having intimate relationships with subordinates in a theatre of war can create serious ethical dilemmas, as retired Lt.-Col. Gilles Paradis explains: \"It's a matter of discipline and cohesiveness between the troops. Imagine, for instance, you send 10 soldiers in the field on patrol, and it's a very dangerous mission. The [commanding officer] is a a sergeant and he has a relationship with one his female soldiers, and he has to send someone ahead on a dangerous path where you could find some explosive device, and he never chooses that person. He always sends someone else. What would be the impact amongst his 10 soldiers, knowing that there's a personal relationship which has developed between those two. The other soldiers will lose confidence and will come to think that he is protecting his girlfriend.\"\n\nMénard was charged with two counts of conduct to the prejudice of good order and discipline, in violation of the National Defence Act.\n\nOne charge related to an alleged \"intimate personal relationship\" with a corporal under his command; the second charge was for allegedly trying to impede a military police investigation into the affair.\n\nLawyers for Ménard and the military jointly recommended a reduction in rank to colonel, which is symbolic as he is retired, and a fine of $7,000. On Thursday afternoon, a judge agreed to those penalties.\n\nMénard was initially also charged with four counts of obstructing justice, which were withdrawn before Thursday's hearing.\n\nMénard apologized to his wife and children when he pleaded guilty at a court martial in Montreal.\n\n\"I was humiliated and lost my reputation in my community,\" he said. \"I deeply regret my conduct.\"\n\nMénard served as top officer for Task Force Kandahar beginning in November 2009 but was relieved of duty following allegations that he had a sexual relationship with a subordinate, Master Cpl. Bianka Langlois. His guilty plea came at the start of his military trial.\n\nA former senior military official told CBC News earlier that if Ménard behaved as alleged, and did so during a mission, he should be punished.\n\nMaster Cpl. Bianka Langlois was charged with violating military fraternization regulations. (Courtesy of Global TV) \"I can probably name a half-dozen generals who have married, divorced and married, junior ranks people and such, so the question of fraternization is a very broad one,\" said Pat Stogran, the former Veterans Ombudsman and a retired Canadian colonel who went on several missions.\n\n\"But in an operational theatre, absolutely no question, it's reprehensible conduct of the highest order and you know he's got no business being in command.\"\n\nMénard, who had been based at CFB Valcartier near Quebec City, resigned on Dec. 17, 2010.\n\nLanglois was convicted of one count of conduct to the prejudice of good order and discipline. She was reprimanded and fined $700.\n\nIn May 2010, Ménard was fined $3,500 for mishandling a weapon.\n\nHe was handed the fine — the stiffest fine ever levied on a soldier for this offence — after pleading guilty to an offence under the National Defence Act in a court in Gatineau, Que.\n\nThe incident occurred as Ménard and his boss, Gen. Walt Natynczyk, were about to board a Blackhawk helicopter at Kandahar Airfield.\n\nMénard said he was loading his C8 carbine, when it went off. No one was injured and nothing was damaged, but the National Defence Act makes it an offence to accidentally discharge a weapon."}, {"url": "https://www.globalresearch.ca/role-mercenaries-afghan-disaster/5757605", "page_content": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\n***\n\nThe real story is much more than an adventure starring a Canadian hero.\n\nA CBC story about an ex-Canadian soldier who helped dozens flee Afghanistan ought to have considered the role of the private security industry in the disastrous 20-year-long war in that central Asian country. The large number of private security companies (PSC) in Afghanistan received barely any media attention, leaving Canadians ignorant of a controversial element of the foreign occupation.\n\nIn “How a guy known as ‘Canadian Dave’ helped get 100 people out of Afghanistan in final days of Taliban takeover” Judy Trinh writes about David Lavery helping get some of those gathered near the Kabul airport on to flights. A founding member of elite special forces unit JTF2, Lavery coordinated with veterans in this country to get over 100 individuals with Canadian papers out of the country.\n\nThe widely circulated story mentioned that Lavery operated a PSC, Raven Rae Consultancy, with some 50 Afghan employees. But a broader look at Raven Rae and PSCs was omitted from the article and most media reports about Afghanistan. According to its site, Raven Rae entered Afghanistan in 2010. It was one of thousands of PSCs that entered Afghanistan during the US and NATO occupation. According to private security industry researcher Anna Powles, Afghanistan “has been a gravy train for the global private security industry for the past two decades.” The US, Canada and other NATO countries dished out billions of dollars to PSCs.\n\nSome have suggested the Afghan military’s quick collapse was partly due to the withdrawal of PSC support. “It was their [PSCs] departure that led to the erosion of the capability of the Afghan Air Force elements, which were critical,” a former senior US commander in Afghanistan told Foreign Policy. “But how could they have been left behind when our forces that provided ultimate security for them were withdrawn?”\n\nAt the height of Canada’s 13-year military mission in Afghanistan Saladin, DynCorp and other PSCs had larger numbers of armed men than most of the NATO countries occupying Afghanistan. In 2008 Canadian Brigadier General Denis Thompson explained: “Without private security firms it would be impossible to achieve what we are achieving here. There are many aspects of the mission here in Afghanistan, many security aspects that are performed by private security firms that which, if they were turned over to the military, would make our task impossible. We just don’t have the numbers to do everything.”\n\nThe federal government spent tens, maybe hundreds, of millions of dollars on PSCs. They paid $10 million for private security to guard Canada’s “signature” $50 million aid project to repair the Dahla dam in Kandahar province. The federal government contracted Saladin to protect its embassy in Kabul. Saladin also helped secure Prime Minister Stephen Harper during a visit there in 2007 and protected forward operating bases in Kandahar province. Saladin has a troubling history. Its predecessor, KMS, trained and possibly equipped Islamic insurgents battling Russian forces in Afghanistan in the 1980s and it sent mercenaries into Nicaragua as part of the Iran Contra Affair.\n\nPrivate security firms in Afghanistan were poorly regulated. Many Afghans believed PSCs participated in crime and the large numbers of armed men from different groups made them feel insecure. Afghans told Swiss Peace Foundation researchers that PSCs behaved in a “cowboy-like” manner. After a Canadian officer was killed by a PSC employee in August 2008, Canadian Major Corey Frederickson effectively concurred, explaining that the “normal contact drill [for PSCs] is that as soon as they get hit with something then it’s 360 [degrees], open up on anything that moves.”\n\nAs is the case with Lavery, many former Canadian soldiers owned or worked for PSCs in Afghanistan. “Founded in the mid-2000s by Canadian military veterans”, Tundra Group protected forward operating bases in Afghanistan. Toronto company Globe Risk Holdings had offices in Kabul and Kandahar. It hired former Canadian soldiers as did Vancouver’s Canpro Global, which also had an office in Afghanistan.\n\nThe invasions of Afghanistan and Iraq helped propel Montréal based GardaWorld to be the world’s largest privately held PSC. In recent weeks hundreds of the Montréal company’s employees have been evacuated from Afghanistan.\n\nWith over 100,000 employees worldwide, Garda regularly advertises in Esprit du Corps calling on the magazine’s Canadian Forces readership to “translate your military skills into a Gardaworld career.” A number of former Canadian officers were in the upper echelons of Garda. The head of Garda’s Afghan operations, Daniel Ménard, previously commanded Canadian Forces operations in Afghanistan. Ménard had been court-martialled for having sexual relations with a subordinate in Afghanistan and recklessly discharging his weapon. While he worked for Garda, Ménard was also engulfed in controversy in Afghanistan. In 2014 he was jailed for allegedly smuggling guns. Two years earlier two other Garda employees in Afghanistan were caught with dozens of unlicensed AK-47 rifles and jailed for three months.\n\nGarda was also involved in numerous violent incidents in Afghanistan. In 2019 three children were among a dozen killed when a minibus full of explosives crashed into a Garda SUV carrying foreign nationals in Kabul. The same year the Taliban attacked the complex where Garda’s offices were located in an incident that left 30 dead. The Kathmandu Post reported that Garda illegally shortchanged the family of a Nepalese employee killed in the attack.\n\nThere are few regulations constraining Canadian PSCs’ international operations. Unlike the US and South Africa, notes “Beyond the Law? The Regulation of Canadian Private Military and Security Companies Operating Abroad”, “Canadadoes not have legislation designed to regulate either the services provided by Canadian PMSCs [private military security companies] operating outside of Canada or the conduct of Canadian citizens working for foreign PMSCs.”Furthermore, Ottawa has not signed the International Convention against the Recruitment, Use, Financing and Training of Mercenaries and has been little involved with the UN Human Rights Council’s Working Group on the use of mercenaries.\n\nThe foreign military pullout and Taliban capture of Kabul has decimated the large PSC industry in the country. Yet most Afghans are likely happy to see the end of private mercenary forces and hired guns dominating their country. This development has gone largely unreported by Canadian media.\n\nThe CBC owes Canadians a discussion of the role private security forces played in Afghanistan.\n\n*\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nFeatured image is from Yves Engler"}, {"url": "https://yvesengler.com/2021/10/01/the-role-of-mercenaries-in-afghan-disaster/", "page_content": "The real story is much more than an adventure starring a Canadian hero.\n\nA CBC story about an ex-Canadian soldier who helped dozens flee Afghanistan ought to have considered the role of the private security industry in the disastrous 20-year-long war in that central Asian country. The large number of private security companies (PSC) in Afghanistan received barely any media attention, leaving Canadians ignorant of a controversial element of the foreign occupation.\n\nIn “How a guy known as ‘Canadian Dave’ helped get 100 people out of Afghanistan in final days of Taliban takeover” Judy Trinh writes about David Lavery helping get some of those gathered near the Kabul airport on to flights. A founding member of elite special forces unit JTF2, Lavery coordinated with veterans in this country to get over 100 individuals with Canadian papers out of the country.\n\nThe widely circulated story mentioned that Lavery operated a PSC, Raven Rae Consultancy, with some 50 Afghan employees. But a broader look at Raven Rae and PSCs was omitted from the article and most media reports about Afghanistan. According to its site, Raven Rae entered Afghanistan in 2010. It was one of thousands of PSCs that entered Afghanistan during the US and NATO occupation. According to private security industry researcher Anna Powles, Afghanistan “has been a gravy train for the global private security industry for the past two decades.” The US, Canada and other NATO countries dished out billions of dollars to PSCs.\n\nSome have suggested the Afghan military’s quick collapse was partly due to the withdrawal of PSC support. “It was their [PSCs] departure that led to the erosion of the capability of the Afghan Air Force elements, which were critical,” a former senior US commander in Afghanistan told Foreign Policy. “But how could they have been left behind when our forces that provided ultimate security for them were withdrawn?”\n\nAt the height of Canada’s 13-year military mission in Afghanistan Saladin, DynCorp and other PSCs had larger numbers of armed men than most of the NATO countries occupying Afghanistan. In 2008 Canadian Brigadier General Denis Thompson explained: “Without private security firms it would be impossible to achieve what we are achieving here. There are many aspects of the mission here in Afghanistan, many security aspects that are performed by private security firms that which, if they were turned over to the military, would make our task impossible. We just don’t have the numbers to do everything.”\n\nThe federal government spent tens, maybe hundreds, of millions of dollars on PSCs. They paid $10 million for private security to guard Canada’s “signature” $50 million aid project to repair the Dahla dam in Kandahar province. The federal government contracted Saladin to protect its embassy in Kabul. Saladin also helped secure Prime Minister Stephen Harper during a visit there in 2007 and protected forward operating bases in Kandahar province. Saladin has a troubling history. Its predecessor, KMS, trained and possibly equipped Islamic insurgents battling Russian forces in Afghanistan in the 1980s and it sent mercenaries into Nicaragua as part of the Iran Contra Affair.\n\nPrivate security firms in Afghanistan were poorly regulated. Many Afghans believed PSCs participated in crime and the large numbers of armed men from different groups made them feel insecure. Afghans told Swiss Peace Foundation researchers that PSCs behaved in a “cowboy-like” manner. After a Canadian officer was killed by a PSC employee in August 2008, Canadian Major Corey Frederickson effectively concurred, explaining that the “normal contact drill [for PSCs] is that as soon as they get hit with something then it’s 360 [degrees], open up on anything that moves.”\n\nAs is the case with Lavery, many former Canadian soldiers owned or worked for PSCs in Afghanistan. “Founded in the mid-2000s by Canadian military veterans”, Tundra Group protected forward operating bases in Afghanistan. Toronto company Globe Risk Holdings had offices in Kabul and Kandahar. It hired former Canadian soldiers as did Vancouver’s Canpro Global, which also had an office in Afghanistan.\n\nThe invasions of Afghanistan and Iraq helped propel Montréal based GardaWorld to be the world’s largest privately held PSC. In recent weeks hundreds of the Montréal company’s employees have been evacuated from Afghanistan.\n\nWith over 100,000 employees worldwide, Garda regularly advertises in Esprit du Corps calling on the magazine’s Canadian Forces readership to “translate your military skills into a Gardaworld career.” A number of former Canadian officers were in the upper echelons of Garda. The head of Garda’s Afghan operations, Daniel Ménard, previously commanded Canadian Forces operations in Afghanistan. Ménard had been court-martialled for having sexual relations with a subordinate in Afghanistan and recklessly discharging his weapon. While he worked for Garda, Ménard was also engulfed in controversy in Afghanistan. In 2014 he was jailed for allegedly smuggling guns. Two years earlier two other Garda employees in Afghanistan were caught with dozens of unlicensed AK-47 rifles and jailed for three months.\n\nGarda was also involved in numerous violent incidents in Afghanistan. In 2019 three children were among a dozen killed when a minibus full of explosives crashed into a Garda SUV carrying foreign nationals in Kabul. The same year the Taliban attacked the complex where Garda’s offices were located in an incident that left 30 dead. The Kathmandu Post reported that Garda illegally shortchanged the family of a Nepalese employee killed in the attack.\n\nThere are few regulations constraining Canadian PSCs’ international operations. Unlike the US and South Africa, notes “Beyond the Law? The Regulation of Canadian Private Military and Security Companies Operating Abroad”, “Canadadoes not have legislation designed to regulate either the services provided by Canadian PMSCs [private military security companies] operating outside of Canada or the conduct of Canadian citizens working for foreign PMSCs.”Furthermore, Ottawa has not signed the International Convention against the Recruitment, Use, Financing and Training of Mercenaries and has been little involved with the UN Human Rights Council’s Working Group on the use of mercenaries.\n\nThe foreign military pullout and Taliban capture of Kabul has decimated the large PSC industry in the country. Yet most Afghans are likely happy to see the end of private mercenary forces and hired guns dominating their country. This development has gone largely unreported by Canadian media.\n\nThe CBC owes Canadians a discussion of the role private security forces played in Afghanistan.\n\nYves Engler’s latest book is Stand on Guard For Whom? — A People’s History of the Canadian Military\n\nPlease follow and like us:"}, {"url": "https://www.cbc.ca/news/canada/canadian-co-relieved-of-kandahar-duty-1.906647", "page_content": "Brig.-Gen. Daniel Ménard has been relieved of command of Canadian troops in Afghanistan following allegations he was involved in an inappropriate personal relationship while in theatre.\n\nMilitary sources have told CBC News that Ménard, head of Joint Task Force Kandahar, is alleged to have had an affair with a female member of his staff.\n\nThe military has strict rules forbidding its personnel from engaging in personal relationships while in theatre. They include relationships of an emotional, romantic or sexual nature.\n\nThe Defence Department issued a statement saying only that the decision was made following \"allegations concerning Ménard's inappropriate conduct related to the Canadian Forces personal relationships and fraternization directives.\"\n\nMénard's spouse also serves in the Forces.\n\nCol. Simon Hetherington said Lt.-Gen. Marc Lessard made the decision to relieve Ménard of his duties after he lost confidence in Ménard's ability to command.\n\nAn investigation into the allegations has been launched, DND said.\n\nHetherington has been designated acting commander in the interim. In the near future, Brig.-Gen. Jon Vance will assume command, pending the arrival of the next commander, Brig.-Gen. Dean Milner, DND said.\n\nEarlier this week, Ménard was fined $3,500 — the stiffest fine ever levied on a soldier for mishandling a weapon.\n\nHe received the fine after pleading guilty to an offence under the National Defence Act in a court in Gatineau, Que.\n\nThe March 25 incident occurred as Ménard and his boss, chief of defence staff Gen. Walt Natynczyk, were about to board a Blackhawk helicopter at Kandahar Airfield.\n\nMénard said he was loading his C8 carbine, something he has done thousands of times, when it discharged. No one was injured and nothing was damaged, but the National Defence Act makes it an offence to accidentally discharge a weapon.\n\nMénard formally took over from Vance as top officer for Task Force Kandahar last November."}, {"url": "https://jacobin.com/2021/10/canadian-private-security-military-contractor-companies-afghanistan-war-mercenaries-david-lavery", "page_content": "Our new issue on conspiracy is out now. Subscribe today to get it in print at a special discounted rate!\n\nLast month, the CBC’s Judy Trinh filed a story about ex–special forces David Lavery’s efforts to get dozens of people out of Kabul before the Taliban takeover. A founding member of Joint Task Force 2, an elite branch of Canada’s armed forces primarily tasked with counterterrorism, Lavery coordinated with veterans to help over a hundred individuals with Canadian papers flee the South Central Asian nation. The story reads like a made-for-TV action movie. Beneath the confected heroics lies a far more troubling narrative about the Wild West of private-security profiteering. This is a story that Canada’s mainstream media refuses to give the light of day.\n\nPrivate Security, Public Money Throughout the disastrous twenty-year-long war in Afghanistan, Canada has been heavily reliant on private security companies (PSCs) to aid the war effort. Despite the prevalence of PSCs in the North American nation’s operations in Afghanistan, their presence has garnered barely any media attention. Canadians are largely ignorant of this controversial element of the foreign occupation. Media narratives about Lavery have mentioned that he operated the PSC Raven Rae Consultancy Services, which employed some fifty Afghan nationals. News outlets have, however, refrained from focusing on Lavery’s company with the same level of attention they have applied to his heroics. According to its site, Raven Rae began its operations in Afghanistan in 2010. It was one of the thousands of PSCs that entered Afghanistan during the US and NATO occupation. Private security industry researcher Anna Powles has gone so far as to say that Afghanistan “has been a gravy train for the global private security industry for the past two decades.” So integral were PSCs to the day-to-day running of military operations in Afghanistan that a former senior US commander remarked that their departure “led to the erosion of the capability of the Afghan Air Force.” In the same interview, the anonymous ex-military official added that without the “ultimate security” of the military, these private armies had no choice but to withdraw. At the height of Canada’s thirteen-year military mission in Afghanistan, Saladin, DynCorp, and other PSCs had larger numbers of armed men at their disposal than most of the NATO countries occupying the country. In 2008, Canadian brigadier-general Denis Thompson explained: Without private security firms it would be impossible to achieve what we are achieving here. There are many aspects of the mission here in Afghanistan, many security aspects that are performed by private security firms that which, if they were turned over to the military, would make our task impossible. We just don’t have the numbers to do everything. The federal government spent tens of millions of dollars on PSCs. They paid $10 million for private security to guard Canada’s signature $50 million aid project — the repair of the Dahla Dam in Kandahar province. The federal government also contracted Saladin to protect its embassy in Kabul. Saladin was the same company that helped secure Prime Minister Stephen Harper during a visit in 2007 and was charged with the protection of forward operating bases in Kandahar province. Saladin has a history that should worry anyone concerned with the dangers of privately owned militaries. Its predecessor, Keenie Meenie Services, trained and possibly equipped Islamic insurgents battling Russian forces in Afghanistan in the 1980s. It was also implicated in covert operations in Nicaragua as part of the Iran-Contra Affair."}, {"url": "https://www.cbc.ca/news/world/5-canadians-killed-in-afghanistan-1.782043", "page_content": "Reporter Michelle Lang of the Calgary Herald was among five Canadians killed by a bomb in Afghanistan on Wednesday. (Calgary Herald)\n\nFive Canadians — four soldiers and a Calgary Herald reporter — were killed in a bomb blast Wednesday in Afghanistan.\n\nBrig.-Gen. Daniel Ménard said a Canadian civilian was also wounded in the attack at about 4 p.m. local time.\n\nMénard said the group's armoured vehicle was struck by an improvised explosive device in the city of Kandahar. The attack came during a community security patrol to gather information on the pattern of life and maintain security in the area.\n\n\"The journalist was travelling with them to tell the story of what Canada's soldiers are doing in Afghanistan,\" he said.\n\nMénard said the military is notifying the families of the soldiers and more information will be provided once this has been completed.\n\n\"On behalf of all Canadians, the prime minister offers his most sincere condolences to the loved ones of those who lost their lives in Afghanistan earlier today,\" the Prime Minister's Office said in a statement.\n\n\"While not regularly the subject of news, those journalists who risk their lives reporting alongside the men and women of the Canadian Forces in one of the most dangerous regions in the world should not be forgotten,\" said spokesman Dimitri Soudas.\n\nThe journalist was identified as Michelle Lang of the Calgary Herald. Lang, 34, grew up in Vancouver and was a respected health reporter for the Herald, winning a National Newspaper Award in 2008 for best beat reporting. She had also worked in Regina, Moose Jaw and Prince George.\n\nReporter mourned by friends, colleagues\n\nFriends said Lang, who was recently engaged and planned to marry next summer, was bright with a sharp tongue and quick wit.\n\n\"She came across as sweet and quiet — but could bring a room down with laughter with one observation,\" one friend said. \"She was a fabulous friend: kind, loyal, thoughtful. No number of adjectives can describe her talent, her charm or the hole she leaves in the lives of those close to her.\"\n\nCBC reporter James Murray, who is stationed in Afghanistan, said: \"She was the kind of journalist you would want to have here. She was kind and decent and curious.\n\n\"She'd been in Afghanistan for just a few weeks and she had spent a lot of that time in the field, bravely going and putting on a helmet and body armour and going where the Canadian soldiers go, seeing what they did, giving a first-hand account of the Canadian mission in Afghanistan.\n\n\"And reporting in that way has cost her her life.\"\n\nLorne Motley, the Calgary Herald's editor in chief, said Lang's death has devastated her colleagues at the newspaper.\n\n'She was professionally at the top of her craft.'—Calgary Herald editor in chief Lorne Motley\n\n\"This has been a really tough day here, probably the blackest day I can remember in the recent history of the Calgary Herald,\" Motley said.\n\n\"Above her journalism she was kind-hearted and warm and great. Just one of those people you can love. She was professionally at the top of her craft.\"\n\nCanadian Brig.-Gen. Daniel Ménard, top commander in Kandahar, announces the deaths of four soldiers and a Calgary Herald reporter. ((Colin Perkel/Canadian Press) ) The huge blast occurred just 1,500 metres from the Dand district centre, which Canadian soldiers helped rebuild after a suicide bombing in April.\n\nWitnesses described panic among local residents, as Canadian soldiers rushed to secure the area and airlift the blast victims to medical care.\n\nNevertheless, Ménard declared that Dand remained a \"safe area\" and expressed confidence that this was an isolated incident.\n\nThe deaths of the five Canadians came a week after Lt. Andrew Nuttall was killed by an explosive device near the village of Nakhonay, about 25 kilometres southwest of Kandahar city.\n\nIt was the worst single day for Canadian casualties in Afghanistan since six soldiers were killed on July 4, 2007, when their large armoured vehicle struck a roadside bomb about 20 kilometres southwest of Kandahar.\n\nSince 2002, when Canada started sending soldiers to Afghanistan, 138 of them have been killed, as well as four Canadian civilians. Lang was the first Canadian journalist killed while covering the conflict. Seven journalists from other countries have also died.\n\nThe attack happened the same day eight Americans were killed in an attack on a military base in the eastern province of Khost."}, {"url": "https://www.khaama.com/former-canadian-army-general-jailed-in-afghanistan-2738/", "page_content": "According to reports, a former Canadian Army General who was working for a private security firm has been jailed in Afghanistan since three weeks.\n\nDaniel Ménard, the former Canadian brigadier-general was reportedly arrested by Afghan security forces or about 12 January 2014.\n\nMénard, who was working for a private security firm Garda World, was arrested while he was returning from a meeting with the Afghan government officials, the company officials said.\n\nJoe Gavaghan, a spokesman for the company quoted by The Toronto Star, said, “He was leaving a meeting at the ministry office and a couple of officials approached him. They said, ‘We’ve got a problem with something and we’d like you to come with us to clear it up.’ Off he went and the next thing he knew he was going to be detained until they cleared it up.”\n\nGavaghan further added that Ménard has not been charged with breaking any laws, and has been arrested due to misunderstandings related to its licence to operate in Afghanistan as a private security firm.\n\nThe former commander of the 5 Canadian Mechanized Brigade Group, based out of CFB Valcartier, appeared in a Kabul court Wednesday, Gavaghan added.\n\nMénard was reportedly fined and demoted for having sexual relationship with with a female corporal under his command on active duty.\n\nHe has managed Garda’s operations in Afghanistan since November 2011, after he was relieved of his command of Canadian troops responsible for Kandahar region in May 2010."}]}