{"Modibo Adama (1830\\u20131883) was a West African ruler who founded the Adamawa Emirate in what is now northeastern Nigeria and northern Cameroon.": [{"url": "https://joshuaproject.net/people_groups/11774/NI", "page_content": "Introduction / History\n\nIn the 1800s, Modibo Adama, a scholar and Muslim holy warrior, led a jihad in what is now Cameroon and Nigeria, opening the region up to Fulani colonization. He continued his campaign, eventually conquering many villages and founding his own empire, which he named Adamawa after himself. His Fulani people established Islam as the religion in the region. New converts learned classical Arabic in order to study the Koran. To support themselves, the people raised cattle on land that was once forested.\n\n\n\nIn general, the Fulani peoples are located in an almost horizontal strip across West Africa. The Sahara Desert forms their northernmost boundary, while the threat of tsetse flies controls their movement to the south. The Fulani tribes are grouped and named according to their locations, occupations, and dialects. The Adamawa Fulani are the group of Fulani who live in Nigeria's Adamawa Province. Some live in Cameroon, Chad, Gabon, and Sudan. There are also a small number in Cape Verde.\n\nWhat Are Their Lives Like?\n\nAlthough most of the Adamawa Fulani are shepherds, some also raise a few crops such as sorghum or corn. They trade with neighboring tribes for millet, yams, and peanuts. Milk is the main staple in their diet, and this distinguishes them from the tribes who do not milk their cattle. They also produce butter, which can be traded in the markets.\n\n\n\nThe Fulani nomads live in \"wet season camps\" while planting and harvesting. The pastures are lush and green, and the cattle graze freely. These camps consist of beehive-like huts made of woven twigs, leaves, and grass. During the dry seasons they camp in portable huts, moving the cattle or sheep to well-watered lands in the flood plains.\n\n\n\nAdamawa Fulani men hunt, trade livestock, and tend to the herds. While the older men exercise the leadership of the tribes, it is the duty of the younger men to move the herds. Young boys are responsible for helping their older brothers with the herds. The women usually milk the cattle and sell butter in the markets.\n\n\n\nOver the years, some of the Adamawa Fulani have advanced from being exclusively livestock herders to being scholarly, influential leaders in their communities. These people are likely to become political leaders in Nigeria.\n\n\n\nThese people have the potential to become political leaders in Nigeria.\n\nThese people have the potential to beome political leaders in Nigeria.\n\nWhat Are Their Beliefs?\n\nThe Fulani are a proud people who teach their young children to have dignity. The Adamawa Fulani are expected to follow a code of high moral behavior known as Pulaaku. Pulaaku extols virtues such as kindness, bravery, patience, tolerance, perseverance, honesty, diligence, generosity, and dignity. To be reserved is part of being dignified; thus, they are shy and modest in public. A mother does not show affection to her infant son. In fact, she never even calls her firstborn by his name all throughout his life.\n\n\n\nIn terms of spiritual beliefs, the Adamawa Fulani are almost entirely Sunni Muslim with many animistic beliefs blended in.\n\nWhat Are Their Needs?\n\nPrayer Points\n\nPray for abundant rain for the Adamawa Fulani as a testimony of God's love and power.\n\n\n\nPray for compassionate believers to take Christ to the Adamawa Fulani people.\n\n\n\nPray for courage and safety for missionaries who venture into Adamawa Province to take the gospel of peace.\n\n\n\nPray for a church planting movement among the Adamawa Fulani people.\n\nScripture Prayers for the Fulani, Adamawa in Nigeria.\n\nReferences\n\nhttp://www.globalprayerdigest.org/index.php/issue/day/2016/02/07\n\n\n\nhttps://en.wikipedia.org/wiki/Modibo_Adama\n\n\n\nhttp://www.peoplegroups.org/Explore/groupdetails.aspx?peid=42895\n\n\n\nhttps://www.informationng.com/2016/07/adamawa-community-th"}, {"url": "https://en-academic.com/dic.nsf/enwiki/1204459", "page_content": "Adama bi Ardo Hassana (c. 1786 – c. 1847), more commonly known as Modibo Adama, was a Fulani scholar and holy warrior. He led a jihad into the region of Fumbina (in modern day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon, and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurina and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fumbina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Emir of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon.\n\nEarly life\n\nAdama came from a respected but humble family; his father, Hassana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. He continued his studies in Hausaland (modern Northern Nigeria), where legend says his teacher was the Fulani Shehu Usman dan Fodio in Degel. Adama proved a bright scholar and a pious Muslim, and he earned the title Modibo, \"Lettered One\". After several years away, he returned home to Guringa around 1804. There, the news was grim. Adama's father had died in 1803 fighting the Bata.\n\nJihad\n\nTalk in Gurina also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated non-Fulani leaders at Gobir and Kébbi. Usman had now turned his attention to Bornu and to the vast southlands of Fumbina (modern-day Northern Cameroon).\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa assembled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves to the Fulani and convert to their faith.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain. Sentiment for jihad was high.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on class or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councilors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe, who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000 km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Emir of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned grasses that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated.\n\nReferences\n\nDeLancey, Mark W., and DeLancey, Mark Dike (2000): Historical Dictionary of the Republic of Cameroon (3rd ed.). Lanham, Maryland: The Scarecrow Press.\n\n(3rd ed.). Lanham, Maryland: The Scarecrow Press. Fanso, V. G. (1989). Cameroon History for Secondary Schools and Colleges, Vol. 1: From Prehistoric Times to the Nineteenth Century. Hong Kong: Macmillan Education Ltd.\n\nHong Kong: Macmillan Education Ltd. Johnston, H. A. S. (1967): The Fulani Empire of Sokoto . Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press.\n\n. Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press. Ngoh, Victor Julius (1996): History of Cameroon Since 1800 . Limbe: Presbook.\n\n. Limbe: Presbook. Njeuma, Martin Z. (1990): \"The lamidates of northern Cameroon, 1800-1894\", Introduction to the History of Cameroon in the Nineteenth and Twentieth Centuries. Palgrave MacMillan.\n\nPreceded by\n\nnone Emir of Adamawa\n\n1806-1847 Succeeded by\n\nMuhammadu Lawal bi Adama"}, {"url": "https://www.howold.co/person/modibo-adama/biography", "page_content": "Modibo Adama Biography\n\nAdama ɓii Ardo H*ana (1786 – 1847), more commonly known as Modibbo Adama, was a Fulani scholar and holy warrior, who hailed from the Ba'en clan of Fulbe. He led a jihad into the region of Fombina (in modern-day Cameroon and Nigeria).\n\nAdama studied in Hausaland and earned the *le \"Modibbo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurin and learned of the jihad declared by Fulani mystic Usman dan Fodio, who ordered Adama to extend his jihad east as \"Lamido Fombina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin, then took on Mandara, the largest and best organised state in the region, and eventually conquered the Mandara capital, Dulo, with ease. However, the Mandara army counterattacked and recaptured the town. Though he fought many more campaigns, Adama spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself, which was subordinate only to Usman dan Fodio in Sokoto. Upon Adama's death in 1847, his son Muhammadu Lawal became Lamido of Adamawa, but colonial battles and division eventually destroyed the independent Fulani state.\n\nAs a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon (at more than 60% of the region's entire population, which considering the fact that they weren't from the area, is a remarkable feat), and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nEarly life\n\nAdama came from a respected but humble family; his father, H*ana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama's family were part of a Fulani group being led by an Ardo Haman. They settled in Gurin a few years after Adama's birth. They later crossed Mayo-Faro, being the first group of Fulbe to cross the river, looking for pasturage. When Adama became old enough, he left the party to pursue knowledge.\n\nAdama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. Adama proved a bright scholar and a pious Muslim, and he earned the *le Modibbo, \"Lettered One\". Whilst on a trip away from Bornu (most likely in Gombe), he heard rumours of the vibrant Islamic Scholarly scene in Degel. He returned home to Gurin shortly after this trip. The party he had left had built a town on the Faro river. He remained there becoming a teacher especially to Ardo Haman. He later decided to continue his pursuit of knowledge. He left his party again but leaving his Quran with Ardo Haman to teach in his place. He left for Degel accompanied by another Mallam Haman (later Lamido of Song). He was teaching and learning in Degel where might have been taught by Shaikh Usman dan Fodio.\n\nJihad\n\nTalk in Guringa also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated Hausa rulers at Gobir and Kebbi. Usman had now turned his attention to Bornu and to the vast southlands of Fombina (modern-day Northern Cameroon and North-Eastern Nigeria).\n\nAdama's mandate\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa *embled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves or convert to Islam.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves. It was during these battles that Adama received the news that his father was killed by the Bata on the Beti River. Modibbo Adama's force continued their battles against Bata and Lala peoples as far as the Gongola River, where he met the Lamido of Gombe, Buba Yero. The two joined forces and fought back the Yanguru, Hona and Kibba peoples. The two forces eventually stopped and both went homewards.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on cl* or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councillors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe (singular: lamido), who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000:km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Lamido of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned gr*es that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated.\n\nNotes\n\nDeLancey, Mark W., and DeLancey, Mark Dike (2000): Historical Dictionary of the Republic of Cameroon (3rd ed.). Lanham, Maryland: The Scarecrow Press.\n\n(3rd ed.). Lanham, Maryland: The Scarecrow Press. Fanso, V. G. (1989). Cameroon History for Secondary Schools and Colleges, Vol. 1: From Prehistoric Times to the Nineteenth Century. Hong Kong: Macmillan Education Ltd.\n\nHong Kong: Macmillan Education Ltd. Johnston, H. A. S. (1967): The Fulani Empire of Sokoto . Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press.\n\n. Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press. Ngoh, Victor Julius (1996): History of Cameroon Since 1800 . Limbe: Presbook.\n\n. Limbe: Presbook. Njeuma, Martin Z. (1990): \"The lamidates of northern Cameroon, 1800–1894\", Introduction to the History of Cameroon in the Nineteenth and Twentieth Centuries. Palgrave MacMillan.\n\nReferences"}, {"url": "https://www.liquisearch.com/modibo_adama", "page_content": "Adama bi Ardo Hassana (c. 1786 – c. 1847), more commonly known as Modibo Adama, was a Fulani scholar and holy warrior. He led a jihad into the region of Fumbina (in modern day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon, and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurina and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fumbina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Emir of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon."}, {"url": "https://alchetron.com/Modibo-Adama", "page_content": "Adama ɓii Ardo Hassana (1786 – 1847), more commonly known as Modibo Adama, was a Fulani scholar and holy warrior, who hailed from the Ba'en clan of Fulbe. He led a jihad into the region of Fumbina (in modern-day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon (at more than 60% of the region's entire population, which considering the fact that they weren't from the area, is a remarkable feat), and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurin and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fumbina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Lamido of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon.\n\nEarly life\n\nAdama came from a respected but humble family; his father, Hassana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. He continued his studies in Hausaland (modern Northern Nigeria), where legend says his teacher was the Fulani Shehu Usman dan Fodio in Degel. Adama proved a bright scholar and a pious Muslim, and he earned the title Modibo, \"Lettered One\". After several years away, he returned home to Guringa around 1804. There, the news was grim. Adama's father had died in 1803 fighting the Bata.\n\nJihad\n\nTalk in Gurina also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated non-Fulani leaders at Gobir and Kébbi. Usman had now turned his attention to Bornu and to the vast southlands of Fumbina (modern-day Northern Cameroon).\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa assembled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves to the Fulani and convert to their faith.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain. Sentiment for jihad was high.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on class or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councillors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe, who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000 km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Emir of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned grasses that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated."}, {"url": "https://hyperleap.com/topic/Modibo_Adama", "page_content": "Adamawa Emirate 2 links 2 links\n\nTraditional state located in Fombina, an area which now roughly corresponds to areas of Adamawa State and Taraba state in Nigeria, and previously also in the three northern provinces of Cameroon (Far North, North, and Adamawa), including minor Parts of Chad and the Central African Republic.\n\nTraditional state located in Fombina, an area which now roughly corresponds to areas of Adamawa State and Taraba state in Nigeria, and previously also in the three northern provinces of Cameroon (Far North, North, and Adamawa), including minor Parts of Chad and the Central African Republic."}, {"url": "https://heimduo.org/what-is-modibo-adama/", "page_content": "What is Modibo Adama?\n\nIn Adamawa. The emirate was founded by Modibbo Adama, who, under the authority of Sheikh Usman dan Fodio, began a Fulani jihad (holy war) in the region in 1809. Adama moved the capital of his kingdom, which was then known as Fumbina, several times before settling it finally in 1841 in Yola,… Read More.\n\nWho created Adamawa?\n\nModibo Adama\n\nThe name “Adamawa” came from the founder of the kingdom, Modibo Adama, a regional leader of the Fulani Jihad organized by Usman dan Fodio of Sokoto in 1804. Modibo Adama came from the region of Gurin (now just a small village) and in 1806, received a green flag for leading the jihad in his native country.\n\nIs Adamawa a Fulani state?\n\nAdamawa, state, northeastern Nigeria. It was administratively created in 1991 from the northeastern half of former Gongola state. Besides the dominant Fulani, Adamawa is also inhabited by the Mumuye, Higi, Kapsiki, Chamba, Margi (Marghi), Hausa, Kilba, Gude, Wurkum, Jukun, and Bata peoples.\n\nHow many emirates are there in Adamawa State?\n\n8 Emirates\n\nSensitization Of Traditional Rulers (104 District Head And 16 Secretaries) From 8 Emirates In Adamawa State.\n\nHow much is MAUTECH school fees?\n\nMAUTECH Tuition fees for 2021/2022 academic session will be detailed below….MAUTECH SCHOOL FEES FOR FRESH/NEW STUDENTS 2021/2022 ACADEMIC SESSION.\n\nFACULTIES/DEPARTMENTS 100 LEVEL 200 LEVEL (DE) Physics (PHY) 37,300 37,300 Statistics (STA) 37,300 37,300 Operations Research (OPR) 37,300 37,300 Geology (GLY) 42,300 42,300\n\nIs MAUTECH admission list out?\n\nMAUTECH admission list – The names of candidates offered provisional admission into the Modibbo Adama University of Technology (MAUTECH) various first-degree programmes for the 2020/2021 academic session are out.\n\nWhich state is close to Taraba?\n\nTaraba is bordered on the north by Bauchi and Gombe states, on the east by Adamawa state, on the south by Cameroon, and on the west by Benue, Nassarawa, and Plateau states.\n\nHow many languages are in Nigeria?\n\nThere are over 527 native languages spoken in Nigeria. The official language of Nigeria is English, the language of former colonial British Nigeria….\n\nLanguages of Nigeria Official English Regional Hausa, Yoruba, Igbo, Fulfulde, Ijaw, Edo, Ibibio, Kupa, Kanuri, Tiv, Nupe, and others\n\nWhich country are Fulani from?\n\nFulani, also called Peul or Fulbe, a primarily Muslim people scattered throughout many parts of West Africa, from Lake Chad, in the east, to the Atlantic coast. They are concentrated principally in Nigeria, Mali, Guinea, Cameroon, Senegal, and Niger.\n\nHow many tribes are in Taraba?\n\n40 different tribes\n\nThere are over 40 different tribes and their languages in Taraba State.\n\nWhat region is Adamawa?\n\nAt almost 64,000 km² in land area, the Adamawa is the third largest of Cameroon’s ten regions. The land is rugged and sparsely populated, however, as most is devoted to the rearing of cattle….Adamawa Region.\n\nAdamawa • Total 63,701 km2 (24,595 sq mi) Population (2015) • Total 1,200,970 HDI (2017) 0.504 low · 8th of 10\n\nWhat is Mautech acceptance fee?\n\nMAUTECH Admission Acceptance Fee Amount All successfully admitted candidates in the 2020/2021 Modibbo Adama University of Technology (MAUTECH) admissions exercise (100 Level and Direct Entry) are expected to pay a non-refundable Acceptance Fee of Thirty thousand Naira (N30,000) only."}, {"url": "https://en-academic.com/dic.nsf/enwiki/1211300", "page_content": "Adamawa or the Adamawa Emirate was a traditional emirate located in Fumbina , what is now the Adamawa State , Nigeria and the three northern provinces of Cameroon (Far North, North, and Adamawa). It was founded by Modibbo Adama , a commander of Sheikh Usman dan Fodio , the man who began the Fulani jihad in 1809. The capital was moved several times until it settled in Yola in 1841. At the time of Adama's death his realm encompassed parts of modern Nigeria and much of north Cameroon . It was technically part of the Fulani Empire , and it had to pay a tribute to the leaders in Sokoto .\n\nEarly History\n\nThe Fula first settled the area in the 14th century. [Canby, Courtlandt. \"The Encyclopedia of Historic Places\". (New York: Facts of File Publicantions, 1984) p. 7]\n\nReferences"}, {"url": "https://wiki2.org/en/Adamawa_Emirate", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nThe Adamawa Emirate (Fula: Lamorde Adamaawa 𞤤𞤢𞤥𞤮𞤪𞤣𞤫 𞤢𞤣𞤢𞤥𞤢𞥄𞤱𞤢; Arabic: إمارة أداماوة; German: Adamaua; French: Adamaoua) is a traditional state located in Fombina, an area which now roughly corresponds to areas of Adamawa State and Taraba state in Nigeria, and previously also in the three northern provinces of Cameroon (Far North, North, and Adamawa), including minor Parts of Chad and the Central African Republic. The name Adamawa derives from its founder Modibbo Adama, and the suffix 'wa' is appended in the Hausa language to signify the collective identity of 'people of' that place, so, 'Adamawa' means \"people of Adama\".[2]\n\nModibo Adama was a commander of Sheikh Usman dan Fodio, the man who began the Fulani jihad in 1809. The capital was moved several times until it settled in Yola, Nigeria on the banks of the Benue River in Nigeria around 1841. At the time of Adama's death his realm encompassed parts of modern Nigeria and much of north Cameroon. Much like the other emirates in the Sokoto Caliphate, Adamawa enjoyed considerable autonomy but it had to pay a tribute to the Sultan in Sokoto.\n\nThe nineteenth century Adamawa emirate lay south of Lake Chad, and east of Hausaland, within latitudes 6° and 11° North, and longitudes 10° and 14° East. The external limits are hard to fix in exact terms, because it is difficult to distinguish between people who the Fulani subjected to their rule, and those whom they simply raided for slaves, without establishing any form of administrative links. According to some estimates, by the late 19th century, slaves constituted about 50% of the population of the Fulɓe-ruled Adamawa Emirate, where they were referred to as jeyaɓe (singular jeyado). Based on the region subjected to Fulani rule, the emirate stretched from areas south of the Adamawa plateau near Tibati, in the South, to the Diamare, in the north, from the slopes of the Bamenda-Adamawa-Mandara Highlands in the west, to Baya, Laka, Mundang and Musgum country in the east. Early British administrators reporting from Yola, put the surface area of Adamawa at between 35,000 and 40,000 square miles or between 90,650 and 103,600 square kilometers. As a result of European treaties in 1893 and 1894, parts of the Emirate can today be found in Chad, the Central African Republic, Nigeria and Cameroon, which retained about three-quarter of the total area of the emirate.\n\nThe altitude of much of the country lies at around 2,000 ft (610 m) above sea level. The Adamawa plateau itself however, called the Leydi Hossere by the Fulbe, rises to a general elevation of 4,000 ft (1,200 m), and forms the watershed, from which streams of water drain into the Benue river system, as well as into the inland basin of Lake Chad. Great altitudes of between 5,000 and 7,000 ft or between 1,525 and 2,150 meters above sea level are found, towards the western border region of the emirate with other regions of Nigeria and Cameroon, these are sections of the Cameroon-Bamenda-Adamawa-Mandara highland range which have record heights of about 13,350 ft (4,070 m) above sea level near the coast and steadily decreases northwards, to just around 4,000 ft (1,200 m) near Yola, the emirate's capital city. North of Yola, these range of highlands is continued by the Mandara Mountains at over 6,000 ft (1,800 m), before finally tapering out around Balma, into the lake chad basin. The southern regions of the emirate is characterized by thin forest of broad leaved savannah woodland or orchard vegetation type. The country becomes more and more of open grasslands towards the north. The vegetation was a strong inducement to Fulani settlement in Adamawa, and during the jihad, it offered no serious obstacle to the extension of military power based on cavalry.\n\nYouTube Encyclopedic\n\n1 / 5 Views: 10 922 1 047 5 792 364 2 840\n\nA Super Quick History of Cameroon\n\nmap of Cameroon Africa\n\nCamerún 🇨🇲 TODO lo que necesitas saber ⚽🚌🏞\n\nHistory of Sheikh Usman Dan Fodio\n\nSokoto Caliphate | History of Sokoto Caliphate | Who Was Usman Dan Fodio | African History | Transcription\n\nHistory\n\nPre-jihad\n\nThe earliest reference of Fulbe around the area of the Adamawa region was in the Kanem-Bornu empire when they came as envoys of the emperor of Mali during the 13th-century. A century later, more Fulbe migrated to Hausaland especially to Kano during the reign of Yakubu. These Fulani settlers brought many books on Islamic thought and Law from Mali. Some others continued further east to Bornu and settled there. There was a steady flow of Fulbe immigrants to this region and by the 16th-century there were considerable number of them in Hausaland, Bornu, Bagirmi and among the Jukun in Kwararafa.[3][4]\n\nFulbe Under Bornu\n\nA Fulani from the Sokoto Caliphate\n\nThe Fulbe became known for their learning and understanding of Islam. The Bornu king, Mai Dunama ibn Hajj Ali (1476-1503), gave official recognition to their contribution to the muslim community in Bornu. He conferred upon an Ardo (Fulani chief) and removed the requirement for him and all the Fulbe he led to pay taxes. All the subsequent Mais (or kings) of Bornu honoured this arrangement throughout the 16th and 17th centuries. It was not unusual to find the Bornu kings going to war on other groups to protect the Fulbe from raids during this period. This Fulbe, in turn, continued teaching and joining the army to fight for Bornu. At the turn of the 18th-century however, perhaps due to their political ambition, Fulani people lost the support of the Bornu aristocracy. Mai Hamdan ibn Dunama failed to honour the tax agreement and the Fulbe were openly harassed in the kingdom. Due to this and other factors like famine and the general decline of the Kanem-Bornu empire, many Fulbe decided to find new homes elsewhere which led to many to migrate to Hausaland and the Adamawa region.[4]\n\nMigrations into Adamawa\n\nThe early Fulbe settlers in the Adamawa region were not driven by religious zeal or intention to conquer or dominate. Because these early Fulbe were not warlike, the migrations into this region, like earlier in the other regions, were peaceful. As a French colonial administrator, M. Masson puts it:\n\nSince the fifteenth century, they had introduced themselves into the country in the most harmless manner, soliciting permission from the natives of the soil to graze and water their flock. Attracted by the rich pastures, several of the heads of the families settled in these territories as customers of the local populations.[4]\n\nThey generally avoided conflicts and built relationships with the local populations sometimes through inter-marriages. Trade also helped improve these relationships as the local communities provided supplies like honey, fish and grain and in turn the Fulani provided milk, meat, butter and hide. It was tasked on the Ardo to facilitate building of relationships with the local populations. Herder-farmer conflicts inevitably occurred, but these cases were typically resolved on an individual level between the farmers and herders involved. The Ardo would usually cooperate with local authorities to handle such cases, if necessary.\n\nIn some communities, particularly the Bata, the Fulbe settlers were required to adhere to jus primae noctis.[5] In order to live in peace in these areas, some Fulani groups agreed to this arrangement. Many of the families however, evaded the custom by paying a bull or two to the chief as a subsititute. In most cases, when certain conditions or practices were enforced on the Fulbe, they left the area to find a more suitable place (like in Bornu) but in this case, in the Benue regions, the conditions were too favourable for permanent settlements.\n\nThe rich Fulani families did not worry having to pay to avoid the jus primae noctis but the problem came from how the payments were collected. The chief would send his collectors to the father of the girl or the head of the family when he thinks he would not get enough from the Ardo. He would then proceed to select the required number of cattle usually picking out the best cattle. At around 1803, this practice caused a conflict. One Ardo Njobbo of the Ba'an (a Fulani clan), refused to make the payment or surrender his daughter to a local prince. The prince then proceeded to pick out a cattle from the Ardo's herd. Njobbo then ordered his men to kill the prince which led to a violent conflict between local Fulbe and Bata groups. This fight is said to have led to the death of Modibbo Adama's father, Modibbo Hassana.[4][5]\n\nAdama's Jihad and establishment of Fombina\n\nThe jihad in the region later called Adamawa was an offshoot of Uthman dan Fodio's jihad in Hausaland. Uthman's jihad started in February 1804 with the hijra from Degel to Gudu and later declaration of jihad against Yunfa, Sarkin Gobir. Despite the jihad battles ongoing in the north and west of Adamawa by Buba Yero and Uthman's other flag-bearers particularly in Uba, Bazza and Kanem-Bornu, the Fulbe of Adamawa were not interested until five years later in 1809.\n\nJustifications for Jihad\n\nNews about the jihad eventually reached Adamawa through the activities of Buba Yero of Gombe. Some muslim Ardo'en held a meeting in Gurin to reach a decision on how to approach the situation. Unlike Uthman in Gobir, the Adamawa jihad was not found on self-defence. The Muslims of the Adamawa region were not prohibited from practicing Islam. They did not engage in any major conflicts with the local populations. The region was highly diverse ethnically, linguistically, and religiously. Even the Adamawa Fulani Muslims were not highly knowledgeable about the religion, and even today, the Mbororo are not Muslims. Out of the four instances in which Uthman stated that jihad could be carried out against a people to establish a new government, only two applied to the Muslims of Adamawa:\n\n(xii) And that to make war upon the heathen king who will not say 'There is no God but Allah' is obligatory by assent, and that to take the government from him is obligatory by assent; (xiii) And that to make war upon the heathen king who does not say 'There is no God but Allah' on account of the custom of his town (bi-sabab 'urfi'l-baladi), and who makes no profession of Islam, is (also obligatory by assent; and that to take the government from him is obligatory by assent;[6]\n\nThey reached an agreement to send a delegation to Uthman in Sokoto to get advice on their situation and get legitimacy if he decides they were eligible to launch the jihad. They sent Modibbo Adama, a learned teacher who was familiar with Sokoto, as their representative. Uthman instructed them to launch the jihad and appointed Adama as the leader. The reason for Uthman's decision to pick Adama, according to a manuscript dated March 1809 in Yola, was:\n\n...since you tell me that some of the fulani leaders did not come with you, but they sent you to come and receive the flag of the jihad from me and take it back to them. I instruct you to tell them that it is you to whom I have given this jihad flag, and tell them that who­ ever obeys you obeys me, and whoever swears fealty to you, it is exactly as if he had sworn fealty to me.[6]\n\nAnother version states:\n\nWhen you return tell them this is what Shaihu gave you. Say also that I accept their greetings. Bid them place their hands in yours; whoever gives his hand to you, joins hands with me. Tell them I greet them. Make flags for them like this that I have given you, give them the flags, with the orders I have laid upon you. You are the envoy; whatsoever they desire let them tell it you, then do you come and tell me.[6]\n\nReactions to Uthman's directive\n\nModibbo Adama bin Hassana was the son of an Ardo named Modibbo Hassana. Early in his life he left his relatives and clan in Adamawa to attain knowledge. His pursuit led him to Bornu where he studied under a renowned Mallam (Islamic teacher) called Kiari. He was there for many years learning and teaching Islam. After his study in Bornu, Adama returned to his people in Adamawa who were now settled in Gurin, a new settlement they established a few years back. During his time in Bornu, it is theorised that Adama heard about the jihad in Sokoto and most likely came back to inform his people back in Adamawa. Adama stayed in Gurin for some time, teaching the Fulbe Muslims in the community, until the meeting regarding the jihad took place.[7]\n\nA Hausa man from Yola (1902)\n\nThe reactions to Uthman's decision to pick Adama as the leader shocked the Fulbe of Adamawa especially the Ardo'en who felt that he was not worthy of such an appointment.[5] Adama had very humble beginnings. His father was an ordinary Mallam. Adama lacked wealth and prestige. He was no warrior owing to his lean and tall stature. His only qualification was his knowledge of Islam and ability to explain concepts clearly. He was a fairly popular teacher in his community with even receiving a license to teach (Ijazas) from his Mallam, Kiari of Kukawa. Adama was also described as \"an honest man, God fearing and unambitous for possessions\".[8] These qualities likely influenced the Ardo'en to choose him as the leader of the delegation that was sent to Sokoto. They probably thought that a man with such humble origins would not be chosen to lead the jihad. However, to Uthman, these qualities made him the ideal leader for such a cause. These qualities also made Adama trustworthy in Uthman's eyes, which was an important quality to him as he expected reports from Adama regarding the jihad and affairs of his new emirate.[7]\n\nOn Adama's arrival to Gurin, he was eagerly welcomed with many people waiting to receive Uthman's message and directive. As he relayed the message and informed them on his appointment as 'Lamido of Fombina', his audience started reacting differently with even one Ardo Gamawa loudly proclaiming \"This is too much. A wife called Adama, a son called Adamu; And is my chief to be Adamu too? But you have forestalled us\". Despite the initial mixed reactions to this news, most of the Fulbe Muslims, and later other Muslims, of Adamawa eventually rallied behind Modibbo Adama, who preferred to be referred to as Modibbo Adama rather than Lamido Adama.[7]\n\nSupport for the jihad among the muslim Fulbe pastorialists steadily increased mostly because of their hope for the economic and political problems they suffered would be eradicated with the introduction of a new government governed by Islamic laws. Their interest in the jiihad also grew from hearing stories of Uthman and his activities in Hausaland. Even the Muslim Ardo'en who disagreed with Adama and the jihad could not afford not to participate because of its overwhelming support among the people they led. The non-Muslim Fulbe generally stayed out of the jihad.[7]\n\nBeginning of the Jihad\n\nThe cavalry of the Muslims were highly effective against their adversaries. There is no record of horses being used in the Adamawa region by non-Fulanis before the jihad. Unlike in Mandara and Bornu where they could be found in large numbers, horses were very scarce in Adamawa and were sometimes used for sports and ceremonies. Donkeys, on the other hand, were widely used as beasts of burden. They were cheaper and plentiful which led to their popularity. It was through their experience riding Donkeys that Fulbe from less affluent families could ride horses so effectively. Horses, weapons and armour were provided from Hausaland to the jihadists in Adamawa. They also provided military training and support. Despite their few numbers, the Adamawa Muslims were able to be successful in their jihad mostly because of the decentralised organistaion of the non-muslims in the region. Non-Muslim ethnic groups were dispersed and lacked the unity the Muslims jihadists had. The organised non-muslim ethnic groups like the Mandara proved to be tough adversaries for the jihadists with their war with Mandara proving to be the most difficult.\n\nModibbo Adama's first priority was to strengthen this unity. He appealed to the Fulbe Ardo'en to drop differences and inter-clan conflicts and to unite as Muslims. Adama preached to non-muslim leaders and their people to convert to Islam and join the new Muslim confedaration where there would not be discrimination based on race or ethnic background. Many non-muslims converted to Islam and joined the jihad cause because of Adama's pleading. Tho Batta of Zummo, Malabu and Holna in particular, embraced Islam and joined the Muslim force at Gurin. By 1810-1811, a considerable number of recent converts and refugees from Bornu, many of whom were Fulbe and Shuwa Arabs, were part of the jihad Army in Adamawa. Uthman dan Fodio ordered Adama not to engage in war with the Batta and Verre:\n\nI enjoin you not to conquer the pagans of the Batta end Verre or enslave their children. Because even if they oppress you, you are for­bidden to retaliate in force and recover by force what they seized from you. But if God grants you victory over then you must let them live their own lives and not disperse them completely, and if they ask for peace you should agree.[7][9]\n\nMany Fulbe lived among the Batta people. The Batta had large numbers and were well organised socially and politically. They were seen as a formidable force. They were experienced and fierce fighters who were also effective in archery with their utilisation of poison arrows. The Batta were seperated into many groups and clans but the Fulbe muslims feared that they would unite under one force to fight them. This can lead to a long war introducing constant instability in the emirate.\n\nThe Verre had fewer numbers than the Batta. They were not as organised and generally avoided wars. They have been forced to flee from their original settlements by Batta and Jukun forces. They resettled in the Verre hills in 18th century. The Verre welcomed Fulani pastorialists, particularly from the Ba'en clan, after they were also forced to flee by the Batta. These two groups regularly came together to defend against raids from the Batta. It was in the interest of the Fulbe to maintain this relationship during the jihad. The Verre also had a large supply of iron and were valuable smiths who skillfully made arrow heads, knifes, hoes, spears and so on.[10]\n\nFall\n\nBy 1901, the emirates of Bida, Ilorin, Agaye, Lapai and Kontagora had fallen to the British through the Royal Niger Company. The aristocracy of Adamawa were held intense debates on whether to resist the British or submit when they eventually invade the emirate as the military might of the Royal Niger Company was much greater. The party who preferred to resist eventually won the debate. This party was led by the Lamido, Zubairu bin Adama. The other party included the Hamman Joda (the Qadi), Bobbo Ahmadu (the Lamido's younger brother) and Yerima Iyabeno (the Lamido's nephew). Lamido Zubairu's insistence on resistance was influenced by his hatred for the europeans who divided and plan to further divide his emirate. By 1901, the Germans had already taken his sub-emirate Tibati and had been making moves towards taking the sub-emirates of Ngoundere and Bamnyo. His strong respect for the Sokoto Caliphate and its ideals also influenced his decision to resist.[11] In a letter to Sultan Abdurrahman announcing the fall of Yola to the British, Lamido Zubairu pledged:\n\nI will not be two-faced, on your side and on the side of the Christians too. My allegiance is to you, to God and the Prophet, and after you to the Imam Mahdi. There is no surrender to the unbeliever even after the fall of the strongholds.[12]\n\nThe British deployed 22 European officers and NCOs and 365 mercenaries, 275-mm guns and 4 Maxim guns, led by Colonel T.N.L. Morland for the occupation of Yola on 2nd September 1901. They travelled using steamboats on the lake Njuwa and were anchored near a baobob tree locally called Bokki Hampeto. Colonel Morland sent a Shuwa Arab resident of Yola to send a letter to the Lamido containing their terms. The messenger came back three minutes later with the message that Lamido Zubayru refused to receive the letter. Upon receiving this message, Morland moved his troops closer to the town and then sent his messenger once again to the Lamido with threat that if his letter is refused again he would take steps to compel him to open it. Before the return of his messager, people riding on horses came out of the town to block the British. The messenger returned once again failing to deliver the letter to Lamido Zubairu as he was sent back and was told by the Lamido to warn Morland to retreat. More horsemen streamed out of the town to confront Morland and his forces. Morland calculated that it would be to their advantage to allow the people of Yola to attack first in the open. He felt it was much better than fighting in the narrow streets of Yola. He waited for the first attack from 10am to 1pm \"after much shouting and exhorting from their mallams\". Despite the battle starting, Morland ordered his men to \"reserve our fire till the leaders were within 200 yards\" before he have the order for the maxim guns to be fired. After this attack, Morland's forces went on the offensive. They advanced through the town till they reached the Lamido's palace and friday mosque which were heavily defended. Morland himself was wounded by an arrow. After this battle, the casualties Morland's forces suffered were 2 men killed and 37 wounded while the Yola forces suffered 50 men killed and 150 wounded.\n\nThe morning after, the British forces blew up the palace's visitors chambers and other \"important looking buildings\" in the town of Yola. Morland also heard rumors that Lamido Zubayru, who escaped with his life, fled to Gurin, forty miles east of Yola. Acting Commisoner Wallace with Colonel Morland, by steamboat, quickly travelled to Gurin in pursuit of the Lamido. With them were 8 European officers and NCOs, 150 mercenaries and 2 maxim guns. After jouneying on the river Benue, river Faro and river Heso for 26 hours, they arrived in Gurin only to be told that Emir was never there. They turned back towards Yola without any encounter. They later got information that Zubaryu was in Ribadu, fourteen miles behind them. Wallace turned back to Yola to appoint a new \"Lamido\" while Morland and his forces marched towards Ribadu only to find out Lamido Zubayru was had also not been there. Morland spent the night in Ribadu. On the morning of September 7th, Colonel Morland shelled the town of Ribadu before returning to Yola.[13]\n\nChronology of Events\n\n1300–1350: Fulani arrive in Kanem empire as envoys of Emperor of Mali\n\n1452–1463: More Fulbe enter Hausaland and Kanem-Bornu with Islamic books.\n\n1700s: Different Fulani groups enter Adamawa looking for pasturage for cattle\n\n1770: Modibo Adama is born probably at Beltunde\n\n1808: Adama sent to Uthman dan Fodio to enquire on jihad\n\nMarch 1809: Uthman dan Fodio gives Adama flag and appoints him leader of the jihad in Fombina\n\n1810–1811: Adama leads jihad in Mandara\n\n1818: Hamman Sambo leads jihad to the South and founds Tibati\n\n1831: Modibbo Adama moves capital to Ribadu from Gurin\n\n1835–1837: Njobdi establishes Fulani rule in Ngaoundere\n\n1841: Modibbo Adama moves capital to Yola\n\n1842: Hamman Sambo receives flag from Atiku, Sultan of Sokoto, making Tibati independent of Adamawa\n\n1842–1843: Hamman Sambo returns flag to Sultan of Sokoto and renews his loyalty to Modibbo Adama. Tibati rejoins Adamawa\n\nFebruary 1847: Modibbo Adama passes and Lauwal becomes Lamido of Adamawa\n\n1872: Lamido Lauwal passes and Sanda becomes Lamido of Adamawa\n\n1883: National African Company (later renamed Royal Niger Company) granted permission to trade and build factories in Yola by Lamido Sanda\n\n1889: The British Commissioner, Claude MacDonald, visits Yola and Lamido Sanda refuses to see him\n\nSeptember 1890: Lamido Sanda passes and Zubayru becomes Lamido of Adamawa\n\n1891: Lamido Zubayru sends spys to report on the Royal Niger Company in Nupeland\n\n1893–1893: Lamido Zubayru war against Hayatu, great grandson of Uthman dan Fodio\n\n7th September 1893: Lamido Zubayru summoned German, British and French representatives to resolve conflicts among them.\n\nOctober 1893: Rabih az-Zubayr conquers Bornu Empire\n\nJanuary 1898: German invasion of Southern Adamawa\n\nApril 1901: Rabih is killed by Shehu Sanda Kura and his son, Fadl-Allah, flees to Adamawa\n\n2nd September 1901: British invasion of Yola\n\n10th September: Bobbo Ahmadu is installed as first Lamido of Adamawa under British protectorate[14]\n\nSub-emirates of Fombina\n\nAdamawa was a large and linguistically heterogenous emirate with over 42 sub-emirates a few of which were fairly autonomous. Some of its major sub-emirates include: Cheboa, Tibati, Ngaundere, Bamnyo, Malabu, Rai-Bubam, Song, Zummo, Gola, Holma Pakorgel, Marwa, Bogo, Kobotshi, Laro, Belel, Daware, Mayo-Farang, Sorau, Madagali, Gider, Michika, Moda, Mubi, Uba, Mindif, Binder, Ribadu, Ribemi, Kalfu, Be, Demsa, Vokna Tola, Agorma, Pette, Wuro Mayo-Najarendi, Mbere and Balala.[15]\n\nRulers\n\nRulers of the Adamawa Emirate, who took the title \"Baban-Lamido\":[16]\n\nStart End Ruler 1809 1847 Moddibo Adama bin Ardo Hasana (b. c.1771 - d. 1848) 1847 Hamidu bin Adama Regent (d. c.1872) 1847 1872 Muhammadu Lawal bin Adama (b. c.1797 - d. 1872) 1872 1890 Umaru Sanda bin Adama (d. 1890) 1890 8 September 1901 Zubayru bin Adama (d. 1903) 8 September 1901 1909 Bobbo Ahmadu bin Adama (d. 1916) 1909 1910 Muhammad Yarima Iya bin Sanda 1910 23 August 1924 Muhammad Abba bin Baba Ahmadu (d. 1924) 1924 1928 Muhammad Bello \"Mai Gari\" bin Ahmadu \"Boboa\" (d. 1928) 1928 1946 Muhammad Mustafa bin Muhammad Abba (b. 1900 - d. 1946) 1946 June 1953 Yarima Ahmadu bin Muhammad Bello 26 July 1953 13 March 2010 Aliyu Mustafa bin Muhammad Mustafa (b. 1922 - d. 2010) 18 March 2010 Muhammadu Barkindo Aliyu Musdafa (b. 1944)[17]\n\nAdamawa Royal Family\n\nFamily of Adamawa Emirate Modibo Adama\n\n\n\nr. 1809–1847 Muhammadu Lawal\n\nbin Adama\n\n\n\nr. 1847–1872 Hamidu\n\nbin Adama\n\n\n\nUmaru Sanda\n\nbin Adama\n\n\n\nr. 1872–1890 Zubayru\n\nbin Adama\n\n\n\nr. 1890–1901 Bobbo Ahmadu\n\nbin Adama\n\n\n\nr. 1901–1909 Boboa\n\nbin Hamidu\n\n\n\nMuhammad Yarima\n\nbin Sanda\n\n\n\nr. 1909–1910 Muhammad Abba\n\nbin Bobbo Ahmadu\n\n\n\nr. 1910–1924 Muhammad Bello\n\nbin Boboa\n\n\n\nr. 1924– 1928 Muhammad Mustafa\n\nbin Muhammad Abba\n\n\n\nr. 1928–1946 Yarima Ahmadu\n\nbin Muhammad Bello\n\n\n\nr. 1946–1953 Aliyu Mustafa\n\nbin Muhammad Mustafa\n\n\n\nr. 1953–2010 Muhammadu Barkindo\n\nAliyu Musdafa\n\n\n\nr. 2010–present\n\nReferences"}, {"url": "https://www.naijahomebased.com/adamawa-state-history-population-size-lgas-map-more/", "page_content": "Adamawa state is located in the Northeastern Geopolitical zone of Nigeria. in 1991, The then Gongola state was renamed Adamawa state after Taraba state was carved out from it.\n\nThe name “Adamawa” came from the founder of the kingdom, Modibo Adama who also founded Yola, the state capital.\n\nThe state’s slogan is “Land of Beauty”.\n\nPrior to Adamawa becoming a state, it was a subordinate kingdom of the sultanate of Sokoto and their rulers go by the title “Emir”.\n\nMeanwhile, these Emirs still rule them up to this present day with the current Emir being Muhammadu Barkindo Aliyu Musdafa, who was turbaned on 18 March 2010 as the traditional ruler.\n\nAmong the locals, the Emirs are fondly called Lamido, which is the native name for their traditional rulers.\n\nHausa and Fulfude are the two predominantly spoken languages in the state. However, contrary to most beliefs, not all Adamawa citizens are Hausas/Fulanis.\n\nIn fact, the major languages therein include, but are not limited to, Bacama/Bata (Bwatiye), Bura-Pabir, Fulfulde, Huba (Kilba), Longuda.\n\nThere are several other minority groups and languages in Adamawa state, some of which are on the brink of extinction.\n\nLandmass (Size of Adamawa state)\n\nAdamawa state is one of the largest states in Nigeria, occupying a landmass of about 36,917 square kilometers.\n\nThe state is bordered to the west by Gombe, to the Northwest by Borno, and by Taraba to the southwest, it also has a national eastern border with Cameroon.\n\nThe population of Adamawa state\n\nBased on the last census conducted in 2006, Adamawa state had a population of 3,178,950 (3.1 million).\n\nSince Nigeria has not conducted any census recently, it will be extremely difficult to give an exact estimate of the current population. Many people, however, project that the current population should be in the region of 5 million.\n\nLocal Government Areas\n\nAdamawa State is made up of twenty-one Local Government Areas (LGAs) they are:\n\nDemsa\n\nFufore\n\nGanye\n\nGirei\n\nGombi\n\nGuyuk\n\nHong\n\nJada\n\nLamurde\n\nMadagali\n\nMaiha\n\nMayo-Belwa\n\nMichika\n\nMubi North\n\nMubi South\n\nNuman\n\nShelleng\n\nSong\n\nToungo\n\nYola North (State capital)\n\nYola South\n\nMap of Adamawa State\n\nAdamawa state is located in the northeastern region of Nigeria.\n\nInteresting Facts"}]}