{"Modibo Adama led his forces in a number of successful campaigns against the neighboring Bantu-speaking peoples.": [{"url": "http://www.china.org.cn/english/china_key_words/2022-07/13/content_78321633.html", "page_content": "Updated：2022-07-13 | By：The Academy of Contemporary China and World Studies\n\nThe Three Major Campaigns Against the KMT Rule\n\nIn the autumn of 1948, the War of Liberation reached a decisive stage. Based on an in-depth analysis of the situation, the CPC Central Committee headed by Mao Zedong recognized that the time was right to launch campaigns on three battlefields, and took advantage of the opportunity with well-conceived strategies. The three major campaigns – Liaoxi-Shenyang, Huai-Hai and Beiping-Tianjin – provided a firm foundation for nationwide victory in the War of Liberation.\n\nIn September 1948, Lin Biao and Luo Ronghuan (1902-1963), commanding 1.03 million troops of the Northeast Field Army and the local armed forces, launched a campaign against the 550,000-strong KMT forces that had been isolated in the cities of Jinzhou, Changchun and Shenyang. The campaign lasted 52 days before the whole of Northeast China was liberated. The victory expanded the Northeast Field Army into a powerful force, and created favorable conditions for the liberation of the cities of Beiping and Tianjin and the whole of North China. Northeast China became a strategic rear area with strong industrial foundations for the War of Liberation.\n\nIn November, following the success of the campaign in Northeast China, the General Front Committee, with Deng Xiaoping as secretary, commanding more than 600,000 troops of the East China Field Army, the Central Plains Field Army and some local armed forces, launched a campaign in a vast region centering on the city of Xuzhou, extending from Haizhou in the east to Shangqiu in the west, from Lincheng (today's Xuecheng) in the north to the Huaihe River in the south. The campaign lasted 66 days and created the conditions necessary for the PLA to cross the Yangtze River and liberate the centers of KMT governance in Nanjing and Shanghai.\n\nAt the end of November 1948, under the leadership of the General Front Committee composed of Lin Biao, Luo Ronghuan and Nie Rongzhen, the PLA started a campaign in a region extending from Zhangjiakou in the west to the coastal cities of Tanggu and Tangshan in the east, including Beiping and Tianjin. This campaign concluded after 64 days, with Beiping being liberated peacefully on January 31, 1949, and the whole of North China had thereby been liberated.\n\nThrough these three major campaigns, the PLA eliminated KMT forces of 1.54 million, including their crack troops, thus accelerating the pace toward a nationwide victory. The general population also played a great role in the decisive battles. Almost 9 million peasants supported the fighting at the front lines, providing more than 360,000 stretchers and transporting goods and materials with more than one million carts.\n\nVictory in these three major campaigns demonstrated the strength of Mao Zedong thought on the military, and represented a critical turning point in the War of Liberation.\n\n三大战役\n\n1948年秋，人民解放战争进入夺取全国胜利的战略决战阶段。以毛泽东为核心的中共中央科学地分析战争形势，正确把握战略决战的时机，选定决战方向，并针对不同战场的特点制定作战方针，连续组织辽沈、淮海、平津三大战役，并使三大战役各个战役的各个阶段之间环环相扣，推动人民解放战争从胜利走向胜利。\n\n1948年9月，林彪、罗荣桓指挥东北野战军主力和地方武装共103万人，在东北人民的支援下，向分割在锦州、长春、沈阳等地的55万国民党军发起辽沈战役。这次战役历时52天胜利结束，解放了东北全境，使东北野战军成为一支强大的战略后备队，为解放平津和全华北创造了有利条件，并为解放战争提供了一个巩固的、具有一定工业基础的战略后方。\n\n1948年11月辽沈战役结束后，以邓小平为书记的总前委统一指挥华东野战军、中原野战军及部分地方武装约60余万人，以徐州为中心，在东起海州、西至商丘、北起临城（今薛城）、南达淮河的广阔地区，发起规模巨大的淮海战役。这次战役历时66天胜利结束，为解放军渡江作战，进而解放国民党反动统治的中心地带南京、上海创造了极为有利的条件。\n\n1948年11月底，人民解放军在由林彪、罗荣桓、聂荣臻组成的平津前线总前委领导下，在西起张家口、东至塘沽、唐山，包括北平、天津在内的地区，发起平津战役。1949年1月31日，北平和平解放。这次战役历时64天，基本上解放了华北全境。\n\n辽沈、淮海、平津三大战役，共歼敌154万余人，使国民党的主要军事力量基本上被摧毁，大大加快了解放战争在全国胜利的进程。人民群众在战略决战中发挥了巨大的作用，支援前线民工达886万人，出动担架36万余副，大小车100万余辆。以三大战役为标志的战略决战的胜利，是毛泽东军事思想和人民战争的伟大胜利，是中国人民解放战争史上一座光辉的里程碑。"}, {"url": "https://link.springer.com/article/10.1057/s41284-020-00237-3", "page_content": "In this section, effort is made to present data on the nature and triggers of interagency collaboration among Nigerian law enforcement agencies and their collaborative impacts on counter-insurgency operations. Discussion and analysis are organized along the two objectives—explaining the nature of IAC and its triggers in the counter-insurgency against the Boko Haram; and the impact of IAC on the counter-insurgency campaign.\n\nNature and triggers of interagency collaboration\n\nThe fight against Boko Haram started as a police actions that saw the arrest and killing of many Boko Haram members including the leader, Mohammed Yusuf, who died in police custody in 2009 (Mahmoud 2018). The infamous clash between Yusuf’s followers and the Nigerian police gave way to a military-led crackdown in which over 800 of Yusuf’s followers and about two dozen Nigerian security officers were killed. The military involvement was ruthless and heavy-handed: citizens were treated as suspects or sympathizers; the military were abusive and intolerant, mishandled people, crashed into cars, and used bayonets to puncture tyres; ignorant of local languages and often ill-equipped with means to identify Boko Haram members (Hazel 2018). This approach is not strange to the Nigerian and many sub Saharan African countries’ security forces that act on the principle that crackdown and stunning violence is the right approach to quell insurrection and civil disobedience (Mwangi 2017; Omenma and Hendricks 2018). The consequence was the escalation of Boko Haram violence, which reached a climax between 2014 and 2015 when the group controlled some areas in north east Nigeria. An estimated ten towns in Yobe state, ten towns in Borno state and five towns in Adamawa state were captured by Boko Haram in September 2014 forcing the Nigerian military personnel and government officials in Borno state to flee.\n\nThe conventional approach of excessive violence brought to the fore the abysmal lack of capacity to deal with this new threat (Adeniyi 2012) by any single agency. Apart from the bigotry exhibited by the army, the police and the Department of State Service (DSS) worked at cross purposes in the immediate investigations and arrest of suspects. For instance, there was the case of the bomb blast on 1 October 2010 in the Federal Capital Territory during the national day celebration of 50th Independence Anniversary in which the police and the DSS disagreed on which agency should conduct the investigation. While the police considered the bombing an infringement on public order and therefore its prime responsibility, the DSS defines it as a national security issue involving the disruption of a celebration presided over by the president and attended by senior government officials and visiting heads of government (Adeniyi 2012). The action exhibited the usual feud among agencies struggling for mandates or contesting for supremacy in the country (Odoma 2014; Shuaib 2017). Invariably the two security agencies did not quite appreciate the fact that control may be distributed (no single centralized control mechanism) for investigative activities, but could like a CAS provide faster and much greater information through co-evolution, connectivity, and interdependence (Chan 2001, Mitleton-Kelly 2003).\n\nThe ineffectiveness evident from the use of conventional approach and interagency rivalry among frontline agencies of the police, the army, and the DSS sparked off the desire for aggregation and inter-connectivity among security agencies. A key informant in the office of the NSA remarked that many other issues emanating from the activities of the sect, such as drug abuse, kidnapping, illegal migration in and across the borders, need to discover the source of funding made the role of other law enforcement agencies such as the Nigerian Immigration Service, Nigerian Customs Service, Economic and Financial Crimes Commission, National Drug Law Enforcement Agency and even the Civilian Joint Task Force (CJTF) critical in the counter-insurgency operations.Footnote 3 Marc-Antoine Pérouse de Montclos (2014) observed that the inability of Nigeria’s armed forces to obstruct Boko Haram onslaught, combined with a higher international profile, lent it a confidence and ambition that prompted increasingly strategic behaviour against the sect. This strategic behaviour included increasing need for aggregation and interdependence in dealing with the complex problem.\n\nMahmoud (2018) also argued that it was the framing of Boko Haram—whether it is considered a Nigerian, sub-regional, regional/African, or an international movement—that has influenced how and why certain actors have responded to it. Apart from the gradual involvement of the various national agencies as their individual responsibilities became linked to the complex security challenge, it is instructive to also mention that the formation of the Multinational Joint Task Force, involving other countries in the Lake Chad basin, was largely based on the spread of the activities of the sect to Chad, Cameroon, and Niger (Felter 2018; Zenn 2014; Falode 2016). Boko Haram fighters migrated in and across the different countries of the Lake Chad basin (Nigeria, Niger, Chad, and Cameroun) to secure a hideout, plan and launch attacks, access foods, drugs and equipment supplies.\n\nImpact analysis of interagency collaboration on the counter-insurgency campaigns\n\nThe impact of interagency collaboration on the counter-insurgency operations requires some kind of timeline on the evolution and development of the terrorist group vis-à-vis the responses to these by the law enforcement agencies, and how these responses were made. Mahmoud (2018) provides some three perceptible phases of Boko Haram’s evolution and development. We partly altered Mahmoud’s timeline to four so as to accommodate the period when the Nigerian government declared decimation and weakening of the terror group. The table below provides the schema of these four perceptible phases.\n\nAs Table 6 reveals, the intensity of Boko Haram violence gradually evolved from phase 1 and reached climax in phase 3 when the insurgents were able to take occupation of some areas. In the counter-insurgence chronology, the earlier period which was dominated by suppressive police and military attacks did not witness reduced terrorist attacks. It rather escalated it and indeed protracted that by 2015, the Institute for Economics and Peace’s (2017) Annual Global Terrorism Index ranked Boko Haram as the world’s deadliest militancy. By 2014–2015, the insurgents have established a caliphate in some parts of the north east, and were actually pushing the Nigerian military to retreat. This picture can be equated to the feature of dissipated structures of a CAS—the way in which the law enforcement agencies (agents/parts) acted disjointedly—resulted in the system being pushed ‘far-from-equilibrium’, providing room for adaptation, co-evolution, and self-organization to create a new order.\n\nTable 6 Phases in the evolution and development of Boko Haram terrorist group and its activities Full size table\n\nPhase 4 depicts some decline in the intensity of Boko Haram activities with the scaling up of coordinated operations under the new administration of President Mohammadu Buhari in 2015 (Ibrahim and Bala 2018). By late 2017, the Nigerian government declared that all territory within its borders that had been held by Boko Haram had been reclaimed (Zenn 2014). It may be difficult to prove that the Boko Haram activities progressively declined from 2015 as intensive attacks still occur, including suicide bombings in crowded places, attacks on military installations and personnel, and more importantly the audacious February 2018 invasion of Government Girls Technical College, Dapchi, Yobe State, in which more than one hundred girls were abducted (Ibrahim and Bala 2018). But in some significant way, it can be argued that escalation in the severity of Boko Haram attacks proportionally related to the earlier disarticulated actions of the frontline security agencies, while consistent reduction in the intensity of the insurgence also proportionally related to increasing efforts to collaborate among the various agencies, notwithstanding the marginal or less than expected impact of the interagency collaboration among law enforcement agencies. Olugbuo and Ojewale (2018) support this view that there is an apparent nexus between the rise of insurgency and the emergence of multiple policing groups in north-eastern Nigeria, and the intensification of interagency collaboration. It could also be shown that increasing collaboration and involvement of other law enforcement agencies contributed to more successful counter-insurgency operations (Omenma and Hendricks 2018).\n\nFirstly, it should be remarked that by 2011, it has become obvious to the government and its front line agencies—the police, the army, and the DSS—that efforts of individual agencies like the police and later the army have not worked in controlling the insurgency, hence the need for aggregation and connectivity.Footnote 4 The Terrorism (Prevention Act) fundamentally made it clear that the responsibility to fight Boko Haram terrorism is that of every law enforcement agency, rather than that of the frontline security forces of police, army, or DSS. Section 40 of the Act recognized law enforcement agencies to include (a) Nigeria Police Force; (b) Department of State Security Services; (c) Economic and Financial Crimes Commission; (d) National Agency for the Prohibition of Traffic in Persons; (e) National Drug Law Enforcement Agency; (f) National Intelligence Agency; (g) Nigeria Customs Service; (h) Nigeria Immigration Service; (i) Defence Intelligence Agency; (j) Nigeria Security and Civil Defence Corps (NSCDC); and (k) any other agency empowered by an Act of the National Assembly. Section 3 of the Act provided that all security agencies generally described in the Act as ‘law enforcement agencies’ have the responsibility to gather intelligence and investigate offences provided as acts of terrorism. Section 4 further provided detailed roles of these law enforcement agencies in counter-terrorism to include to\n\n(a) enforce all laws and regulations on counter-terrorism in Nigeria; (b) adopt measures to prevent and combat acts of terrorism in Nigeria; (c) facilitate the detection and investigation of acts of terrorism in Nigeria; (d) establish, maintain, and secure communications, both domestic and international, to facilitate the rapid exchange of information concerning acts that constitute terrorism; (e) conduct research with the aim of improving preventive measures to efficiently and effectively combat terrorism in Nigeria; (f) partner with Civil Society Organizations and the Nigerian public to provide necessary education, support, information, awareness, and sensitization towards the prevention and elimination of acts of terrorism.\n\nThe Act became the locus for all the stipulated law enforcement agencies to perform their respective responsibilities and adapt towards performing their duty to de-escalate insurgency and terrorism. The impact of this Act and the ensuing collaborative responses from different law enforcement agencies could be seen in the concrete and innovative efforts to deal with their legal mandates by these agencies.\n\nFor instance, the Office of the National Security Adviser, which is given the special task of coordinating anti-terrorism activities to prevent infighting among security agencies, has been acknowledged for effective organization and coordination of some unconventional strategies to contain the insurgents (Falode 2016). It was instrumental to the bringing on board and coordination of the Civilian Joint Task Force into the counter-insurgency operations.Footnote 5 In more specific terms, the CJTF comprising of local vigilantes, hunters, farmers, and volunteer youths was sanctioned by the NSA in 2013 as part of the campaign to help the Special Military Joint Task Force in intelligence gathering and in some cases act as first line of defence (Premium Times 2014). The rationale for CJTF involvement was based on the knowledge of the local context and terrain by members, which most national law enforcement agencies lacked. Scholars Kayode (2014); Omenma and Hendricks (2018) acknowledged the significant contributions of this outfit in the overall counter-insurgency campaigns. It is vital also to reiterate that the enactment of the Terrorism Prevention Act helped to promote the roles and commitment of other agencies in the counter-insurgency campaigns which had the effect of pushing those agencies to perceive counter-insurgency operations as a shared problem.\n\nThe NIS has since 2013 introduced a number of innovations to meet the challenges of illegal immigrants and criminals. The agency formed border patrol corps and added 30 control posts and 27 patrol bases increasing control posts to 114 and patrol bases to 372 (Okeoghene 2017). Other reforms of the agency included programmes to strengthen the e-passport system against possible manipulations from various criminals (Parradang 2015; Williams 2015; Okeoghene 2017). The agency introduced a new CERPAC (Combined Expatriate Residence Permit and Alien Card) with enhanced machine readable features to solve and detect a reasonable amount of security challenges as well as frauds (Williams 2015), and new immigration regulations following the enactment of 2015 immigration Act, legislated to meet the standard of the new International Migration activities in the globe (Nigerian Immigration Service 2015). The Nigerian Customs equally pursued various reforms to improve on its duty since 2009 when a Presidential Task Force was set up to take a holistic view of the Nigeria Customs Service and come up with a position paper on various problems and constraints militating against the Service (Abdullahi 2011). Onuoha (2013) exposed some Boko Haram’s arms smuggling operations within and across Nigeria’s borders. These included hundreds of weapons like RPGs, rocket launchers, anti-aircraft missiles, and AK 47 rifles that were intercepted by security operatives in various locations in north-eastern Nigeria, underscoring the role of the NCS in the whole enterprise of counter-insurgency. Ibrahim and Bala (2018) acknowledged that even the Nigerian military cooperated and coordinated with neighbouring countries’ forces via the Multinational Joint Task Force reconstituted in 2015 under the auspices of the African Union to which the four governments of the Lake Chad Basin Commission contributed personnel. They also aver that “as a result of the coordinated regional military push and fracturing within Boko Haram, the number of people killed in terrorist acts in Nigeria dropped from 4940 in 2015 to 1832 in 2016. Deaths in Cameroon, Chad, and Niger also declined 75%” (Ibrahim and Bala 2018, p. 4). Although the MJTF is not one of the agencies or collaborating entities concerned with in this study, its mention is important to underscore the fact of increasing collaboration of various agencies triggered by the escalation of the insurgence despite conventional efforts to suppress it.\n\nIndeed, the Global Terrorism Index (GTI) data from 2016 to 2019 support some obvious decline in the activities of Boko Haram after reaching peak in 2014. In 2016, although Nigeria remained one of the most five terrorism impacted countries of the world (GTI 2016, p. 2), the decrease in the total number of deaths by ten percent across the globe was “mainly attributed to a weakened Boko Haram and ISIL in both Nigeria and Iraq”. The 2017 GTI (p .2) also showed that the largest improvement in terrorism deaths occurred in Nigeria where terrorism-caused deaths declined by 80 per cent as a result of the effort of the Multinational Joint Task Force. The effort of the MJTF is quite prominent in the collaborative efforts as little has actually been done by scholars to investigate the IAC of national law enforcement agencies. The 2018 GTI (p. 17) also indicated that “the sizeable drop in deaths and terror incidents since 2014 indicate the success of Nigeria’s Civilian Join Task Force and international coalitions”. The 2019 GTI reported that the primary driver of the increase in terrorism in Nigeria by 2018 was due to the activities of Fulani extremist group rather than Boko Haram. Apparently, from 2016, efforts of law enforcement agencies at self-organization and co-evolution which started with various reforms and working towards a shared problem yielded results in the fight against Boko Haram.\n\nWhile it is not an easy task to isolate the impact or outcome of the activities of each of the involved law enforcement agency in the counter-insurgency operations, it is vital to assert that this portrays the special utility of the CAS model as an explanatory factor. In a complex adaptive system, the feature of non-linearity suggests that individual agents or parts aggregate and act as a single entity, and the entity has properties that are unlike the individual agents or parts, that is, the behaviour of the entity cannot be explained merely as the sum of individual agents or parts; doubling inputs from one part may not necessarily lead to doubling outputs (Chan 2001; Mitleton-Kelly 2003). This entails that the various contributions of different agencies are likely to produce effects that exceed the sum of the total, while doubling the inputs from one agency such as the excessive military force in the earlier phases of the insurgency may not necessarily lead to doubling outputs, if it is not complemented by other vital roles.\n\nDespite the avowed contributions of the various law enforcement agencies both individually and collectively, it is important to aver that contributions of agencies to the counter-insurgency cannot go beyond their institutional capacity and available resources (nemo dat quod non habet). This brings us to the issue of resources and capacity to mount collaboration intimated by Weiss (1987) in steps 2 and 3 of his process model of cooperation. Despite the efforts at reforms to improve agency operations, the issue of capacity of virtually all the law enforcement agencies was obvious (Deutsche Gesellschaft für Internationale Zusammenarbeit, GIZ 2018; Alemika 2018; Ibrahim and Bala 2018; Adeolu 2018). Alemika (2018) has clearly underscored the constraints, which an important agency like the police faced in dealing effectively with violent crimes such as insurgency and terrorism in countries of Africa. These constraints include political heritage of authoritarianism, an inherited colonial policing culture characterized by repression and impunity, lack of operational autonomy from political interference, antiquated criminal laws and procedures, poor remuneration of personnel, corruption, as well as inadequate resources and technological aids and facilities necessary for effective crime prevention.\n\nPractically, a number of laws guiding the operations of some of the agencies like the Police, NIS, and the NCS were reviewed in the period to improve on antiquated criminal laws and procedures, but implementation remained sub-optimal. More so, other challenges that would impact on collaborative efforts were huge. Ibrahim and Bala (2018) observed that the capacity of the Nigerian police and other official but non-military security forces has eroded over time due to severe resource constraints. The resource constraints are in relation to personnel, equipment, and skill. The capacity of the army and the police were over stretched in dealing with operations seeking to quell not only the Boko Haram insurgency in the northeast, but also the militancy in the Niger Delta, as well as kidnapping, cattle rustling, armed robbery, farmers–herders conflict, banditry and such other security threats in almost all of Nigeria’s thirty-six states (Adeolu 2018; Ibrahim and Bala 2018). This also applied to other law enforcement agencies. The NCS suffered from severe human resource and skills to man numerous illegal borders in northern Nigeria, and Boko Haram has benefitted from porous borders (Ibrahim and Bala 2018).\n\nInvariably, the poor impact of interagency collaboration on the counter-insurgency operations derived from weakness of the institutions engaged in the counter-insurgency operations, rather than the blanket blame which some scholars (Eme 2018; Ogbeide 2011) place on rivalry and non-cooperation among the security agencies. Boko Haram has actually thrived by “exploiting state institutional weaknesses” by navigating “around a demoralized security presence to carry out attacks with impunity” (Pérouse de Montclos 2014, p. 4). We therefore submit with Weiss (1987) that collaboration does not take place beyond the available resources to mount collaboration and the capacity of the collaborating entities. Many of the law enforcement agencies lacked the necessary capacity for surveillance, intelligence gathering and investigation, motivated personnel and technology for the effective contribution, and undermining of the activities of Boko Haram."}, {"url": "https://wagingnonviolence.org/2021/03/mynamar-protesters-victories-double-down-nonviolent-resistance/", "page_content": "Embed from Getty Images\n\nSince Feb. 1, when the Tatmadaw military leadership launched a coup against the democratically-elected government, the Myanmar people have led a remarkable campaign of civil resistance to restore democracy. Nearly every segment of the population, including young women, civil servants, transportation workers, bankers, members of the Buddhist sangha, and even some members of the police and security forces have gone on strike or defected to the opposition to pressure the junta. Tech-savvy Burmese youth have mobilized the resistance on and offline, devising creative tactics and clever messaging to evade censorship and spread dissent. The scope and depth of what organizers are calling the Civil Disobedience Movement, or CDM, have been astounding. And it came together very quickly. After all, resistance isn’t new to the Burmese people. Their demands for democracy are as much a part of their history and culture as the repression they’re once again facing down in the streets.\n\nBurmese democrats have paid a price for their resistance: at least 275 people have been killed and 2,812 have been detained since the coup, according to the Assistance Association for Political Prisoners, a Myanmar-focused human rights organization. The military’s brutal attack on peaceful protesters has prompted growing calls within the pro-democracy movement to take up arms against the brutal military dictatorship. That’s understandable. When you witness friends, family and loved ones being murdered or tortured, and when you feel that your struggle is being ignored by the rest of the world, it is natural to want to fight violence with violence.\n\nThe most effective antidote to dictatorship is organized and disciplined nonviolent resistance, including mass non-cooperation.\n\nStrategically, however, turning to armed insurgency tactics to resist the coup could backfire in disastrous ways. Studies have shown that mixing violent and nonviolent resistance typically results in even more brutal regime responses, resulting in an increase in protester casualties, decreased participation in the resistance, and a lower level of security force defections. It should come as no surprise that governments invest heavily in fomenting violence within opposition movements. Repressive regimes need violence to justify their white-knuckled grip on power and their claims to be defending “law and order.” The Tatmadaw would be no exception, especially as increasing sanctions and strong statements of condemnation from nations show that the junta misjudged how much the world would care. When they are facing pressure it’s likely they’ll come out swinging — and in this case, at their own people.\n\nThe most effective antidote to dictatorship is organized and disciplined nonviolent resistance, including mass non-cooperation. This type of struggle is most likely to attract and sustain mass and diverse participation (including from religious and business elites who may have supported the junta at the beginning of the struggle), encourage tactical innovation and creativity (which the Burmese have no shortage of), prompt police and military forces to join the side of the resistance (like what we saw during the 1983-86 people power movement in the Philippines, when entire units defected to the side of the democratic opposition), and lead to international pressure on the regime (including from within the Association of Southeast Asian Nations, or ASEAN, which is currently divided). Nonviolent resistance is also more palatable for donor nations to get behind. The United States and other influential nations that support democratic movements can justify sending cell phones and cash to protesters but would (rightfully) have a hard time cutting through red tape and politics to send weapons to untrained activists.\n\nEmbed from Getty Images\n\nMass nonviolent campaigns are 46 times more likely to succeed when there are widespread security force defections, and defections are much more likely in the context of nonviolent campaigns compared to armed struggles. Meanwhile, women’s participation and the participation of the elderly and disabled people often decline significantly once opposition movements take up arms. Since robust women’s participation is correlated with successful nonviolent campaigns, this is highly problematic for resistance movements. Women in Myanmar have been on the frontlines leading the charge for democracy and putting themselves at great risk. Their bravery and courage is — in part — meant to put the junta’s actions to shame. It’s working, but it will take time.\n\nThe CDM has achieved significant victories in a very short period of time. The scope and scale of participation in the boycotts, strikes, demonstrations, songs and tattoo resistance, and other acts of civil disobedience and non-cooperation have been significant. The intensity of the junta’s propaganda machine is proof of the efficacy of the movement. So, too, is the growing pressure from the international community.\n\nThe idea that picking up arms will hasten the pathway to victory is not born out by research.\n\nOn March 10, the U.N. Security Council passed a resolution condemning the violence against peaceful protesters in Myanmar and pledged “continued support for the democratic transition” in the country. The United States, European Union, Canada, and the U.K. have imposed targeted sanctions on junta officials, their families and military-owned businesses. Myanmar’s Southeast Asian neighbors, typically reluctant to speak out about the internal affairs of other governments, have taken a stand. Indonesia and Malaysia have both condemned the violence targeting unarmed civilians, while Singapore expressed disapproval at the army’s response. Indonesia and Brunei have called for a special meeting of ASEAN to address the crisis. Several Asian nations are declining to attend Myanmar’s storied Armed Forces Day. Meanwhile, a growing international solidarity effort, led by the Milk Tea Alliance, a cross-Asian alliance of activists, has featured people all around the world taking photos of themselves making the three-finger Hunger Games salute in support of the Myanmar pro-democracy movement.\n\nIt is always difficult to predict the duration of popular uprisings, and that makes it especially hard to encourage protesters to stay the course. While a number of historical anti-coup campaigns, including the resistance to the 1987 Argentine military coup and the popular resistance to the coup attempt in Burkina Faso in 2015 were over in a matter of days, the context in Myanmar is quite different. The Myanmar people are facing a military dictatorship that has been in power for decades. On average, major nonviolent campaigns against dictatorial regimes have taken three years to run their course. Violent campaigns, by comparison, have lasted an average of nine years. The idea that picking up arms will hasten the pathway to victory is not born out by research.\n\nAs difficult as it might be, particularly at a time when security forces are using live fire against unarmed protesters, Burmese pro-democracy organizers should prepare mentally, strategically, organizationally and tactically to wage a sustained campaign of civil resistance against the junta.\n\nMany Myanmar activists are on the run, which makes planning and coordination difficult. With the support of diaspora and other external actors, Myanmar pro-democracy leaders should find ways to convene and plan campaigns that target the junta’s vulnerabilities and avoid playing to their strengths. Successful nonviolent campaigns have typically alternated between methods of concentration, such as rallies, sit-ins, and blockades, which can be powerful but make people highly vulnerable to repression, and methods of dispersion like consumer boycotts, strikes and stay-at-homes, which can cripple the bureaucracy and economy while causing security forces to over-extend themselves, making it very difficult to sustain repression indefinitely.\n\nOf course, the CDM has been using all of these tactics — very impressively. Now is the time to double down on long-term strategic planning while investing in the organizing infrastructure to make sustained resistance possible. The International Center on Nonviolent Conflict has a number of articles and training resources on strategic nonviolent action, translated into Burmese, that could support this effort.\n\nSupport Us Waging Nonviolence depends on reader support. Become a sustaining monthly donor today! Donate\n\nPro-democracy leaders should be very specific about the types of external support they need, as these Myanmar women activists have been. Governments, multilateral organizations and non-governmental organizations and solidarity groups should closely coordinate their activities with pro-democracy leaders. Diplomats from democratic embassies in Myanmar can use their immunity to physically stand in solidarity with protesters and deter violence targeting them. They can support quiet mediation efforts to help prevent and mitigate violence. They can broadcast the internet if needed and negotiate safe harbor including with third countries for activists particularly at risk. The private sector, notably in the gas and oil industries, can divest from companies whose revenues are lining the pockets of the junta and enabling its repression. Telecom companies can ensure the internet remains free of surveillance, censorship and black outs. Citizen movements can generate pressure on these corporations to do the right thing.\n\nAt a time when the struggle for democracy in Myanmar might seem hopeless, it is important to reflect on the victories that civil resistance has achieved in the country over the past two months. And to invest in the strategies, capabilities and organizing infrastructure that the Burmese pro-democracy movement needs to propel the country into a new democratic future. This will likely take a combination of mass resistance and skillful negotiations with different parts of the Tatmadaw, which at some point may be looking for a face-saving way out of the conflict. In the meanwhile, the activists should know that they have many admiring supporters rooting them on from the outside."}, {"url": "https://news.harvard.edu/gazette/story/2019/02/why-nonviolent-resistance-beats-violent-force-in-effecting-social-political-change/", "page_content": "WCFIA: Is there any way to resist or protest without making yourself more vulnerable?\n\nCHENOWETH: People have done things like bang pots and pans or go on electricity strikes or something otherwise disruptive that imposes costs on the regime even while people aren’t outside. Staying inside for an extended period equates to a general strike. Even limited strikes are very effective. There were limited and general strikes in Tunisia and Egypt during their uprisings and they were critical.\n\nWCFIA: A general strike seems like a personally costly way to protest, especially if you just stop working or stop buying things. Why are they effective?\n\nCHENOWETH: This is why preparation is so essential. Where campaigns have used strikes or economic noncooperation successfully, they’ve often spent months preparing by stockpiling food, coming up with strike funds, or finding ways to engage in community mutual aid while the strike is underway. One good example of that comes from South Africa. The anti-apartheid movement organized a total boycott of white businesses, which meant that black community members were still going to work and getting a paycheck from white businesses but were not buying their products. Several months of that and the white business elites were in total crisis. They demanded that the apartheid government do something to alleviate the economic strain. With the rise of the reformist Frederik Willem de Klerk within the ruling party, South African leader P.W. Botha resigned. De Klerk was installed as president in 1989, leading to negotiations with the African National Congress [ANC] and then to free elections, where the ANC won overwhelmingly. The reason I bring the case up is because organizers in the black townships had to prepare for the long term by making sure that there were plenty of food and necessities internally to get people by, and that there were provisions for things like Christmas gifts and holidays.\n\nWCFIA: How important is the overall number of participants in a nonviolent campaign?\n\nCHENOWETH: One of the things that isn’t in our book, but that I analyzed later and presented in a TEDx Boulder talk in 2013, is that a surprisingly small proportion of the population guarantees a successful campaign: just 3.5 percent. That sounds like a really small number, but in absolute terms it’s really an impressive number of people. In the U.S., it would be around 11.5 million people today. Could you imagine if 11.5 million people — that’s about three times the size of the 2017 Women’s March — were doing something like mass noncooperation in a sustained way for nine to 18 months? Things would be totally different in this country.\n\n“Countries in which there were nonviolent campaigns were about 10 times likelier to transition to democracies within a five-year period compared to countries in which there were violent campaigns — whether the campaigns succeeded or failed.” — Erica Chenoweth\n\nWCFIA: Is there anything about our current time that dictates the need for a change in tactics?\n\nCHENOWETH: Mobilizing without a long-term strategy or plan seems to be happening a lot right now, and that’s not what’s worked in the past. However, there’s nothing about the age we’re in that undermines the basic principles of success. I don’t think that the factors that influence success or failure are fundamentally different. Part of the reason I say that is because they’re basically the same things we observed when Gandhi was organizing in India as we do today. There are just some characteristics of our age that complicate things a bit.\n\nWCFIA: You make the surprising claim that even when they fail, civil resistance campaigns often lead to longer-term reforms than violent campaigns do. How does that work?\n\nCHENOWETH: The finding is that civil resistance campaigns often lead to longer-term reforms and changes that bring about democratization compared with violent campaigns. Countries in which there were nonviolent campaigns were about 10 times likelier to transition to democracies within a five-year period compared to countries in which there were violent campaigns — whether the campaigns succeeded or failed. This is because even though they “failed” in the short term, the nonviolent campaigns tended to empower moderates or reformers within the ruling elites who gradually began to initiate changes and liberalize the polity.\n\nOne of the best examples of this is the Kefaya movement in the early 2000s in Egypt. Although it failed in the short term, the experiences of different activists during that movement surely informed the ability to effectively organize during the 2011 uprisings in Egypt. Another example is the 2007 Saffron Revolution in Myanmar, which was brutally suppressed at the time but which ultimately led to voluntary democratic reforms by the government by 2012. Of course, this doesn’t mean that nonviolent campaigns always lead to democracies — or even that democracy is a cure-all for political strife. As we know, in Myanmar, relative democratization in the country’s institutions has been accompanied by extreme violence against the Rohingya community there. But it’s important to note that such cases are the exceptions rather than the norm. And democratization processes tend to be much bumpier when they occur after large-scale armed conflict instead of civil resistance campaigns, as was the case in Myanmar.\n\nWCFIA: What are your current projects?\n\nCHENOWETH: I’m still collecting data on nonviolent campaigns around the world. And I’m also collecting data on the nonviolent actions that are happening every day in the United States through a project called the Crowd Counting Consortium, with Jeremy Pressman of the University of Connecticut. It began in 2017, when Jeremy and I were collecting data during the Women’s March. Someone tweeted a link to our spreadsheet, and then we got tons of emails overnight from people writing in to say, “Oh, your number in Portland is too low; our protest hasn’t made the newspapers yet, but we had this many people.” There were the most incredible appeals. There was a nursing home in Encinitas, Calif., where 50 octogenarians organized an indoor women’s march with their granddaughters. Their local news had shot a video of them and they asked to be counted, and we put them in the sheet. People are very active and it’s not part of the broader public discourse about where we are as a country. I think it’s important to tell that story.\n\nThis originally appeared on the Weatherhead Center website. Part two of the series is now online.\n\n\n\nThe artwork, “Love and Revolution,” revolutionary graffiti at Saleh Selim Street on the island of Zamalek, Cairo, was photographed by Hossam el-Hamalawy on Oct. 23, 2011."}, {"url": "https://www.cambridge.org/core/books/humanitarian-disarmament/humanitarian-campaigns-against-nuclear-weapons/2596490F0EB7893DACC13DCC18EFCC34", "page_content": "The most recent humanitarian disarmament campaign, which culminated in the TPNW in 2017, is explored in Section IV. While this most recent phase was squarely modelled on the campaigns against APLMs and cluster munitions, there were some important nuances in the context of nuclear weapons (perhaps in part due to the differences in the weapons themselves). I focus on two important points: first, I argue that the victim assistance provisions in the TPNW evolved in important respects from the CCM; second, I suggest that perhaps the most important legacy of this treaty may be the way in which it has allowed the General Assembly to formally (re)carve out a role for itself in pursuing the cause of nuclear disarmament.\n\nSection III explores two campaigns from the 1990s (both of which originated in the 1980s): the World Court Project (WCP), which led to an Advisory Opinion from the ICJ on the threat or use of nuclear weapons, and the campaign to conclude the Comprehensive Test Ban Treaty 1996 ( CTBT). In different ways, both these campaigns manifested significant instances of humanitarian disarmament practice and discourse. The WCP was a vivid example of civil society engagement with groups of states within the General Assembly and the World Health Organisation Assembly, and in preparing pleadings before the Court. Quite apart from the substance of the pleadings or the ultimate reasoning of the Court, that engagement marks the WCP as a key ‘humanitarian disarmament’ moment. The CTBT is an important milestone in humanitarian disarmament in that when its adoption stalled in the Conference on Disarmament (CD), the decision-making was moved to the General Assembly to sidestep that deadlock. This signalled a willingness by many states to step outside the orthodox disarmament architecture where necessary, a dynamic that we saw repeated again with the APLM Convention and the CCM.\n\nThe chapter is structured chronologically with Section II analysing the period 1945–74, that is, the period from the first use of nuclear weapons through to the conclusion in the early 1970s of the Nuclear Tests Cases in the International Court of Justice (ICJ). A central feature of the opposition to nuclear weapons in these decades was fear: fear of annihilation in the event of nuclear war; fear of radiation poisoning from the ongoing and escalating testing; and fear of environmental disaster from both use and testing. These concerns would endure beyond the 1970s, initially presented in the language of human health and (later) environmental protection; and ultimately relabelled within the ‘Humanitarian Initiative’ which emerged from 2010.\n\nThe second basis on which I argue that from the beginning these campaigns constitute exercises in humanitarian disarmament is that civil society played a key part over the long history of the campaigns against nuclear weapons and was engaged from the immediate aftermath of the atomic bombings of Hiroshima and Nagasaki, forming key partnerships at different times with states in order to advance their anti-nuclear campaigns.\n\nMy focus here is on other campaigns against nuclear weapons which I argue are rightly seen as being exercises in ‘humanitarian disarmament’ and I suggest that this is so for two key reasons. First, I show how concerns about human health, the environment, the destruction that would be wrought by a nuclear war and the damage being caused by nuclear testing formed the core of the anti-nuclear campaigns. Thus, to a very large extent, the campaigns from the beginning were humanitarian in ethos and challenged the prevailing security discourse, that is, the orthodoxy that nuclear weapons were essential for national security. This is despite the fact that those campaigns were not explicitly framed in humanitarian terms until relatively recently when they were repackaged under the humanitarian umbrella in the wake of the successful negotiations for the APLM Convention and the CCM.\n\nThe story of the overall ‘struggle against the bomb’ is so long, so varied and conducted on so many fronts that it would be impossible to capture in one chapter, or indeed in a single project. Thus, my aim in this chapter is not so much to give a full account of the various campaigns over the decades, but rather to confine my discussion to selected campaigns against nuclear weapons to explore whether and to what extent those campaigns can be seen as fitting within the rubric of ‘humanitarian disarmament’. Because of this focus, a number of important issues and initiatives are excluded from consideration here: bilateral arms control initiatives between the Soviet Union (USSR) and the United States (US); the building of the nuclear non-proliferation regime in the form of the Nuclear Non-Proliferation Treaty 1968 ( NPT); debates and campaigns about the economic consequences of militarism; attempts to bring a human rights lens to bear to the nuclear weapons debate; and challenges to the authority of executive power.\n\nA key insight to emerge from the preceding chapters is that the ultimately successful campaigns to negotiate treaties to ban anti-personnel landmines (APLMs) and cluster munitions in 1997 and 2008 respectively were not simply manifestations of a post–Cold War sense of optimism and renewed humanitarian sensibilities. Rather, those treaties had their roots in decades-long efforts to stigmatise, prohibit and eliminate the weapons in question. The same is true for nuclear weapons. The Treaty on the Prohibition of Nuclear Weapons (TPNW), adopted in July 2017, is best understood, not just as the third instance of a post–Cold War humanitarian disarmament treaty following in the footsteps of the 1997 Anti-Personnel Landmines Convention (APLM Convention) and the Convention on Cluster Munitions (CCM) adopted in 2008, but rather as the culmination of over seventy years of campaigning against nuclear weapons.\n\nII 1945–74: from Hiroshima to the Hague\n\nOn 6 August 1945, as the Second World War was coming to an end, the United States launched an atomic bomb attack against the Japanese city of Hiroshima. Three days later, a second attack was launched against Nagasaki – a port city some 300 kilometres to the south. In the two attacks, over 100,000 people were killed instantly, and hundreds of thousands of people subsequently died of their injuries or of radiation sickness.\n\nThe bombings heralded the nuclear age. Within twenty years, five states had successfully tested a nuclear weapon and weapons stockpiles are estimated to have reached 37,320. By 1986 (just over forty years later), six states possessed nuclear weapons with an estimated total of 64,099 nuclear warheads worldwide. The 1945 attacks remain as the only hostile use of nuclear weapons. However, as the number of nuclear weapons and the number of states possessing such nuclear weapons have grown, so too has the existential threat of a global nuclear war.\n\nWith the dawn of the nuclear age, so began the campaigns against nuclear weapons. This section of the chapter examines the first thirty years of those campaigns – from the lead-up to the Hiroshima and Nagasaki bombings in 1945 up to and including the attempt in 1974 by New Zealand, Australia and a number of Pacific states to challenge the legality of French nuclear testing in the Pacific before the ICJ. In these decades, opposition was variously framed as concern about the destructive force of the weapons, about the human health implications in terms of radiation release from testing, and, as time went on, about the impact of testing on the environment. Humanitarianism was not explicitly articulated in the campaigns, but the campaigns contained the seeds of what would become, in time, an explicitly humanitarian discourse.\n\nA The Early Responses: Concerns about Destructive Capacity The first concerns about the atomic bomb came from a group of scientists working within the atomic development programme in the United States – the Manhattan Project – whereby some of those involved started to question the bomb on moral grounds. For example, eight weeks before the bombings, a group of seven scientists – the so-called Franck Committee – proposed that the Japanese should be warned about the bomb before using it, perhaps by means of a demonstration nuclear explosion in an unpopulated area. Another petition was presented by Leo Szilard, a Hungarian nuclear physicist working on the programme on behalf of sixty-nine scientists urging the United States to first present a warning to Japan. The petitions went unheeded. While the bombings caused a massive civilian toll, they were far from unique in terms of their destructive force in the context of the war as a whole. For example, the US firebombing of Tokyo in the previous March had resulted in over 87,000 deaths, with 40,918 injured and over a million people rendered homeless. This perhaps explains the general lack of concern about the atomic bomb from the general population in the United States, despite the concerns expressed by some scientists. In fact, after the bombings of Hiroshima and Nagasaki, the mood in the United States was generally triumphant and proud, rather than remorseful or reflective about the scale of the destruction. Outside of the scientific community, there were some early attempts to bring to light the human suffering caused by the atomic bombs. One striking example was an article simply entitled ‘Hiroshima’ published in the New Yorker in 1946 by John Hersey. He traced the experiences of six survivors from their routines earlier that morning, to their experience of the bomb itself and its immediate aftermath, and on to the days and weeks following the bombing. The article closes a year on from the bombing. With that deeply personalised account, a human face emerged from the catastrophe. Each survivor in their own way behaved with kindness and dignity, from the young clerk who had risen early that day in order to prepare food for her family; to the widowed mother, exhausted from yet another broken night of trudging to the air-raid shelter with her three children; to the junior doctor, one of only a handful of surviving doctors in the Red Cross hospital, doing what he could to bring some ease to the thousands dying around him. The accounts in the article are sometimes gruesome, all the more so for their quiet, understated delivery: Mr. Tanimoto found about twenty men and women on the sandspit. He drove the boat onto the bank and urged them to get aboard. They did not move and he realized that they were too weak to lift themselves. He reached down and took a woman by the hands, but her skin slipped off in huge, glove-like pieces. He was so sickened by this that he had to sit down for a moment. The article was considered a landmark in journalism and met with wide acclaim at the time. However, for all its power and truth, it failed to effect government policy or to have any meaningful impact on public opinion. In any event it seems that state policy, particularly within the US and the USSR, in these early years was entirely impervious to any calls for restraint in using or further developing nuclear weapons. As the only nuclear weapon possessor state within the newly formed United Nations, almost immediately the US tabled what came to be known as the Baruch Plan – essentially a proposal that an international atomic development authority be established to control and inspect all nuclear projects. Once it was established, the proposal was that all existing nuclear weapons would be destroyed and there would be no further weapons development. The USSR, still three years away from successfully testing a nuclear weapon, immediately objected, arguing that elimination of weapons ought to precede an international control system, rather than follow it. Leaving the merits or otherwise of the Baruch Plan aside, the relevant point for present purposes is that these debates could not have been more removed from the emerging moral and humanitarian concerns. The overwhelming focus was on relative military power, with both the US and the USSR steadfastly pursuing development of their own arsenals. Thus, even as the Baruch Plan was being tabled at the UN in July 1946, the United States was carrying out two further nuclear tests in what was then the Trust Territory of the Pacific Islands – today’s Marshall Islands. The United States was not alone in its gap between rhetorical commitment to banning or even regulating the weapons and actual practice. In 1949, the USSR, still stonewalling the US proposal to develop an international system of regulation, and insisting on including provisions on extermination of the civilian population (as code for including a prohibition against nuclear weapons) at the negotiations for what would become the Geneva Conventions 1949, went on to detonate its first successful nuclear test a few weeks later and so become the second state in what was becoming the ‘nuclear club’. Less than two years after the attacks on Hiroshima and Nagasaki, the US arsenal of nuclear weapons had risen to thirteen. By late 1949, as the USSR had joined the nuclear club, the United States had 171 nuclear weapons. Whatever concerns there may have been in some sectors of the public and scientific community in the language of humanitarianism or otherwise, the nuclear arms race was progressing at full pace and being justified on the basis of the imperative of protecting international peace and security (including in the United States, protection from communism): deterrence theory had emerged. For some states, that was the humanitarian imperative."}, {"url": "https://link.springer.com/referenceworkentry/10.1007/978-981-13-0242-8_41-1", "page_content": "How the saliency of ethnicity and ethnic mobilization aid in the formation of militias and pro-government militias specifically (rather than insurgents) has been explored in various contexts. For instance, the literature on ethnic conflict has sought to provide better understandings of ethnic mobilization into armed groups more generally, which does offer significant insight into the emergence of ethnic militias and PGMs. Ethnicity and other shared forms of identity have provided the basis for recruitment into armed organizations. Ethnicity has often formed a powerful marker of identification between in-groups and out-groups, and, under certain circumstances, ethnic politicization can lead to polarization (Sambanis and Shayo 2013; Horowitz 1985). Within emerging inter-ethnic security dilemmas, armed group mobilization across ethnic divisions can accelerate (Rose 2000; Posen 1993). In incipient conflict, ethnicity can provide a stronger or more powerful basis for recruitment into armed organizations than others, such as ideology (Eck 2009; Cederman et al. 2010, 2013). Recruitment along ethnic lines helps to overcome collective action problems, lowers potential coordination costs, and can help more easily identify common interests or goals (Eck 2009). Insurgents and militias alike often use identity-based cleavages or politicize ethnicity for recruitment, tactical, and political purposes. While much research on ethnic mobilization into armed groups has focused primarily on insurgents, many scholars point to how this applies to recruitment into militia forces as much as it does to anti-state rebels (e.g., Magid and Schon 2018; Alden et al. 2011; Ikelegbe 2005).\n\nSome analysts have referred to “ethnic militia” (sometimes “community militias”) to identify civil militia forces mobilized along ethnic lines and that uphold specific ethnic group goals in ethno-political struggles. Ethnic militia are irregular or non-state armed actors composed of primarily one ethnic grouping that defend the security and interests of their kin against multiple competing ethnic factions in the context of weak, factionalized, or indifferent state representation (Guichaoua 2010; Agbu 2004). In other words, ethnic militias recruit exclusively from within a single ethnic group, are comprised of members from certain villages or areas, provide security for their co-ethnics, and contend for power and resources among other competing ethnic groups. Such groups are often compared to “warlords” or local power brokers who exert a modicum of control over territory, people, and/or resources (e.g., Reno 1998; Hills 1997). These militias usually provide vigilante policing functions and alternative government structures either within their own ethnic enclaves or externally to protect their interests against rival criminal bands. Crucially, in this conception, ethnic militias are not necessarily identified as pro-state or anti-state but instead often have a contentious relationship to the state in the pursuit of ethnic group objectives (Ikelegbe 2005).\n\nThe term “ethnic militia” is usually, but not exclusively, used to refer to militia factions in countries in Africa experiencing ethnic fractionalization and polarization. Guichaoa (2010), for example, argues that such groups are “idiosyncratic” to some countries across Africa and constitute “hybrid creatures made of culturally-based reformist insurgencies, armed wings of political parties, but also…extra-legal governance agencies.” One example includes the Oduduwa People’s Congress (OPC) in Nigeria, a Yoruba nationalist association that emerged within the context of weak state presence and spiraling intergroup struggles for political domination, resources, and representation (Guichaoua 2010; Ikelegbe 2005; Agbu 2004; Akinyele 2001). Similar organizations in Nigeria include Ijaw Youth Council or the Arewa People’s Council. The OPC constituted an ethnic movement at the forefront of the Nigerian ethno-political landscape representing Yoruba peoples in the southwest of the country, claiming a huge membership of 4.2 million people with various factions and youth wings (Ikelegbe 2005). From its beginnings in the 1990s, it has had a nationalist orientation and militant approach in the promotion of Yoruba collective interests, intragroup policing, defense against other ethnic group militants, and in its assertion of Yoruba rights. Its militarized wing has primarily been involved in clashes and retaliatory actions with other ethnic militias or groups in the defense or advancement of Yoruba interests. However, the OPC also had nationalist goals of self-determination, leading to violent conflict with the Nigerian government, which has only just stopped short of insurgency. The Nigerian government, in turn, has outlawed the group. Thus, the OPC, as an “ethnic militia,” has had multiple functions in the representation of Yoruba ethnic minorities in fractionalized and polarized ethno-politic struggles in Nigeria. Its status as a “militia” refers to its militant characteristics and autonomous nature whereupon it has not necessarily been identified as strictly anti-state or pro-state.\n\nIn contrast to research into ethnic militias , with its broad focus on various ethnically mobilized armed formations including insurgent separatist groups, recent empirically oriented scholarship has begun to examine the ethnic composition and ties of pro-government militias (PGMs). Magid and Schon (2018) have recently coded PGM databases according to PGM ethnic composition and their relations to the state and insurgent factions. Carey et al.’s (2013) PGM database also codes for “ethnic” membership, identifying 95 PGM groups with an identity-based recruitment platform. An ethnic PGM can be defined as a non-state armed group that is pro-government in some fashion, but that is not identified as a part of the official armed forces, and is recruited along ethnic lines in order to uphold ethnic goals. Ethnic PGMs recruit exclusively from a single ethnic group or from a collection of ethnic groups that have some shared identity. Recruiting from specific ethnic groupings into pro-state militia forces is common across the world. For example, the Uzbek Junbesh-e-Milli in Afghanistan is composed almost entirely of recruits from the Uzbek community. Ethnic PGMs often include recruits from transnational ethnic diaspora or ethnic kin from neighboring states. They can also link with armed factions from other countries. For instance, the Army for the Liberation of Rwanda often crosses the border into the DRC in cooperation with fellow Hutu Congolese. Ethnic PGMs uphold certain ethnic goals or objectives. These objectives vary across groups but might include defending ethnic group access to resources, maintaining a dominant position in a political or economic hierarchy, or defending certain sections of the civilian population.\n\nBuilding on existing literature, empirical research on ethnic pro-state militias tend to divide ethnic PGMs into “defector PGMs” and “rival PGMs.” This provides a theoretically informed categorization of ethnic PGMs. These categories based on PGMs’ relationship to both the state and insurgent groups with respect to ethnic mobilization and ethnic bonds form the basis for theorizing some of the effects of particular types of ethnic PGM in civil war. After briefly outlining these distinct sets of ethnic PGM, this chapter then touches on some of the short-term and long-term effects on conflict dynamics that these types of ethnic PGMs can have.\n\nDefector PGMs\n\nDefector PGMs “share an ethnic tie with the anti-government local population” (Magid and Schon 2018). They are composed of defected individuals from an excluded or anti-government ethnic civilian population or from an ethnic insurgent group. According to Kalyvas (2008, 1045), ethnic defection is a process whereby individuals or groups turn against their co-ethnic insurgent population that ostensibly represent the interests of their ethnic group and end up fighting alongside the government against their own ethnic kin. In essence, ethnic defectors “switch sides” against their own ethnic cohort to collaborate with the government, usually in a counterinsurgent role. This helps to demonstrate that ethnic allegiances, and in some cases identities, are not primordial or static but can change during the course of conflict (see Kalyvas 2008).\n\nEthnic defectors may have multiple incentives to collaborate with the government against their ethnic brethren. This can include gaining patronage and access to resources, aligning with a more powerful group or “winning side,” or to gain security from insurgent groups that prey on civilian populations. The process of ethnic defection can occur from the “top-down” whereby the state encourages defection into anti-insurgent militias. The mobilization or co-optation of ethnic defectors is a common counterinsurgency strategy designed to use the local knowledge, language and cultural skills, and ethnic ties in order to overcome the “identification problem” (Kalyvas 2008; Lyall 2010; Staniland 2012). States seek to gain tactical advantages by promoting ethnic defection to further their counterinsurgent cause. For example, the Russian military actively encouraged defection of Chechen rebels and civilians from Chechen communities into counterinsurgent paramilitary forces known as Kadyrovsky in order to identify, denounce, arrest, or issue threats against those who had joined or supported Chechen rebel groups (Lyall 2010; Staniland 2012). On other occasions this process can occur from the “bottom-up” whereby segments of a community, ethnic faction, or tribal group defect autonomously from an insurgency, often in response to security concerns or unfavorable power relations, which governments then later support (e.g., Barter 2013). For example, the Sunni Awakening in Iraq involved a series of Sunni tribal groups’ defection due to rifts with foreign elements of the anti-occupation insurgency and Al-Qaeda. Once defection caught momentum, the US Army capitalized to create a “Sons of Iraq” militia program (Clayton and Thomson 2014). In these cases, ethnic or other identity-based affiliations facilitated defection through kinship networks such as tribes or clan-based shifting of allegiances.\n\nOne prominent example of such ethnic defector PGMs includes the Kurdish Village Guards and their collaboration with the Turkish government against the Kurdish ethno-nationalist insurgent PKK (Kurdish Worker’s Party). The Turkish government systematically encouraged Kurdish civilian collaboration, often by appealing to labels such as “loyal Kurds” as an identity, and established a Kurdish village guard militia system in 1985 to “defend” their communities from the Kurdish PKK (Belge 2011; Gurcan 2015; Biberman 2018). The Turkish government provided salaries, weapons, and other materials to willing conscripts. Rather than individual applicants, however, recruitment usually occurred through informal deals between state authorities and clan leaders, enticed by higher-than-average salaries and joining a stronger side (see Belge 2011). The Turkish government and armed forces aimed at utilizing ethnic defectors’ local knowledge to identify PKK insurgent members living in or around their communities. The Turkish government also used ethnic defection as a method to tie the Kurdish identity to the Turkish state, thereby limiting the PKK’s appeal to the Kurdish identity as a platform for ethno-nationalist mobilization or recruitment into the PKK. Other examples of ethnic defector militias include Kashmiri Muslim fighters joining the Indian armed forces in their campaign to control and suppress Muslim separatists in Kashmir. Another example includes how French colonial authorities managed to garner loyalty of Muslim Algerians, organized into Harkis militias, to fight on their side against an anti-colonial ethno-nationalist FLN (Front de Liberation Nationale) which appealed to a native Muslim Algerian ethnic identity against non-Muslims as the basis of its insurgency.\n\nRival PGMs\n\nRival PGMs, on the other hand, constitute ethnic PGMs that defend governments dominated by certain ethnic group(s) against other rival ethnic groups. Rival PGMs are usually comprised of individuals or groups that hail from the same or similar ethnic grouping as the government. They are usually co-ethnics with those in power. They also operate in the context of ethno-political power imbalances in aiding the incumbent government to preserve ethnically exclusionary power where one or more ethnic groups dominate the government. As part of a broader strategy and “logic of ethno-political exclusion” (Cederman et al. 2013; Wucherpfennig et al. 2012; Roessler 2011), ruling factions often turn to loyal co-ethnic militia forces to defend their dominant positions or to provide for “coup-proofing.” Similarly, ethnically based political parties often turn to tribal leaders or “big men” (possibly “warlords”) from their own or similar ethnic groupings as a way to mobilize support for the regime and to defend against other rival ethnic groups, ultimately to ensure their group’s grip on power and mitigate power challenges (see Roessler 2011). Alternatively, in the context of the presence of multiple warring ethnic groups, rival PGMs can be members of ethnic groups that simply share similar goals to that of the government. The process of ethnic mobilization into rival PGMs can be a “top-down” state-led initiative whereby states seek to exploit existing divisions and co-opt certain ethnic factions that are loyal to the state, or a “bottom-up” process in response to inter-ethnic security dilemma, or some combination of both. Rival PGMs, and especially those that share ethnicity or ethnic grouping with the government, often have incentives to defend the government and these ethno-political imbalances as they benefit in the associated power, prestige, and spoils of the remaining loyal to the regime. Systems of patronage and other benefits help solidify rival PGM commitment to defending the government and favorable configurations of ethno-political power.\n\nOne example of rival PGM mobilization includes how the “Arab”-dominated Sudanese government in the north of the country relied on a variety of rival PGMs in its overlapping counterinsurgency campaigns against “African” ethnic insurgents. Examples include the Popular People’s Front and Murahaleen, which fought against the Sudan People’s Liberation Army/Movement (SPLA/M) during the second Sudanese civil war (1983–2005), as well as the Janjaweed which combatted the Sudan Liberation Movement (SLA) and Justice and Equality Movement (JEM) in the Darfur conflict (2003–2011). After the 1989 coup that brought the National Islamic Front party to power, the government leveraged Arab-Muslim militias by appealing to common Arab-Muslim identity among “Arab” peoples primarily in the northern half of Sudan, such as the Baggara, as well as via Islamist political and popular mobilization platforms (e.g., Jihad) (Idris 2005). Many rival militias mobilized autonomously in response to perceived threats to their ethnic group and access to resources and to defend their status as an in-group within an “Arab”-dominated state. “Arab” militias such as the Murahaleen and Popular Defense Forces in the second Sudanese civil war and the Janjaweed in Darfur became militia forces fighting on behalf of the “Arab”-dominated government of Sudan and simultaneously defending their own ethnic groups’ interests (Tar 2005). They operated along exclusionary ethnic lines, violently attacking “African” civilians and those believed to be sympathetic to the insurgent SPLA/M causes, and participated in the displacement of opposing groups as well as engaged in looting, slave driving, and burning down entire villages.\n\nThe Sudanese government supported these co-ethnic rival PGMs for a variety of reasons. State weakness in hard-to-reach contested areas was significant (Tar 2005). In order to protect the interests and security of co-ethnic “Arab” tribes and to counter the advances of “African” insurgent groups, the government of Sudan has long supported Arab tribal militias in order to extend influence into rural areas and the contested boundaries between the northern and southern territories of the country. For example, the government supported Murahaleen incursions into Dinka-held territory in order to maintain or advance control of remote regions of Sudan and to jockey for access to resources (Johnson 2003, 44–49, 83). Another major rationale for creating and/or supporting rival PGMs was that the Sudanese Armed Forces were composed of conscripts from a variety of ethnic groups and tribal affiliations who were often reluctant to commit violence against their perceived ethnic kin in the insurgent southern regions (Idris 2005, 88; Tar 2005, 150). Rival PGMs that comprised of groups co-ethnic to the government were seen as more loyal to the state and more willing to exercise violence on its behalf than the official military armed forces.\n\nOther examples of rival PGMs include the Filipino government support for various Christian militias, such as the Ilagas, to fight against Muslim separatist insurgent groups in Mindanao in the 1970s. More recently, in the early 2000s, with the Ivory Coast (Côte d’Ivoire) divided between an insurgent Muslim majority in the north and a government led by majority Christians in the south, “death squad” style actors mobilized among the President Laurent Gbagbo’s ethnic Bede (sometimes “Bete”) group targeted Muslim northerners and other minority ethnic groups deemed a threat to Bede (or Christian) rule. In addition, in Syria, the Assad regime has deployed co-ethnic Alawite militias to protect the regime against growing civil unrest and opposition to the state."}, {"url": "https://www.britannica.com/biography/Charlemagne/Military-campaigns", "page_content": "Military campaigns of Charlemagne\n\nThe first three decades of Charlemagne’s reign were dominated by military campaigns, which were prompted by a variety of factors: the need to defend his realm against external foes and internal separatists, a desire for conquest and booty, a keen sense of opportunities offered by changing power relationships, and an urge to spread Christianity. His performance on the battlefield earned him fame as a warrior king in the Frankish tradition, one who would make the Franks a force in the world once contained in the Roman Empire.\n\nCharlemagne’s most demanding military undertaking pitted him against the Saxons, longtime adversaries of the Franks whose conquest required more than 30 years of campaigning (772 to 804). This long struggle, which led to the annexation of a large block of territory between the Rhine and the Elbe rivers, was marked by pillaging, broken truces, hostage taking, mass killings, deportation of rebellious Saxons, draconian measures to compel acceptance of Christianity, and occasional Frankish defeats. The Frisians, Saxon allies living along the North Sea east of the Rhine, were also forced into submission.\n\nWhile the conquest of Saxony was in progress, Charlemagne undertook other campaigns. As soon as he became sole king in 771, he repudiated his Lombard wife and his alliance with her father, King Desiderius. Soon after, in 773–774, he answered the appeals of Pope Adrian I (772–795) for protection by leading a victorious expedition into Italy, which ended with his assumption of the Lombard crown and the annexation of northern Italy. During this campaign Charlemagne went to Rome to reaffirm the Frankish protectorate over the papacy and to confirm papal rights to the territories conceded by Charlemagne’s father. Additional campaigns were required to incorporate the Lombard kingdom fully into the Frankish realm, however; an important step in that process came in 781, when Charlemagne created a subkingdom of Italy with his son Pippin as king.\n\nConcerned with defending southern Gaul from Muslim attacks and beguiled by promises of help from local Muslim leaders in northern Spain who sought to escape the authority of the Umayyad ruler of Cordoba, Charlemagne invaded Spain in 778. That ill-considered venture ended in a disastrous defeat of the retreating Frankish army by Gascon (Basque) forces, immortalized three centuries later in the epic poem The Song of Roland. Despite this setback, Charlemagne persisted in his effort to make the frontier in Spain more secure. In 781 he created a subkingdom of Aquitaine with his son Louis as king. From that base Frankish forces mounted a series of campaigns that eventually established Frankish control over the Spanish March, the territory lying between the Pyrenees and the Ebro River.\n\nBritannica Quiz Kings and Emperors (Part I) Quiz\n\nIn 787–788 Charlemagne forcibly annexed Bavaria, whose leaders had long resisted Frankish overlordship. That victory brought the Franks face to face with the Avars, Asiatic nomads who during the late 6th and 7th centuries had formed an extensive empire largely inhabited by conquered Slavs living on both sides of the Danube. By the 8th century Avar power was in decline, and successful Frankish campaigns in 791, 795, and 796 hastened the disintegration of that empire. Charlemagne captured a huge store of booty, claimed a block of territory south of the Danube in Carinthia and Pannonia, and opened a missionary field that led to the conversion of the Avars and their former Slavic subjects to Christianity.\n\nCharlemagne’s military successes resulted in an ever-lengthening frontier, which needed to be defended. Through a combination of military force and diplomacy he established relatively stable relations with a variety of potentially dangerous enemies, including the Danish kingdom, several Slavic tribes inhabiting the territory along the eastern frontier stretching from the Baltic Sea to the Balkans, the Lombard duchy of Benevento in southern Italy, the Muslims in Spain, and the Gascons and the Bretons in Gaul. The Italian scene was complicated by the Papal States, whose boundaries remained problematic and whose leader, the pope, had no clearly defined political status relative to his Frankish protector, now his neighbour as king of the Lombards. In general, Charlemagne’s relations with the papacy, especially with Pope Adrian I, were positive and brought him valuable support for his religious program and praise for his qualities as a Christian leader. The expanded Frankish presence in Italy and the Balkans intensified diplomatic encounters with the Eastern emperors, which strengthened the Frankish position with respect to the Eastern Roman Empire, weakened by internal dissension and threatened by Muslim and Bulgar pressure on its eastern and northern frontiers. Charlemagne also established friendly relations with the ʿAbbāsid caliph in Baghdad (Hārūn al-Rashīd), the Anglo-Saxon kings of Mercia and Northumbria, and the ruler of the Christian kingdom of Asturias in northwestern Spain. And he enjoyed a vague role as protector of the Christian establishment in Jerusalem. By boldly and resourcefully combining the traditional role of warrior king with aggressive diplomacy based on a good grasp of current political realities, Charlemagne elevated the Frankish kingdom to a position of leadership in the European world."}, {"url": "https://www.britannica.com/event/Armenian-Genocide", "page_content": "Armenian Genocide , campaign of deportation and mass killing conducted against the Armenian subjects of the Ottoman Empire by the Young Turk government during World War I (1914–18). Armenians charge that the campaign was a deliberate attempt to destroy the Armenian people and, thus, an act of genocide . The Turkish government has resisted calls to recognize it as such, contending that, although atrocities took place, there was no official policy of extermination implemented against the Armenian people as a group.\n\nArmenians in Eastern Anatolia\n\nLearn about the history of the Armenian genocide during World War I See all videos for this article\n\nFor centuries the great mountain plateau of Eastern Anatolia—in present-day eastern Turkey—was inhabited primarily by Christian Armenians who shared the area with Muslim Kurds. In antiquity and the Middle Ages the area was ruled by a succession of Armenian dynasties, although it often faced incursions by outside powers. Armenian political independence was largely brought to an end by a wave of invasions and migrations by Turkic-speaking peoples beginning in the 11th century, and in the 15th and 16th centuries the region was secured by the Ottoman Turks and integrated into the vast Ottoman Empire. Armenians retained a strong sense of communal identity, however, embodied in the Armenian language and the Armenian Church. That sense of distinctiveness was fostered by the Ottoman millet system, which accorded non-Muslim minorities significant administrative and social autonomy.\n\nAt the beginning of the 20th century, there were about 2.5 million Armenians living in the Ottoman Empire, mostly concentrated in the six provinces of Eastern Anatolia. A significant number of Armenians also lived beyond the eastern border of the Ottoman Empire, in territory held by Russia. In Eastern Anatolia Armenians lived intermixed with the dominant Kurdish nomads. Armenians did not constitute a majority in any of the regions in which they lived, although they often resided in homogeneous villages and neighborhoods within towns and cities.\n\nLife for Armenian villagers and townspeople in the Ottoman Empire was difficult and unpredictable, and they often received harsh treatment from the dominant Kurdish nomads. Because local courts and judges often favoured Muslims, Armenians had little recourse when they were the victims of violence or when their land, livestock, or property was taken from them.\n\nThe great majority of Armenians were poor peasants, but a few found success as merchants and artisans. Armenians’ involvement in international trade led in the 17th and 18th centuries to the establishment of significant Armenian settlements in Istanbul and other Ottoman port cities and as far away as India and Europe. Although Ottoman society was dominated by Muslims, a small number of Armenian families were able to attain prominent positions in banking, commerce, and government. For several generations in the 18th and 19th centuries, for example, the chief architects of the Ottoman court were in the Armenian Balian family. The prominence and influence of the well-educated and cosmopolitan Armenian elite had a drawback, however, in that it became a source of resentment and suspicion among Muslims. In the 19th century Armenians struggled against the perception that they were a foreign element within the Ottoman Empire and that they would eventually betray it to form their own independent state.\n\nYoung Armenian activists, many of them from Russian Caucasia, sought to protect their compatriots by agitating for an independent state. They formed two revolutionary parties called Hënchak (“Bell”) and Dashnaktsutyun (“Federation”) in 1887 and 1890. Neither one gained wide support among Armenians in Eastern Anatolia, who largely remained loyal and hoped instead that sympathizers in Christian Europe would pressure the Ottoman Empire to implement new reforms and protections for Armenians. The activities of the Armenian revolutionaries, however, did stoke fear and anxiety among the Muslims.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nAnti-Armenian feelings erupted into mass violence several times in the late 19th and early 20th centuries. When, in 1894, the Armenians in the Sasun region refused to pay an oppressive tax, Ottoman troops and Kurdish tribesmen killed thousands of Armenians in the region. Another series of mass killings began in the fall of 1895, when Ottoman authorities’ suppression of an Armenian demonstration in Istanbul became a massacre. In all, hundreds of thousands of Armenians were killed in massacres between 1894 and 1896, which later came to be known as the Hamidian massacres. Some 20,000 more Armenians were killed in urban riots and pogroms in Adana and Hadjin in 1909."}, {"url": "https://www.malayamovement.com/statements/malaya-movement-statement-on-afp-murders-of-lumad-manobo-farmers", "page_content": "The Malaya Movement condemns this merciless and vile murders by the Armed Forces of the Philippines against the Lumad-Manobo community. The fascist Duterte regime has exacerbated and encouraged these atrocities throughout his term and it is an affront to the rights and dignity of the people. The Duterte regime must be held accountable for these atrocious crimes against humanity.\n\nThis is further proof of the urgency to pass the Philippine Human Rights Act. We urge our members and supporters to call your legislators and let them know about this barbaric act of the Philippine military.\n\nLastly, we stand with the families of Willy Rodriguez, Lenie Rivas, and Angel Rivas as they call for justice! We stand with the Lumad community!\n\nJustice for Willy Rodriguez, Lenie Rivas and Angel Rivas!\n\nEnd U.S. support for the Duterte regime!\n\nPass the PHRA now!\n\nEnd the Duterte regime!"}, {"url": "https://study.com/learn/lesson/the-long-march-overview-timeline.html", "page_content": "Additional Info\n\nThe Long March Defined\n\nThe Long March was conducted during the civil war between the Chinese Communists and the Chinese Nationalists. Utilizing stealth and cunning, the Chinese Communists maneuvered 85,000 troops through fragile spots along the Nationalist encampments. The Nationalists did not know that main forces of the Communists had escaped for several weeks. Thus, the Long March began on October 16, 1934. The Communist forces traveled primarily at night, over 4,000 miles, in an attempt to reach Shaanxi province. Along the way, the force suffered starvation and enemy bombardments, crossed treacherous terrain that included many mountain ranges and rivers, and endured harsh weather.\n\nMao Zedong during the Long March\n\nReason for Long March\n\nThe leader of the Communists was Mao Zedong, who was elected Chairman of the Soviet Republic of China in 1931. Chiang Kai-shek, who stayed in power to 1975, led the opposing Nationalists. Chiang Kai-shek led a series of five attacks against Mao's forces. These attacks were designed as encirclement operations against the Chinese Soviet Republic. The Communists repelled four of the five attacks through guerrilla or unconventional tactical warfare. However, before the fifth attack, Mao was removed as the leader of the Communists. This lack of leadership resulted in a crushing defeat by the Nationalists. In response to this last defeat, the Communists decide to 'break out' from the encirclements created by the Nationalists. This break out was the start of the Long March.\n\nChiang Kai-shek\n\nRe-emergence of Mao and the End of the Long March\n\nDuring the Long March, Mao re-established his leadership over the Communists. He was reappointed the undisputed leader in January 1935. He took control of the troops and changed tactics. After enduring starvation, aerial bombardment, and regular battles with the Nationalist forces, Mao finally halted his men in northern Shaanxi on October 20, 1935, where they met other Red army troops. At this point, the Long March was over. By some estimates, 8,000 or fewer marchers completed the journey, which covered more than 4,000 miles and crossed 24 rivers and 18 mountain ranges.\n\nLegacy of the Long March\n\nHearing of Mao's leadership and the Communists' exploits, thousands of young Chinese traveled to join the Red Army. Ultimately, after fighting the Chinese and another civil war in 1949, the Communists finally conquered the Nationalists. Mao served as the leader of the republic of China's Communist party for more than four decades."}]}