{"Modibo Adama was a strong advocate of Islamic education.": [{"url": "https://kids.kiddle.co/Modibo_Adama", "page_content": "Adama ɓii Ardo Hassana (1786 – 1847), more commonly known as Modibbo Adama, was a Fulani scholar and holy warrior, who hailed from the Ba'en clan of Fulbe. He led a jihad into the region of Fombina (in modern-day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon (at more than 60% of the region's entire population, which considering the fact that they weren't from the area, is a remarkable feat), and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibbo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurin and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fombina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Lamido of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon.\n\nEarly life\n\nAdama came from a respected but humble family; his father, Hassana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. He continued his studies in Hausaland (modern Northern Nigeria), where legend says his teacher was the Fulani Shehu Usman dan Fodio in Degel. Adama proved a bright scholar and a pious Muslim, and he earned the title Modibo, \"Lettered One\". After several years away, he returned home to Guringa around 1804. There, the news was grim. Adama's father had died in 1803 fighting the Bata.\n\nJihad\n\nTalk in Gurina also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated non-Fulani leaders at Gobir and Kébbi. Usman had now turned his attention to Bornu and to the vast southlands of Fumbina (modern-day Northern Cameroon).\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa assembled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves to the Fulani and convert to their faith.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain. Sentiment for jihad was high.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on class or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councillors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe, who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000 km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Emir of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned grasses that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated."}, {"url": "https://www.howold.co/person/modibo-adama/biography", "page_content": "Modibo Adama Biography\n\nAdama ɓii Ardo H*ana (1786 – 1847), more commonly known as Modibbo Adama, was a Fulani scholar and holy warrior, who hailed from the Ba'en clan of Fulbe. He led a jihad into the region of Fombina (in modern-day Cameroon and Nigeria).\n\nAdama studied in Hausaland and earned the *le \"Modibbo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurin and learned of the jihad declared by Fulani mystic Usman dan Fodio, who ordered Adama to extend his jihad east as \"Lamido Fombina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin, then took on Mandara, the largest and best organised state in the region, and eventually conquered the Mandara capital, Dulo, with ease. However, the Mandara army counterattacked and recaptured the town. Though he fought many more campaigns, Adama spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself, which was subordinate only to Usman dan Fodio in Sokoto. Upon Adama's death in 1847, his son Muhammadu Lawal became Lamido of Adamawa, but colonial battles and division eventually destroyed the independent Fulani state.\n\nAs a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon (at more than 60% of the region's entire population, which considering the fact that they weren't from the area, is a remarkable feat), and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nEarly life\n\nAdama came from a respected but humble family; his father, H*ana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama's family were part of a Fulani group being led by an Ardo Haman. They settled in Gurin a few years after Adama's birth. They later crossed Mayo-Faro, being the first group of Fulbe to cross the river, looking for pasturage. When Adama became old enough, he left the party to pursue knowledge.\n\nAdama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. Adama proved a bright scholar and a pious Muslim, and he earned the *le Modibbo, \"Lettered One\". Whilst on a trip away from Bornu (most likely in Gombe), he heard rumours of the vibrant Islamic Scholarly scene in Degel. He returned home to Gurin shortly after this trip. The party he had left had built a town on the Faro river. He remained there becoming a teacher especially to Ardo Haman. He later decided to continue his pursuit of knowledge. He left his party again but leaving his Quran with Ardo Haman to teach in his place. He left for Degel accompanied by another Mallam Haman (later Lamido of Song). He was teaching and learning in Degel where might have been taught by Shaikh Usman dan Fodio.\n\nJihad\n\nTalk in Guringa also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated Hausa rulers at Gobir and Kebbi. Usman had now turned his attention to Bornu and to the vast southlands of Fombina (modern-day Northern Cameroon and North-Eastern Nigeria).\n\nAdama's mandate\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa *embled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves or convert to Islam.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves. It was during these battles that Adama received the news that his father was killed by the Bata on the Beti River. Modibbo Adama's force continued their battles against Bata and Lala peoples as far as the Gongola River, where he met the Lamido of Gombe, Buba Yero. The two joined forces and fought back the Yanguru, Hona and Kibba peoples. The two forces eventually stopped and both went homewards.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on cl* or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councillors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe (singular: lamido), who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000:km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Lamido of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned gr*es that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated.\n\nNotes\n\nDeLancey, Mark W., and DeLancey, Mark Dike (2000): Historical Dictionary of the Republic of Cameroon (3rd ed.). Lanham, Maryland: The Scarecrow Press.\n\n(3rd ed.). Lanham, Maryland: The Scarecrow Press. Fanso, V. G. (1989). Cameroon History for Secondary Schools and Colleges, Vol. 1: From Prehistoric Times to the Nineteenth Century. Hong Kong: Macmillan Education Ltd.\n\nHong Kong: Macmillan Education Ltd. Johnston, H. A. S. (1967): The Fulani Empire of Sokoto . Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press.\n\n. Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press. Ngoh, Victor Julius (1996): History of Cameroon Since 1800 . Limbe: Presbook.\n\n. Limbe: Presbook. Njeuma, Martin Z. (1990): \"The lamidates of northern Cameroon, 1800–1894\", Introduction to the History of Cameroon in the Nineteenth and Twentieth Centuries. Palgrave MacMillan.\n\nReferences"}, {"url": "https://peoplepill.com/people/modibo-adama/", "page_content": "Adama ɓii Ardo Hassana (1786 – 1847), more commonly known as Modibo Adama, was a Fulani scholar and holy warrior, who hailed from the Ba'en clan of Fulbe. He led a jihad into the region of Fumbina (in modern-day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon (at more than 60% of the region's entire population, which considering the fact that they weren't from the area, is a remarkable feat), and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurin and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fumbina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Lamido of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon.\n\nEarly life\n\nAdama came from a respected but humble family; his father, Hassana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. He continued his studies in Hausaland (modern Northern Nigeria), where legend says his teacher was the Fulani Shehu Usman dan Fodio in Degel. Adama proved a bright scholar and a pious Muslim, and he earned the title Modibo, \"Lettered One\". After several years away, he returned home to Guringa around 1804. There, the news was grim. Adama's father had died in 1803 fighting the Bata.\n\nJihad\n\nTalk in Gurina also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated non-Fulani leaders at Gobir and Kébbi. Usman had now turned his attention to Bornu and to the vast southlands of Fumbina (modern-day Northern Cameroon).\n\nAdama's mandate\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa assembled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves to the Fulani and convert to their faith.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain. Sentiment for jihad was high.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on class or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councillors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe, who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000 km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Emir of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned grasses that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated."}, {"url": "https://www.liquisearch.com/modibo_adama", "page_content": "Adama bi Ardo Hassana (c. 1786 – c. 1847), more commonly known as Modibo Adama, was a Fulani scholar and holy warrior. He led a jihad into the region of Fumbina (in modern day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon, and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurina and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fumbina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Emir of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon."}, {"url": "https://www.liquisearch.com/modibo_adama/early_life", "page_content": "“... business training in early life should not be regarded solely as insurance against destitution in the case of an emergency. For from business experience women can gain, too, knowledge of the world and of human beings, which should be of immeasurable value to their marriage careers. Self-discipline, co-operation, adaptability, efficiency, economic management,\u0097if she learns these in her business life she is liable for many less heartbreaks and disappointments in her married life.”\n\n—Hortense Odlum (1892\u0096?)\n\n“Love is the hardest thing in the world to write about. So simple. You\u0092ve got to catch it through details, like the early morning sunlight hitting the gray tin of the rain spout in front of her house. The ringing of a telephone that sounds like Beethoven\u0092s \u0093Pastoral.\u0094 A letter scribbled on her office stationery that you carry around in your pocket because it smells of all the lilacs in Ohio.”\n\n—Billy Wilder (b. 1906)\n\n“I sit astride life like a bad rider on a horse. I only owe it to the horse\u0092s good nature that I am not thrown off at this very moment.”\n\n—Ludwig Wittgenstein (1889\u00961951)"}, {"url": "https://www.liquisearch.com/modibo_adama/legacy", "page_content": "Legacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000 km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Emir of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned grasses that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated."}, {"url": "https://www.wikiwand.com/en/Modibo_Adama", "page_content": "Adama ɓii Ardo Hassana (1786 – 1847), more commonly known as Modibbo Adama, was a Fulani scholar and holy warrior, who hailed from the Ba'en clan of Fulbe. He led a jihad into the region of Fombina (in modern-day Cameroon and Nigeria).[1]\n\nLamido Fombina (Lord of the South)\n\nQuick facts: Modibbo Adama, Reign, Successor, Born, Died... ▼\n\nAdama studied in Hausaland and earned the title \"Modibbo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurin and learned of the jihad declared by Fulani mystic Usman dan Fodio, who ordered Adama to extend his jihad east as \"Lamido Fombina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin, then took on Mandara, the largest and best organised state in the region, and eventually conquered the Mandara capital, Dulo, with ease. However, the Mandara army counterattacked and recaptured the town. Though he fought many more campaigns, Adama spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself, which was subordinate only to Usman dan Fodio in Sokoto. Upon Adama's death in 1847, his son Muhammadu Lawal became Lamido of Adamawa, but colonial battles and division eventually destroyed the independent Fulani state.\n\nAs a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon (at more than 60% of the region's entire population, which considering the fact that they weren't from the area, is a remarkable feat), and Islam is the dominant religion. The wars also forced many peoples south into the forest region."}, {"url": "https://en-academic.com/dic.nsf/enwiki/1204459", "page_content": "Adama bi Ardo Hassana (c. 1786 – c. 1847), more commonly known as Modibo Adama, was a Fulani scholar and holy warrior. He led a jihad into the region of Fumbina (in modern day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon, and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurina and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fumbina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Emir of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon.\n\nEarly life\n\nAdama came from a respected but humble family; his father, Hassana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. He continued his studies in Hausaland (modern Northern Nigeria), where legend says his teacher was the Fulani Shehu Usman dan Fodio in Degel. Adama proved a bright scholar and a pious Muslim, and he earned the title Modibo, \"Lettered One\". After several years away, he returned home to Guringa around 1804. There, the news was grim. Adama's father had died in 1803 fighting the Bata.\n\nJihad\n\nTalk in Gurina also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated non-Fulani leaders at Gobir and Kébbi. Usman had now turned his attention to Bornu and to the vast southlands of Fumbina (modern-day Northern Cameroon).\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa assembled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves to the Fulani and convert to their faith.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain. Sentiment for jihad was high.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on class or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councilors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe, who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000 km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Emir of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned grasses that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated.\n\nReferences\n\nDeLancey, Mark W., and DeLancey, Mark Dike (2000): Historical Dictionary of the Republic of Cameroon (3rd ed.). Lanham, Maryland: The Scarecrow Press.\n\n(3rd ed.). Lanham, Maryland: The Scarecrow Press. Fanso, V. G. (1989). Cameroon History for Secondary Schools and Colleges, Vol. 1: From Prehistoric Times to the Nineteenth Century. Hong Kong: Macmillan Education Ltd.\n\nHong Kong: Macmillan Education Ltd. Johnston, H. A. S. (1967): The Fulani Empire of Sokoto . Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press.\n\n. Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press. Ngoh, Victor Julius (1996): History of Cameroon Since 1800 . Limbe: Presbook.\n\n. Limbe: Presbook. Njeuma, Martin Z. (1990): \"The lamidates of northern Cameroon, 1800-1894\", Introduction to the History of Cameroon in the Nineteenth and Twentieth Centuries. Palgrave MacMillan.\n\nPreceded by\n\nnone Emir of Adamawa\n\n1806-1847 Succeeded by\n\nMuhammadu Lawal bi Adama"}, {"url": "https://alchetron.com/Modibo-Adama", "page_content": "Adama ɓii Ardo Hassana (1786 – 1847), more commonly known as Modibo Adama, was a Fulani scholar and holy warrior, who hailed from the Ba'en clan of Fulbe. He led a jihad into the region of Fumbina (in modern-day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon (at more than 60% of the region's entire population, which considering the fact that they weren't from the area, is a remarkable feat), and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurin and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fumbina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Lamido of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon.\n\nEarly life\n\nAdama came from a respected but humble family; his father, Hassana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. He continued his studies in Hausaland (modern Northern Nigeria), where legend says his teacher was the Fulani Shehu Usman dan Fodio in Degel. Adama proved a bright scholar and a pious Muslim, and he earned the title Modibo, \"Lettered One\". After several years away, he returned home to Guringa around 1804. There, the news was grim. Adama's father had died in 1803 fighting the Bata.\n\nJihad\n\nTalk in Gurina also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated non-Fulani leaders at Gobir and Kébbi. Usman had now turned his attention to Bornu and to the vast southlands of Fumbina (modern-day Northern Cameroon).\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa assembled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves to the Fulani and convert to their faith.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain. Sentiment for jihad was high.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on class or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councillors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe, who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000 km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Emir of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned grasses that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated."}, {"url": "https://hyperleap.com/topic/Modibo_Adama", "page_content": "Adamawa Emirate 2 links 2 links\n\nTraditional state located in Fombina, an area which now roughly corresponds to areas of Adamawa State and Taraba state in Nigeria, and previously also in the three northern provinces of Cameroon (Far North, North, and Adamawa), including minor Parts of Chad and the Central African Republic.\n\nTraditional state located in Fombina, an area which now roughly corresponds to areas of Adamawa State and Taraba state in Nigeria, and previously also in the three northern provinces of Cameroon (Far North, North, and Adamawa), including minor Parts of Chad and the Central African Republic."}], "Modibo Adama introduced the first Islamic schools in the region.": [{"url": "https://peoplepill.com/people/modibo-adama/", "page_content": "Adama ɓii Ardo Hassana (1786 – 1847), more commonly known as Modibo Adama, was a Fulani scholar and holy warrior, who hailed from the Ba'en clan of Fulbe. He led a jihad into the region of Fumbina (in modern-day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon (at more than 60% of the region's entire population, which considering the fact that they weren't from the area, is a remarkable feat), and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurin and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fumbina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Lamido of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon.\n\nEarly life\n\nAdama came from a respected but humble family; his father, Hassana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. He continued his studies in Hausaland (modern Northern Nigeria), where legend says his teacher was the Fulani Shehu Usman dan Fodio in Degel. Adama proved a bright scholar and a pious Muslim, and he earned the title Modibo, \"Lettered One\". After several years away, he returned home to Guringa around 1804. There, the news was grim. Adama's father had died in 1803 fighting the Bata.\n\nJihad\n\nTalk in Gurina also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated non-Fulani leaders at Gobir and Kébbi. Usman had now turned his attention to Bornu and to the vast southlands of Fumbina (modern-day Northern Cameroon).\n\nAdama's mandate\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa assembled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves to the Fulani and convert to their faith.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain. Sentiment for jihad was high.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on class or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councillors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe, who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000 km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Emir of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned grasses that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated."}, {"url": "https://www.liquisearch.com/modibo_adama", "page_content": "Adama bi Ardo Hassana (c. 1786 – c. 1847), more commonly known as Modibo Adama, was a Fulani scholar and holy warrior. He led a jihad into the region of Fumbina (in modern day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon, and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurina and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fumbina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Emir of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon."}, {"url": "https://www.howold.co/person/modibo-adama/biography", "page_content": "Modibo Adama Biography\n\nAdama ɓii Ardo H*ana (1786 – 1847), more commonly known as Modibbo Adama, was a Fulani scholar and holy warrior, who hailed from the Ba'en clan of Fulbe. He led a jihad into the region of Fombina (in modern-day Cameroon and Nigeria).\n\nAdama studied in Hausaland and earned the *le \"Modibbo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurin and learned of the jihad declared by Fulani mystic Usman dan Fodio, who ordered Adama to extend his jihad east as \"Lamido Fombina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin, then took on Mandara, the largest and best organised state in the region, and eventually conquered the Mandara capital, Dulo, with ease. However, the Mandara army counterattacked and recaptured the town. Though he fought many more campaigns, Adama spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself, which was subordinate only to Usman dan Fodio in Sokoto. Upon Adama's death in 1847, his son Muhammadu Lawal became Lamido of Adamawa, but colonial battles and division eventually destroyed the independent Fulani state.\n\nAs a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon (at more than 60% of the region's entire population, which considering the fact that they weren't from the area, is a remarkable feat), and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nEarly life\n\nAdama came from a respected but humble family; his father, H*ana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama's family were part of a Fulani group being led by an Ardo Haman. They settled in Gurin a few years after Adama's birth. They later crossed Mayo-Faro, being the first group of Fulbe to cross the river, looking for pasturage. When Adama became old enough, he left the party to pursue knowledge.\n\nAdama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. Adama proved a bright scholar and a pious Muslim, and he earned the *le Modibbo, \"Lettered One\". Whilst on a trip away from Bornu (most likely in Gombe), he heard rumours of the vibrant Islamic Scholarly scene in Degel. He returned home to Gurin shortly after this trip. The party he had left had built a town on the Faro river. He remained there becoming a teacher especially to Ardo Haman. He later decided to continue his pursuit of knowledge. He left his party again but leaving his Quran with Ardo Haman to teach in his place. He left for Degel accompanied by another Mallam Haman (later Lamido of Song). He was teaching and learning in Degel where might have been taught by Shaikh Usman dan Fodio.\n\nJihad\n\nTalk in Guringa also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated Hausa rulers at Gobir and Kebbi. Usman had now turned his attention to Bornu and to the vast southlands of Fombina (modern-day Northern Cameroon and North-Eastern Nigeria).\n\nAdama's mandate\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa *embled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves or convert to Islam.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves. It was during these battles that Adama received the news that his father was killed by the Bata on the Beti River. Modibbo Adama's force continued their battles against Bata and Lala peoples as far as the Gongola River, where he met the Lamido of Gombe, Buba Yero. The two joined forces and fought back the Yanguru, Hona and Kibba peoples. The two forces eventually stopped and both went homewards.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on cl* or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councillors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe (singular: lamido), who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000:km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Lamido of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned gr*es that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated.\n\nNotes\n\nDeLancey, Mark W., and DeLancey, Mark Dike (2000): Historical Dictionary of the Republic of Cameroon (3rd ed.). Lanham, Maryland: The Scarecrow Press.\n\n(3rd ed.). Lanham, Maryland: The Scarecrow Press. Fanso, V. G. (1989). Cameroon History for Secondary Schools and Colleges, Vol. 1: From Prehistoric Times to the Nineteenth Century. Hong Kong: Macmillan Education Ltd.\n\nHong Kong: Macmillan Education Ltd. Johnston, H. A. S. (1967): The Fulani Empire of Sokoto . Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press.\n\n. Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press. Ngoh, Victor Julius (1996): History of Cameroon Since 1800 . Limbe: Presbook.\n\n. Limbe: Presbook. Njeuma, Martin Z. (1990): \"The lamidates of northern Cameroon, 1800–1894\", Introduction to the History of Cameroon in the Nineteenth and Twentieth Centuries. Palgrave MacMillan.\n\nReferences"}, {"url": "https://www.liquisearch.com/modibo_adama/legacy", "page_content": "Legacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000 km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Emir of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned grasses that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated."}, {"url": "https://www.liquisearch.com/modibo_adama/early_life", "page_content": "“Love is the hardest thing in the world to write about. So simple. You\u0092ve got to catch it through details, like the early morning sunlight hitting the gray tin of the rain spout in front of her house. The ringing of a telephone that sounds like Beethoven\u0092s \u0093Pastoral.\u0094 A letter scribbled on her office stationery that you carry around in your pocket because it smells of all the lilacs in Ohio.”\n\n—Billy Wilder (b. 1906)\n\n“The life of mind is best and pleasantest for man, since mind more than anything else is man. This life therefore is also the happiest.”\n\n—Aristotle (384\u0096323 B.C.)"}, {"url": "http://dictionary.sensagent.com/Modibo_Adama/en-en/", "page_content": "Adama bi Ardo Hassana (c. 1786 – c. 1847), more commonly known as Modibo Adama, was a Fulani scholar and holy warrior. He led a jihad into the region of Fumbina (in modern day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon, and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurina and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fumbina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Emir of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon.\n\nEarly life\n\nAdama came from a respected but humble family; his father, Hassana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. He continued his studies in Hausaland (modern Northern Nigeria), where legend says his teacher was the Fulani Shehu Usman dan Fodio in Degel. Adama proved a bright scholar and a pious Muslim, and he earned the title Modibo, \"Lettered One\". After several years away, he returned home to Guringa around 1804. There, the news was grim. Adama's father had died in 1803 fighting the Bata.\n\nJihad\n\nTalk in Gurina also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated non-Fulani leaders at Gobir and Kébbi. Usman had now turned his attention to Bornu and to the vast southlands of Fumbina (modern-day Northern Cameroon).\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa assembled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves to the Fulani and convert to their faith.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain. Sentiment for jihad was high.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on class or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councilors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe, who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000 km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Emir of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned grasses that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated.\n\nReferences\n\nDeLancey, Mark W., and DeLancey, Mark Dike (2000): Historical Dictionary of the Republic of Cameroon (3rd ed.). Lanham, Maryland: The Scarecrow Press.\n\n(3rd ed.). Lanham, Maryland: The Scarecrow Press. Fanso, V. G. (1989). Cameroon History for Secondary Schools and Colleges, Vol. 1: From Prehistoric Times to the Nineteenth Century. Hong Kong: Macmillan Education Ltd.\n\nHong Kong: Macmillan Education Ltd. Johnston, H. A. S. (1967): The Fulani Empire of Sokoto . Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press.\n\n. Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press. Ngoh, Victor Julius (1996): History of Cameroon Since 1800 . Limbe: Presbook.\n\n. Limbe: Presbook. Njeuma, Martin Z. (1990): \"The lamidates of northern Cameroon, 1800-1894\", Introduction to the History of Cameroon in the Nineteenth and Twentieth Centuries. Palgrave MacMillan."}, {"url": "https://en-academic.com/dic.nsf/enwiki/1204459", "page_content": "Adama bi Ardo Hassana (c. 1786 – c. 1847), more commonly known as Modibo Adama, was a Fulani scholar and holy warrior. He led a jihad into the region of Fumbina (in modern day Cameroon and Nigeria), opening the region for Fulani colonisation. As a result of Adama's constant warring, the Fulani today make up the largest ethnic group in Northern Cameroon, and Islam is the dominant religion. The wars also forced many peoples south into the forest region.\n\nAdama studied in Hausaland and earned the title \"Modibo\" (\"Lettered One\") for his scholarship. Upon finishing his studies, he returned home to Gurina and learned of the jihad declared by Fulani mystic Usman dan Fodio. When he accompanied a delegation to visit Usman, the leader ordered Adama to extend his jihad east as \"Lamido Fumbina\" (Ruler of the Southlands).\n\nAdama raised an army and attacked Bata settlements near Gurin. He took the villages, and many more traditional Fulbe leaders and new soldiers came to his side. He next took on Mandara, the largest and best organised state in the region. He swept over several smaller settlements and eventually conquered the Mandara capital, Dulo, with ease. While his men celebrated, however, the Mandara army counterattacked and recaptured the town.\n\nThough he fought many more campaigns, Adama now spent most of his time in Yola, which became his capital. He set about creating the administrative structure of his new state, which he named Adamawa after himself. Adama ruled the empire, subordinate only to Usman dan Fodio in Sokoto. Below him lay the heads of major settlements, known as lamibe (singular: lamido). The village formed the smallest unit of government.\n\nUpon Adama's death in 1847, his son Muhammadu Lawal became Emir of Adamawa. The empire was not to last, however, as colonial battles and division eventually destroyed the independent Fulani state. The conquest had long-term repercussions, however. The Fulani became the dominant ethnic group in the region, and Islam the major religion. The herdsmen altered the land to be more suitable for herding cattle, their primary pursuit. The jihad also pushed those peoples who had lived on the Adamawa Plateau south into the forest, the single most important event in the populating of Southern Cameroon.\n\nEarly life\n\nAdama came from a respected but humble family; his father, Hassana, was a well regarded scholar of Islam and minor nobleman from Ba'ajo. Adama travelled to Bornu for his education, where he stayed for some time under the tutelage of Mallam Kiari. He continued his studies in Hausaland (modern Northern Nigeria), where legend says his teacher was the Fulani Shehu Usman dan Fodio in Degel. Adama proved a bright scholar and a pious Muslim, and he earned the title Modibo, \"Lettered One\". After several years away, he returned home to Guringa around 1804. There, the news was grim. Adama's father had died in 1803 fighting the Bata.\n\nJihad\n\nTalk in Gurina also concerned events in Hausaland. Word had arrived that Usman dan Fodio had declared a militant jihad on the Hausa leaders. He had installed himself at Gudu and subsequently defeated non-Fulani leaders at Gobir and Kébbi. Usman had now turned his attention to Bornu and to the vast southlands of Fumbina (modern-day Northern Cameroon).\n\nStill, the picture seemed unclear to leaders farther from the fighting. Was Usman a Mujaddid (reformer), or was he the Mahdi, a saviour figure who would create an ideal Muslim society? In 1805 or 1806, the Fulani leaders at Guringa assembled a delegation to visit Usman and find out. Adama's pious reputation and familiarity with Hausaland made him a natural fit for the mission.\n\nThe party met Usman in 1806, probably in Gwandu. There, they learned that his intention was to extend his jihad eastward, into Fumbina. The goal was ostensibly to convert various Kirdi (pagan) peoples to Islam and to protect Muslims who already lived in the area. The jihadists were also supposed to educate the region's current Muslim population, many of whom merged Islam with paganism.\n\nThough not the oldest member, Adama was one of the more zealous about Usman's ideas. Usman thus presented him with a command that would change his life dramatically. The Shehu gave Adama his blessing and presented him with a flag, the symbol of command in Usman's army. The Shehu then charged Adama to carry the jihad into Fumbina and from the Nile to the Bight of Biafra. Adama also received the power to distribute flags of command to others, thus establishing more centres of Fulani Islam and spreading the war to farther reaches.\n\nEarly campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves to the Fulani and convert to their faith.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants.\n\nMandara campaign\n\nAdama turned his attentions on the only major state in Fumbina that could present a threat to his fledgling emirate: Mandara. It was an attractive target. It lay between Bornu to the north and Baghirmi in the Chad Basin, so its fall would facilitate the conquest of these areas. Its people were already Muslim, though they mixed the religion with pagan practices. Moreover, it had a large population from whom soldiers could be conscripted, and it was renowned for its excellent horses. Mandara was well organised, however, and would not be an easy prize. The people who lived there, the Mandarawa, had a long-standing rivalry with the Fulani, who had fought them under the Bornu in previous years. This animosity only served to drive more Fulani to Adama's armies, though, as many veterans were eager for another crack at an old rival. Furthermore, Fulbe rulers Modibo Damraka and others were already embroiled in fighting against the Mandara in the Diamaré Plain. Sentiment for jihad was high.\n\nAdama reached Guringa in 1809 with a large army in good morale. He quickly conquered the Mandara settlement at Guider and headed north, taking several more villages along the way. Outside of the Mandara capital, Dulo, Adama demanded that the king, Bukar Djiama, swear his allegiance and convert to Islam untainted with paganism. Bukar agreed to acknowledged Adama's right to rule his own subjects, but he refused to yield his own sovereignty. Adama and his men took Dulo with little fighting.\n\nAdama searched for someone to rule the settlement, but he found no one whom he felt adequate for the post. Meanwhile, his troops revelled in their plunder. No one expected the Mandara counterattack, which was launched from nearby Mora. Adama fled the town, and Dulo fell from his grasp forever.\n\nAdministration\n\nAdama and his men retreated to Yola (in present-day Nigeria). The town would become his capital by 1841. From here, he and his lieutenants continued to expand the emirate, which he named Adamawa after himself. The subordinates had to send him tribute in the form of cattle. Large settlements such as Maroua, Garoua, and Ngaoundéré fell to Adama or his lieutenants. By 1825, the Fulani had penetrated the Adamawa Plateau. Nevertheless, Adama lived in relatively moderate surroundings and never acquired great wealth.\n\nFrom Yola, Adama began the administrative tasks necessary for his nascent state. He did this with Usman's advice; he was to foster understanding between his people and their governors, facilitate communication between elders and their subordinates, and prevent the stratification of society based on class or wealth. The empire eventually took on three administrative tiers. At the centre was the emir al-Mu'minin (\"commander of the faithful\"), Adama himself, ruling from Yola and answering only to Usman dan Fodio in Sokoto. A contingent of councilors and administrators directly aided him, and a household staff of non-Fulbe and slaves doubled as his bodyguard. Below him were a number of district leaders, the lamibe, who ruled key settlements. Under them were a number of villages, each headed by a village chief.\n\nMeanwhile, some of the older ardo'en grew powerful through their own conquests. They regarded the unconquered areas near their territories as their own private backyards and defended these zones from all comers. This sometimes surfaced in their relations with Adama, such as when Bouba Njida of Rai refused to come to Adama's aid when the emir was fighting the Namchi at Poli. Instead, Bouba waited for Adama to retreat from the area to bring in his own forces and finish the enemy off. He then sent prisoners from the battle to Adama as a gift.\n\nLegacy\n\nAdama died in 1847 and was laid to rest at Yola (his tomb survives to this day). Adamawa covered 103,000 km² from Lake Chad to Banyo and was inhabited by 1,500,000 people. Further expansion to the south had proved difficult and undesirable since the presence of the tsetse fly and thick jungle made cattle rearing difficult there.\n\nAdama's son Muhammadu Lawal succeeded him after a brief regency under Hamidu bi Adama. Eventually, three of Adama's other sons would at some point serve as Emir of Adamawa. Not until the British and German colonial periods would the emirate come to an end.\n\nDespite their loss of independence, the Fulani were now the preeminent ethnic group of Northern Cameroon. They spread Islam throughout the region, establishing it as the dominant religion. Education also flourished, as new converts learned Arabic writing and studied the Qur'an. Trade flourished, and communications with it. The conquests were also important ecologically. Lands that had once been used for cultivation now became part of Fulani pastureland. Herdsmen cut down trees to make way for cattle, and they burned grasses that their herds later trampled. Centuries of such behaviour have replaced the region's forest with savanna.\n\nIronically, the Adamawa was more sparsely populated after Adama's conquest. Rather than fight the Fulani invaders, many peoples fled, displacing others in turn. The Adamawa Plateau, once home to many of Cameroon's ethnic groups, soon became a pastureland, and the forest zone of Cameroon became more heavily populated.\n\nReferences\n\nDeLancey, Mark W., and DeLancey, Mark Dike (2000): Historical Dictionary of the Republic of Cameroon (3rd ed.). Lanham, Maryland: The Scarecrow Press.\n\n(3rd ed.). Lanham, Maryland: The Scarecrow Press. Fanso, V. G. (1989). Cameroon History for Secondary Schools and Colleges, Vol. 1: From Prehistoric Times to the Nineteenth Century. Hong Kong: Macmillan Education Ltd.\n\nHong Kong: Macmillan Education Ltd. Johnston, H. A. S. (1967): The Fulani Empire of Sokoto . Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press.\n\n. Chapter 8: \"The Jihad in Adamawa and Bauchi\". London: Oxford University Press. Ngoh, Victor Julius (1996): History of Cameroon Since 1800 . Limbe: Presbook.\n\n. Limbe: Presbook. Njeuma, Martin Z. (1990): \"The lamidates of northern Cameroon, 1800-1894\", Introduction to the History of Cameroon in the Nineteenth and Twentieth Centuries. Palgrave MacMillan.\n\nPreceded by\n\nnone Emir of Adamawa\n\n1806-1847 Succeeded by\n\nMuhammadu Lawal bi Adama"}, {"url": "https://www.liquisearch.com/modibo_adama/jihad/early_campaigns", "page_content": "Early Campaigns\n\nAdama immediately began recruiting Fulani and Hausa volunteers and mercenaries. These were mainly mounted cavalrymen fighting with sword, bow, and poisoned arrow. Adama forbade them to pillage or to kill indiscriminately, but enemy nations were given two choices: convert to Islam or become a tributary state. Those ethnic groups that lacked a centralised government had but one: become slaves to the Fulani and convert to their faith.\n\nThe non-Fulani Muslims of the Adamawa largely rejected Adama's jihad; they viewed it as little more than an excuse to spread Fulani hegemony. However, it was primarily the Fulani leaders (ardo'en, singular: ardo) of Fumbina with whom Adama was concerned. Some of them rejected his primacy for various reasons: He was from a fairly humble background, he owned little wealth, his army was still small, and he lacked charisma. The majority, however, welcomed Adama as a military commander or religious leader at the very least. Adama's son-in-law, Jauro Dembo, had already settled in Fumbina at Malabu and became one of his lieutenants.\n\nThe makeshift army made headquarters at Gurin, a fort at the junction of the Faro and Benue Rivers where Fulani warriors had regrouped after fighting the Bata in 1803. Adama then led his forces in a series of strikes on Bata settlements such as Pema, Tepa, and Turuwa. The victories elated Adama's men, who took numerous Bata slaves.\n\nThe early successes convinced more local Fulani leaders to come to Adama's side. Even those ardo'en who opposed his political rule recognised the jihad as an opportunity to expand their territories. Njobdi of the Wollarbe clan is one notable example, and his major rival, Hammam Sambo, perhaps the first ardo to have settled in Fumbina, proved the major holdout. Bitter relations between Njobdi and Hammam would prove a major obstacle in Adama's quest to maintain a cohesive empire.\n\nIn addition, common Fulani were inspired by Adama's exploits and formed into bands. Adama created a new position for their leaders: The lamido (plural: lamibe), who was the leader of a particular territory, as opposed to an ardo, leader of a particular people. Both groups received flags of command and shared the same status in Adama's armies. Before his death, Adama would appoint over 40 non-ardo lamibe. They would prove his most loyal lieutenants."}, {"url": "https://joshuaproject.net/people_groups/11774/GB", "page_content": "Introduction / History\n\nIn the 1800s, Modibo Adama, a scholar and Muslim holy warrior, led a jihad in what is now Cameroon and Nigeria, opening the region up to Fulani colonization. He continued his campaign, eventually conquering many villages and founding his own empire, which he named Adamawa after himself. His Fulani people established Islam as the religion in the region. New converts learned classical Arabic in order to study the Koran. To support themselves, the people raised cattle on land that was once forested.\n\n\n\nIn general, the Fulani peoples are located in an almost horizontal strip across West Africa. The Sahara Desert forms their northernmost boundary, while the threat of tsetse flies controls their movement to the south. The Fulani tribes are grouped and named according to their locations, occupations, and dialects. The Adamawa Fulani are the group of Fulani who live in Nigeria's Adamawa Province. Some live in Cameroon, Chad, Gabon, and Sudan. There are also a small number in Cape Verde.\n\nWhat Are Their Lives Like?\n\nFor hundreds of years the Fulani people have been nomadic shepherds and cattle herders. They sometimes farm, but they much prefer to tend livestock. They judge one another's status by the number of cattle they own.\n\nWhat Are Their Beliefs?\n\nThe 1500s was a time when the first Fulani became Muslim, but they didn't have a full movement to Islam until the 1800s. As often has happened in Islamic history, this movement came as the result of military activity. The Fulani are actually folk Muslims, meaning that they blend traditional religion with Islam. They seek to control the spirit world through animal sacrifices and by wearing fetishes.\n\n\n\nThe Fulani have their own unique moral code that combines virtues, which they call \"The Fulani pathway.\" The dominant trait involves having an intimate understanding of Fulani language and culture. They also value patience, self-control, discipline, modesty, respect for others, wisdom, courage, and hard work.\n\nWhat Are Their Needs?\n\nLike the other Fulanis, the Fulanis in Gabon need to understand that it is essential to embrace the lordship of Jesus Christ. Many believe they have all they need, but like the people of Sardis, they are \"wretched, miserable, poor, blind, and naked,\" without an ability to see the Lord.\n\nPrayer Points\n\nTraditionally the Fulani have been spiritually resistant. Pray for spiritual openness to the lordship of Jesus Christ.\n\n\n\nPray that efforts by mission agencies in countries where the Fulani live will affect the Fulanis in Gabon.\n\n\n\nPray for a disciple making movement among the Fulani throughout West Africa.\n\n\n\nPray that the few Fulani believers will shine like the sun before their Muslim neighbors so that others will give Christ the honor He is due.\n\nScripture Prayers for the Fulani, Adamawa in Gabon.\n\nReferences\n\nhttp://www.sim.org/index.php/content/fulani\n\n\n\nhttp://www.sim.org/index.php/project/93415\n\n\n\nhttp://malibowers.blogspot.com/p/fulani-people-and-ministry-faq.html\n\n\n\nhttp://www.peoplegroups.org/Explore/groupdetails.aspx?peid=13186\n\n\n\nht"}, {"url": "https://theconversation.com/institutions/modibbo-adama-university-of-technology-1438", "page_content": "The shrinking of Lake Chad contributes to instability in the countries which sit around its expanse.\n\nThe shrinking of Lake Chad contributes to instability in the countries which sit around its expanse.\n\nWhat needs attention is the lack of opportunity that drives sports betting.\n\nWhat needs attention is the lack of opportunity that drives sports betting.\n\nMartapiqs\n\nOctober 3, 2014 How malaria testing can get more people back into work"}]}