{"After retiring from football, Bert Deacon became a successful businessman.": [{"url": "https://www.businessinsider.com/11-ex-footballers-who-became-successful-businessmen-2019-10", "page_content": "From buying clubs to launching apps, many retired footballers try their hand at continuing a career off the pitch too.\n\nWhile some of them, like David Beckham, have created multi-million dollar empires, others are still struggling to keep their businesses afloat.\n\nToday, with the help of social media, more players are attempting to promote their own brands.\n\nVisit Business Insider's homepage for more stories.\n\nTop editors give you the stories you want — delivered right to your inbox each weekday. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy\n\nFootball players tend to have a reputation for being bad at handling their money.\n\nIt's just like the Northern Irish legend, George Best, once said: \"I spent a lot of money on booze, birds and fast cars. The rest I just squandered.\"\n\nThree out of five Premier League players declare bankruptcy after retirement, according to the Independent.\n\nRead more: These are the 40 best young soccer players on the planet right now\n\nBut there are some players who have proven that they have more than just skills on the pitch, carving out a professional career with their amazing entrepreneurial skills.\n\nNow, a whole generation of players is starting much earlier, using social media to turn themselves into a high-value brand.\n\nBut not all of them are successful with their own companies and fail in their second career."}, {"url": "https://www.carltonfc.com.au/news/712053/moment-24-deacons-brownlow-medal", "page_content": "24. 1947 - Bert Deacon's Brownlow Medal\n\nVIEW THE 25 GREATEST MOMENTS HUB HERE\n\nThe man who would be Carlton’s first Brownlow Medallist deftly adjusted the dial of his trusty bakelite radio. Flicking the knob with those long fingers famously used for plucking the pigskin of a Saturday afternoon, Bert Deacon pierced the crackle when he found station 3DB.It was early on the evening of Wednesday, September 3, 1947, and Bert and his dear wife, Jean, having already kissed goodnight to their baby boy Brian, pulled up a couple of armchairs at their modest home in Preston’s Hawker Avenue. There they lent a collective ear to the station’s broadcast of what would prove an historic medal count.As the votes were being cast, Deacon fully anticipated Richmond’s Bill Morris to emerge with the gong ... not that he and his better half particularly cared. “Bert hadn’t thought about the Brownlow Medal and I didn’t even know what a Brownlow Medal was. I was a country bumpkin,” said Jean, in an interview with this reporter a few months prior to her death in August 2009.“We had some friends, Jack Costello and his girlfriend Carol, who ran the Preston Hotel in High Street, who also came around to listen. When Bert’s name was announced the visitors went out to their car and returned with beer and sandwiches, and by the time reporters turned up there was a beer and sandwich waiting. The other thing I remember that night was that Bert’s brother-in-law (former St Kilda footballer William Maslen), who lived in Coburg at the time, rode his bike across to shake hands with him.”With votes awarded by field umpires on a basis of three for first preference, two for second and one for third, Deacon accrued four first preferences, three seconds and five thirds to emerge the victor with 23 votes. He overhauled St Kilda’s Harold Bray by two votes.As The Herald’s famed football writer Alf Brown declared. “Great consistency – he was awarded votes in 12 out of 18 games – helped Deacon to win the trophy. He scored four first votes and was equal first with Bill Morris (Richmond) after the first votes had been counted. With three seconds he crept to second place after the second votes had been counted – Bray led 21 to 18 – and with five third votes he won the medal from Bray, who did not score a point when the third votes were counted,” Brown wrote.The record books show that Deacon represented Carlton in 106 senior matches from 1942 through to 1949, including the famous “Bloodbath” Grand Final against South Melbourne in 1945 and the last gasp Grand Final victory over Essendon in ’47. He also represented the Big V in 1947, ’48 and ’49 and was barely 50 matches into his senior career when he won the coveted Brownlow.The late Jim Clark, one of the last surviving members of the premiership teams of which Deacon was such an integral part, was recently asked to declare the best Carlton footballer he ever played alongside. “Oh easy,” came the reply. “Berty Deacon ... class .... one of the greatest ever. He was a Preston boy, married a girl from Kerang, and Bert and I were great cobbers. I got my first break with the seniors in 1943 and had the privilege of playing alongside him. He was not only a great footballer, but a bonza feller and a real gentleman. There will never be a better footballer, in my opinion, than Berty Deacon.“Berty was around six foot and a half (184cm) but he had such long fingers he rarely dropped a mark, and he was a pro runner too – nearly every footy club had two or three pro-runners. He won the Brownlow Medal in ’47 – a premiership year – and to win the Brownlow in a premiership year would have to be a prestigious Brownlow because a premiership team would have a lot of other chappies taking votes. But Berty had such superiority and he was as fair as fair as fair.”It says something of the character of the man that barely 24 hours after his famous Brownlow win, Deacon and Ken Luke paid an impromptu visit to Deacon’s teammate Ron Hines, who was convalescing in Heidelberg hospital. A photograph which later appeared in The Herald shows Hines congratulating Deacon on his win with a handshake, as Ken Luke proudly watches on.The great Horrie Clover echoed the sentiments of all at Princes Park, who saw Deacon as a worthy recipient of the precious medal. “I am very delighted that a Carlton player should at long last win the medal,” Clover told a reporter from The Sun. “Without fear of contradiction I can say Bert Deacon is a great player and a great chap.”Objective observers such as Alf Brown also concurred. “Football followers will applaud the selection of Bert Deacon as the winner of this year’s award. He is one of the most brilliant players in the game – a sure, spectacular mark, a fast and clever ground player, and a defender whose courageous clearing dashes often put his side into attack,” Brown wrote. “Deacon, who is vice-captain of Carlton, is the best mark of a wet ball I have seen. He has remarkably big hands and this, undoubtedly, accounts for his ability to take spectacular finger-tip marks with either a greasy or dry ball.“The field umpires’ votes for the Medal show that they have placed great emphasis on fairness as well as on ability. Deacon is scrupulously fair . . . ”Bert Deacon was tragically lost to the football world when, on January 3, 1974, he suffered a fatal heart attack. Though only 51, the boy from the northern suburbs had dedicated 34 years to his beloved Blues.On New Year’s Eve, 1991, Deacon’s famous medal was stolen from his widow’s purse during a house break-in. Thankfully, Jean received a replacement medal, struck when then-chief executive commissioner of the AFL the late Alan Schwab heard of her plight."}, {"url": "https://www.businessresearchguide.com/5-former-professional-athletes-who-became-successful-businessmen/", "page_content": "There are plenty of stories about athletes who have gone flat broke shortly after retiring from their respective sports (Curt Schilling, Mike Tyson, and Mark Brunnell are just a few of them). Stories of failure create more buzz for mainstream media and bloggers, but the guys who successfully transitioned from athlete to entrepreneur deserve equal (if not more) coverage.\n\nRick Mirer, Former Notre Dame and NFL Quarterback\n\nMirer is known more for his 29-7-1 record at Notre Dame than his journeyman career in the NFL. After being draft number-2 overall by the Seattle Seahawks, Mirer finished his career with a 50-to-76 touchdown to interception ratio, playing for 7 teams. Today, Mirer owns Mirror Wine Company in Napa Valley. He also started the Mirer Foundation, which helps children in need in his hometown of Goshen, Ind.\n\nLincoln Kennedy – Former NFL Offensive Lineman\n\nKennedy played in three Pro-Bowls and Super Bowl XXXVII, and has transitioned nicely into his role as a Farmers Insurance agent. He protected quarterbacks throughout his career, and now offers “all-pro protection” to his customers out of his Phoenix office. Kennedy said Oakland Raiders fans particularly enjoy having him as their insurance agent. He played seven years in Oakland, a city known for its very passionate (and interesting) fans. Kennedy earned his bachelor’s degree in speech communication after his career, which helped him land a studio host position at the NFL Network.\n\nMagic Johnson – Former NBA All-Star\n\nThere is no way to give Magic the praise he deserves in a few sentences with regards to his NBA playing days, nor his subsequent business success. A five-time NBA champion, Magic was honored by American Express in 2004 for all his life’s achievements, and was even a spokesman for the company in a 1999 ad campaign. Pushing new business credit cards was just one of many ventures Johnson used to accumulate his reported net worth of over $500 million.\n\nMike Ditka – Former NFL Tight End and Head Coach\n\nThe fiery and high-energy coach has dabbled in everything from broadcasting to politics since his days as head coach of the Chicago Bears ended. He considered running against Barack Obama for the U.S. Senate in Illinois, but was coaxed out of it by his wife. She specifically did not want him to harm their very successful Mike Ditka Restaurants chain. Ditka regularly appears on Chicago-area radio shows and currently works for ESPN on its NFL pre-game shows.\n\nGeorge Foreman – Former Heavyweight Boxing Champion\n\nForeman displayed his powerful punching style to two generations of boxing fans. He lost his championship belt to Muhammad Ali in the historic 1974 “Rumble In The Jungle,” and regained it 20 years later (at age 45) against Michael Moorer. Today its hard to find a household that does not have a George Foreman grill in it. Businessweek reported Foreman had earned over $240 million as the grill’s namesake."}, {"url": "https://www.nswfootballhistory.com.au/tag/bert-deacon/", "page_content": "This article is written by Miles Wilks, former member of the Society’s management committee and author of a very detailed and well researched book, Australian Football Clubs in NSW. To read more about his book and how to get copy click here.\n\n\n\nMiles is passionate about this subject and welcomes any comments that can be directed here.\n\n– – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – – –\n\nIt is a commonly held belief that Sydneysiders have had an almost non-existent role in the game at the top level, yet the fact is that as many as 80 players have been recruited from Sydney to the VFL/AFL. Amongst the players recruited from Sydney is a player who kicked the winning goal in a VFL grand final, a Norm Smith medallist, eleven premiership players and a couple of record-holding goal kickers. It is a record of achievement that deserves more kudos.\n\nIn comparison, although one must preface this by stating I don’t have an intimate knowledge of rugby league recruiting, this figure of 80 players from Sydney to the VFL/AFL would presumably be larger than the combined number of rugby league players recruited from Melbourne, Adelaide, Perth, Hobart and Darwin rugby league clubs to the NRL.\n\nDecade by decade- number of players recruited from Sydney clubs to the VFL/AFL\n\n1897-1909 – 4 players\n\n1910s – 6 players\n\n1920s – 12 players\n\n1930s – 10 players\n\n1940s – 2 players\n\n1950s – 7 players\n\n1960s – 1 player\n\n1970s – 5 players\n\n1980s – 11 players\n\n1990s – 9 players\n\n2000s – 11 players\n\n2010-11 – 2 players\n\nIn 2012, there are 20 players who have been recruited from Sydney who are on AFL lists. Eight of these twenty have debuted in league football.\n\n1897-1910\n\nSydney’s first player: Bob Kenny\n\nBob Kenny was the first player recruited from a Sydney club to play in the VFL. He debuted in 1899 and played just two games for St Kilda. He was followed soon after by John Stephenson, who was recruited from the Balmain football club and played 10 games for Essendon in 1907. Marshall Herbert, a recruit from Redfern, was the most successful of these early Sydney recruits, as he played 51 games with the Pies from 1908 to 1910. At this stage it should be noted that the only major football code that competed with Australian football in Sydney for players was rugby union, as rugby league was not played in Sydney until 1908.\n\n1910s\n\nThe 1910s was a decade that resulted in the recruitment of two Sydneysiders who had a significant impact in the VFL.\n\nSTAR PLAYERS: Bob Merrick and Chris Laird. Recruited from East Sydney, Merrick established a goal-kicking record for his adopted Victorian team of Fitzroy in 1919 when he kicked a total of 12 goals in a match. This feat of 12 goals in a match was never bettered by any other Fitzroy player in the history of that club. Bob headed Fitzroy’s goalkicking list each year between 1919-22.\n\nThe other Sydneysider to have an impact in the big league during this decade was Chris Laird. He was recruited from the eastern suburbs club of Paddington and is one of the few players in the history of the game to live the dream of kicking a clutch goal in a grand final with just vital seconds remaining in the match. Laird changed the fortune of the 1918 VFL grand final when he kicked the winning goal for South Melbourne with less than a minute remaining in the match.\n\n1920s\n\nThe 1920s saw a twofold increase over the previous decade in the number of players from Sydney making the transition to the best Australian football competition in the land. Six Sydneysiders played in the VFL in the 1910s and as many as twelve Sydneysiders were recruited in the 1920s.\n\nFred Davies, who was another recruit from Sydney’s Eastern Suburbs, was the pick of the\n\nSydney recruits in this decade. His most notable achievement was being named as the captain of Fitzroy in 1934. Nevertheless, few of the other Sydney players had a large impact during this decade.\n\n1930s\n\nTen players from Sydney made the transition to the VFL in the 1930s. The pick of the players was Newtown’s Reg Garvin.\n\nSTAR PLAYER: Reg Garvin\n\nBefore he played football for the Sydney club of Newtown,\n\nReg Garvin had played soccer and rugby. Garvin was recruited from Sydney by St Kilda and he was a star player for that club, as he won the Saint’s best and fairest award in\n\n1941 & 1944 and also captain-coached the club. Reg GarvinBefore he played football for the Sydney club of Newtown,Reg Garvin had played soccer and rugby. Garvin was recruited from Sydney by St Kilda and he was a star player for that club, as he won the Saint’s best and fairest award in1941 & 1944 and also captain-coached the club.\n\n1940s\n\nThe 1940s was a decade in which there was a noticeable drop-off in the numbers of high quality players making their way from Sydney clubs to the VFL, obviously due to WWII. Ron Hall, from St George, was one of only two players recruited from Sydney to the VFL in the 1940s. The other player was Arthur Richardson, who played just five games for the Swans.\n\n1950s\n\nThe 1950s was another decade in which only a small number of Sydney players were recruited to the top league. One of the recruits, however, had a large impact in the VFL.\n\nSTAR PLAYER: Roger Duffy –\n\nAnother Newtown player. Duffy played his junior football for the South Sydney Australian football club and then for the nearby rivals Newtown.\n\nHe was an exceptional player in the Sydney league, and was a Newtown premiership player as well as the leading goal kicking for the Sydney football league in 1950 and 1951.\n\nDuffy achieved the premiership and goal-kicking double\u009d by being a premiership player and a goal-kicking leader in two states.\n\nHis premiership wins were with Newtown (NSW)and Footscray (Vic) and he was the leading goal kicker with Newtown (1950-51) and with Footscray (1952). Roger Duffy –Another Newtown player. Duffy played his junior football for the South Sydney Australian football club and then for the nearby rivals Newtown.\n\nHe was an exceptional player in the Sydney league, and was a Newtown premiership player as well as the leading goal kicking for the Sydney football league in 1950 and 1951. He was an exceptional player in the Sydney league, and was a Newtown premiership player as well as the leading goal kicking for the Sydney football league in 1950 and 1951.\n\nDuffy achieved the premiership and goal-kicking double\u009d by being a premiership player and a goal-kicking leader in two states. Duffy achieved the premiership and goal-kicking double\u009d by being a premiership player and a goal-kicking leader in two states.\n\nHis premiership wins were with Newtown (NSW)and Footscray (Vic) and he was the leading goal kicker with Newtown (1950-51) and with Footscray (1952). His premiership wins were with Newtown (NSW)and Footscray (Vic) and he was the leading goal kicker with Newtown (1950-51) and with Footscray (1952). 1960s\n\nThe 1960s was Sydney footballs lowest point in terms of the number of players recruited from Sydney clubs to the VFL. Barry Fitzgerald was the only player recruited directly from a Sydney club to the VFL during this decade. And he played just 35 games for Fitzroy. 1970s\n\nThe 1970s can be viewed as a decade of revival for football recruiting from Sydney. Whilst the 1960s was a low point in terms of player recruitment, the 1970s saw the recruitment of two stars of the game – Mark Marclure and Michael Byrne. STAR PLAYER:Mark Maclure\n\nMaclure played junior football for East Sydney and also won the Sanders Medal as the best player in Sydney’s reserve grade competition as a 17 year old. From there he tried out with Carlton’s under 19s team and was eventually lured to Carlton by their master recruiter Bert Deacon. Of all the players to have been recruited from Sydney, Mark Maclure is the player who can boast as having the greatest CV. On top of his list of achievements is being a member of three premiership teams (1979, 1981 and 1982). Maclure is the only player recruited from a Sydney football club to have played in as many as three VFL/AFL premiership teams. On top of this, he was the captain of his AFL club (in 1986), won his club’s goal kicking award (1979 and 1985) and played over 200 games for his beloved Blues. STAR PLAYER: Michael Byrne\n\nMichael Byrne is Sydney born and raised, having come through the ranks of local Sydney football on the northern beaches and then playing for the Sydney club of North Shore. Byrne’s induction into football was a tough one, as he played in the ruck for North Shore in the bloodbath Sydney grand final of 1976 at Trumper Park. This match was infamous in Sydney football for being punctuated by rolling brawls involving almost every player on the ground. After he left Sydney, Byrne became a premiership player with Hawthorn in 1983 and he produced on the big day, as he was the 2nd highest goal kicker for Hawthorn in the grand final after the legendary Leigh Matthews. Playing during Hawthorn’s greatest era. Byrne also had the honour of being runner up for the club’s best and fairest in 1984. 1980s\n\nThe 1980s saw the introduction of the Sydney Swans into the VFL competition and it was a decade in which there was a large upswing in the numbers of players recruited from Sydney. Only one player (1960s) and five players (1970s) made the transition to the top league in the two previous decades, but 11 players made the transition in the 1980s. Amongst these players was St George’s Mark Roberts, who was a premiership player with North Melbourne in 1996. 1990s\n\nThe 1990s was a remarkable decade in terms of the contribution of Sydney footballers to the AFL. It was the starting point for the careers of three Sydneysiders who played over 200 games of AFL football. The three players from Sydney who pulled on the guernsey in over 200 games of AFL football were Mark McVeigh [pictured left] (Essendon), Lenny Hayes (St Kilda) and Greg Stafford (Sydney and Richmond). McVeigh and Hayes were recruited from the Pennant Hills football club and Greg Stafford was recruited from Western Suburbs. STAR PLAYER: Lenny Hayes\n\nHayes became the first player from Sydney to win the Norm Smith medal. His last quarter performance in the 2010 grand final for the Saints was one for the record books, as he willed his team back into the contest by obtaining 11 possessions as well as kicking an inspiring goal from 50 metres out.\n\nSTAR PLAYER: Nick Davis\n\nNick Davis, recruited from Ramsgate juniors, didn’t have the longevity of career that Hayes, McVeigh or Stafford had, but he produced one of the defining moments in finals history and arguably the Swan’s greatest moment outside the 2005 grand final when he kicked four goals in the last quarter of the 2005 semi-final against Geelong. That blitz of goal turned the match around and secured the Swans a vital 3-point victory and the passage to a grand final victory. 2000s\n\nTwo exceptional footballers were recruited from the Pennant Hills football club in the 1990s (Lenny Hayes and Mark McVeigh), and the feat was replicated in the noughties, as two further Pennant Hills juniors of exceptional talent, Jarrad McVeigh and Kieran Jack, made their transition to the AFL. STAR PLAYER: Jarrad McVeigh\n\nMcVeigh won the Sydney Swan’s best and fairest award in 2008. This was a noticeable feat as McVeigh became the first player to be recruited from a local Sydney football club to win the award. It took 26 years after the club started in Sydney for a Sydney local to win the award, yet it only took a further two years for the next Sydney local to win the award when Kieran Jack was deemed Sydney’s best and fairest player in 2010. STAR PLAYER: Kieran Jack\n\nJack started his career for the Swans as a dogged tagger in 2007, yet it was only three years later that he won the club best and fairest award. Displaying unbridled determination, Kieran Jack won the award in 2010 largely because he had become a vital attacking option for the Swans. In his best and fairest year of 2010, Jack kicked 21 goals whilst still largely working in the midfield. In 2012, he is in contention for All-Australian selection as he continues to combine attacking flair with an ability to win the contested ball. Many may question if the introduction of the Swans has been a success, yet from a recruiting viewpoint for Sydneysiders it has been. Only one player from Sydney in the 80 years prior to the Swans introduction into the Sydney sporting landscape played over 200 games of top grade football. Since the Swans moved to Sydney there have been three 200 game players from Sydney . The players recruited from Sydney clubs in the years ahead will be following in the footsteps of exceptional footballers such as Roger Duffy, Michael Byrne, Lenny Hayes and the McVeigh brothers amongst others. Over the journey, the record of Sydneysiders at the top level is far better than what many would presume is the case“ there have been premiership players, club captains, club coaches, and best and fairest winners. Sydneysiders have achieved at the highest level of the Australian game, but just not with all the fanfare of players from other cities. Recent Posts Goals Galore\n\nSociety Releases Their New Book – Australian Football in Sydney 1877 – 1895\n\nGullie Boy Kicks On\n\nTemora True Boot\n\nMID SEASON UPDATE – CAREY BUNTON MEDAL – Coaches Votes Log In Username Password Forgotten Password\n\n1960s\n\nThe 1960s was Sydney footballs lowest point in terms of the number of players recruited from Sydney clubs to the VFL. Barry Fitzgerald was the only player recruited directly from a Sydney club to the VFL during this decade. And he played just 35 games for Fitzroy.\n\n1970s\n\nThe 1970s can be viewed as a decade of revival for football recruiting from Sydney. Whilst the 1960s was a low point in terms of player recruitment, the 1970s saw the recruitment of two stars of the game – Mark Marclure and Michael Byrne.\n\nSTAR PLAYER:Mark Maclure\n\nMaclure played junior football for East Sydney and also won the Sanders Medal as the best player in Sydney’s reserve grade competition as a 17 year old. From there he tried out with Carlton’s under 19s team and was eventually lured to Carlton by their master recruiter Bert Deacon. Mark MaclureMaclure played junior football for East Sydney and also won the Sanders Medal as the best player in Sydney’s reserve grade competition as a 17 year old. From there he tried out with Carlton’s under 19s team and was eventually lured to Carlton by their master recruiter Bert Deacon. Of all the players to have been recruited from Sydney, Mark Maclure is the player who can boast as having the greatest CV. On top of his list of achievements is being a member of three premiership teams (1979, 1981 and 1982). Maclure is the only player recruited from a Sydney football club to have played in as many as three VFL/AFL premiership teams. On top of this, he was the captain of his AFL club (in 1986), won his club’s goal kicking award (1979 and 1985) and played over 200 games for his beloved Blues.\n\nSTAR PLAYER: Michael Byrne\n\nMichael Byrne is Sydney born and raised, having come through the ranks of local Sydney football on the northern beaches and then playing for the Sydney club of North Shore. Michael ByrneMichael Byrne is Sydney born and raised, having come through the ranks of local Sydney football on the northern beaches and then playing for the Sydney club of North Shore. Byrne’s induction into football was a tough one, as he played in the ruck for North Shore in the bloodbath Sydney grand final of 1976 at Trumper Park. This match was infamous in Sydney football for being punctuated by rolling brawls involving almost every player on the ground. After he left Sydney, Byrne became a premiership player with Hawthorn in 1983 and he produced on the big day, as he was the 2nd highest goal kicker for Hawthorn in the grand final after the legendary Leigh Matthews. Playing during Hawthorn’s greatest era. Byrne also had the honour of being runner up for the club’s best and fairest in 1984.\n\n1980s\n\nThe 1980s saw the introduction of the Sydney Swans into the VFL competition and it was a decade in which there was a large upswing in the numbers of players recruited from Sydney.\n\nOnly one player (1960s) and five players (1970s) made the transition to the top league in the two previous decades, but 11 players made the transition in the 1980s. Amongst these players was St George’s Mark Roberts, who was a premiership player with North Melbourne in 1996.\n\n1990s\n\nThe 1990s was a remarkable decade in terms of the contribution of Sydney footballers to the AFL. It was the starting point for the careers of three Sydneysiders who played over 200 games of AFL football. The three players from Sydney who pulled on the guernsey in over 200 games of AFL football were Mark McVeigh [pictured left] (Essendon), Lenny Hayes (St Kilda) and Greg Stafford (Sydney and Richmond). McVeigh and Hayes were recruited from the Pennant Hills football club and Greg Stafford was recruited from Western Suburbs.\n\nSTAR PLAYER: Lenny Hayes\n\nHayes became the first player from Sydney to win the Norm Smith medal. His last quarter performance in the 2010 grand final for the Saints was one for the record books, as he willed his team back into the contest by obtaining 11 possessions as well as kicking an inspiring goal from 50 metres out.\n\n\n\nSTAR PLAYER: Nick Davis\n\nNick Davis, recruited from Ramsgate juniors, didn’t have the longevity of career that Hayes, McVeigh or Stafford had, but he produced one of the defining moments in finals history and arguably the Swan’s greatest moment outside the 2005 grand final when he kicked four goals in the last quarter of the 2005 semi-final against Geelong. That blitz of goal turned the match around and secured the Swans a vital 3-point victory and the passage to a grand final victory.\n\n2000s\n\nTwo exceptional footballers were recruited from the Pennant Hills football club in the 1990s (Lenny Hayes and Mark McVeigh), and the feat was replicated in the noughties, as two further Pennant Hills juniors of exceptional talent, Jarrad McVeigh and Kieran Jack, made their transition to the AFL.\n\nSTAR PLAYER: Jarrad McVeigh\n\nMcVeigh won the Sydney Swan’s best and fairest award in 2008. This was a noticeable feat as McVeigh became the first player to be recruited from a local Sydney football club to win the award. It took 26 years after the club started in Sydney for a Sydney local to win the award, yet it only took a further two years for the next Sydney local to win the award when Kieran Jack was deemed Sydney’s best and fairest player in 2010.\n\nSTAR PLAYER: Kieran Jack\n\nJack started his career for the Swans as a dogged tagger in 2007, yet it was only three years later that he won the club best and fairest award. Displaying unbridled determination,\n\nKieran Jack won the award in 2010 largely because he had become a vital attacking option for the Swans. In his best and fairest year of 2010, Jack kicked 21 goals whilst still largely working in the midfield. In 2012, he is in contention for All-Australian selection as he continues to combine attacking flair with an ability to win the contested ball.\n\nMany may question if the introduction of the Swans has been a success, yet from a recruiting viewpoint for Sydneysiders it has been. Only one player from Sydney in the 80 years prior to the Swans introduction into the Sydney sporting landscape played over 200 games of top grade football. Since the Swans moved to Sydney there have been three 200 game players from Sydney .\n\nThe players recruited from Sydney clubs in the years ahead will be following in the footsteps of exceptional footballers such as Roger Duffy, Michael Byrne, Lenny Hayes and the McVeigh brothers amongst others. Over the journey, the record of Sydneysiders at the top level is far better than what many would presume is the case“ there have been premiership players, club captains, club coaches, and best and fairest winners. Sydneysiders have achieved at the highest level of the Australian game, but just not with all the fanfare of players from other cities."}, {"url": "https://www.carltonfc.com.au/news/751558/dudley-drew-and-the-lost-painting-of-bert-deacon", "page_content": "\n\nDudley Drew talks to CFC TV about his memories of his friend Bert Deacon, and about the painting he has just completed of Deacon completing a high mark over Richmond’s Roy Smeaton at Punt Road.\n\nClick here to view the video\n\nBack in 1948, a budding Melbourne artist named Dudley Drew was trying to eke out an existence in his adopted profession when, on the advice of his dear mother, he resolved to paint somebody famous.\n\nDudley’s Mum volunteered the name of Carlton centre half-back the late great Bert Deacon. After all, Deacon had just come off a stellar season, having taken out the 1947 Brownlow Medal, represented Carlton in its eighth premiership and earned Victorian and All-Australian selection.\n\nHow well Dudley remembers the moment. “My mother was blind, and when Bert won the Brownlow I was sitting with Mum in the bedroom talking to her one night and she said, ‘You should paint a portrait of Bert Deacon’,” Dudley explained.\n\n“I said ‘Do you think it’s a good idea?’ and she said ‘I think it will be wonderful for you’. I then said ‘How do I do this?’ and she said ‘Go and see him’.”\n\nDudley made his way to 2 Hawker Avenue, Preston, where Bert and Jean then lived. “When I got there this particular night, around about seven o’clock, Bert was already in bed because he was injured - he’d injured his leg playing football, but he and Jean just welcomed me so much. It was great and I felt so proud,” Dudley said.\n\n“I then asked Bert if he would pose for the big portrait and he said ‘I’d be very happy to do that’. He sat for the portrait about eight times and I remember in one sitting he began to smile, exposing this toothless gap. He was painted sporting grey trousers and navy blue blazer with the white V on the pocket and included in the painting is a trophy Bert also won for best afield for Victoria.\n\n“Towards the end Bert said, ‘You know I really love this painting and I’m going to tell everybody about the greatest artist in the world’, and he did. He sent many people to me to have their portraits painted. He was just great. No wonder I cried when he went to heaven.\n\nThough Bert and his wife Jean were thrilled with Dudley’s gift, they had nowhere in their small home to hang the sizeable canvas. For a brief period the portrait found a wall in the city sports store of the former Collingwood footballer Ron Todd, but at some point in 1948 it was returned to Dudley’s home and stored in a shed – which is where the work unfortunately came to grief.\n\nAs the artist explained, the painting toppled on to a steel table which pierced the canvas beyond repair.\n\nThe story might have ended then and there, were it not for this reporter’s chance viewing of a photograph of the original portrait in a scrapbook in Jean’s keep. Jean revealed that Dudley, now in his 80s, was the artist responsible and was alive and well in Melbourne’s eastern suburbs.\n\nThe question then begged. Sixty years on, would Dudley be up for the job of repainting the portrait from the photograph of the original? Remarkably, Dudley explained that the very thought had recently crossed his mind and that yes, he would commit to the task of recreating the image of Deacon, who died suddenly while serving Carlton as club secretary back in 1974.\n\nAnd so it was that the new version of the old Bert Deacon was this week unveiled by Dudley in the presence of Bert’s widow, Jean and son Robert. The portrait is basically true to the original, but boasts one slight embellishment - Dudley has painted in Bert’s ’47 Brownlow, which can be seen dangling from the trophy.\n\n“To think that 60 years on I’ve brought that painting back to life,” Dudley said. “Isn’t that a great story?”\n\nDudley has also just completed a work of Deacon completing a high mark over Richmond’s Roy Smeaton at Punt Road, based on a press photograph Bert handed him years before.\n\n“Bert had given me a copy of this photograph, which carried a handwritten message in the top left hand corner – ‘To my friend Dud - regards, Bert Deacon’,” Drew said.\n\nRegrettably the photograph was later stolen and all was thought lost . . . until early last year when Jean again came to the rescue.\n\n“I went out to Jean’s house and sat down with her, during which time she showed me the family photo album . . . that’s where I came across another copy of this photograph,” Dudley said.\n\n“I said to her, ‘Jean, you must let me borrow this. I want to paint this picture’. That happened about a year and a half ago’.”\n\nFor the past nine months, Drew, now in his early 80s, has put brush to canvas to recreate the Deacon image. The paint was still drying when he recently unveiled the canvas.\n\n“Bert actually told me that the Richmond fellow in front of the marking contest is George Smeaton and Jack Wrout is sandwiched between them,” Drew said.\n\n“Ron Savage is the Carlton player watching on, but I’m not sure of the identity of the other Richmond player.”\n\nIt’s not surprising that Drew is somewhat circumspect when asked what will become of the Bert Deacon artworks. Perhaps a Carlton-friendly benefactor might see fit to purchase the paintings and make them available on permanent loan to the Club.\n\n“Nobody knows the life of a painting,” said the man who has also painted the portraits of such luminaries as Archbishop Daniel Mannix, King O’Malley and “Weary” Dunlop.\n\nBut there can be no doubting the strength of the lifelong bond Dudley and Bert forged from the moment they met at the house in Hawker Avenue back in ’48.\n\n“I had a friendship with and a great admiration for this fellow, and his wife Jean,” Dudley said.\n\n“Bert and I became great friends and I could tell you many stories about him. He was a wonderful man. The day he died I remember picking up a paper. It was all over the front page and I just cried.\n\n“One night we met in the city and we were on our way to my parents place in Albert Park for dinner. We caught the tram here as he didn’t have a car then, nor did I. And I remember saying to him, I should have been as tall as you Bert, and he said to me ‘Dud, diamonds were never made as big as bricks’. So that made me feel good and every time I see someone bigger than me I think of the diamond.”\n\n\n\nPhoto Gallery\n\nClick here to view the Gallery of photos from the unveiling\n\nRelated Stories: Carlton Portraiture\n\nDecades on, Balharry Comes Through\n\nMonday, September 3, 2007\n\nA painting of former Carlton ruckman HW Balharry, pre-dating the VFL competition of 1897, has surfaced ... more\n\n\n\nBrushed up Bryce hits Canvas\n\nThursday, October 4, 2007\n\nBryce Gibbs as you’ve never seen him before - a unique acrylic on canvas by Silvio Mannello ... more\n\n\n\nRelated Stories: The Blueseum\n\n60th Anniversary of historic Brownlow Medal count\n\nTuesday, September 25, 2007\n\nThe wife of the Blues’ first medallist the late Bert Deacon, seeks assistance to find the 1947 medal ... more\n\n\n\n\n\n"}, {"url": "https://blueseum.org/Bert+Deacon", "page_content": "Milestones\n\nVideo\n\nBert Deacon holds a special place among the legends of the Carlton Football Club. Although his outstanding on-field career was restricted to only 106 games by war service and a chronic thigh injury, he was a star defender in two Premiership teams, a club Best and Fairest, and the first Blue to win the game’s highest individual honour; the Brownlow Medal.Later, he served as a committeeman, and a hard-working and effective club secretary, before his deeply-mourned passing at the age of just 51. But what made Bertrand John Deacon unique was not just his exploits on the field for his beloved Blues. He was a man of the highest principles; a true gentleman whose moral courage and sense of fair play set him apart.Bert was born into a footballing family at Northcote in 1922 . His father, Jack Deacon, was a prominent player for Preston in the 1920's who spent many years on the committee of the club when his playing days ended. After showing promise at schoolboy and junior level, Bert followed his father into the red and white colours of Preston’s senior side in 1941 , while the devastation of World War II spread across the world. On May 11, 1940, the V.F.A. Recorder noted \"\"Bert Deacon, a l7-year-old lad, will be tried in the centre for Preston today. He has been doing well with the seconds.Deacon was in and out of the side that year and was omitted for Preston's one finals appearance, but played every game in 1941. By the start of the following season, the V.F.A. were in recess and players were free to cross to League clubs without a clearance.In a VFA competition deprived of quality and quantity by the eagerness of Australia’s young men to fight for their country, 19 year-old Deacon played in all of Preston’s home and away matches in that bleak year, only to be left out of the side for the finals. Port Melbourne won the flag, and soon afterwards the VFA announced that it was suspending its competition for the duration of the war.Bert himself enlisted soon after that, but while waiting for his call-up, went looking for a game somewhere else. When he called at Princes Park, recently-appointed Carlton coach Percy Bentley welcomed him in, and the pair began a partnership that would endure throughout Deacon’s entire VFL career.Bert first took the field for Carlton against Footscray at the Yarraville Oval on Saturday, June 20, 1942 . The Western Oval had been appropriated by the government for use as a military transit centre, so the Bulldogs were bunking-in with their VFA neighbours. Bentley named Deacon in the centre, where he played alongside two men with whom he would later share Premiership glory; Vin Brown and Fred Fitzgibbon . On that day however, Footscray adapted to the conditions better than the Blues, and ran out winners by 19 points.Deacon managed just three games in 1942 , two in 1943 and three in 1944 , as his training and postings to Australia’s far north kept him a long way from home. But by early 1945 , with the Axis forces in Europe all but beaten and the Japanese in full retreat in the Pacific, Lance Corporal Bert Deacon was transferred back to Melbourne, where he wasted no time in resuming his football career. In 1945, Deacon was captain-coach of an Army Stores team in Darwin that included several League and Association players, including Footscray legend, Charlie Sutton.He returned to Carlton’s team in July, 1945 , for the match against Essendon at Princes Park. The Blues lost a cliff-hanger by three points, but by siren time that afternoon, coach Bentley knew that he had a potential champion in his team with Deacon at centre half-back. Although he was just 180 cm and 79 kg, Bert settled into defence like he was born to it. He was a strong and clever mark, beautifully balanced, with an uncanny ability to read the flight of the ball. And once he got it, he invariably disposed of it well with a neat drop kick to position.Carlton’s feat of battling through to a finals berth in 1945 , and then going on to beat South Melbourne in the most infamous and controversial Grand Final of all time, has been well documented. What isn’t so well-known is that the Carlton-Collingwood Preliminary Final that preceded it was every bit as violent, and surely was a catalyst for later events.After losing the second Semi Final to minor Premiers South Melbourne, Collingwood went into the Preliminary Final with the intention of knocking some of Carlton’s playmakers off their game. Included among their targets were key defenders Deacon and full-back Vin Brown . The game was an ugly series of melees from early on, as Collingwood went head hunting, and Carlton fought fire with fire. Yet through it all, as fists, elbows and even boots flew around him, it was Deacon who held the line across half-back. Despite being niggled, punched and thrown to the ground late on many occasions, he never once retaliated, nor complained to the umpire. Cool and collected, he just simply kept getting the ball, and sending it into attack.Even so, Collingwood held sway on the scoreboard for three quarters, and seemed to have sealed the match early in the last term, when they kicked their twelfth goal and stretched their lead to 45 points. But when Vin Brown was king-hit by Collingwood’s Len Hustler, and the Blues would take no more. Galvanised by that incident, they came storming back into the match to pile on seven goals in the last 18 minutes, and beat the demoralised Magpies by ten points.The following week, when South Melbourne and Carlton met to decide the 1945 VFL Premiership , the teams ran out onto a Princes Park packed to the rafters with almost 63,000 spectators. The occasion, and simmering tensions on both sides - heightened by the violence of the previous Saturday, produced a powder keg of emotion that inevitably exploded into another vicious clash forever remembered as the ‘Bloodbath’ Grand Final.Once more, Bert Deacon was one of the few players from either side who was more interested in finding the football than punching on. In the second quarter, as the game degenerated into a series of running brawls, South’s promising youngster Ron Clegg (like Deacon, a future Brownlow Medallist) was about to join in the fighting when Deacon took hold of his shoulder and quietly said; ‘Don’t go down there, son, there’s nothing for you in that.’ Clegg heeded Deacon’s advice, only to be felled himself later in the match, by Carlton’s fearsome captain, Bob Chitty As a groggy Clegg got to his feet to take his free kick, Deacon realised that Clegg was facing the wrong way, and turned him in the right direction – an action that infuriated Chitty, who snarled; ‘I don’t knock them down for you to pick up.’ Carlton eventually won the battle by 28 points. Ten players were reported and suspended, yet one of the enduring stories of that bitter-sweet triumph for Carlton was the unflagging sportsmanship of Bert Deacon.Two years later, Deacon’s career peaked when he won his second VFL Premiership medallion, topped off by the 1947 Brownlow Medal, and a tie for first place in Carlton’s Best and Fairest award. The year began with the arrival of brilliant West Australian Ern Henfry , who had stood out of football for a year to win a clearance to Carlton, and was appointed captain of the Blues after just two senior games.A gifted centreman and an inspirational leader, Henfry led a solid Carlton combination to the minor Premiership, on the way, striking up a strong rapport with his vice-captain Deacon. By then, Bert was considered as the outstanding centre half-back of the competition. In the week prior to the first round of the finals, he confirmed his standing in the game by becoming the first Carlton player to win the Brownlow Medal, when he polled 23 votes to beat St Kilda’s Harry Bray by two.It would have been understandable had Deacon been distracted by the celebrations, but as always, he quickly refocused on the job at hand. Carlton met Essendon in the ’47 Grand Final in front of 85,000 at the MCG, and seemed headed for defeat when they trailed by five points as the time-keeper’s clock clicked into the last minute of time-on. That’s when nuggety rover Fred Stafford (who had been rarely sighted all day) swooped on a spillage 30 metres out from goal and snapped truly, giving Carlton our second flag in three years by the narrowest possible margin.In the following week, amid the euphoria of Premiership celebrations, Deacon rounded off that one special season when he and Henfry were announced as joint winners of Carlton’s Best and Fairest trophy. Earlier, Bert had also worn the Victorian state guernsey at the 1947 National Championships, winning the K.G. Luke Trophy for the best Victorian player in the series, as well as a number of newspaper awards.Deacon’s third Grand Final appearance came in 1949 , and again Carlton’s opponent was Essendon – who battled their way into the flag decider largely due to the form of their star full-forward, John Coleman. Adding to the interest in a match between the Premiers of the previous two years, Coleman needed six goals to reach the magical 100 for the season, and Essendon were determined to give him every possible chance to get them.After an even, hard-fought first quarter, Essendon proved unstoppable and steadily increased their advantage over the Blues. By the last change, the margin had blown out to 57 points – but remarkably, Coleman had been held to just two goals by Carlton’s close-checking full-back Ollie Grieve - and Deacon, who ranged across half back and cut off many attacks with strong marks.However, with the game won, Essendon concentrated on getting the ball to Coleman, and with just minutes remaining he ran on to a short pass and lined up for a shot at number 100. It was then that Deacon – ever the gentleman – trotted up beside the young star, put a hand on his shoulder and offered a word or two of advice. As he turned and walked away, Coleman sent the ball between the posts.That was to be Bert’s last shot at Premiership glory with the Blues. A persistent muscle tear in one thigh had begun to trouble him, and in 1950 restricted him to just seven games. He saddled up again in 1951 , but by mid-year admitted that he was struggling and decided to call time on a memorable career. He played his last match against the old foe; South Melbourne, at the Lake Oval in round 11, 1951 . The Blueboys did the right thing by their champion, and farewelled him with a tenacious, thrilling 5-point win.In 1952 Bert returned to Preston as captain-coach for two seasons, before hanging up his boots to continue his role off-field. In his three further years, Deacon is reported to have played in every position on the ground except full-back, a position held firm by another Preston legend in Ted Henrys. In 1955, Deacon acted as non-playing coach before finally retiring from an active role. In 1955 , the Bullants made the VFA finals for the first time since Deacon had last played for them in 1941 . While at Preston, he retained his links at Carlton, and by 1958 was back at Princes Park in a variety of administrative roles. Later, he was elected to the committee, and in 1970 became club Secretary under President George Harris . Two more flags followed - in 1970 and 1972 - and no-one at Carlton was prouder than Bert Deacon.On January 3, 1974, Bert and his family were holidaying at Balnarring on the Mornington Peninsula, when he suffered a massive heart attack, and died before reaching hospital. He was just 51 years old. The football world was rocked to its core by the news, and there was widespread grief at the loss of one of football’s favourite sons – a man whose dignity and integrity transcended club loyalties and brought him genuine admiration. Winning and losing mattered much to Bert Deacon, but so did how the game was played.The Deacon family tradition continued at Preston with his brother Bill acting as President from 1983 to 1987, a period that saw the club become the first in V.F.A. history to take out premierships at the Firsts, Seconds and Thirds levels in 1983 and again the following year. Bill's widow, Maisie has had the honour of the Preston and now Northern Bullant No. 1 membership for many years50 Games : Round 15, 1947 Vs Footscray100 Games : Round 2, 1951 Vs Footscray"}, {"url": "https://libraries.darebin.vic.gov.au/darebinheritage/biographies/sports-people/bertrandjohndeacon", "page_content": "(1922 -1974)\n\nBert Deacon was born in Northcote in 1922 before moving to Preston in 1927. With his father a notable Preston footballer, it was to be expected that Bert would also become a footballer. After displaying talent both at the West Preston State School and the Preston 3 K.Z. Team, Deacon played some football for Carlton during the war years.\n\nWith the end of the Second World War Deacon continued to play for Carlton and was the first Carlton player to ever win the Brownlow Medal in 1947. In 1952 Deacon returned to Preston as Captain/Coach. Later as coach he led the Bullants to their first final since the Second World War.\n\nDeacon later became a panellist on the A.B.V. Channel 2 football show.\n\n\n\nPreston Historical Society (1968). Brief biographies of prominent Preston People. Preston, Vic: Author."}, {"url": "https://khelnow.com/football/top-10-footballers-successful-businessmen", "page_content": "Quick Reads\n\nThese stars have also shone in an entrepreneurial capacity.\n\nOver the years, the world has experienced several footballers finding remarkable success on the field through their passion and dedication. While many of these fan favourites have lost the limelight following their retirement, some footballers have also found ways to keep their value up by becoming businessmen.\n\nNot many have, however, found success as an entrepreneur as they did in football. But there are a select few, who have taken to this new journey as a duck to water. These footballers have turned into successful businessmen and amazed everyone. Here are 10 footballers who are also successful businessmen.\n\n10. Kai Heerings\n\nHeerings spent one season with Indian Super League club NorthEast United (Courtesy: ISL Media)\n\nThe MVV Maastricht star has also played for Indian Super League club NorthEast United in the past. Heerings, along with his brother-in-law Jens van Zonneveld, developed the JZ Design Game Case, an easily movable monitor and a case for game consoles.\n\nHeerings used his own experience of boredom from going for away matches and his cases are a huge sell amongst athletes, with customers including Lionel Messi, Sergio Aguero, John Terry, Jose Mourinho, Lewis Hamilton and Max Verstappen.\n\n9. Andres Iniesta\n\nAndres Iniesta has displayed the same level of acumen he showed on the pitch, off it as well. He has become quite the businessman during the latter years of his career. The Spaniard owns the Bodega Iniesta, a family winery which he he inherited from his father. He also invested in a company called FirstVision, with Spanish NBA star Serge Ibaka.\n\nFirstVision aims to revolutionize sports broadcasting by introducing cameras on the players’ shirts. The view from the first person would certainly be a new and valuable experience for spectators as well as young fans who seek to learn from the best.\n\n8. Gerard Pique\n\nThe Spanish defender is one of the best defenders of this generation. He has won all the major titles for both club and country, but the other side of his life is equally as successful. The Barcelona centre-back invests with his company Kosmos Global Holding in different organizations from various industries. He also owns a football club FC Andorra, which plays in the third division of the Spanish football tier.\n\n7. Andrea Pirlo\n\nPirlo has transitioned into a fine businessman after retiring from football (Courtesy: Vanguard News)\n\nThe former Juventus player and manager is also an exceptional businessman. Pirlo had taken over his parents’ winery and it now sells products across Europe. His vineyard produces a large number of bottles a year, around 15,000 to 20,000. The Italian seems to be able to touch everything he turns into a success.\n\n6. Ryan Bertrand\n\nThe Englishman is one of the few making waves simultaneously both on and off the field. He founded the fintech brokerage firm called Silicon Markets with his friends Louis Bell and Mathew Kirkham in 2015. The Company is aiming to revolutionize retail trading. The firm also offers advanced machine learning and algorithmic trading tools, while also using AI software.\n\n5. Louis Saha\n\nThe former Manchester United striker has made serious waves on the field, scoring 117 goals in a remarkable 16-year career. He has played for several top-tier clubs in his long and illustrious career. The French star created Axis Stars, a social media platform that aims at providing financial advice for Athletes, coaches and agents, to manage their money better.\n\nSeveral top stars have gone into bankruptcy and this network gives them a place to chat about lifestyle, physios, sponsorship or anything else pertaining to their sport. Several top sportsmen like Didier Drogba, Phil Neville, Florent Malouda and Andy Murray have signed up for Axis Stars.\n\n4. Oliver Kahn\n\nKahn is the founder of a goalkeeping app that coaches young goalkeepers (Courtesy: Bavarians)\n\nThe towering German remains one of the best goalkeepers of all-time in football. The 2002 World Cup Golden Ball winner was a phenomenal player but since his retirement, has taken another phenomenal step into business. Kahn is the founder of Goalplay.\n\nGoalplay is a company that offers a special coaching app. It also sells goalkeeper gloves and bags, staying true to the roots of its founder. The special coaching app is also aimed to bring out the best from the legendary goalkeeper. The current Bayern Munich CEO can certainly do more than stop goals.\n\n3. David Villa\n\nThe Spanish striker and star of the 2010 World Cup is a shrewd operator since his retirement. Villa is part of an asset management company called KraneShares and his company bought a football team called Queensboro FC in the USA. The team is set to make the USL Championship debut in 2022.\n\nVilla is also the co-founder of the DV7 Group, The Spaniard has also joined Odisha FC as the head of the Global Football Operations in the Indian Super League and The former FC Barcelona forward will help them in improving their recruitment and overall planning with his company.\n\n2. David Beckham\n\nBeckham has been a global icon (Courtesy: CGTN)\n\nSince his prime, David Beckham has been more than an athlete to the world. He is a global icon and has several big-money endorsement deals.\n\nApart from the endorsements, the former Manchester United and Real Madrid star has been a successful navigator behind the wheel. Along with his wife Victoria Beckham, David banked almost 30 million pounds of dividends through his company called DB Ventures Limited. The business involves licensing and commercialization of the David Beckham brand.\n\nHe is also the co-owner of MLS football club Inter Miami and English League Two outfit Salford City.\n\n1. Mathieu Flamini\n\nThe French star has had a remarkable career on the pitch, playing for the likes of Arsenal, AC Milan and Marseille during his 16-year stint in professional football. Flamini, however, is also making an impact off the pitch. After retirement, he and his business partner Pasquale Granata set up a bioscience firm known as GF Biochemicals. The company was the first organization to mass-produce levulinic acid, a biofriendly substitute that can be used in many major industries.\n\nThe acid has also been identified by the US Department of Energy as one of the 12 molecules that can help the transition into a greener world. Flamini was named one of the People of the Year by NME in 2015 and many experts believe that it could one day be valued at $22.3bn. Flamini also launched Unity along with Arsenal teammate Mesut Ozil. Unity is a natural-origin, face, hair, body and wellness brand that also focuses on sustainable packaging. Flamini today is one of the top footballers, who is also a successful businessmen.\n\nFor more updates, follow Khel Now on Twitter, Instagram and Facebook."}, {"url": "https://www.newsnow.co.uk/h/World+News/Europe/Western+Europe/France/Just+Fontaine", "page_content": "Don't miss out! Get the day's top headlines delivered to your inbox\n\nStay informed. Sign up for a FREE NewsNow account and get our email alert of the day's top stories from the UK and around the world.\n\nStay informed. Subscribe to our email alert of the day's top stories from the UK and around the world.\n\nCreate Account and Subscribe\n\nSign in and Subscribe\n\nWe are sorry, but the email address you entered does not appear to be valid. Please check you have typed it correctly.\n\nAn existing account was found for this email address. Please click 'Sign in and Subscribe' to continue.\n\nWe don't have an account for this email address. Please click 'Create Account and Subscribe' to create a new account and subscribe to our email alerts.\n\nBy clicking 'Create Account and Subscribe' you agree to us creating an account for you and subscribing you to our newsletter in accordance with our Privacy Policy and Legal Notice.\n\n\n\nEmails, which may be sent daily or less frequently, may include marketing elements. We will not share your email address with any third parties. You can unsubscribe whenever you want.\n\nBy clicking 'Sign in and Subscribe' you agree to us subscribing you to our newsletter in accordance with our Privacy Policy and Legal Notice.\n\n\n\nEmails, which may be sent daily or less frequently, may include marketing elements. We will not share your email address with any third parties. You can unsubscribe whenever you want."}, {"url": "https://prabook.com/web/bert.deacon/2466480", "page_content": "Bert Deacon\n\nAustralian-rules footballer\n\nNovember 8, 1922 (age 51)\n\nA centre half back, Deacon began his league career in 1942. Deacon left Carlton after the 1951 season and became captain-coach for Preston in the Victorian Football Association (VFA), the club where he had played for prior to being recruited by Carlton. He later served as Carlton vice-president and club secretary. He is the centre half back in Carlton\"s official \"Team of the Century\". Office the field, Deacon worked for many years for long-serving VFL and Carlton president Sir Kenneth Luke. Bertram Deacon died of a heart attack on 3 January 1974 while on holiday at Balnarring. Deacon was just 51 years of age and died despite the desperate efforts of his Preston team-mate, Pat Foley to revive him."}], "Bert Deacon was a director of the Collingwood Football Club from 1975 to 1981.": [{"url": "https://www.afl.com.au/news/503359/the-story-of-dudley-drew-and-the-lost-painting-of-bert-deacon", "page_content": "\n\nDudley Drew talks to CFC TV about his memories of his friend Bert Deacon, and about the painting he has just completed of Deacon completing a high mark over Richmond’s Roy Smeaton at Punt Road.\n\nClick here to view the video\n\nBack in 1948, a budding Melbourne artist named Dudley Drew was trying to eke out an existence in his adopted profession when, on the advice of his dear mother, he resolved to paint somebody famous.\n\nDudley’s Mum volunteered the name of Carlton centre half-back the late great Bert Deacon. After all, Deacon had just come off a stellar season, having taken out the 1947 Brownlow Medal, represented Carlton in its eighth premiership and earned Victorian and All-Australian selection.\n\nHow well Dudley remembers the moment. “My mother was blind, and when Bert won the Brownlow I was sitting with Mum in the bedroom talking to her one night and she said, ‘You should paint a portrait of Bert Deacon’,” Dudley explained.\n\n“I said ‘Do you think it’s a good idea?’ and she said ‘I think it will be wonderful for you’. I then said ‘How do I do this?’ and she said ‘Go and see him’.”\n\nDudley made his way to 2 Hawker Avenue, Preston, where Bert and Jean then lived. “When I got there this particular night, around about seven o’clock, Bert was already in bed because he was injured - he’d injured his leg playing football, but he and Jean just welcomed me so much. It was great and I felt so proud,” Dudley said.\n\n“I then asked Bert if he would pose for the big portrait and he said ‘I’d be very happy to do that’. He sat for the portrait about eight times and I remember in one sitting he began to smile, exposing this toothless gap. He was painted sporting grey trousers and navy blue blazer with the white V on the pocket and included in the painting is a trophy Bert also won for best afield for Victoria.\n\n“Towards the end Bert said, ‘You know I really love this painting and I’m going to tell everybody about the greatest artist in the world’, and he did. He sent many people to me to have their portraits painted. He was just great. No wonder I cried when he went to heaven.\n\nThough Bert and his wife Jean were thrilled with Dudley’s gift, they had nowhere in their small home to hang the sizeable canvas. For a brief period the portrait found a wall in the city sports store of the former Collingwood footballer Ron Todd, but at some point in 1948 it was returned to Dudley’s home and stored in a shed – which is where the work unfortunately came to grief.\n\nAs the artist explained, the painting toppled on to a steel table which pierced the canvas beyond repair.\n\nThe story might have ended then and there, were it not for this reporter’s chance viewing of a photograph of the original portrait in a scrapbook in Jean’s keep. Jean revealed that Dudley, now in his 80s, was the artist responsible and was alive and well in Melbourne’s eastern suburbs.\n\nThe question then begged. Sixty years on, would Dudley be up for the job of repainting the portrait from the photograph of the original? Remarkably, Dudley explained that the very thought had recently crossed his mind and that yes, he would commit to the task of recreating the image of Deacon, who died suddenly while serving Carlton as club secretary back in 1974.\n\nAnd so it was that the new version of the old Bert Deacon was this week unveiled by Dudley in the presence of Bert’s widow, Jean and son Robert. The portrait is basically true to the original, but boasts one slight embellishment - Dudley has painted in Bert’s ’47 Brownlow, which can be seen dangling from the trophy.\n\n“To think that 60 years on I’ve brought that painting back to life,” Dudley said. “Isn’t that a great story?”\n\nDudley has also just completed a work of Deacon completing a high mark over Richmond’s Roy Smeaton at Punt Road, based on a press photograph Bert handed him years before.\n\n“Bert had given me a copy of this photograph, which carried a handwritten message in the top left hand corner – ‘To my friend Dud - regards, Bert Deacon’,” Drew said.\n\nRegrettably the photograph was later stolen and all was thought lost . . . until early last year when Jean again came to the rescue.\n\n“I went out to Jean’s house and sat down with her, during which time she showed me the family photo album . . . that’s where I came across another copy of this photograph,” Dudley said.\n\n“I said to her, ‘Jean, you must let me borrow this. I want to paint this picture’. That happened about a year and a half ago’.”\n\nFor the past nine months, Drew, now in his early 80s, has put brush to canvas to recreate the Deacon image. The paint was still drying when he recently unveiled the canvas.\n\n“Bert actually told me that the Richmond fellow in front of the marking contest is George Smeaton and Jack Wrout is sandwiched between them,” Drew said.\n\n“Ron Savage is the Carlton player watching on, but I’m not sure of the identity of the other Richmond player.”\n\nIt’s not surprising that Drew is somewhat circumspect when asked what will become of the Bert Deacon artworks. Perhaps a Carlton-friendly benefactor might see fit to purchase the paintings and make them available on permanent loan to the Club.\n\n“Nobody knows the life of a painting,” said the man who has also painted the portraits of such luminaries as Archbishop Daniel Mannix, King O’Malley and “Weary” Dunlop.\n\nBut there can be no doubting the strength of the lifelong bond Dudley and Bert forged from the moment they met at the house in Hawker Avenue back in ’48.\n\n“I had a friendship with and a great admiration for this fellow, and his wife Jean,” Dudley said.\n\n“Bert and I became great friends and I could tell you many stories about him. He was a wonderful man. The day he died I remember picking up a paper. It was all over the front page and I just cried.\n\n“One night we met in the city and we were on our way to my parents place in Albert Park for dinner. We caught the tram here as he didn’t have a car then, nor did I. And I remember saying to him, I should have been as tall as you Bert, and he said to me ‘Dud, diamonds were never made as big as bricks’. So that made me feel good and every time I see someone bigger than me I think of the diamond.”"}, {"url": "https://www.carltonfc.com.au/news/764340/the-story-of-dudley-drew-and-the-lost-painting-of-bert-deacon", "page_content": "\n\nDudley Drew talks to CFC TV about his memories of his friend Bert Deacon, and about the painting he has just completed of Deacon completing a high mark over Richmond’s Roy Smeaton at Punt Road.\n\nClick here to view the video\n\nBack in 1948, a budding Melbourne artist named Dudley Drew was trying to eke out an existence in his adopted profession when, on the advice of his dear mother, he resolved to paint somebody famous.\n\nDudley’s Mum volunteered the name of Carlton centre half-back the late great Bert Deacon. After all, Deacon had just come off a stellar season, having taken out the 1947 Brownlow Medal, represented Carlton in its eighth premiership and earned Victorian and All-Australian selection.\n\nHow well Dudley remembers the moment. “My mother was blind, and when Bert won the Brownlow I was sitting with Mum in the bedroom talking to her one night and she said, ‘You should paint a portrait of Bert Deacon’,” Dudley explained.\n\n“I said ‘Do you think it’s a good idea?’ and she said ‘I think it will be wonderful for you’. I then said ‘How do I do this?’ and she said ‘Go and see him’.”\n\nDudley made his way to 2 Hawker Avenue, Preston, where Bert and Jean then lived. “When I got there this particular night, around about seven o’clock, Bert was already in bed because he was injured - he’d injured his leg playing football, but he and Jean just welcomed me so much. It was great and I felt so proud,” Dudley said.\n\n“I then asked Bert if he would pose for the big portrait and he said ‘I’d be very happy to do that’. He sat for the portrait about eight times and I remember in one sitting he began to smile, exposing this toothless gap. He was painted sporting grey trousers and navy blue blazer with the white V on the pocket and included in the painting is a trophy Bert also won for best afield for Victoria.\n\n“Towards the end Bert said, ‘You know I really love this painting and I’m going to tell everybody about the greatest artist in the world’, and he did. He sent many people to me to have their portraits painted. He was just great. No wonder I cried when he went to heaven.\n\nThough Bert and his wife Jean were thrilled with Dudley’s gift, they had nowhere in their small home to hang the sizeable canvas. For a brief period the portrait found a wall in the city sports store of the former Collingwood footballer Ron Todd, but at some point in 1948 it was returned to Dudley’s home and stored in a shed – which is where the work unfortunately came to grief.\n\nAs the artist explained, the painting toppled on to a steel table which pierced the canvas beyond repair.\n\nThe story might have ended then and there, were it not for this reporter’s chance viewing of a photograph of the original portrait in a scrapbook in Jean’s keep. Jean revealed that Dudley, now in his 80s, was the artist responsible and was alive and well in Melbourne’s eastern suburbs.\n\nThe question then begged. Sixty years on, would Dudley be up for the job of repainting the portrait from the photograph of the original? Remarkably, Dudley explained that the very thought had recently crossed his mind and that yes, he would commit to the task of recreating the image of Deacon, who died suddenly while serving Carlton as club secretary back in 1974.\n\nAnd so it was that the new version of the old Bert Deacon was this week unveiled by Dudley in the presence of Bert’s widow, Jean and son Robert. The portrait is basically true to the original, but boasts one slight embellishment - Dudley has painted in Bert’s ’47 Brownlow, which can be seen dangling from the trophy.\n\n“To think that 60 years on I’ve brought that painting back to life,” Dudley said. “Isn’t that a great story?”\n\nDudley has also just completed a work of Deacon completing a high mark over Richmond’s Roy Smeaton at Punt Road, based on a press photograph Bert handed him years before.\n\n“Bert had given me a copy of this photograph, which carried a handwritten message in the top left hand corner – ‘To my friend Dud - regards, Bert Deacon’,” Drew said.\n\nRegrettably the photograph was later stolen and all was thought lost . . . until early last year when Jean again came to the rescue.\n\n“I went out to Jean’s house and sat down with her, during which time she showed me the family photo album . . . that’s where I came across another copy of this photograph,” Dudley said.\n\n“I said to her, ‘Jean, you must let me borrow this. I want to paint this picture’. That happened about a year and a half ago’.”\n\nFor the past nine months, Drew, now in his early 80s, has put brush to canvas to recreate the Deacon image. The paint was still drying when he recently unveiled the canvas.\n\n“Bert actually told me that the Richmond fellow in front of the marking contest is George Smeaton and Jack Wrout is sandwiched between them,” Drew said.\n\n“Ron Savage is the Carlton player watching on, but I’m not sure of the identity of the other Richmond player.”\n\nIt’s not surprising that Drew is somewhat circumspect when asked what will become of the Bert Deacon artworks. Perhaps a Carlton-friendly benefactor might see fit to purchase the paintings and make them available on permanent loan to the Club.\n\n“Nobody knows the life of a painting,” said the man who has also painted the portraits of such luminaries as Archbishop Daniel Mannix, King O’Malley and “Weary” Dunlop.\n\nBut there can be no doubting the strength of the lifelong bond Dudley and Bert forged from the moment they met at the house in Hawker Avenue back in ’48.\n\n“I had a friendship with and a great admiration for this fellow, and his wife Jean,” Dudley said.\n\n“Bert and I became great friends and I could tell you many stories about him. He was a wonderful man. The day he died I remember picking up a paper. It was all over the front page and I just cried.\n\n“One night we met in the city and we were on our way to my parents place in Albert Park for dinner. We caught the tram here as he didn’t have a car then, nor did I. And I remember saying to him, I should have been as tall as you Bert, and he said to me ‘Dud, diamonds were never made as big as bricks’. So that made me feel good and every time I see someone bigger than me I think of the diamond.”"}, {"url": "https://blueseum.org/Bert+Deacon", "page_content": "Milestones\n\nVideo\n\nBert Deacon holds a special place among the legends of the Carlton Football Club. Although his outstanding on-field career was restricted to only 106 games by war service and a chronic thigh injury, he was a star defender in two Premiership teams, a club Best and Fairest, and the first Blue to win the game’s highest individual honour; the Brownlow Medal.Later, he served as a committeeman, and a hard-working and effective club secretary, before his deeply-mourned passing at the age of just 51. But what made Bertrand John Deacon unique was not just his exploits on the field for his beloved Blues. He was a man of the highest principles; a true gentleman whose moral courage and sense of fair play set him apart.Bert was born into a footballing family at Northcote in 1922 . His father, Jack Deacon, was a prominent player for Preston in the 1920's who spent many years on the committee of the club when his playing days ended. After showing promise at schoolboy and junior level, Bert followed his father into the red and white colours of Preston’s senior side in 1941 , while the devastation of World War II spread across the world. On May 11, 1940, the V.F.A. Recorder noted \"\"Bert Deacon, a l7-year-old lad, will be tried in the centre for Preston today. He has been doing well with the seconds.Deacon was in and out of the side that year and was omitted for Preston's one finals appearance, but played every game in 1941. By the start of the following season, the V.F.A. were in recess and players were free to cross to League clubs without a clearance.In a VFA competition deprived of quality and quantity by the eagerness of Australia’s young men to fight for their country, 19 year-old Deacon played in all of Preston’s home and away matches in that bleak year, only to be left out of the side for the finals. Port Melbourne won the flag, and soon afterwards the VFA announced that it was suspending its competition for the duration of the war.Bert himself enlisted soon after that, but while waiting for his call-up, went looking for a game somewhere else. When he called at Princes Park, recently-appointed Carlton coach Percy Bentley welcomed him in, and the pair began a partnership that would endure throughout Deacon’s entire VFL career.Bert first took the field for Carlton against Footscray at the Yarraville Oval on Saturday, June 20, 1942 . The Western Oval had been appropriated by the government for use as a military transit centre, so the Bulldogs were bunking-in with their VFA neighbours. Bentley named Deacon in the centre, where he played alongside two men with whom he would later share Premiership glory; Vin Brown and Fred Fitzgibbon . On that day however, Footscray adapted to the conditions better than the Blues, and ran out winners by 19 points.Deacon managed just three games in 1942 , two in 1943 and three in 1944 , as his training and postings to Australia’s far north kept him a long way from home. But by early 1945 , with the Axis forces in Europe all but beaten and the Japanese in full retreat in the Pacific, Lance Corporal Bert Deacon was transferred back to Melbourne, where he wasted no time in resuming his football career. In 1945, Deacon was captain-coach of an Army Stores team in Darwin that included several League and Association players, including Footscray legend, Charlie Sutton.He returned to Carlton’s team in July, 1945 , for the match against Essendon at Princes Park. The Blues lost a cliff-hanger by three points, but by siren time that afternoon, coach Bentley knew that he had a potential champion in his team with Deacon at centre half-back. Although he was just 180 cm and 79 kg, Bert settled into defence like he was born to it. He was a strong and clever mark, beautifully balanced, with an uncanny ability to read the flight of the ball. And once he got it, he invariably disposed of it well with a neat drop kick to position.Carlton’s feat of battling through to a finals berth in 1945 , and then going on to beat South Melbourne in the most infamous and controversial Grand Final of all time, has been well documented. What isn’t so well-known is that the Carlton-Collingwood Preliminary Final that preceded it was every bit as violent, and surely was a catalyst for later events.After losing the second Semi Final to minor Premiers South Melbourne, Collingwood went into the Preliminary Final with the intention of knocking some of Carlton’s playmakers off their game. Included among their targets were key defenders Deacon and full-back Vin Brown . The game was an ugly series of melees from early on, as Collingwood went head hunting, and Carlton fought fire with fire. Yet through it all, as fists, elbows and even boots flew around him, it was Deacon who held the line across half-back. Despite being niggled, punched and thrown to the ground late on many occasions, he never once retaliated, nor complained to the umpire. Cool and collected, he just simply kept getting the ball, and sending it into attack.Even so, Collingwood held sway on the scoreboard for three quarters, and seemed to have sealed the match early in the last term, when they kicked their twelfth goal and stretched their lead to 45 points. But when Vin Brown was king-hit by Collingwood’s Len Hustler, and the Blues would take no more. Galvanised by that incident, they came storming back into the match to pile on seven goals in the last 18 minutes, and beat the demoralised Magpies by ten points.The following week, when South Melbourne and Carlton met to decide the 1945 VFL Premiership , the teams ran out onto a Princes Park packed to the rafters with almost 63,000 spectators. The occasion, and simmering tensions on both sides - heightened by the violence of the previous Saturday, produced a powder keg of emotion that inevitably exploded into another vicious clash forever remembered as the ‘Bloodbath’ Grand Final.Once more, Bert Deacon was one of the few players from either side who was more interested in finding the football than punching on. In the second quarter, as the game degenerated into a series of running brawls, South’s promising youngster Ron Clegg (like Deacon, a future Brownlow Medallist) was about to join in the fighting when Deacon took hold of his shoulder and quietly said; ‘Don’t go down there, son, there’s nothing for you in that.’ Clegg heeded Deacon’s advice, only to be felled himself later in the match, by Carlton’s fearsome captain, Bob Chitty As a groggy Clegg got to his feet to take his free kick, Deacon realised that Clegg was facing the wrong way, and turned him in the right direction – an action that infuriated Chitty, who snarled; ‘I don’t knock them down for you to pick up.’ Carlton eventually won the battle by 28 points. Ten players were reported and suspended, yet one of the enduring stories of that bitter-sweet triumph for Carlton was the unflagging sportsmanship of Bert Deacon.Two years later, Deacon’s career peaked when he won his second VFL Premiership medallion, topped off by the 1947 Brownlow Medal, and a tie for first place in Carlton’s Best and Fairest award. The year began with the arrival of brilliant West Australian Ern Henfry , who had stood out of football for a year to win a clearance to Carlton, and was appointed captain of the Blues after just two senior games.A gifted centreman and an inspirational leader, Henfry led a solid Carlton combination to the minor Premiership, on the way, striking up a strong rapport with his vice-captain Deacon. By then, Bert was considered as the outstanding centre half-back of the competition. In the week prior to the first round of the finals, he confirmed his standing in the game by becoming the first Carlton player to win the Brownlow Medal, when he polled 23 votes to beat St Kilda’s Harry Bray by two.It would have been understandable had Deacon been distracted by the celebrations, but as always, he quickly refocused on the job at hand. Carlton met Essendon in the ’47 Grand Final in front of 85,000 at the MCG, and seemed headed for defeat when they trailed by five points as the time-keeper’s clock clicked into the last minute of time-on. That’s when nuggety rover Fred Stafford (who had been rarely sighted all day) swooped on a spillage 30 metres out from goal and snapped truly, giving Carlton our second flag in three years by the narrowest possible margin.In the following week, amid the euphoria of Premiership celebrations, Deacon rounded off that one special season when he and Henfry were announced as joint winners of Carlton’s Best and Fairest trophy. Earlier, Bert had also worn the Victorian state guernsey at the 1947 National Championships, winning the K.G. Luke Trophy for the best Victorian player in the series, as well as a number of newspaper awards.Deacon’s third Grand Final appearance came in 1949 , and again Carlton’s opponent was Essendon – who battled their way into the flag decider largely due to the form of their star full-forward, John Coleman. Adding to the interest in a match between the Premiers of the previous two years, Coleman needed six goals to reach the magical 100 for the season, and Essendon were determined to give him every possible chance to get them.After an even, hard-fought first quarter, Essendon proved unstoppable and steadily increased their advantage over the Blues. By the last change, the margin had blown out to 57 points – but remarkably, Coleman had been held to just two goals by Carlton’s close-checking full-back Ollie Grieve - and Deacon, who ranged across half back and cut off many attacks with strong marks.However, with the game won, Essendon concentrated on getting the ball to Coleman, and with just minutes remaining he ran on to a short pass and lined up for a shot at number 100. It was then that Deacon – ever the gentleman – trotted up beside the young star, put a hand on his shoulder and offered a word or two of advice. As he turned and walked away, Coleman sent the ball between the posts.That was to be Bert’s last shot at Premiership glory with the Blues. A persistent muscle tear in one thigh had begun to trouble him, and in 1950 restricted him to just seven games. He saddled up again in 1951 , but by mid-year admitted that he was struggling and decided to call time on a memorable career. He played his last match against the old foe; South Melbourne, at the Lake Oval in round 11, 1951 . The Blueboys did the right thing by their champion, and farewelled him with a tenacious, thrilling 5-point win.In 1952 Bert returned to Preston as captain-coach for two seasons, before hanging up his boots to continue his role off-field. In his three further years, Deacon is reported to have played in every position on the ground except full-back, a position held firm by another Preston legend in Ted Henrys. In 1955, Deacon acted as non-playing coach before finally retiring from an active role. In 1955 , the Bullants made the VFA finals for the first time since Deacon had last played for them in 1941 . While at Preston, he retained his links at Carlton, and by 1958 was back at Princes Park in a variety of administrative roles. Later, he was elected to the committee, and in 1970 became club Secretary under President George Harris . Two more flags followed - in 1970 and 1972 - and no-one at Carlton was prouder than Bert Deacon.On January 3, 1974, Bert and his family were holidaying at Balnarring on the Mornington Peninsula, when he suffered a massive heart attack, and died before reaching hospital. He was just 51 years old. The football world was rocked to its core by the news, and there was widespread grief at the loss of one of football’s favourite sons – a man whose dignity and integrity transcended club loyalties and brought him genuine admiration. Winning and losing mattered much to Bert Deacon, but so did how the game was played.The Deacon family tradition continued at Preston with his brother Bill acting as President from 1983 to 1987, a period that saw the club become the first in V.F.A. history to take out premierships at the Firsts, Seconds and Thirds levels in 1983 and again the following year. Bill's widow, Maisie has had the honour of the Preston and now Northern Bullant No. 1 membership for many years50 Games : Round 15, 1947 Vs Footscray100 Games : Round 2, 1951 Vs Footscray"}, {"url": "https://www.carltonfc.com.au/news/299729/family-reclaims-precious-deacon-artefact", "page_content": "Seventy years after the late Bert Deacon’s best and fairest, Brownlow and Grand Final-winning season for Carlton, the Deacon family has reclaimed a timber-cased mantel clock awarded to him by the Club in 1947.\n\nThe art deco clock was presented to Deacon in the year he tied for what was then the Robert Reynolds Trophy (now John Nicholls Medal) with the then club captain Ern Henfry. The clock carries a silver-plated plaque upon which are inscribed the following words;\n\nCARLTON FOOTBALL CLUB\n\nEqual Best & Fairest\n\n1947\n\nWon by\n\nBert Deacon\n\n\n\nThe inscription on the mantel clock.\n\nAccording to the Carlton Annual Report of that year, only the trophies to Deacon and Henfry were presented in that year, along with an award to Jack Bennett for Most Consistent Player.\n\nAs the then secretary Harry Bell reported: “Apart from the two above-mentioned trophies your Committee decided to suspend all other club awards, as in their opinion the 21 players in the Final games had contributed equally in bringing the flag to Carlton, and therefore they felt that all should share equally in the other trophies, with the result that at the Annual Meeting, each of the remaining 18 players will be presented with a trophy to mark the winning of the premiership”.\n\nFor almost 60 years, the clock sat on the mantelpiece in the loungeroom of the Deacon family home at 146 Wood Street, Preston. According to Bert’s son Bob, “the clock was there from the time Dad and Mum built the house in 1950 until the day we moved after Mum died about seven years ago”.\n\n\n\nDeacon's mantel clock.\n\nIn clearing the house after the death of their mother Jean, Bob and his older brother Brian resolved to share items with family friends. An old friend of Jean’s from Kerang was given the mantel clock, but recently on-sold it to a dealer in Moonee Ponds. The dealer then arranged for the clock to go under the hammer through an auctioneer in Woodend last Sunday, by which time the Deacon boys were alerted.\n\n“You give the item away in good faith and you don’t think any more of it – and then you get an email the Friday before the sale with an image of the mantel clock in the auction room,” Bob said.\n\n“Brian and I weren’t happy that the item had ended up in an auction house and we initially thought the clock might have been stolen until we did a bit of investigating. The auctioneer to his credit was going to withdraw the item until it was determined the clock hadn’t been stolen so I then instructed him to bid on the Deacon family’s behalf, and it’s such a relief that the item is now back with the family.”\n\nFrom 1942, Bert Deacon represented the Carlton Football Club in 106 senior matches through a ten-year career interrupted by war. On January 3, 1974, he died of a heart attack in Balnarring, and at the time of his death officiated as Carlton secretary.\n\n\n\nThe famous Bert Deacon in action for Carlton.\n\nIt’s not the first time that Bert’s prized football artefacts have been lost to the Deacons. The coveted Brownlow Medal was stolen from Jean’s purse (together with her father’s war medals) in a kitchen break-in while she was gardening out the front of the Wood Street home. None of the medals were ever recovered, and a Brownlow replica is now in the keep of Brian’s son.\n\nBob proudly protects the VFL certificate awarded to his father for winning the prized football trophy – and now the mantel clock.\n\nSo what will become of the item? According to Bob, it will be offered as a perpetual trophy to the winner of the Bert Deacon Golf Day tournament, which has been held at Flinders on the Wednesday between Christmas and New Year since 1950.\n\n“If the golf day folds, the clock will again be returned to the family,” Bob said.\n\n“But for as long as it’s in circulation, Dad will be remembered.”"}, {"url": "https://www.theguardian.com/sport/2021/feb/10/prominent-collingwood-members-call-for-serious-reform-of-the-board-after-racism-revelations", "page_content": "Elizabeth Proust grew up in Sydney as a proud supporter of what was then the Balmain Tigers rugby league club.\n\nWhen she moved to Melbourne and married Brian Lawrence in 1972, she passionately adopted his Collingwood Football Club as her own. As a Collingwood supporter and member she has been dismayed by the episodic flare-ups of racism against Indigenous people and those of colour that have shamed her club.\n\nAnd now, like so many other prominent and influential business people associated with Collingwood, she is calling for serious reform of the club’s board so it can implement the 18 recommendations of the Do Better report, which identified a culture of systemic racism at the Magpies and precipitated Eddie McGuire’s resignation as president.\n\nAs chairman of Cuscal Ltd, director of Lendlease Ltd, and past chair of Nestle Australia and the Bank of Melbourne, Proust’s record of leadership in the corporate and public sectors (she has also been a secretary of the Victorian Department of Premier and Cabinet and CEO of the City of Melbourne) gives her unique insight into management processes.\n\nShe is an expert at identifying corporate strengths, weaknesses and, occasionally, dysfunction.\n\nMeanwhile, her time as chair of the Australian Institute of Company Directors (AICD) until 2018 qualifies her to speak with authority on corporate governance. She is not backward in doing so in relation to Collingwood.\n\n“This is the opportunity to bring 21st century skills and experiences onto the Collingwood board because some of the issues that have been identified for Collingwood in that Do Better report, and elsewhere, are not quick fixes and they need skills beyond the board to turn that around,” she says.\n\n“Clearly we can’t continue to have what we have had for the last few years – for the last 20 years, at Collingwood. Certainly, more transparency is needed. But you need term limits too, for directors and chairmen, and good succession planning. As soon as you join a board you should start to think who, for the next few years, you need to keep on the board or you need to attract to the board so that you’ve got … people who can succeed you. You’re not thinking how long can I cling on to this job. That wasn’t evident at Collingwood.\n\n“Leave aside racism and the racism [Do Better] report, just for a moment. At its base the issue is also corporate governance. Good corporate governance is the underpinning of all organisations: not-for-profits, listed, private, etc. You mostly don’t notice it because its elements, when working properly, ensure that the organisation works well and achieves its aims.”\n\nShe says at its heart good corporate governance hinges on: succession planning including for the board chair; term limits of about 9-12 years for board members; challenging and collegiate boardroom dynamics that challenge bad decisions and errant culture; clear roles for directors and managers; and risk management policies that are followed and actioned.\n\nCritically, she says, “when something goes wrong, analyse, learn and apologise – don’t spin”.\n\nWhich all resonates in the context of Collingwood Football Club, where McGuire was president for 22 years alongside a board that includes a number of long-serving directors whose role in guiding the club through the Do Better scandal has been, at best, opaque.\n\nJournalist Barrie Cassidy is a Collingwood member who has called for serious reform at the club. He has flagged an interest in serving on the board while recently pointing out there has been no membership election for club positions for the best part of 20 years.\n\n“McGuire was a great president for 10 years. He does have a powerful legacy and future generations will thank him for that. But like so many agents of change, he did his best work early, and in the end he failed to identify his use-by date,” Cassidy wrote.\n\nProust says: “[Cassidy] says it well. If Eddie had stayed 10 years, he would be fondly remembered especially after the 2010 premiership.”\n\nBut the guidelines on healthy corporate governance exist for a reason, she says.\n\n“Don’t overstay, don’t make yourself bigger than your organisation – and leave your successor with clear air.”\n\nRight now that successor is unknown – except, perhaps, to McGuire, who may wish to extend his influence as a director or from outside the club boardroom like other historical luminaries and patrons of Magpie history, such as John Wren.\n\nA decade ago Proust may have been convinced to seek board membership or even the presidency herself, had the club found itself then in the predicament it is in now.\n\nBut she is about to move semi-permanently to Sydney and she believes her potential time to serve on the Collingwood board has passed.\n\nIndeed, she turned down an offer to join the Collingwood board about five years ago.\n\n“I grew up in Sydney and followed the Balmain Tigers, but since … moving to Melbourne in the early 70s I’ve followed Collingwood, and for 24 years I’ve been a member. So [being a director] was not quite on my bucket list but, you know … that would be an interesting role,” she says.\n\n“And I explored it, but I came to the conclusion … that there would be likely governance issues which would bring the two roles, both of which would be high profile, into some embarrassment. And I chose the AICD over Collingwood.”\n\nProust says she would like to see the board reform, implement all 18 recommendations of Do Better, and revitalise with new members.\n\n“I want to see more good people join,” she says, without giving the “kiss of death” to anyone she might wish to see on board by naming them."}, {"url": "https://www.carltonfc.com.au/news/751558/dudley-drew-and-the-lost-painting-of-bert-deacon", "page_content": "\n\nDudley Drew talks to CFC TV about his memories of his friend Bert Deacon, and about the painting he has just completed of Deacon completing a high mark over Richmond’s Roy Smeaton at Punt Road.\n\nClick here to view the video\n\nBack in 1948, a budding Melbourne artist named Dudley Drew was trying to eke out an existence in his adopted profession when, on the advice of his dear mother, he resolved to paint somebody famous.\n\nDudley’s Mum volunteered the name of Carlton centre half-back the late great Bert Deacon. After all, Deacon had just come off a stellar season, having taken out the 1947 Brownlow Medal, represented Carlton in its eighth premiership and earned Victorian and All-Australian selection.\n\nHow well Dudley remembers the moment. “My mother was blind, and when Bert won the Brownlow I was sitting with Mum in the bedroom talking to her one night and she said, ‘You should paint a portrait of Bert Deacon’,” Dudley explained.\n\n“I said ‘Do you think it’s a good idea?’ and she said ‘I think it will be wonderful for you’. I then said ‘How do I do this?’ and she said ‘Go and see him’.”\n\nDudley made his way to 2 Hawker Avenue, Preston, where Bert and Jean then lived. “When I got there this particular night, around about seven o’clock, Bert was already in bed because he was injured - he’d injured his leg playing football, but he and Jean just welcomed me so much. It was great and I felt so proud,” Dudley said.\n\n“I then asked Bert if he would pose for the big portrait and he said ‘I’d be very happy to do that’. He sat for the portrait about eight times and I remember in one sitting he began to smile, exposing this toothless gap. He was painted sporting grey trousers and navy blue blazer with the white V on the pocket and included in the painting is a trophy Bert also won for best afield for Victoria.\n\n“Towards the end Bert said, ‘You know I really love this painting and I’m going to tell everybody about the greatest artist in the world’, and he did. He sent many people to me to have their portraits painted. He was just great. No wonder I cried when he went to heaven.\n\nThough Bert and his wife Jean were thrilled with Dudley’s gift, they had nowhere in their small home to hang the sizeable canvas. For a brief period the portrait found a wall in the city sports store of the former Collingwood footballer Ron Todd, but at some point in 1948 it was returned to Dudley’s home and stored in a shed – which is where the work unfortunately came to grief.\n\nAs the artist explained, the painting toppled on to a steel table which pierced the canvas beyond repair.\n\nThe story might have ended then and there, were it not for this reporter’s chance viewing of a photograph of the original portrait in a scrapbook in Jean’s keep. Jean revealed that Dudley, now in his 80s, was the artist responsible and was alive and well in Melbourne’s eastern suburbs.\n\nThe question then begged. Sixty years on, would Dudley be up for the job of repainting the portrait from the photograph of the original? Remarkably, Dudley explained that the very thought had recently crossed his mind and that yes, he would commit to the task of recreating the image of Deacon, who died suddenly while serving Carlton as club secretary back in 1974.\n\nAnd so it was that the new version of the old Bert Deacon was this week unveiled by Dudley in the presence of Bert’s widow, Jean and son Robert. The portrait is basically true to the original, but boasts one slight embellishment - Dudley has painted in Bert’s ’47 Brownlow, which can be seen dangling from the trophy.\n\n“To think that 60 years on I’ve brought that painting back to life,” Dudley said. “Isn’t that a great story?”\n\nDudley has also just completed a work of Deacon completing a high mark over Richmond’s Roy Smeaton at Punt Road, based on a press photograph Bert handed him years before.\n\n“Bert had given me a copy of this photograph, which carried a handwritten message in the top left hand corner – ‘To my friend Dud - regards, Bert Deacon’,” Drew said.\n\nRegrettably the photograph was later stolen and all was thought lost . . . until early last year when Jean again came to the rescue.\n\n“I went out to Jean’s house and sat down with her, during which time she showed me the family photo album . . . that’s where I came across another copy of this photograph,” Dudley said.\n\n“I said to her, ‘Jean, you must let me borrow this. I want to paint this picture’. That happened about a year and a half ago’.”\n\nFor the past nine months, Drew, now in his early 80s, has put brush to canvas to recreate the Deacon image. The paint was still drying when he recently unveiled the canvas.\n\n“Bert actually told me that the Richmond fellow in front of the marking contest is George Smeaton and Jack Wrout is sandwiched between them,” Drew said.\n\n“Ron Savage is the Carlton player watching on, but I’m not sure of the identity of the other Richmond player.”\n\nIt’s not surprising that Drew is somewhat circumspect when asked what will become of the Bert Deacon artworks. Perhaps a Carlton-friendly benefactor might see fit to purchase the paintings and make them available on permanent loan to the Club.\n\n“Nobody knows the life of a painting,” said the man who has also painted the portraits of such luminaries as Archbishop Daniel Mannix, King O’Malley and “Weary” Dunlop.\n\nBut there can be no doubting the strength of the lifelong bond Dudley and Bert forged from the moment they met at the house in Hawker Avenue back in ’48.\n\n“I had a friendship with and a great admiration for this fellow, and his wife Jean,” Dudley said.\n\n“Bert and I became great friends and I could tell you many stories about him. He was a wonderful man. The day he died I remember picking up a paper. It was all over the front page and I just cried.\n\n“One night we met in the city and we were on our way to my parents place in Albert Park for dinner. We caught the tram here as he didn’t have a car then, nor did I. And I remember saying to him, I should have been as tall as you Bert, and he said to me ‘Dud, diamonds were never made as big as bricks’. So that made me feel good and every time I see someone bigger than me I think of the diamond.”\n\n\n\nPhoto Gallery\n\nClick here to view the Gallery of photos from the unveiling\n\nRelated Stories: Carlton Portraiture\n\nDecades on, Balharry Comes Through\n\nMonday, September 3, 2007\n\nA painting of former Carlton ruckman HW Balharry, pre-dating the VFL competition of 1897, has surfaced ... more\n\n\n\nBrushed up Bryce hits Canvas\n\nThursday, October 4, 2007\n\nBryce Gibbs as you’ve never seen him before - a unique acrylic on canvas by Silvio Mannello ... more\n\n\n\nRelated Stories: The Blueseum\n\n60th Anniversary of historic Brownlow Medal count\n\nTuesday, September 25, 2007\n\nThe wife of the Blues’ first medallist the late Bert Deacon, seeks assistance to find the 1947 medal ... more\n\n\n\n\n\n"}, {"url": "https://victoriancollections.net.au/items/5d521b1921ea6c157cde9272", "page_content": "Carlton Football Club\n\nDinner to Mr H R Clover player Career : 1920-24, 1926-31 Debut : Round 2, 1920 vs. Richmond, aged 25 years, 46 days Carlton Player No. 346 Games : 147 Goals : 396 Guernsey No. 1 Last Game : Semi Final, 1931 vs. Collingwood, aged 36 years, 180 days Height : 185 cm (6 ft. 1 in.) Weight : 86.5 kg (13 stone, 9 lbs.) DOB : 20 March, 1895 League Leading Goalkicker: 1922 Leading Goalkicker: 1920, 1921, 1922, 1923, 1926, 1928 Best and Fairest: 1929 Captain Coach: 1922-1924, 1927 Champion of the Colony: 1921 VFL AFL Hall of Fame Carlton Hall of Fame Team of the Century President: 1956-57 Vice President: 1932, 1935-54 Club Secretary: 1925-26 Horace “Horrie” Clover was Carlton’s star centre half-forward of the 1920’s; a high flying, long-kicking champion who enjoyed a stellar career with the Old Dark Navy Blues, then went on to be one of our longest-serving administrators. But even before he took the field for Carlton, Clover had to conquer the odds on the battlefields of France in World War 1. From Maryborough in central Victoria, Horrie enlisted in the 1st AIF in September 1915. After basic training, he embarked for France with reinforcements for the 7th Battalion in January of 1916. Soon pitched into the horrors of trench warfare, he fought and survived until September of that year, when he was transferred to a machine gun company and promoted to the rank of Corporal. On Christmas day, 1916, Horrie was struck down with acute appendicitis. He was evacuated to a field hospital for emergency surgery, where the doctors discovered that his appendix was gangrenous and that his life was in danger. He was immediately transferred to London for specialist treatment, and months of recuperation. Pronounced unfit for further front-line service, he was repatriated back to Australia in August 1917, and honourably discharged in May of the following year – six months before the Armistice. Having recovered, and keen to have a crack at senior football, Clover trained with Richmond and Melbourne before Carlton gave him an opportunity at VFL level. And how he delivered! In his first match in 1920 – ironically, against Richmond - he kicked four goals from centre half-forward, and hit the post three times! By the end of his first season at Princes Park, Clover was one of Carlton’s drawcards. Former Australian Prime Minister Sir Robert Menzies was just one of the many Carlton fans who were captivated; “he was the most artistic of high marks, unforgettable at half-forward,” said Menzies. Horrie could kick a football, too. A balanced, deceptively quick mover, he was a glorious running drop-kick for goal. Playing against Richmond again at Princes Park in July, 1921, he let fly with a monster kick that was later measured at 86.26 metres – that’s 94 yards, 2 feet in imperial terms! And there are numerous other instances where he roosted the ball more than 70 metres. In round 12 of 1921, he slotted 13 goals in a game against St Kilda; a club record which still stands today. The Blues made the finals in third place in 1921 and battled through to meet Richmond for the Premiership. Then the heavens above the MCG opened up on the day before the decider, turning the ground into a quagmire. In what was to be Clover’s only Grand Final appearance, Richmond won a slogging, mauling contest by four points. While Premiership glory eluded him, Horrie was Carlton’s top goalkicker in three of his first four seasons, including 1922, where his total of 58 was the competition’s best. He was appointed captain of the Blues that same year, and in 1923 took on the dual role of captain-coach. Over 1924 / 1925, he suffered more debilitating illness that prevented him from playing all season. Unable to pull on his football boots, he took on the job of Club Secretary, and continued in that position even after returning to the field in 1926. When he did eventually resume, he formed a new, powerful Carlton forward set-up with a young Harry “Soapy” Vallence at full-forward. Twice more – in 1926 and 1928, Clover’s brilliance and accuracy in front of goal saw him at the top of Carlton’s goal-kicking, and in 1929 – aged 34, he was honoured with the captaincy of Victoria against WA in his ninth and final game in the Big Vee. show_image.php?id=205 Horrie Clover retired as a player in 1931 after 147 games. His total of 396 goals is still ranked fifth best in Carlton’s proud history (only displaced for fourth when Brendan Fevola broke through in 2007/2008) – and it should be remembered that all but a handful of his games were played at centre half-forward, not in the goal square. In 1932 he was elected Vice-President of the Carlton Football Club, but retired after one year. In February 1935 on learning of Terry Ogden's the serious illness, Clover and Newton Chandler offered their services for a blood transfusion for the club's wing man. After a blood test Chandler's blood was accepted. However, Ogden passed away the next month. Clover stood again in 1935, was elected – and spent twenty unbroken years serving his beloved Blues. He even took on the Presidency in 1956, aged 60, and was as vigorous and determined as ever in his two years in the job. Carlton Football Club mourned deeply when Horrie Clover passed away on the first day of January, 1984. Three years later, he was among the first to be inducted into the Carlton Hall of Fame. Testament to his stature in the game as a whole, he was elected to the AFL Hall of Fame in 1996; and May 2000 saw him named as one of four emergencies in Carlton’s Team of the Century. A champion in every sense of the word, he spent 37 years of his remarkable life at Princes Park. Footnote The Argus published an article on Maryborough, April 12 1930, it said; \"Clover has been the leading half-forward in League ranks for some time. It takes a specialist to fill the position capably, and the Carisbrook man does this admirably. Like good wine he has improved with age, and besides being one of the greatest half forwards that has ever appeared on a football field, he is about the best all round kicker that has ever played the game. He excells in punting, drop, and place kicking. He is a great marksman and a splendid exponent, one of the greatest the district has produced, besides being a fair cricketer also.\" When Clover returned to football in 1926, The Argus mentioned that they thought it was the first time a member of the Permit and Umpire Committee had played in a League game. 13 GOAL AWARD Round 12, 1921 At the Carlton AGM held on Monday 27 February 1922, Horrie Clover \"was presented with ball used on the occasion, the St.Kilda club having generously donated it to the Carlton officials, who had it mounted for the purpose.\" (Age February 22 1922) 1922 The Art Of Forward Play Horrie wrote an article for the Sporting Globe August 30 p7 To read click here> http://nla.gov.au/nla.news-article184798404 1928 Idol of Carlton Crowds - Australia's Best Centre Half Forward The Sporting Globe's football writer W. S. \"Jumbo\" Sharland writes about Horrie Clover To read click here> http://nla.gov.au/nla.news-article183958222 Footballer Who Gambles With Death. Daily Pictorial (Sydney) article about Horrie. http://nla.gov.au/nla.news-article246129350 1932 Jack Worrall on Clover Writing for the Australasian September 03 p7; \"Take Horrie Clover as an example, a real specialist, one of the best forwards the game has seen, and the best all-round kick that has ever come under my purview. For that reason he deserves a line to himself. He played the game like a sportsman, was a glorious high mark, and could cover a great distance by either drop, punt, or place kick - a remarkable accomplishment. Many players have been notable kicks in two aspects of the game, yet none have equalled Clover in the three branches. His nearest rival as an all-round kick, though not quite as certain in his efforts, was Frank Caine, of Carlton, who, like Clover, also hailed from the country.\" 1933 Coming Football Champion Melbourne, Saturday A special warning was issued to the Victorian Football League delegates last night by Mr. D. H. Crone, a Carlton delegate, not to angle for a certain \"coming\" champion that the Carlton Club had signed up that day. At first delegates were a little puzzled at the statement, but when it was explained that Horrie Clover, former champion half-forward, had that day become the father of of a son they burst into sustained laughter. It was only by persistent ringing of the bell by the chairman that order was restored. (News (Adelaide) May 20 1933 p3) 1933 - The Place Kick A letter to The Argus via the Huon Times about the lack of place kicking expertise in the VFL. The writer mentions that he got Horrie to play football in Maryborough after he saw the then 15 y.o. place kick a ball 63 yards, and later with Carlton, Clover place kicked 8 goals in one match. To read click here> http://nla.gov.au/nla.news-article137253000 Milestones 50 Games: Round 1, 1923 vs Fitzroy 100 Games: Round 18, 1927 vs St Kilda 100 Goals: Round 18, 1921 vs Collingwood 200 Goals: Round 3, 1924 vs St Kilda 300 Goals: Round 11, 1928 vs Geelong Links Articles: The Magical 'Three Goal Average' | A Letter From Horrie | Our Flagless Greats Blueseum: Stat Shot for Horrie Clover | Career Breakdown | Clover's big goals hauls | Clover's Blueseum Image Gallery\n\nA dinner to celebrate career Horrie Clover in 1957\n\nFour Page Program & Menu 1927"}, {"url": "https://prabook.com/web/bert.deacon/2466480", "page_content": "Bert Deacon\n\nAustralian-rules footballer\n\nNovember 8, 1922 (age 51)\n\nA centre half back, Deacon began his league career in 1942. Deacon left Carlton after the 1951 season and became captain-coach for Preston in the Victorian Football Association (VFA), the club where he had played for prior to being recruited by Carlton. He later served as Carlton vice-president and club secretary. He is the centre half back in Carlton\"s official \"Team of the Century\". Office the field, Deacon worked for many years for long-serving VFL and Carlton president Sir Kenneth Luke. Bertram Deacon died of a heart attack on 3 January 1974 while on holiday at Balnarring. Deacon was just 51 years of age and died despite the desperate efforts of his Preston team-mate, Pat Foley to revive him."}, {"url": "https://australianfootball.com/Players/player/bert%20deacon/6771", "page_content": "Pre 1965 stats are for selected matches only\n\nAFL: 5,074th player to appear, 2,223rd most games played, 5,597th most goals kickedCarlton: 574th player to appear, 160th most games played, 497th most goals kicked\n\nSomewhat surprisingly for a club with such an illustrious pedigree, it took Carlton 27 years to come up with its first Brownlow Medallist in the shape of virtuoso centre half back Bert Deacon.\n\nAs fair as he was talented, Deacon began and finished his senior career with VFA side Preston. He joined the Blues in 1942, and was a key member of premiership teams in both 1945 and his Brownlow year of 1947. Strong overhead and brilliant at ground level, he effectively constituted the first line of attack for the Blues, with his superb anticipation frequently enabling him to intercept the ball and return it with interest, almost invariably to his team's advantage.\n\nIn 1952, Deacon returned to his original club Preston as captain-coach. He was regarded as having \"an excellent rapport with his players\",¹ but it was not until he began to coach the team from the sidelines that this began to bear fruit. In 1955 the Bullants qualified for the finals for the first time since the war, and although they would not win a premiership for another eight seasons there is little doubt that Deacon was instrumental in laying a foundation of professionalism on which his successors were able to build.\n\nIn 1958, Bert Deacon returned to Carlton as vice-president, and later served as club secretary.\n\nAuthor - John Devaney"}, {"url": "https://www.collingwoodfc.com.au/news/1041283/2022-collingwood-board-confirmed", "page_content": "The composition of the Collingwood board for 2022 was confirmed tonight at the club’s 2021 Annual General Meeting.\n\nThe outcome of a recent contested board election was declared, with Christine Holgate returned and three new directors – Jeff Browne, Barry Carp and Renee Roberts – elected.\n\nThe four join existing directors Jodie Sizer, Paul Licuria and Mark Korda on the Collingwood board for 2022.\n\nThe board of seven plans to meet tomorrow to elect Collingwood’s 14th president and vice-presidents.\n\nKorda, the out-going president, advised the board several months ago that with his term expiring at the end of 2022 he will not be a candidate.\n\n“I thank all of the candidates who contested the election hoping to make a contribution to Collingwood at board level. It is heartening to be reminded of that deep passion for our club,” Korda said.\n\n“I congratulate the successful candidates and, on behalf of the returning directors and our members, look forward to working with them in 2022.\n\n“I also want to pay tribute to retiring directors Peter Murphy and Neil Wilson.\n\n“Peter was an agent of change, someone who helped to modernise Collingwood be it through the Collingwood Foundation, as interim chief executive or as a director. Few achieved as much in their time as Peter did.\n\n“Neil was unfortunately with us for only a short time but the expertise for which he was identified served the board well during this year.\n\n“On behalf of our athletes, members and staff I thank and wish them all well.”\n\nThe meeting also saw life membership bestowed upon two outstanding and long serving members of staff, Tracey O’Connor and Rohan Bownds.\n\nO’Connor has worked for Collingwood for 23 years, firstly as executive assistant to chief executives John May, Greg Swan and Eugene Arocca and, since 2007, as the executive assistant to the GM of Football.\n\n‘Trace’ has been the matriarch of the AFL football department, support to GM’s Neil Balme, Geoff Walsh, Rodney Eade and Graham Wright and one of the most knowledgeable and capable women in football.\n\nSadly, O’Connor is leaving Collingwood to take up a new position in another field.\n\nBownds served Collingwood for 34 years until his recent retirement. He may be the only person directly connected as an employee to the two premierships Collingwood has won in the last 31 years.\n\nHe started as a volunteer, part-time trainer in 1987 and became head trainer in 2000 with the arrival of Michael Malthouse as coach. He succeeded John Wassell, who had held the head trainer position for 31 years, meaning Collingwood has had only two head trainers in the last 53 seasons.\n\nApart from his responsibility for the day-to-day oversight of the changeroom and training staff, ‘Ro’ was a mentor to generations of players who sought out his counsel and personal support. It was common for players to dine at the Bownds family home.\n\nHis connection to Collingwood is also blood thick. He met his wife Adriana through the club – her sister was working at Collingwood at the time – and their daughter Tahlia now works at the club.\n\n“Life membership is Collingwood’s highest honour and Tracey and Rohan are undoubtedly worthy recipients,” Korda said.\n\n“Collingwood has been made by many, by people who have helped in so many different ways to build our club. With 57 years of service to Collingwood between them, it is wonderful to be acknowledging their contributions.\n\n“All of Collingwood thanks Tracey and Rohan tonight.”\n\nSpecial services awards were also presented to Perry Fletcher and Joey Borensztajn.\n\nFletcher has been an honorary Woodsman for his long service as a fundraiser to Collingwood through his engraving and creation of awards and collectibles.\n\nBorensztajn, a partner at Arnold Bloch Leibler, has been a significant contributor to Collingwood’s philanthropic mission.\n\nBorensztajn helped establish the CFC Foundation in 2010 and has been member of the foundation board since, with his expertise critical to the creation of the Collingwood Community Centre at Victoria Park, the Magpie Nest homelessness project and many other significant community initiatives.\n\nLife Membership\n\nRohan Bownds\n\nTracey O’Connor\n\nSpecial Services Award\n\nPerry Fletcher\n\nJoey Borensztajn"}]}