{"Freddie Frith won North West 200 in 1938 and 1939.": [{"url": "https://www.primidi.com/north_west_200/winners/by_year", "page_content": "“Like to the time o\u0092 th\u0092 year between the extremes\n\nOf hot and cold, he was nor sad nor merry.”\n\n—William Shakespeare (1564\u00961616)\n\n“He bends to the order of the seasons, the weather, the soils and crops, as the sails of a ship bend to the wind. He represents continuous hard labor, year in, year out, and small gains. He is a slow person, timed to Nature, and not to city watches. He takes the pace of seasons, plants and chemistry. Nature never hurries: atom by atom, little by little, she achieves her work.”\n\n—Ralph Waldo Emerson (1803\u00961882)"}, {"url": "https://www.howold.co/person/freddie-frith/biography", "page_content": "Freddie Frith Biography\n\nBritish motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England) was a British Grand Prix motorcycle road racing world champion. A former stonemason and later a motor cycle retailer in Grimsby, he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War. He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.\n\nMotorcycle racing career\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350:cc Velocette KTT in the Junior event, finishing third at a speed of 60.34:mph. He retired from the 500:cc race with a blown engine, again riding his 350, when holding third place.\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90:mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results\n\n1949 point system\n\n(key) (Races in italics indicate fastest lap)\n\nSources\n\nExternal links"}, {"url": "https://lincsbikers.co.uk/famous-lincsbikers/freddie-frith/", "page_content": "British motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England)[1][2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5] He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.[6]\n\nMotorcycle racing career\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[7]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results\n\n1949 point system\n\nPosition 1 2 3 4 5 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0"}, {"url": "https://www.liquisearch.com/freddie_frith", "page_content": "Freddie Frith\n\nFrederick Lee \"Freddie\" Frith OBE (born 30 May 1909 - 24 May 1988 in Grimsby, Lincolnshire, England) was a British former Grand Prix motorcycle road racing World Champion. A former stonemason and motor-trader dealer was a stylish rider and five times winner of the Isle of Man TT. Frith had the distinction of being one of the few to win TT races before and after the Second World War.\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship . In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie also has the distinction of being the first ever 350cc World Champion in 1949 when, he won all five events of the inaugural campaign.\n\nFreddie Frith, alongside other Riders from BSA; Ariel and Matchless Works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick. They taught officers and NCOs how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500cc over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Freddie's track fast-cornering ."}, {"url": "https://en.unionpedia.org/i/Freddie_Frith", "page_content": "Freddie Frith Frederick Lee \"Freddie\" Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England) was a British Grand Prix motorcycle road racing world champion. [1]\n\n39 relations: Belgian motorcycle Grand Prix, Circuit Bremgarten, Dutch TT, European motorcycle Grand Prix, Fergus Anderson, Freddy (given name), Frith (surname), Georg Meier, German motorcycle Grand Prix, Grimsby, Isle of Man TT, Jimmie Guthrie, Junior TT, Karl Gall, List of 1949 motorsport champions, List of 350cc Motorcycle World Champions, List of Grand Prix motorcycle racers: F, List of Grand Prix motorcycle racing European champions, List of Grand Prix motorcycle racing World Champions by year, Manx Grand Prix, May 24, May 30, Reg Armstrong, Senior TT, Stanley Woods, Swiss motorcycle Grand Prix, Ulster Grand Prix, Wal Handley, 1936 Isle of Man TT, 1937 Isle of Man TT, 1938 Isle of Man TT, 1939 Isle of Man TT, 1948 Isle of Man TT, 1949 Belgian motorcycle Grand Prix, 1949 Dutch TT, 1949 Grand Prix motorcycle racing season, 1949 Isle of Man TT, 1949 Swiss motorcycle Grand Prix, 1949 Ulster Grand Prix.\n\nThe Belgian motorcycle Grand Prix is a motorcycling event that was part of the Grand Prix motorcycle racing season from 1949 to 1990.\n\nNew!!: Freddie Frith and Belgian motorcycle Grand Prix · See more »\n\nThe Circuit Bremgarten was a 7.28 km (4.524-mi) motorsport race track in Bern, Switzerland which formerly hosted the Swiss Grand Prix from 1933 to 1954 (Formula One, 1947 to 1954) and the Swiss motorcycle Grand Prix.\n\nNew!!: Freddie Frith and Circuit Bremgarten · See more »\n\nThe Dutch TT (Tourist Trophy) is a motorcycling event, traditionally held on the last Saturday of June at the TT Circuit Assen in the Netherlands, as part of the MotoGP World Championship.\n\nNew!!: Freddie Frith and Dutch TT · See more »\n\nThe European motorcycle Grand Prix was a motorcycling event that was reintroduced as part of the Grand Prix motorcycle racing World Championship from 1991 to 1995.\n\nNew!!: Freddie Frith and European motorcycle Grand Prix · See more »\n\nFergus Kenrick Anderson (9 February 1909 – 6 May 1956) was a British professional motorcycle racer.\n\nNew!!: Freddie Frith and Fergus Anderson · See more »\n\nFreddy or Freddie is a diminutive form of the given names Frederick, Alfred and others for men and Freda, Frederica and others for women.\n\nNew!!: Freddie Frith and Freddy (given name) · See more »\n\nFrith is a surname.\n\nNew!!: Freddie Frith and Frith (surname) · See more »\n\nGeorg \"Schorsch\" Meier (9 November 1910, Mühldorf am Inn – 19 February 1999) was a German motorcycle racer famous for being the first foreign winner of the prestigious Senior TT, the Blue Riband race of the Isle of Man TT Races, in 1939 riding for the factory BMW team and the first motorcycle racer to lap a Grand Prix course at over 100 mph.\n\nNew!!: Freddie Frith and Georg Meier · See more »\n\nThe German motorcycle Grand Prix, first held in 1925, is since 1952 part of the Grand Prix motorcycle racing World Championship.\n\nNew!!: Freddie Frith and German motorcycle Grand Prix · See more »\n\nGrimsby, also known as Great Grimsby, is a large coastal English town and seaport in North East Lincolnshire, of which it is the administrative centre.\n\nNew!!: Freddie Frith and Grimsby · See more »\n\nThe International Isle of Man TT (Tourist Trophy) races are an annual motorcycle sport event run on the Isle of Man in May/June of most years since its inaugural race in 1907, and is often called one of the most dangerous racing events in the world.\n\nNew!!: Freddie Frith and Isle of Man TT · See more »\n\nAndrew James Guthrie (23 May 1897 in Hawick, UK – 8 August 1937) was a Scottish motorcycle racer famous for 19 motorcycle Grand Prix wins, 3 victories in the North West 200 and 6 wins at the Isle of Man TT races.\n\nNew!!: Freddie Frith and Jimmie Guthrie · See more »\n\nThe Junior TT is a motorcycle road race that takes place during the Isle of Man TT festival; an annual event at the end of May and beginning of June.\n\nNew!!: Freddie Frith and Junior TT · See more »\n\nKarl Gall (27 October 1903 Vienna Austria – 13 June 1939) was an Austrian motorcycle racer with the works BMW motor-cycle team and a former German national motor-cycle champion.\n\nNew!!: Freddie Frith and Karl Gall · See more »\n\nThis list of 1949 motorsport champions is a list of national or international auto racing series with a Championship decided by the points or positions earned by a driver from multiple races.\n\nNew!!: Freddie Frith and List of 1949 motorsport champions · See more »\n\nGrand Prix motorcycle racing is the premier championship of motorcycle road racing, which has been divided into three classes since 1990: 125cc, 250cc and MotoGP.\n\nNew!!: Freddie Frith and List of 350cc Motorcycle World Champions · See more »\n\n* Michel Fabrizio.\n\nNew!!: Freddie Frith and List of Grand Prix motorcycle racers: F · See more »\n\nList of Grand Prix motorcycle racing FICM European Champions, from 1924 to 1939 and from 1981, in order of year and engine displacement.\n\nNew!!: Freddie Frith and List of Grand Prix motorcycle racing European champions · See more »\n\nThe following is a list of Grand Prix motorcycle racing World Champions from 1949 to 2017, in order of class and year.\n\nNew!!: Freddie Frith and List of Grand Prix motorcycle racing World Champions by year · See more »\n\nThe Manx Grand Prix motorcycle races are held on the Isle of Man TT Course (or 'Mountain Circuit') every year for a two-week period, usually spanning the end of August and early September.\n\nNew!!: Freddie Frith and Manx Grand Prix · See more »\n\nNo description.\n\nNew!!: Freddie Frith and May 24 · See more »\n\nNo description.\n\nNew!!: Freddie Frith and May 30 · See more »\n\nReginald Armstrong (1 September 1928 Liverpool – November 1979 Brighton) was an Irish professional Grand Prix motorcycle road racer.\n\nNew!!: Freddie Frith and Reg Armstrong · See more »\n\nSenior Tourist Trophy is a motorcycle road race that takes place during the Isle of Man TT festival, an annual event traditionally held over the last week in May and the first week in June.\n\nNew!!: Freddie Frith and Senior TT · See more »\n\nStanley Woods (1903 – 28 July 1993) was an Irish motorcycle racer famous for 29 motorcycle Grand Prix wins in the 1920s and 1930s, winning the Isle of Man TT races ten times in his career, plus wins at Assen and elsewhere.\n\nNew!!: Freddie Frith and Stanley Woods · See more »\n\nThe Swiss motorcycle Grand Prix was a motorcycling event that was part of the Grand Prix motorcycle racing season from 1949 to 1954.\n\nNew!!: Freddie Frith and Swiss motorcycle Grand Prix · See more »\n\nThe Ulster Grand Prix is a motorcycle race that takes place on the 7.3-mile Dundrod Circuit made up entirely of closed-off public roads near Belfast, Northern Ireland.\n\nNew!!: Freddie Frith and Ulster Grand Prix · See more »\n\nWalter Leslie Handley (5 April 1902 – 15 November 1941) born in Aston, Birmingham, Kolumbus.fi Walter Leslie Handley (Retrieved 10 December 2006) known as Wal Handley, was a champion British inter-war motorcycle racer with four wins at the Isle of Man TT Races in his career.\n\nNew!!: Freddie Frith and Wal Handley · See more »\n\nThe 1936 Isle of Man Tourist Trophy saw Norton rider Jimmie Guthrie win the Senior, and come fifth in the Junior.\n\nNew!!: Freddie Frith and 1936 Isle of Man TT · See more »\n\nThe 1937 Isle of Man Tourist Trophy saw Freddie Frith break the 90+ mph lap for the first time during the Senior TT with a speed of 90.27 mph on his Norton beating Stanley Woods by only 15 seconds.\n\nNew!!: Freddie Frith and 1937 Isle of Man TT · See more »\n\nThe 1938 Isle of Man Tourist Trophy saw the Senior TT lap record of 90.27 mph set by Freddie Frith the previous year broken in 1938 when Harold Daniell completed a lap at 91.00 mph on his Norton, a record which would stand for 12 years.\n\nNew!!: Freddie Frith and 1938 Isle of Man TT · See more »\n\nThe 1939 Isle of Man Tourist Trophy was the last race festival until 1947 due to the interruption by World War II.\n\nNew!!: Freddie Frith and 1939 Isle of Man TT · See more »\n\nIn the 1948 Isle of Man Tourist Trophy festival Harold Daniell, lap record holder since 1938, failed to finish the 1948 Senior TT on his Norton, and victory went to Norton team member, Artie Bell, the flying Ulsterman.\n\nNew!!: Freddie Frith and 1948 Isle of Man TT · See more »\n\nThe 1949 Belgian motorcycle Grand Prix was the fourth round of the 1949 Grand Prix motorcycle racing season.\n\nNew!!: Freddie Frith and 1949 Belgian motorcycle Grand Prix · See more »\n\nThe 1949 Dutch motorcycle Grand Prix was the third race of the 1949 Motorcycle Grand Prix season.\n\nNew!!: Freddie Frith and 1949 Dutch TT · See more »\n\nThe 1949 Grand Prix motorcycle racing season was the inaugural F.I.M. Road Racing World Championship Grand Prix season.\n\nNew!!: Freddie Frith and 1949 Grand Prix motorcycle racing season · See more »\n\nThe 1949 Isle of Man Tourist Trophy was the first round of the Grand Prix World Championship that was held in the Isle of Man.\n\nNew!!: Freddie Frith and 1949 Isle of Man TT · See more »\n\nThe 1949 Swiss motorcycle Grand Prix was the second race of the 1949 Motorcycle Grand Prix season.\n\nNew!!: Freddie Frith and 1949 Swiss motorcycle Grand Prix · See more »\n\nThe 1949 Ulster Grand Prix was the fifth round of the 1949 Grand Prix motorcycle racing season.\n\nNew!!: Freddie Frith and 1949 Ulster Grand Prix · See more »\n\nRedirects here:\n\nFreddie L Frith.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Freddie_Frith"}, {"url": "https://wiki2.org/en/Freddie_Frith", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England)[1][2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5] He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.[6]\n\nYouTube Encyclopedic\n\n1 / 3 Views: 35 913 2 024 109 774\n\nIsle of Man TT 1948 - Retro Road Racing\n\nIsle of Man TT 1989 | Steve Hislop wins the Supersport 600 Race\n\nVintage Road Racing - 1929 Isle of Man TT Races Transcription\n\nMotorcycle racing career\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[7]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results\n\n1949 point system\n\nPosition 1 2 3 4 5 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0\n\nSources"}, {"url": "https://motorcycletimeline.com/1939-2/", "page_content": "The Army ran local selection trials to select entrants for the Army Motor Cycle Championship which was, in turn, used to select the Army team for the ISDT. And a growing number of military personnel rode in civilian trials, in unform, with unit names replacing club names.. A number of major trials offered extra awards to the uniformed riders, most of whom were relative novices.\n\nThe ACU declined to run the 21st ISDT but the FICM accepted Germany’s offer to host the event which was held in Austria (which, like the Sudetenland, was now in German hands). The Army sent three teams to compete for the Huhnlein Trophy. The British Trophy, Vase and Army teams were all doing well when it became clear that Germany was about to invade Poland. Togs were strapped onto mud-caked bikes and chucked into the support cars and vans and the Brits scarpered for the Swiss border, making their way home via Dieppe. The Germans, without opposition, rode on to claim the Trophy and Vase but the FICM promptly declared the result null and void.\n\nTrademen’s sidecar outfits were losing ground to vans but in the USA Harley Davidson and Indian were doing a steady trade in 750cc sv commercial trikes, respectively the Servicar and the Disapatch Tow.\n\nThe British Motor Cycle Association yearbook was packed with info on current models and future events. More intriguing was the advert it carried for Challoner’s Famous Formula HTN Tablets. In a testimonial ‘AJ of Wilts’ wrote: “Since I started your treatment I have gained three inches in height.” And the company promised: “If one box is insufficient we guarantee to supply another FREE!”\n\nThe first regular television transmissions put pressure on manufacturers to stop sparky passing vehicles interfering with reception. That’s why plug caps are more properly known as suppressor caps.\n\nNorton withdrew from racing to concentrate on expanded production of 16Hs for the military. To fight alongside the Nortons the War Department ordered the BSA equivalent, the 500cc sidevalve M20. An order for 10,000 ohv 350cc BSA B29s was withdrawn because it made sense to standardise. B29s would play a major role in the war, once the US noticed it had started, but they were made by Boeing rather than BSA. Beezas were good, but they couldn’t carry atomic bombs to Japan.\n\nNorton, having withdrawn from racing, allowed its former works riders Freddie Frith and Harold Daniell to enter as privateers on their 1938 machines. ‘Crasher’ White was hired by NSU for the Junior but joined his Norton team-mates in the Senior. The British Senior contingent also included Bob Foster and Walter Rusk on the AJS blown V-fours, with Stanley Woods riding the Velo cammy single (he tried the Roarer in practice but it simply wasn’t developed enough for racing; this was to be its sole Island appearance).\n\nGermany, clearly determined to win everything it could sent works teams from BMW, DKW and NSU. Blown Beemers would compete in the Senior; dohc blown parallel-twin NSUs would compete in the Senior and Junior; DKWs were available for all three races. From Italy came 250 and 500cc Guzzis and a brace of Benellis.\n\nUnsurprisingly it was, finally, BMW’s year: Georg Meier won the Senior with his team-mate and former mentor Jock West as runner-up. Following a furious scrap for 3rd spot Frith’s Velo beat Woods’ Norton by 6sec.\n\nIn the Junior Woods claimed his 10th TT victory for Velo ahead of Daniell’s Norton and Fleischmann’s DKW. Surprise winner of the lightweight crown was a dohc Benelli piloted by Ted Mellors. So the 1939 TT score was one each to Germany, Britain and Italy.\n\nVelocette’s celebrations were dampened when Harold Willis, whose foot gearchange had contributed to its Junior victory, died suddenly of meningitis during race week.\n\nNo less than 36 Velos were entered for the TT, with 24 Nortons, eight Excelsiors, five Ajays, four BMWs, four Rudges, three apiece from Guzzi, NSU and CTS (Tatersall Specials), two Benellis and one each from OK Supreme, New Imperial, Terrot, CBT (Taylor Special)… and BSA.\n\nThe Ulster GP showed the shape of races to come. No doubt encouraged by Benelli’s Lightweight TT win, Garelli entered its watercooled, supercharged tranverse four – AJS was ready for it with the equally watercooled, equally supercharged V-4. Walter Rusk on the Ajay and Mussolini’s former chauffeur Dorino Serafini on the Garelli gave the crowd the spectacle they’d hoped for with Rusk breaking the lap record at dead on 100mph. Then a broken fork link put him out of the race, Serafini lapped at 100.3mph and another classic British race was won by a Continental interloper.\n\nFollowing his TT win Georg Meier won the Belgian GP on his BMW at 100.63mph; it was the first time a major road race had been won at more than 100mph. BMW built its 100,000th motorcycle.\n\nAt the Swedish GP Georg Meier did another ton-up lap but it wasn’t enough because two Benelli fours forced BMW into third place. And at the German GP Serafini and his Benelli finished ahead of Meier and his BMW. To complete a bad day for Nazi race fans (pun intended) Alberto Pagani’s Guzzi beat the DKWs to snatch 250cc victory.\n\nSo BMW had outpaced Norton and Benelli had outpaced BMW – now Bianchi threatened to outpace Benelli in 1940 with a blown four-pot racer developing 80hp at 7,500rpm.\n\nThe Italians were on a roll: Taruffi and his 90hp 500 Gilera four raised the hour record to 127.53mph.\n\nThe British motorcycle industry produced more than 320 models, far more than any other country. Ten marques offered rear suspension and there was a greater emphasis on lightweights, many of which still had only three gears. And more sv and twostrokes were available, at the expense of ohv buses.\n\nCompetition knobbly tyres, condemned in some quarters as ‘pot-hunters’ tyres’, were banned. The idea was to encourage the devlopment of riding skills and machines more relevant to road riding – shades of the TT.\n\nLevis came up with a clever variation on the plunger suspension theme. Hydraulic friction dampers were actuated by the suspension movement, automatically compensating for the weight of passengers and luggage.\n\nHighlights of The Motor Cycle Clubman’s Day at Brooklands included a 112.98mph flying kilometre by George Brown on a 998cc Vincent-HRD and a 101.64mph lap by Theresa Wallach on a 348cc Norton which earned her a Gold Star. Noel Pope took his BroughSup tound at over 125mph to set the last ever outer-citcuit record; Brooklands was about to be built over by Vickers.\n\nMotor Cycling, now edited by race ace Graham Walker, launched a rival event at Donington Park with stars including Stanley Woods, Ginger Wood, Harold Daniell, Tyrell-Smith and Les Archer. It also featured races for amateurs on road bikes and a race for pre-1931 bikes, won by Bill Boddice on a New Hudson.\n\nRegistrations rose 32%, though much of the increase was down to lightweights used on government business.\n\nWith warclouds gathering driving tests were suspended and petrol rationing was introduced, allowing about 200 miles of motoring per month. Thrifty lightweight motorcycles and autocycles were coming into their own. A 98cc Villiers engine powered the Coventry-Eagle Auto-Ette, Dayton Autocycle, Excelsior Autobyk, Francis-Barnett Powerbike, James Autocycle, Norman Motobyke and Raynal Auto. Cyc-Auto used a 98cc Scott engine; HEC powered its Power Cycle with its own 80cc clip-on twostroke. These Wilfreds could do 25-30mph and up to 120mpg.\n\nMore than 300 riders took part in the Bexleyheath MCC’s 12th Langmaid trial, representing 33 clubs – 160 of them were soldiers.\n\nThere were three attempts on the Maudes Trophy. Triumph sent a Speed Twin and a Tiger 100 from Coventry up to John o’Groats, doen to Land’s End, back up to Brooklands for speed tests and back to Coventry. BSA circumnavigated England and made 25 tough overnight hillclimbs. A Panther Model 100 did 10,000 miles in 10 days running up and down the Great North Road.\n\nThe manufacturers’ trade association that some 25,000 of Britain’s estimated 700,000 motorcyclists were female\n\nFewer riders laid their bikes up for the winter; the proportion taxing their machines throughout the year had risen from 70.6% in 1929 to 80.2%.\n\nIn a survey BMCA members were universally in favour of giving traffic on major roads priority over traffic on secondary roads at junctions.\n\nPlans were afoot for a ‘roadster’ class in the TT. Getting back to the event’s ‘tourist’ roots this would be an out and out production race.\n\nThe Guthrie Memorial cairn was unveiled during TT week. The surplus funds raised in Jimmie Guthrie’s memory by The Motor Cycle’s Shilling Fund were used to endow a bed at the Island’s Noble’s Hospital, another at Guthrie’s home town, Hawick, and the British Prestige trophy.\n\nMore than 67,000 bikes were registered in Belgium and 27,000 in Switzerland.\n\nLiverpool Police took delivery of a batch of 1,140cc Royal Enfiel outfits, taking its fleet past the 50 mark.\n\nVolunteer dispatch riders, even those with ‘elderly machines’ were recruited by the Auxiliary Fire Service.\n\nE Lyons rode his Triumph Speed Twin to victory in the North-West 200 at 74.5mph.\n\nThe Motor Cycle lap-by-lap TT results telegrams were displayed at more than 130 sites through Britain and the Channel Isles. Most were dealers but riders also gathered for their TT news at AMC, Dunlop, Vincent the ACU and thye Blue ‘Un’s HQ in Stamford St, Lomndon SE1.\n\nThe Southern Trial was run on standard road-legal tyres. Vic Brittain won the solo class on a 490cc Norton; D Mansell rode another 490 Norton to victory in the sidecar class.\n\nReported exchange from a London police court… Clerk: “Do you know this Belisha Crossing?” Woman: “Not to speak to.”\n\nPeugeot’s P53 was a 100cc motorcycle complete with three-speed (hand-change) transmission. But some were produced with fixed footrests that looked like pedals. So these P53s could pass for 50cc pedal-assisted velomoteurs that were exempt from registration, roadtax, insurance and the need for a driving licence. How cheeky – how French – is that?\n\nClub life was flourishing with the best part of 200 items on the ‘Club Events’ page in a typical issue of the Blue ‘Un. There was a BMCA ‘mock trial’, a Bradford Vagabonds tour of the Dukeries, an IMTC wekend rally (with filmshow and test rides on a Tiger 100), a London Co-operative MCC dinner dance (at a Masonic hall) and a Scunthorpe MCC ‘bachelor supper’. The Leicester Aces enjoyued a tour of theior local power station. Also on offer to clubmen were technical talks, darts matches, ‘games tournaments’, table tennis, dances, runs to sporting events, a ‘ladies popular vote run’, a ‘social secretary’s birthday run’, a supper dance, a ‘junk hunt’, a ‘follow-the-leader’ run, a ‘sawdust chase’, and an ‘intelligence run’.\n\nSporting clubmen were catered for by news from the ACU centres with event previews and results; there was even a club report on an ‘English-style’ trial from the Southern Cross MCC of Adelaide. The correspondent added that in case the Brits thought of their Aussie cousins were ‘Promenade Percies’ a more typical Southern Cross event was a 24hr, 500-mile non-stop blast through the bush.\n\nPredicting that spring frames would grace “nearly every stands at Earls Court” and reporting that at least seven (vertical) twins were in the pipeline, a rather smug Blue ‘Un scribe remarked: “At last our age-old plea that the industry should develop multi-cylinder engines and spring frames seems to be bearing fruit… already the term ‘ twin-cylinder reliability’ is coming into use.”\n\nThe vertical twins expected at the show included the BSA A7, designed by Val Page who knew a thing or two about vertical twins, while Edward Turner was preparing a Triumph 350cc vertical twin. Even Panther aimed to pitch in with a vertical twin, albeit inline rather than transverse (as well as 500 and 600cc vertical singles with conventional frames.\n\nBut of course there was no show that year. The war killed off the Panther vertical twin, just as WW1 had killed off the Panther V-twin. The chaps at Cleckheaton must have begun to take German warmongering personally.\n\nThe Manx Grand Prix was cancelled too, the day before racing started, when Britain declared war on Germany. Motorcycles and their riders donned khaki, Navy blue and RAF blue. It would be six bitter years of blood, sweat and tears before motorcycle evolution could resume.\n\nCheek! Miyata opened a dealer in occuppied Shanghai.\n\nJapan produced 3,000 motorcycles; Germany managed 500,000.\n\nCivil servants are creatures of habit so following the RFC’s adoption of P&M’s during the Great War Panthers were acquired for the RAF. Compared with the likes of BSA, Norton, Matchless, Ariel Triumph and Royal Enfield Panther was a small concern and was simply unable to meet demand. So the RAF got the same mixture of bikes as the Army, but most RAF bases had at least one or two Pussies tucked away.\n\nPetrol rationing was introduced, and what little was available was ‘Pool’ petrol, rated at about 72 octane. No problem for low-compression sidevalves but not bad news for competition or high-speed road riding."}, {"url": "https://www.lincolnshirelife.co.uk/heritage/motorcycling-heroes/", "page_content": "Austin Munks and Freddie Frith were both at the very top of their chosen sport of motorcycle racing either side of World War Two.\n\nThey were both born during the same year, 1909, with Austin coming from Leverton in the south of the county and Freddie from Grimsby in the north. Although Austin remained an amateur throughout his career, Freddie was to turn professional, with outstanding success. Later in their lives they both proved to be successful businessmen.\n\nAustin was the youngest son of Mr and Mrs A E Munks, and his father was blacksmith of the Highgate. He was obviously always interested in speed, and started racing locally on grass and at proper hard tracks, Donington Park being the nearest. His first Isle of Man Manx Grand Prix victory came in 1933, when he won the Junior (350cc) on a Velocette – he had finished third in the Junior class on his Velocette the previous year. Three years later, in 1936, he was the first man ever to win the double, the Junior and the Senior (500cc) on Velocette and Norton machines respectively. After the war, in 1947, Austin was to secure his final Manx Grand Prix victory, winning the Lightweight class (250cc) on a Moto Guzzi, with an average speed of seventy miles per hour, setting a new record lap of 72.54mph.\n\nAustin was not only interested in motorcycle racing, flying aircraft was another of his passions. He learned to fly and obtained his pilot’s licence in 1933. He owned his own aircraft, and flew it from a strip belonging to the Bowser family at Hurn End. He became friendly with Alex Henshaw CBE, a former test pilot, and they both used this strip.\n\nAustin was to suffer a terrible shooting accident during October 1935. While he was out with an organised shoot at Asterby, one stray pellet was to hit him in his left eye, causing him to lose his sight from that eye. But this setback obviously did not slow down his racing brain, and he went on to notch up his remarkable double Manx Grand Prix wins the following year. After this he retired from racing, and of course the outbreak of the Second World War was soon to follow.\n\nWhen the hostilities ceased he was to get itchy feet again and have a crack at the race he had previously not won on the Isle of Man, the lightweight class of the Manx Grand Prix. So he bought a motorcycle of Italian manufacture, a Moto Guzzi, and the only way he could get it back was to fly to Italy himself. So off to Milan he flew in his Auster aircraft and picked up the dismantled machine – a good story he could surely tell about that experience. The machine was re-assembled by his very good friend and mechanic, Sammy Coupland of Frithville, and the rest, as they say, is history.\n\nAfter this he did finally retire from racing, and he was to sponsor a couple of local lads who were to make names for themselves in the sport. First it was R H (Dickie) Dale, from Wyberton. Dickie went on to win the following year’s Lightweight Manx Grand Prix (1948) on the same machine, Austin’s Motto Guzzi, setting an average speed of 73.36mph, and a new record lap of 74.36 in the process. Dickie was to go on and enjoy a successful career in the sport riding first for the Norton works team, then followed by spells in various continental teams, including Gilera, Benelli, MV Agusta, BMW, and Moto Guzzi (where he was especially noted for his rides on the 500cc V8 model) teams. Unfortunately he was to lose his life after a crash at the Nurburgring, Germany, in 1961.\n\nDickie was followed by Bernard Codd from Wrangle, who still farmed there until his recent death last July. Starting in trials riding, he also proved to be successful in the Isle of Man. Winning the Clubman’s Tourist Trophy double (350 and 500cc), he was the only man to achieve this unique double, during the last year these classes were held, 1956.\n\nHe was certainly a force to be reckoned with on the short circuit scene in this country. A serious crash at Crystal Palace the following year ended a very promising career. Unfortunately, he suffered a serious break to his right leg, and was bed bound for a year. The latest technology for treating such injuries had not reached these parts of the country in those days.\n\nFrederick Lee (Freddie) Frith, was born in Grimsby, into a reputable monumental and stonemason family. Like his father, who was a keen motorcyclist, he had the urge for speed. He was to enjoy the sponsorship of Nigel Spring, of the Spring family from Brigg – famous for their jam and curd factory.\n\nFrom 1936 until the outbreak of World War II he rode works machines provided by the Norton factory, and later, Velocette. He always held the reputation of being a very stylish rider, and gained such quotes from the press of the day as ‘chivalrous’ and ‘the Galahad in leathers’. His first ride in the Isle of Man was in the 1930 Manx Grand Prix, in which he was to finish third in the Junior race on a Velocette. His first win came in 1935, when he won the Junior (350cc) race – he had previously finished second to Austin in the 1933 Junior. The following year he turned professional and joined the works Norton team, with immediate success. He won, on his first attempt, the 1936 Junior Tourist Trophy, setting a new race record, and record lap at 81.94mph, making him the first man to lap the famous course at over eighty miles per hour for the Junior class. And he followed this up with a second place in the Senior (500cc) to his Norton teammate, Jimmie Guthrie. Later that season he was to go on to win the Junior (350cc class) European championship. The 1937 senior TT was to be a memorable race for Freddie; not only did he win it, but he was the first rider ever to lap the famous TT course at over ninety miles per hour (90.27mph) on his works Norton. By this time the German and Italian supercharged machines were becoming a real threat to the British manufacturers in the European championships, with George Meier winning both the 1938 and 1939 Senior class on his BMW. The 1939 Ulster Grand Prix was the last race before the Second World War intervened. In this Freddie finished second in the Senior class on his Norton, to Italian, Dorino Serafini, who was Gilera mounted.\n\nDuring the war Freddie served in the army, at the infantry driving and maintenance school at Keswick, reaching the rank of sergeant. At the first TT after the war in 1947, Freddie had secured a ride on a Moto Guzzi in the senior class. But he was to suffer a crash at Ballacraine during practice, dislocating his right shoulder, and was unable to race. In the 1948 season Freddie was back on British machinery, this time Velocette. He went on to win the Junior class in the European championship that year.\n\nIn 1949 the World Championships, now known as Moto GP, was born. There were four classes for solo machines, 125cc Ultra-Lightweight, 250cc Lightweight, 350cc Junior and 500cc Senior, and one for 600cc sidecars. It was to turn out for Freddie to be his most successful season. He went on to win every round in the Junior class, including the Isle Of Man Tourist Trophy and became the first ever 350cc World Champion. He was to retire at the end of that season, winning his final race at the Ulster Grand Prix, and setting a new record lap speed of 90.60mph in the process. When Royal honours were announced the following year (1950), Freddie was honoured for his efforts, by being awarded the OBE for his services to the sport. This made him the first person ever to receive a Royal honour for motorcycling. Geoff Duke was the next to follow him, and receive the same honour.\n\nBoth Austin and Freddie were able to prove, beyond their motorcycling endeavours, that they could run successful businesses. Austin ran his motor garage at Leverton Highgate from the 1930s and was soon to obtain the very successful Jaguar car agency. He was later to add Daimler and later still Austin/Rover to the list. On his death on 29th January 1981, he left the business to his workers. He also had a collection of vintage motorcycles, his favourite being a 1939 Brough Superior. It was later sold at a Bonham’s sale to an American collector for £42,200, well above the £30–35,000 estimate.\n\nFreddie also owned his own successful business, a motorcycle sales and repair outlet, run from the family’s original stonemason premises in Victoria Street, Grimsby, now unfortunately demolished. He was the agent for various leading manufacturers, including BMW, and was very successful for many years. He died on 24th May 1988.\n\nThese two true gentlemen have both been great ambassadors for their chosen sport and the county of Lincolnshire. We can only guess at what might have happened if the war had not interrupted their respective careers, but they have both left us with their own unique memories. The famous (or infamous) Isle of Man TT course certainly held no fears for either of these two intrepid Lincolnshire yellowbellies.\n\nREFERENCES\n\nThe Story of the Manx G S Davison (The TT. Special 1948)\n\nMotorcycle Road Racing in the Fifties A Mckinnon (Osprey Pub Ltd 1982)\n\nIsle of Man TT C. Deane (Patrick Stephens Ltd 1975)\n\nThe Book of Leverton Various\n\n(The Leverton History Group 2004)\n\nLincolnshire Archives office, Lincoln\n\nNorth Lincolnshire Archives office, Grimsby\n\nGrimsby Library"}, {"url": "https://www.bbc.co.uk/northernireland/yourplaceandmine/antrim/75_nw_museum.shtml", "page_content": "\"Race day\" exhibition - 8 decades of road racing nostalgia The first North West 200 was held on 20th April 1929. From the 31 entrants, only eight bikes passed the checkered flag. At the birth of the North West, the now-familiar wail of Japanese race bikes would have been a very alien sound . In those heady days, the roads around Portrush, Portstewart and Coleraine echoed to the thunderous roar of big singles and twins with megaphone exhausts.\n\n\n\nBikes were basic and the riders were heroes. It was a game of rider skill more than technology. Names like Exelsior, Rudge, Velocette & Norton went with those of Malcolm McQuigg, Jimmy Guthrie, Freddie Frith, Stanley Woods and many many others which populated the pages of the race programmes in the early years. The unforgettable smell of Castrol oil and the rhythmic beat of hot pistons was brought back to life by Ballymoney Museum in May 2004. As part of the year's Bike Fest. Trophies, photographs, race winning motorcycles, helmets, riding gear and all manner of memorabilia from eight decades of Irish road racing was on view over the NW200 weekend, at The Joey Dunlop Leisure Centre, Ballymoney.\n\n\n\nTop left: 500cc race 1971. John Cooper (21) & Geoff Barry (97)\n\nTop right: Ray Amm on the Streamliner, 1953\n\nBottom left: Phil Read in 1969\n\nBottom Right: Joey Dunlop 1992 Photography courtesy of Clifford McLean and Ballymoney Museum. Keith Beattie, Manager of Ballymoney Museum who put the exhibition together. Click here for a guide to what the North West is all about \"your place and mine\" reporter Davy Apsley went to the races in 2003 and produced a \"picture page\". Read his account of it here... Is it an event you'd never miss? What is the atmosphere like and has it changed over the years? Have you any good photos? (You can e-mail copies to us - see the address in the final paragraph below) Do you meet up with the same people year after year?\n\nDo you live abroad and can no longer attend? Have you ever helped in running the event? What's it like to take part? Would it matter if the 'North West 200' came to an end? Some of you have been sending your own comments and pictures. Click here to see them..."}, {"url": "https://www.wikizero.com/en/Freddie_Frith", "page_content": "From Wikipedia the free encyclopedia\n\nBritish motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England)[1][2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5] He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.[6]\n\nMotorcycle racing career [ edit ]\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[7]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results [ edit ]\n\n1949 point system\n\nPosition 1 2 3 4 5 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0"}], "Freddie Frith won Ulster Grand Prix in 1938 and 1939.": [{"url": "https://www.lincolnshirelife.co.uk/heritage/motorcycling-heroes/", "page_content": "Austin Munks and Freddie Frith were both at the very top of their chosen sport of motorcycle racing either side of World War Two.\n\nThey were both born during the same year, 1909, with Austin coming from Leverton in the south of the county and Freddie from Grimsby in the north. Although Austin remained an amateur throughout his career, Freddie was to turn professional, with outstanding success. Later in their lives they both proved to be successful businessmen.\n\nAustin was the youngest son of Mr and Mrs A E Munks, and his father was blacksmith of the Highgate. He was obviously always interested in speed, and started racing locally on grass and at proper hard tracks, Donington Park being the nearest. His first Isle of Man Manx Grand Prix victory came in 1933, when he won the Junior (350cc) on a Velocette – he had finished third in the Junior class on his Velocette the previous year. Three years later, in 1936, he was the first man ever to win the double, the Junior and the Senior (500cc) on Velocette and Norton machines respectively. After the war, in 1947, Austin was to secure his final Manx Grand Prix victory, winning the Lightweight class (250cc) on a Moto Guzzi, with an average speed of seventy miles per hour, setting a new record lap of 72.54mph.\n\nAustin was not only interested in motorcycle racing, flying aircraft was another of his passions. He learned to fly and obtained his pilot’s licence in 1933. He owned his own aircraft, and flew it from a strip belonging to the Bowser family at Hurn End. He became friendly with Alex Henshaw CBE, a former test pilot, and they both used this strip.\n\nAustin was to suffer a terrible shooting accident during October 1935. While he was out with an organised shoot at Asterby, one stray pellet was to hit him in his left eye, causing him to lose his sight from that eye. But this setback obviously did not slow down his racing brain, and he went on to notch up his remarkable double Manx Grand Prix wins the following year. After this he retired from racing, and of course the outbreak of the Second World War was soon to follow.\n\nWhen the hostilities ceased he was to get itchy feet again and have a crack at the race he had previously not won on the Isle of Man, the lightweight class of the Manx Grand Prix. So he bought a motorcycle of Italian manufacture, a Moto Guzzi, and the only way he could get it back was to fly to Italy himself. So off to Milan he flew in his Auster aircraft and picked up the dismantled machine – a good story he could surely tell about that experience. The machine was re-assembled by his very good friend and mechanic, Sammy Coupland of Frithville, and the rest, as they say, is history.\n\nAfter this he did finally retire from racing, and he was to sponsor a couple of local lads who were to make names for themselves in the sport. First it was R H (Dickie) Dale, from Wyberton. Dickie went on to win the following year’s Lightweight Manx Grand Prix (1948) on the same machine, Austin’s Motto Guzzi, setting an average speed of 73.36mph, and a new record lap of 74.36 in the process. Dickie was to go on and enjoy a successful career in the sport riding first for the Norton works team, then followed by spells in various continental teams, including Gilera, Benelli, MV Agusta, BMW, and Moto Guzzi (where he was especially noted for his rides on the 500cc V8 model) teams. Unfortunately he was to lose his life after a crash at the Nurburgring, Germany, in 1961.\n\nDickie was followed by Bernard Codd from Wrangle, who still farmed there until his recent death last July. Starting in trials riding, he also proved to be successful in the Isle of Man. Winning the Clubman’s Tourist Trophy double (350 and 500cc), he was the only man to achieve this unique double, during the last year these classes were held, 1956.\n\nHe was certainly a force to be reckoned with on the short circuit scene in this country. A serious crash at Crystal Palace the following year ended a very promising career. Unfortunately, he suffered a serious break to his right leg, and was bed bound for a year. The latest technology for treating such injuries had not reached these parts of the country in those days.\n\nFrederick Lee (Freddie) Frith, was born in Grimsby, into a reputable monumental and stonemason family. Like his father, who was a keen motorcyclist, he had the urge for speed. He was to enjoy the sponsorship of Nigel Spring, of the Spring family from Brigg – famous for their jam and curd factory.\n\nFrom 1936 until the outbreak of World War II he rode works machines provided by the Norton factory, and later, Velocette. He always held the reputation of being a very stylish rider, and gained such quotes from the press of the day as ‘chivalrous’ and ‘the Galahad in leathers’. His first ride in the Isle of Man was in the 1930 Manx Grand Prix, in which he was to finish third in the Junior race on a Velocette. His first win came in 1935, when he won the Junior (350cc) race – he had previously finished second to Austin in the 1933 Junior. The following year he turned professional and joined the works Norton team, with immediate success. He won, on his first attempt, the 1936 Junior Tourist Trophy, setting a new race record, and record lap at 81.94mph, making him the first man to lap the famous course at over eighty miles per hour for the Junior class. And he followed this up with a second place in the Senior (500cc) to his Norton teammate, Jimmie Guthrie. Later that season he was to go on to win the Junior (350cc class) European championship. The 1937 senior TT was to be a memorable race for Freddie; not only did he win it, but he was the first rider ever to lap the famous TT course at over ninety miles per hour (90.27mph) on his works Norton. By this time the German and Italian supercharged machines were becoming a real threat to the British manufacturers in the European championships, with George Meier winning both the 1938 and 1939 Senior class on his BMW. The 1939 Ulster Grand Prix was the last race before the Second World War intervened. In this Freddie finished second in the Senior class on his Norton, to Italian, Dorino Serafini, who was Gilera mounted.\n\nDuring the war Freddie served in the army, at the infantry driving and maintenance school at Keswick, reaching the rank of sergeant. At the first TT after the war in 1947, Freddie had secured a ride on a Moto Guzzi in the senior class. But he was to suffer a crash at Ballacraine during practice, dislocating his right shoulder, and was unable to race. In the 1948 season Freddie was back on British machinery, this time Velocette. He went on to win the Junior class in the European championship that year.\n\nIn 1949 the World Championships, now known as Moto GP, was born. There were four classes for solo machines, 125cc Ultra-Lightweight, 250cc Lightweight, 350cc Junior and 500cc Senior, and one for 600cc sidecars. It was to turn out for Freddie to be his most successful season. He went on to win every round in the Junior class, including the Isle Of Man Tourist Trophy and became the first ever 350cc World Champion. He was to retire at the end of that season, winning his final race at the Ulster Grand Prix, and setting a new record lap speed of 90.60mph in the process. When Royal honours were announced the following year (1950), Freddie was honoured for his efforts, by being awarded the OBE for his services to the sport. This made him the first person ever to receive a Royal honour for motorcycling. Geoff Duke was the next to follow him, and receive the same honour.\n\nBoth Austin and Freddie were able to prove, beyond their motorcycling endeavours, that they could run successful businesses. Austin ran his motor garage at Leverton Highgate from the 1930s and was soon to obtain the very successful Jaguar car agency. He was later to add Daimler and later still Austin/Rover to the list. On his death on 29th January 1981, he left the business to his workers. He also had a collection of vintage motorcycles, his favourite being a 1939 Brough Superior. It was later sold at a Bonham’s sale to an American collector for £42,200, well above the £30–35,000 estimate.\n\nFreddie also owned his own successful business, a motorcycle sales and repair outlet, run from the family’s original stonemason premises in Victoria Street, Grimsby, now unfortunately demolished. He was the agent for various leading manufacturers, including BMW, and was very successful for many years. He died on 24th May 1988.\n\nThese two true gentlemen have both been great ambassadors for their chosen sport and the county of Lincolnshire. We can only guess at what might have happened if the war had not interrupted their respective careers, but they have both left us with their own unique memories. The famous (or infamous) Isle of Man TT course certainly held no fears for either of these two intrepid Lincolnshire yellowbellies.\n\nREFERENCES\n\nThe Story of the Manx G S Davison (The TT. Special 1948)\n\nMotorcycle Road Racing in the Fifties A Mckinnon (Osprey Pub Ltd 1982)\n\nIsle of Man TT C. Deane (Patrick Stephens Ltd 1975)\n\nThe Book of Leverton Various\n\n(The Leverton History Group 2004)\n\nLincolnshire Archives office, Lincoln\n\nNorth Lincolnshire Archives office, Grimsby\n\nGrimsby Library"}, {"url": "https://lincsbikers.co.uk/famous-lincsbikers/freddie-frith/", "page_content": "British motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England)[1][2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5] He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.[6]\n\nMotorcycle racing career\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[7]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results\n\n1949 point system\n\nPosition 1 2 3 4 5 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0"}, {"url": "https://trove.nla.gov.au/newspaper/article/125709486", "page_content": "Rain, which fell during- the race,\n\nrendered parts of the road, racing cir\n\ncuit very slippery, resulting in several\n\nfalls, one of the unfortunates being\n\nFreddy Frith, the crack ''.Morton' ri\n\nder, who has figured so ipromlnently\n\nin the Isle of Man 'T.T.' races, and\n\nwon the Ulster Classic in. 1936.\n\nDuring the contest Welit, despite\n\nparts of tho course being -n et, covered\n\na circuit (just over 20 Wiles) in 12\n\nmin. 26sec., equal to an average speed\n\nof 9S.93 m.p.h. Over a ljjilf mile, on\n\none of the straight stretches of the\n\ncourse, West was electrically timed to\n\nbo travelling at 115.76 irft.p.h.\n\nHad it not been for title wet road\n\nsurface, one hundred m.p.h. laps\n\nwould have been recorded by several\n\nof the contestants. Weift, on a simi\n\nlar mount, won this important Irish\n\nevent last year, with an averagq"}, {"url": "https://www.belfasttelegraph.co.uk/sport/motorcycling/the-legends-of-motorcycling-have-made-the-ulster-grand-prix-one-of-the-sports-top-races/38370335.html", "page_content": "Exciting new book outlines roller coaster history of the Ulster Grand Prix which takes place today\n\nThe start of the 250cc race at the 1975 UGP\n\nIn February 1922, Co Down-born Harry Ferguson, famed for his role in the development of the modern agricultural tractor, proposed an event on the 20.5-mile Clady Circuit in Co Antrim with its unique seven-mile straight, the intention being to run a motorcycle race in the morning followed by a car race in the afternoon.\n\nAntrim Co Council agreed to contact the newly-formed Northern Ireland Government for permission to close the public roads. But, in fact, it was then Editor of the Belfast Telegraph, Thomas Moles MP, a keen motorcyclist, who was credited with being responsible for the Road Races Act reaching the Statute Book in 1922.\n\nThus the Ulster Grand Prix was born and first run by the Ulster Motorcycle Club on Saturday, October 14, 1922.\n\nSeventy-two riders started the seven-lap handicap race with Hubert Hassall on a works Norton winning by 45 seconds at an average speed of 60.57mph, the first time a race anywhere had been won at over 60mph.\n\nThe race survived the Great Depression in the Thirties and was boosted by being awarded the title 'Grand Prix of Europe' in 1935.\n\nSpeeds were on the increase, Jimmie Guthrie lapping at 95.97mph in practice, 32 seconds inside the lap record, so it was decided to paint five feet wide yellow lines every 30 feet at 10 corners to warn riders of the bends ahead. Nowadays we have marker boards.\n\nThe UGP was fastest road race in the world from 1923 until 1937 and from 1938 until 1952 despite a number of financial crises and but for Billy McMaster, who approached the Ulster Centre governing body for assistance, and ordinary club members raising £200, the race could have been lost.\n\nWinners in the pre-war era included Stanley Woods (six times), Walter Rusk, Ernie Nott, Jock West, Johnny Lockett, Doriano Serafin, who set the first 100mph lap of the Clady Circuit on his Gilera, and Freddie Frith, riding machines like Norton, Rudge, Velocette, Cotton, Rex-Acme, New Imperial, Enfield, New Imperial, DKW, BMW, AJS and Sunbeam.\n\nAfter the Second World War, the 'Prix' was back in 1947, but on a shorter 16.5-mile circuit as a new airfield had been constructed at Nutts Corner.\n\nFrom 1949, the Prix became part of the newly introduced World Championships until 1973 when the status was removed.\n\nThe year 1950 saw the legendary Geoff Duke ride a new 500cc Featherbed Norton and record the first sub 10-minute lap of the new circuit and first 100mph lap at 101.77mph.\n\nIn 1951, tragedy struck prior to the race when Italian Moto Guzzi team mates Lorenzetti, Leoni and Geminiani were practicing unofficially.\n\nLorenzetti and Geminiani stopped at the pits while Leoni carried on until Ballyhill where he realised his team-mates were not behind him. He turned and proceeded back towards the pits unaware that his team-mates had set off from the pits again.\n\nThey collided head on with Leoni killed instantly and Geminiani dying later in hospital while Lorenzetti escaped uninjured, but badly shaken.\n\nDuke became the first double winner in 1951, taking the 350cc and 500cc races on Nortons.\n\nSeptember 1950 then saw the Belfast & District Club run a race on a new circuit at Dundrod, replacing the Carrowdore 100 with the Dundrod 100.\n\nA bombshell came in 1953 when Antrim Co Council decided it could not maintain two circuits and made it known they would not grant the use of the Clady Circuit for the UGP, but would permit it to run at the new 7.416-mile Dundrod venue.\n\nProtests proved futile and, although unpopular at first, the inaugural Ulster Grand Prix at Dundrod was held on Saturday, August 15, 1953.\n\nFamous names of the Fifties and Sixties included John Surtees winning five out of six 350/500cc races from 1958 to 1960 - it would have been six out of six but for a broken gear lever in the 1960 500cc race - and Mike Hailwood won his first Grand Prix riding a Ducati in the 125cc race, beating the MZ of Gary Hocking in the 1959 UGP.\n\nIn a memorable 1960 350cc race, Alan Shepherd on his Geoff Monty AJS tailed the MV Agusta of Surtees for five laps before sweeping into the lead past the grandstand.\n\nA split timing pin forced Shepherd to retire, but MV still lodged a protest about the engine capacity of the AJS and, embarrassingly for the mighty Italians, all was found to be legal.\n\nHonda made their UGP debut in 1960 and a year later Bob McIntyre (250) and Kunimitsu Takahashi (125) gave the Japanese giant their first wins around Dundrod.\n\nThe Ulster Grand Prix Supporters Club was formed in 1963 when the Tourist Board withdrew their support and the event looked financially doomed. Since then the club have provided over £1million in financial support\n\nHailwood set the first 100mph lap of Dundrod in 1963 on an MV Agusta and then, in torrential rain, Bushmills rider Dick Creith, on the Ryan Norton, finished second in the 1964 500cc race, going one better a year later when the rain came on four laps into the race. Everyone slowed except Creith, who went on to win by eight seconds from South African Paddy Driver.\n\nGrand Prix House was constructed in 1965 when Leathemstown became a T-Junction and a year later Leathemstown Bridge was by-passed by a straight road.\n\nNames like Ivy, Read, Stuart Graham, Ralph Bryans (our first world champion in 1965), Mike (now Michelle) Duff, Agostini, Ginger Molloy, Creith, Hugh Anderson, Redman and Luigi Taveri were stars of the Sixties.\n\nThe troubled 1970s were difficult years for Northern Ireland and the UGP but in 1971 our own Ray McCullough pulled off a sensational win in the 250cc race after Phil Read, chasing the world championship, gestured to McCullough to slow down in horrendous wet conditions.\n\nRead retired, while McCullough won a Grand Prix race on home soil from Jarno Saarinen and Dieter Braun.\n\nTwo months later, Grand Prix House was left in rubble by a terrorist bomb and led to the UGP being abandoned in 1972 when a short circuit ran at Bishopscourt instead and then in 1973 World Championship status was withdrawn from Dundrod by the FIM world governing body.\n\nMany doubters thought this was the end for the Ulster. However, the leading British riders still supported the race and John Williams became the first ever triple winner in 1973.\n\nThe entry did decline, but in 1977 local hero Tom Herron's world championship influence brought the likes of Jon Ekerold, Alan North, Pekka Nurmi and Vic Soussan to Dundrod. Herron won the 350 from McCullough, flashed past the chequered flag as one with North in the 250cc race, the local star getting the judges' nod for the win.\n\nJohn Williams won the 500cc race in 1978 but later crashed at Wheelers in the 1000cc race and although initially thought not to be seriously injured he died in hospital that night suffering from a congenital heart problem.\n\nThe 1980s were dominated by Joey Dunlop and Honda in the FIM TTF1 Championship, although in 1980 he was a works Suzuki rider to help Graeme Crosby seal the world championship, but not before 'The Gurk' showed his talent, building up a huge lead only to slow in the closing stages to let Crosby through to win.\n\nJoey signed for Honda for 1992 and spent the rest of his career, until his untimely death in 2000, with the Japanese manufacturer.\n\nJoey won a record 24 UGP races in his career and clinched five successive TTF1 World Championships.\n\nDromara Destroyer Brian Reid was NI's third World Champion in 1985, winning the F2 race at Dundrod to clinch the title before crashing out at Flow Bog and breaking his leg in the 250cc race. Reid finished second in the 1986 F2 race behind Eddie Laycock, enough to clinch the second F2 crown.\n\nNeil Robinson, in his second UGP appearance, demolished the field in the 1986 TTF1 race, Joey Dunlop and all, riding the Skoal Bandit Suzuki, but a few weeks later Neil lost his life in a practice crash at Scarborough.\n\nThe 1987 event was one of the blackest days in UGP history with the death of German Klaus Klein in the F1 race that never should have started due to the diabolical conditions with rivers of water on the circuit. The meeting was then abandoned.\n\nKing of the Jungle Carl Fogarty was the new TTF1 champion for Honda in 1988, winning at Dundrod for the first time and retaining the title in 1989.\n\nUlster riders dominated the 250cc class. From 1980 until 1998 there were 25 completed 250cc races with Joey Dunlop, Brian Reid and Phillip McCallen winning 18 of them.\n\nIn 1990 Joey (Honda) and brother Robert Dunlop (Norton) battled for the win. Robert stayed out until the final laps before having to refuel while Joey went the distance without refuelling, taking the lap record to almost 123mph.\n\nIn 1993 the UGP had a title sponsor - Pepsi - for the first time in four years, but the promoters, Ulster Centre Promotions, had struggled to make ends meet for a few years and the UGP Supporters Club refused to back them with UCP going bust, plunging the race into doubt once again.\n\nIn stepped Billy Nutt and the Coleraine Club for 1994, immediately ditching the controversial and unpopular start/finish chicane introduced in 1992.\n\nMcCallen was unstoppable in 1996, winning all five races he started.\n\nThe sidecar race in 1997 set off on the warm-up lap and, within a quarter of a mile from the start, tragedy struck.\n\nThe outfit of Stephen Galligan left the track on the 'Flying Kilo' and hit seven-year-old Christopher McConnell-Hewitt, who was killed instantly. Galligan also died in hospital a few days later.\n\nDavid Jefferies beat Joey Dunlop in the opening Superbike race in 1999, the first Superbike rider to win on his UGP debut, but in one of his finest Dundrod races, Joey reversed the positions with the V&M R1 Yamaha rider in a scintillating race.\n\nIt was Joey's last Dundrod race as he lost his life the following July in Estonia.\n\nThe year 2001 saw the foot and mouth epidemic with the UGP the only major race of the season, resulting in a huge entry and the best crowd for many a year. Sadly, it turned out to be a disaster of a day with Ian Lougher crashing at Dawson's Bend Chicane and his machine flying over safety bales and hitting flag marshal Gerry Allaway, who died on the way to hospital.\n\nBilly Nutt announced he was stepping down from running the Ulster Grand Prix in October and with the Coleraine Club deciding to concentrate on their own North West 200, the 'Prix' was at another crossroads.\n\nThe Dundrod and District club eventually took over the reins from 2002 and still run the meeting despite numerous ups and downs, both financially and with weather abandonments.\n\nIn 2007 the event's future was again in doubt, due to a shortage of commercial sponsorship and lack of Government funding. The Belfast Telegraph stepped forward as title sponsor and, with other new sponsors coming on board, the event was secured.\n\nThe lap record is currently held by Dean Harrison at 134.614mph, set in 2017, making the Ulster Grand Prix the Fastest Road Race in the World, a title it lost in 2018 to the Isle of Man TT.\n\nNames like Darran Lindsay, Richard Britton, Adrian Archibald, John McGuinness, William and Michael Dunlop, Guy Martin, Ryan Farquhar, Ian Hutchinson, Bruce Anstey, Conor Cummins, Lee Johnston, Peter Hickman and Harrison plus many, many more have all played their part in the continuing roller coaster history of the Ulster Grand Prix.\n\nRoy Harris's second book 'Just for the Thrill 2' will be available in bookshops towards the end of the year, concentrating on Motorcycle Sport in the 1980's.\n\nClassic Festival\n\nAll roads lead to Bishopscourt Racing Circuit today and tomorrow for the inaugural Classic Bike Festival Ireland, sponsored by GO Fuels. The brainchild of former TT, North West 200 and Ulster Grand Prix hero Phillip McCallen, the event will be the biggest display of classic racing motorcycles ever seen in Ireland. The unique line-up of racing machinery, some of which will take part in parade laps of the Co Down venue, include machines raced by legends of the sport including Joey Dunlop's 1980 TT-winning Yamaha, Barry Sheene, Tom Herron, Neil Robinson, Ralph Bryans, Kenny Roberts (500cc Yamaha), Eddie Lawson, Sammy Miller and Ray McCullough."}, {"url": "https://wiki.alquds.edu/?query=Freddie_Frith", "page_content": "British motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England)[1][2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5] He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.[6]\n\nMotorcycle racing career [ edit ]\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[7]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results [ edit ]\n\n1949 point system\n\nPosition 1 2 3 4 5 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0"}, {"url": "https://www.carolenash.com/news/bike-news/detail/rider-of-the-week-freddie-frith", "page_content": "Rider Of The Week focuses on an exceptional rider and Freddie Frith was up there with the greatest. Known as ‘the Galahad in leathers’ Frith gained a reputation for being a stylish and skilled racer. His accomplishments include winning the 1935 Junior Manx Grand Prix and becoming the first 350cc World Champion.\n\nEarly days\n\nFrith was born in Grimsby in 1909 and came from a well-known stonemason family. He inherited his motorcycle enthusiasm from his dad, even though he started working in the family business. He went on to become a motorbike retailer in his hometown, but he always had a need to be on the road.\n\nRacing career\n\nFrith managed to earn a sponsorship from Nigel Spring, who was part of a family known for owning a jam and curd factory. His first ride occurred in the Isle of Man at the 1930 Manx Grand Prix and he came third. The bike he rode was a 350 cc Velocette KTT. Frith enjoyed major success in 1935 when he won the Junior 350 cc.\n\nThis win inspired him to turn professional and he joined the Norton team in 1936. His success continued when he won the 1936 Junior Tourist Trophy, setting a new race record lap of 81.94 mph. He followed this up with a second place position in the Senior 500 cc race, losing out to Norton teammate Jimmie Guthrie. In 1937, Frith won the Senior TT, becoming the first man to lap the course at over ninety miles per hour.\n\nFrith served at the Infantry Driving & Maintenance School stationed in Keswick during WW2. He was set to participate in the 1947 TT, only to suffer a crash at Ballacraine during practice, dislocating his right shoulder. This stopped him from racing, but he came back strong in 1948 and won the Junior race in the European championship.\n\nIn 1949, the Moto GP was created and it became Frith’s most successful season. He went on to win every round in the Junior class, including the Isle of Man Tourist Trophy and became the first 350 cc World Champion.\n\nAt the end of the season, Frith retired, winning his final race at the Ulster Grand Prix. In 1950, he received royal honours, being awarded the OBE for his service to motorcycle racing.\n\nVery few racers can claim to go out on the top of their career, but Frith was happy with the success that he’d earned. He passed away in 1988, having lived a satisfying life."}, {"url": "https://www.wikizero.com/en/Freddie_Frith", "page_content": "From Wikipedia the free encyclopedia\n\nBritish motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England)[1][2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5] He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.[6]\n\nMotorcycle racing career [ edit ]\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[7]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results [ edit ]\n\n1949 point system\n\nPosition 1 2 3 4 5 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0"}, {"url": "https://dbpedia.org/page/Freddie_Frith", "page_content": "dbo: abstract فريدي فريث (بالإنجليزية: Freddie Frith)‏ كان متسابق دراجات نارية إنجليزي فاز ببطولة سباق الجائزة الكبرى للدراجات النارية. نافس في سباقات بطولة العالم لفئة 500 سي سي ولفئة 350 سي سي ولفئة 50 سي سي. كما شارك في كأس جزيرة مان السياحية. (ar)\n\nFrederick Lee „Freddie“ Frith, OBE (auch „Freddy“ Frith; * 30. Mai 1909 in Grimsby, England; † 24. Mai 1988 ebenda) war ein britischer Motorradrennfahrer. Während seiner aktiven Karriere war Frith für seinen eleganten Fahrstil bekannt. Er gewann zweimal die Europameisterschaft, viermal die Tourist Trophy und wurde 1949 der erste Weltmeister in der 350-cm³-Klasse der Motorrad-Weltmeisterschaft. (de)\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England) was a British Grand Prix motorcycle road racing world champion. A former stonemason and later a motor cycle retailer in Grimsby, he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War. He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours. (en)\n\nFrederick Lee Frith (Grimsby,30 de mayo de 1909 – Grimsby, 24 de mayo de 1988)​​ fue un piloto de motociclismo británico y es el primer campeón del mundo de la historia en conseguir de la categoría de 350cc en 1949.​ De profesión cantero, se dedicó después a mecánico de motos en Grimsby,​ fue un piloto estilista, que consiguió en cinco ocasiones el TT Isla de Man. Frith fue uno de los pocos pilotos en ganar la TT antes y después de la Segunda Guerra Mundial.​ (es)\n\nFrederick Lee \"Freddie\" Frith (30 mai 1909 - 24 mai 1988 Grimsby , Lincolnshire , Angleterre) était un champion du monde de course de vitesse en catégorie 350 cm3. Il a été le 1er champion du monde de la catégorie lors de sa création en 1949. Ancien tailleur de pierre et plus tard revendeur de motos à Grimsby, c'était un pilote rapide cinq fois vainqueur du TT de l'île de Man. Frith a été l'un des rares pilotes à remporter des courses du TT avant et après la Seconde Guerre mondiale. Il a été fait officier de l'Ordre de l'Empire britannique (Officer of the British Empire - OBE). (fr)\n\nFrederic L. \"Freddie\" Frith (30 maggio 1909 – Grimsby, 24 maggio 1988) è stato un pilota motociclistico britannico vincitore di un titolo nel motomondiale. (it)\n\nフレディー・フリース（Frederick L. \"Freddie\" FrithOBE、1909年3月30日‐1988年5月24日）は、イギリス・イングランドリンカンシャー州出身のオートバイレーサー。彼はロードレース世界選手権350ccクラス初代チャンピオンである。 (ja)\n\nFrederick Lee (\"Freddie\") Frith, OBE (Grimsby, 30 mei 1909 – aldaar, 24 mei 1988) was een Brits motorcoureur. Zijn beste jaar was het seizoen 1949, toen hij de allereerste wereldkampioen in de geschiedenis van de wegrace werd. (nl)\n\nFrederick Lee „Freddie” Frith (ur. 30 maja 1909 w Grimsby, zm. 24 maja 1988) – brytyjski kierowca motocyklowy. Jego największymi osiągnięciami było dwukrotne zdobycie Mistrzostwa Europy w klasie 350 cm³, czterokrotne zwycięstwo w wyścigu Isle of Man TT oraz zdobycie mistrzostwa świata w kategorii 350 cm³ w inauguracyjnym sezonie w 1949 roku. Po zakończeniu sezonu 1949 zakończył karierę sportową, prowadził swój sklep motocyklowy w Grimsby. Podczas drugiej wojny światowej służył jako instruktor nauki jazdy cross-country na motocyklu, dla oficerów w Kenswick. Odznaczony Orderem Imperium Brytyjskiego IV klasy (OBE). (pl)\n\nFrederick Lee Frith, mais conhecido como Freddie Frith, OBE (Grimsby, 30 de maio de 1909 – Grimsby, 24 de maio de 1988), foi um motociclista britânico, campeão do mundo nas 350cc. Bicampeão europeu de motovelocidade nas 350cc, com o primeiro título vindo em 1936, e o segundo em 1948 (não houve edições do campeonato entre em 1940 e 1946 devido a Segunda Guerra Mundial, a qual participou), primeiro campeão mundial de motovelocidade nas 350cc, em 1949, e seis vezes vencedor do prestigioso TT da Ilha de Man, Frith é muito lembrado como um dos poucos a terem conquistado títulos antes e depois da Segunda Guerra. (pt)\n\nФредерик Ли Фриз, более известный как Фредди Фриз (англ. Frederick Lee Frith; 30 мая 1909 — 24 мая 1988, Гримсби, Линкольншир, Англия) — британский мотогонщик, первый чемпион мира в классе 350cc MotoGP (1949 года), пятикратный победитель гонки Isle of Man TT. (ru)\n\nFreddie Frith, född den 30 maj 1909, död den 24 maj 1988 var en brittisk roadracingförare som vann 350GP 1949. (sv)\n\nФредерік Лі Фріз, більш відомий як Фредді Фріз, OBE (англ. Frederick Lee Frith; 30 травня 1909 — 24 травня 1988, Грімсбі, Лінкольншир, Англія) — британський мотогонщик, перший MotoGP (1949 року), п'ятиразовий переможець гонки . (uk)\n\ndbp: date December 2019 (en)\n\ndbp: name Freddie Frith (en)\n\ndbp: years 1936 (xsd:integer)\n\n1948 (xsd:integer)\n\n1949 (xsd:integer)\n\nrdfs: comment فريدي فريث (بالإنجليزية: Freddie Frith)‏ كان متسابق دراجات نارية إنجليزي فاز ببطولة سباق الجائزة الكبرى للدراجات النارية. نافس في سباقات بطولة العالم لفئة 500 سي سي ولفئة 350 سي سي ولفئة 50 سي سي. كما شارك في كأس جزيرة مان السياحية. (ar)\n\nFrederick Lee „Freddie“ Frith, OBE (auch „Freddy“ Frith; * 30. Mai 1909 in Grimsby, England; † 24. Mai 1988 ebenda) war ein britischer Motorradrennfahrer. Während seiner aktiven Karriere war Frith für seinen eleganten Fahrstil bekannt. Er gewann zweimal die Europameisterschaft, viermal die Tourist Trophy und wurde 1949 der erste Weltmeister in der 350-cm³-Klasse der Motorrad-Weltmeisterschaft. (de)\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England) was a British Grand Prix motorcycle road racing world champion. A former stonemason and later a motor cycle retailer in Grimsby, he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War. He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours. (en)\n\nFrederick Lee Frith (Grimsby,30 de mayo de 1909 – Grimsby, 24 de mayo de 1988)​​ fue un piloto de motociclismo británico y es el primer campeón del mundo de la historia en conseguir de la categoría de 350cc en 1949.​ De profesión cantero, se dedicó después a mecánico de motos en Grimsby,​ fue un piloto estilista, que consiguió en cinco ocasiones el TT Isla de Man. Frith fue uno de los pocos pilotos en ganar la TT antes y después de la Segunda Guerra Mundial.​ (es)\n\nFrederick Lee \"Freddie\" Frith (30 mai 1909 - 24 mai 1988 Grimsby , Lincolnshire , Angleterre) était un champion du monde de course de vitesse en catégorie 350 cm3. Il a été le 1er champion du monde de la catégorie lors de sa création en 1949. Ancien tailleur de pierre et plus tard revendeur de motos à Grimsby, c'était un pilote rapide cinq fois vainqueur du TT de l'île de Man. Frith a été l'un des rares pilotes à remporter des courses du TT avant et après la Seconde Guerre mondiale. Il a été fait officier de l'Ordre de l'Empire britannique (Officer of the British Empire - OBE). (fr)\n\nFrederic L. \"Freddie\" Frith (30 maggio 1909 – Grimsby, 24 maggio 1988) è stato un pilota motociclistico britannico vincitore di un titolo nel motomondiale. (it)\n\nフレディー・フリース（Frederick L. \"Freddie\" FrithOBE、1909年3月30日‐1988年5月24日）は、イギリス・イングランドリンカンシャー州出身のオートバイレーサー。彼はロードレース世界選手権350ccクラス初代チャンピオンである。 (ja)\n\nFrederick Lee (\"Freddie\") Frith, OBE (Grimsby, 30 mei 1909 – aldaar, 24 mei 1988) was een Brits motorcoureur. Zijn beste jaar was het seizoen 1949, toen hij de allereerste wereldkampioen in de geschiedenis van de wegrace werd. (nl)\n\nFrederick Lee Frith, mais conhecido como Freddie Frith, OBE (Grimsby, 30 de maio de 1909 – Grimsby, 24 de maio de 1988), foi um motociclista britânico, campeão do mundo nas 350cc. Bicampeão europeu de motovelocidade nas 350cc, com o primeiro título vindo em 1936, e o segundo em 1948 (não houve edições do campeonato entre em 1940 e 1946 devido a Segunda Guerra Mundial, a qual participou), primeiro campeão mundial de motovelocidade nas 350cc, em 1949, e seis vezes vencedor do prestigioso TT da Ilha de Man, Frith é muito lembrado como um dos poucos a terem conquistado títulos antes e depois da Segunda Guerra. (pt)\n\nФредерик Ли Фриз, более известный как Фредди Фриз (англ. Frederick Lee Frith; 30 мая 1909 — 24 мая 1988, Гримсби, Линкольншир, Англия) — британский мотогонщик, первый чемпион мира в классе 350cc MotoGP (1949 года), пятикратный победитель гонки Isle of Man TT. (ru)\n\nFreddie Frith, född den 30 maj 1909, död den 24 maj 1988 var en brittisk roadracingförare som vann 350GP 1949. (sv)\n\nФредерік Лі Фріз, більш відомий як Фредді Фріз, OBE (англ. Frederick Lee Frith; 30 травня 1909 — 24 травня 1988, Грімсбі, Лінкольншир, Англія) — британський мотогонщик, перший MotoGP (1949 року), п'ятиразовий переможець гонки . (uk)\n\nFrederick Lee „Freddie” Frith (ur. 30 maja 1909 w Grimsby, zm. 24 maja 1988) – brytyjski kierowca motocyklowy. Jego największymi osiągnięciami było dwukrotne zdobycie Mistrzostwa Europy w klasie 350 cm³, czterokrotne zwycięstwo w wyścigu Isle of Man TT oraz zdobycie mistrzostwa świata w kategorii 350 cm³ w inauguracyjnym sezonie w 1949 roku. Po zakończeniu sezonu 1949 zakończył karierę sportową, prowadził swój sklep motocyklowy w Grimsby. Podczas drugiej wojny światowej służył jako instruktor nauki jazdy cross-country na motocyklu, dla oficerów w Kenswick. (pl)\n\nrdfs: label فريدي فريث (ar)\n\nFreddie Frith (de)\n\nFreddie Frith (en)\n\nFreddie Frith (es)\n\nFreddie Frith (fr)\n\nFreddie Frith (it)\n\nフレディー・フリース (ja)\n\nFreddie Frith (nl)\n\nFreddie Frith (pl)\n\nФриз, Фредди (ru)\n\nFreddie Frith (pt)\n\nFreddie Frith (sv)\n\nФредді Фріз (uk)"}, {"url": "https://wiki2.org/en/Ulster_Grand_Prix", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nMotorcycle race held in Northern Ireland\n\nUlster Grand Prix Venue Dundrod Circuit First race 1922 Most wins (rider) Joey Dunlop (24)\n\nThe Ulster Grand Prix is a motorcycle road race that takes place on the 7.401 mi (11.911 km) Dundrod Circuit made up entirely of closed-off public roads near Belfast, Northern Ireland, United Kingdom. According to the race organisers, it is the fastest road race in the world.[1]\n\nThe first races took place in 1922 and in 1935 and 1948 the Fédération Internationale de Motocyclisme gave it the title Grand Prix d'Europe. The Ulster Grand Prix was included as one of the races in the inaugural 1949 Grand Prix motorcycle racing season (now MotoGP), a place it held until 1971. It also counted for the Formula TT Championship between 1979 and 1990.[citation needed]\n\nThe last running of the event occurred in 2019. As a consequence of increased insurance costs and diminished sponsorship,[2] together with the COVID-19 pandemic, the future of the meeting has been called into question.[3]\n\nYouTube Encyclopedic\n\n1 / 5 Views: 362 325 77 664 5 416 9 634 143 410\n\nHICKMAN VS JOHNSTON - BEST LAP DUNDROD HAS EVER SEEN? - Ulster Grand Prix 2019\n\n🏍️⚡ ULSTER GRAND PRIX 2019 ⚡🏍️: Part 1 // King of The Roads\n\nUlster Grand Prix 1995 | Joey Dunlop wins the Superbike Race\n\nRoad Racing's Great Races | Guy Martins wins the 2006 Ulster Grand Prix\n\nCrash at Deer's Leap - 2014 Ulster Grand Prix Transcription\n\nHistory\n\n[4] The race has been held on three different circuits. The 20.5 mi (33.0 km) Old Clady circuit was used from 1922 until 1939 and included a notoriously bumpy 7 mi (11 km) straight.[4]\n\nAfter World War II the new Clady circuit was used that, due to road improvements, was now 16.467 mi (26.501 km) in length and in use between 1947 and 1952.\n\nIn 1953 the race was moved to the 7.401 mi (11.911 km) Dundrod Circuit where it is still held. The 1971 event was won by Australian Jack Findlay in what was the Ulster Grand Prix's last year as part of the FIM Grand Prix international motorcycle racing calendar. Findlay's victory on a Suzuki was also notable for marking the first 500cc class win for a motorcycle powered by a two stroke engine.[5][6] The event was cancelled in 1972 because of the political situation in Northern Ireland, but it was held in 2001 during the Foot-and-mouth crisis, even though the North West 200 and Isle of Man TT were cancelled that year.[7][8]\n\nIn 1997 Dublin sidecar pilot Stephen Galligan died of injuries sustained in a warm-up crash the day before the race. Mr Galligan died ten days later in hospital. Seven-year-old spectator Christopher McConnell-Hewitt also lost his life when he was struck by the sidecar which veered out of control on a long straight and crashed into a crowd. [9]\n\nBruce Anstey won the Superbike race at the Ulster Grand Prix in 2010, setting a new lap record of 133.977 mph (215.615 km/h), making him the fastest rider on the fastest motorcycle racing circuit in the world.[10][11]\n\nFuture in doubt\n\nAs of 2023 the future of the meeting is under threat.[12] The last running of the event was in 2019 with the following meetings being cancelled as a consequence of a lack of financial backing in addition to the Covid-19 Pandemic.\n\nIn 2020 a winding up order was issued to the Ulster Grand Prix organisers, the Dundrod & District Motorcycle Club, with the Dundrod & District having amassed debts of approximately £300,000. Following the issuing of the order the club went into liquidation.[13]\n\nIn March 2022 a potential new promotor, the Revival Racing Motorcycle Club, had signalled that they were prepared to undertake the stewardship of the meeting with a view to a return of racing in August 2022. However once again the required funding could not be secured and this resulted in the proposal being withdrawn and the 2022 race meeting was cancelled.[13][12]\n\nDuring the Autumn of 2022 a further feasibility study was undertaken by Revival Racing with a view to the running of the Ulster Grand Prix in August 2023. Whilst initial studies appeared favourable, Revival Racing subsequently found difficulty in mustering the required financing and in October 2022 issued the following starement:\n\n\"As this situation is unlikely to change in time to allow us to progress for 2023, we have therefore reluctantly withdrawn our UGP date application with the MCUI (UC).\" Revival Racing Motorcycle Club statement: Thursday October 27, 2022.[12]\n\nAn important announcement[clarification needed] was made on February 9 2023 by the Motorcycle Union of Ireland with regard to the running of motorcycle racing in Ireland for the 2023 season. This followed a significant increase in the insurance premium required to cover the events and consequently placed the 2023 racing schedule under threat of being cancelled.[14] In late April 2023 the organisers cancelled the 2023 event, citing insurance and funding problems.[15]\n\n1958, 1961, 1964–1965, 1971: Ulster Grand Prix (no official sponsor)[16]\n\nFamous riders\n\nJoey Dunlop won 24 Ulster Grand Prix races during his career, with Phillip McCallen winning 14 races, Peter Hickman with 13 wins, Bruce Anstey 12[17] and Brian Reid 9 wins.[citation needed] Some of the famous riders include: Guy Martin (11 wins) Stanley Woods (7 wins), Jimmie Guthrie, Jimmie Simpson, Artie Bell, Les Graham, Freddie Frith (3 wins), Geoff Duke (3 wins), John Surtees (6 wins), Ray Amm, Carlo Ubbiali (5 wins), Bill Lomas (3 wins), Mike Hailwood (7 wins), Giacomo Agostini (7 wins), Phil Read (3 wins), Bill Ivy (3 wins), Bob McIntyre, Gary Hocking (3 wins), Tom Herron (5 wins), Ron Haslam (5 wins), Jon Ekerold, and more recently Mick Grant, Wayne Gardner, Steve Hislop, Robert Dunlop (9 wins).\n\nFIM World Championship rounds (1949–1971)\n\nMultiple winners (riders)\n\nMultiple winners (manufacturers)\n\n# Wins Manufacturer Wins Category Years won 24 MV Agusta 500 cc 1958, 1959, 1961, 1962, 1963, 1968, 1969, 1970 350 cc 1958, 1959, 1960, 1961, 1967, 1968, 1969, 1970 250 cc 1956, 1958, 1960 125 cc 1952, 1956, 1957, 1958, 1960 13 Honda 500 cc 1966, 1967 350 cc 1962, 1963, 1964, 1966 250 cc 1961, 1962, 1963, 1967 125 cc 1961, 1962, 1966 11 Norton 500 cc 1950, 1951, 1953, 1956, 1960, 1964, 1965 350 cc 1951, 1952, 1953, 1954 8 Moto Guzzi 500 cc 1955 350 cc 1955, 1956, 1957 250 cc 1949, 1950, 1951, 1952 7 Yamaha 250 cc 1964, 1965, 1968, 1970, 1971 125 cc 1967, 1968 5 NSU 250 cc 1953, 1954, 1955 125 cc 1953, 1954 4 Suzuki 500 cc 1971 125 cc 1963, 1964, 1965 2 Velocette 350 cc 1949, 1950 Mondial 250 cc 1957 125 cc 1950 Gilera 500 cc 1952, 1957 Derbi 50 cc 1969, 1970 MZ 350 cc 1971 250 cc 1959\n\nBy year\n\nA pink background indicates a round that was not part of the Grand Prix motorcycle racing championship.\n\nFootnotes\n\n^ [18] The 1971 50cc race was cancelled as the organisers had only received eight entries. ^ [19] The 1954 500cc race was stopped due to bad weather and the race was excluded from the world championship. ^ [20] The 1951 125cc race only had four competitors and the race was excluded from the world championship.\n\nSee also\n\nReferences"}, {"url": "https://everything.explained.today/%5C/Freddie_Frith/", "page_content": "Freddie Frith Explained\n\nFrederick Lee Frith OBE (30 May 1909 - 24 May 1988 Grimsby, Lincolnshire, England)[1] [2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5]\n\nMotorcycle racing career\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[6]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results\n\n1949 point system\n\nPosition width=20 1 width=20 2 width=20 3 width=20 4 width=20 5 width=60 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0\n\nExternal links\n\nNotes and References"}]}