{"Freddie Frith retired from racing in 1947.": [{"url": "https://www.carolenash.com/news/bike-news/detail/rider-of-the-week-freddie-frith", "page_content": "Rider Of The Week focuses on an exceptional rider and Freddie Frith was up there with the greatest. Known as ‘the Galahad in leathers’ Frith gained a reputation for being a stylish and skilled racer. His accomplishments include winning the 1935 Junior Manx Grand Prix and becoming the first 350cc World Champion.\n\nEarly days\n\nFrith was born in Grimsby in 1909 and came from a well-known stonemason family. He inherited his motorcycle enthusiasm from his dad, even though he started working in the family business. He went on to become a motorbike retailer in his hometown, but he always had a need to be on the road.\n\nRacing career\n\nFrith managed to earn a sponsorship from Nigel Spring, who was part of a family known for owning a jam and curd factory. His first ride occurred in the Isle of Man at the 1930 Manx Grand Prix and he came third. The bike he rode was a 350 cc Velocette KTT. Frith enjoyed major success in 1935 when he won the Junior 350 cc.\n\nThis win inspired him to turn professional and he joined the Norton team in 1936. His success continued when he won the 1936 Junior Tourist Trophy, setting a new race record lap of 81.94 mph. He followed this up with a second place position in the Senior 500 cc race, losing out to Norton teammate Jimmie Guthrie. In 1937, Frith won the Senior TT, becoming the first man to lap the course at over ninety miles per hour.\n\nFrith served at the Infantry Driving & Maintenance School stationed in Keswick during WW2. He was set to participate in the 1947 TT, only to suffer a crash at Ballacraine during practice, dislocating his right shoulder. This stopped him from racing, but he came back strong in 1948 and won the Junior race in the European championship.\n\nIn 1949, the Moto GP was created and it became Frith’s most successful season. He went on to win every round in the Junior class, including the Isle of Man Tourist Trophy and became the first 350 cc World Champion.\n\nAt the end of the season, Frith retired, winning his final race at the Ulster Grand Prix. In 1950, he received royal honours, being awarded the OBE for his service to motorcycle racing.\n\nVery few racers can claim to go out on the top of their career, but Frith was happy with the success that he’d earned. He passed away in 1988, having lived a satisfying life."}, {"url": "https://lincsbikers.co.uk/famous-lincsbikers/freddie-frith/", "page_content": "British motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England)[1][2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5] He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.[6]\n\nMotorcycle racing career\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[7]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results\n\n1949 point system\n\nPosition 1 2 3 4 5 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0"}, {"url": "https://www.lincolnshirelife.co.uk/heritage/motorcycling-heroes/", "page_content": "Austin Munks and Freddie Frith were both at the very top of their chosen sport of motorcycle racing either side of World War Two.\n\nThey were both born during the same year, 1909, with Austin coming from Leverton in the south of the county and Freddie from Grimsby in the north. Although Austin remained an amateur throughout his career, Freddie was to turn professional, with outstanding success. Later in their lives they both proved to be successful businessmen.\n\nAustin was the youngest son of Mr and Mrs A E Munks, and his father was blacksmith of the Highgate. He was obviously always interested in speed, and started racing locally on grass and at proper hard tracks, Donington Park being the nearest. His first Isle of Man Manx Grand Prix victory came in 1933, when he won the Junior (350cc) on a Velocette – he had finished third in the Junior class on his Velocette the previous year. Three years later, in 1936, he was the first man ever to win the double, the Junior and the Senior (500cc) on Velocette and Norton machines respectively. After the war, in 1947, Austin was to secure his final Manx Grand Prix victory, winning the Lightweight class (250cc) on a Moto Guzzi, with an average speed of seventy miles per hour, setting a new record lap of 72.54mph.\n\nAustin was not only interested in motorcycle racing, flying aircraft was another of his passions. He learned to fly and obtained his pilot’s licence in 1933. He owned his own aircraft, and flew it from a strip belonging to the Bowser family at Hurn End. He became friendly with Alex Henshaw CBE, a former test pilot, and they both used this strip.\n\nAustin was to suffer a terrible shooting accident during October 1935. While he was out with an organised shoot at Asterby, one stray pellet was to hit him in his left eye, causing him to lose his sight from that eye. But this setback obviously did not slow down his racing brain, and he went on to notch up his remarkable double Manx Grand Prix wins the following year. After this he retired from racing, and of course the outbreak of the Second World War was soon to follow.\n\nWhen the hostilities ceased he was to get itchy feet again and have a crack at the race he had previously not won on the Isle of Man, the lightweight class of the Manx Grand Prix. So he bought a motorcycle of Italian manufacture, a Moto Guzzi, and the only way he could get it back was to fly to Italy himself. So off to Milan he flew in his Auster aircraft and picked up the dismantled machine – a good story he could surely tell about that experience. The machine was re-assembled by his very good friend and mechanic, Sammy Coupland of Frithville, and the rest, as they say, is history.\n\nAfter this he did finally retire from racing, and he was to sponsor a couple of local lads who were to make names for themselves in the sport. First it was R H (Dickie) Dale, from Wyberton. Dickie went on to win the following year’s Lightweight Manx Grand Prix (1948) on the same machine, Austin’s Motto Guzzi, setting an average speed of 73.36mph, and a new record lap of 74.36 in the process. Dickie was to go on and enjoy a successful career in the sport riding first for the Norton works team, then followed by spells in various continental teams, including Gilera, Benelli, MV Agusta, BMW, and Moto Guzzi (where he was especially noted for his rides on the 500cc V8 model) teams. Unfortunately he was to lose his life after a crash at the Nurburgring, Germany, in 1961.\n\nDickie was followed by Bernard Codd from Wrangle, who still farmed there until his recent death last July. Starting in trials riding, he also proved to be successful in the Isle of Man. Winning the Clubman’s Tourist Trophy double (350 and 500cc), he was the only man to achieve this unique double, during the last year these classes were held, 1956.\n\nHe was certainly a force to be reckoned with on the short circuit scene in this country. A serious crash at Crystal Palace the following year ended a very promising career. Unfortunately, he suffered a serious break to his right leg, and was bed bound for a year. The latest technology for treating such injuries had not reached these parts of the country in those days.\n\nFrederick Lee (Freddie) Frith, was born in Grimsby, into a reputable monumental and stonemason family. Like his father, who was a keen motorcyclist, he had the urge for speed. He was to enjoy the sponsorship of Nigel Spring, of the Spring family from Brigg – famous for their jam and curd factory.\n\nFrom 1936 until the outbreak of World War II he rode works machines provided by the Norton factory, and later, Velocette. He always held the reputation of being a very stylish rider, and gained such quotes from the press of the day as ‘chivalrous’ and ‘the Galahad in leathers’. His first ride in the Isle of Man was in the 1930 Manx Grand Prix, in which he was to finish third in the Junior race on a Velocette. His first win came in 1935, when he won the Junior (350cc) race – he had previously finished second to Austin in the 1933 Junior. The following year he turned professional and joined the works Norton team, with immediate success. He won, on his first attempt, the 1936 Junior Tourist Trophy, setting a new race record, and record lap at 81.94mph, making him the first man to lap the famous course at over eighty miles per hour for the Junior class. And he followed this up with a second place in the Senior (500cc) to his Norton teammate, Jimmie Guthrie. Later that season he was to go on to win the Junior (350cc class) European championship. The 1937 senior TT was to be a memorable race for Freddie; not only did he win it, but he was the first rider ever to lap the famous TT course at over ninety miles per hour (90.27mph) on his works Norton. By this time the German and Italian supercharged machines were becoming a real threat to the British manufacturers in the European championships, with George Meier winning both the 1938 and 1939 Senior class on his BMW. The 1939 Ulster Grand Prix was the last race before the Second World War intervened. In this Freddie finished second in the Senior class on his Norton, to Italian, Dorino Serafini, who was Gilera mounted.\n\nDuring the war Freddie served in the army, at the infantry driving and maintenance school at Keswick, reaching the rank of sergeant. At the first TT after the war in 1947, Freddie had secured a ride on a Moto Guzzi in the senior class. But he was to suffer a crash at Ballacraine during practice, dislocating his right shoulder, and was unable to race. In the 1948 season Freddie was back on British machinery, this time Velocette. He went on to win the Junior class in the European championship that year.\n\nIn 1949 the World Championships, now known as Moto GP, was born. There were four classes for solo machines, 125cc Ultra-Lightweight, 250cc Lightweight, 350cc Junior and 500cc Senior, and one for 600cc sidecars. It was to turn out for Freddie to be his most successful season. He went on to win every round in the Junior class, including the Isle Of Man Tourist Trophy and became the first ever 350cc World Champion. He was to retire at the end of that season, winning his final race at the Ulster Grand Prix, and setting a new record lap speed of 90.60mph in the process. When Royal honours were announced the following year (1950), Freddie was honoured for his efforts, by being awarded the OBE for his services to the sport. This made him the first person ever to receive a Royal honour for motorcycling. Geoff Duke was the next to follow him, and receive the same honour.\n\nBoth Austin and Freddie were able to prove, beyond their motorcycling endeavours, that they could run successful businesses. Austin ran his motor garage at Leverton Highgate from the 1930s and was soon to obtain the very successful Jaguar car agency. He was later to add Daimler and later still Austin/Rover to the list. On his death on 29th January 1981, he left the business to his workers. He also had a collection of vintage motorcycles, his favourite being a 1939 Brough Superior. It was later sold at a Bonham’s sale to an American collector for £42,200, well above the £30–35,000 estimate.\n\nFreddie also owned his own successful business, a motorcycle sales and repair outlet, run from the family’s original stonemason premises in Victoria Street, Grimsby, now unfortunately demolished. He was the agent for various leading manufacturers, including BMW, and was very successful for many years. He died on 24th May 1988.\n\nThese two true gentlemen have both been great ambassadors for their chosen sport and the county of Lincolnshire. We can only guess at what might have happened if the war had not interrupted their respective careers, but they have both left us with their own unique memories. The famous (or infamous) Isle of Man TT course certainly held no fears for either of these two intrepid Lincolnshire yellowbellies.\n\nREFERENCES\n\nThe Story of the Manx G S Davison (The TT. Special 1948)\n\nMotorcycle Road Racing in the Fifties A Mckinnon (Osprey Pub Ltd 1982)\n\nIsle of Man TT C. Deane (Patrick Stephens Ltd 1975)\n\nThe Book of Leverton Various\n\n(The Leverton History Group 2004)\n\nLincolnshire Archives office, Lincoln\n\nNorth Lincolnshire Archives office, Grimsby\n\nGrimsby Library"}, {"url": "https://gracesguide.co.uk/Freddie_Frith", "page_content": "Frederick Lee \"Freddie\" Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England) was a British Grand Prix motorcycle road racing world champion. A former stonemason and later a motor cycle retailer in Grimsby, he was five times winner of the Isle of Man TT. Frith had the distinction of being one of the few to win TT races before and after the Second World War.\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.\n\nSee Also"}, {"url": "https://dbpedia.org/page/Freddie_Frith", "page_content": "dbo: abstract فريدي فريث (بالإنجليزية: Freddie Frith)‏ كان متسابق دراجات نارية إنجليزي فاز ببطولة سباق الجائزة الكبرى للدراجات النارية. نافس في سباقات بطولة العالم لفئة 500 سي سي ولفئة 350 سي سي ولفئة 50 سي سي. كما شارك في كأس جزيرة مان السياحية. (ar)\n\nFrederick Lee „Freddie“ Frith, OBE (auch „Freddy“ Frith; * 30. Mai 1909 in Grimsby, England; † 24. Mai 1988 ebenda) war ein britischer Motorradrennfahrer. Während seiner aktiven Karriere war Frith für seinen eleganten Fahrstil bekannt. Er gewann zweimal die Europameisterschaft, viermal die Tourist Trophy und wurde 1949 der erste Weltmeister in der 350-cm³-Klasse der Motorrad-Weltmeisterschaft. (de)\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England) was a British Grand Prix motorcycle road racing world champion. A former stonemason and later a motor cycle retailer in Grimsby, he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War. He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours. (en)\n\nFrederick Lee Frith (Grimsby,30 de mayo de 1909 – Grimsby, 24 de mayo de 1988)​​ fue un piloto de motociclismo británico y es el primer campeón del mundo de la historia en conseguir de la categoría de 350cc en 1949.​ De profesión cantero, se dedicó después a mecánico de motos en Grimsby,​ fue un piloto estilista, que consiguió en cinco ocasiones el TT Isla de Man. Frith fue uno de los pocos pilotos en ganar la TT antes y después de la Segunda Guerra Mundial.​ (es)\n\nFrederick Lee \"Freddie\" Frith (30 mai 1909 - 24 mai 1988 Grimsby , Lincolnshire , Angleterre) était un champion du monde de course de vitesse en catégorie 350 cm3. Il a été le 1er champion du monde de la catégorie lors de sa création en 1949. Ancien tailleur de pierre et plus tard revendeur de motos à Grimsby, c'était un pilote rapide cinq fois vainqueur du TT de l'île de Man. Frith a été l'un des rares pilotes à remporter des courses du TT avant et après la Seconde Guerre mondiale. Il a été fait officier de l'Ordre de l'Empire britannique (Officer of the British Empire - OBE). (fr)\n\nFrederic L. \"Freddie\" Frith (30 maggio 1909 – Grimsby, 24 maggio 1988) è stato un pilota motociclistico britannico vincitore di un titolo nel motomondiale. (it)\n\nフレディー・フリース（Frederick L. \"Freddie\" FrithOBE、1909年3月30日‐1988年5月24日）は、イギリス・イングランドリンカンシャー州出身のオートバイレーサー。彼はロードレース世界選手権350ccクラス初代チャンピオンである。 (ja)\n\nFrederick Lee (\"Freddie\") Frith, OBE (Grimsby, 30 mei 1909 – aldaar, 24 mei 1988) was een Brits motorcoureur. Zijn beste jaar was het seizoen 1949, toen hij de allereerste wereldkampioen in de geschiedenis van de wegrace werd. (nl)\n\nFrederick Lee „Freddie” Frith (ur. 30 maja 1909 w Grimsby, zm. 24 maja 1988) – brytyjski kierowca motocyklowy. Jego największymi osiągnięciami było dwukrotne zdobycie Mistrzostwa Europy w klasie 350 cm³, czterokrotne zwycięstwo w wyścigu Isle of Man TT oraz zdobycie mistrzostwa świata w kategorii 350 cm³ w inauguracyjnym sezonie w 1949 roku. Po zakończeniu sezonu 1949 zakończył karierę sportową, prowadził swój sklep motocyklowy w Grimsby. Podczas drugiej wojny światowej służył jako instruktor nauki jazdy cross-country na motocyklu, dla oficerów w Kenswick. Odznaczony Orderem Imperium Brytyjskiego IV klasy (OBE). (pl)\n\nFrederick Lee Frith, mais conhecido como Freddie Frith, OBE (Grimsby, 30 de maio de 1909 – Grimsby, 24 de maio de 1988), foi um motociclista britânico, campeão do mundo nas 350cc. Bicampeão europeu de motovelocidade nas 350cc, com o primeiro título vindo em 1936, e o segundo em 1948 (não houve edições do campeonato entre em 1940 e 1946 devido a Segunda Guerra Mundial, a qual participou), primeiro campeão mundial de motovelocidade nas 350cc, em 1949, e seis vezes vencedor do prestigioso TT da Ilha de Man, Frith é muito lembrado como um dos poucos a terem conquistado títulos antes e depois da Segunda Guerra. (pt)\n\nФредерик Ли Фриз, более известный как Фредди Фриз (англ. Frederick Lee Frith; 30 мая 1909 — 24 мая 1988, Гримсби, Линкольншир, Англия) — британский мотогонщик, первый чемпион мира в классе 350cc MotoGP (1949 года), пятикратный победитель гонки Isle of Man TT. (ru)\n\nFreddie Frith, född den 30 maj 1909, död den 24 maj 1988 var en brittisk roadracingförare som vann 350GP 1949. (sv)\n\nФредерік Лі Фріз, більш відомий як Фредді Фріз, OBE (англ. Frederick Lee Frith; 30 травня 1909 — 24 травня 1988, Грімсбі, Лінкольншир, Англія) — британський мотогонщик, перший MotoGP (1949 року), п'ятиразовий переможець гонки . (uk)\n\ndbp: date December 2019 (en)\n\ndbp: name Freddie Frith (en)\n\ndbp: years 1936 (xsd:integer)\n\n1948 (xsd:integer)\n\n1949 (xsd:integer)\n\nrdfs: comment فريدي فريث (بالإنجليزية: Freddie Frith)‏ كان متسابق دراجات نارية إنجليزي فاز ببطولة سباق الجائزة الكبرى للدراجات النارية. نافس في سباقات بطولة العالم لفئة 500 سي سي ولفئة 350 سي سي ولفئة 50 سي سي. كما شارك في كأس جزيرة مان السياحية. (ar)\n\nFrederick Lee „Freddie“ Frith, OBE (auch „Freddy“ Frith; * 30. Mai 1909 in Grimsby, England; † 24. Mai 1988 ebenda) war ein britischer Motorradrennfahrer. Während seiner aktiven Karriere war Frith für seinen eleganten Fahrstil bekannt. Er gewann zweimal die Europameisterschaft, viermal die Tourist Trophy und wurde 1949 der erste Weltmeister in der 350-cm³-Klasse der Motorrad-Weltmeisterschaft. (de)\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England) was a British Grand Prix motorcycle road racing world champion. A former stonemason and later a motor cycle retailer in Grimsby, he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War. He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours. (en)\n\nFrederick Lee Frith (Grimsby,30 de mayo de 1909 – Grimsby, 24 de mayo de 1988)​​ fue un piloto de motociclismo británico y es el primer campeón del mundo de la historia en conseguir de la categoría de 350cc en 1949.​ De profesión cantero, se dedicó después a mecánico de motos en Grimsby,​ fue un piloto estilista, que consiguió en cinco ocasiones el TT Isla de Man. Frith fue uno de los pocos pilotos en ganar la TT antes y después de la Segunda Guerra Mundial.​ (es)\n\nFrederick Lee \"Freddie\" Frith (30 mai 1909 - 24 mai 1988 Grimsby , Lincolnshire , Angleterre) était un champion du monde de course de vitesse en catégorie 350 cm3. Il a été le 1er champion du monde de la catégorie lors de sa création en 1949. Ancien tailleur de pierre et plus tard revendeur de motos à Grimsby, c'était un pilote rapide cinq fois vainqueur du TT de l'île de Man. Frith a été l'un des rares pilotes à remporter des courses du TT avant et après la Seconde Guerre mondiale. Il a été fait officier de l'Ordre de l'Empire britannique (Officer of the British Empire - OBE). (fr)\n\nFrederic L. \"Freddie\" Frith (30 maggio 1909 – Grimsby, 24 maggio 1988) è stato un pilota motociclistico britannico vincitore di un titolo nel motomondiale. (it)\n\nフレディー・フリース（Frederick L. \"Freddie\" FrithOBE、1909年3月30日‐1988年5月24日）は、イギリス・イングランドリンカンシャー州出身のオートバイレーサー。彼はロードレース世界選手権350ccクラス初代チャンピオンである。 (ja)\n\nFrederick Lee (\"Freddie\") Frith, OBE (Grimsby, 30 mei 1909 – aldaar, 24 mei 1988) was een Brits motorcoureur. Zijn beste jaar was het seizoen 1949, toen hij de allereerste wereldkampioen in de geschiedenis van de wegrace werd. (nl)\n\nFrederick Lee Frith, mais conhecido como Freddie Frith, OBE (Grimsby, 30 de maio de 1909 – Grimsby, 24 de maio de 1988), foi um motociclista britânico, campeão do mundo nas 350cc. Bicampeão europeu de motovelocidade nas 350cc, com o primeiro título vindo em 1936, e o segundo em 1948 (não houve edições do campeonato entre em 1940 e 1946 devido a Segunda Guerra Mundial, a qual participou), primeiro campeão mundial de motovelocidade nas 350cc, em 1949, e seis vezes vencedor do prestigioso TT da Ilha de Man, Frith é muito lembrado como um dos poucos a terem conquistado títulos antes e depois da Segunda Guerra. (pt)\n\nФредерик Ли Фриз, более известный как Фредди Фриз (англ. Frederick Lee Frith; 30 мая 1909 — 24 мая 1988, Гримсби, Линкольншир, Англия) — британский мотогонщик, первый чемпион мира в классе 350cc MotoGP (1949 года), пятикратный победитель гонки Isle of Man TT. (ru)\n\nFreddie Frith, född den 30 maj 1909, död den 24 maj 1988 var en brittisk roadracingförare som vann 350GP 1949. (sv)\n\nФредерік Лі Фріз, більш відомий як Фредді Фріз, OBE (англ. Frederick Lee Frith; 30 травня 1909 — 24 травня 1988, Грімсбі, Лінкольншир, Англія) — британський мотогонщик, перший MotoGP (1949 року), п'ятиразовий переможець гонки . (uk)\n\nFrederick Lee „Freddie” Frith (ur. 30 maja 1909 w Grimsby, zm. 24 maja 1988) – brytyjski kierowca motocyklowy. Jego największymi osiągnięciami było dwukrotne zdobycie Mistrzostwa Europy w klasie 350 cm³, czterokrotne zwycięstwo w wyścigu Isle of Man TT oraz zdobycie mistrzostwa świata w kategorii 350 cm³ w inauguracyjnym sezonie w 1949 roku. Po zakończeniu sezonu 1949 zakończył karierę sportową, prowadził swój sklep motocyklowy w Grimsby. Podczas drugiej wojny światowej służył jako instruktor nauki jazdy cross-country na motocyklu, dla oficerów w Kenswick. (pl)\n\nrdfs: label فريدي فريث (ar)\n\nFreddie Frith (de)\n\nFreddie Frith (en)\n\nFreddie Frith (es)\n\nFreddie Frith (fr)\n\nFreddie Frith (it)\n\nフレディー・フリース (ja)\n\nFreddie Frith (nl)\n\nFreddie Frith (pl)\n\nФриз, Фредди (ru)\n\nFreddie Frith (pt)\n\nFreddie Frith (sv)\n\nФредді Фріз (uk)"}, {"url": "https://www.bonhams.com/auction/23955/lot/217/the-works-freddie-frith-1949-world-championship-winning-1948-and-1949-isle-of-man-junior-tt-winning1948-velocette-348cc-dohc-ktt-racing-motorcycle-frame-no-sf114-engine-no-liom-685601046/", "page_content": "• Ultra-rare DOHC factory Grand Prix racer\n\n• Impeccable pedigree and historical significance\n\n• Expertly rebuilt in 1998\n\n\n\nNo racing motorcycle has made a greater contribution to Velocette's world-wide reputation than the sensational double-overhead-camshaft 'works' KTT offered here, which the great Freddie Frith used to trounce all opposition and win the very first 350cc World Championship in 1949.\n\nFreddie Frith won five Grands Prix of the 1949 350cc World Championship on this machine, including the Isle of Man TT, although on one occasion (the Ulster Grand Prix) he used a single-overhead-camshaft engine in the same chassis. He also won the Dutch TT and the Belgian and Swiss GPs, and did not need to compete in the sixth and last race of the season (the Italian Grand Prix at Monza) having already won the Championship with maximum points.\n\n\n\nWinning the 350cc class of the FIM's inaugural World Championship was the pinnacle of Freddie Frith's career and he subsequently retired (he was by then 40 years old). He was honoured with an OBE by King George VI at the end of the year for 'services to British motorcycle racing' and 'British prestige' in general.\n\n\n\nThe works Velocettes of the late 1940s were based on the latest version of the company's immensely successful over-the-counter KTT racer: the MkVIII. With its deep petrol tank, massively finned overhead-camshaft engine and purposeful appearance, the MkVIII KTT is unquestionably one of the most beautiful racing motorcycles ever made. The talking point of Velocette's new racer on its introduction in 1939 was its swinging-arm rear suspension, an innovation first seen on the works bikes in 1936. By now tried and tested, the Velocette rear suspension comprised a pivoting fork made from tapered tubing and complemented by a pair of Dowty Oleomatic air-sprung struts. The rest of the cycle parts remained much as those of the rigid-framed MkVII.\n\n\n\nThe production Mk VIII's original engine, while basically the same as its MkVII predecessor's, incorporated a number of improvements intended to enhance power and reliability. The big-end bearing assembly had already been strengthened (after some failures on the earlier model) and despite the springer's increase in weight over the rigid machine, its superior performance and excellent handling made the MkVIII KTT a formidable competitor. Indeed, the production version differed little from the factory bikes that had dominated the 1938 Isle of Man Junior TT, Stanley Woods leading home team-mate Ted Mellors to break Norton's seven-year stranglehold on the event. Woods repeated his win the following year.\n\n\n\nDespite its pre-war design origins, the Nigel Spring-entered MkVIII KTT had proved good enough to provide Freddie Frith and Velocette with the 1948 Junior TT; however, in order to win the 350cc World Championship in 1949, a complete redesign of the valve gear was considered necessary. Velocette had first experimented with a double-overhead-camshaft (DOHC) cylinder head on the KTT-based factory bikes back in 1936 (courtesy of chief designer Charles Udall). The post-war revisit of the DOHC concept however, was instigated by Bertie Goodman, only son of company boss, Percy.\n\n\n\nThe principal advantage of the DOHC motor was its lighter and better-controlled valve gear, which enabled it to rev safely at 8,000rpm, as against the 7,200rpm maximum of the single-cam 'rocker' engines (though the latter were preferred at some circuits on account of their greater low-down torque). At 74mm x 81mm, the bore and stroke were the same as the standard KTT, but the DOHC 'double knocker' (an original term coined by team manager Harold Willis in the mid-1930s) differed considerably in its detail design. Special machined-all-over forged pistons were used while, in anticipation of higher revs, the exhaust valve was sodium-filled to dissipate heat. The post-war DOHC engines were also fitted with larger-than-standard Oldham couplings while at the same time (and for the same reason) the valve gear's vertical drive-shaft was waisted. As usual, there was the additional oil scavenge pump in the lower end of the timing cover, a normal practice on works machines, in an effort to minimise oil drag on the spinning crankshaft. For the first time since before the war there was extensive use of Elektron magnesium alloy and also, as with most of the Velocette TT and Grand Prix machines, larger capacity fuel tanks.\n\n\n\nAs well as being original thinkers, Velocette were masters of both chassis and engine development. After what can only be described as a very short 'teething' period, the engines were immediately producing significantly more power than the 'single-knockers' but with the - almost luxurious - added benefit of a turbine-smooth power delivery. On the circuit they were extremely quick, and Bertie's attention to detail clearly helped achieve this (as a good example, individual camshafts were carefully balanced with special counter-weights so as to avoid vibration within the gear trains). As with all the factory racers, a very large cylinder barrel was employed to improve cooling. In addition, to assist when climbing Snaefell Mountain at the Isle of Man TT, a batch of special gearboxes was produced, in Elektron magnesium alloy, employing modified internal ratios as used on the pre-war works machines.\n\n\n\nAccording to works mechanic Frank Panes' notes, '1046' was one of two experimental 350cc DOHC engines produced from scratch for the 1949 season. Bertie himself later stated that in total, six 350cc DOHC engines had been produced by the factory after the war (some having been converted from the earlier single-knocker works motors).\n\n\n\nWith most of Velocette Ltd's limited financial resources committed to developing the forthcoming LE model, the post-war racing effort was bankrolled by Castrol and supported by several dealers together with private entrants Nigel Spring and Dick Wilkins. Factory records show that the KTTs, which were to be ridden by Freddie Frith and Ken Bills, were invoiced to Nigel Spring on 20th May 1948 and delivered via the Premier Motor Company of Birmingham. Frith's machine was numbered 'SF114' (frame) and 'KTT 954' (engine), while Bills' was numbered 'SF129' and 'KTT 956' respectively. Interviewed by Motor Cycling in February 1948, Spring remarked that he had expected a couple of standard MkVIII KTTs, but was delighted to hear that Veloce had decided to build a limited number of special models, with 'hotted-up' engines. As works supported riders, Frith and Bills enjoyed the advantages of these special engines that had been modified by the factory. In the same Motor Cycling article, Bertie Goodman confirmed that four of these special KTTs had been made: two for the Spring équipe, and one each for Bob Foster and David Whitworth.\n\n\n\nR M N Spring was proprietor of a preserves manufacturer ('Spring's Delights') based in Brigg, Lincolnshire where it operated a large fruit processing plant. He was also a pre-war Brooklands competitor, race winner, world record holder, tuner, and sponsor, so knew a thing or two about racing motorcycles. Another Lincolnshire man, and one of the few riders to win Isle of Man TT's both before and after the war, Freddie Frith first came to prominence in 1930 when he rode a Velocette to 3rd place in the inaugural Manx Grand Prix's Junior race. In 1935 he won the Junior Manx GP on a Norton, a ride that earned him a place in Bracebridge Street's works team for '36. Freddie Frith was an instant success at the higher level, winning the 1936 Junior TT and the Senior TT in 1937, during which he became the first man to lap the Mountain Course at over 90mph.\n\n\n\nHaving spent the war years as an Army motorcycle instructor, he was tempted back into the saddle in 1947 at the age of 38 but did not compete in that year's TT following a spill in practice on a Senior Moto-Guzzi. He joined the Spring stable for 1948, and the rest, as they say, is history. A quiet, modest man, referred to consistently by all as a 'real gentlemen' Freddie Frith retired at the end of the 1949 season and opened a motorcycle dealership in Grimsby, which traded successfully for many years. He died in 1988 aged 78 and is still remembered fondly in Lincolnshire as one of the county's greatest sporting heroes.\n\n\n\nAt the end of the 1949 season, the special DOHC engines that had been on loan to Spring were returned to the factory, while the rest of the Frith Velocette, being Spring's personal property, was retained by him. (Apparently, at some point, possibly after being sold to a private owner, it was fitted with a standard KSS engine and used on the road).\n\n\n\nVelocette's exceedingly fast DOHC 350s raced on into 1950, Bob Foster winning the World Championship for the second year in succession for Hall Green, and these advanced engines were so good that they continued to be reused in more up-to-date cycle parts as development progressed. Fitted into lightweight 'low-boy' frames in 1951, they were once again raced by Foster (now in his final year) as well as up-and-coming new team members Cecil Sandford and Bill Lomas, whose machine ended up being fitted with the ex-Frith engine, 'L.IOM 68560.1046'.\n\n1951 would turn out to be the swansong of the full Velocette race team (in 1952 Veloce Ltd were only to enter a single rider - Les Graham - in international events) and the race shop was closed down soon afterwards.\n\n\n\nUnsurprisingly, but as is so often the case with obsolescent racing machines, the works Velocettes were dismantled and the major components dispersed, their historic identities being lost in the short term. The special magnesium DOHC engines, which still retained the promise of a useful life, were all sold to private owners, and 'L.IOM 68560.1046' eventually found itself recycled into the Reynolds-framed Velocette originally built for Geoff Duke. This came about because the Duke Reynolds Velocette had been acquired as a rolling chassis by the Australian Hinton Brothers, minus its original single-knocker engine. As the Hinton's also by now owned the ex-Lomas low-boy works Velocette, they wasted no time in transferring the ultra-quick ex-Frith motor, 'L.IOM 68560.1046', into the Duke machine.\n\n\n\nHaving gone down separate paths for so many years, frame and engine have now been reunited, and the ex-Frith 350cc motor, having changed hands a multitude of times in the intervening years, has been rebuilt by the world's leading authority on the Velocette marque. Since the rebuild's completion, this beautiful historic Velocette has been ridden on the Isle of Man TT Parade Lap, at the Assen Classic TT, and at the Goodwood Festival of Speed. Presented in sound order, this turbine-smooth, docile yet exceptionally fast motorcycle is ready to parade or even race. Accompanying documentation consists of period photographs, copies of factory records, Velocette Owners Club works record extract, engine specification details, and various magazine articles.\n\n\n\nExceptional motorcycles with important race history seldom come to market, let alone ultra-rare factory racers such as that offered here, so this multiple Grand Prix-winning works DOHC KTT, originally ridden to such success by one of the sport's most iconic World Champions, represents a unique opportunity, of enormous significance for collectors, to own a genuine World Championship-winning Velocette."}, {"url": "https://wiki.alquds.edu/?query=Freddie_Frith", "page_content": "British motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England)[1][2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5] He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.[6]\n\nMotorcycle racing career [ edit ]\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[7]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results [ edit ]\n\n1949 point system\n\nPosition 1 2 3 4 5 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0"}, {"url": "https://wiki2.org/en/Freddie_Frith", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England)[1][2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5] He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.[6]\n\nYouTube Encyclopedic\n\n1 / 3 Views: 35 913 2 024 109 774\n\nIsle of Man TT 1948 - Retro Road Racing\n\nIsle of Man TT 1989 | Steve Hislop wins the Supersport 600 Race\n\nVintage Road Racing - 1929 Isle of Man TT Races Transcription\n\nMotorcycle racing career\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[7]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results\n\n1949 point system\n\nPosition 1 2 3 4 5 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0\n\nSources"}, {"url": "https://www.classicbikehub.uk/News/article/The%20-way%20-we%20-were%20-1937", "page_content": "1937 TT\n\nOn Junior race day Frith couldn’t stay with his team-mate as the flying Scot Guthrie powered his Norton around the Mountain circuit setting a new 350cc lap record of 85.18mph on lap five. Frith gamely chased him, equalling Guthrie’s new lap record on the last circuit. Crasher White completed the Norton sweep in third.\n\nFor the first time in IoM TT history a ‘foreign’ rider won the Lightweight as Italian Tenni (Moto Guzzi) took the race at a record speed and set a new class record. German Eward Kluge (DKW) led after the first lap then Stanley Woods (Moto Guzzi) took the leading position for most of the race before slowing on lap five allowing his Guzzi mounted team-mate past. Woods retired on the last lap. Ginger Wood (Excelsior) trailed in second 37 seconds adrift of Tenni with E R Thomas (DKW) third.\n\nThree riders tussled for the lead in the 500cc race, then Guthrie retired leaving his pals, Stanley Woods (Velocette) and Freddie Frith (Norton) to slug it out over the mountain course. As they started the last lap the two were tying on time, Frith threw all caution to the wind to beat Woods by 15 seconds at the flag with Crasher White (Norton) third."}, {"url": "https://www.liquisearch.com/freddie_frith", "page_content": "Freddie Frith\n\nFrederick Lee \"Freddie\" Frith OBE (born 30 May 1909 - 24 May 1988 in Grimsby, Lincolnshire, England) was a British former Grand Prix motorcycle road racing World Champion. A former stonemason and motor-trader dealer was a stylish rider and five times winner of the Isle of Man TT. Frith had the distinction of being one of the few to win TT races before and after the Second World War.\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship . In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie also has the distinction of being the first ever 350cc World Champion in 1949 when, he won all five events of the inaugural campaign.\n\nFreddie Frith, alongside other Riders from BSA; Ariel and Matchless Works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick. They taught officers and NCOs how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500cc over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Freddie's track fast-cornering ."}], "Freddie Frith continued to be involved in the sport, working as a mechanic and team manager.": [{"url": "https://www.carolenash.com/news/bike-news/detail/rider-of-the-week-freddie-frith", "page_content": "Rider Of The Week focuses on an exceptional rider and Freddie Frith was up there with the greatest. Known as ‘the Galahad in leathers’ Frith gained a reputation for being a stylish and skilled racer. His accomplishments include winning the 1935 Junior Manx Grand Prix and becoming the first 350cc World Champion.\n\nEarly days\n\nFrith was born in Grimsby in 1909 and came from a well-known stonemason family. He inherited his motorcycle enthusiasm from his dad, even though he started working in the family business. He went on to become a motorbike retailer in his hometown, but he always had a need to be on the road.\n\nRacing career\n\nFrith managed to earn a sponsorship from Nigel Spring, who was part of a family known for owning a jam and curd factory. His first ride occurred in the Isle of Man at the 1930 Manx Grand Prix and he came third. The bike he rode was a 350 cc Velocette KTT. Frith enjoyed major success in 1935 when he won the Junior 350 cc.\n\nThis win inspired him to turn professional and he joined the Norton team in 1936. His success continued when he won the 1936 Junior Tourist Trophy, setting a new race record lap of 81.94 mph. He followed this up with a second place position in the Senior 500 cc race, losing out to Norton teammate Jimmie Guthrie. In 1937, Frith won the Senior TT, becoming the first man to lap the course at over ninety miles per hour.\n\nFrith served at the Infantry Driving & Maintenance School stationed in Keswick during WW2. He was set to participate in the 1947 TT, only to suffer a crash at Ballacraine during practice, dislocating his right shoulder. This stopped him from racing, but he came back strong in 1948 and won the Junior race in the European championship.\n\nIn 1949, the Moto GP was created and it became Frith’s most successful season. He went on to win every round in the Junior class, including the Isle of Man Tourist Trophy and became the first 350 cc World Champion.\n\nAt the end of the season, Frith retired, winning his final race at the Ulster Grand Prix. In 1950, he received royal honours, being awarded the OBE for his service to motorcycle racing.\n\nVery few racers can claim to go out on the top of their career, but Frith was happy with the success that he’d earned. He passed away in 1988, having lived a satisfying life."}, {"url": "https://dbpedia.org/page/Freddie_Frith", "page_content": "dbo: abstract فريدي فريث (بالإنجليزية: Freddie Frith)‏ كان متسابق دراجات نارية إنجليزي فاز ببطولة سباق الجائزة الكبرى للدراجات النارية. نافس في سباقات بطولة العالم لفئة 500 سي سي ولفئة 350 سي سي ولفئة 50 سي سي. كما شارك في كأس جزيرة مان السياحية. (ar)\n\nFrederick Lee „Freddie“ Frith, OBE (auch „Freddy“ Frith; * 30. Mai 1909 in Grimsby, England; † 24. Mai 1988 ebenda) war ein britischer Motorradrennfahrer. Während seiner aktiven Karriere war Frith für seinen eleganten Fahrstil bekannt. Er gewann zweimal die Europameisterschaft, viermal die Tourist Trophy und wurde 1949 der erste Weltmeister in der 350-cm³-Klasse der Motorrad-Weltmeisterschaft. (de)\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England) was a British Grand Prix motorcycle road racing world champion. A former stonemason and later a motor cycle retailer in Grimsby, he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War. He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours. (en)\n\nFrederick Lee Frith (Grimsby,30 de mayo de 1909 – Grimsby, 24 de mayo de 1988)​​ fue un piloto de motociclismo británico y es el primer campeón del mundo de la historia en conseguir de la categoría de 350cc en 1949.​ De profesión cantero, se dedicó después a mecánico de motos en Grimsby,​ fue un piloto estilista, que consiguió en cinco ocasiones el TT Isla de Man. Frith fue uno de los pocos pilotos en ganar la TT antes y después de la Segunda Guerra Mundial.​ (es)\n\nFrederick Lee \"Freddie\" Frith (30 mai 1909 - 24 mai 1988 Grimsby , Lincolnshire , Angleterre) était un champion du monde de course de vitesse en catégorie 350 cm3. Il a été le 1er champion du monde de la catégorie lors de sa création en 1949. Ancien tailleur de pierre et plus tard revendeur de motos à Grimsby, c'était un pilote rapide cinq fois vainqueur du TT de l'île de Man. Frith a été l'un des rares pilotes à remporter des courses du TT avant et après la Seconde Guerre mondiale. Il a été fait officier de l'Ordre de l'Empire britannique (Officer of the British Empire - OBE). (fr)\n\nFrederic L. \"Freddie\" Frith (30 maggio 1909 – Grimsby, 24 maggio 1988) è stato un pilota motociclistico britannico vincitore di un titolo nel motomondiale. (it)\n\nフレディー・フリース（Frederick L. \"Freddie\" FrithOBE、1909年3月30日‐1988年5月24日）は、イギリス・イングランドリンカンシャー州出身のオートバイレーサー。彼はロードレース世界選手権350ccクラス初代チャンピオンである。 (ja)\n\nFrederick Lee (\"Freddie\") Frith, OBE (Grimsby, 30 mei 1909 – aldaar, 24 mei 1988) was een Brits motorcoureur. Zijn beste jaar was het seizoen 1949, toen hij de allereerste wereldkampioen in de geschiedenis van de wegrace werd. (nl)\n\nFrederick Lee „Freddie” Frith (ur. 30 maja 1909 w Grimsby, zm. 24 maja 1988) – brytyjski kierowca motocyklowy. Jego największymi osiągnięciami było dwukrotne zdobycie Mistrzostwa Europy w klasie 350 cm³, czterokrotne zwycięstwo w wyścigu Isle of Man TT oraz zdobycie mistrzostwa świata w kategorii 350 cm³ w inauguracyjnym sezonie w 1949 roku. Po zakończeniu sezonu 1949 zakończył karierę sportową, prowadził swój sklep motocyklowy w Grimsby. Podczas drugiej wojny światowej służył jako instruktor nauki jazdy cross-country na motocyklu, dla oficerów w Kenswick. Odznaczony Orderem Imperium Brytyjskiego IV klasy (OBE). (pl)\n\nFrederick Lee Frith, mais conhecido como Freddie Frith, OBE (Grimsby, 30 de maio de 1909 – Grimsby, 24 de maio de 1988), foi um motociclista britânico, campeão do mundo nas 350cc. Bicampeão europeu de motovelocidade nas 350cc, com o primeiro título vindo em 1936, e o segundo em 1948 (não houve edições do campeonato entre em 1940 e 1946 devido a Segunda Guerra Mundial, a qual participou), primeiro campeão mundial de motovelocidade nas 350cc, em 1949, e seis vezes vencedor do prestigioso TT da Ilha de Man, Frith é muito lembrado como um dos poucos a terem conquistado títulos antes e depois da Segunda Guerra. (pt)\n\nФредерик Ли Фриз, более известный как Фредди Фриз (англ. Frederick Lee Frith; 30 мая 1909 — 24 мая 1988, Гримсби, Линкольншир, Англия) — британский мотогонщик, первый чемпион мира в классе 350cc MotoGP (1949 года), пятикратный победитель гонки Isle of Man TT. (ru)\n\nFreddie Frith, född den 30 maj 1909, död den 24 maj 1988 var en brittisk roadracingförare som vann 350GP 1949. (sv)\n\nФредерік Лі Фріз, більш відомий як Фредді Фріз, OBE (англ. Frederick Lee Frith; 30 травня 1909 — 24 травня 1988, Грімсбі, Лінкольншир, Англія) — британський мотогонщик, перший MotoGP (1949 року), п'ятиразовий переможець гонки . (uk)\n\ndbp: date December 2019 (en)\n\ndbp: name Freddie Frith (en)\n\ndbp: years 1936 (xsd:integer)\n\n1948 (xsd:integer)\n\n1949 (xsd:integer)\n\nrdfs: comment فريدي فريث (بالإنجليزية: Freddie Frith)‏ كان متسابق دراجات نارية إنجليزي فاز ببطولة سباق الجائزة الكبرى للدراجات النارية. نافس في سباقات بطولة العالم لفئة 500 سي سي ولفئة 350 سي سي ولفئة 50 سي سي. كما شارك في كأس جزيرة مان السياحية. (ar)\n\nFrederick Lee „Freddie“ Frith, OBE (auch „Freddy“ Frith; * 30. Mai 1909 in Grimsby, England; † 24. Mai 1988 ebenda) war ein britischer Motorradrennfahrer. Während seiner aktiven Karriere war Frith für seinen eleganten Fahrstil bekannt. Er gewann zweimal die Europameisterschaft, viermal die Tourist Trophy und wurde 1949 der erste Weltmeister in der 350-cm³-Klasse der Motorrad-Weltmeisterschaft. (de)\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England) was a British Grand Prix motorcycle road racing world champion. A former stonemason and later a motor cycle retailer in Grimsby, he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War. He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours. (en)\n\nFrederick Lee Frith (Grimsby,30 de mayo de 1909 – Grimsby, 24 de mayo de 1988)​​ fue un piloto de motociclismo británico y es el primer campeón del mundo de la historia en conseguir de la categoría de 350cc en 1949.​ De profesión cantero, se dedicó después a mecánico de motos en Grimsby,​ fue un piloto estilista, que consiguió en cinco ocasiones el TT Isla de Man. Frith fue uno de los pocos pilotos en ganar la TT antes y después de la Segunda Guerra Mundial.​ (es)\n\nFrederick Lee \"Freddie\" Frith (30 mai 1909 - 24 mai 1988 Grimsby , Lincolnshire , Angleterre) était un champion du monde de course de vitesse en catégorie 350 cm3. Il a été le 1er champion du monde de la catégorie lors de sa création en 1949. Ancien tailleur de pierre et plus tard revendeur de motos à Grimsby, c'était un pilote rapide cinq fois vainqueur du TT de l'île de Man. Frith a été l'un des rares pilotes à remporter des courses du TT avant et après la Seconde Guerre mondiale. Il a été fait officier de l'Ordre de l'Empire britannique (Officer of the British Empire - OBE). (fr)\n\nFrederic L. \"Freddie\" Frith (30 maggio 1909 – Grimsby, 24 maggio 1988) è stato un pilota motociclistico britannico vincitore di un titolo nel motomondiale. (it)\n\nフレディー・フリース（Frederick L. \"Freddie\" FrithOBE、1909年3月30日‐1988年5月24日）は、イギリス・イングランドリンカンシャー州出身のオートバイレーサー。彼はロードレース世界選手権350ccクラス初代チャンピオンである。 (ja)\n\nFrederick Lee (\"Freddie\") Frith, OBE (Grimsby, 30 mei 1909 – aldaar, 24 mei 1988) was een Brits motorcoureur. Zijn beste jaar was het seizoen 1949, toen hij de allereerste wereldkampioen in de geschiedenis van de wegrace werd. (nl)\n\nFrederick Lee Frith, mais conhecido como Freddie Frith, OBE (Grimsby, 30 de maio de 1909 – Grimsby, 24 de maio de 1988), foi um motociclista britânico, campeão do mundo nas 350cc. Bicampeão europeu de motovelocidade nas 350cc, com o primeiro título vindo em 1936, e o segundo em 1948 (não houve edições do campeonato entre em 1940 e 1946 devido a Segunda Guerra Mundial, a qual participou), primeiro campeão mundial de motovelocidade nas 350cc, em 1949, e seis vezes vencedor do prestigioso TT da Ilha de Man, Frith é muito lembrado como um dos poucos a terem conquistado títulos antes e depois da Segunda Guerra. (pt)\n\nФредерик Ли Фриз, более известный как Фредди Фриз (англ. Frederick Lee Frith; 30 мая 1909 — 24 мая 1988, Гримсби, Линкольншир, Англия) — британский мотогонщик, первый чемпион мира в классе 350cc MotoGP (1949 года), пятикратный победитель гонки Isle of Man TT. (ru)\n\nFreddie Frith, född den 30 maj 1909, död den 24 maj 1988 var en brittisk roadracingförare som vann 350GP 1949. (sv)\n\nФредерік Лі Фріз, більш відомий як Фредді Фріз, OBE (англ. Frederick Lee Frith; 30 травня 1909 — 24 травня 1988, Грімсбі, Лінкольншир, Англія) — британський мотогонщик, перший MotoGP (1949 року), п'ятиразовий переможець гонки . (uk)\n\nFrederick Lee „Freddie” Frith (ur. 30 maja 1909 w Grimsby, zm. 24 maja 1988) – brytyjski kierowca motocyklowy. Jego największymi osiągnięciami było dwukrotne zdobycie Mistrzostwa Europy w klasie 350 cm³, czterokrotne zwycięstwo w wyścigu Isle of Man TT oraz zdobycie mistrzostwa świata w kategorii 350 cm³ w inauguracyjnym sezonie w 1949 roku. Po zakończeniu sezonu 1949 zakończył karierę sportową, prowadził swój sklep motocyklowy w Grimsby. Podczas drugiej wojny światowej służył jako instruktor nauki jazdy cross-country na motocyklu, dla oficerów w Kenswick. (pl)\n\nrdfs: label فريدي فريث (ar)\n\nFreddie Frith (de)\n\nFreddie Frith (en)\n\nFreddie Frith (es)\n\nFreddie Frith (fr)\n\nFreddie Frith (it)\n\nフレディー・フリース (ja)\n\nFreddie Frith (nl)\n\nFreddie Frith (pl)\n\nФриз, Фредди (ru)\n\nFreddie Frith (pt)\n\nFreddie Frith (sv)\n\nФредді Фріз (uk)"}, {"url": "https://www.lincolnshirelife.co.uk/heritage/motorcycling-heroes/", "page_content": "Austin Munks and Freddie Frith were both at the very top of their chosen sport of motorcycle racing either side of World War Two.\n\nThey were both born during the same year, 1909, with Austin coming from Leverton in the south of the county and Freddie from Grimsby in the north. Although Austin remained an amateur throughout his career, Freddie was to turn professional, with outstanding success. Later in their lives they both proved to be successful businessmen.\n\nAustin was the youngest son of Mr and Mrs A E Munks, and his father was blacksmith of the Highgate. He was obviously always interested in speed, and started racing locally on grass and at proper hard tracks, Donington Park being the nearest. His first Isle of Man Manx Grand Prix victory came in 1933, when he won the Junior (350cc) on a Velocette – he had finished third in the Junior class on his Velocette the previous year. Three years later, in 1936, he was the first man ever to win the double, the Junior and the Senior (500cc) on Velocette and Norton machines respectively. After the war, in 1947, Austin was to secure his final Manx Grand Prix victory, winning the Lightweight class (250cc) on a Moto Guzzi, with an average speed of seventy miles per hour, setting a new record lap of 72.54mph.\n\nAustin was not only interested in motorcycle racing, flying aircraft was another of his passions. He learned to fly and obtained his pilot’s licence in 1933. He owned his own aircraft, and flew it from a strip belonging to the Bowser family at Hurn End. He became friendly with Alex Henshaw CBE, a former test pilot, and they both used this strip.\n\nAustin was to suffer a terrible shooting accident during October 1935. While he was out with an organised shoot at Asterby, one stray pellet was to hit him in his left eye, causing him to lose his sight from that eye. But this setback obviously did not slow down his racing brain, and he went on to notch up his remarkable double Manx Grand Prix wins the following year. After this he retired from racing, and of course the outbreak of the Second World War was soon to follow.\n\nWhen the hostilities ceased he was to get itchy feet again and have a crack at the race he had previously not won on the Isle of Man, the lightweight class of the Manx Grand Prix. So he bought a motorcycle of Italian manufacture, a Moto Guzzi, and the only way he could get it back was to fly to Italy himself. So off to Milan he flew in his Auster aircraft and picked up the dismantled machine – a good story he could surely tell about that experience. The machine was re-assembled by his very good friend and mechanic, Sammy Coupland of Frithville, and the rest, as they say, is history.\n\nAfter this he did finally retire from racing, and he was to sponsor a couple of local lads who were to make names for themselves in the sport. First it was R H (Dickie) Dale, from Wyberton. Dickie went on to win the following year’s Lightweight Manx Grand Prix (1948) on the same machine, Austin’s Motto Guzzi, setting an average speed of 73.36mph, and a new record lap of 74.36 in the process. Dickie was to go on and enjoy a successful career in the sport riding first for the Norton works team, then followed by spells in various continental teams, including Gilera, Benelli, MV Agusta, BMW, and Moto Guzzi (where he was especially noted for his rides on the 500cc V8 model) teams. Unfortunately he was to lose his life after a crash at the Nurburgring, Germany, in 1961.\n\nDickie was followed by Bernard Codd from Wrangle, who still farmed there until his recent death last July. Starting in trials riding, he also proved to be successful in the Isle of Man. Winning the Clubman’s Tourist Trophy double (350 and 500cc), he was the only man to achieve this unique double, during the last year these classes were held, 1956.\n\nHe was certainly a force to be reckoned with on the short circuit scene in this country. A serious crash at Crystal Palace the following year ended a very promising career. Unfortunately, he suffered a serious break to his right leg, and was bed bound for a year. The latest technology for treating such injuries had not reached these parts of the country in those days.\n\nFrederick Lee (Freddie) Frith, was born in Grimsby, into a reputable monumental and stonemason family. Like his father, who was a keen motorcyclist, he had the urge for speed. He was to enjoy the sponsorship of Nigel Spring, of the Spring family from Brigg – famous for their jam and curd factory.\n\nFrom 1936 until the outbreak of World War II he rode works machines provided by the Norton factory, and later, Velocette. He always held the reputation of being a very stylish rider, and gained such quotes from the press of the day as ‘chivalrous’ and ‘the Galahad in leathers’. His first ride in the Isle of Man was in the 1930 Manx Grand Prix, in which he was to finish third in the Junior race on a Velocette. His first win came in 1935, when he won the Junior (350cc) race – he had previously finished second to Austin in the 1933 Junior. The following year he turned professional and joined the works Norton team, with immediate success. He won, on his first attempt, the 1936 Junior Tourist Trophy, setting a new race record, and record lap at 81.94mph, making him the first man to lap the famous course at over eighty miles per hour for the Junior class. And he followed this up with a second place in the Senior (500cc) to his Norton teammate, Jimmie Guthrie. Later that season he was to go on to win the Junior (350cc class) European championship. The 1937 senior TT was to be a memorable race for Freddie; not only did he win it, but he was the first rider ever to lap the famous TT course at over ninety miles per hour (90.27mph) on his works Norton. By this time the German and Italian supercharged machines were becoming a real threat to the British manufacturers in the European championships, with George Meier winning both the 1938 and 1939 Senior class on his BMW. The 1939 Ulster Grand Prix was the last race before the Second World War intervened. In this Freddie finished second in the Senior class on his Norton, to Italian, Dorino Serafini, who was Gilera mounted.\n\nDuring the war Freddie served in the army, at the infantry driving and maintenance school at Keswick, reaching the rank of sergeant. At the first TT after the war in 1947, Freddie had secured a ride on a Moto Guzzi in the senior class. But he was to suffer a crash at Ballacraine during practice, dislocating his right shoulder, and was unable to race. In the 1948 season Freddie was back on British machinery, this time Velocette. He went on to win the Junior class in the European championship that year.\n\nIn 1949 the World Championships, now known as Moto GP, was born. There were four classes for solo machines, 125cc Ultra-Lightweight, 250cc Lightweight, 350cc Junior and 500cc Senior, and one for 600cc sidecars. It was to turn out for Freddie to be his most successful season. He went on to win every round in the Junior class, including the Isle Of Man Tourist Trophy and became the first ever 350cc World Champion. He was to retire at the end of that season, winning his final race at the Ulster Grand Prix, and setting a new record lap speed of 90.60mph in the process. When Royal honours were announced the following year (1950), Freddie was honoured for his efforts, by being awarded the OBE for his services to the sport. This made him the first person ever to receive a Royal honour for motorcycling. Geoff Duke was the next to follow him, and receive the same honour.\n\nBoth Austin and Freddie were able to prove, beyond their motorcycling endeavours, that they could run successful businesses. Austin ran his motor garage at Leverton Highgate from the 1930s and was soon to obtain the very successful Jaguar car agency. He was later to add Daimler and later still Austin/Rover to the list. On his death on 29th January 1981, he left the business to his workers. He also had a collection of vintage motorcycles, his favourite being a 1939 Brough Superior. It was later sold at a Bonham’s sale to an American collector for £42,200, well above the £30–35,000 estimate.\n\nFreddie also owned his own successful business, a motorcycle sales and repair outlet, run from the family’s original stonemason premises in Victoria Street, Grimsby, now unfortunately demolished. He was the agent for various leading manufacturers, including BMW, and was very successful for many years. He died on 24th May 1988.\n\nThese two true gentlemen have both been great ambassadors for their chosen sport and the county of Lincolnshire. We can only guess at what might have happened if the war had not interrupted their respective careers, but they have both left us with their own unique memories. The famous (or infamous) Isle of Man TT course certainly held no fears for either of these two intrepid Lincolnshire yellowbellies.\n\nREFERENCES\n\nThe Story of the Manx G S Davison (The TT. Special 1948)\n\nMotorcycle Road Racing in the Fifties A Mckinnon (Osprey Pub Ltd 1982)\n\nIsle of Man TT C. Deane (Patrick Stephens Ltd 1975)\n\nThe Book of Leverton Various\n\n(The Leverton History Group 2004)\n\nLincolnshire Archives office, Lincoln\n\nNorth Lincolnshire Archives office, Grimsby\n\nGrimsby Library"}, {"url": "https://lincsbikers.co.uk/famous-lincsbikers/freddie-frith/", "page_content": "British motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England)[1][2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5] He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.[6]\n\nMotorcycle racing career\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[7]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results\n\n1949 point system\n\nPosition 1 2 3 4 5 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0"}, {"url": "https://www.howold.co/person/freddie-frith/biography", "page_content": "Freddie Frith Biography\n\nBritish motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England) was a British Grand Prix motorcycle road racing world champion. A former stonemason and later a motor cycle retailer in Grimsby, he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War. He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.\n\nMotorcycle racing career\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350:cc Velocette KTT in the Junior event, finishing third at a speed of 60.34:mph. He retired from the 500:cc race with a blown engine, again riding his 350, when holding third place.\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90:mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results\n\n1949 point system\n\n(key) (Races in italics indicate fastest lap)\n\nSources\n\nExternal links"}, {"url": "https://everything.explained.today/%5C/Freddie_Frith/", "page_content": "Freddie Frith Explained\n\nFrederick Lee Frith OBE (30 May 1909 - 24 May 1988 Grimsby, Lincolnshire, England)[1] [2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5]\n\nMotorcycle racing career\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[6]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results\n\n1949 point system\n\nPosition width=20 1 width=20 2 width=20 3 width=20 4 width=20 5 width=60 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0\n\nExternal links\n\nNotes and References"}, {"url": "https://wiki2.org/en/Freddie_Frith", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish motorcycle racer\n\nFrederick Lee Frith OBE (30 May 1909 – 24 May 1988 Grimsby, Lincolnshire, England)[1][2] was a British Grand Prix motorcycle road racing world champion.[3] A former stonemason and later a motor cycle retailer in Grimsby,[4] he was a stylish rider and five times winner of the Isle of Man TT. Frith was one of the few to win TT races before and after the Second World War.[5] He was appointed an Officer of the Order of the British Empire (OBE) in the 1950 Birthday Honours.[6]\n\nYouTube Encyclopedic\n\n1 / 3 Views: 35 913 2 024 109 774\n\nIsle of Man TT 1948 - Retro Road Racing\n\nIsle of Man TT 1989 | Steve Hislop wins the Supersport 600 Race\n\nVintage Road Racing - 1929 Isle of Man TT Races Transcription\n\nMotorcycle racing career\n\nFrith entered his first major race, the first Manx Grand Prix in 1930 riding an over-the counter, 350 cc Velocette KTT in the Junior event, finishing third at a speed of 60.34 mph. He retired from the 500 cc race with a blown engine, again riding his 350, when holding third place.[7]\n\nHe won the 1935 Junior Manx Grand Prix and then joined the Norton team for the 1936 TT Races. It was a winning combination as he claimed the Junior TT and finished second in the Senior TT as well as winning the 350cc European Championship. In 1937 he went one better in the Senior and took a brilliant win and setting the first 90 mph plus lap of the Snaefell Mountain Course.\n\nAfter finishing third in the 1939 Senior he missed the 1947 TT due to a practice spill on a 500cc Moto Guzzi. Turning to Velocettes in 1948 he won the Junior Race, repeating this success a year later. Freddie was the first ever 350cc World Champion in 1949, winning all five events of the inaugural campaign, using a single-overhead-camshaft engine in the Ulster race.\n\nFrith, alongside other riders from BSA, Ariel and Matchless works teams, served in the army during World War 2 at the Infantry Driving & Maintenance School stationed at Keswick, where officers and NCOs learned how to ride cross-country. Sgt. Freddie Frith taught teams of four on Norton 500s over Skiddaw in all weathers. A special treat on the last day was reserved for roadwork, following Frith's track-style fast cornering.\n\nMotorcycle Grand Prix results\n\n1949 point system\n\nPosition 1 2 3 4 5 Fastest lap Points 10 8 7 6 5 1\n\n(key) (Races in italics indicate fastest lap)\n\nYear Class Team 1 2 3 4 5 6 Points Rank Wins 1949 350cc Velocette IOM\n\n1 SUI\n\n1 NED\n\n1 BEL\n\n1 ULS\n\n1 33 1st 5 500cc Velocette IOM\n\nNC SUI\n\n5 NED\n\n- BEL\n\n- ULS\n\n- NAT\n\n- 5 11th 0\n\nSources"}, {"url": "https://www.bonhams.com/auction/23955/lot/217/the-works-freddie-frith-1949-world-championship-winning-1948-and-1949-isle-of-man-junior-tt-winning1948-velocette-348cc-dohc-ktt-racing-motorcycle-frame-no-sf114-engine-no-liom-685601046/", "page_content": "• Ultra-rare DOHC factory Grand Prix racer\n\n• Impeccable pedigree and historical significance\n\n• Expertly rebuilt in 1998\n\n\n\nNo racing motorcycle has made a greater contribution to Velocette's world-wide reputation than the sensational double-overhead-camshaft 'works' KTT offered here, which the great Freddie Frith used to trounce all opposition and win the very first 350cc World Championship in 1949.\n\nFreddie Frith won five Grands Prix of the 1949 350cc World Championship on this machine, including the Isle of Man TT, although on one occasion (the Ulster Grand Prix) he used a single-overhead-camshaft engine in the same chassis. He also won the Dutch TT and the Belgian and Swiss GPs, and did not need to compete in the sixth and last race of the season (the Italian Grand Prix at Monza) having already won the Championship with maximum points.\n\n\n\nWinning the 350cc class of the FIM's inaugural World Championship was the pinnacle of Freddie Frith's career and he subsequently retired (he was by then 40 years old). He was honoured with an OBE by King George VI at the end of the year for 'services to British motorcycle racing' and 'British prestige' in general.\n\n\n\nThe works Velocettes of the late 1940s were based on the latest version of the company's immensely successful over-the-counter KTT racer: the MkVIII. With its deep petrol tank, massively finned overhead-camshaft engine and purposeful appearance, the MkVIII KTT is unquestionably one of the most beautiful racing motorcycles ever made. The talking point of Velocette's new racer on its introduction in 1939 was its swinging-arm rear suspension, an innovation first seen on the works bikes in 1936. By now tried and tested, the Velocette rear suspension comprised a pivoting fork made from tapered tubing and complemented by a pair of Dowty Oleomatic air-sprung struts. The rest of the cycle parts remained much as those of the rigid-framed MkVII.\n\n\n\nThe production Mk VIII's original engine, while basically the same as its MkVII predecessor's, incorporated a number of improvements intended to enhance power and reliability. The big-end bearing assembly had already been strengthened (after some failures on the earlier model) and despite the springer's increase in weight over the rigid machine, its superior performance and excellent handling made the MkVIII KTT a formidable competitor. Indeed, the production version differed little from the factory bikes that had dominated the 1938 Isle of Man Junior TT, Stanley Woods leading home team-mate Ted Mellors to break Norton's seven-year stranglehold on the event. Woods repeated his win the following year.\n\n\n\nDespite its pre-war design origins, the Nigel Spring-entered MkVIII KTT had proved good enough to provide Freddie Frith and Velocette with the 1948 Junior TT; however, in order to win the 350cc World Championship in 1949, a complete redesign of the valve gear was considered necessary. Velocette had first experimented with a double-overhead-camshaft (DOHC) cylinder head on the KTT-based factory bikes back in 1936 (courtesy of chief designer Charles Udall). The post-war revisit of the DOHC concept however, was instigated by Bertie Goodman, only son of company boss, Percy.\n\n\n\nThe principal advantage of the DOHC motor was its lighter and better-controlled valve gear, which enabled it to rev safely at 8,000rpm, as against the 7,200rpm maximum of the single-cam 'rocker' engines (though the latter were preferred at some circuits on account of their greater low-down torque). At 74mm x 81mm, the bore and stroke were the same as the standard KTT, but the DOHC 'double knocker' (an original term coined by team manager Harold Willis in the mid-1930s) differed considerably in its detail design. Special machined-all-over forged pistons were used while, in anticipation of higher revs, the exhaust valve was sodium-filled to dissipate heat. The post-war DOHC engines were also fitted with larger-than-standard Oldham couplings while at the same time (and for the same reason) the valve gear's vertical drive-shaft was waisted. As usual, there was the additional oil scavenge pump in the lower end of the timing cover, a normal practice on works machines, in an effort to minimise oil drag on the spinning crankshaft. For the first time since before the war there was extensive use of Elektron magnesium alloy and also, as with most of the Velocette TT and Grand Prix machines, larger capacity fuel tanks.\n\n\n\nAs well as being original thinkers, Velocette were masters of both chassis and engine development. After what can only be described as a very short 'teething' period, the engines were immediately producing significantly more power than the 'single-knockers' but with the - almost luxurious - added benefit of a turbine-smooth power delivery. On the circuit they were extremely quick, and Bertie's attention to detail clearly helped achieve this (as a good example, individual camshafts were carefully balanced with special counter-weights so as to avoid vibration within the gear trains). As with all the factory racers, a very large cylinder barrel was employed to improve cooling. In addition, to assist when climbing Snaefell Mountain at the Isle of Man TT, a batch of special gearboxes was produced, in Elektron magnesium alloy, employing modified internal ratios as used on the pre-war works machines.\n\n\n\nAccording to works mechanic Frank Panes' notes, '1046' was one of two experimental 350cc DOHC engines produced from scratch for the 1949 season. Bertie himself later stated that in total, six 350cc DOHC engines had been produced by the factory after the war (some having been converted from the earlier single-knocker works motors).\n\n\n\nWith most of Velocette Ltd's limited financial resources committed to developing the forthcoming LE model, the post-war racing effort was bankrolled by Castrol and supported by several dealers together with private entrants Nigel Spring and Dick Wilkins. Factory records show that the KTTs, which were to be ridden by Freddie Frith and Ken Bills, were invoiced to Nigel Spring on 20th May 1948 and delivered via the Premier Motor Company of Birmingham. Frith's machine was numbered 'SF114' (frame) and 'KTT 954' (engine), while Bills' was numbered 'SF129' and 'KTT 956' respectively. Interviewed by Motor Cycling in February 1948, Spring remarked that he had expected a couple of standard MkVIII KTTs, but was delighted to hear that Veloce had decided to build a limited number of special models, with 'hotted-up' engines. As works supported riders, Frith and Bills enjoyed the advantages of these special engines that had been modified by the factory. In the same Motor Cycling article, Bertie Goodman confirmed that four of these special KTTs had been made: two for the Spring équipe, and one each for Bob Foster and David Whitworth.\n\n\n\nR M N Spring was proprietor of a preserves manufacturer ('Spring's Delights') based in Brigg, Lincolnshire where it operated a large fruit processing plant. He was also a pre-war Brooklands competitor, race winner, world record holder, tuner, and sponsor, so knew a thing or two about racing motorcycles. Another Lincolnshire man, and one of the few riders to win Isle of Man TT's both before and after the war, Freddie Frith first came to prominence in 1930 when he rode a Velocette to 3rd place in the inaugural Manx Grand Prix's Junior race. In 1935 he won the Junior Manx GP on a Norton, a ride that earned him a place in Bracebridge Street's works team for '36. Freddie Frith was an instant success at the higher level, winning the 1936 Junior TT and the Senior TT in 1937, during which he became the first man to lap the Mountain Course at over 90mph.\n\n\n\nHaving spent the war years as an Army motorcycle instructor, he was tempted back into the saddle in 1947 at the age of 38 but did not compete in that year's TT following a spill in practice on a Senior Moto-Guzzi. He joined the Spring stable for 1948, and the rest, as they say, is history. A quiet, modest man, referred to consistently by all as a 'real gentlemen' Freddie Frith retired at the end of the 1949 season and opened a motorcycle dealership in Grimsby, which traded successfully for many years. He died in 1988 aged 78 and is still remembered fondly in Lincolnshire as one of the county's greatest sporting heroes.\n\n\n\nAt the end of the 1949 season, the special DOHC engines that had been on loan to Spring were returned to the factory, while the rest of the Frith Velocette, being Spring's personal property, was retained by him. (Apparently, at some point, possibly after being sold to a private owner, it was fitted with a standard KSS engine and used on the road).\n\n\n\nVelocette's exceedingly fast DOHC 350s raced on into 1950, Bob Foster winning the World Championship for the second year in succession for Hall Green, and these advanced engines were so good that they continued to be reused in more up-to-date cycle parts as development progressed. Fitted into lightweight 'low-boy' frames in 1951, they were once again raced by Foster (now in his final year) as well as up-and-coming new team members Cecil Sandford and Bill Lomas, whose machine ended up being fitted with the ex-Frith engine, 'L.IOM 68560.1046'.\n\n1951 would turn out to be the swansong of the full Velocette race team (in 1952 Veloce Ltd were only to enter a single rider - Les Graham - in international events) and the race shop was closed down soon afterwards.\n\n\n\nUnsurprisingly, but as is so often the case with obsolescent racing machines, the works Velocettes were dismantled and the major components dispersed, their historic identities being lost in the short term. The special magnesium DOHC engines, which still retained the promise of a useful life, were all sold to private owners, and 'L.IOM 68560.1046' eventually found itself recycled into the Reynolds-framed Velocette originally built for Geoff Duke. This came about because the Duke Reynolds Velocette had been acquired as a rolling chassis by the Australian Hinton Brothers, minus its original single-knocker engine. As the Hinton's also by now owned the ex-Lomas low-boy works Velocette, they wasted no time in transferring the ultra-quick ex-Frith motor, 'L.IOM 68560.1046', into the Duke machine.\n\n\n\nHaving gone down separate paths for so many years, frame and engine have now been reunited, and the ex-Frith 350cc motor, having changed hands a multitude of times in the intervening years, has been rebuilt by the world's leading authority on the Velocette marque. Since the rebuild's completion, this beautiful historic Velocette has been ridden on the Isle of Man TT Parade Lap, at the Assen Classic TT, and at the Goodwood Festival of Speed. Presented in sound order, this turbine-smooth, docile yet exceptionally fast motorcycle is ready to parade or even race. Accompanying documentation consists of period photographs, copies of factory records, Velocette Owners Club works record extract, engine specification details, and various magazine articles.\n\n\n\nExceptional motorcycles with important race history seldom come to market, let alone ultra-rare factory racers such as that offered here, so this multiple Grand Prix-winning works DOHC KTT, originally ridden to such success by one of the sport's most iconic World Champions, represents a unique opportunity, of enormous significance for collectors, to own a genuine World Championship-winning Velocette."}, {"url": "https://www.motorsportmagazine.com/archive/article/august-2020/108/norton-riding-back-from-the-brink/", "page_content": "Britain ruled the world of motorcycling for much of the 20th century. AJS, BSA, Matchless, New Imperial, Panther, Royal Enfield, Sunbeam, Triumph, Velocette, Vincent-HRD and many other British marques were the envy of the world. But one name always stood out: Norton.\n\nThere was a simple reason for Norton’s prominence: the Birmingham brand went racing from the very beginning and never really stopped. As one rival manufacturer said, “the market always follows the chequered flag”.\n\nJames Lansdowne Norton’s embryonic enterprise won the twin-cylinder class at the inaugural 1907 Isle of Man TT, dominated grand prix and TT racing from the 1920s to the outbreak of World War II, won several world championships in the 1950s, took its last grand prix victory in 1969 and its final TT successes in 1973 and ’92. Even in the company’s most recent and troubling guise, Norton continued to go racing.\n\nThrough all these ups and downs, Norton enjoyed its greatest days either side of WWII. During this period, the company’s stark and hugely effective single-cylinder racers were the dominant force wherever they went, from British short circuits to the Isle of Man and over the English Channel to the Continental Circus.\n\nThe overhead-cam single was designed by Walter Moore, who joined Norton in 1924 intending to return the company to its former glories following a lull in results. Moore was pragmatic and hands-on. His first task was to fix a rear-brake problem with the existing Model 18 overhead-valve racer, so he bought a job lot of Ford Model T brake drums and modified them to suit.\n\nMoore wanted to learn how engines behaved during races, so he became a sidecar passenger. Paired with Brooklands regular George Tucker, he won the 1924 three-wheeler TT. The engine that Moore designed – with an iron cylinder and head, overhead cam, bevel-driven valves and Sturmey-Archer three-speed gearbox – won the Senior TT first time out in 1927.\n\nTwo years later, Moore’s engine, which was fast but noisy (riders called it the ‘clanker’) and prone to overheating, was redrawn to great effect. Between 1931-69 Norton 500cc and 350cc singles won 28 TTs, 41 world championship grands prix and countless internationals, defeating supercharged BMW twins and four-cylinder Gileras and MV Agustas along the way. That’s four decades at the top – no other machine has dominated the racing consciousness for so long.\n\nGeoff Duke won world championships on Norton singles, Mike Hailwood, Phil Read and Stanley Woods won TTs on the machines, and Achille Varzi, Tazio Nuvolari and Piero Taruffi won continental races with them before moving into car racing.\n\nDuring the interwar years, British brands enjoyed an important development advantage over foreign rivals. Brooklands and the Isle of Man TT course were effectively open-air engine and chassis dynos, allowing British engineers to learn more about going fast than their European rivals.\n\nBikes were developed at Brooklands, raced at the TT and then transformed into production models. Norton was so aware of the importance of Brooklands that it established a race shop at the track, 125 miles from the factory in Bracebridge Street, Birmingham.\n\nHiring the best riders was also important, and their services weren’t always acquired through conventional means. In 1923, Norton team manager Don ‘Wizard’ O’Donovan was on the lookout for a new rider. He found him while driving to the shops in Weybridge, just down the road from Brooklands.\n\nAs O’Donovan turned a corner in his Morris Cowley, he came face to face with a wild young motorcyclist, slewing his Douglas motorcycle across the road, with a package of meat strapped to its rear. After a few enquiries he hired the butcher’s boy, Bert Denly, who went on to take countless race victories and records for Norton.\n\nDuring the 1930s, Norton came to utterly dominate the Isle of Man TT. But by the outbreak of war, there was little doubt that the single’s day was over: BMW’s supercharged boxer twin had won the 1939 Senior TT, and Gilera’s supercharged straight-four won the ’39 500cc European Championship.\n\nCoincidentally the devastation of WWII delayed the demise of Norton’s naturally aspirated single. Grand prix rules were rewritten to adapt to the circumstances of a peaceful, but shattered, Europe. Supercharging was outlawed, and machines were required to use low-grade pool petrol. Both these changes hurt the European manufacturers more than Norton.\n\nNo one was happy about detuning their engines for the 72-octane fuel, including Norton team manager and chief development engineer Joe Craig. But Craig was able to manage the situation better than his rivals.\n\nWhile Gilera grappled with its straight- four, now without blower, Craig concentrated on eking more and more power out of his ancient but well-established engine.\n\n“With over 30 years of experience, Joe’s practical knowledge gave him the ability to read combustion chamber colours to the nth-degree,” recalled Norton factory rider Rod Coleman. “Consequently, his engines always ran at absolute maximum compression ratio, fed with the leanest mixture. This enabled Norton to keep ahead of the multi-cylinder opposition for much longer than should have been possible.\n\n“Plus, of course, the very simple design, which allowed the cam box and cylinder head to be removed, and the combustion chamber studied by the side of the road. Sometimes during practice, the Norton team located itself around the back of the circuit, where a mechanic would remove the cylinder head, Craig would inspect it, then ask the mechanic to add or remove a cylinder base shim. The fours required workshop facilities to do this, so they were run well on the conservative side of compression ratio because the fuel octane supplied at each circuit varied so much.”\n\nCraig, who rode for Norton in the 1920s and masterminded its successes from the ’30s to the ’50s, was a gruff, no-nonsense character from Ballymena in Northern Ireland.\n\n“Joe knew exactly what he wanted,” said Tim Hunt, who did the Junior/Senior TT double for Norton in 1931. “I remember him complaining to the Lucas rep about their magnetos. He said there were three good things about Lucas magnetos: the box they came in, the paper the package was wrapped in, and the string it was tied with.”\n\nAlthough Craig’s speciality was painstaking trial-and-error development rather than design, he always made use of the latest thinking to keep Norton competitive. He gradually widened the bore and shortened the stroke of the 500 and 350 to use larger valves and more revs. He also developed a DOHC head, filled valves with metallic sodium for improved cooling and replaced internal flywheels with external flywheels to reduce oil drag and save weight.\n\nHowever, logical and patient engine development wouldn’t keep Gilera at bay forever. What Craig needed was a scientist. He found him in Leo Kuzmicki, a Polish engineer with a keen understanding of flame propagation in combustion chambers.\n\nKuzmicki endured a traumatic war. After joining the Polish Air Force, he was captured by the Russians and spent several years in an NKVD labour camp in Uzbekistan. Kuzmicki would later make his way to Britain via Bombay. He spent the final years of the war fettling Hurricane fighters and Sterling, Wellington and Lancaster bombers. After joining Norton in 1949 – the inaugural year of the world championships – he worked his magic on the 500 and 350, increasing horsepower by 30 per cent.\n\nTwo years later Craig, Kuzmicki and two other forces of nature took Norton to the pinnacle of the sport: the 500cc world title.\n\nAt the end of 1949, Norton had signed 26-year-old rider Geoff Duke. The Lancashire youngster’s skills were already supreme, so he should have won the 500cc riders’ world title at his first attempt the following summer. Only two tyre failures, at Spa-Francorchamps and Assen, stopped him.\n\nIn 1951, Norton did beat Gilera’s mighty four, thanks to Duke’s talent, Craig and Kuzmicki’s brilliance and the genius of Rex McCandless, another racer turned engineer from Northern Ireland. In the ’40s, McCandless developed the first fully- sprung motorcycle chassis. He tried to sell his idea to Triumph, but while wining and dining a Triumph executive he was told the company couldn’t possibly use a “foreign” invention in its motorcycles, so McCandless upended the table in the executive’s face. Next, he went knocking at Norton’s door.\n\nDuke tried McCandless’s chassis and announced that it “set an entirely new standard in road-holding”. He was right. The all-welded frame with telescopic forks and twin hydraulic shock absorbers became the basis for motorcycle chassis design for the next three decades.\n\nThe 1951 grand prix season featured the struggle between Norton and Gilera, which was very lopsided. The British single made 40 horsepower, 25 per cent less than the Italian four. Duke remembers Gilera’s Umberto Masetti having so much power to spare that he could “pull alongside, sitting upright, while I almost had my head under the handlebars”.\n\nOn the other hand, Norton’s new chassis allowed Duke to keep his chin on the fuel tank and the throttle against the stop, whereas Masetti had to roll the throttle to maintain control of his bucking machine.\n\nBritain’s greatest racing marque claimed motorcycling’s greatest prize thanks in part to the input of three ‘foreigners’: Craig, Kuzmicki and McCandless. This was nothing new. When Norton won the twin-cylinder class at the 1907 TT, it used a French Peugeot engine, but James Lansdowne Norton erased the FP logo (for Frères Peugeot) from the crankcases to disguise its origins.\n\nNorton’s 1951 successes, the riders and constructors titles in the 500cc and 350cc world titles, were at the same time the company’s finest hour and the beginning of the end. Everyone knew that Norton’s reign would cease as soon as Gilera created its own McCandless-type chassis.\n\nNorton managing director Gilbert Smith knew he needed a four, so he entrusted car company BRM with design and development. Duke was hugely keen on the new engine because by 1952 Gilera had indeed equipped its 500 four with a fully-sprung chassis, which forced the reigning champion to take ever- greater risks to stay in the hunt.\n\nAt the end of 1952, Smith asked his star rider to extend his contract, but Duke said he would only stay if he could race the BRM four. “Gilbert admitted there was no possibility of the four being ready to race in 1953,” Duke wrote in his autobiography In Pursuit of Perfection. “I also told him that my desperate attempts to beat the Gilera fours were partly responsible for several crashes I’d had. Smith refused to accept this and suggested that my problem stemmed more from having attended too many dinners and dances.”\n\nNorton’s reign as a grand prix great was over. Duke went off in a huff to ride for Gilera, Norton didn’t have the budget to develop the BRM engine, Gilera assumed domination of the world championship and finally Norton withdrew its factory team at the end of 1954. That wasn’t quite the end of Norton as a grand prix force, of a kind.\n\nThe company continued to sell its 350cc and 500cc Manx privateer machines, which remained the backbone of world championship grids into the 1960s. For example, 55 of the 81 starters in the 1960 Senior TT rode Manx 500s, and 57 of the 97 starters in that year’s Junior TT rode Manx 350s. The standard stable for a Continental Circus rider was a 500, and 350 Manx bought each spring from Bracebridge Street, for £350 apiece. An extra £5 bought blueprinting and a bench test.\n\nThe aim of these privateers wasn’t so much to conquer the world, but rather to earn a crust by working their way around Europe, competing at grands prix and non-championship events, surviving on the meagre start and prize money.\n\nNorton’s final GP victory went to British privateer Godfrey Nash at the season-ending 1969 Adriatic GP in Yugoslavia, where the dominant MV Agusta factory was a no-show, having already secured the world title.\n\nNorton did win one more world crown, or at least part of a Norton engine did. In the early ’50s, British businessman Tony Vandervell vowed to beat Ferrari and Maserati in Formula 1, so he hired Kuzmicki to develop a straight-four engine for his Vanwall car, using four over-bored Norton top ends attached to a Rolls-Royce B40 crankcase, more usually found in Daimler Ferret armoured cars. The 2489cc Vanwall won its first F1 race in 1957, with Stirling Moss driving. The next summer Moss missed out on the drivers’ title by one point to Ferrari’s Mike Hawthorn, but Vanwall won the constructors’ title over Ferrari.\n\nFrom the 1950s, Norton’s fortunes were dictated by the ructions that tore through much of British industry. The struggling brand was sold to Associated Motor Cycles in 1952, and when AMC collapsed in 1966, it was sold to Manganese Bronze Holdings, run by former racing driver Dennis Poore.\n\nIn 1970, Poore sent Norton racing again, with a Formula 750 machine powered by a twin-cylinder Commando road-bike engine and bankrolled by Imperial Tobacco.\n\nThe key player in the first John Player Norton project was brilliant rider/engineer Peter Williams, son of AJS engineer Jack Williams. He would build a stainless-steel monocoque for the F750 machine, which he rode to victory in the 1973 F750 TT, breaking the outright Isle of Man lap record.\n\nPoore’s plans for Norton centred around an all-new water-cooled Cosworth engine, basically two cylinders off a DFV F1 unit, which would power Norton’s F750 machine and a range of sports bikes. But the engine was too big and too heavy for motorcycles and ran poorly.\n\nAt the same time things went from bad to worse for the business. Mounting losses, labour problems and a new generation of high-performance superbikes from Japan finished the company off in 1976.\n\nFor a while, at least. Poore and a skeleton staff continued working on a new rotary engine, designed to power motorcycles, drones and boats. However, Poore fell terminally ill with cancer, and Manganese Bronze sold the company in 1987. South African-born financier Philippe Le Roux, who was keen on the Norton name and the rotary project, then became the new owner.\n\nWhen development engineer Brian Crighton convinced Le Roux that the twin- rotor unit would make a great racing engine, he was allowed to create a race bike, working evenings in the kitchen of the factory caretaker’s house. The rotary quickly became a huge force in racing, encouraging Imperial Tobacco to open its chequebook once again.\n\nBy 1989, Crighton had transformed the 92-horsepower road engine into a howling 148bhp race engine that won the 1989 British TT F1 title. British fans flocked to the circuits to watch the all-British RCW588 – painted in the iconic black-and-gold JPS colours – defeat Japan’s best superbikes.\n\nIn 1992, the rotary scored its greatest success when Steve Hislop won the Senior TT. This was a historic achievement against enormous odds. Team manager Barry Symmons was not only running a race team, he also had to deal with bailiffs who were sneaking into the race shop to settle debts, which were once again piling up. “One day we arrived to find a bailiff’s truck loading up all of the mechanics’ toolboxes,” Symmons recalled. “Another time they wandered off with the CNC machine.”\n\nNeither was the rotary an easy machine to run on the racetrack. The engine was fragile, thirsty and produced power in such a way that the chassis struggled to keep up. Hislop, who lost his life in a helicopter crash in 2003, had to wrestle the machine to victory.\n\n“I was riding the bike beyond its limits – I was totally out of control at 180mph,” he wrote in his autobiography Hizzy. “At that speed, instinct takes over, and for the first time in my life, I started thinking that maybe victory wasn’t as important as living. But that soon passed, and I got my head down again.”\n\nIn early 1993, the bailiffs closed in for the kill. Norton had once again come to the end of the road.\n\nBut not for the last time…\n\nKenny Dreer’s ownership of Norton\n\nHis ownership of Norton lasted little more than a year.\n\nAmerican Kenny Dreer’s stewardship was promising. He designed a new air 961cc Commando, aimed at the growing retro market, but the bike was never made. In 2008 Dreer sold his interest to British businessman Stuart Garner, who developed and produced the 961 at his site at Donington Park.\n\nGarner (right) wanted to go racing, so he signed multiple TT winner Michael Dunlop for the 2009 TT aboard an updated rotary. The NRV588 had so many problems that Dunlop didn’t complete a practice lap.\n\nThe rotary was replaced by a new machine powered by a revised Aprilia RSV4 superbike engine, which lapped the TT course at over 130mph, but never challenged for victory. The V4 engine and a new road/race 650cc parallel twin were more recently manufactured by Chinese company Zongshen.\n\nDuring this period, Garner attracted government interest in his venture, including a £4m grant and the underwriting of a £7.5m bank loan.\n\nHowever, in January 2020, Norton collapsed into administration, amid accusations of fraud.\n\nGarner is being investigated regarding the misappropriation of £14m invested in three pension funds he had established. More than 200 people are expected to lose their life savings as a result.\n\nIn April, Indian firm TVS Motorcycles purchased Norton, which had debts of around £30m, for £16m. TVS produces around three million small- capacity units annually, including BMW-branded motorcycles. Will TVS continue Norton’s racing activities?"}, {"url": "https://www.motorsportmagazine.com/archive/article/july-1937/10/the-tt-motor-cycle-races/", "page_content": "THE T. T. MOTOR-CYCLE RACES\n\nJIMMY GUTHRIE WINS jUNIOR RACE FOR NORTON AT 84.43 M.P.H. O. TENNI WINS LIGHTWEIGHT RACE FOR GUZZI AT 74.72 M.P.H. F. L. FRITH WINS SENIOR RACE FOR NORTON AT 88.21 M.P.H.\n\nUnfortunately space is too taken up with car events for MOTOR SPORT to say much about motor-cycling matters, and in actual fact motor-cycle racing is poles apart from car-racing in a number of\n\nways. But naturally we must give a survey of what happened in the 1.0 .M. T.T. motor-cycle races, remarkable classics in which the whole sporting world is interested. The extreme interest shown in these races by manufacturers, who build special machines and modify existing ones after intense experiment, disclosing their moves often before the winter preceding the races is over, had its equal in motor-racing only in the palmy days when the French Grand Prix was at its zenith.\n\nThe Junior Race\n\nA stern Struggle between Norton and Velocette was expected to materialise in the Junior race, for these makes have for years been in the Junior In practice Frith had got round the course at 82.69 m.p.h., his Norton smashing his previous year’s race lap-record of 81.94 m.p.h. Excitement was, as usual, intense for days beforehand, at: d all forecast a win for Stanley Woodsand his Velocette. Surprisingly enough everyone weighed in to time and even the rumour that Mellors (Velocette) was too badly injured in -a practice toss to ride the race evaporated in thin air. There were forty-three entries and Mellman (N.S.U.), Vaasen (Norton) and Fleischmann (N.S.U.) were the only non-starters. As starting time approached the mountain mist receded to give 1,000 yards visibility everywhere\n\nand. the roads were drying. In these races the big field necessitates individual starting and so changes of position and the order of passage have no significance unless one understands the position as a whole. In the first lap Guthrie (Norton) broke the standing lap record by 50 secs. and Frith rode in second place on his Velo.• Third fastest was J. H. White (Norton), and the Norton-Velo. duel was on in earnest. N. P. Pope (Norton) retired, though uninjured, after leaving the model in a skid at Ballacraine, and Newman (Velocette) was four minutes curing plug trouble. Lap two saw Guthrie indisputably • ahead, with a lap-speed of 84.38 m.p.h., with Frith grimly second and now 14 secs. further away from White’s Norton, while Stanley Woods took his Velocette round at 82.34 m.p.h. to hold fourth place, with Mellors and Thomas on Velocettes behind him. The length of the T.T. lap has the curious effect of officials temporarily ” losing ” retire-, ments, but news eventually arrived that Paterson had reduced the Velocette opposition by crashing, with injuries, at the Gooseneck, whereupon Pitmington had levelled things up by vacating his Norton at lonely Windy Corner. Forbes (Norton) stopped at his pit for throttle adjustments and Rathbone (O.K. Supreme) came off at Governor’s Badge and Con tinued with bent handlebars. Guthrie\n\nnow covered another lap at record speed —84.65 m.p.h., or 26 mins. 45 secs. of concentrated effort. He led by 69 secs. On the third lap he refuelled. Woods came in for the same purpose, his goggles and numbers astonishingly fly-infested, and at the same time dashed Velocette hopes away by announcing that his rear brake was useless. Illichmann (N.S.U.) ran out of fuel and refilled to get “home,” disqualification ensuing. Frith maintained second place, Woods did wonders with one brake and Mellors retired. White lapped slower than Woods. Lap four produced sonic excitement as Woods, riding a magnificent race under the circumstances, got into third place\n\nbetween Frith’s Norton and White’s Norton. M. Simo (Terrot) came off at Glentrammon, suffering cuts and bruises, and Brett (Norton) emulated his example at Sulby Bridge, but was more fortunate and continued. Incidentally, what memories these names of the corners revive ! Lap five uthrie did at 85.18 m.p.h. after the first four men had all beaten last year’s race average by almost one mile per hour. At the close of the fourth lap, with the leading Norton’s average at 84.33 m.p.h., Guthrie was now signalled to ease up, not once but frequently, and even so he completed his last lap at one second outside his record time. On this round Frith also equalled Guthrie’s\n\nlap record. The winning Norton had functioned perfectly, taking 3 hrs. 7 mins. 42 secs., an average of 84.43 m.p.h. F. L. Frith (Norton) was second in 3 hrs. 10 mins. 17 secs. and J. H. White neatly rounded things off for Nortons with third place in 3 hrs. 12 mins. secs. Fourth came a very gallant Stanley Woods for Velocette, judged the best rider on form in the race, in 3 hrs. 12 mins. 30 secs. Of the retirements : Paterson (Velocette), Archer (Velocette), Pirmington\n\n(Norton), and Simo (Terrot) all came off without severe injury, Manders (Excelsior) had engine trouble in the first lap, H. B. Myers (Norton) lost a footrest on the first round, Noel Pope’s Norton. seized its engine at Ballacraine on lap. two, Binder’s Velocette broke its forks, Wood’s Excelsior showed a loss of power, Mellors (Velocette) experienced engine seizure, and Foster’s A. J .S. broke a fork spring. From which we can deduce that modern 350 c.c. road-racing motorcycles are extremely dependable.\n\nThe Lightweight Race\n\nLong before the race was run a GermanItalian duel was forecast, with Stanley Woods (Guzzi) a popular favourite and Britain expected to be generally overshadowed, with its faith in the Excelsiors. Thirty-three had entered, and twenty-six started, several foreign entrants having failed to materialise, and Cauchy (Guzzi) did not qualify, Illichmann (Guzzi) was withdrawn mysteriously, while Simo (Terrot) and. Paterson. had not recovered from spills in the Junior. At 11 a.m. Thomas (D.K.W.) was off and the struggle had commenced. Lap one saw a duel between Woods (Guzzi) and Thomas, with Stanley 10 secs. ahead on time at Ramsey and 15 secs. ahead at the close of the lap, while the German rider Kluge (D.K.W.) and 0. Tenni for Italy behind Kludge putting on speed to make up an initial -9 secs. disadvantage and get well ahead, leader of the field, lapping at 30 mins. 2 sees. Tenni hit something at Governor’s Bridge and left part of the Guzzi’s exhaust\n\nsystem there as a memento. Tyrell Smith had his Excelsior Manxman in third place for Britain, and the first six men. were within 25 secs. of one another. S. Renwick (O.K. Supreme) was bothered by a leaking oil-tank. Lap two saw Stanley Woods go round at 76.89 m.p.h., breaking his Lightweight (250 c.c.) lap record set up last year on a D.K.W. and giving him the lead in the race. Thomas (D.K.W.) also beat the old record with a lap at 76.54 m.p.h. Kluge hung grimly to second place a bare second behind Woods. Tenni was in fifth place and Ginger Wood (Excelsior) was sixth. Then, on the third circuit, Tenni got round in the astonishing time of 29 mins. 8 secs., an average of 77.72 m.p.h., bringing him up to fourth place. There was a thrill of a different sort when Stanley Woods refuelled in 20 secs., thereafter losing some time in restarting, whereas Kluge needed 27 secs. Tyrell Smith and Ginger Wood on the Excelsiors were third and sixth respectively and were flagged to speed up by their pit manager, Eric Fernihough himself. Tenni took second place on. the fourth lap, and only the D.K.W. team was now intact. Sensation on the fifth lap, for Kluge broke a throttle wire at Ballacraine and the German, after a magnificent ride in his first T.T. race, had no option but to retire. Woods still led, at 75.91 m.p.h., Tenni was second at 75.67 m.p.h., and Tyrell Smith’s Ex celsior was third at 75.62 m.p.h. with Thomas (D.K.W.) fourth and Woods (Excelsior) fifth. The sixth lap saw no abatement in the excitement, for although Stanley Woods led by 29 secs., Tenni was\n\nbeing frantically instructed to ride “flat.” And then came news that Woods had pass ed Ramsey mis-firing seriously. Passing the stands the Guzzi still ran irregularly and Woods gave ” thumbs-down ” to the tense crowd. Then, as a sort of preceeding to climax, Tyrell Smith’s splendid fight finished at Creg-na-Baa, where the Excelsior broke its connecting-rod. Moreover, with a lap to go—and I.O.M. laps are long laps—Tenni himself was giving the distress signal! Thomas was out with a leaking fuel tank. Britishers looked hopefully at Ginger Wood’s indicator. Tenni went on faultlessly, however, save for a close shave at Creg-na-baa, and came home, winner of the Lightweight race by 37 secs., first foreigner ever to win a T.T. He had stopped at the Bungalow to Change a plug in his last lap ! The Guzzi averaged 74.72 m.p.h. Ginger Wood came in a well deserved second on the Excelsior at 74.50 m.p.h. with E. R. Thomas (D.K.W.) third at 73.17 m.p.h. Archer’s New Imperial was fourth, Wuensche (D.K.W.) fifth, Tattersall (C.T.S.) sixth and Moore (New Imperial) seventh. S. V. Smith (Excelsior) and L. G. Martin (Cotton) qualified for first-class Replicas. Of the retirements, Warren (New Imperial), Galway (Excelsior), Goddard (O.K. Supreme), ‘Wien. (Excelsior), Cook (O.K. Supreme), Man.ders (Excelsior), England (Cotton) and Warburton (O.K. Supreme),\n\nMILAN RAGES—contd. from page 313 more, and Farina seemed to be in no hurry to catch him. Hasse was doing his best with a car that was far from being suited to the circuit, and had a terrific skid when he became engaged in a scrap with Nuvolari after the latter had lapped him. The only other incident approaching an accident was when the Hungarian. driver, Laszlo Hartmann, collided with\n\nall went out with unspecified engine trouble Pepper (Cotton) broke a cam on the first lap, Mann (C.T.S. Python) had gearbox trouble on lap three, Kluge (D.K.W.) broke that throttle wire on lap five, Whitworth (Cotton) went out on the same lap for an unstated cause. TyrellSmith (Excelsior) broke the con-rod on lap six, Woods (Guzzi) his valve spring on the same round, Sorenson (Excelsior) seized the piston on this lap, and Hartley (Rudge) and Renwick (O.K. Supreme) disappeared on the last Circuit. Thus nine out of twenty-six finished, a percentage of just over thirty-four, compared with 42 per cent. finishers last year Tenni wired to Mussolini of his victory.\n\nThe Senior\n\nThis year’s Senior race was one of the most exciting of a long series. There were twenty-three starters, but nearly all eyes were on Jimmy Guthrie (Norton), who in practice had lapped at 87.82 m.p.h., and Stanley Woods, riding a Velocette. The non-starters comprised Mellinann (N.S.U.), Barrington (Norton), Clift (Norton), Marama-Toyo (Rudge) and Fleischman.n (N.S.U.). On the first lap Guthrie did the standing lap in 25 min. 49 secs., shattering the old record of Woods’s by 13 secs. Woods was 5 sees. outside his old record and Tenni, hero of the Lightweight Race, took 27 min. 5 secs. on his Guzzi. Jock West, astride the supercharged B.M.W., Frith (Norton) and White (Norton) were shaping well, but Tattersall (Vincent H.R..G.) had a fall at Quarter Bridge, from which he recovered and went on. From now on the contest was just terrific. Guthrie did lap two at the record speed of 88.51 m.p.h. and Stanley Woods was only 8 secs. slower. West was drawing away from White. Guthrie led at 88.11 m.p.h., Woods was second. and Frith third. Then Guthrie caused a vast sensation by doing lap three at a time only 2 sees. outside that for a lap at 90 m.p.h. The fast men came in for fuel, Guthrie needing only 80 secs. and Tattersall (Rudge) had stopped to change a faulty plug. C. J. Williams had a thrill on lap four, overshooting at Quarter Bridge with his Vincent H.R.D. and almost contacting with a barrier in the escape road. Tattersall again came off at this point, owing to oil on his rear tyre affecting the braking, but he continued. Tenni now found the Guzzi worried about its plugs and he changed one at the pits and another before reaching Bray Hill. Still Guthrie led for Nortons, still Woods sat on his tail-19 secs. behind—for Velocette, and the race average was at 88.3 m.p.h. Then poor Guthrie’s mount died at the Gooseneck, and it was Stanley Woods who led. The Norton pit got ready to\n\nthe straw barricades at 60 m.p.h., and continued without reducing speed.\n\nTrossi’s doubts as to his steering prevented the Ferrari cars from coming in first, second and third, for Hans Ruesch handled his 3.8-litre Alfa-Romeo extremely well to finish third, ahead of Hasse ‘s Auto-Union. ” Bira ” had a spell of driving in this race when. he took over De Rahm’s wave Frith to his greatest effort but already he was riding flat out, indulging in a duel with Jock West’s B.M.W. He lapped in 25 mins. 35 sees., equalling Guthrie’s record ride on the second round. Things were rendered more indecisive by the stoppage of West’s wonderful B.M.W., on account of a split fuel tank. He came in and filled up and found that another stop would be necessary before the end of the lap. Tenni was now going very Slowly. Woods now led, ten seconds ahead of Freddie Frith’s Norton, with White’s Norton third, Daniell’s Norton fourth, Mellors’s Velocette fifth and West (B.M.W.) sixth. Another lap over—lap six—and Woods and. Frith entered their last lap literally equal on the time basis. Frith had not been in to replenish I Excitement was intense, Mansell of Nortons feverishly watching his flitting watch-hand, while Willis of Velocettes paced to and fro behind the pits. The announcer, Rev. E. H. Stennmg, found it too close to pass judgment. Frith took Hillbury at terrific speed, hit the grass bank and just got out of the ensuing wobble safely. Both leaders finished and the time came through. Frith the winner by 15 sees. HIS last lap had been a record one at the astounding speed of 25 min. 5 secs., or\n\nmore than 90 m.p.h. average. Frith’s race average was 88.21 m.p.h. Stanley Woods (Velocette) was second at 88.09 m.p.h., J. H. White (Norton) third at 83.97 m.p.h., E. A. Mellors (Velocette) fourth, H. L. Daniell (Norton) fifth, Jock West (B.M.W.) sixth, and J. C. Galway (Norton) seventh. Archer (Velocette), Noel Pope (Norton), Williams (Norton), Beevers (Norton) and Lamacraft (Velocette) all qualified for second class awards, all save Pope on 350 c.c. machines, and Hartley (Rudge) completed\n\nthe course. Velocette took the Team. Prize. Of the retirements, Gatley\n\n(Norton) crashed without injury, Pepper (Norton) ran out of fuel on lap two, Vartak (Rudge), Tenni (Guzzi), Guthrie (Norton), and Forbes (Norton) were victims of engine or general trouble, Tattersall (Vincent-H.R.D.) had clutch trouble, and Williams (Vincent-H.R.D.) and Oliver (Vincent-H.R.D.) went out for reasons unspecified. It had been a truly great race, with Nortons able once again to win, in spite of the unexpected failure of Jimmy\n\nGuthrie’s hard-driven motor. Black print or any other sort cannot do justice to Frith’s great ride. He is twenty-eight years of age and entered the Norton team as a professional for the first time last year. There is nothing much amiss with British motoring sport when we have T.T. racts of this calibre and all who can should get over to the I.O.M. next year, when the Italian-German struggles and Norton-Velocette duel will very likely be ” on ” again.\n\nMaserati. After working up to seventh place he ran out of petrol away from the pits and retired.\n\n1. Nuvolari (Alfa-Romeo). 2. Farina (Alfa-Romeo). 3. Rueselt (Alfa-Romeo). 4. Hasse (Auto-Union). 5. Trossi (Alfa-Romeo). 0. Alluozzi (Alfa-Romeo). 7. Brezzi (Alfa-Romeo). S. Hartmann (Alfa-Romeo).\n\nMilan Grand Prix 1. Nuvolari"}]}