{"Mushahid Hussain Syed is a former member of the National Assembly of Pakistan.": [{"url": "https://www.senate.gov.pk/en/profile.php?uid=761", "page_content": "Mushahid Hussain Syed\n\n(4)\n\nName: Mushahid Hussain Syed Tenure: March 2012 to March 2018 Province: Federal Capital Party: Pakistan Muslim League (PML) Seat Description: Technocrats Including Ulema Designation: Senator\n\nContact Detail\n\nOffice Number: 051-9102509 Mobile Number: 0300-500 6056 Fax Number: 051-8319767 E-mail: mushahid.hussain@gmail.com Website: http://www.senatedefencecommittee.com.pk Local Address: H.No.175, St-15, E-7, Islamabad. Permanent Address: H. No. 175, St-15, SectorE-7, Islamabad.\n\nAcademic Career\n\nQualification: Master of Science in Foreign Service(MSFS) George Town University, Washington, USA. B.A., F.C. College, Lahore.\n\nOther Information\n\nA versatile and enlightened journalist by profession, Mr. Mushahid Hussain Syed was born in Sialkot on 2nd November, 1952. He has a Master's degree from the School of Foreign Service of Georgetown University in Washington DC.\n\n\n\nMr. Mushahid Hussain Syed taught politics and International Relations at the Punjab University Lahore before leaving Academia for the media in 1979. He was a Member of the Faculty of the Pakistan Administrative Staff College, the country's premier training institution, directing a training programme for new diplomats.\n\n\n\nMr. Mushahid Hussain Syed has been writing regularly on national and international affairs. His areas of specialization include the media, politics of the Muslim world, Pakistan's Foreign Policy and regional security issues. During 1982-87 he was Editor of \"The Muslim\" a major national English daily published from the Federal Capital. He is also author of three books on Pakistan's foreign policy and domestic politics.\n\n\n\nMr. Mushahid Hussain served as Co-Chairman of the conference on the Non-Aligned Medial (NAMEDIA) held in New Delhi in December 1983. He was leader of Pakistan's delegation to the 49th Session of the United Nations Commission on Human Rights which met in Geneva during February-March, 1993. He also served as Chairman of the Prime Minister's Task Force on Central Asia established to coordinate Pakistan's policy towards Central Asia.\n\n\n\nHe served as Special Assistant to Prime Minister Nawaz Sahrif, and in this Cabinet-level position, he was handling External Publicity and Foreign Affairs with special reference to the United States, Central Asia, India and Kashmir.\n\n\n\nHis articles have been published in various international publications, including The Washington Post, The New York Times, Asia Week, Far Eastern Economic Review, Jane's Defence Weekly, International Herald Tribune etc. etc. while he has also been providing current affairs analyses for the BBC, VOA and National Defence Staff College, the Civil Services Academy, the Foreign Service Academy and the Pakistan Naval Staff College.\n\n\n\nMr. Mushahid Hussain Syed is Information Secretary of the Pakistan Muslim League. He was elected as a Member of the Senate of Pakistan in March 1997 for a period of six years. He holds the portfolio of the Ministry of Information and Media Development as a Federal Minister and prior to his induction in the Federal Cabinet, he was Advisor to the Prime Minister on Information Tourism, Culture, Sports and Youth Affairs."}, {"url": "https://www.pakpedia.pk/mushahid-hussain/", "page_content": "Mushahid Hussain Sayed is a journalist, Geo-strategist, politician, an avid writer and reader.He is serving as the Secretary General of Pakistan Muslim League and is also the Chairman of Senate Defence Committee.\n\nTitle Description Personal Name: Mushahid Hussain In Urdu: مشاہد حسین Famous As: Mushahid Hussain Syed Nationality: Pakistani Residence: Islamabad, ICT Education: Bachelor of Arts Religion: Islam Profession: Journalist Career Political Party: Pakistan Muslim League (Q-Wing) In Office Role: Ministry of Information and Media Broadcasting Dates: 17 February 1997 – 12 October 1999 President: Rafique Tarrar Prime Minister: Nawaz Sharif Preceded By: Tasneem Qureshi Succeeded By: MGen Rashid Qureshi In Office 2 Role: Member of the Senate of Pakistan Dates: 2012 President: Mamnoon Hussain Prime Minister: Nawaz Sharif Constituency : Islamabad\n\nBiography\n\n\n\nMushahid Hussain Sayed is a specialist on international, political, and strategic issues. Currently he is serving as the senator, on a Pakistan Muslim League (Q) platform, to Senate of Pakistan. He is also the Secretary-General of the Pakistan Muslim League (Q) and Chairman of the Senate Standing Committee on Defence and Defence Production.[1] Biography\n\nFamily\n\nBorn in Sialkot Mushahid was raised in a family of five siblings. His father Col (r) Amjad Hussain Sayed was a prominent veteran of the Pakistan struggle and a recipient of the gold medal from the Prime Minister in 1997 for his outstanding services. His mother, Sameen Sayed, belonged to an eminent old family of Lahore and was also an activist in the Pakistan Movement.\n\nEducation\n\nHailing from a middle-class background, Mushahid was raised in a progressive and forward looking atmosphere, where quality education and hard work were of central focus. He received his Bachelors degree from Former Christian College, from whereon he went to the United States to pursue a Master’s degree from the School of Foreign Service in Georgetown University at Washington. While studying in the US, he was President of the Pakistan Students Association and was awarded a Congressional Internship to work in the United States Congress.[2] Education\n\nCareer\n\nReturned to Pakistan\n\nAfter completion of studies in the United States, he returned to Pakistan and became Member, Directing Staff of the country’s prestigious training institution for civil servants the Pakistan Administrative Staff College, where he trained new entrants to the Foreign Service. He then joined Pakistan’s oldest seat of learning, the Punjab University, as Lecturer on International Relations in the Political Science Department.\n\nBecame the Youngest Editor\n\nIn 1982 at age 29, he became the youngest Editor of a national English daily, The Muslim, published from the capital Islamabad, which was respected for its independent positions. The world’s leading human rights organization, Amnesty International, declared him a ‘Prisoner of Conscience’ making him the first such Pakistani to be so honoured for the year 2000.\n\nSpecialist\n\nAs a specialist on international, political, and strategic issues, he has lectured widely and his articles have been published in various national and international publications including The New York Times, The Washington Post, International Herald Tribune, and Middle East International. He has also authored three books.\n\nMember of Board of Governors\n\nHe is a Member of the Board of Governors of Islamabad Policy Research Institute (IPRI), a leading think tank. He was Pakistan’s Representative to the Commission of Eminent Persons, set up by the Organization of Islamic Conference (OIC) for its reform in 2004-05.\n\nVice President\n\nHe is also the Vice President of the Centrist Democrat International (CDI) Asia – Pacific Chapter. On 27 Jan 2006, he was awarded the Congressional Medal of Achievement by the House of Representatives of the Republic of the Philippines.\n\nSenate of Pakistan\n\nMr. Mushahid Hussain Syed is Information Secretary of the Pakistan Muslim League. He was elected as a Member of the Senate of Pakistan in March 1997 for a period of six years. He holds the portfolio of the Ministry of Information and Media Development as a Federal Minister and prior to his induction in the Federal Cabinet, he was Advisor to the Prime Minister on Information Tourism, Culture, Sports and Youth Affairs.[3] Senate of Pakistan\n\nSpecial Assistant\n\nHe served as Special Assistant to Prime Minister Nawaz Sahrif, and in this Cabinet-level position, he was handling External Publicity and Foreign Affairs with special reference to the United States, Central Asia, India and Kashmir.\n\nCo-Chairman\n\nMr. Mushahid Hussain served as Co-Chairman of the conference on the Non-Aligned Medial (NAMEDIA) held in New Delhi in December 1983. He was leader of Pakistan’s delegation to the 49th Session of the United Nations Commission on Human Rights which met in Geneva during February-March, 1993.\n\nAward and Honours\n\nReceived 2013 Tsinghua University Award for ‘Outstanding Contribution to Public Diplomacy’ for his role in promoting Pakistan-China people-to-people relations, August 31, 2013. President Xi Jinping personally conferred the prestigious ‘Five Principles of Peaceful Coexistence Friendship Award’ at Islamabad on April 20, 2015. Awarded Congressional internship by the US Congress in Washington, Summer of 1974. Represented Georgetown University at the prestigious Student Conference on US Affairs (SCUSA), US Military Academy, West Point, November 1973, and the Naval Academy Foreign Affairs Conference (NAFAC), April 1974. Youngest Editor at age 29, of any major national English daily in the region, as Editor of “The Muslim”. Leader of Pakistan Delegation to the United Nations Human Rights Commission, Geneva, 1993. Declared ‘Prisoner of Conscience’ by Amnesty International, world’s leading human rights organization as political prisoner without any charge for 440 days. Awarded the Congressional Medal of Achievement by the House of Representation of the Republic of Philippines, January 2006. Awarded Honorary Doctorate by the Royal Academy of Cambodia in Political Science, 2010. Awarded The Star of Achievement for Service to Humanity by the International Conference of Asian Political Parties (ICAPP), 2011. Received highest Cambodian award, Grand Order of the Kingdom of Cambodia, for contribution to Asian causes, May 2011. [4] Award and Honours\n\nSenate Election Results 2018\n\nIndependent candidate backed by PML-N Mushahid Hussain elected as Senator on Technocrat seat from Islamabad.PML-N-backed independent candidate Asad Junejo elected on General seat from Islamabad.PML-N-backed candidate have gained the majority of seats in Senate polls with at least 15 seats to their name. PML-N won majority of its seats from Punjab while PPP won largely from Sindh, getting 12 seats in total.20 candidates from Punjab contested the polls for 12 seats reserved in Senate for the province. Governing PML-N won 11 seats through independent candidates in Senate polls held at Punjab Assembly.[5] Senate Election Results 2018\n\nWinning candidates are\n\nContact Information"}, {"url": "http://www.chinadaily.com.cn/m/drc/2015-10/10/content_22152221.htm", "page_content": "Mushahid Hussain Sayed 2015-10-10\n\nMushahid Hussain Sayed is a journalist, geo-strategist, politician and an avid writer and reader. Born in Sialkot, Pakistan, Mushahid was raised in a family of five siblings. His father, Colonel Amjad Hussain Sayed is a prominent veteran of the Pakistan freedom struggle and a recipient of Gold Medal from the Prime Minister in 1997 for his outstanding contributions to the Movement for Pakistan’s Freedom. Hailing from a middle class background, Mushahid was raised in a progressive and forward looking atmosphere, where quality education, merit, honesty and hard work were the core values.\n\nHe studied at the Forman Christian College in Lahore, from where he received a Bachelor of Arts in Political Science. He holds a Master of Science in Foreign Service (MSFS) from the prestigious School of Foreign Service at Georgetown University, Washington D.C. While studying in the United States, he was President of the Pakistan Students Association. He represented Georgetown University at the Student Conference on United States Affairs at the United States Military Academy at West Point, the Naval Academy Foreign Affairs Conference at Annapolis and the US State Department’s ‘Crossroads’ programme for foreign students.\n\nHe was also part of the international student group received by President Gerald Ford at the White House. He was awarded a Congressional Internship, rare then for a foreign student, to work in the United States Congress in the summary of 1974. After completion of studies in the United States, he returned to Pakistan and became the youngest member of the faculty at the country’s premier training institution for civil servants, the Pakistan Administrative Staff College. He then joined Pakistan’s oldest seat of learning, the Punjab University, as Lecturer on International Relations in the Political Science Department. He was among the four dissident teachers removed from the University in October 1979 on political grounds for their campus activism during martial law.\n\nMushahid Hussain has served in the Federal Cabinet as Minister of Information and Culture from 1997 to 1999. He was elected to the Senate of Pakistan three times. He was also elected the Secretary General of the Pakistan Muslim League, one of Pakistan’s major political parties. As Information Minister from 1997 to 1999, he was the country’s principal spokesman and appeared frequently on international television and radio channels to present Pakistan’s position on issues ranging from nuclear weapons to Islam and foreign policy. He was a member of Pakistan’s five-member delegation led by the Prime Minister, which was received by President Bill Clinton for parleys at the White House in December 1998. He was also chairman of the Prime Minister’s Task Force on Central Asia in 1992-93, which planned policy initiatives towards that region after the break-up of the Soviet Union. During the state visits of South African President Nelson Mandela, Indian Prime Minister Atal Behari Vajpayee and Palestinian President Yasser Arafat to Pakistan, he was attached to them as Minister-in-Waiting.\n\nHe was also leader of Pakistan’s delegation to the UN Human Rights Commission at Geneva in 1993. After the October 12, 1999 military coup, he was held without any charges as a political prisoner for 440 days, including a period in solitary imprisonment. The world’s leading human rights organisation, Amnesty International, declared him a ‘Prisoner of Conscience’ making him the first Pakistani to be so honoured for the year 2000. Pursuant to an invitation, he wrote about his unique experiences in a special op-ed piece in ‘The New York Times’ titled ‘In the Cage, in Search of Grace’ on February 12, 2001. The Washington Post profiled him in detention on September 15, 2000, ‘Pakistan Keeps Gag on Former Spokesman'.\n\nAt age 29, he became the youngest editor of a major national English daily ‘The Muslim’ published from Islamabad, which was respected for its independent positions. As a journalist, he has a broad range of professional experiences including covering summits, interviewing leaders and reporting on conflicts like Palestine, the guerrilla war in Western Sahara and the Iran-Iraq war. During the Soviet occupation of Afghanistan, he was one of the first journalists from the area to personally visit Kabul and interview leaders there.\n\nAs a specialist on international political and strategic issues, he has lectured widely and his articles have been published in various national and international publications including ‘The New York Times’, ‘The Washington Post’, ‘International Herald Tribune’, ‘Jane’s Defence Weekly’ and ‘Middle East International’. He was elected co-chairman of the NAM (Non-Aligned Movement) Media Conference of 100 countries, held in New Delhi in December 1983 and he is the first Pakistani journalist to have started a syndicated column in the Indian media, writing regularly in the ‘The Time of India’ and ‘The Hindustan Times’. Mushahid Hussain is the author of three books. He also founded in 1999 the Islamabad Policy Research Institute (IPRI), a leading think-tank in 1999. He was Pakistan’s Representative to the 15-member Commission of Eminent Persons formed to reform and restructure the Organisation of Islamic Conference. He is also the Secretary General of the Centrist Asian-Pacific Democrat International (CAPDI) and is Special Rappoteur of International Conference of Asian Political Parties (ICAPP). He served as Senator and Chairman of the Foreign Relations, Kashmir Affairs and Northern Areas Committee of the Senate. He has also been a member of the Parliamentary Committee on Kashmir, Joint Parliamentary Committee on Balochistan, Functional Committee on Government Assurances, Functional Committee on Human Rights and Parliamentary Committee on Electoral Reforms. He has been a guest lecturer at the State Department’s Foreign Service Institute, Harvard University, MIT, the Middle East Institute, the Stimson Centre, Oxford University and Georgetown University’s Centre for Christian-Muslim Understanding. Award and Honours:\n\n Awarded the Congressional Medal of Achievement by the House of Representation of the Republic of Philippines, January 2006.  Awarded Honorary Doctorate by the Royal Academy of Cambodia in Political Science, November 2010.  Awarded The Star of Achievement for Service to Humanity by the International Conference of Asian Political Parties (ICAPP), December 2010.  Received highest Cambodian award, Grand Order of the Kingdom of Cambodia, for contribution to Asian causes, May 2011.  Received 2013 Tsinghua University Award for ‘Outstanding Contribution to Public Diplomacy’ for his role in promoting Pakistan-China people-to-people relations, August 31, 2013.  President Xi Jinping personally conferred the prestigious ‘Five Principles of Peaceful Coexistence Friendship Award’ at Islamabad on April 20, 2015.\n\nMushahid Hussain has played a pivotal role in promoting peace and understanding with Pakistan’s neighbours and the regional countries. In April 1984, as Editor of The Muslim, he organized the first Track-II Pakistan-India dialogue which was a landmark event in those days helping to defuse tensions between Pakistan and India since it brought in journalists, academia, former policy-makers both from the civil and military and diplomats together on one platform for the first time. He also organized the first Pakistan-Afghanistan dialogue in his capacity as Chairman, Senate Foreign Relations Committee in 2006 in Islamabad and a similar dialogue between Pakistan and Iran parliamentarians in 2012. He is also the architect of the first tripartite Think Tanks Dialogue between Pakistan, Afghanistan and China which was organized in Beijing in August 2013 with the Pakistan-China Institute spearheading the event together with a Chinese think-tank. The Pakistan-China Institute organized the 2nd Pakistan-Afghanistan-China Trilateral Dialogue in October 2014.\n\nMushahid Hussain contested for President of Pakistan in 2008 and although he lost the Presidential elections, he led in public opinion polls.\n\nHe is currently Chairman of the Pakistan Senate Defence Committee, Founder Chairman of Pakistan-China Institute, a think tank devoted to relations with China and the region, as well as Chairman of the Organizing Committee of the Asian Parliamentary Assembly.\n\nOne Belt, One Road: Asia’s Quest for a Better Tomorrow"}, {"url": "https://apln.network/members/pakistan/mushahid-hussain-sayed/bio", "page_content": "Mushahid Hussain served as the Minister for Information and Chairman of the Foreign Relations Committee in the Pakistani Senate and now serves as Chairman of the Defense Committee.\n\nMushahid was raised in a progressive and forward looking atmosphere, where quality education and hard work were of central focus. He received his Bachelors degree from Former Christian College, from whereon he went to the United States to pursue a Master's degree from the School of Foreign Service in Georgetown University at Washington. While studying in the US, he was President of the Pakistan Students Association and was awarded a Congressional Internship to work in the United States Congress.\n\nAfter completion of studies in the United States, he returned to Pakistan and became Member, Directing Staff of the country’s prestigious training institution for civil servants, the Pakistan Administrative Staff College, where he trained new entrants to the Foreign Service. He then joined Pakistan’s oldest seat of learning, the Punjab University, as Lecturer on International Relations in the Political Science Department.\n\nIn 1982, at age 29, he became the youngest Editor of a national English daily, The Muslim, published from the capital Islamabad, which was respected for its independent positions. The world's leading human rights organization, Amnesty International, declared him a 'Prisoner of Conscience' making him the first such Pakistani to be so honoured for the year 2000.\n\nAs a specialist on international, political, and strategic issues, he has lectured widely and his articles have been published in various national and international publications including The New York Times, The Washington Post, International Herald Tribune, and Middle East International. He has also authored three books. He is a Member of the Board of Governors of Islamabad Policy Research Institute (IPRI), a leading think tank. He was Pakistan's Representative to the Commission of Eminent Persons, set up by the Organization of Islamic Conference (OIC) for its reform in 2004-05. He is also the Vice President of the Centrist Democrat International (CDI) Asia – Pacific Chapter. On January 27, 2006, he was awarded the Congressional Medal of Achievement by the House of Representatives of the Republic of the Philippines.\n\nCurrently he is serving as the senator, on a Pakistan Muslim League (Q) platform, to Senate of Pakistan. He is also the Secretary-General of the Pakistan Muslim League (Q)."}, {"url": "https://www.rdi.org.cn/_t16/c1182/20210510/i4021.phtml", "page_content": "Mushahid Hussain SYED is a journalist, geo-strategist, writer, received a Bachelor's Degree from the former Christian College and a Master's Degree from the School of Foreign Services in Georgetown University, Washington DC and has been committed to quality education.\n\nAfter completion of his studies in the U.S., SYED became a Directing Staff of Pakistan Administrative Staff College, where he trained new entrants to the Foreign Service. He then joined the Punjab University as a Lecture on International Relations.\n\nIn 1982, he became the youngest Editor of a national English Daily, The Muslim. Amnesty International, the world's leading human rights organization, declared him a \"Prisoner of Conscience\", making him the first Pakistani to be so honored.\n\nAs an specialist on international, political and strategic issues, SYED has conducted extensive research and published articles in various national and international publications, including The New York Times, The Washington Post, International Herald Tribune and Middle East International. He is a Member of the Board of Governors of the Islamabad Policy Research Institute (IPRI), a leading think tank. He was also a Pakistan's Representative to the Commission of Eminent Persons, set up by the Organization of the Islamic Conference (OIC) for its reform in 2004-2005. He is also the Vice President of the Centrist Democrat International (CDI) Asia-Pacific Chapter. On January 27th, 2006, SYED was awarded the \"Congressional Medal of Achievement\" by the House of Representatives of the Republic of the Philippines.\n\nAt present, SYED serves as Senator and Secretary-General on the Pakistan Muslim League (N) platform. Pakistan-China Institute (PCI) formed and led by him plays an important role in CPEC construction.\n\n\n\n"}, {"url": "https://www.wikiwand.com/en/Syed_Mushahid_Hussain", "page_content": "Mushahid Hussain Syed (Punjabi, Urdu: مشاہد حسین سید‬; born 2 November 1952) is a Pakistani politician, and journalist who is currently the Pakistan Senator from the Islamabad Capital Territory on the platform of the Pakistan Muslim League (N), since 3 March 2018.[1][2][3]\n\nPakistani senator\n\nQuick facts: Mushahid Hussain, Member of the Senate of Pak... ▼\n\nA political journalist by profession, Hussain briefly served in the Sharif administrations in 1990s and is known for his political positions that reflects the national conservatism towards supporting the idea of civilian control of the military.[4] After playing a crucial role in the support of the decision-making towards the nuclear weapons-testing in response to India's in 1998, Hussain's tenure was abrupted by the staged martial law by Chairman joint chiefs Gen. Pervez Musharraf and was held in prison on treason conspiracy in 1999.[5][6] In 2003, he later defected to the forward block supporting the presidential campaign of Pervez Musharraf and was elected the Pakistan Senator of the Senate.\n\nDespite his support for the PML(Q), the forward block supporting Musharraf for several years, Hussain remained sympathetics towards the PML(N) and eventually joined his original party after being ousted by the forward block in 2016.[7][8][9] He is known as a proponent for strengthening the foreign relations with China and Central Asia, having served the Chairman of the China-Pakistan Institute, a lobbying firm based in Islamabad.[10][6]"}, {"url": "https://na.gov.pk/en/cmen.php?comm=ODU=", "page_content": "Print MEMBERS OF Parliamentary COMMITTEE Parliamentary Committee on Electoral Reforms S.No. Name Party Contact No./Email Constituency # Picture 1. Vacant (Chairperson) --- --- --- 1. Molana Abdul Ghafoor Haideri Jamiat Ulema-e-Islam Pakistan (JUIP) 0300-5247488 Senator 2. Mr. Farooq Hamid Naek PPPP 0321-5144616(PS),021-35687931(O),naek_law786@hotmail.com Senator 3. Mushahid Hussain Syed PML (N) 0300-5006056,mushahid.hussain@gmail.com Senator 4. Saleem Zia Pakistan Muslim League Nawaz (PML-N) 0333-3482297 Senator 5. Senator Shibli Faraz PTI 0300-8551133 Senator 6. Senator Sitara Ayaz Awami National Party (ANP) 0345-9058080 Senator\n\n\n\nSecretary Committee\n\nName Designation Contact No Email Syed Hassan Murtaza Bukhari Deputy Secretary 051-9201866 hassan.bokhari@na.gov.pk find your mna Find out the name and contact details of your MNA.\n\nSearch by: Constituency, Alphabetical and Party wise. today in national assembly No agenda is for today!"}, {"url": "https://www.nation.com.pk/17-May-2023/pakistan-should-seize-historic-opportunity-of-saudi-iran-rapprochement-mushahid", "page_content": "ISLAMABAD - Chairman of the Senate Standing Committee on Defence, Sena­tor Mushahid Hussain Sayed on Tuesday expressed his optimism about the longevity of the rap­prochement of KSA-Iran, con­sidering China’s interests in the region and Pakistan’s positive relationships with China, Iran, and Saudi Arabia.\n\n“Pakistan should seize this historic opportunity as it was at the centre of this transforma­tive change,” he said. The Centre for Aerospace & Security Studies (CASS) organised a seminar titled ‘KSA- Iran Rapprochement and its Implications: Way Forward for Pakistan’ in Islamabad, featuring renowned speakers. The seminar shed light on the political, eco­nomic, and security implications of the KSA-Iran rapprochement for the Middle East, Central Asia, West Asia, South Asia, and Paki­stan, a news release said.\n\nIn his keynote address, Senator Mushahid Hussain Sayed, Chairman of the Senate Standing Committee on Defence, delivered a compelling speech, highlighting the regional impact of the Saudi-Iranian recon­ciliation. Other eminent speakers included Prof. Dr Syed Rifaat Hus­sain, Former Member of the Prime Minister Advisory Committee on Foreign Affairs; Ambassador Riffat Masood, Former Ambassador of Pakistan to Iran; and Ambassador Rizwan Saeed Sheikh, Additional Secretary (Middle East), Ministry of Foreign Affairs, Government of Paki­stan. The seminar concluded with the remarks of President CASS Air Marshal Farhat Hussain Khan (R), and Ambassador Jalil Abbas Jilani, Advisor, Foreign Policy at CASS, moderated the proceedings.\n\nIn his Keynote Address on ‘Iran-Saudi Rapprochement and Paki­stan,’ Senator Mushahid Hussain Sayed discussed the surprising developments in the Middle East, such as Syria’s return to the Arab League and peace talks in Yemen, which reflected regional initiatives devoid of Western influence."}, {"url": "https://www.dawn.com/news/1024464", "page_content": "Born in 1952, Mushahid Hussain Syed did his Bachelors from Lahore’s Forman Christian College, followed by a Masters degree from Georgetown University. He had an illustrious career as a journalist before he entered the political realm as a member of Pakistan Muslim League - Nawaz (PML-N). He was appointed information minister by Nawaz Sharif in the latter’s 1997 cabinet.\n\nIn 1999, following the coup by former president General (retd) Pervez Musharraf, Mushahid’s house was stormed by soldiers the very same day and he was placed under house arrest and then behind bars. He was released in 2000. Surprisingly, following his release, he defected to Pakistan Muslim League - Quaid (PML-Q), which became known as the ‘King’s party’ because of its association with Musharraf.\n\nBefore Mushahid decided to experiment with politics, he had a vibrant career in academia as well as journalism. He also trained diplomats at the Pakistan Administrative Staff College, a civil service academy. After this, he taught at Punjab University – and was dismissed for his opposition to military rule from the institution. In 1982, he was made editor of a daily called ‘The Muslim’. He has written regularly for the Times of India and The Hindustan Times, along with being published in the New York Times and Washington Post amongst other publications.\n\nIn 1997, Mushahid entered politics and was elected a Senator on a PML-N ticket. He was also made the information minister by Nawaz, and ushered Pakistan through some of its worst international crises – including the conducting of nuclear tests followed by crippling sanctions and the Kargil War.\n\nPrior to his 1997 cabinet induction, he was an advisor to the then prime minister Nawaz. According to Nawaz, Mushahid was the first person who told him to go ahead with the nuclear tests although this statement has been contested.\n\nAfter his arrest following the 1999 coup, Mushahid remained imprisoned for 440 days and was declared a ‘Prisoner of Conscience’ by Amnesty International. He was imprisoned by the military government for his connections with Nawaz, and was held in solitary confinement for a part of this time.\n\nEventually, he contested the 2003 Senate election on a PML-Q ticket and won – reportedly with a letter of recommendation from Washington. Mushahid also become a staunch supporter of Musharraf and even agreed with the latter’s decision to not shed his uniform.\n\nIn 2004, he was part of a team that negotiated with slain Baloch nationalist leader Akbar Bugti. However, he was also part of the same government which was eventually implicated in the leader’s killing.\n\nAfter the 2008 election, Mushahid was nominated by PML-Q as its presidential candidate – but he lost to Asif Ali Zardari, and received the smallest number of votes of all the nominees to boot.\n\nMushahid successfully contested election for the Parliament’s upper house again in 2012 and currently heads the Senate’s Standing Committee on Defence and Defence Production. He has also served as chairman of the Senate’s Standing Committee on Foreign Affairs, Kashmir and Northern Areas. In 2012, his name also popped up as the lowest tax paying Senator: In 2011, he paid only rupees 82 in taxes.\n\nMushahid has been the chief spokesman for PML-Q throughout his affiliation with the party.\n\n— Research and text by Heba Islam"}, {"url": "http://rdcy.ruc.edu.cn/yw/LATEST_INSIGHTS/007e5fc5c2d74ef9b2488b9314ac8122.htm", "page_content": "\"Belt and Road Initiative (BRI) is the most important developmental and diplomatic initiative of the 21st century. We are proud to say that China-Pakistan Economic Corridor (CPEC) is the centerpiece and flagship of BRI. Like BRI, CPEC itself is a success story\", said Senator Mushahid Hussain Sayed.\n\n\n\n\n\nHe made the remarks on a webinar ‘Big Power Competition in the Post-Pandemic World Order and the Belt and Road Initiative’, which was organized by Pakistan-China Institute (PCI), Islamabad.\n\nMushahid Hussain Sayed said, “A huge transformation is present to our eyes. There is a shift and the global balance and economical and political powers moving away from West to East,” said Mr. Sayed who is also chairman of PCI.\n\n\n\n\n\n“The American century is coming to an end. We see a major transformation, emergence and resurgence of Asia and many observers see an Asia century, in which China’s peaceful development is a central piece of these developments,” he said.\n\n\n\n\n\nMushahid Hussain Syed said that on one side is the US and some of its partners, talking about containment of China and as well about a new Cold War. On the other side there is a large chunk of public opinion in the third world that does not agree with this perspective.\n\n\n\n\n\n“There are two paths. A path of connectivity and cooperation of which the leading example is BRI. It brings together corridors, cultures and connectivity. The other path is conflict and confrontation,” he said.\n\n\n\n\n\nAccording to Mushahid Hussain Syed, the world can no longer afford conflicts, a new Cold War, or any policies of containment. “Let us build a better peaceful prosperous future together because the challenges acquire collective approach. Cold War is not on the agenda especially of the developing countries,” he said.\n\n\n\n\n\nProfessor Wang Wen from Chongyang Institute, Renmin University of China talked about China’s rise amidst the new cold war-challenges and opportunities in the post-pandemic world. “I believe that the US has adopted a new cold war approach to contain and suppress China without a bottom-line, honestly. China was forced to fight back. If the United States does not stop those behaviors and the cold war really occurs, the whole world will suffer,” said Mr. Wang Wen.\n\n\n\n\n\nMustafa Hyder Sayed, Executive Director PCI said, “Countries like Pakistan have to learn how to balance their strategic partnerships and at the same time prioritize our food and economic security”.\n\n\n\n\n\nKeith Bennet, Co-Editor Friends of Socialist China, said that China is a role model for countries that wish to build their economies. “On economic front, China’s BRI is the greatest investment infrastructure program and opportunity in history, holds up the possibility of development of the national economy and holds connectivity and improvement of peoples living standard in countries across the globe,” Mr. Bennet said.\n\n\n\n\n\nYara Suos, MP Member Kingdom of Cambodia explained that Cambodia and its people highly value BRI and China’s strategic partnership in the region.\n\n\n\n"}], "Mushahid Hussain Syed is a former member of the Senate of Pakistan.": [{"url": "https://www.senate.gov.pk/en/profile.php?uid=761", "page_content": "Mushahid Hussain Syed\n\n(4)\n\nName: Mushahid Hussain Syed Tenure: March 2012 to March 2018 Province: Federal Capital Party: Pakistan Muslim League (PML) Seat Description: Technocrats Including Ulema Designation: Senator\n\nContact Detail\n\nOffice Number: 051-9102509 Mobile Number: 0300-500 6056 Fax Number: 051-8319767 E-mail: mushahid.hussain@gmail.com Website: http://www.senatedefencecommittee.com.pk Local Address: H.No.175, St-15, E-7, Islamabad. Permanent Address: H. No. 175, St-15, SectorE-7, Islamabad.\n\nAcademic Career\n\nQualification: Master of Science in Foreign Service(MSFS) George Town University, Washington, USA. B.A., F.C. College, Lahore.\n\nOther Information\n\nA versatile and enlightened journalist by profession, Mr. Mushahid Hussain Syed was born in Sialkot on 2nd November, 1952. He has a Master's degree from the School of Foreign Service of Georgetown University in Washington DC.\n\n\n\nMr. Mushahid Hussain Syed taught politics and International Relations at the Punjab University Lahore before leaving Academia for the media in 1979. He was a Member of the Faculty of the Pakistan Administrative Staff College, the country's premier training institution, directing a training programme for new diplomats.\n\n\n\nMr. Mushahid Hussain Syed has been writing regularly on national and international affairs. His areas of specialization include the media, politics of the Muslim world, Pakistan's Foreign Policy and regional security issues. During 1982-87 he was Editor of \"The Muslim\" a major national English daily published from the Federal Capital. He is also author of three books on Pakistan's foreign policy and domestic politics.\n\n\n\nMr. Mushahid Hussain served as Co-Chairman of the conference on the Non-Aligned Medial (NAMEDIA) held in New Delhi in December 1983. He was leader of Pakistan's delegation to the 49th Session of the United Nations Commission on Human Rights which met in Geneva during February-March, 1993. He also served as Chairman of the Prime Minister's Task Force on Central Asia established to coordinate Pakistan's policy towards Central Asia.\n\n\n\nHe served as Special Assistant to Prime Minister Nawaz Sahrif, and in this Cabinet-level position, he was handling External Publicity and Foreign Affairs with special reference to the United States, Central Asia, India and Kashmir.\n\n\n\nHis articles have been published in various international publications, including The Washington Post, The New York Times, Asia Week, Far Eastern Economic Review, Jane's Defence Weekly, International Herald Tribune etc. etc. while he has also been providing current affairs analyses for the BBC, VOA and National Defence Staff College, the Civil Services Academy, the Foreign Service Academy and the Pakistan Naval Staff College.\n\n\n\nMr. Mushahid Hussain Syed is Information Secretary of the Pakistan Muslim League. He was elected as a Member of the Senate of Pakistan in March 1997 for a period of six years. He holds the portfolio of the Ministry of Information and Media Development as a Federal Minister and prior to his induction in the Federal Cabinet, he was Advisor to the Prime Minister on Information Tourism, Culture, Sports and Youth Affairs."}, {"url": "https://english.news.cn/20230328/fbc991fb20e24321929ac04cff482388/c.html", "page_content": "Mushahid Hussain Sayed, the Chairman of the Pakistan Senate Defence Committee and Founder Chairman of Pakistan-China Institute delivers a speech at the International Forum on Chinese Path to Modernization and Global Community of Shared Future in Beijing, capital of China, March 27, 2023. The forum was held both online and offline, gathering nearly 100 senior dignitaries, representatives of enterprises and international organizations from 14 countries. (Xinhuanet/You Huiyuan)\n\nBy You Huiyuan\n\nBEIJING, March 28 (Xinhuanet) -- Chinese path to modernization features globalization, multilateralism, inclusivity and shared common security, a top Pakistani expert said.\n\nThe more China develops, the more it shares with the international community, Mushahid Hussain Sayed, the Chairman of the Pakistan Senate Defence Committee and Founder Chairman of Pakistan-China Institute told Xinhuanet on the sidelines of an international forum on Chinese path to modernization and global community of share future held Monday in Beijing.\n\nMushahid explained that Chinese modernization is based on connectivity among cultures, countries and continents, adding that “while some people in the West are talking about conflict, confrontation and containment, China is uniting and building bridges, like it has done with Iran and Saudi Arabia.”\n\nChina has risen peacefully without invading, occupying or attacking any other countries, he noted.\n\nMushahid stressed that in the 21st century, what we need to do is working together and building a community with a shared future for mankind, whether it’s the Belt and Road Initiative, or the Global Development Initiative, or the Global Security Initiative, or the Global Civilization Initiative.\n\nAmong the essential requirements of Chinese modernization are building a community with a shared future for mankind, and creating a new form of human advancement, according to the Report to the 20th National Congress of the Communist Party of China (CPC).\n\nFrom Mushahid’s perspective, Chinese modernization and the building of a community with a shared future for mankind go together.\n\n“If China is developing and China is becoming more prosperous because of the development, China is sharing its prosperity with other countries through trade, investment, people-to-people exchanges,” he noted.\n\nIn today's world, he said, 193 countries are members of the UN, and most of the members have maintained trade with China, indicating that China is very active in commercial interaction.\n\nFor example, Mushahid said, quite many Pakistani students are now studying in China, and China has invested heavily in Pakistan under the framework of the Belt and Road Initiative. A lot of Pakistanis have gotten jobs under the China-Pakistan Economic Corridor, he added.\n\nThe International Forum on Chinese Path to Modernization and Global Community of Shared Future was held both online and offline, gathering nearly 100 senior dignitaries, representatives of enterprises and international organizations from 14 countries."}, {"url": "https://www.pakpedia.pk/mushahid-hussain/", "page_content": "Mushahid Hussain Sayed is a journalist, Geo-strategist, politician, an avid writer and reader.He is serving as the Secretary General of Pakistan Muslim League and is also the Chairman of Senate Defence Committee.\n\nTitle Description Personal Name: Mushahid Hussain In Urdu: مشاہد حسین Famous As: Mushahid Hussain Syed Nationality: Pakistani Residence: Islamabad, ICT Education: Bachelor of Arts Religion: Islam Profession: Journalist Career Political Party: Pakistan Muslim League (Q-Wing) In Office Role: Ministry of Information and Media Broadcasting Dates: 17 February 1997 – 12 October 1999 President: Rafique Tarrar Prime Minister: Nawaz Sharif Preceded By: Tasneem Qureshi Succeeded By: MGen Rashid Qureshi In Office 2 Role: Member of the Senate of Pakistan Dates: 2012 President: Mamnoon Hussain Prime Minister: Nawaz Sharif Constituency : Islamabad\n\nBiography\n\n\n\nMushahid Hussain Sayed is a specialist on international, political, and strategic issues. Currently he is serving as the senator, on a Pakistan Muslim League (Q) platform, to Senate of Pakistan. He is also the Secretary-General of the Pakistan Muslim League (Q) and Chairman of the Senate Standing Committee on Defence and Defence Production.[1] Biography\n\nFamily\n\nBorn in Sialkot Mushahid was raised in a family of five siblings. His father Col (r) Amjad Hussain Sayed was a prominent veteran of the Pakistan struggle and a recipient of the gold medal from the Prime Minister in 1997 for his outstanding services. His mother, Sameen Sayed, belonged to an eminent old family of Lahore and was also an activist in the Pakistan Movement.\n\nEducation\n\nHailing from a middle-class background, Mushahid was raised in a progressive and forward looking atmosphere, where quality education and hard work were of central focus. He received his Bachelors degree from Former Christian College, from whereon he went to the United States to pursue a Master’s degree from the School of Foreign Service in Georgetown University at Washington. While studying in the US, he was President of the Pakistan Students Association and was awarded a Congressional Internship to work in the United States Congress.[2] Education\n\nCareer\n\nReturned to Pakistan\n\nAfter completion of studies in the United States, he returned to Pakistan and became Member, Directing Staff of the country’s prestigious training institution for civil servants the Pakistan Administrative Staff College, where he trained new entrants to the Foreign Service. He then joined Pakistan’s oldest seat of learning, the Punjab University, as Lecturer on International Relations in the Political Science Department.\n\nBecame the Youngest Editor\n\nIn 1982 at age 29, he became the youngest Editor of a national English daily, The Muslim, published from the capital Islamabad, which was respected for its independent positions. The world’s leading human rights organization, Amnesty International, declared him a ‘Prisoner of Conscience’ making him the first such Pakistani to be so honoured for the year 2000.\n\nSpecialist\n\nAs a specialist on international, political, and strategic issues, he has lectured widely and his articles have been published in various national and international publications including The New York Times, The Washington Post, International Herald Tribune, and Middle East International. He has also authored three books.\n\nMember of Board of Governors\n\nHe is a Member of the Board of Governors of Islamabad Policy Research Institute (IPRI), a leading think tank. He was Pakistan’s Representative to the Commission of Eminent Persons, set up by the Organization of Islamic Conference (OIC) for its reform in 2004-05.\n\nVice President\n\nHe is also the Vice President of the Centrist Democrat International (CDI) Asia – Pacific Chapter. On 27 Jan 2006, he was awarded the Congressional Medal of Achievement by the House of Representatives of the Republic of the Philippines.\n\nSenate of Pakistan\n\nMr. Mushahid Hussain Syed is Information Secretary of the Pakistan Muslim League. He was elected as a Member of the Senate of Pakistan in March 1997 for a period of six years. He holds the portfolio of the Ministry of Information and Media Development as a Federal Minister and prior to his induction in the Federal Cabinet, he was Advisor to the Prime Minister on Information Tourism, Culture, Sports and Youth Affairs.[3] Senate of Pakistan\n\nSpecial Assistant\n\nHe served as Special Assistant to Prime Minister Nawaz Sahrif, and in this Cabinet-level position, he was handling External Publicity and Foreign Affairs with special reference to the United States, Central Asia, India and Kashmir.\n\nCo-Chairman\n\nMr. Mushahid Hussain served as Co-Chairman of the conference on the Non-Aligned Medial (NAMEDIA) held in New Delhi in December 1983. He was leader of Pakistan’s delegation to the 49th Session of the United Nations Commission on Human Rights which met in Geneva during February-March, 1993.\n\nAward and Honours\n\nReceived 2013 Tsinghua University Award for ‘Outstanding Contribution to Public Diplomacy’ for his role in promoting Pakistan-China people-to-people relations, August 31, 2013. President Xi Jinping personally conferred the prestigious ‘Five Principles of Peaceful Coexistence Friendship Award’ at Islamabad on April 20, 2015. Awarded Congressional internship by the US Congress in Washington, Summer of 1974. Represented Georgetown University at the prestigious Student Conference on US Affairs (SCUSA), US Military Academy, West Point, November 1973, and the Naval Academy Foreign Affairs Conference (NAFAC), April 1974. Youngest Editor at age 29, of any major national English daily in the region, as Editor of “The Muslim”. Leader of Pakistan Delegation to the United Nations Human Rights Commission, Geneva, 1993. Declared ‘Prisoner of Conscience’ by Amnesty International, world’s leading human rights organization as political prisoner without any charge for 440 days. Awarded the Congressional Medal of Achievement by the House of Representation of the Republic of Philippines, January 2006. Awarded Honorary Doctorate by the Royal Academy of Cambodia in Political Science, 2010. Awarded The Star of Achievement for Service to Humanity by the International Conference of Asian Political Parties (ICAPP), 2011. Received highest Cambodian award, Grand Order of the Kingdom of Cambodia, for contribution to Asian causes, May 2011. [4] Award and Honours\n\nSenate Election Results 2018\n\nIndependent candidate backed by PML-N Mushahid Hussain elected as Senator on Technocrat seat from Islamabad.PML-N-backed independent candidate Asad Junejo elected on General seat from Islamabad.PML-N-backed candidate have gained the majority of seats in Senate polls with at least 15 seats to their name. PML-N won majority of its seats from Punjab while PPP won largely from Sindh, getting 12 seats in total.20 candidates from Punjab contested the polls for 12 seats reserved in Senate for the province. Governing PML-N won 11 seats through independent candidates in Senate polls held at Punjab Assembly.[5] Senate Election Results 2018\n\nWinning candidates are\n\nContact Information"}, {"url": "https://www.wikiwand.com/en/Syed_Mushahid_Hussain", "page_content": "Mushahid Hussain Syed (Punjabi, Urdu: مشاہد حسین سید‬; born 2 November 1952) is a Pakistani politician, and journalist who is currently the Pakistan Senator from the Islamabad Capital Territory on the platform of the Pakistan Muslim League (N), since 3 March 2018.[1][2][3]\n\nPakistani senator\n\nQuick facts: Mushahid Hussain, Member of the Senate of Pak... ▼\n\nA political journalist by profession, Hussain briefly served in the Sharif administrations in 1990s and is known for his political positions that reflects the national conservatism towards supporting the idea of civilian control of the military.[4] After playing a crucial role in the support of the decision-making towards the nuclear weapons-testing in response to India's in 1998, Hussain's tenure was abrupted by the staged martial law by Chairman joint chiefs Gen. Pervez Musharraf and was held in prison on treason conspiracy in 1999.[5][6] In 2003, he later defected to the forward block supporting the presidential campaign of Pervez Musharraf and was elected the Pakistan Senator of the Senate.\n\nDespite his support for the PML(Q), the forward block supporting Musharraf for several years, Hussain remained sympathetics towards the PML(N) and eventually joined his original party after being ousted by the forward block in 2016.[7][8][9] He is known as a proponent for strengthening the foreign relations with China and Central Asia, having served the Chairman of the China-Pakistan Institute, a lobbying firm based in Islamabad.[10][6]"}, {"url": "https://apln.network/members/pakistan/mushahid-hussain-sayed/bio", "page_content": "Mushahid Hussain served as the Minister for Information and Chairman of the Foreign Relations Committee in the Pakistani Senate and now serves as Chairman of the Defense Committee.\n\nMushahid was raised in a progressive and forward looking atmosphere, where quality education and hard work were of central focus. He received his Bachelors degree from Former Christian College, from whereon he went to the United States to pursue a Master's degree from the School of Foreign Service in Georgetown University at Washington. While studying in the US, he was President of the Pakistan Students Association and was awarded a Congressional Internship to work in the United States Congress.\n\nAfter completion of studies in the United States, he returned to Pakistan and became Member, Directing Staff of the country’s prestigious training institution for civil servants, the Pakistan Administrative Staff College, where he trained new entrants to the Foreign Service. He then joined Pakistan’s oldest seat of learning, the Punjab University, as Lecturer on International Relations in the Political Science Department.\n\nIn 1982, at age 29, he became the youngest Editor of a national English daily, The Muslim, published from the capital Islamabad, which was respected for its independent positions. The world's leading human rights organization, Amnesty International, declared him a 'Prisoner of Conscience' making him the first such Pakistani to be so honoured for the year 2000.\n\nAs a specialist on international, political, and strategic issues, he has lectured widely and his articles have been published in various national and international publications including The New York Times, The Washington Post, International Herald Tribune, and Middle East International. He has also authored three books. He is a Member of the Board of Governors of Islamabad Policy Research Institute (IPRI), a leading think tank. He was Pakistan's Representative to the Commission of Eminent Persons, set up by the Organization of Islamic Conference (OIC) for its reform in 2004-05. He is also the Vice President of the Centrist Democrat International (CDI) Asia – Pacific Chapter. On January 27, 2006, he was awarded the Congressional Medal of Achievement by the House of Representatives of the Republic of the Philippines.\n\nCurrently he is serving as the senator, on a Pakistan Muslim League (Q) platform, to Senate of Pakistan. He is also the Secretary-General of the Pakistan Muslim League (Q)."}, {"url": "http://www.chinadaily.com.cn/m/drc/2015-10/10/content_22152221.htm", "page_content": "Mushahid Hussain Sayed 2015-10-10\n\nMushahid Hussain Sayed is a journalist, geo-strategist, politician and an avid writer and reader. Born in Sialkot, Pakistan, Mushahid was raised in a family of five siblings. His father, Colonel Amjad Hussain Sayed is a prominent veteran of the Pakistan freedom struggle and a recipient of Gold Medal from the Prime Minister in 1997 for his outstanding contributions to the Movement for Pakistan’s Freedom. Hailing from a middle class background, Mushahid was raised in a progressive and forward looking atmosphere, where quality education, merit, honesty and hard work were the core values.\n\nHe studied at the Forman Christian College in Lahore, from where he received a Bachelor of Arts in Political Science. He holds a Master of Science in Foreign Service (MSFS) from the prestigious School of Foreign Service at Georgetown University, Washington D.C. While studying in the United States, he was President of the Pakistan Students Association. He represented Georgetown University at the Student Conference on United States Affairs at the United States Military Academy at West Point, the Naval Academy Foreign Affairs Conference at Annapolis and the US State Department’s ‘Crossroads’ programme for foreign students.\n\nHe was also part of the international student group received by President Gerald Ford at the White House. He was awarded a Congressional Internship, rare then for a foreign student, to work in the United States Congress in the summary of 1974. After completion of studies in the United States, he returned to Pakistan and became the youngest member of the faculty at the country’s premier training institution for civil servants, the Pakistan Administrative Staff College. He then joined Pakistan’s oldest seat of learning, the Punjab University, as Lecturer on International Relations in the Political Science Department. He was among the four dissident teachers removed from the University in October 1979 on political grounds for their campus activism during martial law.\n\nMushahid Hussain has served in the Federal Cabinet as Minister of Information and Culture from 1997 to 1999. He was elected to the Senate of Pakistan three times. He was also elected the Secretary General of the Pakistan Muslim League, one of Pakistan’s major political parties. As Information Minister from 1997 to 1999, he was the country’s principal spokesman and appeared frequently on international television and radio channels to present Pakistan’s position on issues ranging from nuclear weapons to Islam and foreign policy. He was a member of Pakistan’s five-member delegation led by the Prime Minister, which was received by President Bill Clinton for parleys at the White House in December 1998. He was also chairman of the Prime Minister’s Task Force on Central Asia in 1992-93, which planned policy initiatives towards that region after the break-up of the Soviet Union. During the state visits of South African President Nelson Mandela, Indian Prime Minister Atal Behari Vajpayee and Palestinian President Yasser Arafat to Pakistan, he was attached to them as Minister-in-Waiting.\n\nHe was also leader of Pakistan’s delegation to the UN Human Rights Commission at Geneva in 1993. After the October 12, 1999 military coup, he was held without any charges as a political prisoner for 440 days, including a period in solitary imprisonment. The world’s leading human rights organisation, Amnesty International, declared him a ‘Prisoner of Conscience’ making him the first Pakistani to be so honoured for the year 2000. Pursuant to an invitation, he wrote about his unique experiences in a special op-ed piece in ‘The New York Times’ titled ‘In the Cage, in Search of Grace’ on February 12, 2001. The Washington Post profiled him in detention on September 15, 2000, ‘Pakistan Keeps Gag on Former Spokesman'.\n\nAt age 29, he became the youngest editor of a major national English daily ‘The Muslim’ published from Islamabad, which was respected for its independent positions. As a journalist, he has a broad range of professional experiences including covering summits, interviewing leaders and reporting on conflicts like Palestine, the guerrilla war in Western Sahara and the Iran-Iraq war. During the Soviet occupation of Afghanistan, he was one of the first journalists from the area to personally visit Kabul and interview leaders there.\n\nAs a specialist on international political and strategic issues, he has lectured widely and his articles have been published in various national and international publications including ‘The New York Times’, ‘The Washington Post’, ‘International Herald Tribune’, ‘Jane’s Defence Weekly’ and ‘Middle East International’. He was elected co-chairman of the NAM (Non-Aligned Movement) Media Conference of 100 countries, held in New Delhi in December 1983 and he is the first Pakistani journalist to have started a syndicated column in the Indian media, writing regularly in the ‘The Time of India’ and ‘The Hindustan Times’. Mushahid Hussain is the author of three books. He also founded in 1999 the Islamabad Policy Research Institute (IPRI), a leading think-tank in 1999. He was Pakistan’s Representative to the 15-member Commission of Eminent Persons formed to reform and restructure the Organisation of Islamic Conference. He is also the Secretary General of the Centrist Asian-Pacific Democrat International (CAPDI) and is Special Rappoteur of International Conference of Asian Political Parties (ICAPP). He served as Senator and Chairman of the Foreign Relations, Kashmir Affairs and Northern Areas Committee of the Senate. He has also been a member of the Parliamentary Committee on Kashmir, Joint Parliamentary Committee on Balochistan, Functional Committee on Government Assurances, Functional Committee on Human Rights and Parliamentary Committee on Electoral Reforms. He has been a guest lecturer at the State Department’s Foreign Service Institute, Harvard University, MIT, the Middle East Institute, the Stimson Centre, Oxford University and Georgetown University’s Centre for Christian-Muslim Understanding. Award and Honours:\n\n Awarded the Congressional Medal of Achievement by the House of Representation of the Republic of Philippines, January 2006.  Awarded Honorary Doctorate by the Royal Academy of Cambodia in Political Science, November 2010.  Awarded The Star of Achievement for Service to Humanity by the International Conference of Asian Political Parties (ICAPP), December 2010.  Received highest Cambodian award, Grand Order of the Kingdom of Cambodia, for contribution to Asian causes, May 2011.  Received 2013 Tsinghua University Award for ‘Outstanding Contribution to Public Diplomacy’ for his role in promoting Pakistan-China people-to-people relations, August 31, 2013.  President Xi Jinping personally conferred the prestigious ‘Five Principles of Peaceful Coexistence Friendship Award’ at Islamabad on April 20, 2015.\n\nMushahid Hussain has played a pivotal role in promoting peace and understanding with Pakistan’s neighbours and the regional countries. In April 1984, as Editor of The Muslim, he organized the first Track-II Pakistan-India dialogue which was a landmark event in those days helping to defuse tensions between Pakistan and India since it brought in journalists, academia, former policy-makers both from the civil and military and diplomats together on one platform for the first time. He also organized the first Pakistan-Afghanistan dialogue in his capacity as Chairman, Senate Foreign Relations Committee in 2006 in Islamabad and a similar dialogue between Pakistan and Iran parliamentarians in 2012. He is also the architect of the first tripartite Think Tanks Dialogue between Pakistan, Afghanistan and China which was organized in Beijing in August 2013 with the Pakistan-China Institute spearheading the event together with a Chinese think-tank. The Pakistan-China Institute organized the 2nd Pakistan-Afghanistan-China Trilateral Dialogue in October 2014.\n\nMushahid Hussain contested for President of Pakistan in 2008 and although he lost the Presidential elections, he led in public opinion polls.\n\nHe is currently Chairman of the Pakistan Senate Defence Committee, Founder Chairman of Pakistan-China Institute, a think tank devoted to relations with China and the region, as well as Chairman of the Organizing Committee of the Asian Parliamentary Assembly.\n\nOne Belt, One Road: Asia’s Quest for a Better Tomorrow"}, {"url": "http://rdcy.ruc.edu.cn/yw/LATEST_INSIGHTS/007e5fc5c2d74ef9b2488b9314ac8122.htm", "page_content": "\"Belt and Road Initiative (BRI) is the most important developmental and diplomatic initiative of the 21st century. We are proud to say that China-Pakistan Economic Corridor (CPEC) is the centerpiece and flagship of BRI. Like BRI, CPEC itself is a success story\", said Senator Mushahid Hussain Sayed.\n\n\n\n\n\nHe made the remarks on a webinar ‘Big Power Competition in the Post-Pandemic World Order and the Belt and Road Initiative’, which was organized by Pakistan-China Institute (PCI), Islamabad.\n\nMushahid Hussain Sayed said, “A huge transformation is present to our eyes. There is a shift and the global balance and economical and political powers moving away from West to East,” said Mr. Sayed who is also chairman of PCI.\n\n\n\n\n\n“The American century is coming to an end. We see a major transformation, emergence and resurgence of Asia and many observers see an Asia century, in which China’s peaceful development is a central piece of these developments,” he said.\n\n\n\n\n\nMushahid Hussain Syed said that on one side is the US and some of its partners, talking about containment of China and as well about a new Cold War. On the other side there is a large chunk of public opinion in the third world that does not agree with this perspective.\n\n\n\n\n\n“There are two paths. A path of connectivity and cooperation of which the leading example is BRI. It brings together corridors, cultures and connectivity. The other path is conflict and confrontation,” he said.\n\n\n\n\n\nAccording to Mushahid Hussain Syed, the world can no longer afford conflicts, a new Cold War, or any policies of containment. “Let us build a better peaceful prosperous future together because the challenges acquire collective approach. Cold War is not on the agenda especially of the developing countries,” he said.\n\n\n\n\n\nProfessor Wang Wen from Chongyang Institute, Renmin University of China talked about China’s rise amidst the new cold war-challenges and opportunities in the post-pandemic world. “I believe that the US has adopted a new cold war approach to contain and suppress China without a bottom-line, honestly. China was forced to fight back. If the United States does not stop those behaviors and the cold war really occurs, the whole world will suffer,” said Mr. Wang Wen.\n\n\n\n\n\nMustafa Hyder Sayed, Executive Director PCI said, “Countries like Pakistan have to learn how to balance their strategic partnerships and at the same time prioritize our food and economic security”.\n\n\n\n\n\nKeith Bennet, Co-Editor Friends of Socialist China, said that China is a role model for countries that wish to build their economies. “On economic front, China’s BRI is the greatest investment infrastructure program and opportunity in history, holds up the possibility of development of the national economy and holds connectivity and improvement of peoples living standard in countries across the globe,” Mr. Bennet said.\n\n\n\n\n\nYara Suos, MP Member Kingdom of Cambodia explained that Cambodia and its people highly value BRI and China’s strategic partnership in the region.\n\n\n\n"}, {"url": "https://senate.gov.pk/en/news_content.php?id=4555", "page_content": "News Detail\n\nEvent Title: Senator Mushahid Hussain Sayed, Chairman Senate Standing Committee on Defence Presiding over a Meeting of the Committee at Parliament Lodges Islamabad Event Date: 2022-09-23\n\nSenate Defence Committee under the Chairman, Senator Mushahid Hussain Sayed, received a comprehensive briefing on the security situation in Swat in the backdrop of reports of resurgence of TTP and the attacks which are taking place on civilians and soldiers. The committee was assured that the writ of the state is paramount and the law and order situation is under control. There have been incidents but the culprits have been traced and caught. Special appreciation was expressed for the role of CTD Malakand whose police force, levies and paramilitary have played a heroic role to preserve, protect and promote peace as well as the lives of the local people.\n\n\n\nThere was a candid exchange of views between the members of the committee on this issue. The Committee was of the consensus view that there should not be any appeasement or compromise on upholding the rule of law. All those committing crimes against the people and the state must be caught, tried in court and given due punishment as per the law.\n\n\n\nThe Committee also received a briefing from the Director General, Federal Government Educational Institution on the functioning of the department which has 386 schools, spread over 66 cities of Pakistan in all provinces. The committee expressed its appreciation and the positive role that the department is playing to promote national integration through education and resolved that its meagre budget needs to be raised and bring at par with the Federal Directorate of Education. The committee also supported the proposal of establishment of National University of Pakistan and Institute of Inclusive Education.\n\n\n\n\n\nAt the outset, Senator Mushahid Hussain extended a warm welcome to the new Secretary Defence, Lt. Gen. Hamood uz Zaman and appreciated his services as head of the NCOC which was primarily responsible for containing of corona virus in a very successful manner. Senator Mushahid Hussain also said that the Committee which represents all political parties, both government and opposition and all provinces has always worked as a bridge between the armed forces and parliament and on national security issues, the committee speaks above party lines in a unified manner. Moreover, on issues of national security, the Senate Defence Committee will continue to play its the role with unity, vigor and determination.\n\n"}, {"url": "https://thediplomat.com/2022/03/what-is-driving-pakistans-outreach-to-russia/", "page_content": "Advertisement\n\nPakistani Prime Minister Imran Khan’s visit to Moscow to meet Russian President Vladimir Putin amid the Ukraine crisis came under great scrutiny. Many political analysts questioned the timing of the visit, as it presumably gave the wrong signals about where Pakistan stood diplomatically in the Russia-versus-West confrontation. A dominant theme running in the print and electronic media in Pakistan was that Khan’s visit was planned months in advance, that it was for concluding the negotiations over gas pipeline construction, and that it had nothing to do with the Russian invasion of Ukraine.\n\nIn fact, Pakistan did not visit Russia specifically for negotiations over the construction of a $2.5 billion, 1,100-kilometer gas pipeline from Karachi in Pakistan’s south to Lahore in the center of Punjab province. There were no conclusive details on the agreement in the post-visit press release. The pipeline already suffers from bureaucratic wrangling and arguments over who should assume responsibility in case the construction is delayed or faces complications from the uncertain future of imported hydrocarbons in Pakistan. Further, the gas pipeline has dim prospects of ever being constructed now, let alone operationalized, given the West’s extensive sanctions on Russia. Pakistan’s gas pipeline agreement with Iran is also in limbo for similar reasons.\n\nTo say the least, energy cooperation does not represent the flagship area for Pakistan-Russia ties, despite how the Khan visit was framed in media reports. So what is driving Pakistan’s approach to Russia?\n\nPakistan’s Stance on the Ukraine War\n\nDiplomat Brief Weekly Newsletter N Get briefed on the story of the week, and developing stories to watch across the Asia-Pacific. Get the Newsletter\n\nAfter the visit, Pakistan’s stance at the international forums suggested neutrality in the Russia-Ukraine war. Abstaining from the U.N. General Assembly draft resolution condemning Russia’s actions in Ukraine, Pakistan maintained that endorsing the resolution would close the doors to diplomacy. In an earlier press release of the Khan-Putin meeting, Pakistan had urged for a negotiated settlement to the military conflict.\n\nEnjoying this article? Click here to subscribe for full access. Just $5 a month.\n\nRecently, Khan launched a verbal offensive against the European Union ambassadors in Islamabad, as they had urged Pakistan through a public statement to denounce Russia’s war in Ukraine. Khan said that Pakistan was not a slave to follow orders from any country. This reaction was an extension of Khan’s earlier instances of resistance against the U.S.-led drone campaign in Pakistan and Washington’s with-us-or-against-us diktat. Khan instead questioned the West’s position on India’s human rights violations in its administered part of Kashmir.\n\nPolitical analysts with close links to a wider strategic community in Islamabad remarked that the notion of the West’s dual standards has a “genuine appeal” across the political spectrum in Islamabad. That is, political opponents and the media community in Islamabad largely agreed with the substance of Khan’s comments, though they differed on the tone and means of conveying the message. They also condemned Khan’s public ridicule of strong economic and strategic partners in Europe and North America.\n\nGiven this background, how should we understand Pakistan’s neutrality in Russia’s ongoing confrontation with the West? I asked Senator Mushahid Hussain Syed, a former chairperson of the Pakistan Senate’s Foreign Affairs Committee, to explain this. He listed Pakistan’s recent actions that were self-explanatory in that regard: Pakistan’s refusal to join the U.S.-led Summit for Democracies; participation in the Opening Ceremony of the Olympics in Beijing; and then the Moscow visit.\n\nAdvertisement\n\nThese actions may reflect a tilt away from the West, but frankly speaking, Pakistan pursues narrow strategic, security, and economic interests. It does not matter much for the country if it is getting support for its interests from the U.S., Europe, China, Russia, or the Middle East.\n\nPakistan’s Eurasian Interests\n\nPakistan’s refusal to join the democracy summit and Khan’s subsequent visits to Beijing and Moscow do not suggest a shift away from the liberal order and an embrace of autocratic regimes. Nor does it mean that Islamabad would pursue anti-West and pro-Russia/China policies. It only means that after the U.S. withdrawal from Afghanistan, Pakistan understands that Washington will pursue a strategy that focuses on China as a primary strategic threat and the Indo-Pacific region as a primary theater of engagement. With the exit of the United States from its immediate region, Pakistan wants to increase its engagement with other major powers that have major sway in the security and economy of the South and Central Asian region.\n\nPakistan, like any of its neighboring countries, is operating under this overarching architecture of Eurasia, where the Russo-Chinese “axis of convenience” or “modus vivendi” aims to exclude the United States from their sphere of influence in Eurasia. Pakistan seeks to work with Beijing and Moscow to ensure its security interests more or less the same way it did with the U.S. during the alliance periods to secure its objectives.\n\nThis new geopolitical reality is one of the predominant reasons for Pakistan’s new outreach to Russia. Pakistan has lately observed Russia’s important role as the sole arbiter in the Nagorno-Karabakh issue and the intervention of Russia-led Collective Security Treaty Organization (CSTO) forces in Kazakhstan, which ensured the survival of the country’s incumbent government. These events provided strong evidence that Russia is the ultimate guarantor of Eurasian security.\n\nPakistan’s geoeconomic vision and the Vision Central Asia could therefore hinge to a great extent to Russia’s blessings, just as Moscow’s political and security guardianship is helping China’s economic inroads in the region. Without Russia’s backing, Pakistan would find it hard, if not impossible, to work with the Central Asian Republics for inter-regional connectivity and trade projects.\n\nBesides, Pakistan and Russia share an interest in promoting an inclusive government in Kabul. Pakistan could possibly be asking Russia to reason with the Central Asian leaders (and Iran) to cease supporting various political factions in Afghanistan in ways that can lead to a civil war. In exchange, Pakistan would push the Taliban for a power-sharing government with non-Pashtun factions.\n\nEnjoying this article? Click here to subscribe for full access. Just $5 a month.\n\nMoreover, Russia, just like China, is against the rise of political Islam in Eurasia, and Pakistan would also like to balance the Taliban’s power with that of other ethnic elements to keep the Taliban and their political ideology restrained. Pakistan would also be willing to work with Russia, China, and other Eurasian countries toward defeating terrorism in the region, including under the Shanghai Cooperation Organization (SCO).\n\nRussia’s strong relations with India used to be an irritant in Pakistan-Russia ties. But since at least 2010, when New Delhi diversified its foreign arms acquisitions and reduced Russia’s relative share in Indian defense imports, Moscow has tried reaching out to other defense markets. In 2014, for the first time in the history of Moscow-Islamabad ties, Russia lifted its self-imposed embargo on arms sales to Pakistan and did not take India’s objections into account. In 2016, Russia conducted joint friendship exercises for the first time in Pakistan’s northern areas, again ignoring India’s objections.\n\nPakistan also noted an opening in Moscow’s stance in 2017 when the country’s ambassador in Islamabad endorsed Pakistan’s case for a criteria-based membership in the Nuclear Supplier Group (NSG). It did not resonate with New Delhi’s position for merit-based membership in the nuclear export control group of 48 nations. Pakistan also received four Mi-35 helicopters worth $153 million in 2017 as part of a 2015 defense sales agreement.\n\nAdvertisement\n\nAll of this signifies that Pakistan is creating strategic, diplomatic, and economic space in its ties with Russia. This newfound opening can reinforce Pakistan’s geoeconomic vision of South and Central Asian economic integration, bring about a convergence of interests in Afghanistan against terrorism and radical ideology, and act as a moderator on India’s alleged military assertiveness toward Pakistan."}, {"url": "https://www.dawn.com/news/1757548", "page_content": "ISLAMABAD: The Senate Standing Committee on Human Rights on Friday sought from the Ministry of Foreign Affairs details of Pakistani prisoners abroad, including the four detainees and their report of release from Guantanamo prison in a chronological order.\n\nThe committee was apprised that two detainees (Rabbani brothers), and Majid Khan were released in February 2023. The Rabbani brothers were repatriated to Pakistan as free citizens.\n\nExpressing concern over the harassment of Pakistani women in the American non-governmental organisation (NGO) working in the health sector in Pakistan, members remarked that if such incidents had happened in the United States, there would not have been silence.\n\nThe committee recommended to the Ministry of Interior and the Ministry of Economic Affairs that all private and public institutions should form an Internal Harassment Committee.\n\nRecommends public, private institutions to form harassment committees\n\nThe meeting was held at the Parliament House under the chairmanship of Senator Walid Iqbal. Senator Syed Waqar Mehdi, Abida Azeem, Falak Naaz Chitrali, Dr Humayun and Senator Seemee Ezdi were present in the meeting. Federal secretary for human rights, foreign ministry officials, and other officials concerned also attended the meeting.\n\nMinistry officials told the committee that one of the prisoners, who was held in Guantanamo had reached Pakistan on Feb 24, 2023, and was in Karachi.\n\nSenator Seemee Ezdi said that he had been in jail for 21 years without charges. Senator Humayun Mohmand said that it was a shame that until the senator raised this issue, the government abandoned its citizens and no one asked about it. Senator Mushahid Hussain Syed said that in 2008, he took a delegation to the US and went to meet Aafia Siddiqui. It was also highlighted that $1.2 million from the government was consumed for the lawyer in Aafia’s case.\n\nSenator Waqar Mehdi said that the Rabbani brothers should be called to the committee to tell their story. The committee was apprised that Majid Khan had not come to Pakistan. He was imprisoned for 19 years but had now been released, however he did not return to Pakistan.\n\nOfficials of the foreign ministry told the committee that the US embassy had highlighted that there was no longer any Pakistani in Guantanamo Bay. Mr Syed questioned what the citizenship of Khalid Sheikh Mohammad, who was arrested in Karachi, was.\n\nPakistan had never demanded compensation for the loss of life to it as a result of war from North Atlantic Treaty Organisation (Nato), Mr Syed said.\n\nThe issue of sexual harassment of female employees of an NGO was taken into consideration. Chairman of the committee Walid Iqbal said that the law to protect women from workplace harassment in Pakistan had been in place since 2010. Many female employees of the NGO had complained about sexual harassment. So far, five women had filed a written complaint against the NGO. The committee learnt that harassment had been going on in this NGO for five to seven years and complaints to the administration had been in vain.\n\nThe head of the NGO in Pakistan presented his position in front of the committee and said that now the harassment committee had been established. It was observed that not forming the committee was a violation of the Harassment Act.\n\nThe standing committee passed a resolution condemning the incidents of May 9.\n\nThe resolution stated that the committee condemned the attacks on military and civilian installations on May 9. It was further highlighted that strong defence institutions were part of a strong democratic system and action should be taken against the people involved in violence. It was resolved that according to international agreements, these people should be given the right to a transparent trial.\n\nPublished in Dawn, June 3rd, 2023"}]}