{"Kia Joorabchian (born 1972) is an Iranian-born British-based businessman, investor, and philanthropist.": [{"url": "https://peoplepill.com/people/kia-joorabchian/", "page_content": "Kiavash \"Kia\" Joorabchian (Persian: کیاوش جورابچيان‎‎) is an Iranian-born British-educated businessman largely involved in association football.\n\nIn the register of directorships at Companies House in London, Joorabchian gives two nationalities, Canadian and British, born on 14 July 1971.\n\nAlthough routinely described in the press as a football agent, Joorabchian is not a licensed agent. The involvement of unlicensed agents in transfers in the English Premier League is prohibited by the Football Association. Joorabchian does not himself claim to be an agent, saying \"I think the agency business is very different\". He describes his business as advising players on their rights and clubs on transfers and contracts.\n\nJoorabchian is also involved in the 'third-party' ownership of players, describing himself as an investment manager. In October 2008, he said, \"I manage the investment group and obviously when the investment group is profitable, as fund manager, you also get a cut\". In 2009 it was reported that the unnamed investors represented by Joorabchian were understood to own the economic rights to 60 or 70 players across Europe and South America.\n\nHe has supported Arsenal Football Club since his childhood and later kept a corporate box at their Emirates Stadium. Due to his association with Arsenal he has forged a close relationship with David Dein and his son Darren.\n\nJoorabchian was educated at Shiplake College in Oxfordshire and then at a school in Golders Green, north London. He went on to study chemistry and business studies at Queen Mary and Westfield College, University of London, dropping out after his second year.\n\nKia Joorabchian was born in Tehran, Iran, the son of Iranian car-dealer businessman, Mohammed Joorabchian. According to Joorabchian his father's uncle had once run the biggest car manufacturer in the Middle East. The Joorabchian family emigrated from Iran following the fall of the Shah in 1979. They went to the United Kingdom and then Canada, returning to England when Joorabchian was 12. His father ran car dealerships, including Medway Autos in Kent.\n\nAlthough Joorabchian suffered in the stock market crash of 2001, his sale of American Capital after that volatility brought him, on his own estimate, between £50 million and £60 million.\n\nA year later, in 1999, American Capital bought 85% of the Russian newspaper Kommersant. After a month Kommersant’s ownership passed to the oligarch Boris Berezovsky, who was widely suspected to have been behind American Capital’s bid for the paper -something denied by Joorabchian who was said to have given assurances that he was not working on anyone else’s behalf. Raf Shakirov, who was replaced as editor after Berezovsky’s acquisition of Kommersant, told the British newspaper The Mail on Sunday in 2005 “Joorabchian was and is very much Berezovsky’s man”.\n\nJoorabchian worked first for his father and then as a trader at the International Petroleum Exchange in London. He became involved in the stock market and fund management, moving to New York City and establishing, with his associate, Reza Irani-Kermanian, an investment company, American Capital, based in Manhattan but registered in the British Virgin Islands.\n\nInvolvement in football\n\nMedia Sports Investments and Corinthians\n\nIn 2004, Joorabchian founded Media Sports Investments to make a partnership with Brazilian football club Corinthians. He had briefly considered becoming involved at Arsenal, but found it too expensive and had instead been pointed towards Brazilian football by Pele's agent and the recommendation of Pini Zahavi, the so-called 'super agent', whom Joorabchian described in 2006 as a friend of long standing.\n\nThe partnership with Corinthians's was a 10-year deal stipulating that MSI would provide $35 million –$20 million of which would cover debts– in return for 51% of future profits. Joorabchian moved to Brazil and changed the way Corinthians was run, increasing revenue by 500% in the first year.\n\nA series of major signings followed MSI's investment, including, most spectacularly, Carlos Tevez, who was signed from Boca Juniors for $22 million, an unprecedented amount for a transfer by a South American club. These were players who were engaged to play for Corinthians but whose economic rights were partly or wholly owned by MSI. By 2006 the company was listing as its investments not just Corinthians, but also the players Carlos Tevez, Marcelo Mattos, Gustavo Nery, Roger, Javier Mascherano, Carlos Alberto, Sebastián Domínguez and Marinho. In 2005 Corinthians won its fourth Brazilian title.\n\nThe Tevez transfer was brokered by the Argentinian football agent Fernando Hidalgo, who was a partner in the company HAZ Sports with Pini Zahavi. Zahavi, responsible for numerous football deals, including the acquisition of Chelsea Football Club by Roman Abramovich, acted as a broker for MSI.\n\nThe source of the money behind MSI was a subject of considerable speculation. The Spanish sports newspaper Diario AS suggested that a 15% share was owned by Abramovich, while Joorabchian’s name continued to be linked to that of Berezovsky. In 2005 the Georgian businessman and owner of Dinamo Tbilisi, Badri Patarkatsishvili, a close associate of Berezovsky, told a journalist that they had indeed invested in Corinthians. Joorabchian himself was described by Brazilian authorities as \"trying, at all costs, to hide knowledge of the people and businesses involved in the transactions\".\n\nIn 2007, following allegations that Corinthians had been used to launder money, a Brazilian judge, Faustus Martins de Sanctis, ordered the arrest of Berezovsky, Joorabchian, Nojan Bedroud, cofounder of MSI, and four officials of club, including the chairman, Alberto Dualib. MSI responded by saying that the judge’s actions were \"absurd, arbitrary and lacking legal backing\", while Joorabchian denied any wrongdoing and maintained that all payments made to Corinthians were \"cleared through and approved by the Brazilian Central Bank\".\n\nThe Brazilian court papers setting out the evidence on which the warrants of arrest were issued stated: “MSI belongs and has always belonged to the accused, Boris Berezovsky”. Berezovsky denied any business connection with Joorabchian or MSI.\n\nIn the light of these developments Corinthians broke off their association with MSI in July 2007. There had already been a public deterioration in relations between the directors of the club and its investors centering on the involvement of MSI and Joorabchian in the team's affairs, and the fact that the club had been left owning only five members of the playing squad. Tevez and Mascherano had been transferred to West Ham United and there had been seven different managers in 18 months. In December 2007 Corinthians were relegated from Brazil's first division.\n\nThe warrant for Joorabchian's arrest was suspended by the Brazilian authorities in August 2008.\n\nIn April 2014, The judge totally absolved the whole case saying there was never anything done wrong by anyone in the case at all. \"In this case, there is no proof of a single offense, nor is it pointed out that the alleged group ever have had any intention or interest in the committing any crimes,\" added the judge.\n\nTevez, Mascherano and West Ham United\n\nJoorabchian stepped down as president of Media Sports Investments in June 2006. It was reported at the time that Joorabchian retained an investment in Tevez and Mascherano, whose economic rights were described as being owned by MSI. A subsequent Premier League investigation revealed that in February 2006 rights in Tevez had been transferred to MSI (company id: 05218027) and a second company, Just Sports Inc., while Mascherano was jointly owned by Global Soccer Agencies and Mystere Services Ltd. All four companies were represented by Joorabchian.\n\nIn August 2006 the two players joined West Ham in the English Premier League. Pini Zahavi assisted in the transfers, revealing to the press that he stood to make money if the players were a success in England. Zahavi had an association over a number of years with Global Soccer Agencies, owners of a half share in Mascherano.\n\nZahavi also suggested that he had the idea for Joorabchian's proposed takeover of West Ham itself, \"Was it my idea? Yes it was,\" Zahavi said. Joorabchian had investigated the possibility of a takeover of the club the autumn before Tevez and Mascherano moved to West Ham, promising to make £100 million available for new players in a £200 million deal valuing the club and its debts at £75 million. The takeover floundered when it proved impossible to agree a valuation for the club but the possibility was revived following the Tevez/Mascherano transfer. Patarkatsishvili announced that he was considering becoming involved in the bid. In the end no offer resulted and the club was sold to a consortium headed by Eggert Magnusson.\n\nAlthough the capture of Tevez and Mascherano was reported as a major coup for West Ham, the third-party ownership of the players proved highly controversial. At that time the practice was permitted as long as the investing party exercised no influence over the club's playing or transfer policy. It has been reported that Joorabchian in fact retained the power to transfer either player at any time during their contracts.\n\nIn April 2007 West Ham was fined a record £5.5 million by the Premier League for entering into third-party contracts whose existence they did not reveal in the knowledge that, in the words of the Premier League's findings, \"the FAPL at the very least may not - and in all probability would not - have approved of such contracts\". When Tevez was instrumental in West Ham's avoiding relegation at the end of the 2006-7 season the position was legally challenged by the relegated club, Sheffield United, on the ground that Tevez should have been ineligible to play. The claim was eventually settled out of court in March 2009 with West Ham paying Sheffield United £20 million over five years.\n\nSpeculation has subsequently linked Joorabchian with the takeover of the football clubs Fulham, in early 2007, and Southampton, in January 2008.\n\nTransfer of Tevez to Manchester United and then to Manchester City\n\nIn August 2007 Carlos Tevez moved from West Ham United to Manchester United. The deal was subject to a protracted dispute with West Ham claiming that the player was registered to them and contracted until June 2010. The Premier League insisted that negotiations should be \"done directly\" with the club who should receive the fee for any transfer. Joorabchian maintained that MSI and Just Sports Inc retained the economic rights to the player and that the deal had been negotiated with the \"knowledge and permission\" of West Ham. In a statement issued on behalf of MSI Joorabchian said that West Ham had \"consistently provided private assurances while at the same time making contrary statements to the public at large\".\n\nAsked for a ruling by the Football Association and the Premier League, FIFA judged that the matter should be referred to the Court of Arbitration for Sport. MSI and Just Sports Inc then issued a writ in order to \"compel West Ham to release the registration of Carlos Tevez in accordance with contracts entered into between the parties\".\n\nThe threat of action in the High Court was avoided by a settlement that saw West Ham receive a fee of £2 million for Tévez's registration. Joorabchian later claimed that West Ham agreed to return the money with additional legal costs bringing the total to £2.6 million, apparently contradicting the club’s claim to the Premier League that they would be the beneficiary of the fee.\n\nThe terms of the transfer saw Manchester United agree a two-year deal in which Tevez's registration was leased by the club while his economic rights were retained by his third-party owners. Manchester United paid £3-4 million a year for Tevez's commercial and football rights for the duration of the lease and secured the first option on a permanent transfer.\n\nIn September 2009 Tevez signed for Manchester City in a deal removing him from third-party ownership sometimes reported as being worth £47 million to the companies owning his economic rights, although that amount was disputed by Joorabchian who called the story \"inaccurate and misleading\".\n\nLegal dispute with West Ham United\n\nIn 2008, Joorabchian became engaged in a legal dispute with West Ham United over what he said were unmet payments by the club of £4.5 million and £2.6 million relating to Tevez. Joorabchian claimed that he brokered a resolution between West Ham and the two companies, MSI and Just Sports Inc, who owned the player's economic rights and who initially refused to cancel that third-party arrangement as requested by the Premier League as part of their findings of April 2007. Potentially Tevez would not have played in the final two games of the 2006-7 season.\n\nJoorabchian stated that the payments were to cover costs, the player’s salary, expenses and a loan fee, as well as £2 million he claimed to have paid to West Ham for Tevez's registration as part of the deal that saw the player transferred to Manchester United in August 2007. Joorabchian's allegation that Tevez received a salary and expenses other than that paid to him by West Ham, would –were those payments to have been met by a third party– have breached the Premier League's regulations. West Ham United claimed they were unaware of such payments.\n\nThe eventual out-of-court settlement of these proceedings saw Joorabchian engaged as a consultant by West Ham with fees of more than £2 million. In this capacity Joorabchian was critical of transfer dealings made by Eggert Magnusson and the club's former manager, Alan Curbishley, who resigned saying that transfer policy had been taken out of his hands.\n\nDefence of 'Third-Party' ownership\n\nTevez's ownership and the role of Joorabchian in English football remained highly controversial throughout the period up to the player's transfer to Manchester City in September 2009. Joorabchian's continued opacity on the question of the identity of those behind the companies he represented was a point of particular discussion.\n\nThe heavily criticised involvement of third parties in the ownership of players was banned by the Premier League for the start of the 2008-9 season. One high-ranking official had called it, \"an unedifying trade in young people that rips the heart out of clubs which try to develop players\". Joorabchian himself offered a defence of the arrangement, calling it \"the South American model and a model that appears all over Europe\". In his view third-party transfers are \"a way of bringing outstanding players to clubs that would not be able to afford them ordinarily. So they increase the competition\", further explaining: \"What happens, in Brazil particularly, clubs cannot afford to buy a player. So they go to a business, a bank, a major supermarket, an individual, a person, a wealthy individual and say: 'We want Mr X. You put up 70, 80, 100 per cent of the money, let him play here.' It is a little bit like a loan deal between two clubs, except it is a loan deal between the club and a third party\".\n\nJoorabchian also claimed that concealed third-party ownership arrangements were common in the Premier League, saying in 2007: \"I know a lot of players in the Premier League - and other leagues - which are here in the same format as we have done, but in a hidden scheme\".\n\nConnection to Manchester City\n\nIn January 2009 it emerged that Joorabchian had been present at a meeting between representatives of Manchester City and A.C. Milan, arranged to discuss the possible -although in the end unsuccessful- £91 million transfer to City of the Brazilian footballer, Kaká.\n\nPress reports connected Joorabchian to City's signing of Robinho in 2008 and suggested that he was exercising a wider influence over the shape of City's transfer policy, specifically in attempting to bring a single megastar to the club to reflect a changed status under the ownership of Mansour bin Zayed Al Nahyan, rather than build a side of proven Premier League performers. Joorabchian admitted to having an informal association with Manchester City in October 2008.\n\nSources at Manchester City suggested that Joorabchian and Pini Zahavi had developed links to the club under the regime of the previous owner, Thaksin Shinawatra, who had originally appointed the City chief executive Garry Cook. Cook himself said that the club \"did not need and did not seek\" Joorabchian's help in facilitating the negotiations with A.C. Milan. Joorabchian was involved in the leaking of Carlos Tevez's transfer request to Manchester City on 11 December 2010, by revealing the news to the Sunday Mirror newspaper.\n\nInvolvement with Ramires\n\nIn June 2010, it was reported that Joorabchian had secured a 50% share in the Brazilian midfielder Ramires for €6 million (through Jazzy Limited, Joorabchian as sole director), then at Benfica but subject to transfer interest from across Europe, led by Chelsea in the Premier League. The deal was reportedly part of an agreement reached with Benfica president Luís Filipe Vieira the previous year at the time of Ramires's transfer to Benfica from Cruzeiro in Brazil.\n\nBenfica declared in its financial report that the club received €11 million (50% of the fee) and generated €8.8 million profit.\n\nRamires completed his move to Chelsea on 13 August 2010 on a four-year contract for a fee of €22 million. It is thought that Joorabchian would receive around €11 million of this fee, which Benfica also revealed in its financial report that the club had a net debt of €5,479,526 to Jazzy Limited, excessed €479,526 by €11 million minus €6 million.\n\nNewcastle United\n\nOn 12 January 2010, it was reported by outlets such as ESPN that Joorabchian had been appointed to the position of \"Football Advisor\" at the club, and would be leading a clear-out of players, bringing in talented youth from around the world.\n\nSports Invest UK Limited\n\nJoorabchian is the sole director of Sports Invest UK Limited, with registered FIFA agent Nojan Bedroud. The company was a creditor of Portsmouth F.C. for £600,000."}, {"url": "https://www.thesun.co.uk/sport/horseracing/16694049/kia-joorabchian-racing/", "page_content": "IT was only after someone 'did a job' on football agent Kia Joorabchian that he was inspired to get involved with racing.\n\nKnown for his work with footballers Carlos Tevez and Javier Mascherano, Joorabchian has become a leading racing stakeholder through his ownership outfit Amo Racing.\n\n1 Kia Joorabchian came to prominence as a football agent\n\nHowever, his life in the sport has not always been quite so smooth.\n\nIn an interview with the Racing Post, the 50-year-old described how in 2003 being swindled out of £40,000 on the very first horse he bought inspired him to get more involved in the sport.\n\n\"The first horse that I bought went very, very wrong,\" Joorabchian said.\n\n\"I was quite young and somebody did a good job on me. I think they saw me coming. They saw a young guy and probably underestimated me, which kind of got under me a little bit.\n\n\"I didn't have the financial power or the ability at that time to compete. I think that horse cost £40,000 at the time, which was a lot of money for me and that hurt.\"\n\nWhile his life in racing may have gotten off on the wrong foot, Joorabchian has made up for it in the ensuing years.\n\nAfter having his first winner as an owner in 2004, the Iranian-born Joorabchian slowly increased his stake in the sport.\n\n\"In 2018 I decided to pump it up a bit,\" he told the Racing Post. \"I thought if I'm going to do this I may as well try and buy better horses.\"\n\nAnd that decision has started to pay dividends.\n\nAmo Racing have thus far had 47 winners on the Flat in 2021 and recently Joorabchian signed a ticket worth 425,000 gns for a Kingman colt at the Tattersalls Book 1 sale.\n\nThe likes of Go Bears Go and Hello You won prestigious races in 2021 for Amo, while Mojo Star finished second in the Derby.\n\nOFFERS OF THE DAY William Hill: Bet £10 get £40 - £30 in free sports bets + £10 Casino Bonus - CLAIM HERE Betfair - Get A £20 Free Bet when you place £50 worth of bets. Repeat up to 5 times for £100 Free Bets- CLAIM HERE Sky Bet: Bet £10 Get £40 in Free Bets - CLAIM HERE Paddy Power: Bet £20 and get it back as Cash if it Loses - CLAIM HERE William Hill: 18+. Play Safe. New customers using promo code M40 only. 1x per customer. Min £/€10 bet. Min odds 1/2 (1.5). Free bets of 2 x £/€15 issued after first qualifying bet settles. Max £/€10 Bonus. 35x wagering requirement. Max redeemable bonus: £25. Casino bonus expires after 72 hours. UK & Eire only. Additional T&Cs, including free-bet, game, location, payment method and stake contributions apply. Begambleaware.org Betfair - New customers place £50 worth of bets to receive £20 in free bets. Repeat up to 5 times to receive maximum £100. Min odds 1.2 (1/5). Multiple bets included. Exchange bets excluded. Payment restrictions apply. T&Cs apply. 18+ BeGambleAware.Org Sky Bet: NEW CUSTOMERS ONLY. FIRST SINGLE & E/W BET ONLY. ODDS OF 1/1 OR GREATER. 4 X £10 BET TOKEN. FREE BET STAKES NOT INCLUDED IN RETURNS. FREE BETS FOR HORSE RACING & FOOTBALL ONLY. FREE BETS ARE NON WITHDRAWABLE. NO FREE BET EXPIRY. ELIGIBILITY RESTRICTIONS AND FURTHER T&CS APPLY. 18+. BEGAMBLEAWARE.ORG. Paddy Power: New customers only. Place your FIRST bet on any sportsbook market and if it loses we will refund your stake in CASH. Max refund for this offer is £/€20. Only deposits made using Cards or Apple Pay will qualify for this promotion. T&Cs apply. Paddy's Rewards Club: Get a £/€10 free bet when you place 5x bets of £/€10+. T&Cs apply. 18+ Begambleaware.org\n\nRemember to gamble responsibly\n\nA responsible gambler is someone who:\n\nEstablishes time and monetary limits before playing\n\nOnly gambles with money they can afford to lose\n\nNever chase their losses\n\nDoesn’t gamble if they’re upset, angry or depressed\n\nGamcare – www.gamcare.org.uk\n\nGamble Aware – www.begambleaware.org\n\nFor help with a gambling problem, call the National Gambling Helpline on 0808 8020 133 or go to www.gamstop.co.uk to be excluded from all UK-regulated gambling websites.\n\nCommercial content notice: Taking one of the bookmaker offers featured in this article may result in a payment to The Sun. 18+. T&Cs apply. Begambleaware.org"}, {"url": "https://www.liquisearch.com/kia_joorabchian", "page_content": "Kia Joorabchian\n\nKiavash \"Kia\" Joorabchian (Persian: کیاوش جورابچيان‎) is an Iranian-born British-educated businessman largely involved in association football.\n\nIn the register of directorships at Companies House in London, Joorabchain gives two nationalities, Canadian and British, as well as two names, \"Kia Joorabchian\" and \"Kia Kavash\", and two dates of birth, 14 July 1971 and 25 July 1971.\n\nAlthough routinely described in the press as a football agent, Joorabchian is not a licensed agent. The involvement of unlicensed agents in transfers in the English Premier League is prohibited by the Football Association. Joorabchian does not himself claim to be an agent, saying \"I think the agency business is very different\". He describes his business as advising players on their rights and clubs on transfers and contracts.\n\nJoorabchian is also involved in the 'third-party' ownership of players, describing himself as an investment manager. In October 2008, he said, \"I manage the investment group and obviously when the investment group is profitable, as fund manager, you also get a cut\". In 2009 it was reported that the unnamed investors represented by Joorabchian were understood to own the economic rights to 60 or 70 players across Europe and South America."}, {"url": "https://9jaenthub.com.ng/kia-joorabchian-biography/", "page_content": "Kia Joorabchian is an Iranian-born, British-educated businessman who plays a significant role in association football.\n\nKia Joorabchian Biography\n\nThe Iranian car trader, Mohammed Joorabchian’s son, Kia Joorabchian, was born in Tehran on July 14, 1971. According to Joorabchian, his father’s uncle formerly headed the Middle East’s largest vehicle production facility.\n\nInitially attending Golders Green School in north London, Joorabchian then proceeded to Shiplake College in Oxfordshire. He continued his studies at Queen Mary and Westfield College, University of London, where he double majored in chemistry and business, before dropping out after his second year.\n\nThe Joorabchian family departed Iran after the Shah was overthrown in 1979. They departed for the UK when Joorabchian was six years old, traveled to Canada, and then returned to England. Medway Autos in Ken was one of the auto dealerships his father owned and managed.\n\nKia Joorabchian Age\n\nHow old is Kia Joorabchian? Kia Joorabchian is currently 51 years old. He was born in Tehran, Iran.\n\nKia Joorabchian Career\n\nBefore moving up to a dealer position at the London-based International Petroleum Exchange, Joorabchian began his career as a worker for his father. He settled in New York City and, along with Reza Irani-Kermanian, co-founded American Capital, a company with its main office in Manhattan and British Virgin Islands registration. After relocating there, he became involved in the stock market and money management.\n\nOn January 12, 2010, ESPN announced that Joorabchian had been hired to the position of “Football Advisor” at the team and would be in charge of organizing a player purge that would bring in brilliant young players from all around the world.\n\nAccording to a Financial Times probe into Joorabchian’s other business interests in 2006, Joorabchian was registered as a director of eleven UK companies, including Karma Racing, a horse racing organization, and Karma, a kickboxing club in Chalk Farm, London. At the time, Greens of Rainham, a car dealership, was his biggest stake declared.\n\nJoorabchian is the only director of Sports Invest UK Limited, which is represented by Nojan Bedroud, a qualified FIFA agent. The company owed Portsmouth F.C. £600,000.\n\nKia Joorabchian Height\n\nHow tall is Kia Joorabchian? Kia Joorabchian stands at 5 feet 11 inches tall.\n\nKia Joorabchian Parents\n\nWho are the parents of Kia Joorabchian? Mohammed Joorabchian, Kia Joorabchian’s father, gave birth to him. His mother’s identity is unknown. Mohammed Joorabchian is an Iranian businessman and car trader.\n\nKia Joorabchian Wife: Is Kia Joorabchian married?\n\nTatiana Alonso is married to Kia Joorabchian. They got wedded in 2007. Tatiana Alonso is a Brazilian attorney and restaurant owner.\n\nKia Joorabchian Children\n\nDoes Kia Joorabchian have any children? No, Kia Joorabchian has no chidren. There is no currently no information about his children.\n\nKia Joorabchian Siblings\n\nRegarding Kia Joorabchian’s siblings, nothing is known currently.\n\nKia Joorabchian has an estimated net worth of $5 million.\n\nWe appreciate you taking the time to read Jessie Lemonier Biography And Net Worth. It would be helpful if you could share the information about this article on social media. You might find it interesting to read More Biography and Net Worth before you leave."}, {"url": "https://www.primidi.com/kia_joorabchian/family_background_and_education", "page_content": "Family Background and Education\n\nKia Joorabchian was born in Tehran, Iran, the third son of an Iranian car-dealer businessman, Mohammed Joorabchian. According to Joorabchian his father's uncle had once run the biggest car manufacturer in the Middle East. The Joorabchian family emigrated from Iran following the fall of the Shah in 1979. They went to the United Kingdom and then Canada, returning to England when Joorabchian was 12. His father ran car dealerships, including Medway Autos in Kent.\n\nJoorabchian was educated at Shiplake College in Oxfordshire and then at a school in Golders Green, north London. He went on to study chemistry and business studies at Queen Mary and Westfield College, University of London, dropping out after his second year.\n\nHe has supported Arsenal Football Club since his childhood and later kept a corporate box at their Emirates Stadium. Due to his association with Arsenal he has forged a close relationship with David Dein and his son Darren.\n\nJoorabchian is married to Brazilian lawyer and restaurateur Tatiana Alonso."}, {"url": "https://www.celebsagewiki.com/kia-joorabchian", "page_content": "Age, Biography and Wiki\n\nKia Joorabchian (Kiavash Joorabchian) was born on 14 July, 1971 in Tehran, Iran, is a Businessman. Discover Kia Joorabchian's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 51 years old?\n\nPopular As Kiavash Joorabchian Occupation Businessman Age 51 years old Zodiac Sign Cancer Born 14 July 1971 Birthday 14 July Birthplace Tehran, Iran Nationality Iran\n\nWe recommend you to check the complete list of Famous People born on 14 July. He is a member of famous Businessman with the age 51 years old group.\n\nKia Joorabchian Height, Weight & Measurements\n\nAt 51 years old, Kia Joorabchian height not available right now. We will update Kia Joorabchian's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Kia Joorabchian's Wife?\n\nHis wife is Tatiana Alonso (m. 2007)\n\nFamily Parents Not Available Wife Tatiana Alonso (m. 2007) Sibling Not Available Children Not Available\n\nKia Joorabchian Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Kia Joorabchian worth at the age of 51 years old? Kia Joorabchian’s income source is mostly from being a successful Businessman. He is from Iran. We have estimated Kia Joorabchian's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Businessman\n\nKia Joorabchian Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Kia Joorabchian Wikipedia Imdb\n\nTimeline"}, {"url": "https://networthandsalary.com/kia-joorabchian/", "page_content": "Check our most recent updates about Kia Joorabchian’s Estimated Net Worth, Age, Biography, Career, Height, Weight, Family, Wiki. Also learn detailed information about Current Net worth as well as Kia Joorabchian’s earnings, Worth, Salary, Property, and Income.\n\nKia Joorabchian is an Iranian-born businessman with a strong interest in association football. Joorabchian, a self-described investment manager, is also involved in ‘third-party’ athlete ownership. “I oversee the investment group, and clearly when the investment group is successful, you also receive a portion as a fund manager,” he remarked in October 2008.\n\nIn 2009, it was reported that the anonymous investors represented by Joorabchian had the economic rights to 60 or 70 players in Europe and South America.\n\nNet Worth and Salary of Kia Joorabchian\n\nAccording to Wikipedia, Forbes, IMDb, and other internet sources, Kia Joorabchian’s net worth is believed to be between $1 and $5 million.\n\nAs a business professional, he earned the money.\n\nBirth, Parents, Siblings & Education of Kia Joorabchian\n\nKia Joorabchian was born in Tehran, Iran, on July 14, 1971, as the son of Iranian car merchant Mohammed Joorabchian.\n\nHis father’s uncle, according to Joorabchian, previously ran the Middle East’s largest vehicle manufacturer.\n\nThe Joorabchian family fled Iran after the Shah was overthrown in 1979.\n\nWhen Joorabchian was six years old, they traveled to the United Kingdom and subsequently to Canada before returning to England.\n\nHis father was the owner and operator of several car dealerships, including Medway Autos in Ken.\n\nBefore attending a school in Golders Green, north London, Joorabchian attended Shiplake College in Oxfordshire.\n\nHe went on to Queen Mary and Westfield College, University of London, to study chemistry and business studies before dropping out after his second year.\n\nFacts of Kia Joorabchian\n\nFull Name Kiavash Joorabchian NickName Kia Joorabchian Famous as Businessman Birth Date 14 July 1971 Age 50 years old Horoscope Aquarius Birth Place Tehran, Iran Father’s Name Mohammed Joorabchian Mother’s Name N/A Siblings N/A Height 5 ft 11 in Weight 58 kg Body Measurements N/A Nationality Iranian Ethnicity Mixed Eye Color Black Hair Color Black Education N/A Girlfriend Single Spouse Tatiana Alonso Net Worth $1 million – $5 million\n\nProfessional Career of Kia Joorabchian\n\nBefore becoming a dealer at the International Petroleum Exchange in London, Joorabchian worked for his father.\n\nHe became interested in the stock market and fund management, coming to New York City and co-founding American Capital with his colleague Reza Irani-Kermanian, which is based in Manhattan but registered in the British Virgin Islands.\n\nOn January 12, 2010, ESPN reported that Joorabchian had been appointed to the position of “Football Advisor” at the club and that he would be overseeing a player purge, bringing in promising young players from all around the world.\n\nAccording to a 2006 Financial Times inquiry of Joorabchian’s other business interests, he was a director of eleven UK companies, several of which were losing money, including Karma Racing and Karma, a kick-boxing club in Chalk Farm, London.\n\nAt the time, his biggest reported stake was in Greens of Rainham, a car dealership.\n\nNojan Bedroud, a certified FIFA agent, represents Joorabchian as the sole director of Sports Invest UK Limited. The company was a creditor to Portsmouth F.C. for £600,000.\n\nRelationship Status of Kia Joorabchian\n\nTatiana Alonso, a Brazilian lawyer, and restaurant owner is Joorabchian’s wife.\n\nHe keeps his personal life away from the press. There are no rumors or scandals about Kia Joorabchian.\n\nHe has stayed away from rumors that could endanger his career.\n\nHe, on the other hand, has a spotless background and has never been involved in any scandals.\n\nHeight, Weight & Body Measurement of Kia Joorabchian\n\nKia Joorabchian stands at a height of 5 feet 11 inches.\n\nHe is about 58 kilograms in weight (121 lbs).\n\nHis eyes are warm and black, and his hair is black.\n\nHe has the following physical measurements: 36-28-34 inches.\n\nAlso Read: Gene Pierson, Tony Robbins, Dan Avidan\n\nQuick Facts of Kia Joorabchian"}, {"url": "https://popularbio.com/kia-joorabchian-net-worth-bio-wife-height-career/", "page_content": "Updated On April 30, 2023\n\nKia JoorKia Joorabchianhian is a British-educated Iranian-born investor who plays a lot of football. JoorKia Joorabchianhian, a self-described investment manager, is engaged in ‘third-party’ athlete ownership.\n\n“I oversee the investment group,” he said in October 2008, “and, when the investment group is successful, you also receive a share as a fund manager.” In 2009, it was alleged that the unidentified investors represented by JoorKia Joorabchianhian held the economic rights of 60 or 70 players across Europe and South America.\n\nWhat is the Net Worth of Kia Joorabchian? Salary, Earnings\n\nKia JoorKia Joorabchianhian’s net worth is believed to be between $1 and $5 million as of January 2023, according to Wikipedia, Forbes, IMDb, and other online sources. As a business expert, Kia JoorKia Joorabchianhian made money.\n\nWhere was Kia Joorabchian born? Ethnicity, Nationality, Family, Education\n\nKia JoorKia Joorabchianhian was born on July 14, 1971, in Tehran, Iran, as the son of Iranian car trader Mohammed JoorKia Joorabchianhian. According to JoorKia Joorabchianhian, his father’s uncle once controlled the Middle East’s largest automobile factory. The JoorKia Joorabchianhian family left Iran after the Shah was deposed in 1979. When JoorKia Joorabchianhian was six years old, they went to the United Kingdom and Canada before returning to England. His father owned and managed car dealerships, including Medway Autos in Ken.\n\nJoorKia Joorabchianhian went to Shiplake College in Oxfordshire before joining a school in Golders Green, north London. He resumed his studies at Queen Mary and Westfield College, University of London, where he majored in chemistry and business before dropping out after his second year.\n\nIs Kia Joorabchian Single? Relationship\n\nJoorKia Joorabchianhian is married to Tatiana Alonso, a lawyer and eatery owner from Brazil. Kia JoorKia Joorabchianhian is not the topic of any rumors or scandals. He maintains his personal life away from the media. Kia JoorKia Joorabchianhian has avoided saying anything that could jeopardize his livelihood. He does, however, have a spotless reputation and has never been involved in any scandals.\n\nHow tall is Kia Joorabchian? Weight, Hair Color\n\nKia JoorKia Joorabchianhian stands 5’11” tall. He is roughly 58 kg in weight. (121 lbs). He has beautiful warm dark eyes and black hair. His physical dimensions are 36-28-34 inches.\n\nAlso Read: How Does Katie George, An ESPN Sporyscaster, Get Paid?"}, {"url": "https://www.ghgossip.com/kia-joorabchian-bio-age-height-career-wife-children-net-worth/", "page_content": "Kia Joorabchian Bio, Age, Height, Career, Wife, Children, Net Worth – In this piece you will get to know all about Kia Joorabchian.\n\nBut then who is Kia Joorabchian? Iranian-born, British-educated businessman Kiavash Joorabchian plays a significant role in association football.\n\nADVERTISEMENT\n\nA lot of people have been inquiring lot about Kia Joorabchian and making various research about him on the internet.\n\nThis article talks about Kia Joorabchian and everything there is to know about him.\n\nBiography of Kia Joorabchian\n\nKia Joorabchian, the son of Iranian car salesman Mohammed Joorabchian, was born on July 14, 1971, in Tehran, Iran. Joorabchian said that the largest vehicle manufacturing in the Middle East used to be run by his father’s uncle.\n\nJoorabchian first attended Golders Green School in north London before going to Shiplake College in Oxfordshire. Prior to quitting after his second year, he continued his education at Queen Mary and Westfield College, University of London, where he double-majored in chemistry and business.\n\nAfter the Shah was toppled in 1979, the Joorabchian family left Iran. When Joorabchian was six years old, they left for the UK, went to Canada, and then came back to England. One of the vehicle dealerships his father owned and ran was Medway Autos in Ken.\n\nJoorabchian first attended Golders Green School in north London before going to Shiplake College in Oxfordshire. Prior to quitting after his second year, he continued his education at Queen Mary and Westfield College, University of London, where he double-majored in chemistry and business.\n\nKia Joorabchian Age\n\nHow old is Kia Joorabchian? Kia Joorabchian is 51 years old. He was born in Tehran, Iran.\n\nKia Joorabchian Height\n\nHow tall is Kia Joorabchian? Kia Joorabchian has a height of 5 feet 11 inches.\n\nKia Joorabchian Parents\n\nWho are the parents of Kia Joorabchian? Kia Joorabchian was born to Mohammed Joorabchian who is his father. There is no information about his mother. Mohammed Joorabchian is an Iranian car-dealer businessman.\n\nADVERTISEMENT\n\nKia Joorabchian Wife\n\nIs Kia Joorabchian married? Yes, Kia Joorabchian is married to Tatiana Alonso. They got married in 2007. Tatiana is a Brazilian lawyer and restaurant owner.\n\nKia Joorabchian Siblings\n\nThere is no information about the siblings of Kia Joorabchian.\n\nKia Joorabchian Children\n\nDoes Kia Joorabchian have any children? No, Kia Joorabchian has no chidren. There is no information about his children.\n\nKia Joorabchian Career\n\nJoorabchian started his career as a worker for his father before progressing to a dealer position at the London-based International Petroleum Exchange. He moved to New York City and co-founded American Capital with his colleague Reza Irani-Kermanian, which has its headquarters in Manhattan but is registered in the British Virgin Islands. He got active in the stock market and fund management after moving there.\n\nESPN reported on January 12, 2010, that Joorabchian had been appointed to the club’s post of “Football Advisor” and would be overseeing a player purge that would bring in talented young players from all over the world.\n\nJoorabchian was listed as a director of eleven UK firms, including Karma Racing, a horse racing organization, and Karma, a kickboxing club in Chalk Farm, London, according to a Financial Times inquiry of Joorabchian’s other commercial interests in 2006. His largest claimed stake at the time was a vehicle dealership called Greens of Rainham.\n\nSports Invest UK Limited, which is represented by Nojan Bedroud, a licensed FIFA agent, has Joorabchian as its sole director. Portsmouth F.C. owed the business £600,000.\n\nKia Joorabchian Net Worth\n\nKia Joorabchian has an estimated net worth of $5 million.\n\nSource: Ghgossip.com\n\nADVERTISEMENT"}, {"url": "https://www.ghgossip.com/kia-joorabchian-parents-meet-mohammed-joorabchian/", "page_content": "Kia Joorabchian Parents: Meet Mohammed Joorabchian – In this piece you will get to know all about Kia Joorabchian parents.\n\nBut then who is Kia Joorabchian? Iranian-born, British-educated businessman Kiavash Joorabchian plays a significant role in association football.\n\nADVERTISEMENT\n\nA lot of people have been inquiring lot about Kia Joorabchian parents and making various research about them on the internet.\n\nThis article talks about Kia Joorabchian parents and everything there is to know about them.\n\nBiography of Kia Joorabchian\n\nKia Joorabchian, the son of Iranian car salesman Mohammed Joorabchian, was born on July 14, 1971, in Tehran, Iran. Joorabchian said that the largest vehicle manufacturing in the Middle East used to be run by his father’s uncle.\n\nJoorabchian first attended Golders Green School in north London before going to Shiplake College in Oxfordshire. Prior to quitting after his second year, he continued his education at Queen Mary and Westfield College, University of London, where he double-majored in chemistry and business.\n\nAfter the Shah was toppled in 1979, the Joorabchian family left Iran. When Joorabchian was six years old, they left for the UK, went to Canada, and then came back to England. One of the vehicle dealerships his father owned and ran was Medway Autos in Ken.\n\nJoorabchian first attended Golders Green School in north London before going to Shiplake College in Oxfordshire. Prior to quitting after his second year, he cont inued his education at Queen Mary and Westfield College, University of London, where he double-majored in chemistry and business.\n\nADVERTISEMENT\n\nJoorabchian started his career as a worker for his father before progressing to a dealer position at the London-based International Petroleum Exchange. He moved to New York City and co-founded American Capital with his colleague Reza Irani-Kermanian, which has its headquarters in Manhattan but is registered in the British Virgin Islands. He got active in the stock market and fund management after moving there.\n\nESPN reported on January 12, 2010, that Joorabchian had been appointed to the club’s post of “Football Advisor” and would be overseeing a player purge that would bring in talented young players from all over the world.\n\nJoorabchian was listed as a director of eleven UK firms, including Karma Racing, a horse racing organization, and Karma, a kickboxing club in Chalk Farm, London, according to a Financial Times inquiry of Joorabchian’s other commercial interests in 2006. His largest claimed stake at the time was a vehicle dealership called Greens of Rainham.\n\nSports Invest UK Limited, which is represented by Nojan Bedroud, a licensed FIFA agent, has Joorabchian as its sole director. Portsmouth F.C. owed the business £600,000.\n\nKia Joorabchian Parents: Meet Mohammed Joorabchian\n\nWho are the parents of Kia Joorabchian? Kia Joorabchian was born to Mohammed Joorabchian who is his father. There is no information about his mother. Mohammed Joorabchian is an Iranian car-dealer businessman.\n\nSource: Ghgossip.com\n\nADVERTISEMENT"}]}