{"The Joorabchian Group has investments in real estate, technology, and sports.": [{"url": "https://www.theguardian.com/football/2020/jun/27/kia-joorabchians-growing-influence-arsenal-identity-crisis", "page_content": "It is not unusual to hear Kia Joorabchian offering his thoughts via TalkSport but, when he began discussing David Luiz’s future 10 days ago, ears pricked up among many who deal regularly with Arsenal. One particular line from the agent served as a flashing light. The Premier League’s contract deadline of 23 June was fast approaching and Joorabchian believed there was plenty of work to do. “There are several issues within the whole structure that will be resolved,” he said, before returning to the theme of his high-profile client.\n\nJoorabchian’s working relationship with the Arsenal hierarchy is no secret, and he was perfectly entitled to provide a commentary. But for some who have harboured reservations about his influence it was, as one puts it, the final straw. However it was intended, the statement felt overly familiar with the club’s internal concerns. The events that followed have shed light on the identity crisis evolving within Arsenal, which has caused dismay among former and existing staff.\n\nThe worry is that Arsenal, once famously resourceful, have entrusted too much responsibility for recruitment to a narrow list of associates that includes Joorabchian, a super-agent with a storied past in helping broker big deals and a long-time friend of the technical director, Edu.\n\nThere is, of course, nothing to stop them working together, and there are many ways to address squad-building requirements. But eyebrows were raised on Tuesday when the 33-year-old David Luiz, one of the club’s highest earners at a time when Covid-19 and a poor season have forced some difficult financial decisions, was enlisted for a further year.\n\nPerhaps more jarring was the fact Cédric Soares, the 28-year-old who had been prevented by injury from making his debut since joining on loan from Southampton, was tied down on a long-term deal that effectively makes him the deputy right-back.\n\nBoth players are represented by Joorabchian and his company, Sports Invest UK.\n\nArsenal centre-back David Luiz. Photograph: Reuters\n\nTransfers of that nature would, while entirely legitimate, have been anathema under Arsène Wenger. He generally shied away from deals with bigger-name agents and had little time for heavy investments in older players. But Joorabchian’s hand has been evident in a clutch of moves involving Arsenal in the past year, the first being a move that was completed on 8 August, a month after Edu, a former player, returned to Arsenal. The Football Association’s list of intermediary transactions, released this week, shows Sports Invest UK represented Arsenal in Alex Iwobi’s £35m move to Everton.\n\nIwobi’s and Everton’s side of the deal was, according to the list, overseen separately by the agency that represents the player. It is not unusual for different parties to work on the different ends of a transfer, even more so when involving moves from abroad, and there is no suggestion of any wrongdoing. Some experienced industry figures simply point out that given Arsenal and Everton are familiar rivals and worked together 18 months previously when Theo Walcott made the same move it appears a convoluted way to have done business.\n\nDavid Luiz arrived from Chelsea on the same day and Soares followed in January. Willian, another Joorabchian client, has been linked with a summer arrival although the Observer understands that while there is strong interest on Arsenal’s part no final decision has been made on his future.\n\nThe fear in certain quarters is that Arsenal’s executive team are wed to a select set of voices and marginalising those with an alternative view, particularly when it comes to transfers and planning. Nobody doubted the club’s approach needed modernising in the post-Wenger era and that is why there was surprise when Sven Mislintat, the head of recruitment, moved on in February 2019.\n\nSince then, the suggestion is that Arsenal have surrendered a coherent approach to player-spotting and handed too much power to the contacts books of Edu and the head of football, Raúl Sanllehi. Some members of staff are believed to feel frozen out and there is particular angst that Arsenal, who also conducted a revamp of their academy staff in November, may be losing ground in any chase for the best young players. One former employee claims the club’s approach no longer fitted their values and the high-performance culture fostered under Wenger has been allowed to ebb away.\n\nThere is a view that Arsenal’s hierarchy are awkward customers. It has not gone unnoticed among certain club personnel over the past two seasons that certain agents and contacts do not return calls as frequently. One player representative says he sighs inwardly when an Arsenal number shows up on his phone; another is strongly critical of their communication skills.\n\nIt goes without saying that everyone in the picture has their own agenda and that every agent has clients’ interests to look after. That is all part of the game but it becomes more problematic when, as some suggest has occurred, potential deals begin to falter.\n\nFor all the structural issues the biggest problem is, another source says, a “lack of relevant brains”. Arsenal are well known, as per the words of their director Josh Kroenke, to be operating a “Champions League wage bill on a Europa League budget”, and given their league position that will not change unless Mikel Arteta is given the squad clearout he desires this summer. That means they ideally require value – and preferably resale value – in the market, operating more like Borussia Dortmund or RB Salzburg than Barcelona or Real Madrid.\n\n“Finally Arsenal have people who really understand football and are footballing people in the back-room staff,” Joorabchian said in a separate TalkSport interview last July, referencing Sanllehi and Edu. “But the question is whether or not the finances will be made available.”\n\nIf not, then what? The bigger issue appears to be whether Sanllehi, who helped bring Neymar to Barcelona, and the former Brazil general manager Edu have the expertise to run Arsenal in a lean, streamlined fashion according to those parameters. Another figure familiar with their way of working does not believe so, suggesting Arsenal risk being a “mid-table team within three to four years” if nothing changes.\n\nThere remains enough promise to remove such doomsday scenarios. The acquisitions of Gabriel Martinelli and William Saliba a year ago showed that elements are still in place for Arsenal to find players with a genuine chance of becoming high-class performers. Match-winning contributions by Eddie Nketiah and Joe Willock at Southampton on Thursday were reminders the academy, can still turn up wonders. To realise all that potential, though, the sense is that Arsenal need to remember exactly how those things became true."}, {"url": "https://www.chinadaily.com.cn/a/202201/10/WS61db87eda310cdd39bc80035.html", "page_content": "The double open park at Taikoo Li Qiantan, a retail complex in Shanghai. [PHOTO BY CHEN YUYU/FOR CHINA DAILY]\n\nThe volume of commercial real estate investments in the Chinese mainland reached $7.3 billion in the third quarter of 2021, and the full-year amount is expected to surpass that of 2020, a report released by global real estate advisor JLL said.\n\nThe combined volume of commercial real estate investments in the first three quarters in the Chinese mainland amounted to 170 billion yuan ($26.7 billion), and JLL predicted the full-year figure will exceed that of 2020, when it nearly hit 200 billion yuan.\n\nAccounting for 49 percent of the total volume in the third quarter, Shanghai remained the top destination for commercial real estate investments across China. The weight of Beijing and Guangzhou, Guangdong province, declined to some extent from the previous quarter while Shenzhen, Guangdong province, recorded a significant increase to 7.3 percent of the total.\n\n\"Commercial business development in Shanghai is healthy and sustainable. The vibrant city is full of opportunities and takes the lead among Chinese cities in many aspects,\" said Kamsen Lau, CEO of Lifestyle International Holdings Ltd.\n\nAfter nearly 10 years of development, Lifestyle International officially launched its first commercial complex in the Chinese mainland, namely the Shanghai Jiuguang Center, Lau said. There are more than 400 brands in the center, about 30 percent of which debuted in Shanghai or North Shanghai.\n\nJLL statistics show that office investments took the lion's share, or 57.6 percent, of the volume of commercial real estate investments in the third quarter, up 14.2 percent quarter-on-quarter.\n\nEight office spaces in China, including Beijing Financial Street, Beijing's Central Business District and Shanghai's Pudong New Area, were listed among the world's top 20 most expensive office spaces in 2021, said JLL's latest Global Premium Office Rent Tracker.\n\nThe investment volume of logistics properties, especially those located in the Yangtze River Delta region, the Guangdong-Hong Kong-Macao Greater Bay Area, the Beijing-Tianjin-Hebei region and the Chengdu-Chongqing city cluster, remained bullish in the third quarter, which was preferred by institutional investors.\n\nThe volume of commercial real estate investments in the Asia-Pacific region reached $125 billion in the first three quarters, up 30 percent from the same period in 2020, according to JLL.\n\n\"Throughout 2021, investor interest in the Asia-Pacific region remained extremely high as capital became more active and the volume of investment approached pre-pandemic levels across the region,\" said Stuart Crow, CEO of capital markets with JLL Asia-Pacific.\n\nSupported by stabilized rents and occupancy rates, office investments continued to recover in the third quarter, taking up 55 percent of the total volume of commercial real estate investments in the region. In the meantime, logistics property investments continued to grow, with investments reaching $43 billion in the past 12 months, compared to $25 billion in 2019.\n\nJLL forecast that driven by demand, attractive investment yields and a desire for diversified portfolios, logistics property investments may double to $50-$60 billion over the 2023-25 period.\n\nRetail and hotel investments in the Asia-Pacific have been soft due to COVID-19. However, the volume of full-year hotel investments may surpass $7 billion in 2021 and could increase to $9 billion in 2022, the JLL report said."}, {"url": "https://www2.deloitte.com/cn/en/pages/real-estate/articles/re-industry-investment-promotion-report.html", "page_content": "The Report\n\nThe report was jointly published by Deloitte Research team, the Investment Promotion Agency of Ministry of Commerce, P.R. China (CIPA) and Deloitte China Real Estate Industry Group. The report focuses on the development and trends of China residential and commercial properties. Under the new economic normality, the impact of economic slowdown, currency devaluation, consumption and technology upgrades, and capital market fluctuations were analysed; detail examining the scale, investment model, driving forces as well as trends and challenges of China \"inbound\" and \"outbound\" property investment.\n\nViewpoints / key findings\n\nReal estate industry has been a significant pillar of the national economic in China. It maintained a relatively rapid growth rate in the past decade and has become an important sector that attracts foreign investment and promotes Chinese enterprises to go global. Since 2014, the China's economy has entered \"new normal\", economic slowdown as well as the property prices, oversupply of the property needs to be digested gradually. Therefore, the China's property market is entering a new round of adjustment. The government has introduced various control measures on properties and strengthened supervision of real estate development financing in order to suppress the bubbles and ensure sound development of the industry. The main findings of the report are as follows:"}, {"url": "https://creti.org/2022-proptech-venture-capital-report", "page_content": "VC-backed proptech companies raised $19.8 billion in 2022, down 38% from 2021.\n\nMonetary policy has dramatically increased the opportunity cost of capital and the hurdle rate for investment.\n\nTo weather economic headwinds, entrepreneurs should focus on operations, customer retention, and unit economics.\n\nVenture capital (VC) investments in real estate technology (proptech) companies dramatically weakened from the record-setting levels of 2021. Globally, capital allocation in proptech companies declined by 38% from $32.0 billion in 2021 to $19.8 billion in 2022. The significant drop-off in funding is the second-lowest investment year since 2018.\n\nThe narrative in the proptech industry continues to change along with the macro real estate environment. Real estate organizations have adopted a more defensive position as entrepreneur-founders and investors navigate through a cautiously conservative landscape. Market volatility continues to persist due to monetary policy, rising interest rates, and recessionary fears.\n\n“We have just lived through a decade of historically low-interest rates, which has now all but come to a stop,” said Mike McAra, Director at Second Century Ventures & NAR REACH Canada. “While this has broad sweeping impacts for the economy at large, for venture, this has dramatically increased the opportunity cost of capital for GPs. On a risk-adjusted basis, the hurdle rate for investment is much higher now than just 6 months ago, and thus capital is being allocated much more diligently and much slower.”\n\nOn a positive note, deals are getting executed more diligently, leaving plenty of capital available. Founder-entrepreneurs capable of putting together compelling business and revenue models will continue to raise money, even in a tightening market, with a focus on scale, retention, and customer acquisition.\n\n“There will be a key emphasis on burn ratios, unit economics, and runway,” said Nish Patel, Managing Partner at Inertia Ventures. “Spending in companies will be scrutinized much more heavily than in prior years, and there will be more attention paid to the quality of revenue."}, {"url": "https://creti.org/news/creti-2021-real-estate-tech-venture-capital-report", "page_content": "New York, NY — The Center for Real Estate Technology & Innovation (creti.org), the real estate technology industry’s think tank and venture network released the 2021 Real Estate Tech Venture Funding Report on venture capital investments in private real estate technology companies.\n\nVenture capital investments in real estate tech returned to pre-pandemic levels. In 2021, $32 billion was invested in real estate tech companies, a 28% increase in funding since 2020 and 3.23% increase compared to 2019.\n\n“In 2021, proptech decisively became one of the largest, highest performing, and most compelling categories of all venture capital markets. It’s thrilling and exciting to see proptech emerge as such an important category of venture capital,” said Brendan Wallace, Co-Founder and Managing Partner, Fifth Wall.\n\n“Following a year of uncertainty the venture capital and real estate tech entrepreneur market is back in a meaningful way,” said Ashkán Zandieh, Chair at the Center for Real Estate Technology & Innovation. \"The continued growth of the sector has seen new investors across multiple stages enter the market, including private equity groups and institutional organizations.\"\n\nThe report indexed and analyzed 1,483 venture investments across the greater real estate industry, including commercial, construction, residential, multifamily, and other asset classes and real estate services, including brokerage and management.\n\n\"Proptech is now a household name in both the public and private equity markets,\" said Zach Aarons, Co-Founder, and General Partner at Metaprop. \"The cat's out of the bag. The industry is truly global and adoption is accelerating very quickly. We have definitely experienced some choppiness in the public equity markets as the sector reaches a maturation point and analysts realize that not all businesses within the proptech sector should be valued the same way.\"\n\n“As of late November, more than $9.5 billion had been invested into proptech. This record-breaking flow of capital into the category demonstrates that the real estate industry is embracing and deploying technology, and proptech is no longer a niche investment area. Similarly, the real estate industry needs to invest $18 - $36 trillion into climate tech over the next 20 years, calling for more innovation and entrepreneurship-focused on decarbonization. In 2022, we anticipate an increase in capital flow into climate tech for real estate,” said Brad Griewe, Co-Founder and Managing Partner, Fifth Wall.\n\nThroughout the year the market continued to gain momentum in funding and showed signs of evolution as venture capital investments shifted from early-stage to mid and late-stage companies. 57% of total venture funding went to companies that raised a Series C and greater.\n\n\"2021 was a historic year for the real estate tech sector not just with regards to funding but also in terms of the pace of adoption,” said Michael Beckerman, CEO at CREtech. “While venture funding has always been the most important metric of progress for this young industry, it is now also important to note that the startups themselves are scaling to historic levels of adoption and revenue.”\n\nThe increased flow of capital is only one of the signals of the rising real estate tech wave. In a review of investments by sector, 49% of global funding went to residential tech companies, while commercial received 7.6% of total funding.\n\n\"2021 was the year of validation and consolidation. Multiple categories saw SPACs and strategic acquisitions took place,\" says Vince Cicciarelli, VP and Partner at Lincoln Property Ventures. \"The cordial introductions are over and now everyone is off to the races in major categories that have emerged.\""}, {"url": "https://www.us.jll.com/en/newsroom/proptech-startup-funding-on-track-to-break-real-estate-industry-records-in-2021", "page_content": "CHICAGO, August 25, 2021 – The number of real estate technology startups has increased 300% over the past decade, seizing the opportunity to address the industry’s biggest challenges through technology. Data released today by JLL (NYSE: JLL) suggests that opportunity continues to abound in the sector’s startup landscape, with US$9.7 billion of funding activity in the first half of 2021, the most active first half on record. Additionally, the market shows signs of maturation as funding begins to shift toward established players and increasing consolidation drives the emergence of industry leaders.\n\n“While real estate technology adoption was on the rise before the COVID-19 pandemic, it has become essential for today’s leading real estate players, buildings and spaces,” said Ben Breslau, Chief Research Officer at JLL. “Technology is at the center of the most important trends shaping business and real estate. That includes hybrid work, health and safety, and sustainability initiatives, all of which are in high demand. That’s why we expect funding within this sector to break records this year.”\n\n“Our industry is right on the cusp of impactful change driven by widespread technology adoption,” said Raj Singh, Managing Partner of JLL Spark, the global venture fund of JLL Technologies. “The trends we’re seeing suggest there may be no better time to invest in real estate technology. The opportunity to shape the industry for the future by supporting innovation holds great potential for strategic change as well as return on investment.”\n\n\n\nThe evolving property technology (proptech) landscape\n\n\n\nAmid the 4th Industrial Revolution, and accelerated by the COVID-19 pandemic, new technologies have proliferated to take advantage of developments in computing power, analysis and connectivity. The number of startups across the real estate industry has grown rapidly in the past decade—from under 2,000 to nearly 8,000—as companies look to apply these new technologies.\n\nWith that said, there has been a migration in funding and mergers and acquisitions (M&A) to more established industry leaders.\n\n\n\nVenture capital and M&A trends\n\n\n\nThe nearly 8,000 companies, identified by JLL, that provide technology solutions in the built environment have collectively raised more than US$97 billion of equity funding in the past decade. Built environment technology startups can now be found in most countries around the world."}, {"url": "https://www.skysports.com/football/news/2609759/joorabchian-claims-innocence", "page_content": "Kia Joorabchian has denied \"any wrongdoing\" over allegations of money-laundering.\n\nKia Joorabchian has denied \"any wrongdoing whatsoever\" over allegations of money-laundering.\n\nJoorabchian has reportedly been issued with an arrest warrant in Brazil as part of an investigation at Corinthians, which Media Sports Investment, Joorabchian's company, is a major investor in.\n\nHowever, Joorabchian, who represents Manchester United target Carlos Tevez, says his financial dealings are all aboveboard.\n\n\"The investigation in Brazil has been rumbling on for some considerable time and apparently involves numerous individuals including the president, club officials and partners of Corinthians Football Club,\" Joorabchian said in a statement.\n\n\"I deny any wrongdoing whatsoever. I have co-operated fully with the authorities in Brazil and have previously offered to speak to them directly, an offer that they have not taken up.\n\n\"The investigation has been provoked by the desire of a small group of individuals in Brazil to gain control over Corinthians Football Club. All payments made to Corinthians by MSI were cleared through and approved by the Brazilian Central Bank.\n\n\"My Brazilian lawyers are instructed urgently to prevent me being personally involved any longer in this dispute. I am advised, and believe this matter will be resolved very shortly.\""}, {"url": "https://www.latimes.com/business/la-fi-china-investments-20170819-story.html", "page_content": "Chinese President Xi Jinping has wanted to link China with other parts of Asia and eastern Europe through multibillion-dollar investments in ports, highways, railways, power plants and other infrastructure.\n\nChina’s government is moving to curb domestic companies’ investments abroad in property, sports, entertainment and other fields, following a series of high-profile, multibillion-dollar acquisitions by Chinese firms.\n\nA document released Friday by the State Council, China’s Cabinet, was the latest move by regulators to tap the brakes on a string of foreign acquisitions, citing concerns that the companies involved may be taking on too much debt.\n\nOne of those conglomerates, Wanda Group, became the world’s biggest cinema operator with its purchase of a majority stake in U.S. chain AMC in 2012 for $2.6 billion. It added rival Carmike Cinemas Inc. last year in a $1.2-billion deal and also bought film production house Legendary Entertainment for $3.5 billion.\n\nAdvertisement\n\nThe Cabinet document limits overseas investments in areas such as hotels, cinemas, the entertainment industry, real estate and sports clubs. It also bans outright investments in enterprises related to gambling and the sex industry.\n\nAt the same time, it encourages companies to plow money into projects related to the “Belt and Road” project, President Xi Jinping’s signature foreign policy initiative that seeks to link China with other parts of Asia and eastern Europe through multibillion-dollar investments in ports, highways, railways, power plants and other infrastructure.\n\n“There are great opportunities for our nation’s companies to embark on foreign investment, but they also face numerous risks and challenges,” the document said. Through the new guidance, the government hopes to promote the “rational, orderly and healthy development of foreign investment while effectively guarding against risks,” it said.\n\nAs part of his drive for stronger government leadership over the economy, Xi has been moving to reassert control over top state enterprises while reining in sprawling conglomerates including Wanda, Anbang Insurance, Fosun International and HNA Group that have expanded rapidly through debt-fueled foreign acquisitions such as New York’s famed Waldorf Astoria Hotel.\n\nAuthorities told banks Wanda’s recent foreign transactions conflicted with restrictions on capital movement, and the company announced on July 10 it would sell most of its theme parks to a Chinese buyer, Sunac China Holdings Ltd., for $9.3 billion.\n\nWanda agreed in November to pay $1 billion for Dick Clark Productions, which produces the Golden Globes and the “Miss America” pageant. The seller, Eldridge Industries, called off the deal in March, saying Wanda failed to complete the purchase.\n\nALSO\n\nThere’s a new buyer involved in Wanda’s multibillion-dollar asset sale\n\nWanda Group to invest $15 billion to compete with Disney in China\n\nWanda sell-off of massive Chinese movie studio is latest retreat from Hollywood"}, {"url": "https://www.mirror.co.uk/sport/football/transfer-news/arsenal-joorabchian-arteta-edu-signings-24122803", "page_content": "The Gunners have worked closely with the super agent over the last few years, but how many of his clients have actually been a success since arriving at the Emirates?\n\nKia Joorabchian clearly has a good business relationship with those over at Arsenal, given a number of his clients have ended up plying their trade for the Gunners in the last few years.\n\nThe 49-year-old boasts a star-studded list of clientele that includes Champions League winners and Premier League veterans - though some members of the Emirates faithful may highlight the latter of those two as part of the problem.\n\nLong gone are the days when all recruitment decisions related to the playing staff were made by the manager, it is clear that over in the red half of North London, technical director Edu also has a large say in who comes in.\n\nGiven his close working ties with Joorabchian, it's little surprise only now, post- Wenger have these signings begin to flood in in their droves.\n\nImage: Getty Images) Getty Images)\n\nSky Sports pundit Jamie Carragher launched an attack on the agent before the turn of the year, citing his clients as part of the problems that plague the Gunners.\n\n\"I really like (Mikel) Arteta,\" he said. \"There’s a lot of nonsense around the club – bringing players, buying players. I think some signings were a joke. In terms of bringing Willian in, Luiz in, Cedric in.\n\n\"Is Kia Joorabchian making signings at the club? Mikel Arteta has brought in Thomas Partey and Gabriel. They look like Arsenal’s two best players at this moment, certainly early stages this season.\"\n\nThe agent did not take those remarks lying down, and bit back with: \"I’m very surprised because Jamie is one of the people that monopolises Sky Sports commentary. Sky Sports producers pay a lot of money to him, so I can’t understand why he doesn’t check his facts before he speaks.\n\n\"The fact is I had nothing to do with the signing of Willian. If Jamie had bothered to check with Mikel or Edu, they would have said Mikel presented three different times to convince Willian to be his number one signing at Arsenal.\"\n\nWillian is the most recent of Joorabchian's signings to join the Gunners, so as his debut season draws to a close, it seems as good a time as any to analyse how the super agent's clients have fared in an Arsenal shirt.\n\nDavid Luiz\n\nThere is an argument to be had that Luiz is the most successful of Joorabchian's Arsenal clients, with the 34-year-old proving to be a huge figure in the dressing room, one many of the Gunners array of young talent all claim to look up to.\n\nHe has proven he is the sides most comfortable defender on the ball, something Arteta's men had to learn the hard way in his absence at the tail-end of this season.\n\nImage: Arsenal FC via Getty Images) Arsenal FC via Getty Images)\n\nLuiz last featured for the Gunners away at Newcastle, playing a part in the first of two goals with a delightful pass into the channels, a trait Arsenal clearly missed as they struggled to mount any attack in their Europa League disaster against Villarreal the following game.\n\nHowever, for all of his technical quality, Luiz has displayed the kind of erratic on-pitch decision making that has plagued his entire career.\n\nLuiz has four red cards over the course of 213 Premier League appearances, the bulk of which came for Chelsea - yet three of his dismissals have come in an Arsenal shirt.\n\nAfter two seasons, three red cards and a number of penalties conceded - Luiz's time at Arsenal appears to be coming to an end, after it was reported that neither the club nor the player had any desire to extend his contract which expires at the end of the current campaign.\n\nWillian\n\nFew signings in the modern history of Arsenal have gone as badly for the club as the signing of former Chelsea winger Willian.\n\n1 goal in 37 appearances has made for a debut season full of criticism, so much so that recent speculation has suggested the Brazilian international could be keen on leaving the Emirates after just one season.\n\nImage: Pool via REUTERS) Pool via REUTERS)\n\nThe 32-year-old has attracted interest from a number of European clubs as well as newly-formed MLS outfit Inter Miami.\n\nThe signing of Willian has ben accused of stalling the development of a number of Arsenal's talented younger players, including Gabriel Martinelli and Reiss Nelson.\n\nCedric Soares\n\nCedric's arrival at the Emirates led to questions from the very beginning, given Arsenal were in no real desperate need for a right-back, boasting Hector Bellerin and Ainsley Maitland-Niles as well as Calum Chambers once he had recovered from injury.\n\nOriginally signed on loan, Cedric's deal was eventually offered a bumper new permanent contract despite having made ZERO appearances for the club at the time.\n\nImage: NurPhoto/PA Images) NurPhoto/PA Images)\n\nBizarrely, the bulk of Cedric's Arsenal features this season have come while playing left-back, filling in for the crocked Kieran Tierney.\n\nThe Portuguese defender enjoyed a brief decent run of form in the new role at the beginning of the year, before he eventually his flaws on the opposite flank were exposed and Arteta took the step of deploying midfielder Granit Xhaka in the left-back position instead."}, {"url": "https://builtin.com/blockchain/blockchain-real-estate-companies", "page_content": "Vacation rental houses. Parking spots. Even dream homes. Before long, they’ll all be purchased on a blockchain. In fact, real estate blockchain is already gaining popularity as a way for buyers, sellers and investors to interact with each other and learn about properties.\n\nBut why is blockchain poised to give the real estate industry such a significant leg up? First and foremost, by leveraging distributed ledger technology (DLT), it increases trust through greater transparency. And in real estate, trust — of a website, an agent, a listing — is imperative. Real estate blockchain also expedites contract processes, saves time and reduces costs.\n\nBlockchain Real Estate Asset management\n\nTransaction security\n\nMarketplaces\n\nSmart contracts\n\nProperty management\n\nBecause the daily rate of real estate transactions is so immense, a common database of leases and purchases is more necessary than ever. Blockchain can provide that. Upgrading the traditional Multiple Listing Service database to a blockchain-based one would create a far more transparent ledger system where brokers and agents could see the entire transaction history of a property.\n\nBesides helping the traditional real estate industry, blockchain is also being adopted by the burgeoning property-sharing sector.\n\nBelow are 17 real estate blockchain companies that use the increasingly popular technology to boost business.\n\nBlockchain Real Estate Companies to Know Republic\n\nVairt\n\nRealBlocks\n\nOwny\n\nClosinglock\n\nShelterZoom\n\nStreetWire\n\nUbitquity\n\nRealT\n\nCPROP\n\nAn error occurred. Unable to execute JavaScript. Try watching this video on www.youtube.com , or enable JavaScript if it is disabled in your browser.\n\nBlockchain Takes Manhattan | Video: Bloomberg Quicktake: Originals\n\nBlockchain for Asset Management in Real Estate\n\nRepublic\n\nLocation: New York, New York\n\nRepublic enables customers to invest in private markets that span sectors like real estate, gaming and crypto. No fees and flexible minimum investment requirements make the platform accessible to investors ages 18 and up. Within the real estate sector, Republic only provides global real estate options that have passed the company’s vetting process. As a result, investors can trust they’re making real estate investments that match their interests and risk tolerance.\n\nVairt\n\nLocation: Cincinnati, Ohio\n\nVairt is designed to help users earn secondary income by building and diversifying a global real estate network. The platform offers several resources and tools to provide the best possible outcomes when investing in fractional real estate. That includes market overviews, neighborhood insights, property analysis and long-term support, all operating on a blockchain network for supreme security.\n\nRealBlocks\n\nLocation: New York, New York\n\nRealBlocks uses blockchain to create new avenues for real estate investing. Its platform lets investors buy fractional interest rather than entire portfolios or assets. Through tokenization that’s applied using blockchain technology, RealBlocks helps reduce fees, speed up processes and provide liquidity options.\n\nOwny\n\nLocation: Palo Alto, California\n\nFormerly known as RealtyBits, Owny facilitates blockchain-based investing in real-world assets including real estate. Users can create a free account and get verified in under a minute. Once they’ve invested, Owny provides a dashboard that allows them to monitor their assets. Coinbase is among the company’s investors.\n\nBlockchain for Transaction Security in Real Estate\n\nClosinglock\n\nLocation: Columbus, Ohio\n\nFormerly known as SafeWire before being acquired by Closinglock, the company presents a solution to the growing wire fraud challenges that real estate firms, agents, clients and industries face due to hacker intervention. The Closinglock platform operates via a blockchain network to ensure security for vulnerable transactions from the moment they are sent to the time they are received and processed, reducing the money, clients and time lost due to wire fraud.\n\nShelterZoom\n\nLocation: New York, New York\n\nDocuwalk, ShelterZoom’s document management platform, uses blockchain to manage all aspects of the real estate offer and acceptance process. The secure online platform records every action along the path to closing on a real estate deal to ensure an immutable financial record.\n\nStreetWire\n\nLocation: New York, New York\n\nStreetWire creates secure transaction solutions for the real estate industry through a data provider-controlled encrypted ledger. Its platform facilitates faster and more transparent property transactions.\n\nUbitquity\n\nLocation: Wilmington, Delaware\n\nUbitquity’s products include its Non-Fungible Title platform giving titles a digital identity and Ubitquity Pay for crypto payments and real estate transactions. The company says its open-source blockchain platform provides “a simple user experience for securely recording/tracking of title and other critical documents.”\n\nRead Next50 Blockchain Companies Paving the Way for the Future\n\nBlockchain for Marketplaces in Real Estate\n\nRealT\n\nLocation: Aventura, Florida\n\nRealT is a fractional real estate investment platform that allows investors around the world to invest in the U.S. real estate market through a fully compliant, token-based blockchain network. The platform lets investors buy into tokenized properties with permissionless Ethereum and maintain access to cash flows and low maintenance ownership via RealTokens. It gives owners access to rent payments weekly through US-Dollar stable coin, xDai or Ethereum.\n\nCPROP\n\nLocation: New York, New York\n\nCryptoProperties or CPROP builds blockchain data applications that focus on identifying new opportunities, reducing risk and pinpointing issues in the real estate industry. CPROP’s technology is applied to multiple real estate areas, including brokerage transactions, investment management, property development, finance and insurance.\n\nFigure\n\nLocation: San Francisco, California\n\nFigure uses blockchain technology to provide financial services to consumers and institutions. For example, Crypto Mortgage Plus lets people use crypto for a home mortgage and the company also offers Figure Marketplace, a blockchain-based investment platform.\n\nBlockchain for Smart Contracts\n\nPropertyClub\n\nLocation: New York, New York\n\nPropertyClub is a real estate platform that uses blockchain to refine the way people market, search for, buy, sell and invest in properties. Using smart contracts, the company conducts real estate transactions digitally using cryptocurrencies like Bitcoin or its own PropertyClub Coin.\n\nSMARTRealty\n\nLocation: Seattle, Washington\n\nSMARTRealty uses smart real estate contracts to enact and maintain property purchase and rental agreements. Whether it’s paying rent, establishing mortgages or purchasing a home, the company’s smart contracts help to establish protocols that, if not met, immediately dissolve a contract.\n\nLocation: San Francisco, California\n\nPropy is a real estate marketplace that uses smart contracts to enact property transactions. The company’s platform enables buyers, sellers and agents to use a series of smart contracts that help speed up the real estate process.\n\nFurther ReadingProptech: Everything You Need to Know (With 25 Examples)\n\nBlockchain for Property Management in Real Estate\n\nManageGo\n\nLocation: Brooklyn, New York\n\nManageGo is leveraging blockchain for rental property owners. The ledger-backed software helps property managers and owners process payments, thoroughly complete credit background checks and manage maintenance ticketing.\n\nThe Crypto Realty Group\n\nLocation: Manhattan Beach, California\n\nThe Crypto Realty Group is a consulting firm that works with crypto escrow and financial consulting companies to help clients buy and sell residential, commercial, local and international real estate using cryptocurrency.\n\nBlocksquare\n\nLocation: Ljubljana, Slovenia\n\nBlocksquare’s real estate tokenization protocol can be used to digitize the value of real estate assets while its white-label platform can be used to launch investment platforms. The company says companies of all sizes can take advantage of its blockchain infrastructure."}]}