{"Vitaliano Brancati's most famous novel is Don Camillo e l'onorevole": [{"url": "https://www.goodreads.com/author/list/97664.Vitaliano_Brancati", "page_content": "Showing 30 distinct works.\n\nsort by popularity original publication year title average rating number of pages\n\n* Note: these are all the books on Goodreads for this author. To add more books, click here"}, {"url": "https://www.goodreads.com/shelf/show/vitaliano-brancati", "page_content": "“Ma il verme dei viaggi era entrato nei loro cervelli, e non smetteva di roderli. Giovanni trovò, nelle vecchie abitudini di Catania, quell'odore sgradevole che dopo due o tre anni si trova in un abito di fatica. Le passeggiate per il corso, i discorsi con gli amici, mio Dio, di nuovo?”\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nWelcome back. Just a moment while we sign you in to your Goodreads account."}, {"url": "https://www.goodreads.com/work/editions/2825029-don-giovanni-in-sicilia", "page_content": "Want to Read saving…\n\nCurrently Reading\n\nWant to Read\n\nError rating book. Refresh and try again.\n\nRate this book\n\nClear rating"}, {"url": "https://pantheon.world/profile/person/Vitaliano_Brancati/", "page_content": "Vitaliano Brancati\n\nVitaliano Brancati (Italian pronunciation: [vitaˈljaːno braŋˈkaːti]; 24 July 1907 – 25 September 1954) was an Italian novelist, dramatist, poet and screenwriter . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Vitaliano Brancati has received more than 37,779 page views. His biography is available in 19 different languages on Wikipedia . Vitaliano Brancati is the 4,639th most popular writer (down from 4,128th in 2019), the 3,351st most popular biography from Italy (down from 2,977th in 2019) and the 242nd most popular Italian Writer."}, {"url": "https://www.bookdepository.com/author/Vitaliano-Brancati", "page_content": "We are sorry to let you know that Book Depository has now closed.\n\nWe will continue to deliver orders placed before midday (12pm BST) on 26 April and will provide support for any order issues until 23 June 2023.\n\nFrom all of us at Book Depository we want to say 'thank you'. Delivering your favourite reads to you since 2007 has been a pleasure.\n\nYou’ll find more info in our FAQs."}, {"url": "https://www.goodreads.com/shelf/show/vitaliano-brancati", "page_content": "“Ma il verme dei viaggi era entrato nei loro cervelli, e non smetteva di roderli. Giovanni trovò, nelle vecchie abitudini di Catania, quell'odore sgradevole che dopo due o tre anni si trova in un abito di fatica. Le passeggiate per il corso, i discorsi con gli amici, mio Dio, di nuovo?”\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nError rating book. Refresh and try again.\n\nWelcome back. Just a moment while we sign you in to your Goodreads account."}, {"url": "https://ca.wikipedia.org/wiki/Don_Camillo_e_l%27onorevole_Peppone", "page_content": "Don Camillo e l'onorevole Peppone (francès: La Grande Bagarre de don Camillo) és una pel·lícula franco-italiana de 1955 dirigida per Carmine Gallone i basada en els personatges creats per Giovannino Guareschi. Va ser la tercera de les cinc pel·lícules amb Fernandel com el rector Don Camillo i Gino Cervi com Giuseppe 'Peppone' Bottazzi, l'alcalde comunista del poble.\n\nAquest film va després de Il ritorno di don Camillo i precedeix a Don Camillo monsignore... ma non troppo.\n\nArgument [ modifica ]\n\nA la petita ciutat de Brescello, continuen les escaramusses entre el rector de la parròquia Don Camillo i l'alcalde comunista Peppone Bottazzi. Desconcertat, Don Camillo s'assabenta que Peppone té la intenció de presentar-se al parlament. Decidit a frustrar les seves ambicions, el sacerdot, ignorant les recomanacions del Senyor, decideix fer una campanya contra ell.\n\nRepartiment [ modifica ]\n\nBibliografia [ modifica ]"}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Film/DonCamillosLastRound", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Film/DonCamillosLastRound\n\nDon Camillo's Last Round (Italian: Don Camillo e l'onorevole Peppone; French: La grande bagarre de Don Camillo) is a 1955 Italian-French comedy film, the third in the Don Camillo franchise and the sequel to The Return of Don Camillo, directed by Carmine Gallone and starring Fernandel and Gino Cervi once again. It adapts elements from several Don Camillo stories by Giovannino Guareschi. René Barjavel wrote the French dialogues.\n\nIn the early fifties in the small Italian town of Brescello, skirmishes are continuing between the priest Don Camillo (Fernandel) and the Communist mayor Giuseppe \"Peppone\" Bottazzi (Cervi). After staging a theft of Don Camillo's prized chickens in retribution for a political prank pulled by the priest, Peppone decides to enter the big game of politics by standing for national deputy. A winsome young lady comrade sent from the big city to assist him, but the mayor's wife suspects there's more and complains to Don Camillo, who endeavours to remedy the threatened domestic breakdown.\n\nFollowed by Don Camillo: Monsignor.\n\nDon Camillo's Last Round provides examples of:"}, {"url": "https://www.goodreads.com/book/show/9694211-il-vecchio-con-gli-stivali-e-altri-racconti", "page_content": "Jump to ratings and reviews\n\nSono felice di avere letto questa raccolta. La qualità è un po' altalenante, ma alcune novelle sono davvero dei gioielli. Indimenticabile, nella sua apatica crudeltà, \"Il vecchio con gli stivali\". Eccellente pure \"Storia di Mila\" e in generale tutta la seconda parte del volume. Sono storie che parlano della Sicilia umile, della povera gente, di un tempo che non c'è più e di cui Brancati vuole conservare il nostalgico ricordo. L'occhio con cui guarda ai suoi personaggi, infatti, è sì ironico (amaramente ironico, a tratti), ma anche pieno di empatia, di compassione, di bonario affetto. Uno splendido spaccato della Sicilia della prima metà del secolo scorso, immersa nella guerra ma, nonostante tutto, sempre autentica.\n\nSono felice di avere letto questa raccolta. La qualità è un po' altalenante, ma alcune novelle sono davvero dei gioielli. Indimenticabile, nella sua apatica crudeltà, \"Il vecchio con gli stivali\". Eccellente pure \"Storia di Mila\" e in generale tutta la seconda parte del volume. Sono storie che parlano della Sicilia umile, della povera gente, di un tempo che non c'è più e di cui Brancati vuole conservare il nostalgico ricordo. L'occhio con cui guarda ai suoi personaggi, infatti, è sì ironico (amaramente ironico, a tratti), ma anche pieno di empatia, di compassione, di bonario affetto. Uno splendido spaccato della Sicilia della prima metà del secolo scorso, immersa nella guerra ma, nonostante tutto, sempre autentica.\n\nWhat do you think?\n\nAbout the author\n\n\"Brancati appartient par l'état civil à une génération d'intellectuels qui passe du fascisme au marxisme et au communisme stalinien à travers la prise de conscience de ce qu'était, selon le diagnostic marxiste, la guerre civile espagnole, pogrome de la Seconde Guerre mondiale ; pourtant il s'en détache, chronologiquement par une légère mais significative anticipation. Celle-ci lui permet de voir tout d'abord le fascisme non comme tragédie, mais comme “fait comique”, comme glorification du ridicule et obligation, pour les hommes, de s'y soumettre. Une sujétion au ridicule : tuant celui qui l'encourage comme celui qui le subit. À moins que celui qui le subit n'en soit délivré par un salutaire “manque de respect”. Comme Brancati, justement.\" En 1934, Pirandello, fasciste désormais sans illusion, publiait dans le Corriere la nouvelle Il y a quelqu'un qui rit : au cours d'une cérémonie indubitablement fasciste, une cérémonie du fascisme, de ses funestes solennités. Et tout se passe comme si Vitaliano Brancati en avait recueilli la consigne\".\n\n\"Brancati appartient par l'état civil à une génération d'intellectuels qui passe du fascisme au marxisme et au communisme stalinien à travers la prise de conscience de ce qu'était, selon le diagnostic marxiste, la guerre civile espagnole, pogrome de la Seconde Guerre mondiale ; pourtant il s'en détache, chronologiquement par une légère mais significative anticipation. Celle-ci lui permet de voir tout d'abord le fascisme non comme tragédie, mais comme “fait comique”, comme glorification du ridicule et obligation, pour les hommes, de s'y soumettre. Une sujétion au ridicule : tuant celui qui l'encourage comme celui qui le subit. À moins que celui qui le subit n'en soit délivré par un salutaire “manque de respect”. Comme Brancati, justement.\" En 1934, Pirandello, fasciste désormais sans illusion, publiait dans le Corriere la nouvelle Il y a quelqu'un qui rit : au cours d'une cérémonie indubitablement fasciste, une cérémonie du fascisme, de ses funestes solennités. Et tout se passe comme si Vitaliano Brancati en avait recueilli la consigne\".\n\nWant to read\n\nWant to read\n\nWant to read\n\nWant to read\n\nCan't find what you're looking for?"}, {"url": "https://www.primevideo.com/detail/Don-Camillo-e-lOnorevole-Peppone/0N913AWZP0O8XL8BISLKYVN6O8", "page_content": "This video is currently unavailable\n\nto watch in your location\n\nAdd Add Watchlist Share Share Share"}]}