{"Vitaliano Brancati also wrote several plays and screenplays, including the script for the film La terra trema (1948).": [{"url": "https://thescriptlab.com/features/screenwriting-101/3147-the-history-of-the-screenplay/", "page_content": "Greek philosopher, Heraclitus, was the first to theorize that ‘the only thing constant is change.’ Never more has this adage been true than for the writing known as the screenplay. The concept of the screenplay, its use and its function has constantly evolved since the beginning of film. The dictionary defines the screenplay as “the written form of a movie that also includes instructions on how it is to be acted and filmed: the script for a movie.” The term “screenplay” or for that matter “screenwriter,” though, has not always been so. In its earliest years, the writing for a film was called a scenario. In time and after much transformation, came continuity scripts. Eventually what emerged is what we now know today as the screenplay.\n\nScripting had long been used for the stage and later writers most certainly borrowed techniques and ideology from those who wrote for the theater. As film became a more viable form of entertainment, we see ‘scenarios’ come into existence. As early as the 1890’s, when films were about a minute or two long, scenarios not only provided a brief summary, but they also assisted with marketing and became helpful explanations for an audience not used to viewing pictures on film. Unfortunately, much of the progression that occurred in these early years is still unknown, and most historians acknowledge there is much research still to be done in order to understand the true evolution of screenwriting in this period.\n\nWhat is widely considered the earliest example of the modern script was written for George Melies’ 1902 film, A Trip to the Moon. The silent film, groundbreaking for its originality and special effects was also important for its transformative use of story. While “loading the gun,” and “splashing into the open sea” were descriptors that provided simple information about each scene, the thirty lines also described the action and provided locations, making it the closest example of a modern screenplay.\n\nAt twelve minutes, Edwin Porter’s 1903 film The Great Train Robbery was evidence of a trend that was sure to continue. Known for its use of the Master Scene Format, its script provided a structure for scenes verses descriptors for a series of cuts. Early on, the need for a script was pragmatic-scripts were helpful in understanding the amount of footage needed for a film. As narratives matured and film length increased, the production process became more complex and the need for scripting continued to expand. The widespread appearance of movie theaters also reinforced the need for an organizational aspect to filmmaking. The larger the audiences, the more sophisticated their taste, the more that was expected from films. From the first theater opening in Pittsburgh in 1905, the number of theaters would swell to 10,000 by the year 1910.\n\nWhen contemplating the history of screenwriting, one cannot divorce the theories of screenwriting from the evolution of film production. The earliest films were often solo projects, from conception to completion. Referred to as the “cameraman system” this was the most primitive of filmmaking. Soon, directors became central to the process, but most movies were filmed with only a vague idea of what the director wanted to shoot. Often crews were kept waiting while the director planned what to film next. So it was when one of the most important figures in the advancement of the filmmaking process emerged. Thomas Ince was already well established as a filmmaker, but by 1912 it was clear that standard filmmaking processes were wasteful. Thus began Ince’s collaboration with scenario writer Richard Spencer. Spencer, as many scenario writers were, was a former journalist and would go on to write or co-write many of Ince’s biggest films including The Battle of Gettysburg and Custer’s Last Fight. Writing for film was a field that had gained prominence in 1909, and by 1912 the compensation for stories was considerable.\n\nIt was also in 1912 that Ince founded Inceville studios on 18,000 acres in California. Simply put, the ideas executed at his studio revolutionized filmmaking. Known for his large-scale and lengthy productions, the immense coordination involved meant, for one, that practicality was a priority. Therefore, Ince required each film to have a script prior to production, which he used to budget out the film. Second, Ince realized the efficiencies created by dividing labor throughout the process. No longer was the director the only one who knew the production plan. Credited with balancing art with business imperatives, in Ince’s world, the writer and the script were paramount. Shooting scripts would become more readily used and soon transform into what would become known as continuity scripts. Across all facets of production, every crewmember now had the precise plan as to how each movie was to be filmed.\n\nOne of the earliest books on the topic of screenwriting came from Anita Loos and John Emerson in, “How to Write Photoplays.” The 1920 book guided the so-called “aspiring photo playwright.” Loos and Emerson encouraged writers not to be swayed by pessimists who lamented the “many tons of manuscripts…rejected yearly” and instead enticed them to consider writing as a “practical” and “lucrative” profession. Within its pages, the book laid out what a writer should expect. It encouraged the would-be writer to write synopses with worrying about learning how to put it in continuity form, which could come later. As far as tools, Loos and Emerson claimed the trade “requires little in the way” of them. A typewriter, dictionary, thesaurus and access to literary aids seem to be the only prerequisites the two offer. They encourage those interested to read the trades and most importantly, to see films.\n\nWith the emergence of sound, the alteration of the screenplay continued. The first feature length talking picture was 1927’s The Jazz Singer. With it’s commercial and critical success and synchronized dialogue, the decline of silent films was sure to follow. The dialogue now vital to a screenplay would ensure its place in filmmaking production.\n\nAny discussion of the evolution of the screenplay needs to acknowledge the importance of the economic transformation of the film industry into what is known as the Hollywood system. Considered to have begun around 1930, many believe its end to be in 1948 after the Supreme Court decision against the studios in the case of U.S. v. Paramount. Major studios such as Paramount, Fox, MGM and Warner Brothers had began to co-opt all aspects of filmmaking, from production to distribution. Further, they either owned theaters or set the terms of their sales of films to theaters. Studios worked within the contract system for all personnel including directors, actors and screenwriters, therefore they more or less controlled every facet of a film’s production including the script, its writers, directors and actors and even the film’s editing and score.\n\nIt was during this time that the continuity script was developed. At its core, the continuity script provided structure to the preproduction process; location, shots and a projection for the number of shooting days could be calculated. With its importance in every unit of production (from director to budget to set design), the need for consistency and uniformity was desirable. Script departments gained importance and the script began to function as a “blueprint.” A studio’s major objective was efficiency and cost control and a producer was in charge of organizing every aspect of the filming. Slowly, a producer’s role became more prominent than the director’s.\n\nAfter the Supreme Court declared the studios in violation of anti-trust laws in its 1948 ruling, much of the studio structure went by the wayside. Soon, the auteur theory would become yet another pivotal moment in the evolution of cinema. Originating in France around 1954 and adapted a few years later in the States, the theory as William Goldman states, is that it is a director “who creates the film,” and hence, it is the director who is the driving force of a film’s production. Gone was the team approach to making a film and gone was the importance of the screenplay (and therefore a screenwriter), in the creation of a film. Instead, it was the director who was seen as the true author of a film. One often used example of the auteur theory is Alfred Hitchcock who is freely credited for the success of the films he has directed, yet for which he wrote none of the screenplays. As imagined, the theory is a hotly debated subject within the filmmaking community (more recently the Schreiber theory would directly refute the auteur claim with a writer centric approach that emphasizes the screenplay as the dominant factor in the making of a film).\n\nAround 1970, actors’ salaries, along with the cost of producing a film, rapidly increased. Actors became more selective about choosing roles and the development of filmmaking as a “package” became prevalent. Quality scripts that would attract a sought after director and/or actor became vital in the new system; so-called spec scripts (speculative screenplay, written by a screenwriter with no promise of sale) gained in popularity and have done a great deal to revalue the screenwriter in the process.\n\nAcademics note that the current trend in scripts is toward a more literary style, with readability being key. No longer are there descriptions that are now considered either a director or an actor’s domain. Instead, story is crucial. Theories abound on how best to write a screenplay that will sell and how to make a screenplay stand out from the massive amount of scripts that surface daily. James Schamus (The Ice Storm, Crouching Tiger, Hidden Dragon) was recently quoted as saying, “when you have finished a screenplay, you have created approximately 124 pages of begging for money and attention.” Screenplays were born out of business necessity and much as it was in Thomas Ince’s time, it can be argued that the modern screenplay is as much an art form as it is a tool used in the day-to-day business of filmmaking."}, {"url": "https://www.studiobinder.com/blog/how-to-write-a-play-script-format/", "page_content": "Format for Plays and Screenplays Playwriting vs screenwriting Good news first: stage plays and screenplays share a lot of similarities. Both are generally structured the same way, with title pages, slug lines, and dialogue. Bad news: there are a few intricacies that make plays and film scripts different. Here’s writer Dui Jarrod breaking down some of the conceptual differences between stage plays and screenplays:\n\nPlay Script Format vs. Screenplay Format • Examined by Film Courage 2\n\n“When I sit down to write a play, I’m thinking about what I want to say. When I sit down to write a movie, I’m thinking about what I want to show,” Jarrod said about the difference between the two mediums. By considering the practical and conceptual differences between screenplays and stage plays, we’re better prepared to plan out our own stories. We’re going to dive into some technical differences between stage plays and screenplays, but first let’s jump into a stage play definition.\n\nSTAGE PLAY DEFINITION What is a stage play? A stage play is a story written that’s intended to be performed in a theater. Stage plays usually include a character glossary (dramatis personae), setting and time, and outlined act and scenes. Intermissions and act/scene-endings are almost always written into the script, as are stage directions, dialogue, and actions.\n\nFamous Types of Stage Plays: Comedies\n\nDramas\n\nTragedies\n\nHistories\n\nSatires\n\nMusicals\n\nFarces\n\nHistory of Play Script Formatting Where did play script format begin? Stage plays have been around for thousands of years — tracing all the way back to the ancient world. Egypt, Rome, and Greece all produced stage plays, and some of their works are considered among the greatest plays of all time. Modern theater is very much rooted in the ancient structure of stage plays. When writing a stage play, you should consider what kind of a stage you envision your play performed on. There are more than a dozen types of stages, but we’re going to focus on the three most popular. Proscenium Stage\n\nPlay Script Writing for the Proscenium Theater\n\nThe proscenium is the most popular type of theater stage. The stage faces out and is well known for its curtain, which separates the production from the audience. When a character breaks that veil, it’s referred to as “breaking the fourth wall.” Example: Most drama productions Thrust Stage\n\nPlay Script Writing for the Thrust Stage\n\nThe thrust stage brings the audience closer to the production. The stage itself and the surrounding audience chairs form a semicircle. Example: Most improv comedy stages Theater in the Round\n\nPlay Script Writing for the Theater in the Round\n\nThe “theater in the round” quite literally gives the audience a unique perspective every time they see the play. It also changes the dynamic of how you present scenes. Example: WWE If you plan on directing your stage play, you’ll have to write stage directions in your script. But remember: stage directions can always be added at a later date, just like camera directions in a screenplay. Format for Plays Explained Guide to play script formatting Before you get into the actual “play,” there are a few things you’re going to need to cover in the script. The first is the title page — which is very similar to a screenplay title page. If you’re using a program like Final Draft or StudioBinder’s screenwriting software, then simply use the template provided. If not, the image below should give you a good idea of how it should look.\n\nPlay Script Example • BBC Title Page Template\n\nTitle page check. Now it’s time to write the dramatis personae. Woo, sounds fancy (don’t worry, it’s really not). The dramatis personae is just a character glossary — and it should look something like this:\n\nPlay Script Example • Star Wars EU Dramatis Personae\n\nIn the dramatis personae, every character should be named, along with a very brief description of their age or physical attributes. Next up is the setting and time; where are we? And when are we?\n\n--------------------------------------------------------------------------------------------- SETTING A quaint seaside bungalow off the Amalfi Coast. TIME A Wedding ceremony, the day into night, the present. ---------------------------------------------------------------------------------------------\n\nThe “setting and time” is probably the easiest section to outline — and it can be of varying lengths depending on how much you want to say. The last thing you should do before starting the story is outline the structure of the play. Simply center your acts in the script, and place the corresponding scenes below. It should look like this:\n\n--------------------------------------------------------------------------------------------- ACT I Scene 1 The house Present Scene 2 Bedroom Present ACT II Scene 1 Gazebo Present Scene 2 Cellar Present --------------------------------------------------------------------------------------------- It’s worth mentioning that the formatting guidelines for stage plays are far less important than they are for screenplays. You could pick up two versions of the same play and see a myriad of different formats. But if you plan on optioning your stage play manuscript, the more organized it is, the better.\n\nFormat for Plays How to write in play format If you plan on writing a stage play you should review how to format a screenplay. Most script writers have a strong understanding of the screenplay format and the stage play format. Think about it: you may have an idea for a screenplay, but it may work better as a stage play (or vice-versa). Some stories are just more naturally suited for one medium rather than the other. One great example of this is Samuel Beckett’s play Waiting for Godot – a story that simply wouldn’t work as a film. This next video shows how Waiting for Godot transformed live-drama and helped to institute the theater of the absurd movement.\n\nHow to Format a Play • Waiting for Godot Examined by Ted-Ed"}, {"url": "https://www.nyfa.edu/student-resources/10-great-websites-download-movie-scripts/", "page_content": "If you want to write movie scripts, you need to read movie scripts – it’s just as essential as batting practice for professional baseball players. As you read scripts, you’ll start to remember subtle connections between language and storytelling and see proper formatting in action. For aspiring screenwriters who want to learn how to write their own movie scripts, it’s vital to see the difference between how scenes play out on the page and how they play out on the screen.\n\nReading Movie Scripts: The Benefits for Screenwriters\n\nYou need to watch movies to make movies. However, for aspiring screenwriters, reading screenplay after screenplay is also incredibly beneficial. By reading through scripts from various writers, you can get a sense of how you want to write your own screenplays. While proper screenwriting adheres to a very rigid format, it’s beneficial to see how various writers work within those rules and even use them to their advantage.\n\nHere are ten websites that allow you to download professional movie scripts to review.\n\n1. IMSDB – Internet Movie Screenplay Database\n\nhttp://www.imsdb.com/\n\nIMDB has proven a valuable resource for researching movie crews, casts, and trivia. IMSDB is just as useful for screenplays of all genres.\n\n2. Go Into the Story\n\nhttp://gointothestory.blcklst.com/free-script-downloads/\n\nGo Into the Story is the official blog for The Blacklist, the screenwriting community famous for its annual top ten list of unproduced scripts. One helpful feature of Go Into the Story is its bank of downloadable movie scripts.\n\n3. Drew’s Script-o-Rama\n\nhttp://www.script-o-rama.com/snazzy/table.html\n\nThe titular Drew has been sharing scripts with curious readers and writers for almost two decades now and has a vast library from which to choose. A great benefit of Script-O-Rama is that it holds several drafts of certain movies, an invaluable resource for those who want to see how a Hollywood film evolves in the writing process.\n\n4. Simply Scripts\n\nhttp://www.simplyscripts.com/movie.html\n\nSimply Scripts has a wide, diverse library, including plays and non-English screenplays. It’s also constantly updated, providing scripts for great movies such as Interstellar and Foxcatcher.\n\n5. AwesomeFilm\n\nhttp://www.awesomefilm.com/\n\nAwesomeFilm is another resource with dozens of scripts you can download with a single click, alphabetized for easy searching. If you’re looking for a screenplay to read, this site is, well, awesome.\n\n6. Screenplays For You\n\nhttp://sfy.ru/\n\nScreenplays For You is a clean, smooth website with hundreds of scripts. You’re likely to find something from the genre you need—its library boasts everything from low-key award-winning dramas like Sideways to action blockbusters like Avatar.\n\n7. The Daily Script\n\nhttp://www.dailyscript.com/movie.html\n\nThe Daily Script offers a ton of screenplays in a straightforward, easy-to-navigate layout. It keeps things homey for the typical screenwriter, even using Courier New as its primary font.\n\n8. The Screenplay Database\n\nhttp://www.screenplaydb.com/film/all\n\nThe Screenplay Database is another useful resource with many scripts to choose from. If you’re interested in a certain type of film, the website also allows you to search its library by genre to allow you to find something you didn’t even know you were looking for.\n\n9. The Script Lab\n\nhttps://thescriptlab.com/\n\nThe Script Lab is handy if you’re looking for more recent screenplays. Its front page divides its library into the three most recent years of releases, so if there’s something from 2014 you’d like, for instance, Birdman or Boyhood, this is the website for you.\n\n10. Movie Scripts and Screenplays\n\nhttp://www.moviescriptsandscreenplays.com/\n\nYou’ve got to love the straightforward title. Movie Scripts and Screenplays gives you exactly what it says, with a long list of manuscripts that you can also directly find with its search function.\n\nLearn How to Write Your Own Movie Scripts\n\nIf you’re ready to learn how to write your own screenplays, reading through movie scripts is a great place to start. Example scripts can provide crucial direction in terms of formatting, plot, character development, and more. For screenwriters who want to take the next step and develop their screenplay, request more information about NYFA’s workshops about writing for film."}, {"url": "https://www.ward9productions.ch/aboutjs", "page_content": "My filmmaking career began at the UT Austin and UT Dallas, where I received my BA in Theater with a minor in Philosophy. I then moved to New York City to study film at NYU. Parallel to university, I was accepted into the renowned talent factory, the Actors Studio in NYC, with the Playwright/ Directors Unit, where I studied under Elia Kazan (East of Eden, On the Waterfront) and Arthur Penn (Bonnie & Clyde). I graduated from NYU with a short film, ‘Hey Joey’.\n\nI rewrote the script for ‘Hey Joey‘ to feature length and called the story ‘Little Noises‘ from then on. For the film, I got Crispin Glover (Back to the Future) and Tatum O'Neal (Oscar winner in ‘Paper Moon’) to star, as well as Los Angeles production company Monument Pictures. We made the film and in the following year, ‘Little Noises’ premiered in the main competition at the Sundance Film Festival.\n\nThereafter, I started writing screenplays including ‘South of Hope Street‘, ‘The Red Weather‘, ‘How to Be An American‘, ‘The Unraveling‘, ‘The Ninth Cloud‘, and ‘Faces On Mars‘. I was also drawn back to the theatre. I wrote several plays and directed the performances of ‘Critical Mass‘ at the Actors Studio, NYC starring Michael Imperioli (‘The Sopranos‘), ‘Playground Sounds‘ at Circle Rep, NYC, ‘How Soon Is Now‘ at One Dream Theatre, NYC, ‘Wake Up Running‘ at the Gate Theater and Riverside Studio (both London), and ‘Faces on Mars‘ at the Fountain Head Theatre, Los Angeles.\n\n​\n\nInspired by the Dogma 95 movement and the digital revolution in film, I decided in 1998 to set up my own project with actors from the Los Angeles theater scene. In the year I was able to secure the financing and produce my feature film ‘Faces On Mars‘. Shortly after 911, I moved to Zurich with my Swiss partner, which became my adopted home. ‘Faces On Mars’ premiered in the feature film category at the Swiss Solothurn Film Festival 2003. In Switzerland I wrote also two more screenplays, the comedy ‘Please Don't Be Long‘ and the period piece on composer Erik Satie ‘The Velvet Gentlemen‘.\n\nIn 2005 I decided to found the production company WARD9 Productions with Marc Holthuizen. Project No.1 with WARD9 was ‘The Ninth CLoud‘. First I shot a short film in Paris based on this script starring Julia Jentsch (Sophie Scholl). I was next able to win Jean-Hugues Anglade (Betty Blue) and Michael Madsen (Thelma & Louise) for the feature film screenplay. I shot it in Budapest and London and premiered ‘The Ninth Cloud‘ at the 2014 Raindance Film Festival (London). The film was also screened at the Shanghai International Film Festival (CN), La Femme Film Festival (Los Angeles) and Glasgow Film Festival (Scotland) to very good reviews.\n\n​\n\nAfter that I started to work on ‘South of Hope Street‘. The film was shot in Switzerland and I was able to hire the actors Judd Nelson (The Breakfast Club) and William Baldwin (Backdraft), and editor Patricia Rommel (The Lives of Others). After a complex post-production with many visual effects and a lush score, I finished the film recently."}, {"url": "https://study.com/academy/lesson/parts-of-a-script-plays-films.html", "page_content": "Playwriting\n\nDerived from the overall story, the plot is the chain of events advancing the story; one event causes the next, which exists in the linear plots of most plays. With either comedy or tragedy, plots contain conflict, and characters confront obstacles and complications in their character arcs.\n\nYou weave the characters into the storyline, decide where they are, and where they go, and craft how they speak. Plays are propelled by dialogue; thus, the use of language is critical.\n\nStructurally, plays have a beginning, middle, and end, and they are divided into acts, which are subdivided into scenes. The five-act play structure follows this pattern:\n\nExposition: The play's introduction of the story, characters, setting, and conflict. Rising Action: The series of events leading to the climax, creating suspense. Climax: The intense turning point of the play. Falling Action: The action as the plot twists are revealed, and the story concludes. Resolution or Denouement: As the play ends, the final outcome is uncovered, and the plot complications are resolved.\n\nThis structure is important to understand because even plays in one, two, or three acts utilize elements in the five-act pattern.\n\nPlay Format\n\nA play manuscript format starts with a title page, a character list and description, and a page with the time, setting, and division of acts and scenes.\n\nThen the actual dialogue begins, headed by the Act and Scene numbers, such as ACT I (Roman Numerals), SCENE 1 (Arabic numerals). The character name, bolded and in all caps, is centered above the dialogue line, which is directly underneath the name on a separate line.\n\nAs part of the writer's vision, stage directions are indented and written in parentheses on a separate line from the dialogue. All pages must be numbered.\n\nScreenwriting\n\nFilm is a visual medium, and the story is told through image and action with concise dialogue. A screenplay starts with an idea, and often, a pivotal character. The writer creates an outline with a beginning, end, and five essential plot incidents.\n\nAlso, movie writers commonly use the three-act structure for screenplays, with each act ending in a defining moment. A film is fast-paced, and the scenes need to forward the story or get cut. In fact, films have a tremendous number of scenes and locations, and depending on budget, writers can create any reality in their imaginations.\n\nIn addition to succinct dialogue, the screenwriter must include action lines, which describe the action of the scene and provide character clues. One page of a screenplay equals one minute of film, and the length of the script should fall between 90 and 120 pages."}, {"url": "https://writersstore.com/blogs/news/how-to-write-a-screenplay-a-guide-to-scriptwriting", "page_content": "It's easy to feel intimidated by the thought of writing a screenplay. The rules! The formatting! The binding! Don't let the seemingly endless parade of screenwriting elements scare you away from writing your first script. Since a familiarity with the basics of the craft is half the battle, The Writers Store has provided you with resources, a screenplay example, and overview on how to write a screenplay to help you get up to speed on screenwriting fundamentals.\n\nCombine that with the right screenwriting software, books and supplies, and you'll be ready to type FADE IN before you know it.\n\nEnter your email below and receive our Screenwriting Starter Package, a $120 value, absolutely free! Inside you'll find industry-best resources for those just getting started.\n\nIn the most basic terms, a screenplay is a 90-120 page document written in Courier 12pt font on 8 1/2\" x 11\" bright white three-hole punched paper. Wondering why Courier font is used? It's a timing issue. One formatted script page in Courier font equals roughly one minute of screen time. That's why the average page count of a screenplay should come in between 90 and 120 pages. Comedies tend to be on the shorter side (90 pages, or 1 ½ hours) while Dramas run longer (120 pages, or 2 hours).\n\nA screenplay can be an original piece, or based on a true story or previously written piece, like a novel, stage play or newspaper article. At its heart, a screenplay is a blueprint for the film it will one day become. Professionals on the set including the producer, director, set designer and actors all translate the screenwriter's vision using their individual talents. Since the creation of a film is ultimately a collaborative art, the screenwriter must be aware of each person's role and as such, the script should reflect the writer's knowledge.\n\nFor example, it's crucial to remember that film is primarily a visual medium. As a screenwriter, you must show what's happening in a story, rather than tell. A 2-page inner monologue may work well for a novel, but is the kiss of death in a script. The very nature of screenwriting is based on how to show a story on a screen, and pivotal moments can be conveyed through something as simple as a look on an actor's face. Let's take a look at what a screenplay's structure looks like.\n\nThe First Page of a Screenplay\n\nWhile screenplay formatting software such as Final Draft, Movie Magic Screenwriter, Movie Outline and Montage frees you from having to learn the nitty-gritty of margins and indents, it's good to have a grasp of the general spacing standards.\n\nSample First Page-\n\n\n\nThe top, bottom and right margins of a screenplay are 1\". The left margin is 1.5\". The extra half-inch of white space to the left of a script page allows for binding with brads, yet still imparts a feeling of vertical balance of the text on the page. The entire document should be single-spaced.\n\nThe very first item on the first page should be the words FADE IN:. Note: the first page is never numbered. Subsequent page numbers appear in the upper right hand corner, 0.5\" from the top of the page, flush right to the margin.\n\nScreenplay Elements\n\nBelow is a list of items (with definitions) that make up the screenplay format, along with indenting information. Again, screenplay software will automatically format all these elements, but a screenwriter must have a working knowledge of the definitions to know when to use each one.\n\nScene Heading\n\nIndent: Left: 0.0\" Right: 0.0\" Width: 6.0\"\n\nA scene heading is a one-line description of the location and time of day of a scene, also known as a \"slugline.\" It should always be in CAPS.\n\nExample: EXT. WRITERS STORE - DAY reveals that the action takes place outside The Writers Store during the daytime.\n\nSubheader\n\nIndent: Left: 0.0\" Right: 0.0\" Width: 6.0\"\n\nWhen a new scene heading is not necessary, but some distinction needs to be made in the action, you can use a subheader. But be sure to use these sparingly, as a script full of subheaders is generally frowned upon. A good example is when there are a series of quick cuts between two locations, you would use the term INTERCUT and the scene locations.\n\nAction\n\nIndent: Left: 0.0\" Right: 0.0\" Width: 6.0\"\n\nThe narrative description of the events of a scene, written in the present tense. Also less commonly known as direction, visual exposition, blackstuff, description or scene direction.\n\nRemember - only things that can be seen and heard should be included in the action.\n\nCharacter\n\nIndent: Left: 2.0\" Right: 0.0\" Width: 4.0\"\n\nWhen a character is introduced, his name should be capitalized within the action. For example: The door opens and in walks LIAM, a thirty-something hipster with attitude to spare.\n\nA character's name is CAPPED and always listed above his lines of dialogue. Minor characters may be listed without names, for example \"TAXI DRIVER\" or \"CUSTOMER.\"\n\nDialogue\n\nIndent: Left: 1.0\" Right: 1.5\" Width: 3.5\"\n\nLines of speech for each character. Dialogue format is used anytime a character is heard speaking, even for off-screen and voice-overs.\n\nParenthetical\n\nIndent: Left: 1.5\" Right: 2.0\" Width: 2.5\"\n\nA parenthetical is direction for the character, that is either attitude or action-oriented. With roots in the playwriting genre, today, parentheticals are used very rarely, and only if absolutely necessary. Why? Two reasons. First, if you need to use a parenthetical to convey what's going on with your dialogue, then it probably just needs a good re-write. Second, it's the director's job to instruct an actor on how to deliver a line, and everyone knows not to encroach on the director's turf!\n\nExtension\n\nPlaced after the character's name, in parentheses\n\nAn abbreviated technical note placed after the character's name to indicate how the voice will be heard onscreen, for example, if the character is speaking as a voice-over, it would appear as LIAM (V.O.).\n\nTransition\n\nIndent: Left: 4.0\" Right: 0.0\" Width: 2.0\"\n\nTransitions are film editing instructions, and generally only appear in a shooting script. Transition verbiage includes:\n\nCUT TO:\n\nDISSOLVE TO:\n\nSMASH CUT:\n\nQUICK CUT:\n\nFADE TO:\n\nAs a spec script writer, you should avoid using a transition unless there is no other way to indicate a story element. For example, you might need to use DISSOLVE TO: to indicate that a large amount of time has passed.\n\nShot\n\nIndent: Left: 0.0\" Right: 0.0\" Width: 6.0\"\n\nA shot tells the reader the focal point within a scene has changed. Like a transition, there's rarely a time when a spec screenwriter should insert shot directions. Once again, that's the director's job.\n\n\n\nExamples of Shots:\n\nANGLE ON --\n\nEXTREME CLOSE UP --\n\nPAN TO --\n\nLIAM'S POV --\n\nSpec Script vs. Shooting Script\n\nA \"spec script\" literally means that you are writing a screenplay on speculation. That is, no one is paying you to write the script. You are penning it in hopes of selling the script to a buyer. Spec scripts should stick stringently to established screenwriting rules.\n\nOnce a script is purchased, it becomes a shooting script, also called a production script. This is a version of the screenplay created for film production. It will include technical instructions, like film editing notes, shots, cuts and the like. All the scenes are numbered, and revisions are marked with a color-coded system. This is done so that the production assistants and director can then arrange the order in which the scenes will be shot for the most efficient use of stage, cast, and location resources.\n\nA spec script should NEVER contain the elements of shooting script. The biggest mistake any new screenwriter can make is to submit a script full of production language, including camera angles and editing transitions. It can be very difficult to resist putting this type of language in your script. After all, it's your story and you see it in a very specific way. However, facts are facts. If you want to direct your script, then try to go the independent filmmaker route. But if you want to sell your script, then stick to the accepted spec screenplay format.\n\nScreenplay Formatting Software\n\nScreenwriting software makes producing an Industry-standard script simple and straightforward. Programs like Final Draft and Movie Magic Screenwriter put your words into proper screenplay format as you type, letting you focus on a well-told story rather than the chore of margins and spacing.\n\nThere’s also a wide spectrum of outlining and development software at the ready to help you get your thoughts together before you begin writing. Popular story development software includes Dramatica Pro, a step-by-step guide to the storytelling process, Contour, a character-based structuring system, and Save the Cat!, a program centered on successful screenwriter Blake Snyder’s own proven methods.\n\nAnd if you want a program that combines story development and formatting? Check out Movie Outline, an all-in-one development package that uses step outlining to build your story, scene-by-scene, and Montage, which includes both outline and submission tracking functions.\n\nScript Presentation and Binding\n\nJust like the format of a script, there are very specific rules for binding and presenting your script. The first page is the title page, which should also be written in Courier 12pt font. No graphics, no fancy pictures, only the title of your script, with “written by” and your name in the center of the page. In the lower left-hand or right-hand corner, enter your contact information. In the lower left-hand or right-hand corner you can put Registered, WGA or a copyright notification, though this is generally not a requirement.\n\nBelow is a list of items you need to prepare your script to be sent out:\n\nScript Covers, either linen or standard card stock\n\nThree-Hole Punched Paper\n\nScreenplay Brass Fasteners (also called Brads), Acco number 5 size 1 1/4-inch for scripts up to 120 pages; Acco number 6 size 2-inch for larger scripts\n\nScript Binding Mallet (optional)\n\nScreenplay Brass Washers\n\nScript Mailers\n\nFollow these directions to properly bind your script:\n\nPrint your title page and script on bright white three-hole punched paper. Insert the title page and the script into the script cover. The front and back covers remain blank. They are just there to protect your script. And remember: pictures and text on script covers scream amateur. Insert two brass fasteners in the first and third holes. Do NOT put a fastener in the middle hole. Flip the script over, and slide the brass washers over the arms of the fasteners. Spread the arms of the fasteners flat against the script. Use a Script Binding Mallet to ensure a tight, flat fit. Use the flat, self-seal script mailers to send your scripts out to buyers.\n\nMaterials for Further Exploration\n\nNow that you understand screenplay basics, you’re no doubt ready to continue your exploration of the craft and go beyond learning how to write a movie script. The books listed below are some of The Writers Store’s favorite guides to screenwriting.\n\nThe Screenwriter's Bible: A Complete Guide to Writing, Formatting, and Selling Your Script\n\nWondering how to write a script? This first-rate screenwriting primer provides a concise presentation of screenwriting basics, along with query letters, useful worksheets, checklists, sample scenes and more to help you break into screenplay writing.\n\nFrom Script to Screen\n\nWhat goes into the making of Hollywood's greatest motion pictures? Join Linda Seger and Edward Whetmore as they examine recent screenplays on their journey from script to screen.\n\nHollywood Standard: The Complete and Authoritative Guide to Script Format and Style\n\nThe Hollywood Standard describes in clear, vivid prose and hundreds of examples how to format every element of a screenplay or television script.\n\nSave the Cat!\n\nThis ultimate insider's guide reveals the secrets that none dare admit, told by a show biz veteran who's proven that you can sell your script if you can Save the Cat.\n\nInterested in taking a screenwriting class? Visit our courses section for webinars, live seminars, online courses, one-on-one instruction and on-demand courses. You can download a free webinar on \"How to Write a Screenplay\" from magazine site, ScriptMag.com."}, {"url": "https://interestingfactsworld.com/wrote-screenplay-facts.html", "page_content": "Wrote Screenplay facts\n\nWhile investigating facts about How To Write A Screenplay and Wrote Screenplay Now What, I found out little known, but curios details like:\n\nRod Stirling wrote the screenplay for Planet Of The Apes. The twist ending came from a woman he met at a party who pitched him the \"it was earth all along\" plot as a Twilight Zone episode. He paid her $500 for the idea.\n\nhow write screenplay?\n\nDavid Hayter(the voice of Solid Snake from Metal Gear Solid), wrote the screenplay for Watchmen.\n\nIn my opinion, it is useful to put together a list of the most interesting details from trusted sources that I've come across. Here are 50 of the best facts about Write Screenplay In 21 Days and Who Wrote Screenplay For Green Book I managed to collect.\n\ni wrote a screenplay now what?\n\nThe author of The Princess Bride also wrote the screenplays for Misery, A Few Good Men, Twins, Butch Cassidy and the Sundance Kid, and All The President's Men. David Hayter, the original voice of Snake in the Metal Gear Solid series, wrote the screenplay for the first X-Men movie and the film The Watchmen. Roald Dahl, author of \"James and the Giant Peach\" and \"Charlie and the Chocolate Factory\", wrote the screenplay for the James Bond movie, \"You Only Live Twice\". Richard Pryor wrote the screenplay for Blazing Saddles however he was rejected for the role of Sheriff Bart Judd Apatow wrote the screenplay for \"Heavy Weights,\" aka the fat camp movie with Ben Stiller. The Voice of Solid Snake in Metal Gear Solid wrote the screenplays for Watchmen, X-Men, and X2: X-Men United Roald Dahl wrote the screenplay for the James Bond film 'You Only Live Twice' Roald Dahl wrote the screenplay for You Only Live Twice Following the release of Rocky IV, a joke was making rounds in Hollywood. Since Rocky had run out of opponents, he would have to fight an alien if a fifth movie was made. Jim and John Thomas took the joke seriously and wrote a screenplay based on it, which later became the movie \"Predator\". Quentin Tarantino and Roger Avary wrote a massive screenplay in 1987 called 'The Open Road', which would later get split into two separate screenplays called 'True Romance' and 'Natural Born Killers'.\n\nWho wrote the poem i know why the caged bird sings?\n\nYou can easily fact check who wrote the poem i wonder why the grass is green by examining the linked well-known sources.\n\nThe Trip (1967 movie) by Roger Corman is a movie about LSD, the director took doses to make it. Jack Nicholson who wrote the screenplay was taking it at this time along with two actors in the movie were famous for tripping: Dennis Hooper and Peter Fonda.\n\nRoald Dahl wrote the screenplay for the 1967 James Bond film, You Only Live Twice. He was actually friends with Ian Fleming, but disliked the original novel. So with the blessing of film producers, he heavily changed the story to better fit the big screen. - source\n\nRoald Dahl wrote screenplays for two Ian Fleming novels, You Only Live Twice and Chitty Chitty Bang Bang - source\n\nM. Night Shyamalan wrote the screenplay for Stuart Little.\n\nDavid Hayter (best known as the voice of Solid Snake in MGS) wrote the screenplay for the first X-Men film and cowrote the screenplay for Watchmen and X2 - source\n\nWho wrote the poem when tomorrow starts without me?\n\nCharlie Kaufman wrote the screenplay for Adaptation with his fictional brother Donald Kaufman. Both were nominated for a Best Screenplay Oscar, even though Donald Kaufman doesn't exist.\n\nHow write screenplay for beginners?\n\nWhen James Cameron wrote the Terminator screenplay, he was living out of his car and was struggling to get by. In exchange for the directing gig, he sold the script to Gale Anne Hurd for one dollar. The movie went on to bring in around $80 million worldwide, which launched Cameron’s career\n\n2001: A Space Odyssey, the book became a 1968 movie. It went on to become Space Odyssey, the television series. Arthur C. Clarke and Stanley Kubrick wrote the screenplay for the movie.\n\nArundhati wrote the screenplay for In Which Annie Gives It Those Ones (1989), and Electric Moon (1992). She won Best Screenplay in 1989, a National Film Award for In Which Annie Gives It Those Ones.\n\nIn 1979 the movie adaptation of The World is Full of Married Men was released. Jackie wrote the screenplay for the movie.\n\nJoss Whedon co-wrote the screenplay for Toy Story"}, {"url": "https://www.studiobinder.com/blog/what-is-screenplay-definition/", "page_content": "Define Screenplay Screenplay 101 If you want to make that transition from writing to scriptwriting, you have to know what a screenplay is.\n\nSCREENPLAY DEFINITION What is a screenplay? A screenplay is a written work for a film, television show, or other moving media, that expresses the movement, actions and dialogue of characters. Screenplays, or scripts, are the blueprint for the movie. A screenplay is written in a specific format to distinguish between characters, action lines, and dialogue.\n\nPROPER SCREENPLAY FORMAT INCLUDES: Scene headings/slug lines\n\nAction lines\n\nCharacter names\n\nDialogue\n\nParenthetical(s)\n\nThe elements of a screenplay come together on the page in a specific format. In the following diagram, you'll see the various required elements and their basic layout. Proper script formatting is a necessary evil. It may seem tedious (it is) but it's just something we have to accept. Movies are budgeted and scheduled directly from the script length, how many scenes are on a single page, etc. This is why understanding and implementing format is so crucial. The best way to combat this is to use official screenwriting software. These programs are designed to handle all of the formatting so you can focus on the creative. Follow the linked image below to see a sample script, including formatting and required elements.\n\nScreenplay elements and layout\n\nAs you can see, each element has defined parameters on the page. Trying to format all of these elements manually is not only a pain, it can seriously interrupt your creative flow. Some scripts also add in transitions, or types of shots. Though this isn’t necessary if someone else will be directing the film. In fact, some directors would prefer you leave them out. Now that we've defined what a screenplay is and some of its basic elements, the next step is to understand proper screenplay formatting."}, {"url": "https://www.studiobinder.com/blog/screenplay-vs-script/", "page_content": "Script vs Screenplay What is a screenplay? How does one define screenplay? As the name might imply, a screenplay tends to refer to scripts written in mind for the screen. Here we will see some major differences between a screenplay and a script. We then start by covering a basic definition before digging into specifics.\n\nDEFINE SCREENPLAY MEANING What is a screenplay? A screenplay is a written work that either tells an original story or adapts a pre-existing one for the purposes of being made into a short or feature film. Screenplays aim to provide as much detail and information as possible in a matter that flows and is consistent. In this way, screenplays give readers an idea of how the story might play out on-screen.\n\nScreenplay characteristics include: Reliance on prose to tell the story\n\nDescriptive detail to engage and entertain the reader\n\nDialogue and descriptions of places, events & settings\n\nScreenplays are definitely a type of script, but they are not what you would consider a traditional shooting script. This is because the job of a screenwriter is to tell a story, one that will make a possible investor want to put money into the project. As a result, a key difference with a script vs screenplay is the technical details that are reserved for “on-set” scripts are not present. Putting a screenplay into StudioBinder’s screenwriting software allows us to easily see how a screenplay looks. The amount of detail clues us that what we’re seeing is meant to be read carefully with the intention of understanding the world of the screenplay. This is one of the biggest differences between a screenplay and a script, as you can see below for The Royal Tenenbaums.\n\nScreenplay vs Script • Read the scene here\n\nOne thing you will notice between a screenplay vs script is the lack of technical details. We have the details of the setting and scene in the same way as we might in a fictional book. The major difference, of course, is the format of the text; information, especially dialogue, is clearly separated and laid out for the reader. Admittedly, screenplays will share similarities with traditional scripts. This can mostly be seen in how dialogue is formatted (this stays the same) and the specification of whether an environment is an interior (INT) or exterior (EXT). That said, there’s no hard rule saying your screenplay has to look like that, but this industry-standard formatting rules are in place for a reason. One amusing thing to note is that spec scripts have more in common with traditional screenplays. This is because they are meant to showcase the screenwriter’s abilities for telling a story over the technical details. In this way, a spec script is a similar sibling to a regular screenplay.\n\nScript vs Screenplay Meaning What is a script? After going over some differences between a screenplay and a script, we can now venture directly into a definition of a script. It does not get more open ended than the word “script,” so let’s dig into that definition below, before providing specific examples regarding a movie script vs screenplay.\n\nSCRIPT DEFINITION What is a script? A script is a written document that often features dialogue, as well as setting and character information. Scripts have been used for centuries and are used in all sorts of media that uses predetermined actions (like a narrative or speech). In this way, the word “script” can be considered the general term for the document used to tell a story and/or dialogue in mediums such as movies, plays, and video games.\n\nScript characteristics include: Clearly defined dialogue and detailed settings\n\nDetailed technical info for the cast and crew (for shooting scripts)\n\nTells a story primarily through dialogue and descriptions\n\nBoth screenplays and scripts are written to be read, but scripts for in-production films are mainly to coordinate and have everyone on the same page. So even if a lot of the screenplay is still there, it can be restructured and altered for the purposes of a shoot. Not only that, but the screenwriter is almost never there for the shoots, unless of course the director, or someone else on set, is the writer. The first thing you will notice on a legitimate script is how many revisions it has gone through and which version of the script you're currently reading. These are the types of scripts you will find online and they often double as the shooting script. They tend to be colored in person, but online, you must rely on the color name alone.\n\nScreenplay vs Script • Revision Colors\n\nA script for a shoot is when those tech details come into play. Below is a quick example of how a script can specify a camera move and even actions within a scene. Some of this can be retained from the screenplay, but other aspects will be altered to fit the needs and standards of a shooting script.\n\nScreenplay vs Script • Read the whole scene here\n\nStudioBinder’s software also makes it easy to plot out how a script will look. INT/EXT notes become extremely important on a script, and our software makes it easier than ever to make them stand out. Colors can also be changed, and the script can be worked on within the software itself.\n\nScreenplay vs Script • Help differentiate locations with SB software\n\nA few other things unique to a script versus a screenplay are the use of multiple page/scene numbers and omissions. It is not unusual for the fifth or sixth version of a script to have pages or scenes omitted and listed as such. This is done because reprinting and distributing a whole new script is way too much work; a simple “omission” is really all you need, so long as it’s made clear to all involved. You can see an example of this below with the script for Scott Pilgrim vs the World.\n\nScreenplay vs Script • Read the entire scene here"}, {"url": "https://filmdaft.com/script-vs-screenplay-difference/", "page_content": "DISCLOSURE: AS AN AMAZON ASSOCIATE I EARN FROM QUALIFYING PURCHASES.\n\nTHIS POST MAY CONTAIN AFFILIATE LINKS, MEANING, AT NO ADDITIONAL COST TO YOU, I EARN FROM QUALIFYING PURCHASES. AFFILIATE LINKS ARE MARKED WITH #ad. \"I\" IN THIS CASE MEANS THE OWNER OF FILMDAFT.COM. PLEASE READ THE FULL DISCLOSURE FOR MORE INFO.\n\nWhen first starting out as a filmmaker or videographer, the terms script and screenplay might have confused you. Both are used almost interchangeably, so does that mean they are the same thing? If not, what is the difference between a script and a screenplay?\n\nA “script” is the written document version of a visual art form and is used across multiple mediums, while a “screenplay” refers to a script specifically for movies or television. When you read a script, it could be for a play, movie, television show, comic book or video game, while a screenplay is specific to movies and tv shows. Each script has its own formatting rules to help you tell what type of script it is; whether it’s a screenplay, teleplay, stage play, or something else.\n\nBut first, what is the origin of the term “screenplay” and when did it come to exist?\n\nWhat is the origin of the term “screenplay” and how is it different from a script?\n\nThe origin of the word “screenplay” started around the 1940s, but its origins and source are notoriously hard to track down – at least, according to most film historians.\n\nWhile you would think the term “screenplay” and its format of script would’ve sprung forth naturally from the creativity of writers like other art forms, the creation of the screenplay and its format seemingly came together from a series of practical and technical business decisions.\n\nEssentially, as the popularity of “movers” grew from a novelty side show to their own individual art form, the producers of these productions had to evolve their scripts from simple one paragraph summaries of what happened, referred to as “scenarios”, to something more similar to the screenplays of today by incorporating what’s known as “master scene” formatting.\n\nThe blog Screenplayology provides a great summary of literary sources that traces back the etymology of the term and popularity of the format, tracking the transition from these “scenario” scripts into camera-direction heavy “continuity scripts” as productions got more complicated, eventually leading to the development of the “master scene” format we now know.\n\nThe master scene formatting divides the screenplay into scenes separated by location; something that’s a staple of modern screenplays and screenwriting today:\n\n[…] whereas the continuity script had evolved to ensure visual continuity and fidelity to a pre-approved budget — the primary concerns of a central producer — the master scene script evolves to ensure readability, serving the needs of the independent producer who must shop his or her script as a property to be financed” Source: Screenplayology\n\nWhat’s the difference between a scenario, continuity, and master scene script?\n\nTake a look at this excerpt from the scenario script for Georges Melies’s A Trip to the Moon (which film school students will recognize right away, and non-film school students might recognize from Martin Scorsese’s 2012 film Hugo), written by Georges Melies:\n\nThe Scientific Congress at the Astronomic Club. Planning the Trip. Appointing the Explorers and Servants. Farewell. The Workshops. Constructing the Projectile. The Foundries. The Chimney-stack. The Casting of the Monster Gun/Cannon. The Astronomers-Scientists Enter the Shell.\n\nCheck out how these first five “scenes” from Melies’ script translated to the actual film, shared here by Youtube-channel Open Culture:\n\nNow, compare the above scenario script to this excerpt from this continuity script for the famous “original narrative film”, The Great Train Robbery, adapted by the director Edwin S. Porter from the play written by Scott Marble:\n\n“1. INTERIOR OF RAILROAD TELEGRAPH OFFICE. Two masked robbers enter and compel the operator to get the “signal block” to stop the approaching train, and make him write a fictitious order to the engineer to take water at this station, instead of “Red Lodge,” the regular watering stop. The train comes to a standstill (seen through window of office); the conductor comes to the window, and the frightened operator delivers the order while the bandits crouch out of sight, at the same time keeping him covered with their revolvers. As soon as the conductor leaves, they fall upon the operator, bind and gag him, and hastily depart to catch the moving train. “2 RAILROAD WATER TOWER. The bandits are hiding behind the tank as the train, under the false order, stops to take water. Just before she pulls out they stealthily board the train between the express car and the tender. “3 INTERIOR OF EXPRESS CAR. Messenger is busily engaged. An unusual sound alarms him. He goes to the door, peeps through the keyhole and discovers two men trying to break in. He starts back bewildered, but, quickly recovering, he hastily locks the strong box containing the valuables and throws the key through the open side door. Drawing his revolver, he crouches behind a desk. In the meantime, the two robbers have succeeded in breaking in the door and enter cautiously. The messenger opens fire, and a desperate pistol duel takes place in which the messenger is killed. One of the robbers stands watch while the other tries to open the treasure box. Finding it locked, he vainly searches the messenger for the key, and blows the safe open with dynamite. Securing the valuables and mail bags they leave the car.”\n\nEven though it’s essentially just a summary of what happens, notice how The Great Train Robbery’s script looks a lot more like what we know as screenplay format today?\n\nIn a more traditional continuity script format, there would be more camera direction dictating exactly what is shown.\n\nThat’s because the continuity script format was developed and popularized by the producer Thomas Harper Ince to streamline the production process in the early 1900’s, when producers were primarily in charge.\n\nFor more on how the term screenplay and modern screenplay format came to be, check out the wonderful masterclass of an article on Screenplayology’s blog here.\n\nThat said, if you want to compare how the script for The Great Train Robbery plays out in the actual film itself, check it below, shared here thanks to Youtuber Old FIlms and Stuff:\n\nCompare both of these scripts now to this excerpt from a modern day script that follows the modern “master scene” format that all screenplays fall into:\n\nAs you can see, in this example, the location of the scene heads the top of the description in what’s called a slugline, with accompanying action and dialogue all folded underneath. We’ll get more into the specifics of formatting later on.\n\nAnd if you’re asking yourself, “what famous film or TV show is this intriguing scene from?” It’s actually an excerpt from an unproduced pilot I’m writing called Hexagon. No spoilers!\n\nWhat are the different types of scripts, including screenplays?\n\nThe three main type scripts are screenplays, stage plays, and teleplays.\n\nA stage play is a script for the stage, while a screenplay could be for a film, video game, or television episode. And while a screenplay can be for a film or a TV episode, a teleplay is exclusively for television.\n\nWhile the difference between a screenplay and a teleplay can be kind of confusing, it’s useful to note that teleplay was a term invented in the 1950’s to help distinguish a script from a screenplay and a stage play, and is mostly used today as a technical definition by the Writers Guild of America to separate the writing credits on a TV script for payment purposes.\n\nExample: The WGA will separate the “story by” of an episode of TV alongside the “teleplay by” to account for differences in who wrote the script and who gets credit for the story of the episode, so that they both get paid and credited as necessary. Sometimes it’s the same person!\n\nWhat does a screenplay for a video game look like?\n\nWhile most video games do not have traditional scripts that look anything like a screenplay as written above, some of the more high profile, cinematically-styled games will follow a screenplay model of sorts that scripts out the main storyline, or certain cutscenes, as if it were a movie.\n\nFor an example of what one of the highest profile video game scripts looks like, check out this example from The Last of Us as shared here.\n\nFor games that don’t follow this type of screenplay format, you would be creating something more like a flowchart or spreadsheet with all your various plot narratives and dialogue trees, created in a similar format to this one shared by writer Yun Cheng Hsin.\n\nHow long should a screenplay be according to each format?\n\nFor a screenplay, the typical rule of thumb is one page equals one minute of screen time.\n\nSo if you are writing a half hour TV comedy, you would want your script to be around 30 pages.\n\nLikewise, if you are writing an hour long TV drama, you would expect the screenplay to be 60 pages, and an hour and a half long feature film would be around 90 pages.\n\nIf you’re writing a 300 page epic, you might want to write it as a book – or start cutting it down!\n\nThat said, screenplays can realistically be up to 120 pages, or two hours, without much trouble. Beyond that, you really have to be a well-known writer for anyone to take your script seriously.\n\nYou can read more on the lengths of screenplays in How Long Is A Script For A 2 Hour Movie? And How To Use The Answer In Your Screenwriting.\n\nWhat about for a stage play?\n\nThe general rule of thumb for scripts (one page = one minute) generally applies to stage plays as well.\n\nStill, scripts for the theater can include a lot of action and description per page, which can take longer than one minute’s worth of stage time depending on how they are directed.\n\nThat said, if you’re writing a full length play, you’d want to stick to around 100 pages or less to be safe under two hours. Any longer than that, and you’ll probably lose your audience.\n\nWhat are the elements of a script?\n\nEvery script, regardless of whether it’s a screenplay, teleplay, or stage play have the same basic elements. To be considered a script, the written document must include:\n\nScene setting: the location where this is all taking place.\n\nthe location where this is all taking place. Action : what’s physically happening on screen or stage.\n\n: what’s physically happening on screen or stage. Dialogue: what’s being said.\n\nwhat’s being said. Character headings: who is saying it.\n\nHow much direction do you put in the script?\n\nIn the old days of continuity and scenario scripts, all that would be described would be camera angles or action.\n\nIn the case of modern screenplay format, however, you try to avoid writing camera descriptions if at all possible.\n\nFor instance, if you want to indicate that a close-up on a specific object, like a lamp, could be useful, instead of writing “the camera pushes in on the lamp” you would write “Close on: an ornate lamp” or “He notices the lamp – a relic from another time, and out of place.”\n\nWhat does a screenplay look like?\n\nA script, whether it’s a screenplay, stage play, or teleplay, all start off looking the same. Each begins with a title page that shares the name of the story and the writer, or in the case of a television episode, the name of the episode as well.\n\nFrom there, the scripts will look different depending on their respective formatting.\n\nFor instance, certain teleplays will have Act Breaks on them, as will stage plays, but feature screenplays do not.\n\nFor more on how to write screenplay format, check out our article on the subject here.\n\nWhat if you’re writing the script for a book?\n\nIf you’re writing a novel, your written document is still technically a “script” of sorts; it’s called a manuscript, which refers to the content of a novel before it’s formatted and printed as a book.\n\nSo if you were writing a novel and wanted to submit it to publishers, you would first send them a query letter (as you should never send your written works unsolicited) and should they respond with interest, you would then send them the manuscript for the book.\n\nIf they like it and want to publish it, or if you decide to self-publish, you would then work with a copy editor and/or copy edit yourself to format the manuscript to be printed as a book.\n\nHow do I write my own screenplay / script of any kind?\n\nIf you want to write your own script, or more specifically, your own screenplay for movies or television, you will need a screenwriting program to help you format it correctly (there are free options as well). From there, it’s all about learning the craft!\n\nFor more on how to write screenplays, or more specifically, a screenplay that works, check out our article on the subject here.\n\nIf you have more questions about scripts and screenplays, reach out in the comments. Otherwise, check out our other articles on screenwriting, and good luck on your writing journey!"}]}