{"Vitaliano Brancati died in Rome in 1954.": [{"url": "https://simple.wikipedia.org/wiki/Vitaliano_Brancati", "page_content": "Vitaliano Brancati (July 24, 1907 – September 25, 1954) was an Italian writer. He was born in Pachino and died in Turin from a heart attack, aged 43. In 1950 he won the Bagutta Prize. Brancati was married to Anna Proclemer from 1946 until his death in 1954. They had one daughter.\n\nSelected bibliography [ change | change source ]\n\nOther websites [ change | change source ]"}, {"url": "https://it.wikipedia.org/wiki/Vitaliano_Brancati", "page_content": "Vitaliano Brancati\n\nVitaliano Brancati (Pachino, 24 luglio 1907 – Torino, 25 settembre 1954) è stato uno scrittore, sceneggiatore e drammaturgo italiano.\n\nNato a Pachino, in provincia di Siracusa, il 24 luglio 1907 da una famiglia non aliena da interessi letterari - sia il nonno che il padre erano stati autori di novelle e di poesie - compì gli studi inferiori a Modica dove visse dal 1910 al 1919 e quelli superiori a Catania dove si trasferì con la famiglia nel 1920. Nella città etnea frequentò la facoltà di Lettere presso la locale università, laureandosi nel 1929 con una tesi su Federico De Roberto; successivamente insegnò per diversi anni a Caltanissetta nell'Istituto Magistrale, frequentato in quegli anni da Leonardo Sciascia che però non fu suo alunno.\n\nSuccessivamente si trasferì a Roma dove, oltre a insegnare, inizia l'attività di giornalista, dapprima per il quotidiano Il Tevere e, in seguito, dal 1933 in poi, per il settimanale letterario Quadrivio. La sua formazione giovanile viene segnata da un'ideologia irrazionalista che entra in crisi quando da Catania si trasferisce a Roma dove ha modo di frequentare intellettuali crociani e democratici che gli aprono un orizzonte culturale europeo.\n\nLe opere di regime e la crisi politica [ modifica | modifica wikitesto ]\n\nLa sua attività letteraria inizia con opere \"di regime\" e pertanto animate da intenti propagandistici di stampo fascista come il dramma in versi Fedor del 1928, i drammi Everest del 1931 e Piave del 1932 e il romanzo L'amico del vincitore. Nel 1934 pubblica il romanzo Singolare avventura di viaggio dove appaiono per la prima volta i temi legati ai problemi dell'esistenza e all'erotismo.\n\nIn seguito al contatto con Alvaro, Moravia e altri scrittori di quel periodo, proprio nel 1934, Brancati, matura la sua crisi politica, si distacca dalle posizioni fasciste e disconosce i suoi scritti giovanili per lo più improntati all'ideologia dell'azione. Tornato a Catania si dedica all'insegnamento e nello stesso tempo collabora al settimanale Omnibus di Leo Longanesi fino al 1939 quando la rivista viene soppressa da parte del regime fascista. Nel 1943 le sue corrispondenze per Omnibus sono raccolte nel volume I piaceri.\n\nIl nuovo periodo letterario [ modifica | modifica wikitesto ]\n\nSi dedica all'insegnamento fino al 1941, anno in cui ritorna a Roma e pubblica Gli anni perduti, da lui stesso considerato il suo primo vero romanzo, di carattere comico-simbolico ispirato a Gogol e a Cechov nel quale si avverte chiaramente l'allontanamento dall'ideologia fascista e l'amarezza verso la realtà storico-politica del suo tempo. Seguono i romanzi di maggior successo come la farsa spregiudicata Don Giovanni in Sicilia pubblicato nel 1941 (da cui verrà tratto il film omonimo), il racconto tragicomico di un'impotenza sessuale Il bell'Antonio nel 1949 e il romanzo rimasto incompiuto e pubblicato postumo (1959), Paolo il caldo, storia di un'ossessione erotica alla quale si intreccia una lucida analisi del costume politico e culturale del dopoguerra.\n\nIl matrimonio [ modifica | modifica wikitesto ]\n\nNel 1942 conosce, al teatro dell'Università, l'attrice Anna Proclemer con la quale inizia una relazione che sfocerà nel 1947 nel matrimonio. Da lei avrà una figlia, Antonia (nata nel 1947).\n\nIl cinema, il teatro e la censura [ modifica | modifica wikitesto ]\n\n«Brancati è lo scrittore italiano che meglio ha rappresentato le due commedie italiane, del fascismo e dell'erotismo in rapporto tra loro e come a specchio di un paese in cui il rispetto della vita privata e delle idee di ciascuno e di tutti, il senso della libertà individuale, sono assolutamente ignoti. Il fascismo e l'erotismo però sono anche, nel nostro paese, tragedia: ma Brancati ne registrava le manifestazioni comiche e coinvolgeva nel comico anche le situazioni tragiche» ( Leonardo Sciascia )\n\nNotevole il suo ruolo anche in ambito teatrale e cinematografico. Per il grande schermo Brancati scrive nel 1951 la sceneggiatura di Signori, in carrozza!, de L'arte di arrangiarsi diretto da Luigi Zampa, nel 1952 Altri tempi con la regia di Alessandro Blasetti, nel 1951 Guardie e ladri di Mario Monicelli, nel 1954 Dov'è la libertà...? e Viaggio in Italia con la regia di Roberto Rossellini.\n\nMa pellicole sono tratte anche da alcune sue opere narrative. È il caso di Anni difficili (1947) di Luigi Zampa tratto dalla novella Il vecchio con gli stivali (1945) e per il quale lo stesso Brancati collaborò alla sceneggiatura. Il film diede inizio a un filone di pellicole di satira politica che furono inizialmente osteggiate dalla censura. Nel 1960 viene tratto dall'omonimo romanzo il film Il bell'Antonio del regista Mauro Bolognini con Marcello Mastroianni e Claudia Cardinale e nel 1973 Paolo il caldo diretto da Marco Vicario e interpretato da Giancarlo Giannini e Ornella Muti.\n\nNel 1952 la censura colpisce ancora più duramente il teatro di Brancati con il divieto di rappresentare uno dei suoi migliori lavori teatrali, La governante, dramma di un'omosessualità femminile. Nello stesso anno lo scrittore, prendendo spunto dal divieto di rappresentare il suo lavoro teatrale, scrive un pamphlet dal titolo Ritorno alla censura nel quale egli afferma i diritti del teatro ad esprimersi e dove ripropone la sua poetica del comico ispirata a un forte realismo classico. In questo periodo collabora all'L'Europeo di Arrigo Benedetti e al Tempo di Renato Angiolillo. Partecipa a un congresso per la libertà a Parigi e manifesta la sua avversità nei confronti di ogni dittatura, sia di destra che di sinistra.[1]\n\nLa separazione e la morte [ modifica | modifica wikitesto ]\n\nVitaliano Brancati nella primavera 1954\n\nSeparatosi dalla moglie nel 1953, Vitaliano Brancati morì il 25 settembre 1954,[2] in seguito all'operazione fatta a Torino da un chirurgo di chiara fama, il professor Achille Mario Dogliotti.[3] L'operazione aveva lo scopo di asportare una cisti dermoide a carattere benigno che Brancati portava fin dalla nascita e che si era ingrossata a dismisura, ma il cuore non resse all'anestesia.[4]\n\nBrancati si impose all'attenzione della critica e del pubblico nel 1941 con Don Giovanni in Sicilia.\n\nDon Giovanni in Sicilia [ modifica | modifica wikitesto ]\n\nDon Giovanni in Sicilia (romanzo). Lo stesso argomento in dettaglio:\n\nIn questo romanzo lo scrittore descrive un aspetto della vita in una grossa città siciliana - Catania - che fa da vivace sfondo alla vita di giovani benestanti sempre in cerca di avventure amorose e che trascorrono il tempo a immaginare avventure erotiche e viaggi in celebri luoghi che si concludono sempre in modo deludente. Vengono narrate avventure e sogni del protagonista Giovanni Percolla dall'infanzia fino all'età adulta, quasi sempre in compagnia degli amici Muscarà e Scannapieco.\n\nIl terzetto è, come in una vorticosa passione, continuamente alla ricerca di piacere che solo l'abito femmineo può dare. All'intera vicenda può essere data una lettura \"kierkegardiana\", poiché come nel pensiero del filosofo danese, nell'opera di Brancati vi è un salto dalla \"vita estetica\" a quella \"etica\", il tutto provocato dalla disperazione. Infatti Giovanni, divenuto adulto, conosce Ninetta, donna alla quale decide di consacrare la propria esistenza spinto dalla coscienziosa consapevolezza della futilità della vita condotta fino ad allora. Sarà la vita di Milano a permettere poi a Giovanni di saltare dalla dimensione estetica a quella etica.\n\nSi tratta a prima vista di un quadro ironico e divertente della provincia italiana dove vengono messe in evidenza le velleità maschiliste, i vagheggiamenti erotici e tutte quelle forme di megalomania che vanno sotto il nome di gallismo. In realtà l'opera va oltre la dimensione provinciale che viene assunta da Brancati come esempio della società italiana del tempo, piena di faciloneria, velleitarismo e sogni di grandezza. Brancati crea delle macchiette nascondendo una vocazione di saggista e di osservatore attento degli atteggiamenti degli uomini in un preciso contesto storico. Lo stile dell'opera è scanzonato e beffardo, la scrittura agilissima e pervasa di sana e vigorosa sensualità.\n\n«Don Giovanni in Sicilia fu scritto nel '40, e sta a rappresentare il momento di maggiore agevolezza e libertà d'ispirazione incontrato dal Brancati». È il libro della profonda acquisizione della coscienza antifascista. Facendo intravedere nel fascismo e nel gallismo «due manifestazioni di un medesimo costume, l'autore colpisce con la sua satira e l'uno e l'altro».[5]\n\nIl bell'Antonio (romanzo). Lo stesso argomento in dettaglio:\n\nGli anni che trascorsero tra il Don Giovanni e Il bell'Antonio non furono anni facili, ma Brancati, appena fu possibile, riprese a pubblicare bozzetti, racconti, composizioni teatrali, trovandosi trasportato dalla satira politica. Con Il bell'Antonio, pubblicato nel 1949, lo scrittore riprende i motivi del Don Giovanni producendo un romanzo corale: nel descrivere un ambiente cittadino effettivamente riconoscibile nella Catania di quegli anni[6], delinea un contesto che assomiglia a una grande commedia antica e che rappresenta, in fatto di \"orchestrazione\", un grande progresso nei confronti del Don Giovanni. Per il Bell'Antonio, Brancati riceverà, nel 1950 il Premio Bagutta.\n\nPaolo il caldo [ modifica | modifica wikitesto ]\n\nPaolo il caldo. Lo stesso argomento in dettaglio:\n\nNel 1955, un anno dopo la morte, venne pubblicato il romanzo Paolo il caldo. La sua pubblicazione era stata autorizzata dall'autore in una nota scritta due giorni prima di morire nella quale avvertiva che il libro era rimasto incompiuto degli ultimi due capitoli. Nonostante il romanzo ci sia pervenuto non concluso, si avverte subito che esso non è inferiore ai precedenti e soprattutto che l'idea della vita, in esso espressa, è profondamente cambiata da quella che animava i romanzi precedenti.\n\nSe nel Don Giovanni lo slancio sensuale era pieno di allegria e nel Bell'Antonio la vicenda aveva ancora una sostanziale intonazione burlesca, nel Paolo il Caldo le cose cambiano e la sensualità di Paolo Castorini ha qualcosa di ossessivo e tragico. Anche in questo romanzo la forma è limpidissima anche se si nota, al confronto con gli altri due libri, una maggiore propensione all'analisi e al discorso indiretto.\n\nIl mondo dei romanzi [ modifica | modifica wikitesto ]\n\nIl mondo davanti al quale ci pone Brancati è un mondo morale concreto e organico dal quale egli contempla e giudica gli uomini che lo circondano facendo così nascere la sua satira politica e quella della vita provinciale. Il mondo appare così dominato da personaggi dalla testa vuota, vanagloriosi seduttori di donne e di imperi che appartengono alla schiera dei vanitosi, prepotenti e oppressori, sia in politica che in amore.\n\nBrancati, che si è sviluppato come scrittore nel periodo che va dal 1930 al 1942, trae questa visione del mondo dalla sua esperienza di uomo, nato e vissuto nel Ventennio fascista, in un periodo decisivo della vita italiana fatto di esaltazioni e speranze deluse. Dalla Sicilia Brancati riesce a trarre non solo la forza della concretezza artistica, ma anche a rompere con gli schemi letterari e culturali di Verga e Pirandello.\n\nRaccolte di racconti [ modifica | modifica wikitesto ]\n\nSogno di un valzer , in \"Quadrivio\", 6 giugno-14 agosto 1938.\n\n, in \"Quadrivio\", 6 giugno-14 agosto 1938. In cerca di un sì , Catania, Studio Editoriale Moderno, 1939.\n\n, Catania, Studio Editoriale Moderno, 1939. Il vecchio con gli stivali , Roma, L'Acquario, 1945.\n\n, Roma, L'Acquario, 1945. I fascisti invecchiano , Roma-Milano, Longanesi, 1946.\n\n, Roma-Milano, Longanesi, 1946. Il borghese e l'immensità. Scritti 1930-1954 , Milano, Bompiani, 1973.\n\n, Milano, Bompiani, 1973. Sogno di un valzer e altri racconti, Milano, Bompiani, 1982.\n\nI piaceri. Parole all'orecchio , Milano, Bompiani, 1943.\n\n, Milano, Bompiani, 1943. Le due dittature , Roma, Associazione Italiana Per La Libertà Della Cultura, 1952.\n\n, Roma, Associazione Italiana Per La Libertà Della Cultura, 1952. Ritorno alla censura , Bari, Laterza, 1952.\n\n, Bari, Laterza, 1952. Diario romano, Milano, Bompiani, 1961.\n\nFedor. Poema drammatico , Catania, Studio Editoriale Moderno, 1928.\n\n, Catania, Studio Editoriale Moderno, 1928. Everest. Mito in un atto , Catania, Studio Editoriale Moderno, 1931.\n\n, Catania, Studio Editoriale Moderno, 1931. il viaggiatore dello sleeping n.7 era forse Dio?; nel \"Convegno\" del 1932.\n\ndel 1932. Piave. Dramma in quattro atti , Milano, A. Mondadori, 1932.\n\n, Milano, A. Mondadori, 1932. Don Giovanni involontario , commedia in tre atti (1943), \"Le Maschere\", 1945\n\n, commedia in tre atti (1943), \"Le Maschere\", 1945 La governante. Commedia in tre atti , Bari, Laterza, 1952.\n\n, Bari, Laterza, 1952. Teatro, Milano, Bompiani, 1957.\n\nFilm tratti dalle sue opere [ modifica | modifica wikitesto ]\n\nVoci correlate [ modifica | modifica wikitesto ]\n\nAltri progetti [ modifica | modifica wikitesto ]\n\nAltri progetti Wikiquote\n\n"}, {"url": "https://peoplepill.com/people/vitaliano-brancati/", "page_content": "Vitaliano Brancati ([vitaˈljaːno braŋˈkaːti]; 24 July 1907 – 25 September 1954) was an Italian novelist, dramatist, poet and screenwriter.\n\nBiography\n\nBorn in Pachino, Syracuse, Brancati studied in Catania, where he graduated in letters and where he spent the most part of his life. While he started writing at young age and at 25 years old he was already the author of six books, which were largely influenced by fascist ideals and which were later rejected by the same Brancati, critics tend to set the starting point of his career in 1935, when he released the collection of short stories In search of a cause. Brancati got his first and probably major success in 1941, with the novel Don Giovanni in Sicilia, a vibrant and humorous portrait of the Sicilian temperament.\n\nIn 1944 he wrote the novel Gli anni perduti (\"The Lost Years\"), a bold satire of Benito Mussolini's megalomania, and in 1946 Vecchio con gli stivali (\"Old Man in Boots\"), a satirical short story inspired by the vicissitudes of the Italian fascism which won the Vendemmia Award and which was adapted into a successful film, Difficult Years by Luigi Zampa. In 1950 he won the Bagutta Prize with one another well-known novel, Il bell'Antonio (\"The Handsome Antonio\").\n\nHe died in a clinic in Turin after a major surgery. He was married to actress Anna Proclemer and the couple had a daughter together.\n\nSelected works\n\nNovels and short stories\n\nDon Giovanni in Sicilia (1941), adapted into the film internationally released as Don Juan in Sicily (1967)\n\n(1941), adapted into the film internationally released as Don Juan in Sicily (1967) Il bell'Antonio (1949) ( Antonio: The Great Lover (1952), Beautiful Antonio (1993), trans. Patrick Creagh); adapted into the film Il bell'Antonio (1960)\n\n(1949) ( (1952), (1993), trans. Patrick Creagh); adapted into the film Il bell'Antonio (1960) Vecchio con gli stivali (1946), a short story, adapted into the film Anni difficili (Difficult Years) (1948)\n\nScreenplays"}, {"url": "https://prabook.com/web/vitaliano.brancati/1773168", "page_content": "Bagutta Prize Bagutta Prize\n\nThe Bagutta Prize is an Italian literary prize that is awarded annually to Italian writers.\n\nThe Bagutta Prize is an Italian literary prize that is awarded annually to Italian writers."}, {"url": "https://biografieonline.it/biografia.htm?BioID=2513&biografia=Vitaliano+Brancati", "page_content": "Biografia • Scrivendo in tutta coscienza\n\nVitaliano Brancati nasce in provincia di Siracusa, a Pachino, il 24 luglio 1907. Il padre Rosario è un avvocato consigliere di prefettura con forti interessi letterari. Il lavoro del padre impone alla famiglia un serie di trasferimenti a Ispica, a Modica, a Paternò ed infine, quando Vitaliano ha tredici anni, a Catania.\n\nIl periodo catanese è fondamentale per la sua formazione letteraria, tanto che Brancati è da molti considerato come lo scrittore catanese per eccellenza. Si iscrive alla facoltà di lettere e pubblica le sue prime poesie su \"Il giornale dell'Isola\", di cui diventa redattore. Si laurea con una tesi su Federico De Roberto nel 1929 ed aderisce ufficialmente all'ideologia fascista.\n\nDopo la laurea si trasferisce a Roma, dove comincia a scrivere come giornalista per \"Il Tevere\" e, a partire dal 1933, per il settimanale letterario \"Quadrivio\". Scrive in questo periodo una serie di drammi di ispirazione fascista che poi ripudia: \"Fedor\" (1928), \"Everest\" (1931), rappresentato al Salone Margherita con la regia di Stefano Pirandello, figlio dello scrittore Luigi Pirandello, e \"Piave\" (1932).\n\nComincia intanto ad avvicinarsi alla scrittura in prosa e pubblica nel 1934 \"Singolare avventura di viaggio\", che il regime fascista provvede a ritirare dalle librerie con l'accusa di immoralità. Questo episodio acuisce la crisi politica già in atto in Vitaliano, che si allontana sempre di più dall'ideologia fascista fino ad entrare in aperta polemica con il regime di Mussolini.\n\nTornato in Sicilia, vince il concorso per la cattedra di italiano negli istituti Magistrali e comincia la sua carriera nell'insegnamento. Alterna i periodi di permanenza in Sicilia con quelli di permanenza a Roma, dove diventa amico di Leo Longanesi e collabora alla rivista \"Omnibus\". Nel periodo della seconda guerra mondiale l'attività letteraria di Vitaliano si fa molto intensa, scrive \"Gli anni perduti\" e \"Don Giovanni in Sicilia\" (1941), e le commedie \"Le trombe di Eustachio\" (1942), e \"Le nozze difficili\".\n\nIl romanzo \"Don Giovani in Sicilia\" segna l'inizio della sua fortuna letteraria: l'ambientazione è quella siciliana e i protagonisti sono dei giovani ossessionati dall'erotismo e dalle donne, alle prese con fantastiche avventure e immaginari viaggi che non avranno mai il coraggio di intraprendere. Per descrivere questi personaggi, coniuga il termine \"gallismo\". Nel 1943 a causa delle continue minacce dei fascisti, che lo spaventano con lo spauracchio dei lavori forzati nelle miniere di Carbonia, ritorna in Sicilia. Raggiunge così la famiglia che è stata sfollata a seguito dei continui bombardamenti.\n\nDurante la rappresentazione teatrale di \"Le trombe di Eustachio\" conosce Anna Proclemer, che sposa nel 1946.\n\nNel 1948 pubblica a puntate sul quotidiano \"Il mondo\" il romanzo \"Il bell'Antonio\" che nel 1950 riceve il Premio Bagutta. Il romanzo ha un grande successo e racconta il fallimento del regime fascista attraverso lo specchio dell'impotenza del protagonista. La versione cinematografica, risalente al 1960, verrà diretta da Mauro Bolognini con protagonisti Marcello Mastroianni e Claudia Cardinale. Da un suo racconto, \"Il vecchio con gli stivali\" (1944) in cui affronta con amarezza le fasi del fascismo e dell'antifascismo, viene tratto il film \"Gli anni difficili\" (1947) diretto da Luigi Zampa.\n\nInizia in questo periodo anche una proficua attività di sceneggiatore cinematografico. Dalle sue sceneggiature vengono tratti i film: \"La bella addormentata\" (1943) di Luigi Chiarini, \"Silenzio si gira!\" (1944) di Carlo Campogalliani, \"Gli anni facili\" (1953) di Luigi Zampa, \"L'uomo la bestia e la virtù\" (1954) di Steno, \"Dov'e la libertà\" e \"Viaggio in Italia\" di Roberto Rossellini. Nonostante la fine del regime fascista, la sua opera teatrale \"La governante\", scritta per la moglie Anna Proclemer e incentrata sul tema dell'omosessualità femminile, viene bloccata dalla censura che ne impedisce la messa in scena. L'episodio lo induce a scrivere un saggio, \"Ritorno alla censura\", per rivendicare la piena libertà di espressione di uno scrittore.\n\nNel 1953 si separa dalla moglie, che è stata la destinataria di moltissime sue lettere pubblicate nel 1955 in una raccolta dal titolo \"Lettere da un matrimonio\".\n\nVitaliano Brancati muore il 25 settembre del 1954 a seguito delle complicazioni di un'operazione toracica eseguita da un famoso chirurgo, il professor Dogliotti.\n\nIl suo ultimo romanzo \"Paolo il caldo\" rimane così incompiuto, ma verrà pubblicato ugualmente nel 1955 con la prefazione di Alberto Moravia. Da quest'ultimo romanzo verrà infine tratto nel 1973 l'omonimo film per la regia di Marco Vicario e con protagonisti Giancarlo Giannini e Ornella Muti.\n\nDi Brancati e della sua opera, Leonardo Sciascia ha avuto modo di affermare: \"è lo scrittore italiano che meglio ha rappresentato le due commedie italiane, del fascismo e dell'erotismo in rapporto tra loro e come a specchio di un paese in cui il rispetto della vita privata e delle idee di ciascuno e di tutti, il senso della libertà individuale, sono assolutamente ignoti. Il fascismo e l'erotismo però sono anche, nel nostro paese, tragedia: ma Brancati ne registrava le manifestazioni comiche e coinvolgeva nel comico anche le situazioni tragiche.\""}, {"url": "https://www.celebsagewiki.com/vitaliano-brancati", "page_content": "Age, Biography and Wiki\n\nVitaliano Brancati was born on 24 July, 1907 in Pachino, Sicily, Italy, is a Writer. Discover Vitaliano Brancati's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of Vitaliano Brancati networth?\n\nPopular As N/A Occupation writer Age 47 years old Zodiac Sign Leo Born 24 July 1907 Birthday 24 July Birthplace Pachino, Sicily, Italy Date of death 25 September, 1954 Died Place Turin, Piedmont, Italy Nationality Italy\n\nWe recommend you to check the complete list of Famous People born on 24 July. He is a member of famous Writer with the age 47 years old group.\n\nVitaliano Brancati Height, Weight & Measurements\n\nAt 47 years old, Vitaliano Brancati height not available right now. We will update Vitaliano Brancati's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Vitaliano Brancati's Wife?\n\nHis wife is Anna Proclemer (22 July 1946 - 25 September 1954) ( his death) ( 1 child)\n\nFamily Parents Not Available Wife Anna Proclemer (22 July 1946 - 25 September 1954) ( his death) ( 1 child) Sibling Not Available Children Not Available\n\nVitaliano Brancati Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Vitaliano Brancati worth at the age of 47 years old? Vitaliano Brancati’s income source is mostly from being a successful Writer. He is from Italy. We have estimated Vitaliano Brancati's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Writer\n\nVitaliano Brancati Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://dictionary.sensagent.com/Vitaliano%20Brancati/en-en/", "page_content": "Webmaster Solution\n\nAlexandria\n\nA windows (pop-into) of information (full-content of Sensagent) triggered by double-clicking any word on your webpage. Give contextual explanation and translation from your sites !\n\nTry here or get the code\n\nSensagentBox\n\nWith a SensagentBox, visitors to your site can access reliable information on over 5 million pages provided by Sensagent.com. Choose the design that fits your site."}, {"url": "https://pantheon.world/profile/person/Vitaliano_Brancati/", "page_content": "Vitaliano Brancati\n\nVitaliano Brancati (Italian pronunciation: [vitaˈljaːno braŋˈkaːti]; 24 July 1907 – 25 September 1954) was an Italian novelist, dramatist, poet and screenwriter . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Vitaliano Brancati has received more than 37,779 page views. His biography is available in 19 different languages on Wikipedia . Vitaliano Brancati is the 4,639th most popular writer (down from 4,128th in 2019), the 3,351st most popular biography from Italy (down from 2,977th in 2019) and the 242nd most popular Italian Writer."}]}