{"Emperor Wenxuan was known for his campaigns against rival Northern Zhou.": [{"url": "https://ctext.org/datawiki.pl?if=en&res=707678", "page_content": "((北)齊文宣帝) (526–559), personal name(高洋, Wade–Giles:), courtesy name(子進), Xianbei name(侯尼干), was the first emperor of the Northern Qi . He was the second son of Eastern Wei 's paramount general Gao Huan . Following the death of his brother and Gao Huan's designated successor an eldest son Gao Cheng in 549, Gao Yang became the regent of Eastern Wei. In 550, he forced Emperor Xiaojing of Eastern Wei to yield the throne to him, ending Eastern Wei and starting Northern Qi.\n\nEarly in Emperor Wenxuan's reign, he was known for attentiveness to military matters, and the strength of the Northern Qi military was at its prime. He also tried to equalize the tax burden and reduce corruption by offering officials sufficient salary. He entrusted most governmental matters to the capable Yang Yin, and for a while, the government was effective, and the military was strong. In his later years, Emperor Wenxuan suffered from alcoholism and possibly insanity. Chinese historical annals recorded his bloody rages, nevertheless his reign, with assistance from his Chinese advisers, was considered well-administered and effective.\n\nRead more...: Early life As Eastern Wei regent Early reign Late reign Physical appearance Family Ancestry\n\nEarly life\n\nGao Yang was born in 526, while his father Gao Huan was a general under Northern Wei's paramount general Erzhu Rong. His mother Lou Zhaojun was Gao Huan's wife, on whose financial support Gao's early career had relied on. Lou Zhaojun was from a wealthy Xianbei family. He was their second son, after his older brother Gao Cheng. After Erzhu Rong's death in 530, Gao Huan overthrew Erzhu's family and became Northern Wei's paramount general, and after Northern Wei divided into Eastern Wei and Western Wei in 534 became the actual power controlling Eastern Wei. Gao Yang thus grew up in a household of power. In 535, he was created the Duke of Taiyuan (太原公).\n\nGao Yang was not well regarded as a child, as he was awkward in interpersonal skills and at times considered developmentally disabled, being unable to carry out many tasks common for children, though it appears that he feigned this to prevent suspicion of his elder brother. It appeared that he was actually of fairly high capability in many areas, and once, when Gao Huan tried to test his children's intelligence by giving them tangled balls of yarn to untangle, Gao Yang took out his sword and sliced the ball open, stating that that was the only solution. As Gao Huan's sons grew older, on one occasion, Gao Huan wanted to test their military abilities by having his general Peng Le (彭樂) launch a mock attack on them. All of Gao Huan's sons, including the older Gao Cheng, were fearful, but Gao Yang reacted calmly and actually captured Peng. As he grew, he continued to be awkward and appearing to be unintelligent, and Gao Cheng, in particular, often looked down on him.\n\nGao Huan died in 547, and thereafter, Gao Cheng, who had already controlled many aspects of Eastern Wei imperial government's operations, took over as regent. He moved to consolidate his power further, and when Emperor Xiaojing of Eastern Wei tried to form a plot to kill him, he discovered the plot and put Emperor Xiaojing under effective house arrest. He then planned taking the throne himself, but at a meeting in 549 at the capital Yecheng (鄴城, in modern Handan, Hebei), with his officials Chen Yuankang (陳元康), Cui Jishu (崔季舒), and Yang Yin, to discuss the procedure for doing so, he was assassinated by his servant Lan Jing (蘭京), who was angry at his wrongful treatment. At that time, Gao Yang happened to be in Yecheng, and he quickly gathered the guards and killed Lan and his co-conspirators. He chose not to announce Gao Cheng's death immediately, while moving to consolidate power.\n\nAs Eastern Wei regent\n\nInitially, Emperor Xiaojing, who had received rumors that Gao Cheng had died, thought he might have a chance to regain power. However, upon meeting Gao Yang, who made a display of force by having more than 8000 guards accompany him, Emperor Xiaojing saw that Gao Yang could not be easily dealt with. Meanwhile, Gao Yang headed for the Gaos' stronghold of Jinyang (晉陽, in modern Taiyuan, Shanxi), and consolidated his military command there, quickly impressing the generals who had previously looked down on him with quick and careful decisions.\n\nIn fall and winter 549, with rival Liang Dynasty under internal turmoil after the rebellion of Hou Jing (a former Eastern Wei general who had defected to Liang in 547), Gao Yang sent Peng Le to attack the Liang border provinces, taking over the region between the Huai River and Yangtze River with ease.\n\nIn spring 550, Gao Yang had Emperor Xiaojing convey on him the greater title of Prince of Qi Commandery. Two months later, his title was made the even greater title of Prince of Qi.\n\nIn summer 550, under advice from the officials Gao Dezheng (高德政), Xu Zhicai (徐之才), and Song Jingye (宋景業), Gao Yang decided to take the throne, despite reservations from Gao Yang's mother Princess Dowager Lou. He therefore headed from Jinyang to Yecheng, but even as he was on the way and had reached the halfway city of Pingdu (平都, in modern Jinzhong, Shanxi), the officials largely pretended to ignore his overtures at taking the throne, so he returned to Jinyang. Soon thereafter, he had Emperor Xiaojing issue an edict conferring the nine bestowments on him, further displaying his posture of taking the throne. He then proceeded to Yecheng again, and Emperor Xiaojing yielded the throne to him, ending Eastern Wei and establishing Northern Qi, with Gao Yang as its Emperor Wenxuan. He created the former Emperor Xiaojing the Prince of Zhongshan. He posthumously honored Gao Huan and Gao Cheng as emperors, while honoring his mother as empress dowager.\n\nEarly reign\n\nEarly in Emperor Wenxuan's reign, he was known for being attentive to important matters of state, particularly military matters. He revised Eastern Wei laws, and he selected elite soldiers from both Xianbei and Han ethnicities to form the border defense corps. To equalize the tax and labor burden, he divided the households under his rule into nine classes based on their wealth, requiring the wealthy to pay more taxes and the poor to contribute more labor. Continuing a trend set by both his father Gao Huan and his brother Gao Cheng, he divided his time between Yecheng and Jinyang, effectively making Jinyang a second capital.\n\nJust like his father Gao Huan, Emperor Wenxuan viewed himself as more of a Xianbei rather than Chinese. Further, more than his father did, he was not willing to follow most of the Chinese traditions. Because of this, Gao Dezheng and another official, Gao Longzhi (高隆之), who wanted to ingratiate themselves with Emperor Wenxuan's cousin and powerful general Duan Shao (段韶), suggested he make Duan Shao's sister Lady Duan, a concubine of his, empress. Emperor Wenxuan did not follow their advice and, pursuant to expected norm, created his wife Princess Li Zu'e empress and created her son Gao Yin crown prince.\n\nIn response to the establishment of Northern Qi, Yuwen Tai, the paramount general of rival Western Wei, launched a major attack on Northern Qi. Emperor Wenxuan personally led troops to defend against Yuwen's attack. When Yuwen saw that Emperor Wenxuan's troops were well-organized, he sighed and stated, \"Gao Huan is not yet dead.\" He was unable to overcome Emperor Wenxuan's defense and so was forced to withdraw, and in fact lost some border commanderies to Northern Qi in the campaign.\n\nAround the new year 552, Emperor Wenxuan wanted to put the former emperor, the Prince of Zhongshan, to death. He first invited his sister and the prince's wife, the Princess Taiyuan, to a feast. As soon as she left the prince's household, he sent assassins to force the prince to drink poison, and also killed his three sons. He buried the former emperor with imperial honors, but at a later point, for reasons unknown, he dug out the former emperor's casket and threw it into the Zhang River (漳水, flowing near Yecheng).\n\nIn spring 552, Emperor Wenxuan himself led troops against the Kumo Xi tribe (in the upper Liao River drainage area) and achieved a great victory. Around the same time, he also sent generals to seize certain border cities with Liang, as Liang troops continued to battle Hou Jing, who declared himself the Emperor of Han in 551 but was subsequently defeated by Emperor Yuan of Liang in 552. The campaigns of seizing Liang cities continued even after Hou's defeat, although he did not at this point launch a single major attack on Liang. The campaigns appeared to end in winter 552, and Emperor Wenxuan in fact promised the Liang generals Wang Sengbian and Chen Baxian, whom Emperor Yuan put in charge of the eastern half of Liang territory, to return the cities of Guangling (廣陵, in modern Yangzhou, Jiangsu) and Liyang (歷陽, in modern Chaohu, Anhui).\n\nAlso in winter 552, Emperor Wenxuan personally led troops from Jinyang to Lishi (離石, in modern Lüliang, Shanxi), and he ordered the construction of a great wall from Huanglu Mountain (黃櫨嶺, also in modern Lüliang) to Sheping Fortress (社平戍, in modern Xinzhou, Shanxi), apparently to defend against Western Wei and Tujue.\n\nIn winter 553, Khitan tribes were attacking Northern Qi's northern borders, and Emperor Wenxuan himself led troops to attack Khitan—and on this campaign, he was described as personally exposing himself to the dangers and contributing much personally to defeating the Khitan.\n\nAlso in winter 553, Emperor Wenxuan, wanting to put Northern Qi-friendly emperor on the Liang throne, commissioned an army commanded by Guo Yuanjian (郭元建) to escort Emperor Yuan's cousin Xiao Tui (蕭退), who had surrendered to Eastern Wei in 548, back to Liang territory. However, Northern Qi forces were defeated by the Liang general Hou Tian (侯瑱), and Xiao Tui returned to Yecheng.\n\nAround the new year 554, the remnants of Rouran, which by that point was near its end, surrendered to Northern Qi to seek protection from Tujue attacks. Emperor Wenxuan personally attacked the Tujue, fighting its army off, and then created Yujiulü Anluochen as the new khan of Rouran, settling the Rouran people within Northern Qi territory, at Mayi (馬邑, in modern Shuozhou, Shanxi).\n\nIn spring 554, Emperor Wenxuan, assisted by the senior general Hulü Jin (斛律金) and his brother Gao Yan the Prince of Changshan, launched a major attack on the Shanhu (山胡) tribe (in modern Lüliang). After victory, he ordered that all 11-year-old and older males of the Shanhu be slaughtered, and that the females and the young males be awarded as spoils of war to the soldiers. When one of his commanders died because that commander's lieutenant, Lu Huili (路暉禮), was unable to save him, Emperor Wenxuan ordered that Lu's internal organs be cut out of his body and that the soldiers consume them. Many traditional historians, including Li Yanshou (李延壽), the author of the History of Northern Dynasties, and Sima Guang, the author of the Zizhi Tongjian, saw this battle as the turning point of Emperor Wenxuan's rule—that thereafter, he began to act violently and capriciously. For example, in spring 554, when Rouran rebelled and he personally led troops to defeat Yujiulü Anluochen, he felt that warhorses offered by the general Heba Ren (賀拔仁) the Prince of Anding were not of sufficient quality—and he punished Heba by plucking out Heba's hair and demoting to commoner status, and further ordering Heba to serve as a worker in a coal processing facility. In another example, in fall 554, after he had put the official Yuan Xu (元旭), a former Northern Wei prince, to death, he remembered the snubs that Gao Longzhi, who was a friend of Yuan Xu's, had shown him before he became Eastern Wei's regent, and he had Gao Longzhi battered so severely that Gao Longzhi died several days later—and at a later point, still angry at Gao Longzhi, arrested Gao Longzhi's 20 sons and, with 20 executioners lined up, had the sons beheaded simultaneously, and then threw their bodies and Gao Longzhi's body into the Zhang River.\n\nStarting in 551, Emperor Wenxuan had ordered his official Wei Shou to compile a history of Northern Wei. Wei Shou completed the work in 554, but his work (Book of Wei) was criticized by many to be defamatory to ancestors of many political enemies (so much so that they referred to the work as Huishu (穢書—the Book of Filth)), and several officials filed reports condemning Wei Shou. Wei Shou submitted a petition to Emperor Wenxuan defending himself, and Emperor Wenxuan, in an act that he believed to be protecting the integrity of history, jailed the officials who condemned Wei Shou.\n\nIn late 554, Western Wei launched a major attack on Jiangling (江陵, in modern Jingzhou, Hubei), then the capital of Liang. Emperor Wenxuan commissioned an army commanded by Gao Huan's cousin Gao Yue (高岳) the Prince of Qinghe to attack Western Wei's An Province (安州, roughly modern Xiaogan, Hubei) to try to relieve pressure from Jiangling, but by the time that Gao Yue arrived, Jiangling had already fallen, and Western Wei captured and then executed Emperor Yuan.\n\nLate reign\n\nWestern Wei declared Emperor Yuan's nephew Xiao Cha the Emperor of Liang (known in history as the Western Liang), but the declaration was not recognized by most Liang generals, and the chief of those generals, Wang Sengbian, welcomed Emperor Yuan's son Xiao Fangzhi the Prince of Jin'an to the old Liang capital Jiankang, declaring him the Prince of Liang in spring 555 and preparing to make him emperor. Emperor Wenxuan had other ideas, however, and he created Emperor Yuan's cousin Xiao Yuanming the Marquess of Zhenyang, whom Eastern Wei captured in 547 during Liang's attempt to aid Hou Jing's rebellion against Eastern Wei, emperor, commissioning his brother Gao Huàn (高渙, note tone difference with his father) the Prince of Shangdang to command an army to escort Xiao Yuanming back to Liang territory. Emperor Wenxuan wrote letters to Wang recommending Xiao Yuanming as emperor, arguing that Xiao Fangzhi (who was 12 years old) was too young. Wang initially rejected Xiao Yuanming, but after Gao Huan won a few battles over Wang's generals, Wang decided to submit and, after Northern Qi escorting troops agreed to limit their presence to 1,000 men, and Xiao Yuanming agreed to make Xiao Fangzhi crown prince, accepted Xiao Yuanming as emperor. To show his good faith, Wang sent his son Wang Xian (王顯) and nephew Wang Shizhen (王世珍), as well as Wang Xian's mother Lady Liu, to Yecheng as hostages. Xiao Yuanming became Liang's emperor, and there was peace between Northern Qi and Liang, with Liang now a vassal.\n\nJust four months later, however, the situation changed. Wang Sengbian's lieutenant Chen Baxian, displeased over Xiao Yuanming's ascension (as he saw Xiao Yuanming's claim as being too attenuated), make a surprise attack on Jiankang from his headquarters of Jingkou (京口, in modern Zhenjiang, Jiangsu), killing Wang Sengbian and forcing Xiao Yuanming to yield the throne to Xiao Fangzhi (who took the throne as Emperor Jing). Initially, Chen claimed that Liang would still agree to be a vassal, and Emperor Wenxuan sent the official Sima Gong (司馬恭) to swear an oath with Liang officials. However, with several generals loyal to Wang Sengbian rising against Chen following Wang's death, Emperor Wenxuan's mind changed, particularly after two, Xu Sihui (徐嗣徽) and Ren Yue (任約) submitted to him, making a surprise attack on the near-Jiankang fortress Shitou and capturing it. Emperor Wenxuan sent the general Xiao Gui (蕭軌) to reinforce Xu and Ren. Chen defeated Northern Qi troops and Xu and Ren, however, and Xiao Gui's assistant Liu Damo (柳達摩), sieged by Chen in Shitou, sought peace. Chen agreed, and sent his nephew Chen Tanlang (陳曇朗), Emperor Jing's nephew Xiao Zhuang the Prince of Yongjia, and Wang Min (王珉), the son of the key official Wang Chong (王沖), to serve as hostages to Northern Qi, allowing Liu to withdraw. (Upon Liu's return to Northern Qi, however, Emperor Wenxuan had him executed.)\n\nDuring the campaign against Liang, Emperor Wenxuan made another display of his increasing instability, as he, jealous over the fact that his concubine Consort Xue had previously had a sexual relationship with Gao Yue, ordered Gao Yue to commit suicide. Thereafter, he beheaded Consort Xue and hid her head in his sleeves. At a banquet later that day, he tossed her head onto a platter and cut her body into pieces, beginning to play with her leg, which he converted into a fiddle, surprising all of the banquet attendants. At the end of the banquet, he packed her body parts and began crying, following the cart carrying her body on foot.\n\nIn fall 555, Emperor Wenxuan became convinced that Buddhism and Taoism should be but one religion, and that one of them should be merged into the other. He had the leading Buddhist and Taoist monks debate before him, and he declared the Buddhists the victors, ordering Taoism merged into Buddhism and Taoist monks to become Buddhist monks. Some Taoist monks initially rejected this edict, but after he executed four monks, the others submitted, and Taoism became banned within Northern Qi.\n\nIn spring 556, border battles between Northern Qi and Liang resumed, and Northern Qi prepared another campaign against Liang. In summer 556, Northern Qi forces were again south of the Yangtze, operating in Jiankang's vicinity, but they were stalemated against Liang troops, eventually defeated by Chen and his generals after they ran out of food. A number of Northern Wei generals were captured and executed by Liang, and in response, Emperor Wenxuan put Chen Tanlang to death.\n\nBy this point, Emperor Wenxuan's erratic behavior became even greater in scope, fueled by his alcoholism. As described by Sima Guang in his Zizhi Tongjian:\n\n:... Wenxuan drank heavily and lived immorality, carrying out cruel and barbarous act at his on whim. Sometimes he sang and danced day and night. Sometimes he spread his hair and wore barbarian clothing with colorful sashes. Sometimes he bared his body and put on makeup. Sometimes he rode donkeys, cows, camels, or elephants without using saddles. Sometimes he ordered Cui Jishu or Liu Taozhi (劉桃枝) to carry him and a large drum to allow him to beat the drums. He was accustomed to making surprise charges into the nobles' and imperial officials' private residences. He often crossed streets, sometimes sitting in the streets and sometimes even sleeping on them. Sometimes when it is warm, he would be naked to bask in the sun, but even in the coldest winter, he would strip naked as well and run around. His attendants could not stand his behavior, but he himself did not care. ... Once, he asked a woman on the street, \"How is the Son of Heaven like?\" The woman responded, \"He is so crazy that he really cannot be considered a Son of Heaven.\" He beheaded her.\n\nOnce, when he was drunk and acting irrationally, his mother Empress Dowager Lou rebuked him, and he threatened to marry her to an old barbarian. When she became angry, he became fearful, and he wanted to induce her to smile again, so he crawled on the ground under her seat, but in doing so, he flipped the seat over, and she was injured. After he sobered up, he realized how she had been injured, and he set a large fire, intending to jump in to die, causing her to have to grab him to save him. He thereafter pledged not to drink any more, but was only able to do so for 10 days before he began drinking again. He also once shot an arrow at Empress Li's mother Lady Cui and whipped her. Further, it was described that most women of the imperial Gao clan were forced to have sexual relations with him at one point or another. When Gao Huan's concubine Erzhu Ying'e, the Princess Dowager of Pengcheng, refused, he killed her with his own hands. Emperor Wenxuan also became homicidal when he drank, and he always wanted to kill people when he was drunk. Yang Yin, who was prime minister at this point, therefore set up a group of condemned prisoners and a saw to be available to the palace guards—if Emperor Wenxuan wanted to kill someone, a condemned prisoner would be brought out for him to kill, and if a prisoner was able to survive for three months without being killed, he would be set free.\n\nHowever, even in his erratic behavior, Emperor Wenxuan was still attentive to many important matters, and because of his harshness, his officials did not dare to be corrupt. Further, Yang was a capable prime minister, and Emperor Wenxuan gave him full authorization to carry out laws properly. Therefore, it was said at the time that while the emperor was violent and insane, the government was nevertheless efficient.\n\nIn winter 557, believing prophecies that Gao Huàn would be emperor, he ordered Gao Huàn arrested. Gao Huàn tried to resist, but was nevertheless captured and delivered to Yecheng. When another brother, Gao Jun (高浚) the prince of Yong'an, sent petitions urging him to change his behavior, he had Gao Jun arrested as well, and the two princes were imprisoned in a dungeon.\n\nAlso in winter 557, Chen Baxian had Liang's Emperor Jing yield the throne to him, establishing Chen Dynasty, and subsequently had Emperor Jing killed in 558. The general Wang Lin, then in control of modern Hunan and eastern Hubei, refused to submit to Chen and sought to continue Liang's lineage. He therefore requested Northern Qi to return Xiao Zhuang the Prince of Yongjia to be emperor. In spring 558, Northern Qi troops escorted Xiao Zhuang to Wang's territory, and Wang declared Xiao Zhuang emperor, as a Northern Qi vassal, with his capital at Jiangxia (江夏, in modern Wuhan, Hubei).\n\nBy this point, Emperor Wenxuan's military campaigns and other wasteful behavior had caused the imperial treasury to be drained. He had also become unhappy with his son Gao Yin, believing that Gao Yin was too Han-like in behavior, and he considered deposing Gao Yin. Once, he ordered Gao Yin to personally execute a prisoner, but Gao Yin could not bring himself to do so, and Emperor Wenxuan battered him with a whip handle, causing Gao Yin to thereafter have a panic disorder and at times unable to speak. When Emperor Wenxuan became drunk, he would often state that he might eventually pass the throne to his brother Gao Yan, and he stopped stating as such only after urging by Yang and Wei Shou, who believed that his words were causing an unstabling effect in causing a doubt as to who would succeed him.\n\nAround the new year 559, Emperor Wenxuan visited the imprisoned Gao Jun and Gao Huàn. He initially took pity on them and considered releasing them, but, at the urging of another brother, Gao Zhan the Prince of Changguang, did not do so, and further started to pierce them with spears. He also ordered that torches be thrown at them, burning them to death. He rewarded the princes' wives to the soldiers who delivered the death blows.\n\nIn summer 559, Emperor Wenxuan, suspecting that the members of the Northern Wei imperial Yuan clan would eventually try to return to power, ordered the Yuans to be slaughtered, regardless of age or gender, and had the bodies thrown into the Zhang River. In particular, a man named Yuan Huangtou flown off a tower strapped to a kite as part of an experiment of Emperor Wenxuan, the first known case of human flight. He survived but was starved to death in prison. Only several households who were particularly close to the Gaos were spared.\n\nIn fall 559, Emperor Wenxuan suffered a major illness that historians believed to be alcoholism-driven. He stated to Empress Li, \"A person will live and die, and there is nothing to regret, other than that our son Gao Yin is still young, and someone else will take his throne.\" He stated to Gao Yan, \"Go ahead and take the throne, but do not kill him!\" However, he did not change the succession order, and after his death, Gao Yin took the throne as Emperor Fei. The officials tried to mourn at his death, but no one was actually able to shed a tear other than Yang Yin. Not long after, Gao Yan killed Yang Yin and deposed Gao Yin, becoming emperor.\n\nPhysical appearance\n\nIn the Book of Northern Qi, author Li Baiyao notes that Gao Yang was a dark-skinned man with large and protruding jaws, and that his skin appeared to be abnormally rough.\n\nFamily\n\nConsorts and Issue:\n\n• Empress Zhaoxin, of the Li clan of Zhao (昭信皇后 趙郡李氏), personal name Zu'e (祖娥)\n\n• Gao Yin, Prince Jinan Mindao (濟南愍悼王 高殷; 545–561), first son\n\n• Gao Shaode, Prince Taiyuan (太原王 高紹德; 548–562), second son\n\n• Princess Changle (長樂公主), personal name Baode (寶德)\n\n• Married Wei Shibian (尉世辯)\n\n• Princess Yining (義寧公主)\n\n• Married Hulü Wudu (斛律武都; d. 572), the first son of Hulü Guang\n\n• Furen, of the Yan clan (弘德夫人 顏氏; 530–576), personal name Yuguang (玉光)\n\n• Gao Shaolian, Prince Longxi (隴西王 高紹廉; 553–577), fifth son\n\n• Pin, of the Pei clan (嬪 裴氏)\n\n• Gao Shaoren, Prince Xihe (西河王 高紹仁; d. 577), fourth son\n\n• Pin, of the Xue clan (嬪 薛氏; d. 555)\n\n• A daughter\n\n• Shifu, of the Feng clan (世婦 馮氏)\n\n• Gao Shaoyi, Prince Fanyang (范陽王 高紹義; d. 580), third son\n\n• Unknown\n\n• Princess Zhongshan (中山公主)\n\n• Married Duan Baoding of Wuwei (武威 段寶鼎)\n\nAncestry"}, {"url": "https://www.nouahsark.com/en/infocenter/culture/history/monarchs/emperor_wenxuan_of_northern_qi.php", "page_content": "Emperor Wenxuan of (Northern) Qi ((北)齊文宣帝) (529–559), personal name Gao Yang (高洋), courtesy name Zijin (子進), was the first emperor of the Chinese dynasty northern qi. He was the second son of eastern wei's paramount general Gao Huan, and the death of his brother and Gao Huan's designated successor Gao Cheng in 549 became the regent of eastern wei. In 550, he forced Emperor Xiaojing of eastern wei to yield the throne to him, ending eastern wei and starting northern qi.\n\nEarly in Emperor Wenxuan's reign, he was known for attentiveness to military matters, and the strength of the northern qi military was at its prime. He also tried to equalize the tax burden and reduce corruption by offering officials sufficient salary. He entrusted most governmental matters to the capable Yang Yin, and for a while, the government was effective, and the military was strong. However, Emperor Wenxuan eventually turned cruel, and his erratic behavior, fueled by alcoholism, plunged his administration into chaos.\n\n\n\nEarly life Gao Yang was born in 529, while his father Gao Huan was a Han chinese general under northern wei's paramount general Erzhu Rong. His mother Lou Zhaojun was Gao Huan's wife, on whose financial support Gao's early career had relied on. Lou Zhaojun was an ethnic Xianbei. He was their second son, after his older brother Gao Cheng. After Erzhu Rong's death in 530, Gao Huan overthrew Erzhu's family and became northern wei's paramount general, and after northern wei divided into eastern wei and western wei in 534 became the actual power controlling eastern wei. Gao Yang thus grew up in a household of power. In 535, he was created the Duke of Taiyuan.\n\nGao Yang was not well regarded as a child, as he was awkward in interpersonal skills and at times considered developmentally disabled, being unable to carry out many tasks common for children. However, it appeared that he was actually of fairly high capability in many areas, and once, when Gao Huan tried to test his children's intelligence by giving them tangled balls of yarn to untangle, Gao Yang took out his sword and sliced the ball open, stating that that was the only solution. As Gao Huan's sons grew older, on one occasion, Gao Huan wanted to test their military abilities by having his general Peng Le (彭樂) launch a mock attack on them. All of Gao Huan's sons, including the older Gao Cheng, were fearful, but Gao Yang reacted calmly and actually captured Peng. As he grew, he continued to be awkward and appearing to be unintelligent, and Gao Cheng, in particular, often looked down on him.\n\nGao Huan died in 547, and thereafter, Gao Cheng, who had already controlled many aspects of eastern wei imperial government's operations, took over as regent. He moved to consolidate his power further, and when Emperor Xiaojing of eastern wei tried to form a plot to kill him, he discovered the plot and put Emperor Xiaojing under effective house arrest. He then planned taking the throne himself, but at a meeting in 549 at the capital Yecheng (鄴城, in modern Handan, Hebei ), with his officials Chen Yuankang (陳元康), Cui Jishu (崔季舒), and Yang Yin, to discuss the procedure for doing so, he was assassinated by his servant Lan Jing (蘭京), who was angry at his wrongful treatment. At that time, Gao Yang happened to be in Yecheng, and he quickly gathered the guards and killed Lan and his co-conspirators. He chose not to announce Gao Cheng's death immediately, while moving to consolidate power.\n\n\n\nAs Eastern Wei regent Initially, Emperor Xiaojing, who had received rumors that Gao Cheng had died, thought he might have a chance to regain power. However, upon meeting Gao Yang, who made a display of force by having more than 200 guards accompany him, Emperor Xiaojing saw that Gao Yang could not be easily dealt with. Meanwhile, Gao Yang headed for the Gaos' stronghold of Jinyang (晉陽, in modern Taiyuan, Shanxi ), and consolidated his military command there, quickly impressing the generals who had previously looked down on him with quick and careful decisions.\n\nIn fall and winter 549, with rival liang dynasty under internal turmoil after the rebellion of Hou Jing (a former eastern wei general who had defected to Liang in 547), Gao Yang sent Peng Le to attack the Liang border provinces, taking over the region between the Huai River and Yangtze River with ease.\n\nIn spring 550, Gao Yang had Emperor Xiaojing convey on him the greater title of Prince of Qi Commandery. Two months later, his title was made the even greater title of Prince of Qi.\n\nIn summer 550, under advice from the officials Gao Dezheng (高德政), Xu Zhicai (徐之才), and Song Jingye (宋景業), Gao Yang decided to take the throne, despite reservations from Gao Yang's mother Princess Dowager Lou. He therefore headed from Jinyang to Yecheng, but even as he was on the way and had reached the halfway city of Pingdu (平都, in modern Jinzhong, Shanxi ), the officials largely pretended to ignore his overtures at taking the throne, so he returned to Jinyang. Soon thereafter, he had Emperor Xiaojing issue an edict conferring the nine bestowments on him, further displaying his posture of taking the throne. He then proceeded to Yecheng again, and Emperor Xiaojing yielded the throne to him, ending eastern wei and establishing northern qi, with Gao Yang as its Emperor Wenxuan. He created the former Emperor Xiaojing the Prince of Zhongshan. He posthumously honored Gao Huan and Gao Cheng as emperors, while honoring his mother as empress dowager.\n\n\n\nEarly reign Early in Emperor Wenxuan's reign, he was known for being attentive to important matters of state, particularly military matters. He revised eastern wei laws, and he selected elite soldiers from both Xianbei and Han ethnicities to form the border defense corps. To equalize the tax and labor burden, he divided the households under his rule into nine classes based on their wealth, requiring the wealthy to pay more taxes and the poor to contribute more labor. Continuing a trend set by both his father Gao Huan and his brother Gao Cheng, he divided his time between Yecheng and Jinyang, effectively making Jinyang a second capital.\n\nWhile Emperor Wenxuan was ethnically Han, like his father Gao Huan, he viewed himself as Xianbei rather than Han. Further, more than his father did, he looked down on Han traditions, not willing to follow them. Because of this, Gao Dezheng and another official, Gao Longzhi (高隆之), who wanted to ingratiate themselves with Emperor Wenxuan's cousin and powerful general Duan Shao (段韶), suggested he make Duan Shao's sister Lady Duan, a concubine of his, empress. Emperor Wenxuan did not follow their advice and, pursuant to expected norm, created his wife Princess Li Zu'e empress and created her son Gao Yin crown prince.\n\nIn response to the establishment of northern qi, Yuwen Tai, the paramount general of rival western wei, launched a major attack on northern qi. Emperor Wenxuan personally led troops to defend against Yuwen's attack. When Yuwen saw that Emperor Wenxuan's troops were well-organized, he sighed and stated, \"Gao Huan is not yet dead. \" He was unable to overcome Emperor Wenxuan's defense and so was forced to withdraw, and in fact lost some border commanderies to northern qi in the campaign.\n\nAround the new year 552, Emperor Wenxuan wanted to put the former emperor, the Prince of Zhongshan, to death. He first invited his sister and the prince's wife, the Princess Taiyuan, to a feast. As soon as she left the prince's household, he sent assassins to force the prince to drink poison, and also killed his three sons. He buried the former emperor with imperial honors, but at a later point, for reasons unknown, he dug out the former emperor's casket and threw it into the Zhang River (漳水, flowing near Yecheng).\n\nIn spring 552, Emperor Wenxuan himself led troops against the Kumo Xi tribe (in the upper Liao River drainage area) and achieved a great victory. Around the same time, he also sent generals to seize certain border cities with Liang, as Liang troops continued to battle Hou Jing, who declared himself the Emperor of Han in 551 but was subsequently defeated by Emperor Yuan of Liang in 552. The campaigns of seizing Liang cities continued even after Hou's defeat, although he did not at this point launch a single major attack on Liang. The campaigns appeared to end in winter 552, and Emperor Wenxuan in fact promised the Liang generals Wang Sengbian and Chen Baxian, whom Emperor Yuan put in charge of the eastern half of Liang territory, to return the cities of Guangling (廣陵, in modern Yangzhou, Jiangsu ) and Liyang (歷陽, in modern Chaohu, Anhui ).\n\nAlso in winter 552, Emperor Wenxuan personally led troops from Jinyang to Lishi (離石, in modern Lüliang, Shanxi ), and he ordered the construction of a Great Wall from Huanglu Mountain (黃櫨嶺, also in modern Lüliang) to Sheping Fortress (社平戍, in modern Xinzhou, Shanxi ), apparently to defend against western wei and Tujue.\n\nIn winter 553, Khitan tribes were attacking northern qi's northern borders, and Emperor Wenxuan himself led troops to attack Khitan—and on this campaign, he was described as personally exposing himself to the dangers and contributing much personally to defeating the Khitan.\n\nAlso in winter 553, Emperor Wenxuan, wanting to put northern qi-friendly emperor on the Liang throne, commissioned an army commanded by Guo yuanjian (郭元建) to escort Emperor Yuan's cousin Xiao Tui (蕭退), who had surrendered to eastern wei in 548, back to Liang territory. However, northern qi forces were defeated by the Liang general Hou Tian (侯瑱), and Xiao Tui returned to Yecheng.\n\nAround the new year 554, the remnants of Rouran, which by that point was near its end, surrendered to northern qi to seek protection from Tujue attacks. Emperor Wenxuan personally attacked the Tujue, fighting its army off, and then created Yujiulü Anluochen as the new khan of Rouran, settling the Rouran people within northern qi territory, at Mayi (馬邑, in modern Shuozhou, Shanxi ).\n\nIn spring 554, Emperor Wenxuan, assisted by the senior general Hulü Jin (斛律金) and his brother Gao Yan the Prince of Changshan, launched a major attack on the Shanhu (山胡) tribe (in modern Lüliang). After victory, he ordered that all 11-year-old and older males of the Shanhu be slaughtered, and that the females and the young males be awarded as spoils of war to the soldiers. When one of his commanders died because that commander's lieutenant, Lu Huili (路暉禮), was unable to save him, Emperor Wenxuan ordered that Lu's internal organs be cut out of his body and that the soldiers consume them. Many traditional historians, including Li Yanshou (李延壽), the author of the History of Northern Dynasties, and Sima Guang, the author of the Zizhi Tongjian, saw this battle as the turning point of Emperor Wenxuan's rule—that thereafter, he began to act violently and capriciously. For example, in spring 554, when Rouran rebelled and he personally led troops to defeat Yujiulü Anluochen, he felt that warhorses offered by the general Heba Ren (賀拔仁) the Prince of Anding were not of sufficient quality—and he punished Heba by plucking out Heba's hair and demoting to commoner status, and further ordering Heba to serve as a worker in a coal processing facility. In another example, in fall 554, after he had put the official Yuan Xu (元旭), a former northern wei prince, to death, he remembered the snubs that Gao Longzhi, who was a friend of Yuan Xu's, had shown him before he became eastern wei's regent, and he had Gao Longzhi battered so severely that Gao Longzhi died several days later—and at a later point, still angry at Gao Longzhi, arrested Gao Longzhi's 20 sons and, with 20 executioners lined up, had the sons beheaded simultaneously, and then threw their bodies and Gao Longzhi's body thrown into the Zhang River.\n\nStarting in 551, Emperor Wenxuan had ordered his official Wei Shou to compile a history of northern wei. Wei Shou completed the work in 554, but his work (Book of Wei) was criticized by many to be defamatory to ancestors of many political enemies (so much so that they referred to the work as Huishu (穢書—the Book of Filth)), and several officials filed reports condemning Wei Shou. Wei Shou submitted a petition to Emperor Wenxuan defending himself, and Emperor Wenxuan, in an act that he believed to be protecting the integrity of history, jailed the officials who condemned Wei Shou.\n\nIn late 554, western wei launched a major attack on Jiangling (江陵, in modern Jingzhou, Hubei ), then the capital of Liang. Emperor Wenxuan commissioned an army commanded by Gao Huan's cousin Gao Yue (高岳) the Prince of Qinghe to attack western wei's An Province (安州, roughly modern Xiaogan, Hubei ) to try to relieve pressure from Jiangling, but by the time that Gao Yue arrived, Jiangling had already fallen, and western wei captured and then executed Emperor Yuan.\n\n\n\nLate reign western wei declared Emperor Yuan's nephew Xiao Cha the Emperor of Liang, but the declaration was not recognized by most Liang generals, and the chief of those generals, Wang Sengbian, welcomed Emperor Yuan's son Xiao Fangzhi the Prince of Jin'an to the old Liang capital Jiankang, declaring him the Prince of Liang in spring 555 and preparing to make him emperor. Emperor Wenxuan had other ideas, however, and he created Emperor Yuan's cousin Xiao Yuanming the Marquess of Zhenyang, whom eastern wei captured in 547 during Liang's attempt to aid Hou Jing's rebellion against eastern wei, emperor, commissioning his brother Gao Huàn (高渙, note tone difference with his father) the Prince of Shangdang to command an army to escort Xiao Yuanming back to Liang territory. Emperor Wenxuan wrote letters to Wang recommending Xiao Yuanming as emperor, arguing that Xiao Fangzhi (who was 12 years old) was too young. Wang initially rejected Xiao Yuanming, but after Gao Huan won a few battles over Wang's generals, Wang decided to submit and, after northern qi escorting troops agreed to limit their presence to 1,000 men, and Xiao Yuanming agreed to make Xiao Fangzhi crown prince, accepted Xiao Yuanming as emperor. To show his good faith, Wang sent his son Wang Xian (王顯) and nephew Wang Shizhen (王世珍), as well as Wang Xian's mother Lady Liu, to Yecheng as hostages. Xiao Yuanming became Liang's emperor, and there was peace between northern qi and Liang, with Liang now a vassal.\n\nJust four months later, however, the situation changed. Wang Sengbian's lieutenant Chen Baxian, displeased over Xiao Yuanming's ascension (as he saw Xiao Yuanming's claim as being too attenuated), make a surprise attack on Jiankang from his headquarters of Jingkou (京口, in modern Zhenjiang, Jiangsu ), killing Wang Sengbian and forcing Xiao Yuanming to yield the throne to Xiao Fangzhi (who took the throne as Emperor Jing). Initially, Chen claimed that Liang would still agree to be a vassal, and Emperor Wenxuan sent the official Sima Gong (司馬恭) to swear an oath with Liang officials. However, with several generals loyal to Wang Sengbian rising against Chen following Wang's death, Emperor Wenxuan's mind changed, particularly after two, Xu Sihui (徐嗣徽) and Ren Yue (任約) submitted to him, making a surprise attack on the near-Jiankang fortress Shitou and capturing it. Emperor Wenxuan sent the general Xiao Gui (蕭軌) to reinforce Xu and Ren. Chen defeated northern qi troops and Xu and Ren, however, and Xiao Gui's assistant Liu Damo (柳達摩), sieged by Chen in Shitou, sought peace. Chen agreed, and sent his nephew Chen Tanlang (陳曇朗), Emperor Jing's nephew Xiao Zhuang the Prince of Yongjia, and Wang Min (王珉), the son of the key official Wang Chong (王沖), to serve as hostages to northern qi, allowing Liu to withdraw. (Upon Liu's return to northern qi, however, Emperor Wenxuan had him executed. )\n\nDuring the campaign against Liang, Emperor Wenxuan made another display of his increasing instability, as he, jealous over the fact that his concubine Consort Xue had previously had a sexual relationship with Gao Yue, ordered Gao Yue to commit suicide. Thereafter, he beheaded Consort Xue and hid her head in his sleeves. At a banquet later that day, he tossed her head onto a platter and cut her body into pieces, beginning to play with her leg, surprising all of the banquet attendants. At the end of the banquet, he packed her body parts and began crying, following the cart carrying her body on foot.\n\nIn fall 555, Emperor Wenxuan became convinced that Buddhism and Taoism should be but one religion, and that one of them should be merged into the other. He had the leading Buddhist and Taoist monks debate before him, and he declared the Buddhists the victors, ordering Taoism merged into Buddhism and Taoist monks to become Buddhist monks. Some Taoist monks initially rejected this edict, but after he executed four monks, the others submitted, and Taoism became banned within northern qi.\n\nIn spring 556, border battles between northern qi and Liang resumed, and northern qi prepared another campaign against Liang. In summer 556, northern qi forces were again south of the Yangtze, operating in Jiankang's vicinity, but they were stalemated against Liang troops, eventually defeated by Chen and his generals after they ran out of food. A number of northern wei generals were captured and executed by Liang, and in response, Emperor Wenxuan put Chen Tanlang to death.\n\nBy this point, Emperor Wenxuan's erratic behavior became even greater in scope, fueled by his alcoholism. As described by Sima Guang in his Zizhi Tongjian: . . . [Emperor Wenxuan] drank heavily and lived immorality, carrying out cruel and barbarous act at his on whim. Sometimes he sang and danced day and night. Sometimes he spread his hair and wore barbarian clothing with colorful sashes. Sometimes he bared his body and put on makeup. Sometimes he rode donkeys, cows, camels, or elephants without using saddles. Sometimes he ordered Cui Jishu or Liu Taozhi (劉桃枝) to carry him and a large drum to allow him to beat the drums. He was accustomed to making surprise charges into the nobles' and imperial officials' private residences. He often crossed streets, sometimes sitting in the streets and sometimes even sleeping on them. Sometimes when it is warm, he would be naked to bask in the sun, but even in the coldest winter, he would strip naked as well and run around. His attendants could not stand his behavior, but he himself did not care. . . . Once, he asked a woman on the street, \"How is the Son of Heaven like?\" The woman responded, \"He is so crazy that he really cannot be considered a Son of Heaven. \" He beheaded her.\n\nOnce, when he was drunk and acting irrationally, Empress Dowager Lou rebuked him, and he threatened to marry her to an old barbarian. When she became angry, he became fearful, and he wanted to induce her to smile again, so he crawled on the ground under her seat, but in doing so, he flipped the seat over, and she was injured. After he sobered up, he realized how he had been injured, and he set a large fire, intending to jump in to die, causing her to have to grab him to save him. He thereafter pledged not to drink any more, but was only able to do so for 10 days before he began drinking again. He also once shot an arrow at Empress Li's mother Lady Cui and whipped her. Further, it was described that most women of the imperial Gao clan were forced to have sexual relations with him at one point or another. When Gao Huan's concubine Erzhu Ying'e, the Princess Dowager of Pengcheng, refused, he killed her with his own hands. Emperor Wenxuan also became homicidal when he drank, and he always wanted to kill people when he was drunk. Yang Yin, who was prime minister at this point, therefore set up a group of condemned prisoners to be available to the palace guards—if Emperor Wenxuan wanted to kill someone, a condemned prisoner would be brought out for him to kill, and if a prisoner was able to survive for three months without being killed, he would be set free.\n\nHowever, even in his erratic behavior, Emperor Wenxuan was still attentive to many important matters, and because of his harshness, his officials did not dare to be corrupt. Further, Yang was a capable prime minister, and Emperor Wenxuan gave him full authorization to carry out laws properly. Therefore, it was said at the time that while the emperor was violent and insane, the government was nevertheless efficient.\n\nIn winter 557, believing prophecies that Gao Huàn would be emperor, he ordered Gao Huàn arrested. Gao Huàn tried to resist, but was nevertheless captured and delivered to Yecheng. When another brother, Gao Jun (高浚) the prince of Yong'an, sent petitions urging him to change his behavior, he had Gao Jun arrested as well, and the two princes were imprisoned in a dungeon.\n\nAlso in winter 557, Chen Baxian had Liang's Emperor Jing yield the throne to him, establishing chen dynasty, and subsequently had Emperor Jing killed in 558. The general Wang Lin, then in control of modern Hunan and eastern Hubei , refused to submit to Chen and sought to continue Liang's lineage. He therefore requested northern qi to return Xiao Zhuang the Prince of Yongjia to be emperor. In spring 558, northern qi troops escorted Xiao Zhuang to Wang's territory, and Wang declared Xiao Zhuang emperor, as a northern qi vassal, with his capital at Jiangxia (江夏, in modern Wuhan, Hubei ).\n\nBy this point, Emperor Wenxuan's military campaigns and other wasteful behavior had caused the imperial treasury to be drained. He had also become unhappy with his son Gao Yin, believing that Gao Yin was too Han-like in behavior, and he considered deposing Gao Yin. Once, he ordered Gao Yin to personally execute a prisoner, but Gao Yin could not bring himself to do so, and Emperor Wenxuan battered him with a whip handle, causing Gao Yin to thereafter have a panic disorder and at times unable to speak. When Emperor Wenxuan became drunk, he would often state that he might eventually pass the throne to his brother Gao Yan, and he stopped stating as such only after urging by Yang and Wei Shou, who believed that his words were causing an unstabling effect in causing a doubt as to who would succeed him.\n\nAround the new year 559, Emperor Wenxuan visited the imprisoned Gao Jun and Gao Huàn. He initially took pity on them and considered releasing them, but, at the urging of another brother, Gao Dan the Prince of Changguang, did not do so, and further started to pierce them with spears. He also ordered that torches be thrown at them, burning them to death. He rewarded the princes' wives to the soldiers who delivered the death blows.\n\nIn summer 559, Emperor Wenxuan, suspecting that the members of the northern wei imperial Yuan clan would eventually try to return to power, ordered the Yuans to be slaughtered, regardless of age or gender, and had the bodies thrown into the Zhang River. Only several households who were particularly close to the Gaos were spared.\n\nIn fall 559, Emperor Wenxuan suffered a major illness that historians believed to be alcoholism-driven. He stated to Empress Li, \"A person will live and die, and there is nothing to regret, other than that our son Gao Yin is still young, and someone else will take his throne. \" He stated to Gao Yan, \"Go ahead and take the throne, but do not kill him!\" However, he did not change the succession order, and after his death, Gao Yin took the throne as Emperor Fei. The officials tried to mourn at his death, but no one was actually able to shed a tear other than Yang Yin.\n\n"}, {"url": "https://www.liquisearch.com/emperor_wenxuan_of_northern_qi/late_reign", "page_content": "Late Reign\n\nWestern Wei declared Emperor Yuan's nephew Xiao Cha the Emperor of Liang, but the declaration was not recognized by most Liang generals, and the chief of those generals, Wang Sengbian, welcomed Emperor Yuan's son Xiao Fangzhi the Prince of Jin'an to the old Liang capital Jiankang, declaring him the Prince of Liang in spring 555 and preparing to make him emperor. Emperor Wenxuan had other ideas, however, and he created Emperor Yuan's cousin Xiao Yuanming the Marquess of Zhenyang, whom Eastern Wei captured in 547 during Liang's attempt to aid Hou Jing's rebellion against Eastern Wei, emperor, commissioning his brother Gao Huàn (高渙, note tone difference with his father) the Prince of Shangdang to command an army to escort Xiao Yuanming back to Liang territory. Emperor Wenxuan wrote letters to Wang recommending Xiao Yuanming as emperor, arguing that Xiao Fangzhi (who was 12 years old) was too young. Wang initially rejected Xiao Yuanming, but after Gao Huan won a few battles over Wang's generals, Wang decided to submit and, after Northern Qi escorting troops agreed to limit their presence to 1,000 men, and Xiao Yuanming agreed to make Xiao Fangzhi crown prince, accepted Xiao Yuanming as emperor. To show his good faith, Wang sent his son Wang Xian (王顯) and nephew Wang Shizhen (王世珍), as well as Wang Xian's mother Lady Liu, to Yecheng as hostages. Xiao Yuanming became Liang's emperor, and there was peace between Northern Qi and Liang, with Liang now a vassal.\n\nJust four months later, however, the situation changed. Wang Sengbian's lieutenant Chen Baxian, displeased over Xiao Yuanming's ascension (as he saw Xiao Yuanming's claim as being too attenuated), make a surprise attack on Jiankang from his headquarters of Jingkou (京口, in modern Zhenjiang, Jiangsu), killing Wang Sengbian and forcing Xiao Yuanming to yield the throne to Xiao Fangzhi (who took the throne as Emperor Jing). Initially, Chen claimed that Liang would still agree to be a vassal, and Emperor Wenxuan sent the official Sima Gong (司馬恭) to swear an oath with Liang officials. However, with several generals loyal to Wang Sengbian rising against Chen following Wang's death, Emperor Wenxuan's mind changed, particularly after two, Xu Sihui (徐嗣徽) and Ren Yue (任約) submitted to him, making a surprise attack on the near-Jiankang fortress Shitou and capturing it. Emperor Wenxuan sent the general Xiao Gui (蕭軌) to reinforce Xu and Ren. Chen defeated Northern Qi troops and Xu and Ren, however, and Xiao Gui's assistant Liu Damo (柳達摩), sieged by Chen in Shitou, sought peace. Chen agreed, and sent his nephew Chen Tanlang (陳曇朗), Emperor Jing's nephew Xiao Zhuang the Prince of Yongjia, and Wang Min (王珉), the son of the key official Wang Chong (王沖), to serve as hostages to Northern Qi, allowing Liu to withdraw. (Upon Liu's return to Northern Qi, however, Emperor Wenxuan had him executed.)\n\nDuring the campaign against Liang, Emperor Wenxuan made another display of his increasing instability, as he, jealous over the fact that his concubine Consort Xue had previously had a sexual relationship with Gao Yue, ordered Gao Yue to commit suicide. Thereafter, he beheaded Consort Xue and hid her head in his sleeves. At a banquet later that day, he tossed her head onto a platter and cut her body into pieces, beginning to play with her leg, surprising all of the banquet attendants. At the end of the banquet, he packed her body parts and began crying, following the cart carrying her body on foot.\n\nIn fall 555, Emperor Wenxuan became convinced that Buddhism and Taoism should be but one religion, and that one of them should be merged into the other. He had the leading Buddhist and Taoist monks debate before him, and he declared the Buddhists the victors, ordering Taoism merged into Buddhism and Taoist monks to become Buddhist monks. Some Taoist monks initially rejected this edict, but after he executed four monks, the others submitted, and Taoism became banned within Northern Qi.\n\nIn spring 556, border battles between Northern Qi and Liang resumed, and Northern Qi prepared another campaign against Liang. In summer 556, Northern Qi forces were again south of the Yangtze, operating in Jiankang's vicinity, but they were stalemated against Liang troops, eventually defeated by Chen and his generals after they ran out of food. A number of Northern Wei generals were captured and executed by Liang, and in response, Emperor Wenxuan put Chen Tanlang to death.\n\nBy this point, Emperor Wenxuan's erratic behavior became even greater in scope, fueled by his alcoholism. As described by Sima Guang in his Zizhi Tongjian:\n\n... drank heavily and lived immorality, carrying out cruel and barbarous act at his on whim. Sometimes he sang and danced day and night. Sometimes he spread his hair and wore barbarian clothing with colorful sashes. Sometimes he bared his body and put on makeup. Sometimes he rode donkeys, cows, camels, or elephants without using saddles. Sometimes he ordered Cui Jishu or Liu Taozhi (劉桃枝) to carry him and a large drum to allow him to beat the drums. He was accustomed to making surprise charges into the nobles' and imperial officials' private residences. He often crossed streets, sometimes sitting in the streets and sometimes even sleeping on them. Sometimes when it is warm, he would be naked to bask in the sun, but even in the coldest winter, he would strip naked as well and run around. His attendants could not stand his behavior, but he himself did not care. ... Once, he asked a woman on the street, \"How is the Son of Heaven like?\" The woman responded, \"He is so crazy that he really cannot be considered a Son of Heaven.\" He beheaded her.\n\nOnce, when he was drunk and acting irrationally, Empress Dowager Lou rebuked him, and he threatened to marry her to an old barbarian. When she became angry, he became fearful, and he wanted to induce her to smile again, so he crawled on the ground under her seat, but in doing so, he flipped the seat over, and she was injured. After he sobered up, he realized how he had been injured, and he set a large fire, intending to jump in to die, causing her to have to grab him to save him. He thereafter pledged not to drink any more, but was only able to do so for 10 days before he began drinking again. He also once shot an arrow at Empress Li's mother Lady Cui and whipped her. Further, it was described that most women of the imperial Gao clan were forced to have sexual relations with him at one point or another. When Gao Huan's concubine Erzhu Ying'e, the Princess Dowager of Pengcheng, refused, he killed her with his own hands. Emperor Wenxuan also became homicidal when he drank, and he always wanted to kill people when he was drunk. Yang Yin, who was prime minister at this point, therefore set up a group of condemned prisoners to be available to the palace guards—if Emperor Wenxuan wanted to kill someone, a condemned prisoner would be brought out for him to kill, and if a prisoner was able to survive for three months without being killed, he would be set free.\n\nHowever, even in his erratic behavior, Emperor Wenxuan was still attentive to many important matters, and because of his harshness, his officials did not dare to be corrupt. Further, Yang was a capable prime minister, and Emperor Wenxuan gave him full authorization to carry out laws properly. Therefore, it was said at the time that while the emperor was violent and insane, the government was nevertheless efficient.\n\nIn winter 557, believing prophecies that Gao Huàn would be emperor, he ordered Gao Huàn arrested. Gao Huàn tried to resist, but was nevertheless captured and delivered to Yecheng. When another brother, Gao Jun (高浚) the prince of Yong'an, sent petitions urging him to change his behavior, he had Gao Jun arrested as well, and the two princes were imprisoned in a dungeon.\n\nAlso in winter 557, Chen Baxian had Liang's Emperor Jing yield the throne to him, establishing Chen Dynasty, and subsequently had Emperor Jing killed in 558. The general Wang Lin, then in control of modern Hunan and eastern Hubei, refused to submit to Chen and sought to continue Liang's lineage. He therefore requested Northern Qi to return Xiao Zhuang the Prince of Yongjia to be emperor. In spring 558, Northern Qi troops escorted Xiao Zhuang to Wang's territory, and Wang declared Xiao Zhuang emperor, as a Northern Qi vassal, with his capital at Jiangxia (江夏, in modern Wuhan, Hubei).\n\nBy this point, Emperor Wenxuan's military campaigns and other wasteful behavior had caused the imperial treasury to be drained. He had also become unhappy with his son Gao Yin, believing that Gao Yin was too Han-like in behavior, and he considered deposing Gao Yin. Once, he ordered Gao Yin to personally execute a prisoner, but Gao Yin could not bring himself to do so, and Emperor Wenxuan battered him with a whip handle, causing Gao Yin to thereafter have a panic disorder and at times unable to speak. When Emperor Wenxuan became drunk, he would often state that he might eventually pass the throne to his brother Gao Yan, and he stopped stating as such only after urging by Yang and Wei Shou, who believed that his words were causing an unstabling effect in causing a doubt as to who would succeed him.\n\nAround the new year 559, Emperor Wenxuan visited the imprisoned Gao Jun and Gao Huàn. He initially took pity on them and considered releasing them, but, at the urging of another brother, Gao Dan the Prince of Changguang, did not do so, and further started to pierce them with spears. He also ordered that torches be thrown at them, burning them to death. He rewarded the princes' wives to the soldiers who delivered the death blows.\n\nIn summer 559, Emperor Wenxuan, suspecting that the members of the Northern Wei imperial Yuan clan would eventually try to return to power, ordered the Yuans to be slaughtered, regardless of age or gender, and had the bodies thrown into the Zhang River. Only several households who were particularly close to the Gaos were spared.\n\nIn fall 559, Emperor Wenxuan suffered a major illness that historians believed to be alcoholism-driven. He stated to Empress Li, \"A person will live and die, and there is nothing to regret, other than that our son Gao Yin is still young, and someone else will take his throne.\" He stated to Gao Yan, \"Go ahead and take the throne, but do not kill him!\" However, he did not change the succession order, and after his death, Gao Yin took the throne as Emperor Fei. The officials tried to mourn at his death, but no one was actually able to shed a tear other than Yang Yin."}, {"url": "https://www.primidi.com/emperor_wenxuan_of_northern_qi/early_reign", "page_content": "Early Reign\n\nEarly in Emperor Wenxuan's reign, he was known for being attentive to important matters of state, particularly military matters. He revised Eastern Wei laws, and he selected elite soldiers from both Xianbei and Han ethnicities to form the border defense corps. To equalize the tax and labor burden, he divided the households under his rule into nine classes based on their wealth, requiring the wealthy to pay more taxes and the poor to contribute more labor. Continuing a trend set by both his father Gao Huan and his brother Gao Cheng, he divided his time between Yecheng and Jinyang, effectively making Jinyang a second capital.\n\nWhile Emperor Wenxuan was ethnically Han, like his father Gao Huan, he viewed himself as Xianbei rather than Han. Further, more than his father did, he looked down on Han traditions, not willing to follow them. Because of this, Gao Dezheng and another official, Gao Longzhi (高隆之), who wanted to ingratiate themselves with Emperor Wenxuan's cousin and powerful general Duan Shao (段韶), suggested he make Duan Shao's sister Lady Duan, a concubine of his, empress. Emperor Wenxuan did not follow their advice and, pursuant to expected norm, created his wife Princess Li Zu'e empress and created her son Gao Yin crown prince.\n\nIn response to the establishment of Northern Qi, Yuwen Tai, the paramount general of rival Western Wei, launched a major attack on Northern Qi. Emperor Wenxuan personally led troops to defend against Yuwen's attack. When Yuwen saw that Emperor Wenxuan's troops were well-organized, he sighed and stated, \"Gao Huan is not yet dead.\" He was unable to overcome Emperor Wenxuan's defense and so was forced to withdraw, and in fact lost some border commanderies to Northern Qi in the campaign.\n\nAround the new year 552, Emperor Wenxuan wanted to put the former emperor, the Prince of Zhongshan, to death. He first invited his sister and the prince's wife, the Princess Taiyuan, to a feast. As soon as she left the prince's household, he sent assassins to force the prince to drink poison, and also killed his three sons. He buried the former emperor with imperial honors, but at a later point, for reasons unknown, he dug out the former emperor's casket and threw it into the Zhang River (漳水, flowing near Yecheng).\n\nIn spring 552, Emperor Wenxuan himself led troops against the Kumo Xi tribe (in the upper Liao River drainage area) and achieved a great victory. Around the same time, he also sent generals to seize certain border cities with Liang, as Liang troops continued to battle Hou Jing, who declared himself the Emperor of Han in 551 but was subsequently defeated by Emperor Yuan of Liang in 552. The campaigns of seizing Liang cities continued even after Hou's defeat, although he did not at this point launch a single major attack on Liang. The campaigns appeared to end in winter 552, and Emperor Wenxuan in fact promised the Liang generals Wang Sengbian and Chen Baxian, whom Emperor Yuan put in charge of the eastern half of Liang territory, to return the cities of Guangling (廣陵, in modern Yangzhou, Jiangsu) and Liyang (歷陽, in modern Chaohu, Anhui).\n\nAlso in winter 552, Emperor Wenxuan personally led troops from Jinyang to Lishi (離石, in modern Lüliang, Shanxi), and he ordered the construction of a great wall from Huanglu Mountain (黃櫨嶺, also in modern Lüliang) to Sheping Fortress (社平戍, in modern Xinzhou, Shanxi), apparently to defend against Western Wei and Tujue.\n\nIn winter 553, Khitan tribes were attacking Northern Qi's northern borders, and Emperor Wenxuan himself led troops to attack Khitan—and on this campaign, he was described as personally exposing himself to the dangers and contributing much personally to defeating the Khitan.\n\nAlso in winter 553, Emperor Wenxuan, wanting to put Northern Qi-friendly emperor on the Liang throne, commissioned an army commanded by Guo yuanjian (郭元建) to escort Emperor Yuan's cousin Xiao Tui (蕭退), who had surrendered to Eastern Wei in 548, back to Liang territory. However, Northern Qi forces were defeated by the Liang general Hou Tian (侯瑱), and Xiao Tui returned to Yecheng.\n\nAround the new year 554, the remnants of Rouran, which by that point was near its end, surrendered to Northern Qi to seek protection from Tujue attacks. Emperor Wenxuan personally attacked the Tujue, fighting its army off, and then created Yujiulü Anluochen as the new khan of Rouran, settling the Rouran people within Northern Qi territory, at Mayi (馬邑, in modern Shuozhou, Shanxi).\n\nIn spring 554, Emperor Wenxuan, assisted by the senior general Hulü Jin (斛律金) and his brother Gao Yan the Prince of Changshan, launched a major attack on the Shanhu (山胡) tribe (in modern Lüliang). After victory, he ordered that all 11-year-old and older males of the Shanhu be slaughtered, and that the females and the young males be awarded as spoils of war to the soldiers. When one of his commanders died because that commander's lieutenant, Lu Huili (路暉禮), was unable to save him, Emperor Wenxuan ordered that Lu's internal organs be cut out of his body and that the soldiers consume them. Many traditional historians, including Li Yanshou (李延壽), the author of the History of Northern Dynasties, and Sima Guang, the author of the Zizhi Tongjian, saw this battle as the turning point of Emperor Wenxuan's rule—that thereafter, he began to act violently and capriciously. For example, in spring 554, when Rouran rebelled and he personally led troops to defeat Yujiulü Anluochen, he felt that warhorses offered by the general Heba Ren (賀拔仁) the Prince of Anding were not of sufficient quality—and he punished Heba by plucking out Heba's hair and demoting to commoner status, and further ordering Heba to serve as a worker in a coal processing facility. In another example, in fall 554, after he had put the official Yuan Xu (元旭), a former Northern Wei prince, to death, he remembered the snubs that Gao Longzhi, who was a friend of Yuan Xu's, had shown him before he became Eastern Wei's regent, and he had Gao Longzhi battered so severely that Gao Longzhi died several days later—and at a later point, still angry at Gao Longzhi, arrested Gao Longzhi's 20 sons and, with 20 executioners lined up, had the sons beheaded simultaneously, and then threw their bodies and Gao Longzhi's body thrown into the Zhang River.\n\nStarting in 551, Emperor Wenxuan had ordered his official Wei Shou to compile a history of Northern Wei. Wei Shou completed the work in 554, but his work (Book of Wei) was criticized by many to be defamatory to ancestors of many political enemies (so much so that they referred to the work as Huishu (穢書—the Book of Filth)), and several officials filed reports condemning Wei Shou. Wei Shou submitted a petition to Emperor Wenxuan defending himself, and Emperor Wenxuan, in an act that he believed to be protecting the integrity of history, jailed the officials who condemned Wei Shou.\n\nIn late 554, Western Wei launched a major attack on Jiangling (江陵, in modern Jingzhou, Hubei), then the capital of Liang. Emperor Wenxuan commissioned an army commanded by Gao Huan's cousin Gao Yue (高岳) the Prince of Qinghe to attack Western Wei's An Province (安州, roughly modern Xiaogan, Hubei) to try to relieve pressure from Jiangling, but by the time that Gao Yue arrived, Jiangling had already fallen, and Western Wei captured and then executed Emperor Yuan."}, {"url": "https://www.nouahsark.com/en/infocenter/culture/history/monarchs/emperor_xuan_of_northern_zhou.php", "page_content": "Emperor Xuan of northern zhou ((北)周宣帝) (559–580), personal name Yuwen Yun (宇文贇), courtesy name Qianbo (乾伯), was an emperor of the Chinese/Xianbei dynasty northern zhou. He was known in history as an erratic and wasteful ruler, whose actions greatly weakened the northern zhou regime. As part of that erratic behavior, he passed the throne to his son Emperor Jing in 579, less than a year after taking the throne, and subsequently entitled not only his wife Empress Yang Lihua empress, but four additional concubines as empresses. After his death in 580, the government was taken over by his father-in-law Yang Jian, who soon deposed his son Emperor Jing, ending northern zhou and establishing sui dynasty.\n\n\n\nBackground Yuwen Yun was born in 559, as the oldest son of Yuwen Yong, then the Duke of Lu and younger brother of Emperor Ming. He was born at Tong Province (同州, roughly modern Weinan, Shaanxi ), as Yuwen Yong was at that time the governor of Tong Province. His mother Li Ezi was Yuwen Yong's concubine. (Yuwen Yong had not yet officially married a wife by that point. )\n\nIn 560, Emperor Ming was poisoned to death by his cousin, the regent Yuwen Hu. Before he died, he willed that Yuwen Yong succeed him, and Yuwen Yong took the throne (as Emperor Wu). In 561, he created Yuwen Yun the Duke of Lu but did not create him crown prince. Only after Emperor Wu ambushed Yuwen Hu and killed him in 572 did he create Yuwen Yun crown prince. (Yuwen Yun's mother Consort Li was not created empress, as Emperor Wu married Empress Ashina, the daughter of Tujue's Mugan Khan Ashina Qijin in 568. )\n\n\n\nAs crown prince Emperor Wu often sent Yuwen Yun on tours of the provinces—and when he himself would go on tours of the provinces or go on military campaigns, he would have Yuwen Yun guard the capital Chang'an.\n\nIn 573, Yuwen Yun married Yang Lihua, the daughter of the general Yang Jian the Duke of Sui, as his wife and crown princess.\n\nIt was around this time that it came to Emperor Wu's attention that most of Yuwen Yong's associates were men of low character. At the suggestion of the superintendent of the crown prince's palace, Yuwen Xiaobo (宇文孝伯), Emperor Wu made Yuchi Yun (尉遲運), the well-regarded nephew of the general Yuchi Jiong (a cousin of Emperor Wu's), Yuwen Xiaobo's deputy. He also chose a number of men whose characters he had high regard for to serve in other posts as the crown prince's assistance—but Yuwen Yun resented these personnel changes.\n\nIn 574, when Emperor Wu's mother Empress Dowager Chinu died, Emperor Wu observed a mourning period for her, and during that period, Yuwen Yun served as regent.\n\nIn spring 576, Emperor Wu sent Yuwen Yun on a campaign against Tuyuhun as its nominal commander, but put Yuwen Xiaobo and Wang Gui (王軌) in actual command of the army. In fall 576, the army completed its campaign against Tuyuhun after reaching Tuyuhun's capital Fuqi (伏俟, in modern Haixi Mongol and Tibetan Autonomous Prefecture, Qinghai ). Upon return to Chang'an, Wang Gui reported to Emperor Wu that Yuwen Yun and his trusted associates Zheng Yi (鄭譯) and Wang Duan (王端) had committed many immoral activities together. In anger, Emperor Wu battered Yuwen Yun and Zheng with a baton and removed Zheng from his post. Soon, however, Yuwen Yun reinstated Zheng to his post.\n\nHistorians also noted that Emperor Wu was very strict with the crown prince, treating him no easier than he did the officials. When he heard that Yuwen Yun liked drinking, he issued an edict forbidding any alcohol from entering the crown prince's palace, and whenever the crown prince had faults, he would whip or batter the crown prince, warning him, \"Do you not know how many crown princes had been deposed in history? Is it that my other sons are unworthy of being crown prince?\" He also ordered the officials at the crown prince's palace to watch the crown prince closely and submit reports on his actions. In reaction, Yuwen Yun suppressed his own behavior and pretended to have learned his lesson. Nevertheless, Wang Gui repeatedly suggested that Emperor Wu find a better heir, but Emperor Wu declined, because he believed his second son, Yuwen Zan (宇文贊) the Prince of Han to be even less competent than Yuwen Yun, and the other sons to be too young to be considered.\n\nIn 577, Emperor Wu destroyed rival northern qi, seizing its territory. In summer 578, however, he grew ill suddenly while preparing a campaign against Tujue, and he, after entrusting the important matters to Yuwen Xiaobo, died. Yuwen Yun took the throne as Emperor Xuan.\n\n\n\nReign Emperor Xuan honored his father Emperor Wu's wife Empress Ashina as empress dowager and created his wife Crown Princess Yang empress. Other than those proper acts, however, he began to carry out a number of inappropriate ones—including immediately promoting of Zheng Yi and having sexual relations with the ladies in waiting in his father's palace. It was also said that not only did he not mourn his father's death, but as he approached his father's casket, he touched the scars from the wounds his father had previously inflicted, and cursed, \"Old man, you died too late!\" He soon also honored his mother Consort Li as empress dowager (with the secondary title of Di Taihou (帝太后) to distinguish Empress Dowager Ashina's title Huang Taihou (皇太后)).\n\nUpon hearing Emperor Wu's death, Gao Shaoyi, a northern qi prince who had claimed northern qi's imperial title in exile in Tujue, tried to launch an attack to reestablish northern qi, but was quickly repelled and forced to retreat to Tujue territory.\n\nEmperor Xuan then turned to killing people that he feared or had grudges against. The first target was his uncle Yuwen Xian the Prince of Qi, due to the respect that Yuwen Xian commanded on account of his military abilities, along with Yuwen Xian's friends, the generals Wang Xing (王興), Dugu Xiong (獨孤熊), and Doulu Shao (豆盧紹). He then turned against Wang Gui, Yuwen Xiaobo, and Yuwen Shenju (宇文神舉) -- all close associates of Emperor Wu—as he suspected all of them of having spoken ill of him before Emperor Wu. Yuchi Yun died in fear.\n\nEmperor Xuan was obsessed with reestablishing changing the customary protocols that his father had established, and in spring 579, he changed the official uniforms that Emperor Wu had standardized, to instead use the uniforms styled after Eastern han dynasty and cao wei. He also abolished the penal code that his father had promulgated in 577 and declared several pardons, stating that he believed that Emperor Wu's punishments were too severe—but soon imposed an even more severe penal code. Also contrary to his father's prohibition of Buddhism and Taoism, he made public gestures to honor Taoism.\n\nAlso in spring 579, Emperor Xuan created his oldest son Yuwen Chan -- then six-years-old—the Prince of Lu, and then crown prince. He also promoted Luoyang to the status of secondary capital, moving the subsidiary branches of the six central government departments from northern qi's old capital Yecheng (鄴城, in modern Handan, Hebei ) to Luoyang.\n\nMeanwhile, around this time, Tujue's Tuobo Khan (Empress Dowager Ashina's uncle) sought peace. Emperor Xuan, in response, created his cousin (the daughter of his uncle Yuwen Zhao (宇文招) the Prince of Zhao) Princess Qianjin, offering to marry Princess Qianjin to Tuobo Khan, but with the demand that Tuobo Khan surrender Gao Shaoyi. Tuobo Khan refused.\n\nLess than a month after creating Yuwen Chan crown prince, Emperor Xuan formally passed the throne to Yuwen Chan (as Emperor Jing). Emperor Xuan himself claimed the atypical title of \"Emperor Tianyuan\" (天元皇帝, Tianyuan Huangdi), rather than the expected retired emperor title of Taishang Huang. He changed the name of his palace to Tian Tai (天台, \"heavenly tower\"), and doubled the number of tassels on his crown, as well as the number of imperial vehicles, litters, clothing, banners, and drums. He changed the name of the young emperor's palace to Zhengyang Palace (正陽宮), with the same complement of staff as his own palace. Empress Yang's title was changed to \"Empress Dowager Tianyuan\" (天元皇太后, Tianyuan Huang Taihou).\n\n\n\nAs retired emperor Historians described that after Emperor Xuan passed the throne to Emperor Jing, he became particularly wasteful, megalomanic, and unrestrained. He referred to himself as \"Heaven,\" and required officials who were to visit him to have vegetarian diets for three days and bathe—then customary for the days spent before worshipping a god. He disallowed officials from using belts or decorations for their clothing, and he forbid the use of such characters as \"heaven\" (天), \"high\" (高), \"upper\" (上), and \"grand\" (大), except by himself. He forbid women, other than the women of the palace, from using cosmetics, and for reasons unknown, he ordered that all wheels be made from single pieces of wood, disallowing assembling.\n\nIt was further recorded that whenever Emperor Xuan met with officials, he only discussed with them how to change customs or how to build palaces, disregarding the affairs of state. He spent his days in games and tours, wearing out his attendants. The officials often were caned—initially, 120 times per caning, and later increased to 240 times. The terror imposed on the officials and even the women of the palace was so great that no one dared to say anything.\n\nIn summer 579, Emperor Xuan created Emperor Jing's mother Consort Zhu Manyue \"Empress Tianyuan\" (天元帝后, Tianyuan Di Hou). He also set up fiefs for his uncles Yuwen Zhao, Yuwen Chun (宇文純) the Prince of Chen, Yuwen Sheng (宇文盛) the Prince of Yue, Yuwen Da (宇文達) the Prince of Dai, and Yuwen You (宇文逌) the Prince of Teng, and sent them away from Chang'an, to their fiefs.\n\nIn fall 579, in a highly unorthodox action, Emperor Xuan created two more empresses -- Consort Yuan Leshang as \"Heavenly Right Empress\" (天右皇后, Tian You Huanghou) and Consort Chen Yueyi as \"Heavenly Left Empress\" (天左皇后, Tian Zuo Huanghou), changing Empress Zhu's title to \"Heavenly Empress\" (天皇后, Tian Huanghou). Also around this time, when Yuchi Chifan the daughter-in-law of his cousin Yuwen Liang (宇文亮) the Duke of Qi was at the palace to greet him, he raped her.\n\nIn winter 579, Emperor Xuan officially ended the prohibitions against Taoism and Buddhism that Emperor Wu had declared, and he personally sat with the statues of Buddhist and Taoist deities. He also launched a major attack on rival chen dynasty. By spring 580, the northern zhou army had taken the territory between the Yangtze River and the Huai River from Chen. As the army was withdrawing, Yuwen Liang, serving as a general on the campaign, tried to ambush his commander Wei Xiaokuan and seize Wei's troops, and then declare a rebellion to support one of his uncles as emperor. Wei found out about Yuwen Liang's plot and was able to repel his attack, and was able to kill him. Emperor Xuan then also killed Yuwen Liang's son Yuwen Wen (宇文溫) the Duke of Xiyang, and then took Yuwen Wen's wife Duchess Yuchi as a consort. Then, against opposition that he already had too many empresses, he created her as another empress.\n\nBy this point, Emperor Xuan was becoming even more erratic in his behavior, and at one point, he became suddenly angry at Empress Yang and wanted to punish her. She, however, remained calm but firm in defense of herself, which made him more angry, and he ordered her to commit suicide. Empress Yang's mother, Duchess Dugu Qieluo, had to plead earnestly for Empress Yang's life, before he finally spared Empress Yang. Meanwhile, however, Emperor Xuan was suspicious of the abilities of Empress Yang's father Yang Jian, and he considered killing Yang Jian but ultimately did not do so. As Yang Jian and Zheng Yi were friends, Yang Jian made a secret request to Zheng to give him a post away from the capital, and soon, by Zheng's recommendation, Emperor Xuan made Yang Jian the commander of the forces against Chen (as he then prepared another attack against Chen).\n\nBefore the army could depart, however, Emperor Xuan suddenly grew ill in summer 580. He summoned his associates Liu Fang (劉昉) and Yan Zhiyi (顏之儀) to try to entrust the affairs to them, but when they arrived, he was already unable to speak. Liu, after consulting with fellow attendants Zheng, Liu Qiu (柳裘), Wei Mo (韋謨), and Huangfu Ji (皇甫績), decided to summon Yang Jian to attend to Emperor Xuan and to serve as regent if Emperor Xuan should die—against Yan's attempt to have Yuwen Zhao made regent. Yang initially declined, apparently fearing that it was a trap, but eventually arrived at the palace. That night, Emperor Xuan died, and Yang seized the control of the palace and the imperial troops. Within a year, Yang would seize the throne, ending northern zhou and establishing sui dynasty.\n\n\n\nPersonal information Father Emperor Wu of northern zhou\n\nMother Consort Li Ezi\n\nWife Empress Yang Lihua (created 578), mother of Princess Eying\n\nMajor Concubines Empress Zhu Manyue (created 579), mother of Crown Prince Chan Empress Chen Yueyi (created 579) Empress Yuan Leshang (created 579) Empress Yuchi Chifan (created 579) Consort Wang, mother of Prince Kan Consort Huangfu, mother of Prince Shu\n\nChildren Yuwen Yan (宇文衍), later changed to Yuwen Chan (宇文闡), initially the Prince of Lu (created 579), later the Crown Prince (created 579), later Emperor Jing of northern zhou Yuwen Kan (宇文衎), the Prince of Lai (created 580, executed by Emperor Wen of Sui 581) Yuwen Shu (宇文術), the Prince of Ying (created 580, executed by Emperor Wen of Sui 581) Yuwen Eying (宇文娥英)\n\n"}, {"url": "https://www.nouahsark.com/en/infocenter/culture/history/monarchs/emperor_xiaozhao_of_northern_qi.php", "page_content": "Emperor Xiaozhao of northern qi ((北)齊孝昭帝) (535–561), personal name Gao Yan (高演), courtesy name Yan'an (延安), was an emperor of the Chinese dynasty northern qi. He was generally considered a capable ruler, but ruled for less than two years before dying from injuries suffered from falling off a horse. northern qi would not have another capable ruler after his death.\n\n\n\nEarly life Gao Yan was born in 535, as the third of six sons that Gao Huan, then the paramount general of eastern wei and the Prince of Bohai, had with his wife Princess Lou Zhaojun, after his older brothers Gao Cheng and Gao Yang, and Gao Huan's sixth son overall. He was said to be intelligent in his childhood, and was much favored by his mother Princess Lou. At age three, in 538, he was created the Duke of Changshan. He was said to be studious, particularly favoring the Book of Han in his studies.\n\n\n\n\n\nDuring Emperor Wenxuan's reign In 550, Gao Yang, who had become regent of eastern wei following the deaths of Gao Huan in 547 and Gao Cheng in 549, had Emperor Xiaojing of eastern wei yield the throne to him, ending eastern wei and starting northern qi as its Emperor Wenxuan. As the new emperor's brother, Gao Yan was created the Prince of Changshan. He received a number of official posts during Emperor Wenxuan's reign, and was said to have distinguished himself in his ability to govern despite his youth, and was known for his solemnity. However, he was also said to be so stern in his ways that if subordinates carried out incorrect actions, he would cane them severely. At times, he participated in military campaigns that Emperor Wenxuan personally commanded.\n\nEmperor Wenxuan ruled northern qi diligently early in his reign, but later in his reign, perhaps starting 554 or so, he began to act erratically and cruelly toward his officials and members of his own household. On one occasion, when invited to one of Emperor Wenxuan's feasts, his face showed sadness and anxiety, and Emperor Wenxuan deduced that he must have disapproved Emperor Wenxuan's preoccupation with drinking and women, and he declared that he would stop drinking—although his abstension from alcohol only lasted for several days. Emperor Wenxuan also favored irreverent and sometimes immoral games within his palace, but when Gao Yan was present he would curb his behavior, and while Emperor Wenxuan was known for often visiting nobles' households and having sexual relations with their women, regardless of their relationships to him, he did not do so as to Gao Yan's household. During this period of Emperor Wenxuan's reign, then, Gao Yan became one of the only few individuals who would dare to try to get the emperor to change his behavior, although often only with temporary effect. On one occasion, Gao Yan offered a petition listing a number of behaviors that he believed Emperor Wenxuan should change—and this caused Emperor Wenxuan to be exceedingly angry at him, threatening to kill him and sentencing Gao Yan's chief advisor, Wang Xi (王唏), whom Emperor Wenxuan suspected to have contributed to the petition, to hard labor. In a later incident, Emperor Wenxuan, after having awarded Gao Yan a lady in waiting while drunk, forgot about the award after he became sober, and accused Gao Yan of stealing the lady in waiting, battering Gao Yan severely with a sword hilt. Gao Yan became angry and went on a hunger strike. Emperor Wenxuan, in order to placate Gao Yan, then agreed to release Wang Xi from hard labor and return him to Gao Yan's headquarters. Meanwhile, Emperor Wenxuan, who distrusted eastern wei's Yuan imperial household, of whom Gao Yan's wife Princess Yuan was a member, tried to get Gao Yan to divorce Princess Yuan, but Gao Yan refused, and when Emperor Wenxuan carried out a massacre of the Yuans in 559, it was at Gao Yan's earnest intercession that Emperor Wenxuan spared Princess Yuan's father Yuan Man (元蠻) and his family.\n\nEmperor Wenxuan's crown prince was his son Gao Yin, who was known for his studiousness, but Emperor Wenxuan, who, despite his Han ethnicity, favored Xianbei warrior ways, felt that Gao Yin was too Han in his thinking and repeatedly considered deposing him. Particularly when he was drunk, Emperor Wenxuan often stated that he would pass the throne to Gao Yan, and he stopped doing so only after being warned by his prime minister Yang Yin that his statements was potentially causing instability.\n\nIn fall 559, Emperor Wenxuan suffered a major illness that historians believed to be alcoholism-driven. He stated to his wife Empress Li Zu'e, \"A person will live and die, and there is nothing to regret, other than that our son Gao Yin is still young, and someone else will take his throne. \" He stated to Gao Yan, \"Go ahead and take the throne, but do not kill him!\" However, he did not change the succession order, and after his death, Gao Yin took the throne as Emperor Fei.\n\n\n\nDuring Emperor Fei's reign Pursuant to Emperor Wenxuan's will, the government was in the hands of several of his trusted officials -- Yang Yin, Gao Guiyan (高歸彥) the Prince of Pingqin, Yan Zixian (燕子獻), and Zheng Yi (鄭頤). Gao Yan, while respected by the people, was not given great power, and while Grand Empress Dowager Lou had some desire to have Gao Yan made emperor instead, there was insufficient support at the time, and Yang, in fear that Gao Yan and another brother of Emperor Wenxuan, Gao Dan the Prince of Changguang, would try to take power, took steps to curb their authorities. Meanwhile, Gao Yan's own supporters, citing the example of the Duke of Zhou, were suggesting to him that he should take power as the young emperor's uncle, and while Gao Yan initially rejected such overtures, he was watching the political scene carefully.\n\nAs Emperor Fei took the throne while he was attending to his father's deathbed at the secondary capital Jinyang (晉陽, in modern Taiyuan, Shanxi ), when he proceeded to the capital Yecheng (鄴城, in modern Handan, Hebei ) in spring 560, it was initially believed that Gao Yan or Gao Dan would be put in charge of Jinyang—then perhaps the most militarily secure city in the empire; instead, by the arrangements of Yang and his associates, the two princes were ordered to accompany the young emperor to Yecheng.\n\nOnce the imperial train arrived at Yecheng, the situation became even more tense, as an associate of Yang's, Kezhuhun Tianhe (可朱渾天和), was convinced that Emperor Fei would not be safe in his reign unless his two uncles were killed, and alternatively, Yan Zixian considered putting Grand Empress Dowager Lou, who still wielded much power as the clan matriarch, under house arrest, and forcing her to turn her authorities to Empress Dowager Li. Meanwhile, the ambitious Yang was carrying out a governmental reorganization scheme to trim unnecessary offices and titles and to remove incompetent officials. The officials who were hurt by Yang's actions became disaffected and largely hoped that Gao Yan and Gao Dan would take action and began to encourage them to do so. In spring 560, Yang considered sending Gao Yan and Gao Dan outside the capital to be provincial governors, but Emperor Fei initially disagreed. Yang wrote a submission to Empress Dowager Li to ask her to consider, and she consulted her lady in waiting Li Changyi (李昌儀), who leaked the news to Grand Empress Dowager Lou. She informed the two princes, and they set up an ambush, with Gao Guiyan and the generals Heba Ren (賀拔仁) and Hulü Jin (斛律金), at a ceremony where Gao Yan was to be named to a ceremonial post. Yang, Kezhuhun, Yan, Zheng, and Song Qindao (宋欽道) were all severely battered and captured. Gao Yan and Gao Dan then entered the palace and publicly accused Yang and his associates of crimes; Yang and his associates were executed, and Gao Yan took control of the government. He soon went to take up post at Jinyang, controlling the government remotely.\n\nGao Yan's advisors, headed by Wang Xi and Zhao Yanshen (趙彥深), then suggested that he take the throne himself—noting to him that his actions in killing Yang and his associates meant that when Emperor Fei was grown, he would never be able to have a cordial relationship with Emperor Fei. Gao Yan agreed, and although initially Grand Empress Dowager Lou found the action inadvisable, she finally agreed. In fall 560, she issued an edict deposing Emperor Fei and making Gao Yan emperor (as Emperor Xiaozhao); however, in the edict, she sternly warned Emperor Xiaozhao to make sure that nothing would happen to Emperor Fei, who was demoted to the rank of Prince of Ji'nan. Grand Empress Dowager Lou became again known as Empress Dowager Lou, while Empress Dowager Li was given the title of Empress Wenxuan.\n\n\n\nReign Emperor Xiaozhao was said to be diligent in his actions, and after he became emperor, he spent all day looking at laws and regulations of Emperor Wenxuan, seeking to revise the laws that were inappropriate or too harsh. He was praised for his diligence, but also criticized for being overly obsessed with details. He was also said to be filial pious toward Empress Dowager Lou and loving to his brothers. One brother who was dissatisfied with him, however, was Gao Dan, whom Emperor Xiaozhao had previously agreed to make crown prince—but who was passed over in favor of Emperor Xiaozhao's own son Gao Bainian, whom Emperor Xiaozhao created crown prince in winter 560, when he also created Princess Yuan empress. He also started long-term strategic planning against rival northern zhou, planning to gradually seize northern zhou territory east of the Yellow River bit by bit. He entrusted much of his decision-making to Wang Xi, Yang Xiuzhi (陽休之), and Cui Jie (崔劼), often having them stay in the palace all day to examine the laws and regulations.\n\nIn spring 561, Emperor Xiaozhao had the former liang dynasty general Wang Lin, who had fled to northern qi in 560 after his failed attempt, supported by northern qi, to let Xiao Zhuang rule as Liang's emperor, against chen dynasty and the northern zhou-supported Emperor Xuan of Western Liang, take up position at Hefei (合肥, in modern Hefei , Anhui ), to plan a campaign against Chen. Later, he made Wang the governor of Yang Province (揚州, modern central Anhui ).\n\nEmperor Xiaozhao, throughout his reign, stayed at the secondary capital Jinyang and did not stay at Yecheng, leaving Yecheng in Gao Dan's control. In fall 561, Emperor Xiaozhao, concerned that Gao Dan was becoming too powerful, tried to transfer some of Gao Dan's authority to the general Hulü Xian (斛律羨, Hulü Jin's son), but Gao Dan refused to transfer any of his authority. Meanwhile, sorcerers informed Emperor Xiaozhao that the imperial aura was still at Yecheng, making Emperor Xiaozhao concerned. Gao Guiyan, who was concerned that Gao Yin would one day take the throne again and retaliate against him, persuaded Emperor Xiaozhao that his nephew had to be removed, and so Emperor Xiaozhao issued an edict to summon the Prince of Ji'nan to Jinyang. Gao Dan, was disappointed at Emperor Xiaozhao not created him crown prince, briefly considered redeclaring Gao Yin emperor and starting a rebellion against Emperor Xiaozhao, but ultimately chose not to do it, as his own sorcerers informed him that they believed that he would become emperor one day anyway. He therefore sent Gao Yin to Jinyang. Soon, Emperor Xiaozhao sent assassins to deliver poisoned wine to Gao Yin. Gao Yin refused to drink it, and the assassins strangled him. Emperor Xiaozhao soon regretted killing his nephew.\n\nIn winter 561, while hunting, Emperor Xiaozhao's horse was spooked by a rabbit, and he fell off the horse and suffered broken ribs. When Empress Dowager Lou came to see him, she asked him where Gao Yin was, and he could not answer. Empress Dowager Lou angrily stated, \"Did you not kill him? Because you did not listen to me, you should die!\" and left without seeing him again. Soon, believing himself to be near death, he issued an edict stating that Gao Bainian was too young to take the throne, and that the throne was instead to be passed to Gao Dan. He also wrote a letter to Gao Dan, stating, \"Bainian is innocent. You can do anything with him, but please do not kill him!\" He died later that day, while lamenting that he was unable to serve his mother for the rest of her life. Gao Dan soon arrived at Jinyang and took the throne (as Emperor Wucheng).\n\n\n\nEra name Huangjian (皇建 huáng jiàn) 560-561\n\n"}, {"url": "http://dictionary.sensagent.com/Emperor_Xuan_of_Northern_Zhou/en-en/", "page_content": "From Wikipedia\n\nEmperor Xuan of Northern Zhou ((北)周宣帝) (559-580), personal name Yuwen Yun (宇文贇), courtesy name Qianbo (乾伯), was an emperor of the Chinese/Xianbei dynasty Northern Zhou. He was known in history as an erratic and wasteful ruler, whose actions greatly weakened the Northern Zhou regime. As part of that erratic behavior, he passed the throne to his son Emperor Jing in 579, less than a year after taking the throne, and subsequently entitled not only his wife Empress Yang Lihua empress, but four additional concubines as empresses. After his death in 580, the government was taken over by his father-in-law Yang Jian, who soon deposed his son Emperor Jing, ending Northern Zhou and establishing Sui Dynasty.\n\nBackground\n\nYuwen Yun was born in 559, as the oldest son of Yuwen Yong, then the Duke of Lu and younger brother of Emperor Ming. He was born at Tong Province (同州, roughly modern Weinan, Shaanxi), as Yuwen Yong was at that time the governor of Tong Province. His mother Li Ezi was Yuwen Yong's concubine. (Yuwen Yong had not yet officially married a wife by that point.)\n\nIn 560, Emperor Ming was poisoned to death by his cousin, the regent Yuwen Hu. Before he died, he willed that Yuwen Yong succeed him, and Yuwen Yong took the throne (as Emperor Wu). In 561, he created Yuwen Yun the Duke of Lu but did not create him crown prince. Only after Emperor Wu ambushed Yuwen Hu and killed him in 572 did he create Yuwen Yun crown prince. (Yuwen Yun's mother Consort Li was not created empress, as Emperor Wu married Empress Ashina, the daughter of Tujue's Mugan Khan Ashina Qijin in 568.)\n\nAs crown prince\n\nEmperor Wu often sent Yuwen Yun on tours of the provinces—and when he himself would go on tours of the provinces or go on military campaigns, he would have Yuwen Yun guard the capital Chang'an.\n\nIn 573, Yuwen Yun married Yang Lihua, the daughter of the general Yang Jian the Duke of Sui, as his wife and crown princess.\n\nIt was around this time that it came to Emperor Wu's attention that most of Yuwen Yong's associates were men of low character. At the suggestion of the superintendent of the crown prince's palace, Yuwen Xiaobo (宇文孝伯), Emperor Wu made Yuchi Yun (尉遲運), the well-regarded nephew of the general Yuchi Jiong (a cousin of Emperor Wu's), Yuwen Xiaobo's deputy. He also chose a number of men whose characters he had high regard for to serve in other posts as the crown prince's assistance—but Yuwen Yun resented these personnel changes.\n\nIn 574, when Emperor Wu's mother Empress Dowager Chinu died, Emperor Wu observed a mourning period for her, and during that period, Yuwen Yun served as regent.\n\nIn spring 576, Emperor Wu sent Yuwen Yun on a campaign against Tuyuhun as its nominal commander, but put Yuwen Xiaobo and Wang Gui (王軌) in actual command of the army. In fall 576, the army completed its campaign against Tuyuhun after reaching Tuyuhun's capital Fuqi (伏俟, in modern Haixi Mongol and Tibetan Autonomous Prefecture, Qinghai). Upon return to Chang'an, Wang Gui reported to Emperor Wu that Yuwen Yun and his trusted associates Zheng Yi (鄭譯) and Wang Duan (王端) had committed many immoral activities together. In anger, Emperor Wu battered Yuwen Yun and Zheng with a baton and removed Zheng from his post. Soon, however, Yuwen Yun reinstated Zheng to his post.\n\nHistorians also noted that Emperor Wu was very strict with the crown prince, treating him no easier than he did the officials. When he heard that Yuwen Yun liked drinking, he issued an edict forbidding any alcohol from entering the crown prince's palace, and whenever the crown prince had faults, he would whip or batter the crown prince, warning him, \"Do you not know how many crown princes had been deposed in history? Is it that my other sons are unworthy of being crown prince?\" He also ordered the officials at the crown prince's palace to watch the crown prince closely and submit reports on his actions. In reaction, Yuwen Yun suppressed his own behavior and pretended to have learned his lesson. Nevertheless, Wang Gui repeatedly suggested that Emperor Wu find a better heir, but Emperor Wu declined, because he believed his second son, Yuwen Zan (宇文贊) the Prince of Han to be even less competent than Yuwen Yun, and the other sons to be too young to be considered.\n\nIn 577, Emperor Wu destroyed rival Northern Qi, seizing its territory. In summer 578, however, he grew ill suddenly while preparing a campaign against Tujue, and he, after entrusting the important matters to Yuwen Xiaobo, died. Yuwen Yun took the throne as Emperor Xuan.\n\nReign\n\nEmperor Xuan honored his father Emperor Wu's wife Empress Ashina as empress dowager and created his wife Crown Princess Yang empress. Other than those proper acts, however, he began to carry out a number of inappropriate ones—including immediately promoting of Zheng Yi and having sexual relations with the ladies in waiting in his father's palace. It was also said that not only did he not mourn his father's death, but as he approached his father's casket, he touched the scars from the wounds his father had previously inflicted, and cursed, \"Old man, you died too late!\" He soon also honored his mother Consort Li as empress dowager (with the secondary title of Di Taihou (帝太后) to distinguish Empress Dowager Ashina's title Huang Taihou (皇太后)).\n\nUpon hearing Emperor Wu's death, Gao Shaoyi, a Northern Qi prince who had claimed Northern Qi's imperial title in exile in Tujue, tried to launch an attack to reestablish Northern Qi, but was quickly repelled and forced to retreat to Tujue territory.\n\nEmperor Xuan then turned to killing people that he feared or had grudges against. The first target was his uncle Yuwen Xian the Prince of Qi, due to the respect that Yuwen Xian commanded on account of his military abilities, along with Yuwen Xian's friends, the generals Wang Xing (王興), Dugu Xiong (獨孤熊), and Doulu Shao (豆盧紹). He then turned against Wang Gui, Yuwen Xiaobo, and Yuwen Shenju (宇文神舉) -- all close associates of Emperor Wu—as he suspected all of them of having spoken ill of him before Emperor Wu. Yuchi Yun died in fear.\n\nEmperor Xuan was obsessed with reestablishing changing the customary protocols that his father had established, and in spring 579, he changed the official uniforms that Emperor Wu had standardized, to instead use the uniforms styled after Eastern Han Dynasty and Cao Wei. He also abolished the penal code that his father had promulgated in 577 and declared several pardons, stating that he believed that Emperor Wu's punishments were too severe—but soon imposed an even more severe penal code. Also contrary to his father's prohibition of Buddhism and Taoism, he made public gestures to honor Taoism.\n\nAlso in spring 579, Emperor Xuan created his oldest son Yuwen Chan -- then six-years-old—the Prince of Lu, and then crown prince. He also promoted Luoyang to the status of secondary capital, moving the subsidiary branches of the six central government departments from Northern Qi's old capital Yecheng (鄴城, in modern Handan, Hebei) to Luoyang.\n\nMeanwhile, around this time, Tujue's Tuobo Khan (Empress Dowager Ashina's uncle) sought peace. Emperor Xuan, in response, created his cousin (the daughter of his uncle Yuwen Zhao (宇文招) the Prince of Zhao) Princess Qianjin, offering to marry Princess Qianjin to Tuobo Khan, but with the demand that Tuobo Khan surrender Gao Shaoyi. Tuobo Khan refused.\n\nLess than a month after creating Yuwen Chan crown prince, Emperor Xuan formally passed the throne to Yuwen Chan (as Emperor Jing). Emperor Xuan himself claimed the atypical title of \"Emperor Tianyuan\" (天元皇帝, Tianyuan Huangdi), rather than the expected retired emperor title of Taishang Huang. He changed the name of his palace to Tian Tai (天台, \"heavenly tower\"), and doubled the number of tassels on his crown, as well as the number of imperial vehicles, litters, clothing, banners, and drums. He changed the name of the young emperor's palace to Zhengyang Palace (正陽宮), with the same complement of staff as his own palace. Empress Yang's title was changed to \"Empress Dowager Tianyuan\" (天元皇太后, Tianyuan Huang Taihou).\n\nAs retired emperor\n\nHistorians described that after Emperor Xuan passed the throne to Emperor Jing, he became particularly wasteful, megalomanic, and unrestrained. He referred to himself as \"Heaven,\" and required officials who were to visit him to have vegetarian diets for three days and bathe—then customary for the days spent before worshipping a god. He disallowed officials from using belts or decorations for their clothing, and he forbid the use of such characters as \"heaven\" (天), \"high\" (高), \"upper\" (上), and \"grand\" (大), except by himself. He forbid women, other than the women of the palace, from using cosmetics, and for reasons unknown, he ordered that all wheels be made from single pieces of wood, disallowing assembling.\n\nIt was further recorded that whenever Emperor Xuan met with officials, he only discussed with them how to change customs or how to build palaces, disregarding the affairs of state. He spent his days in games and tours, wearing out his attendants. The officials often were caned—initially, 120 times per caning, and later increased to 240 times. The terror imposed on the officials and even the women of the palace was so great that no one dared to say anything.\n\nIn summer 579, Emperor Xuan created Emperor Jing's mother Consort Zhu Manyue \"Empress Tianyuan\" (天元帝后, Tianyuan Di Hou). He also set up fiefs for his uncles Yuwen Zhao, Yuwen Chun (宇文純) the Prince of Chen, Yuwen Sheng (宇文盛) the Prince of Yue, Yuwen Da (宇文達) the Prince of Dai, and Yuwen You (宇文逌) the Prince of Teng, and sent them away from Chang'an, to their fiefs.\n\nIn fall 579, in a highly unorthodox action, Emperor Xuan created two more empresses -- Consort Yuan Leshang as \"Heavenly Right Empress\" (天右皇后, Tian You Huanghou) and Consort Chen Yueyi as \"Heavenly Left Empress\" (天左皇后, Tian Zuo Huanghou), changing Empress Zhu's title to \"Heavenly Empress\" (天皇后, Tian Huanghou). Also around this time, when Yuchi Chifan the daughter-in-law of his cousin Yuwen Liang (宇文亮) the Duke of Qi was at the palace to greet him, he raped her.\n\nIn winter 579, Emperor Xuan officially ended the prohibitions against Taoism and Buddhism that Emperor Wu had declared, and he personally sat with the statues of Buddhist and Taoist deities. He also launched a major attack on rival Chen Dynasty. By spring 580, the Northern Zhou army had taken the territory between the Yangtze River and the Huai River from Chen. As the army was withdrawing, Yuwen Liang, serving as a general on the campaign, tried to ambush his commander Wei Xiaokuan and seize Wei's troops, and then declare a rebellion to support one of his uncles as emperor. Wei found out about Yuwen Liang's plot and was able to repel his attack, and was able to kill him. Emperor Xuan then also killed Yuwen Liang's son Yuwen Wen (宇文溫) the Duke of Xiyang, and then took Yuwen Wen's wife Duchess Yuchi as a consort. Then, against opposition that he already had too many empresses, he created her as another empress.\n\nBy this point, Emperor Xuan was becoming even more erratic in his behavior, and at one point, he became suddenly angry at Empress Yang and wanted to punish her. She, however, remained calm but firm in defense of herself, which made him more angry, and he ordered her to commit suicide. Empress Yang's mother, Duchess Dugu Qieluo, had to plead earnestly for Empress Yang's life, before he finally spared Empress Yang. Meanwhile, however, Emperor Xuan was suspicious of the abilities of Empress Yang's father Yang Jian, and he considered killing Yang Jian but ultimately did not do so. As Yang Jian and Zheng Yi were friends, Yang Jian made a secret request to Zheng to give him a post away from the capital, and soon, by Zheng's recommendation, Emperor Xuan made Yang Jian the commander of the forces against Chen (as he then prepared another attack against Chen).\n\nBefore the army could depart, however, Emperor Xuan suddenly grew ill in summer 580. He summoned his associates Liu Fang (劉昉) and Yan Zhiyi (顏之儀) to try to entrust the affairs to them, but when they arrived, he was already unable to speak. Liu, after consulting with fellow attendants Zheng, Liu Qiu (柳裘), Wei Mo (韋謨), and Huangfu Ji (皇甫績), decided to summon Yang Jian to attend to Emperor Xuan and to serve as regent if Emperor Xuan should die—against Yan's attempt to have Yuwen Zhao made regent. Yang initially declined, apparently fearing that it was a trap, but eventually arrived at the palace. That night, Emperor Xuan died, and Yang seized the control of the palace and the imperial troops. Within a year, Yang would seize the throne, ending Northern Zhou and establishing Sui Dynasty.\n\nEra name\n\nDacheng (大成 dà chéng) 579"}, {"url": "https://www.britannica.com/biography/Genghis-Khan", "page_content": "son Ögödei son Jöchi son Chagatai ...(Show more)\n\nTop Questions What was Genghis Khan’s early life like? Genghis Khan was born Temüjin to a royal clan of the Mongols. When he was nine, his father Yesügei was poisoned and Temüjin was held captive by his former supporters. He later escaped, killed his half-brother, and began gathering supporters and manpower in his teenage years. How did Genghis Khan come to power? After becoming the head of his clan, Genghis Khan forged alliances with other clans, exterminated the existing clan nobility, and overpowered enemy tribes such as the Tatars. In 1206 an assembly of leaders declared him universal emperor (chinggis khān) of the Mongolian steppe. What was Genghis Khan best known for? Genghis Khan was best known for unifying the Mongolian steppe under a massive empire that was able to challenge the powerful Jin dynasty in China and capture territory as far west as the Caspian Sea. When did Genghis Khan die? Genghis Khan died on August 18, 1227, during a campaign against the Tangut kingdom of Xixia.\n\nGenghis Khan, Genghis also spelled Chinggis, Chingis, Jenghiz, or Jinghis, original name Temüjin, also spelled Temuchin, (born 1162, near Lake Baikal, Mongolia—died August 18, 1227), Mongolian warrior-ruler, one of the most famous conquerors of history, who consolidated tribes into a unified Mongolia and then extended his empire across Asia to the Adriatic Sea. Top Questions: Genghis Khan See all videos for this article Genghis Khan was a warrior and ruler of genius who, starting from obscure and insignificant beginnings, brought all the nomadic tribes of Mongolia under the rule of himself and his family in a rigidly disciplined military state. He then turned his attention toward the settled peoples beyond the borders of his nomadic realm and began the series of campaigns of plunder and conquest that eventually carried the Mongol armies as far as the Adriatic Sea in one direction and the Pacific coast of China in the other, leading to the establishment of the great Mongol Empire.\n\nHistorical background With the exception of the saga-like Secret History of the Mongols (1240?), only non-Mongol sources provide near-contemporary information about the life of Genghis Khan. Almost all writers, even those who were in the Mongol service, have dwelt on the enormous destruction wrought by the Mongol invasions. One Arab historian openly expressed his horror at the recollection of them. Beyond the reach of the Mongols and relying on second-hand information, the 13th-century chronicler Matthew Paris called them a “detestable nation of Satan that poured out like devils from Tartarus so that they are rightly called Tartars.” He was making a play on words with the classical word Tartarus (Hell) and the ancient tribal name of Tatar borne by some of the nomads, but his account catches the terror that the Mongols evoked. As the founder of the Mongol nation, the organizer of the Mongol armies, and the genius behind their campaigns, Genghis Khan must share the reputation of his people, even though his generals were frequently operating on their own, far from direct supervision. Nevertheless, it would be mistaken to see the Mongol campaigns as haphazard incursions by bands of marauding savages. Nor is it true, as some have supposed, that these campaigns were somehow brought about by a progressive desiccation of Inner Asia that compelled the nomads to look for new pastures. Nor, again, were the Mongol invasions a unique event. Genghis Khan was neither the first nor the last nomadic conqueror to burst out of the Steppe and terrorize the settled periphery of Eurasia. His campaigns were merely larger in scale, more successful, and more lasting in effect than those of other leaders. They impinged more violently upon those sedentary peoples who had the habit of recording events in writing, and they affected a greater part of the Eurasian continent and a variety of different societies. Two societies were in constant contact, two societies that were mutually hostile, if only because of their diametrically opposed ways of life, and yet these societies were interdependent. The nomads needed some of the staple products of the south and coveted its luxuries. These could be had by trade, by taxing transient caravans, or by armed raids. The settled peoples of China needed the products of the steppe to a lesser extent, but they could not ignore the presence of the nomadic barbarians and were forever preoccupied with resisting encroachment by one means or another. A strong dynasty, such as the 17th-century Manchu, could extend its military power directly over all Inner Asia. At other times the Chinese would have to play off one set of barbarians against another, transferring their support and juggling their alliances so as to prevent any one tribe from becoming too strong. Britannica Quiz History Buff Quiz The cycle of dynastic strength and weakness in China was accompanied by another cycle, that of unity and fragmentation amongst the peoples of the steppe. At the peak of their power, a nomadic tribe under a determined leader could subjugate the other tribes to its will and, if the situation in China was one of weakness, might extend its power well beyond the steppe. In the end this extension of nomadic power over the incompatible, sedentary culture of the south brought its own nemesis. The nomads lost their traditional basis of superiority—that lightning mobility that required little in the way of supply and fodder—and were swallowed up by the Chinese they had conquered. The cycle would then be resumed; a powerful China would reemerge, and disarray and petty squabbling among ephemeral chieftains would be the new pattern of life among the nomads. The history of the Mongol conquests illustrates this analysis perfectly, and it is against this background of political contrasts and tensions that the life of Genghis Khan must be evaluated. His campaigns were not an inexplicable natural or even God-given catastrophe but the outcome of a set of circumstances manipulated by a soldier of ambition, determination, and genius. He found his tribal world ready for unification, at a time when China and other settled states were, for one reason or another, simultaneously in decline, and he exploited the situation."}, {"url": "https://wiki.alquds.edu/?query=Emperor_Xiaozhao_of_Northern_Qi", "page_content": "Emperor of Northern Qi\n\nEmperor Xiaozhao of Northern Qi ((北)齊孝昭帝) (535–561), personal name Gao Yan (高演), courtesy name Yan'an (延安), was an emperor of the Chinese Northern Qi dynasty. He was generally considered a capable ruler, but ruled for less than two years before dying from injuries suffered from falling off a horse. The Northern Qi dynasty would not have another capable ruler after his death. He was only 26 when he died.\n\nEarly life [ edit ]\n\nGao Yan was born in 535, as the third of six sons that Gao Huan, then the paramount general of Eastern Wei and the Prince of Bohai, had with his wife Princess Lou Zhaojun, after his older brothers Gao Cheng and Gao Yang, and Gao Huan's sixth son overall.[1] He was said to be intelligent in his childhood, and was much favored by his mother Princess Lou. At age three, in 538, he was created the Duke of Changshan. He was said to be studious, particularly favoring the Book of Han in his studies.\n\nDuring Emperor Wenxuan's reign [ edit ]\n\nIn 550, Gao Yang, who had become regent of Eastern Wei following the deaths of Gao Huan in 547 and Gao Cheng in 549, had Emperor Xiaojing of Eastern Wei yield the throne to him, ending Eastern Wei and starting Northern Qi as its Emperor Wenxuan. As the new emperor's brother, Gao Yan was created the Prince of Changshan. He received a number of official posts during Emperor Wenxuan's reign, and was said to have distinguished himself in his ability to govern despite his youth, and was known for his solemnity. However, he was also said to be so stern in his ways that if subordinates carried out incorrect actions, he would cane them severely. At times, he participated in military campaigns that Emperor Wenxuan personally commanded.\n\nEmperor Wenxuan ruled Northern Qi diligently early in his reign, but later in his reign, perhaps starting 554 or so, he began to act erratically and cruelly toward his officials and members of his own household. On one occasion, when invited to one of Emperor Wenxuan's feasts, his face showed sadness and anxiety, and Emperor Wenxuan deduced that he must have disapproved Emperor Wenxuan's preoccupation with drinking and women, and he declared that he would stop drinking—although his abstention from alcohol only lasted for several days. Emperor Wenxuan also favored irreverent and sometimes immoral games within his palace, but when Gao Yan was present he would curb his behavior, and while Emperor Wenxuan was known for often visiting nobles' households and having sexual relations with their women, regardless of their relationships to him, he did not do so as to Gao Yan's household. During this period of Emperor Wenxuan's reign, then, Gao Yan became one of the only few individuals who would dare to try to get the emperor to change his behavior, although often only with temporary effect. On one occasion, Gao Yan offered a petition listing a number of behaviors that he believed Emperor Wenxuan should change—and this caused Emperor Wenxuan to be exceedingly angry at him, threatening to kill him and sentencing Gao Yan's chief advisor, Wang Xi (王唏), whom Emperor Wenxuan suspected to have contributed to the petition, to hard labor. In a later incident, Emperor Wenxuan, after having awarded Gao Yan a lady in waiting while drunk, forgot about the award after he became sober, and accused Gao Yan of stealing the lady in waiting, battering Gao Yan severely with a sword hilt. Gao Yan became angry and went on a hunger strike. Emperor Wenxuan, in order to placate Gao Yan, then agreed to release Wang Xi from hard labor and return him to Gao Yan's headquarters. Meanwhile, Emperor Wenxuan, who distrusted Eastern Wei's Yuan imperial household, of whom Gao Yan's wife Princess Yuan was a member, tried to get Gao Yan to divorce Princess Yuan, but Gao Yan refused, and when Emperor Wenxuan carried out a massacre of the Yuans in 559, it was at Gao Yan's earnest intercession that Emperor Wenxuan spared Princess Yuan's father Yuan Man (元蠻) and his family.\n\nEmperor Wenxuan's crown prince was his son Gao Yin, who was known for his studiousness, but Emperor Wenxuan, who, despite his Han ethnicity, favored Xianbei warrior ways, felt that Gao Yin was too Han in his thinking and repeatedly considered deposing him. Particularly when he was drunk, Emperor Wenxuan often stated that he would pass the throne to Gao Yan, and he stopped doing so only after being warned by his prime minister Yang Yin that his statements were potentially causing instability.\n\nIn fall 559, Emperor Wenxuan suffered a major illness that historians believed to be alcoholism-driven. He stated to his wife Empress Li Zu'e, \"A person will live and die, and there is nothing to regret, other than that our son Gao Yin is still young, and someone else will take his throne.\" He stated to Gao Yan, \"Go ahead and take the throne, but do not kill him!\" However, he did not change the succession order, and after his death, Gao Yin took the throne as Emperor Fei.\n\nDuring Emperor Fei's reign [ edit ]\n\nPursuant to Emperor Wenxuan's will, the government was in the hands of several of his trusted officials – Yang Yin, Gao Guiyan (高歸彥) the Prince of Pingqin, Yan Zixian (燕子獻), and Zheng Yi (鄭頤). Gao Yan, while respected by the people, was not given great power, and while Grand Empress Dowager Lou had some desire to have Gao Yan made emperor instead, there was insufficient support at the time, and Yang, in fear that Gao Yan and another brother of Emperor Wenxuan, Gao Zhan the Prince of Changguang, would try to take power, took steps to curb their authorities. Meanwhile, Gao Yan's own supporters, citing the example of the Duke of Zhou, were suggesting to him that he should take power as the young emperor's uncle, and while Gao Yan initially rejected such overtures, he was watching the political scene carefully.\n\nAs Emperor Fei took the throne while he was attending to his father's deathbed at the secondary capital Jinyang (晉陽, in modern Taiyuan, Shanxi), when he proceeded to the capital Yecheng (鄴城, in modern Handan, Hebei) in spring 560, it was initially believed that Gao Yan or Gao Zhan would be put in charge of Jinyang—then perhaps the most militarily secure city in the empire; instead, by the arrangements of Yang and his associates, the two princes were ordered to accompany the young emperor to Yecheng.\n\nOnce the imperial train arrived at Yecheng, the situation became even more tense, as an associate of Yang's, Kezhuhun Tianhe (可朱渾天和), was convinced that Emperor Fei would not be safe in his reign unless his two uncles were killed, and alternatively, Yan Zixian considered putting Grand Empress Dowager Lou, who still wielded much power as the clan matriarch, under house arrest, and forcing her to turn her authorities to Empress Dowager Li. Meanwhile, the ambitious Yang was carrying out a governmental reorganization scheme to trim unnecessary offices and titles and to remove incompetent officials. The officials who were hurt by Yang's actions became disaffected and largely hoped that Gao Yan and Gao Zhan would take action and began to encourage them to do so. In spring 560, Yang considered sending Gao Yan and Gao Zhan outside the capital to be provincial governors, but Emperor Fei initially disagreed. Yang wrote a submission to Empress Dowager Li to ask her to consider, and she consulted her lady in waiting Li Changyi (李昌儀), who leaked the news to Grand Empress Dowager Lou. She informed the two princes, and they set up an ambush, with Gao Guiyan and the generals Heba Ren (賀拔仁) and Hulü Jin (斛律金), at a ceremony where Gao Yan was to be named to a ceremonial post. Yang, Kezhuhun, Yan, Zheng, and Song Qindao (宋欽道) were all captured and severely battered. Gao Yan and Gao Zhan then entered the palace and publicly accused Yang and his associates of crimes; Yang and his associates were executed, and Gao Yan took control of the government. He soon went to take up post at Jinyang, controlling the government remotely.\n\nGao Yan's advisors, headed by Wang Xi and Zhao Yanshen (趙彥深), then suggested that he take the throne himself—noting to him that his actions in killing Yang and his associates meant that when Emperor Fei was grown, he would never be able to have a cordial relationship with Emperor Fei. Gao Yan agreed, and although initially Grand Empress Dowager Lou found the action inadvisable, she finally agreed. In fall 560, she issued an edict deposing Emperor Fei and making Gao Yan emperor (as Emperor Xiaozhao); however, in the edict, she sternly warned Emperor Xiaozhao to make sure that nothing would happen to Emperor Fei, who was demoted to the rank of Prince of Ji'nan. Grand Empress Dowager Lou became again known as Empress Dowager Lou, while Empress Dowager Li was given the title of Empress Wenxuan.\n\nReign [ edit ]\n\nEmperor Xiaozhao was said to be diligent in his actions, and after he became emperor, he spent all day looking at laws and regulations of Emperor Wenxuan, seeking to revise the laws that were inappropriate or too harsh. He was praised for his diligence, but also criticized for being overly obsessed with details. He was also said to be filial pious toward Empress Dowager Lou and loving to his brothers. One brother who was dissatisfied with him, however, was Gao Zhan, whom Emperor Xiaozhao had previously agreed to make crown prince—but who was passed over in favor of Emperor Xiaozhao's own son Gao Bainian, whom Emperor Xiaozhao created crown prince in winter 560, when he also created Princess Yuan empress. He also started long-term strategic planning against rival Northern Zhou, planning to gradually seize Northern Zhou territory east of the Yellow River bit by bit. He entrusted much of his decision-making to Wang Xi, Yang Xiuzhi (陽休之), and Cui Jie (崔劼), often having them stay in the palace all day to examine the laws and regulations.\n\nIn spring 561, Emperor Xiaozhao had the former Liang Dynasty general Wang Lin (who had fled to Northern Qi in 560 after his failed attempt, supported by Northern Qi, to let Xiao Zhuang rule as Liang's emperor, against Chen Dynasty and the Northern Zhou-supported Western Liang), take up position at Hefei (合肥, in modern Hefei, Anhui), to plan a campaign against Chen. Later, he made Wang the governor of Yang Province (揚州, modern central Anhui).\n\nEmperor Xiaozhao, throughout his reign, stayed at the secondary capital Jinyang and did not stay at Yecheng, leaving Yecheng in Gao Zhan's control. In fall 561, Emperor Xiaozhao, concerned that Gao Zhan was becoming too powerful, tried to transfer some of Gao Zhan's authority to the general Hulü Xian (斛律羨, Hulü Jin's son), but Gao Zhan refused to transfer any of his authority. Meanwhile, sorcerers informed Emperor Xiaozhao that the imperial aura was still at Yecheng, making Emperor Xiaozhao concerned. Gao Guiyan, who was concerned that Gao Yin would one day take the throne again and retaliate against him, persuaded Emperor Xiaozhao that his nephew had to be removed, and so Emperor Xiaozhao issued an edict to summon the Prince of Ji'nan to Jinyang. Gao Zhan, was disappointed at Emperor Xiaozhao not created him crown prince, briefly considered redeclaring Gao Yin emperor and starting a rebellion against Emperor Xiaozhao, but ultimately chose not to do it, as his own sorcerers informed him that they believed that he would become emperor one day anyway. He therefore sent Gao Yin to Jinyang. Soon, Emperor Xiaozhao sent assassins to deliver poisoned wine to Gao Yin. Gao Yin refused to drink it, and the assassins strangled him. Emperor Xiaozhao soon regretted killing his nephew.\n\nIn winter 561, while hunting, Emperor Xiaozhao's horse was spooked by a rabbit, and he fell off the horse and suffered broken ribs. When Empress Dowager Lou came to see him, she asked him where Gao Yin was, and he could not answer. Empress Dowager Lou angrily stated, \"Did you kill him? Because you did not listen to me, you should die!\" and left without seeing him again. Soon, believing himself to be near death, he issued an edict stating that Gao Bainian was too young to take the throne, and that the throne was instead to be passed to Gao Zhan. He also wrote a letter to Gao Zhan, stating, \"Bainian is innocent. You can do anything with him, but please do not kill him!\" He died later that day, while lamenting that he was unable to serve his mother for the rest of her life. Gao Zhan soon arrived at Jinyang and took the throne (as Emperor Wucheng).\n\nFamily [ edit ]\n\nConsorts and Issue:\n\nEmpress Shuncheng, of the Yuan clan of Henan ( 順成皇后 河南元氏 ) Gao Bainian, Prince Leling Lianghuai ( 樂陵良懷王 高百年 ; 556–564), first son\n\n) Pin, of the Sang clan ( 嬪 桑氏 ) Gao Liang, Prince Xiangcheng ( 襄城王 高亮 ; 551–577), second son\n\n) Unknown Gao Yanli, Prince Runan ( 汝南王 高彥理 ), third son Gao Yande, Prince Shiping ( 始平王 高彥德 ), fourth son Gao Yanji, Prince Chengyang ( 城陽王 高彥基 ), fifth son Gao Yankang, Prince Dingyang ( 定陽王 高彥康 ), sixth son Gao Yanzhong, Prince Ruyang ( 汝陽王 高彥忠 ), seventh son Princess Jianchang ( 建昌公主 ; 560–606), personal name Shande ( 善德 ) Married Mr. Lu ( 陸 )\n\n\n\nAncestry [ edit ]\n\nGao Hu Gao Mi (428–472) Lady Murong Gao Shusheng (472–526) Shusun Chong Lady Shusun of Henan Gao Huan (496–547) Empress Wenmu (d. 496) Emperor Xiaozhao of Northern Qi (535–561) Lou Ti Lou Neigan Empress Wuming (501–562)"}, {"url": "https://www.britannica.com/biography/Qin-Shi-Huang", "page_content": "Shihuangdi was buried in a 20-square-mile (50-square-km) funerary compound now known as the Qin tomb , near Xi’an , China . It contains some 8,000 life-sized terra-cotta soldiers and horse figures that formed an army to defend Shihuangdi’s tomb.\n\nShihuangdi was emperor of the Qin dynasty (221–210 BCE) and the creator of the first unified Chinese empire. He is also known for his interest in immortality, his huge funerary compound that contains some 8,000 life-sized terra-cotta soldiers, and for his contribution to the Great Wall of China .\n\nQin Shi Huang , also called Shihuangdi , Wade-Giles romanization Shih-huang-ti , personal name (xingming) Zhao Zheng or Ying Zheng , (born c. 259 bce, Qin state, northwestern China—died 210 bce, Hebei), emperor (reigned 221–210 bce) of the Qin dynasty (221–207 bce) and creator of the first unified Chinese empire (which collapsed, however, less than four years after his death).\n\nUntil Zheng was officially declared of age in 238, his government was headed by Lü Buwei. Zheng’s first act as king was to execute his mother’s lover, who had joined the opposition, and to exile Lü, who had been involved in the affair. A decree ordering the expulsion of all aliens, which would have deprived the king of his most competent advisers, was annulled at the urging of Li Si , later grand councillor. By 221, with the help of espionage, extensive bribery, and the ruthlessly effective leadership of gifted generals, Zheng had eliminated one by one the remaining six rival states that constituted China at that time, and the annexation of the last enemy state, Qi , in 221 marked his final triumph: for the first time China was united, under the supreme rule of the Qin.\n\nWhen Zheng, at age 13, formally ascended the throne in 246 bce, Qin already was the most powerful state and was likely to unite the rest of China under its rule. The central states had considered Qin to be a barbarous country , but by that time its strong position on the mountainous western periphery (with its centre in the modern province of Shaanxi) enabled Qin to develop a strong bureaucratic government and military organization as the basis of the totalitarian state philosophy known as legalism .\n\nZhao Zheng was born the son of Zhuangxiang (who later became king of the state of Qin in northwestern China) while his father was held hostage in the state of Zhao. His mother was a former concubine of a rich merchant, Lü Buwei , who, guided by financial interests, managed to install Zhuangxiang on the throne, even though he had not originally been designated as successor. The tradition, once widely accepted, that Zheng was actually Lü Buwei’s natural son is probably a slanderous invention.\n\nEmperor of China\n\nTo herald his achievement, Zheng assumed the sacred titles of legendary rulers and proclaimed himself Qin Shi Huang (“First Sovereign Emperor”). With unbounded confidence, he claimed that his dynasty would last “10,000 generations.”\n\nAs emperor he initiated a series of reforms aimed at establishing a fully centralized administration, thus avoiding the rise of independent satrapies. Following the example of Qin and at the suggestion of Li Si, he abolished territorial feudal power in the empire, forced the wealthy aristocratic families to live in the capital, Xianyang, and divided the country into 36 military districts, each with its own military and civil administrator. He also issued orders for almost universal standardization—from weights, measures, and the axle lengths of carts to the written language and the laws. Construction of a network of roads and canals was begun, and fortresses erected for defense against barbarian invasions from the north were linked to form the Great Wall.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn 220 Qin Shi Huang undertook the first of a series of imperial inspection tours that marked the remaining 10 years of his reign. While supervising the consolidation and organization of the empire, he did not neglect to perform sacrifices in various sacred places, announcing to the gods that he had finally united the empire, and he erected stone tablets with ritual inscriptions to extol his achievements.\n\nAnother motive for Qin Shi Huang’s travels was his interest in magic and alchemy and his search for masters in these arts who could provide him with the elixir of immortality. After the failure of such an expedition to the islands in the Eastern Sea—possibly Japan—in 219, the emperor repeatedly summoned magicians to his court. Confucian scholars strongly condemned the step as charlatanry, and it is said that 460 of them were executed for their opposition. The continuous controversy between the emperor and Confucian scholars who advocated a return to the old feudal order culminated in the famous burning of the books of 213, when, at Li Si’s suggestion, all books not dealing with agriculture, medicine, or prognostication were burned, except historical records of Qin and books in the imperial library.\n\nThe last years of Qin Shi Huang’s life were dominated by an ever-growing distrust of his entourage—at least three assassination attempts nearly succeeded—and his increasing isolation from the common people. Almost inaccessible in his huge palaces, the emperor led the life of a semidivine being. In 210 Qin Shi Huang died during an inspection tour. He was buried in a gigantic funerary compound hewn out of a mountain and shaped in conformity with the symbolic patterns of the cosmos. (Excavation of this enormous complex of some 20 square miles [50 square km]—now known as the Qin tomb—began in 1974, and the complex was designated a UNESCO World Heritage site in 1987. Among the findings at the site were some 8,000 life-sized terra-cotta soldier and horse figures forming an “army” for the dead king.) The disappearance of Qin Shi Huang’s forceful personality immediately led to the outbreak of fighting among supporters of the old feudal factions that ended in the collapse of the Qin dynasty and the extermination of the entire imperial clan by 206.\n\nMost of the information about Qin Shi Huang’s life derives from the successor Han dynasty, which prized Confucian scholarship and thus had an interest in disparaging the Qin period. The report that Qin Shi Huang was an illegitimate son of Lü Buwei is possibly an invention of that epoch. Further, stories describing his excessive cruelty and the general defamation of his character must be viewed in the light of the distaste felt by the ultimately victorious Confucians for legalist philosophy in general.\n\nQin Shi Huang certainly had an imposing personality and showed an unbending will in pursuing his aim of uniting and strengthening the empire. His despotic rule and the draconian punishments he meted out were dictated largely by his belief in legalist ideas. With few exceptions, the traditional historiography of imperial China has regarded him as the villain par excellence, inhuman, uncultivated, and superstitious. Modern historians, however, generally stress the endurance of the bureaucratic and administrative structure institutionalized by Qin Shi Huang, which, despite its official denial, remained the basis of all subsequent dynasties in China."}]}