{"Johan Christian Dahl studied under Christian August Lorentzen.": [{"url": "https://www.metmuseum.org/art/collection/search/438159", "page_content": "Use your arrow keys to navigate the tabs below, and your tab key to choose an item\n\nLava, fire, and steam spew from the caldera of Mount Vesuvius above the Bay of Naples. Depicted from behind, a pair of finely attired visitors on their Grand Tour view the event up-close. Their guides and donkeys wait patiently in the foreground at the lower right. The Eruption of Vesuvius is a striking depiction of a force of nature that animated the European imagination after 1748, when Pompeii, buried by the eruption of 79 AD, was rediscovered. A few years later, Edmund Burke described major natural phenomena that inspire a sense of awe as “Sublime” in his treatise A Philosophical Enquiry into the Origin of our Ideas of the Sublime and Beautiful (1757). The text became foundational to the incipient Romantic era. By the early nineteenth century, visitors to Italy traveled south from Rome to Naples not only to see the city and its glorious Mediterranean setting, but with the hope of witnessing an eruption like the one depicted here.[1]\n\n\n\nThis painting was commissioned in 1821 by Dahl’s most important patron, Danish Crown Prince Christian Frederik, the future King Christian VIII, who eventually acquired eighteen works by the Norwegian artist. A longtime territory of Denmark’s, Norway received its own constitution in 1814, but ambitious Norwegians typically sojourned in Copenhagen to develop their skills after reaching the limits of educational possibilities in their still-provincial country. Dahl left his native Bergen in 1811, studying for seven years with the landscape painter Christian August Lorentzen (1749–1828) at the Royal Academy of Fine Art. It was there that Dahl first gained the attention of Christian Frederik. In 1818, Dahl moved to Dresden, where Christian Frederik visited him in the spring of 1819, en route to Italy. In May 1820, Dahl received an invitation to join the prince, who offered to cover his expenses. The painter left Dresden on June 13 and arrived at the palace of Quisisana, above Castellammare on the Bay of Naples, on August 11. He remained in Italy for ten months, leaving from Rome on June 21, 1821.\n\n\n\nVesuvius erupted on December 20, 1820, and Dahl ascended the volcano as quickly as he could to observe the phenomenon on the spot. The next day he painted a sketch, or study, to record what he had seen. On July 13, 1824, Christian Frederik wrote to Dahl, expressing pleasure that the artist was working on a painting of Vesuvius for him, which “judging from the sketch, cannot fail to impress.” This was presumably the sketch that Dahl executed immediately after the eruption, which Christian Frederik could have seen in Naples, or afterward, in Rome. That sketch is probably the one now in the Statens Museum for Kunst, Copenhagen, which is signed and dated December 24, 1820 (Bang 1987, no. 257). Dahl exhibited the present work in the Dresden Academy’s annual exhibition in 1824. It was delivered to the patron in January 1825 and exhibited at the Danish Academy’s annual exhibition in Copenhagen later that year.\n\n\n\nDahl painted two versions of this composition before he left Italy. One, dated February 21, 1821, is also in the Statens Museum (Bang 296). Another was produced in Rome in 1821 for the Prussian consul, Jacob Bartholdi, and is now in the KODE Art Museums, Bergen (Bang 316). There are at least four other versions, dated 1826 (Städel Museum, Frankfurt; Bang 510), 1845 (whereabouts unknown, Bang 1032), what may be a copy after the present work possibly executed by 1832 (Nasjonalmuseet, Oslo; Bang 1254), and another, possibly datable about 1820–24 (private collection, Salten, Norway, in 1987; Bang 1284).\n\n\n\nThere are two related drawings, a study of ships in the bay, dated “24 Octbr 1820,” and a study of the man to the right by the flames, signed, dated, and inscribed “Prof. Friedrich’s Figur. Dahl 1824.” (Nasjonalmuseet, Oslo, inv. nos. B 2600 and B 2726).\n\n\n\nThis entry is based on Bang 1987, vol. 1, pp. 50–63, 175–77, and pages noted above as well as under References.\n\n\n\nAsher Miller 2019\n\n\n\n[1] See Lucio Fino, Vesuvius and the Grand Tour: Vedute and Travel Memoirs from the 17th to the 19th Centuries, trans. Angela Federico, Naples, 2012."}, {"url": "http://www.artandpopularculture.com/Johan_Christian_Dahl", "page_content": "From The Art and Popular Culture Encyclopedia\n\nJohan Christian Claussen Dahl (February 24, 1788 – October 14, 1857), often known as J. C. Dahl, was a Norwegian landscape painter, who was connected to the Romantic movement. He is often considered have been \"the father of Norwegian landscape painting\".\n\nBackground\n\nBorn the son of a fisherman in Bergen, Norway, Dahl's first training was as a decorative artist in his native city. A group of well-to-do citizens collected money which enabled him to travel to Copenhagen in 1811 to study at the Royal Danish Academy of Fine Arts. Christian August Lorentzen was his teacher, though the poetic landscapes of Jens Juel also made an impression on young Dahl.\n\nIn the autumn of 1818, Dahl left Copenhagen. His intention was to go on a study tour to the most important cultural centers in Europe. One of his stops was Dresden, where he moved in artistic circles. In the summer of 1820 he traveled to Rome and Naples, returning in 1821 to settle permanently in Dresden. He married and settled in the city for the rest of his life.\n\nCareer\n\nJohan Christian Dahl began his artistic career as a professor at the Dresden Academy of Fine Arts in 1824. He was active mostly in this city but gathered his subject material from the landscape of his home country. Together with Caspar David Friedrich and Carl Gustav Carus, he would become one of the Dresden painters of the period who exerted a decisive influence on German Romantic painting.\n\nJ.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century. His Romantic yet naturalistic interpretations of Norwegian scenery aroused interest in Norway on the Continent, where Dahl himself was highly esteemed, particularly in Denmark and Germany. Dahl made frequent visits to Norway. In 1826 he went on a long study tour in Norway, his first visit there since leaving the country in 1811. Dahl visited Norway again in 1834, 1839, 1844 and 1850, and was thus able to expand the range of his Norwegian subject-matter. Dahl was active in promoting the preservation of historic monuments in Norway.\n\nIn 1836, Dahl was also among the founding fathers of the National Gallery of Norway (Norwegian: Nasjongallerietand) now the National Museum of Art, Architecture and Design and donated his own art collection to the institution. Jointly with Johan Sebastian Welhaven, Frederik Stang and Henrik Heftye, he founded also the Art Society in Oslo (Norwegian: Oslo Kunstforening.\n\nDahl was received into several academic bodies. He had the orders of Vasa and St. Olav bestowed on him by the kings of Norway and Sweden. He died in Dresden in 1857.\n\nSelected works\n\nHis more prominent works include Outbreak of Vesuvius (1826). Many of his works may be seen in Dresden, notably a large picture called Norway and Storm at Sea. The Bergen Kunstmuseum in Bergen, Norway contains several of his more prominent works including: Lysekloster (1827), Stedje i Sogn (1836) and Bjerk i storm (1849). Shipwreck on the Coast of Norway (1832) is featured in The National Museum of Art, Architecture and Design - The National Gallery, Oslo.\n\n\n\n"}, {"url": "https://matthiesengallery.com/artist/dahl-johan-christian", "page_content": "1788 - 1857\n\nPlace Born Bergen\n\nPlace Died Dresden\n\nBio\n\nBorn in Bergen Norway, and trained at the Copenhagen Academy, Dahl nonetheless spent most of his working career in Germany. He is thus claimed by all three schools for their own, although it was his influence on the latter that was more important, as from 1824 until his death he held the senior professorship of art at the Dresden Academy. His memories of his homeland, however, provided him with themes that he reused throughout his career, but it was his attention to nature and use of the plein-air sketch that earned him the Dresden appointment in preference to Friedrich.\n\nDahl entered the Copenhagen Academy in 1811, as a pupil of C. A Lorentzen, an undistinguished painter who had looked at Vernet and concentrated on exaggerated mountainous views. It was Jens Juel, however, and Dahl\u0092s exposure to the sketches and paintings made by Eckersberg on his foreign travels, that persuaded him to make use of plein-air sketches, essential to his artistic formation. The young painter also took advantage of his access to the Danish royal collection, strong in the work of Dutch 17th century artists, which led him to appreciate the Nordic landscapes of Jacob v. Ruisdael and Albert v. Everdingen, both of whom influenced his approach to the natural world. In 1818, after leaving the Academy, he made his first trip to Dresden, where he became acquainted with the work of Caspar David Friedrich, whose use of religious symbols in landscape settings also affected Dahl, even though the younger artist was to temper this with stronger naturalism.\n\nLike so many painters, he felt bound to undertake an Italian trip, spending a few months in Rome where he joined the German and Danish expatriates in exploring the Roman Campagna and the Amalfi coast. Upon his return he was appointed to the Dresden Academy where he taught a whole generation of German painters, and continued his relationship with the many Danish artists who passed through on their journey to and from Italy. Dahl, however, like Friedrich, was also as much interested in the \u0091spirit of nature\u0092 as natural phenomena, and in his admiration for \u0091honest\u0092 naïvety (in the words of Franz Pforr) there was no \u0091virtuoso brush-work, no bold handling was to be seen; everything presented itself simply, like something frown rather than painted.\u0092 Nonetheless \u0091in his conception of landscape he was a pure naturalist, seizing on the details of rocks and trees and plants and meadows with quite extraordinary mastery; working with amazing facility, but leaving much to chance, he often seemed to surrender himself to the objective\u0092 (Carus, writing of Dahl). Dahl may be compared with Constable in that both saw landscape as a means of recording moods and impressions, but they lack the bravura of the English master and Dahl was uninterested in experimenting with technique in order to achieve a particular effect of light. In terms of technique his approach was conventional, but nonetheless it was fresh and direct. Dahl was himself a substantial collector who never lost touch with his homeland; indeed, after his death he bequeathed his collection to the Norwegian capital, Oslo, where it provided the basis for the Norwegian National Gallery."}, {"url": "https://artvee.com/artist/johan-christian-dahl/", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Bergenhus Fortress in Bergen.\n\nDahl came from a simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller [no], whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nDahl held that a landscape painting should not just depict a specific view, but should also say something about the land's nature and character – the greatness of its past and the life and work of its current inhabitants. The mood was often idyllic, often melancholy. When he added snow to a landscape he painted in the summer, it was not to show the light and colors of snow; it was to use snow as a symbol of death. As one critic has put it, “Unlike the radically Romantic works also appearing at the time, Dahl softens his landscape, introducing elements of genre painting by imbuing it with anecdotal materials: In the background a wisp of smoke rises from a cabin, perhaps the home of the hunter on the snow-covered field.” Thanks to Sagen's recommendations and to his own personal charm, Dahl soon gained access to the leading social circles in Copenhagen.\n\nDahl took part in annual art exhibitions in Copenhagen beginning in 1812, but his real breakthrough came in 1815, when he exhibited no fewer than 13 paintings. Prince Christian Frederik of Denmark, who developed an early interest in Dahl's artistic genius and saw to it that his works were purchased for the royal collection, became a lifelong friend and patron of the artist.\n\nIn 1816 C. W. Eckersberg returned from abroad with his paintings of Roman settings; Dahl was impressed at once, and they became good friends and exchanged pictures. Dahl's 1817 painting Den Store Kro i Fredensborg marked the real beginning of his lifelong production of oil paintings depicting natural subjects.\n\nAfter his success in Copenhagen, Dahl realized that he wanted to live as an independent, self-supporting artist. One challenge facing him was that the academic preference of the day was for historical paintings with moral messages. Landscapes were considered the lowest kind of art, and perhaps even not as art at all, but as a purely mechanical imitation of nature. The only landscapes that could be considered art, according to the academy, were ideal, imaginary landscapes in pastoral or heroic styles. In accordance with this reigning taste, Dahl attempted to give his Danish themes a certain atmospheric character in order to lift them up above what was considered a merely commercial level. But at the same time it was his deepest wish to provide a more faithful picture of Norwegian nature than were offered by the old-fashioned, dry paintings of Haas and Lorentzen. This desire was partly motivated by homesickness and patriotism, but it was also suited to the public taste of the day for “picturesque” works.\n\nDahl traveled to Dresden in September 1818. He arrived with introductions to the city's leading citizens and to major artists such as Caspar David Friedrich, who helped him establish himself there and became his close friend. One critic has written: “Friedrich's still, meticulously executed landscapes - products of an art informed by his strict Protestant upbringing and a seeking for the divine in nature - were justifiably famous by the time he and Dahl became acquainted. We are able to see his Two Men Contemplating the Moon (1819), which ranks among his greatest works, and features two \"Rückfiguren,\" or figures seen from behind, solemnly and companionably gazing at a young sickle moon from the edge of an old forest. 'Greifswald in Moonlight' (1816–17) depicts the artist's birthplace in Pomerania, on the Baltic coast: bathed in an even, gauzy moonlight, the ancient university town assumes an almost ethereal appearance.”\n\nFriedrich was fourteen years Dahl's elder and an established artist, but the two found in each other a shared love for nature and a shared enthusiasm for a way of depicting nature that was based on the study of nature itself rather than on the academic cliches that they both profoundly despised. One writer has put it this way: “A warm and sociable character, he soon met and became friendly with the more introverted and reclusive Friedrich, recording how they once walked together in the park of the Grösser Garten among 'many lovely trees of different kinds, and the moon looked beautiful behind the dark fir trees.'”\n\nTogether with Friedrich and Carl Gustav Carus, Dahl would become one of the Dresden painters of the period who exerted a decisive influence on German Romantic painting.\n\nIn Dresden, as in Copenhagen, Dahl traveled around the area to draw subjects that could be of use to him in larger works that would be painted later in his atelier. He wrote to Prince Christian Frederik in 1818 that “most of all I am representing nature in all its freedom and wildness.” Dahl found enough material in the Dresden area to supply motifs for his paintings, but he continued to paint imaginary landscapes with forests, mountains, and waterfalls. One such painting, completed in 1819, entitled Norsk fjellandskap med elv (Mountainous Norwegian landscape with river”), garnered great attention among younger artists who considered the striking natural quality of the painting a breath of fresh air on Dresden's stagnant art scene. Another monumental waterfall painting, completed the next year, was lavished with praised by the critic for Kunstblatt who said that Dahl was greater than Jacob van Ruisdael. Dahl was accepted into the Dresden academy in 1820.\n\nPrince Christian Frederik wrote to Dahl in 1820 from Italy and invited him to join him at the Gulf of Naples. Dahl was at the time courting a young woman named Emilie von Bloch, but felt he should take the prince up on his offer, so he married Emilie quickly and traveled to Italy the next day. He ended up spending 10 months in Italy. Though he missed his bride, the sojourn was a decisive factor in his artistic development. It was in Italy, with its strong southern light, that Dahl's art truly flowered. It forced him to see nature plain, without the mediation of the old masters' renderings of light and color.\n\nDahl went to Rome in February 1821. He spent a great deal of time visiting museums, meeting other artists, and painting pictures to sell. In addition to painting sights in Rome and pictures of the Gulf of Naples, he painted landscapes inspired by the mountains of Norway. Dahl said that not until he was in Rome did he truly appreciate Norwegian nature. In June 1821 Dahl returned north to Emilie and a quiet life of family and painting.\n\nDahl quickly became a member of Dresden's leading circles of poets, artists, and scientists, among them the archeologist C. A. Böttiger, publisher of Artistisches Notizenblatt, who ran a major article on Dahl in 1822.\n\nAs a member of the academy, Dahl always dedicated his time to young artists who sought him out. In 1824 he and Friedrich were named “extraordinary professors” who had no chair but who received a regular salary. In 1823 Dahl moved in with Friedrich, so that many of his students, such as Knud Baade, Peder Balke, and Thomas Fearnley, were equally influenced by both artists. “Well before their meeting,” writes one critic, “Dahl had also painted a number of 'moonlights' and, travelling in Europe, he was in the Bay of Naples in 1821 when Mount Vesuvius was active. Here he painted 'Boats on the Beach Near Naples', where fishing crafts lie at anchor in the calm, shimmering waters with the twin peaks of the mountain smoking and flaming behind. Predictably, after his close association with Friedrich began—the two families shared a house in Dresden from 1823—he was considerably influenced by him, but his own more spontaneous and painterly style soon prevailed. Clients sometimes commissioned pictures from them both, a tranquil coastal scene by Friedrich to pair with a more stormy subject from Dahl.”\n\nDahl never formed a “school” around himself, but rather preferred for his students to cultivate their own styles; it was against his principles and his respect for artistic freedom to try to inhibit his students' individuality. It was this impulse toward individuality that later caused him to turn down an offer of a permanent chair at the academy – he didn't want to feel compelled to show up for class when he was busy working on a painting.\n\nDahl continued his studies of nature in the area around Dresden when he had the time, or on longer trips which provided him with themes for his paintings. But most often he painted the view of the Elbe outside his windows in various kinds of light. Like John Constable, Dahl felt that the sky was an important part of a landscape painting, and he never grew tired of watching the clouds move over the flat plain. One critic has compared two paintings of Friedrich and Dahl: “In...Dahl's 'Mother and Child by the Sea', there are echoes of Friedrich's 'Woman by the Sea' (1818). Whereas in Friedrich's work a woman dressed for the windy weather sits idly watching five fishing boats sailing past, in Dahl's picture, there seems to be a more personal note, with echoes of his own upbringing in a seafaring community, as the mother and small child eagerly await the return of the little ship from the sea.” The same critic has written about one of his paintings of Dresden: “Dahl also commemorated the magnificent Baroque buildings of his adopted city, and a version of his View of Dresden by Moonlight (1838) has travelled from the National Museum of Art, Architecture, and Design in Oslo. This small picture, measuring only 18.5 x 34.5 cm, shows the dome of the Frauenkirche and the tower of the Hofkirche dominating the skyline; silvers and deep blue combine to give it a wonderful jewel-like effect, together with a certain elegiac quality, perhaps indicative of the artist's awareness that his long friendship with Friedrich was nearing an end.”\n\nAs Dahl wrote in 1828 to the director of the Dresden academy, he found the area around Dresden useful for nature studies, but the “real thing” was always missing; that was something he could only find in his mountainous homeland. He viewed himself as a “more Nordic painter” with a “love for seacoasts, mountains, waterfalls, sailboats, and pictures of the sea in daylight and moonlight.” He longed to return to Norway, but not until 1826 was he able to make a journey home.\n\nHe made subsequent trips to Norway in 1834, 1839, 1844, and 1850, mostly exploring and painting the mountains, leading to the monumental works Fortundalen (1836) and Stalheim (1842). During his visits to Norway he received “an enthusiastic welcome as a painter of renown.”\n\nA critic notes Dahl's late stylistic changes: “In his late Fjord at Sunset (1850), based on studies made earlier, free and adventurous brush strokes represent the cloud-swept sky and broken surface of the water. Here he has moved far away from the purity and intensity of Friedrich's oeuvre.”\n\nIn 1827 Emilie Dahl died in childbirth while having their fourth child, and two years later two of the older children died of scarlet fever. In January 1830, Dahl married his student Amalie von Bassewitz, but she, too, died in childbirth in December of that same year. Dahl was crushed, and many months passed before he was able to paint again. Some years later this youngest child also died, leaving Dahl with two surviving children, Siegwald and Caroline, who married the Norwegian minister Anders Sandøe Ørsted Bull 1848.\n\nDahl's trip to Norway in 1850 would be his last. He was aging and weak, but continued to paint landscapes in the mountains. This last journey to his homeland resulted in several magnificent works, including Måbødalen, Fra Stugunøset, and Hjelle i Valdres.\n\nDahl was among the founding fathers of the National Gallery of Norway (Norwegian: Nasjonalgalleriet), now the National Museum of Art, Architecture, and Design, and donated his own art collection to the institution. Together with Johan Sebastian Welhaven, Frederik Stang, and Henrik Heftye, he founded the Art Society in Oslo (Oslo Kunstforening).\n\nDahl died after a brief illness and was buried on 17 October 1857 in Dresden. In 1902, a statue of Dahl by Norwegian sculptor Ambrosia Tønnesen (1859–1948) was erected on the facade of the West Norway Museum of Decorative Art in Bergen. In 1934, his remains were brought back to Norway and buried in the cemetery of St. Jacob's Church (Sankt Jakob kirke) in Bergen.\n\nJ.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century. His Romantic yet naturalistic interpretations of Norwegian scenery were greatly admired in Norway as well as on the European continent, particularly in Denmark and Germany."}, {"url": "https://www.metmuseum.org/art/collection/search/441967", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}, {"url": "https://www.sothebys.com/en/auctions/ecatalogue/2004/19th-century-european-paintings-including-german-austrian-hungarian-slavic-paintings-the-orientalist-sale-and-the-scandinavian-sale-l04100/lot.302.html", "page_content": "Johan Christian Dahl\n\n\n\nThe following three lots, each from a different private collection, shed light on Dahl's working practices and the subjects that inspired him during his first hectic decade in Germany.\n\n\n\nThe 1820s for Dahl were a period of great artistic ferment that ended in domestic tragedy. After finishing his studies in Denmark in 1818, on his move to Dresden Dahl's circumstances underwent rapid change. In Copenhagen he had been taught at the Academy by the highly respected C.A. Lorentzen (see previous lot). On his arrival in Dresden he quickly immersed himself in the artistic life of the city. Among the many and varied friendships that he struck up there, one of his earliest acquaintances was Caspar David Friedrich (see lot 26). Through Friedrich Dahl also befriended the painter Carl Gustav Carus (see lot 27). Early in 1820 he was elected as a member of the Dresden Academy, and in June the same year he married the young Emilie von Bloch. The following day, however, he journeyed alone to Italy where he remained for a year, staying in both Rome and Naples. Among the many works he painted there, he executed lot 303, Nordic Landscape by a Lake, in 1820 and recorded the scene that would result in the completion of lot 302, Ruins near Baia, two years later. Following his return to Dresden, Caroline, his first child, was born in 1822, and in 1823, the year that his wife gave birth to his son Alfred, he and his young family began sharing a house with Friedrich. In 1824 he became Professor Extraordinary at the Academy in Dresden, and in 1825 his second daughter, Marie, was born. In search of fresh material for his northern landscapes, Dahl returned to Norway for the first time in fifteen years in 1826. By the time that he had painted lot 304, View from Krokkleiva, in 1828, however, his domestic happiness had been struck a cruel blow. His wife Emilie died in 1827 following the birth of his fourth child Siegwald. Then, two years later both his middle children, Alfred and Marie died of scarlet fever. After re-marrying in 1830, his second wife died in childbirth the same year, their child, Harald, dying in 1835.\n\n******* text for lot 302 below *******\n\nDahl mentions the present work in Fortegnelse over mine Arbeider (the small notebook in which the artist recorded his works between 1817 and 1823) in an entry for February 1822: 'The rising moon - landscape with the ruins of Nero's bath by Bajae [sic] - a small cabinet piece' (Bang, p. 132).\n\n\n\nDuring his travels to Naples in 1820, Dahl noted in his diary, 'From the 1st to the 4th of December I have been on a trip with Ritmester Schvitzzer, to Ischia - Prosita - Bajae - and Potsolo - see beautiful things both from Antiquity and in Nature' (Bang, p. 132). It was during this trip that Dahl executed a pencil study for the present work, now in the archives of the National Gallery of Oslo (NG. Inv. No. B8036)."}, {"url": "https://artvee.com/artist/martinus-rorbye/", "page_content": "Martinus Christian Wesseltoft Rørbye was a Danish painter, known both for genre works and landscapes. He was a central figure of the Golden Age of Danish painting during the first half of the 19th century.\n\nThe most traveled of the Danish Golden Age painters, he traveled both north to Norway and Sweden and south to Italy, Greece and Constantinople. He was also the first Danish painter to take to painting in Skagen at the northern top of Jutland, almost half a century before the thriving community of Skagen Painters formed and came to fame, through Michael Ancher, Anna Ancher and P.S. Krøyer.\n\nMartinus Rørbye was born in Drammen in Norway on 17 May 1803 to Danish parents Ferdinand Henrik Rørbye and his wife Frederikke Eleonore Catherine de Stockfleth. Martinus was not inclined to schooling, but in 1820 started his studies at the Royal Danish Academy of Fine Arts at 17 years of age. He studied under Christian August Lorentzen and Christoffer Wilhelm Eckersberg, a strong influence on a generation of artists during the Danish Golden Age. Rørbye was a favorite student of Eckersberg, and they formed a close association. He took to Eckersberg's careful attention to nature and his strivings to capture details realistically. He was also greatly influenced by Lorentzen's use of color.\n\nHe won the Academy's small silver medal in 1824, and the large silver medal in 1828. He competed for the gold medal and won a cash prize. In 1829 he won the small gold medal for his painting Christ healing the blind, which remains in the ownership of the Royal Danish Academy. He never won the large gold medal in spite of repeated attempts.\n\nView from the Artist's Window, is a painting by a young Rørbye around 1825, heralding the many travels he would later make with its depiction of a caged bird in an open window, on the border between the safety of his parents' home and the wide, unknown world represented by a berthed ship.\n\nRørbye first exhibited his paintings at Charlottenborg in 1824 and would do so almost every year until 1848. His works were modestly priced, and he found sufficient buyers for his pieces. The majority of his works in the 1820s consisted of views from Copenhagen and the island of Zealand, although he also painted a number of portraits including one of Lorentzen, his painting instructor.\n\nTwice, in 1830 and 1832, he traveled to Norway. On the first of these journeys he visited Jutland on the way, a rare destination for painters at that time. On 31 May 1830 he went to Århus on the paddle steamer Dania. Another passenger on the ship was Hans Christian Andersen and the two artists decided to travel together for a while. From Århus they went north, staying at the Rosenholm, Clausholm and Tjele estates. After that, Rørbye and Andersen parted with Rørbye, continuing to the remote and seldom-visited Thy province of north-western Jutland to visit relatives in Thisted. From his journals it can be concluded that he found the place deeply exotic, making detailed sketches and notes of everything from women's costumes and markets to the scenery. However, he found the landscape unsuitable for painting due to the lack of trees. On 7 July he left Thisted bound for Norway.\n\nIn Norway he painted landscapes under the influence of Johan Christian Dahl and Caspar David Friedrich.\n\nIn 1834 Rørbye received a travel scholarship from the Academy on account of his talents as a portraitist. He traveled by way of the Netherlands and France to Rome, In Paris he met Peter Andreas Heiberg, August Bournonville and the French painter Jean Auguste Dominique Ingres.\n\nWhen he arrived in Rome, he joined the city's thriving Danish artists community which had Bertel Thorvaldsen as its central figure. A Group of Danish Artists in Rome, is a painting depicting the artist in Rome, painted by Constantin Hansen. Rørbye is number two from the left sitting behind Bindesbøll who is lying on the floor with a fez he often wore after their visit to Constantinople. Also appearing in the picture are the painter himself, Marstrand, Küchler, Blunck and Jørgen Sonne, sitting on the table.\n\nIn Italy he traveled to Sorrento, the Sabine Mountains, and Sicily. The following year Rørbye traveled to Athens accompanied by the architect Michael Gottlieb Bindesbøll, one of the compatriots he had met in Rome. From there they continued to Constantinople in the Ottoman Empire, a rare adventure in those days. He sketched prodigiously during his travels.\n\nIn 1837 he returned home to Copenhagen. His excellent orientalist studies from these exotic locales brought him the Danish public's attention. The Academy, recognizing the excellence of his work during his travels, invited him to apply for membership by submitting a painting. His task was to create a Turkish folk scene. His motif came from a study of a Caravan near Smyrna. It was finished in 1838 and he was unanimously voted into the Academy. His studies from Greece and Turkey continued to serve as the basis for his creative output. In this regard he admired the work of French painter Horace Vernet.\n\nThat same year at the Spring Exhibition he received the Exhibition Medal, the first time it had been given out, for a painting of a scene outside the Kılıç Ali Pasha Complex, A Turkish notary witnesses a marriage contract. Typical of Rørbye are the rich colours and careful attention to detail.\n\nHe married Rose Frederikke Schiøtt on 29 August 1839. His health was not good, however, and that same autumn he traveled again to Italy in the hope of renewing his strength. He painted \"Torvet i Amalfi\" (\"The plaza in Amalfi\") during this stay, and it was exhibited in 1842. He returned home in 1841.\n\nHe gave private painting lessons to Christen Dalsgaard, and in 1844 became professor at the Academy's school of modelling. His health deteriorated, and he died on 29 August 1848 in Copenhagen, leaving his young wife widowed and with several small children. She exhibited twelve of his paintings, mostly of Italian subjects, in 1849."}, {"url": "https://www.wikiart.org/en/christian-august-lorentzen", "page_content": "Christian August Lorentzen (10 August 1749 – 8 May 1828) was a Danish painter. He was the instructor of Martinus Rørbye.\n\n\n\nChristian August Lorentzen was born on 10 August 1749 as the son of a watchmaker. He arrived in Copenhagen around 1771 where he frequented the Royal Academy of Fine Arts but it is unclear whether he received formal training. From 1779 to 1782 he went abroad to develop his skills, visiting the Netherlands, Antwerp and Paris where he copied old masters. In 1792 he traveled to Norway to paint prospects.\n\n\n\nIn a number of painting, such as Slaget på Reden (1801, Danish Museum of National History) and Den rædsomste nat (1807, Danish National Gallery), he documented key events from the English Wars between 1801 and 1814. Later in his career he mainly painted portraits, landscapes and scenes from Ludvig Holberg's comedies.\n\n\n\nAs a professor at the Royal Academy in Copenhagen from 1803 and until his death in 1828, he exercised great influence on the next generation of painters such as Martinus Rørbye among others.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://www.sothebys.com/en/auctions/ecatalogue/2010/19th-century-european-paintings-including-german-austrian-and-central-european-paintings-the-orientalist-sale-spanish-painting-and-the-scandinavian-sale-l10101/lot.212.html", "page_content": "Description\n\nJ. C. Dahl\n\nUtsyn fra Feigumfossen I Lysterfjorden (View of the Feigumfoss in Lysterfjord)\n\noil on canvas\n\n42 by 57.7cm., 16½ by 22¾in.\n\nProvenance\n\nAcquired by the family of the present owner by 1920\n\nExhibited\n\nPossibly, Dresden, Sächsischer Kunstverein, 1848, no. 484 (as Norwegische Landschaft)\n\nLiterature\n\nMarie Lødrup Bang, Johan Christian Dahl, 1788-1857. Life and Works, Oslo, 1987, vol. 2, pp. 322-23, no. 1083, catalogued; vol. 3, pl. 462, no. 1083 (the afterdrawing illustrated)\n\nCondition\n\nOriginal canvas. There are a few scattered spots of minor reotuching visible under ultraviolet light, notably to a small repair to the right of the bottom of the waterfall (patched on the reverse) and several spots in the lower right quadrant. Apart from very fine scattered craquelure, and light stretcher marks to the upper and right edges, this work is in very good condition, with rich colours and fine detail, and ready to hang.\n\n\"In response to your inquiry, we are pleased to provide you with a general report of the condition of the property described above. Since we are not professional conservators or restorers, we urge you to consult with a restorer or conservator of your choice who will be better able to provide a detailed, professional report. Prospective buyers should inspect each lot to satisfy themselves as to condition and must understand that any statement made by Sotheby's is merely a subjective, qualified opinion. Prospective buyers should also refer to any Important Notices regarding this sale, which are printed in the Sale Catalogue.\n\nNOTWITHSTANDING THIS REPORT OR ANY DISCUSSIONS CONCERNING A LOT, ALL LOTS ARE OFFERED AND SOLD AS IS\" IN ACCORDANCE WITH THE CONDITIONS OF BUSINESS PRINTED IN THE SALE CATALOGUE.\"\n\nCatalogue Note"}, {"url": "https://www.metmuseum.org/art/collection/search/439364", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}], "Johan Christian Dahl went to Dresden in 1818 to study with Caspar David Friedrich.": [{"url": "https://www.metmuseum.org/art/collection/search/438159", "page_content": "Use your arrow keys to navigate the tabs below, and your tab key to choose an item\n\nLava, fire, and steam spew from the caldera of Mount Vesuvius above the Bay of Naples. Depicted from behind, a pair of finely attired visitors on their Grand Tour view the event up-close. Their guides and donkeys wait patiently in the foreground at the lower right. The Eruption of Vesuvius is a striking depiction of a force of nature that animated the European imagination after 1748, when Pompeii, buried by the eruption of 79 AD, was rediscovered. A few years later, Edmund Burke described major natural phenomena that inspire a sense of awe as “Sublime” in his treatise A Philosophical Enquiry into the Origin of our Ideas of the Sublime and Beautiful (1757). The text became foundational to the incipient Romantic era. By the early nineteenth century, visitors to Italy traveled south from Rome to Naples not only to see the city and its glorious Mediterranean setting, but with the hope of witnessing an eruption like the one depicted here.[1]\n\n\n\nThis painting was commissioned in 1821 by Dahl’s most important patron, Danish Crown Prince Christian Frederik, the future King Christian VIII, who eventually acquired eighteen works by the Norwegian artist. A longtime territory of Denmark’s, Norway received its own constitution in 1814, but ambitious Norwegians typically sojourned in Copenhagen to develop their skills after reaching the limits of educational possibilities in their still-provincial country. Dahl left his native Bergen in 1811, studying for seven years with the landscape painter Christian August Lorentzen (1749–1828) at the Royal Academy of Fine Art. It was there that Dahl first gained the attention of Christian Frederik. In 1818, Dahl moved to Dresden, where Christian Frederik visited him in the spring of 1819, en route to Italy. In May 1820, Dahl received an invitation to join the prince, who offered to cover his expenses. The painter left Dresden on June 13 and arrived at the palace of Quisisana, above Castellammare on the Bay of Naples, on August 11. He remained in Italy for ten months, leaving from Rome on June 21, 1821.\n\n\n\nVesuvius erupted on December 20, 1820, and Dahl ascended the volcano as quickly as he could to observe the phenomenon on the spot. The next day he painted a sketch, or study, to record what he had seen. On July 13, 1824, Christian Frederik wrote to Dahl, expressing pleasure that the artist was working on a painting of Vesuvius for him, which “judging from the sketch, cannot fail to impress.” This was presumably the sketch that Dahl executed immediately after the eruption, which Christian Frederik could have seen in Naples, or afterward, in Rome. That sketch is probably the one now in the Statens Museum for Kunst, Copenhagen, which is signed and dated December 24, 1820 (Bang 1987, no. 257). Dahl exhibited the present work in the Dresden Academy’s annual exhibition in 1824. It was delivered to the patron in January 1825 and exhibited at the Danish Academy’s annual exhibition in Copenhagen later that year.\n\n\n\nDahl painted two versions of this composition before he left Italy. One, dated February 21, 1821, is also in the Statens Museum (Bang 296). Another was produced in Rome in 1821 for the Prussian consul, Jacob Bartholdi, and is now in the KODE Art Museums, Bergen (Bang 316). There are at least four other versions, dated 1826 (Städel Museum, Frankfurt; Bang 510), 1845 (whereabouts unknown, Bang 1032), what may be a copy after the present work possibly executed by 1832 (Nasjonalmuseet, Oslo; Bang 1254), and another, possibly datable about 1820–24 (private collection, Salten, Norway, in 1987; Bang 1284).\n\n\n\nThere are two related drawings, a study of ships in the bay, dated “24 Octbr 1820,” and a study of the man to the right by the flames, signed, dated, and inscribed “Prof. Friedrich’s Figur. Dahl 1824.” (Nasjonalmuseet, Oslo, inv. nos. B 2600 and B 2726).\n\n\n\nThis entry is based on Bang 1987, vol. 1, pp. 50–63, 175–77, and pages noted above as well as under References.\n\n\n\nAsher Miller 2019\n\n\n\n[1] See Lucio Fino, Vesuvius and the Grand Tour: Vedute and Travel Memoirs from the 17th to the 19th Centuries, trans. Angela Federico, Naples, 2012."}, {"url": "https://www.nga.gov/collection/art-object-page.110104.html", "page_content": "In 1811 Johan Christian Dahl moved from his native Bergen to Copenhagen, where the twenty-three-year-old landscape painter studied in the Academy of Fine Arts. Dahl combined an interest in Dutch seventeenth-century landscape painters such as Jacob van Ruisdael and Allart van Everdingen with the influence of the crisply observed Roman landscape views of his contemporary Christoffer Wilhelm Eckersberg, whose work he discovered in Copenhagen. Dahl remained a specialist in landscapes, painting open-air oil studies, finished views, and imaginary landscapes based on memory and on the work of his Dutch predecessors. In 1818 Dahl traveled south, spending two years in Dresden, where he fell under the strong influence of the German romantic landscape painter Caspar David Friedrich. At the invitation of the Danish prince Christian Frederick, Dahl traveled to Rome and Naples, where he painted oil sketches and finished views of Italian sites. In 1821 he returned to Dresden, remaining for the rest of his life and sharing a house with Friedrich. Dahl made frequent trips to Norway and Denmark, and exhibited regularly in Copenhagen.\n\nView from Vaekerø near Christiania was painted in Dresden in January 1827, after one of Dahl's trips to Norway (he had visited Christiania, present-day Oslo, the previous summer). An annotated landscape drawing dated June 1826 survives (National Gallery, Oslo), showing the ship and nets hanging out to dry at Vaekerø. The painting is infused with a melancholy, nocturnal mood frequently found in the art of Friedrich, and the repertoire of romantic motifs--cloud-covered moon, rocky inlet, misty hills, haunting ship riding at anchor, drying nets, and the couple contemplating the nocturnal scene--can also be found in the great German painter's works. Indeed Dahl owned one of Friedrich's most characteristic and comparable landscapes, Two Men Contemplating the Moon, which he sold to the Royal Picture Gallery in Dresden in 1840. View from Vaekerø near Christiania is one of Dahl's most Friedrich-like landscapes, and as such is a highly typical example of romantic landscape painting of the Dresden school. For all that it was painted from memory, it has a remarkably fresh feeling for nature, especially in the subtle effects of light modulated by clouds, mist, and reflections. It was commissioned from Dahl by the Hamburger Kunstverein, an artists' cooperative and exhibiting society in Hamburg, Germany, where it was exhibited in 1827 and purchased by a Norwegian collector, Jacob All.\n\n(Text by Philip Conisbee, published in the National Gallery of Art exhibition catalogue, Art for the Nation, 2000)"}, {"url": "https://artvee.com/artist/johan-christian-dahl/", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Bergenhus Fortress in Bergen.\n\nDahl came from a simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller [no], whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nDahl held that a landscape painting should not just depict a specific view, but should also say something about the land's nature and character – the greatness of its past and the life and work of its current inhabitants. The mood was often idyllic, often melancholy. When he added snow to a landscape he painted in the summer, it was not to show the light and colors of snow; it was to use snow as a symbol of death. As one critic has put it, “Unlike the radically Romantic works also appearing at the time, Dahl softens his landscape, introducing elements of genre painting by imbuing it with anecdotal materials: In the background a wisp of smoke rises from a cabin, perhaps the home of the hunter on the snow-covered field.” Thanks to Sagen's recommendations and to his own personal charm, Dahl soon gained access to the leading social circles in Copenhagen.\n\nDahl took part in annual art exhibitions in Copenhagen beginning in 1812, but his real breakthrough came in 1815, when he exhibited no fewer than 13 paintings. Prince Christian Frederik of Denmark, who developed an early interest in Dahl's artistic genius and saw to it that his works were purchased for the royal collection, became a lifelong friend and patron of the artist.\n\nIn 1816 C. W. Eckersberg returned from abroad with his paintings of Roman settings; Dahl was impressed at once, and they became good friends and exchanged pictures. Dahl's 1817 painting Den Store Kro i Fredensborg marked the real beginning of his lifelong production of oil paintings depicting natural subjects.\n\nAfter his success in Copenhagen, Dahl realized that he wanted to live as an independent, self-supporting artist. One challenge facing him was that the academic preference of the day was for historical paintings with moral messages. Landscapes were considered the lowest kind of art, and perhaps even not as art at all, but as a purely mechanical imitation of nature. The only landscapes that could be considered art, according to the academy, were ideal, imaginary landscapes in pastoral or heroic styles. In accordance with this reigning taste, Dahl attempted to give his Danish themes a certain atmospheric character in order to lift them up above what was considered a merely commercial level. But at the same time it was his deepest wish to provide a more faithful picture of Norwegian nature than were offered by the old-fashioned, dry paintings of Haas and Lorentzen. This desire was partly motivated by homesickness and patriotism, but it was also suited to the public taste of the day for “picturesque” works.\n\nDahl traveled to Dresden in September 1818. He arrived with introductions to the city's leading citizens and to major artists such as Caspar David Friedrich, who helped him establish himself there and became his close friend. One critic has written: “Friedrich's still, meticulously executed landscapes - products of an art informed by his strict Protestant upbringing and a seeking for the divine in nature - were justifiably famous by the time he and Dahl became acquainted. We are able to see his Two Men Contemplating the Moon (1819), which ranks among his greatest works, and features two \"Rückfiguren,\" or figures seen from behind, solemnly and companionably gazing at a young sickle moon from the edge of an old forest. 'Greifswald in Moonlight' (1816–17) depicts the artist's birthplace in Pomerania, on the Baltic coast: bathed in an even, gauzy moonlight, the ancient university town assumes an almost ethereal appearance.”\n\nFriedrich was fourteen years Dahl's elder and an established artist, but the two found in each other a shared love for nature and a shared enthusiasm for a way of depicting nature that was based on the study of nature itself rather than on the academic cliches that they both profoundly despised. One writer has put it this way: “A warm and sociable character, he soon met and became friendly with the more introverted and reclusive Friedrich, recording how they once walked together in the park of the Grösser Garten among 'many lovely trees of different kinds, and the moon looked beautiful behind the dark fir trees.'”\n\nTogether with Friedrich and Carl Gustav Carus, Dahl would become one of the Dresden painters of the period who exerted a decisive influence on German Romantic painting.\n\nIn Dresden, as in Copenhagen, Dahl traveled around the area to draw subjects that could be of use to him in larger works that would be painted later in his atelier. He wrote to Prince Christian Frederik in 1818 that “most of all I am representing nature in all its freedom and wildness.” Dahl found enough material in the Dresden area to supply motifs for his paintings, but he continued to paint imaginary landscapes with forests, mountains, and waterfalls. One such painting, completed in 1819, entitled Norsk fjellandskap med elv (Mountainous Norwegian landscape with river”), garnered great attention among younger artists who considered the striking natural quality of the painting a breath of fresh air on Dresden's stagnant art scene. Another monumental waterfall painting, completed the next year, was lavished with praised by the critic for Kunstblatt who said that Dahl was greater than Jacob van Ruisdael. Dahl was accepted into the Dresden academy in 1820.\n\nPrince Christian Frederik wrote to Dahl in 1820 from Italy and invited him to join him at the Gulf of Naples. Dahl was at the time courting a young woman named Emilie von Bloch, but felt he should take the prince up on his offer, so he married Emilie quickly and traveled to Italy the next day. He ended up spending 10 months in Italy. Though he missed his bride, the sojourn was a decisive factor in his artistic development. It was in Italy, with its strong southern light, that Dahl's art truly flowered. It forced him to see nature plain, without the mediation of the old masters' renderings of light and color.\n\nDahl went to Rome in February 1821. He spent a great deal of time visiting museums, meeting other artists, and painting pictures to sell. In addition to painting sights in Rome and pictures of the Gulf of Naples, he painted landscapes inspired by the mountains of Norway. Dahl said that not until he was in Rome did he truly appreciate Norwegian nature. In June 1821 Dahl returned north to Emilie and a quiet life of family and painting.\n\nDahl quickly became a member of Dresden's leading circles of poets, artists, and scientists, among them the archeologist C. A. Böttiger, publisher of Artistisches Notizenblatt, who ran a major article on Dahl in 1822.\n\nAs a member of the academy, Dahl always dedicated his time to young artists who sought him out. In 1824 he and Friedrich were named “extraordinary professors” who had no chair but who received a regular salary. In 1823 Dahl moved in with Friedrich, so that many of his students, such as Knud Baade, Peder Balke, and Thomas Fearnley, were equally influenced by both artists. “Well before their meeting,” writes one critic, “Dahl had also painted a number of 'moonlights' and, travelling in Europe, he was in the Bay of Naples in 1821 when Mount Vesuvius was active. Here he painted 'Boats on the Beach Near Naples', where fishing crafts lie at anchor in the calm, shimmering waters with the twin peaks of the mountain smoking and flaming behind. Predictably, after his close association with Friedrich began—the two families shared a house in Dresden from 1823—he was considerably influenced by him, but his own more spontaneous and painterly style soon prevailed. Clients sometimes commissioned pictures from them both, a tranquil coastal scene by Friedrich to pair with a more stormy subject from Dahl.”\n\nDahl never formed a “school” around himself, but rather preferred for his students to cultivate their own styles; it was against his principles and his respect for artistic freedom to try to inhibit his students' individuality. It was this impulse toward individuality that later caused him to turn down an offer of a permanent chair at the academy – he didn't want to feel compelled to show up for class when he was busy working on a painting.\n\nDahl continued his studies of nature in the area around Dresden when he had the time, or on longer trips which provided him with themes for his paintings. But most often he painted the view of the Elbe outside his windows in various kinds of light. Like John Constable, Dahl felt that the sky was an important part of a landscape painting, and he never grew tired of watching the clouds move over the flat plain. One critic has compared two paintings of Friedrich and Dahl: “In...Dahl's 'Mother and Child by the Sea', there are echoes of Friedrich's 'Woman by the Sea' (1818). Whereas in Friedrich's work a woman dressed for the windy weather sits idly watching five fishing boats sailing past, in Dahl's picture, there seems to be a more personal note, with echoes of his own upbringing in a seafaring community, as the mother and small child eagerly await the return of the little ship from the sea.” The same critic has written about one of his paintings of Dresden: “Dahl also commemorated the magnificent Baroque buildings of his adopted city, and a version of his View of Dresden by Moonlight (1838) has travelled from the National Museum of Art, Architecture, and Design in Oslo. This small picture, measuring only 18.5 x 34.5 cm, shows the dome of the Frauenkirche and the tower of the Hofkirche dominating the skyline; silvers and deep blue combine to give it a wonderful jewel-like effect, together with a certain elegiac quality, perhaps indicative of the artist's awareness that his long friendship with Friedrich was nearing an end.”\n\nAs Dahl wrote in 1828 to the director of the Dresden academy, he found the area around Dresden useful for nature studies, but the “real thing” was always missing; that was something he could only find in his mountainous homeland. He viewed himself as a “more Nordic painter” with a “love for seacoasts, mountains, waterfalls, sailboats, and pictures of the sea in daylight and moonlight.” He longed to return to Norway, but not until 1826 was he able to make a journey home.\n\nHe made subsequent trips to Norway in 1834, 1839, 1844, and 1850, mostly exploring and painting the mountains, leading to the monumental works Fortundalen (1836) and Stalheim (1842). During his visits to Norway he received “an enthusiastic welcome as a painter of renown.”\n\nA critic notes Dahl's late stylistic changes: “In his late Fjord at Sunset (1850), based on studies made earlier, free and adventurous brush strokes represent the cloud-swept sky and broken surface of the water. Here he has moved far away from the purity and intensity of Friedrich's oeuvre.”\n\nIn 1827 Emilie Dahl died in childbirth while having their fourth child, and two years later two of the older children died of scarlet fever. In January 1830, Dahl married his student Amalie von Bassewitz, but she, too, died in childbirth in December of that same year. Dahl was crushed, and many months passed before he was able to paint again. Some years later this youngest child also died, leaving Dahl with two surviving children, Siegwald and Caroline, who married the Norwegian minister Anders Sandøe Ørsted Bull 1848.\n\nDahl's trip to Norway in 1850 would be his last. He was aging and weak, but continued to paint landscapes in the mountains. This last journey to his homeland resulted in several magnificent works, including Måbødalen, Fra Stugunøset, and Hjelle i Valdres.\n\nDahl was among the founding fathers of the National Gallery of Norway (Norwegian: Nasjonalgalleriet), now the National Museum of Art, Architecture, and Design, and donated his own art collection to the institution. Together with Johan Sebastian Welhaven, Frederik Stang, and Henrik Heftye, he founded the Art Society in Oslo (Oslo Kunstforening).\n\nDahl died after a brief illness and was buried on 17 October 1857 in Dresden. In 1902, a statue of Dahl by Norwegian sculptor Ambrosia Tønnesen (1859–1948) was erected on the facade of the West Norway Museum of Decorative Art in Bergen. In 1934, his remains were brought back to Norway and buried in the cemetery of St. Jacob's Church (Sankt Jakob kirke) in Bergen.\n\nJ.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century. His Romantic yet naturalistic interpretations of Norwegian scenery were greatly admired in Norway as well as on the European continent, particularly in Denmark and Germany."}, {"url": "https://www.nasjonalmuseet.no/en/collection/object/NG.M.02891", "page_content": "It was landscape painting that captured Dahl’s imagination, and in Copenhagen he spent much of his time studying nature and the city’s art collections, where he copied seventeenth-century Dutch landscape paintings. He articulated early on his artistic programme: to further the great European legacy, but in the context of nature. When Dahl left Copenhagen in 1818 to travel around Europe, his first stop was in Dresden, one of the principal centres of German romanticism. One of the city’s leading artists, the unorthodox landscape painter Caspar David Friedrich, soon became Dahl’s close friend.\n\nDahl made several field trips to various regions around Dresden, and View from Bastei features the Elbe Valley in Saxony Switzerland. To highlight the region’s breathtaking nature, Dahl centred his composition on a trio of visitors standing on a rock that protrudes from a lofty cliff. Even though the painting was created in a studio, its vivid colours and atmospheric effects have the air of a nature study. The lighting and the sky have been closely observed, and the landscape is portrayed in great detail. Dahl’s realistic approach to painting landscapes – what he dubbed “the natural path” – diverges from his colleague Friedrich’s more abstract landscapes and their symbolic overtones, which in the 1820s would gradually influence how Dahl himself portrayed nature.\n\nText: Bodil Sørensen\n\nFrom \"Highlights. Art from Antiquity to 1945\", Nasjonalmuseet 2014, ISBN 978-82-8154-088-0"}, {"url": "https://matthiesengallery.com/artist/dahl-johan-christian", "page_content": "1788 - 1857\n\nPlace Born Bergen\n\nPlace Died Dresden\n\nBio\n\nBorn in Bergen Norway, and trained at the Copenhagen Academy, Dahl nonetheless spent most of his working career in Germany. He is thus claimed by all three schools for their own, although it was his influence on the latter that was more important, as from 1824 until his death he held the senior professorship of art at the Dresden Academy. His memories of his homeland, however, provided him with themes that he reused throughout his career, but it was his attention to nature and use of the plein-air sketch that earned him the Dresden appointment in preference to Friedrich.\n\nDahl entered the Copenhagen Academy in 1811, as a pupil of C. A Lorentzen, an undistinguished painter who had looked at Vernet and concentrated on exaggerated mountainous views. It was Jens Juel, however, and Dahl\u0092s exposure to the sketches and paintings made by Eckersberg on his foreign travels, that persuaded him to make use of plein-air sketches, essential to his artistic formation. The young painter also took advantage of his access to the Danish royal collection, strong in the work of Dutch 17th century artists, which led him to appreciate the Nordic landscapes of Jacob v. Ruisdael and Albert v. Everdingen, both of whom influenced his approach to the natural world. In 1818, after leaving the Academy, he made his first trip to Dresden, where he became acquainted with the work of Caspar David Friedrich, whose use of religious symbols in landscape settings also affected Dahl, even though the younger artist was to temper this with stronger naturalism.\n\nLike so many painters, he felt bound to undertake an Italian trip, spending a few months in Rome where he joined the German and Danish expatriates in exploring the Roman Campagna and the Amalfi coast. Upon his return he was appointed to the Dresden Academy where he taught a whole generation of German painters, and continued his relationship with the many Danish artists who passed through on their journey to and from Italy. Dahl, however, like Friedrich, was also as much interested in the \u0091spirit of nature\u0092 as natural phenomena, and in his admiration for \u0091honest\u0092 naïvety (in the words of Franz Pforr) there was no \u0091virtuoso brush-work, no bold handling was to be seen; everything presented itself simply, like something frown rather than painted.\u0092 Nonetheless \u0091in his conception of landscape he was a pure naturalist, seizing on the details of rocks and trees and plants and meadows with quite extraordinary mastery; working with amazing facility, but leaving much to chance, he often seemed to surrender himself to the objective\u0092 (Carus, writing of Dahl). Dahl may be compared with Constable in that both saw landscape as a means of recording moods and impressions, but they lack the bravura of the English master and Dahl was uninterested in experimenting with technique in order to achieve a particular effect of light. In terms of technique his approach was conventional, but nonetheless it was fresh and direct. Dahl was himself a substantial collector who never lost touch with his homeland; indeed, after his death he bequeathed his collection to the Norwegian capital, Oslo, where it provided the basis for the Norwegian National Gallery."}, {"url": "https://www.metmuseum.org/art/collection/search/440407", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}, {"url": "https://www.christies.com/en/lot/lot-5032382", "page_content": "Born in Bergen, Norway, Johann Dahl studied at the Copenhagen Academy, where he was influenced very much by Christoffer Wilhelm Eckersberg's emphasis on direct study from nature and by Dutch landscape painting of the 17th century. In 1818 he travelled to Dresden, where he befriended the Great German Romantic, Caspar David Friedrich, who was 14 years his senior. The two artists collaborated closely, sharing a house together with their families, and becoming both recognized as authorities on cultural questions throughout Northern Europe.\n\n\n\nDahl's paintings are more naturalistic and less meditative than those of his friend. This is clearly evident in the present work, which combines the influence of Dutch artists such as Jacob Ruisdael, obvious in the treatment of the waterfall and the motifs on the left of the composition (see fig. 1) and the more dominating mass of pine trees on the right, which are typical of Dahl and Friedrich's Prussian landscapes. As is frequent in Romantic works of this type, human activity is defined by a humble and subservient position relative to the natural world.\n\n\n\nThe present work was painted in the Liebethaler Grund, a narrow and picturesque valley that was a favourite source of inspiration in the 19th century for painters, poets, writers, and composers, including Karl Blechen, Hans Christian Andersen, and Richard Wagner; it was known as the gateway to Saxon Switzerland, a mountainous region near Dresden, nowadays a national park. Dahl and Friedrich painted there frequently throughout the 1820s, and the lush beauty of the surroundings sometimes encouraged Friedrich to paint in a style closer to the naturalism of his younger friend - with fresher greens, and slightly looser brushstrokes (see fig. 2).\n\n\n\nUntraced since the 19th century, the present work has hitherto been known only from a lithograph and a tiny pencil sketch (see Bang, op. cit., vol. iii, plate 202). The early provenance, unclear to Professor Bang in her monograph on the artist, can now be properly established due to the dating of the painting to 1825.\n\n\n\nWe are grateful to Professor Marie Lødrup Bang for confirming the authenticity of this work.\n\n"}, {"url": "https://www.sothebys.com/en/auctions/ecatalogue/2012/european-paintings/lot.27.html", "page_content": "Description\n\nJ. C. Dahl\n\nLandscape in Evening Light\n\noil on panel\n\n18 by 22.5cm., 7 by 9in.\n\nProvenance\n\nMrs. von der Decken, Dresden (a gift from the artist in Christmas 1853)\n\nGalleri Bellman, Oslo\n\nPrivate Collection (acquired from the above in 1981; sale: Sotheby's, New York, 24 January 2008, lot 83)\n\nPurchased at the above sale by the present owner\n\nExhibited\n\nCambridge, Massachusetts, Harvard University Art Museums, on loan 1981-2002 & 2004-7\n\nLiterature\n\nMarie Lodrup Bang, Johan Christian Dahl, 1788-1857: Life and Works, Oslo, 1987, vol. II, p. 341, no. 1150, catalogued (incorrectly as on canvas); vol. III, pl. 495, illustrated\n\nCondition\n\nThe panel is slightly bowed convex along the left and right edges. Under UV light there are some very minor scattered retouchings, notably in the extreme upper left and the dark land below the horizon. Overall this work is in good condition, clean and ready to hang. Held in a simple gold-painted carved wood frame.\n\n\"In response to your inquiry, we are pleased to provide you with a general report of the condition of the property described above. Since we are not professional conservators or restorers, we urge you to consult with a restorer or conservator of your choice who will be better able to provide a detailed, professional report. Prospective buyers should inspect each lot to satisfy themselves as to condition and must understand that any statement made by Sotheby's is merely a subjective, qualified opinion. Prospective buyers should also refer to any Important Notices regarding this sale, which are printed in the Sale Catalogue.\n\nNOTWITHSTANDING THIS REPORT OR ANY DISCUSSIONS CONCERNING A LOT, ALL LOTS ARE OFFERED AND SOLD AS IS\" IN ACCORDANCE WITH THE CONDITIONS OF BUSINESS PRINTED IN THE SALE CATALOGUE.\"\n\nCatalogue Note"}, {"url": "https://www.metmuseum.org/art/collection/search/438417", "page_content": "Use your arrow keys to navigate the tabs below, and your tab key to choose an item\n\nTitle: Two Men Contemplating the Moon Artist: Caspar David Friedrich (German, Greifswald 1774–1840 Dresden)\n\nDate: ca. 1825–30 Medium: Oil on canvas Dimensions: 13 3/4 x 17 1/4 in. (34.9 x 43.8 cm) Classification: Paintings Credit Line: Wrightsman Fund, 2000 Accession Number: 2000.51\n\nCaspar David Friedrich was born in Greifswald, a small town on the Baltic Sea. After studying at the Copenhagen Art Academy, in 1798 he settled in Dresden, then a center of the German Romantic movement. From the beginning of his career, Friedrich favored the subject of landscape, drawing his motifs mainly from two regions in Germany: the mountains of the Riesengebirge and of Bohemia as well as the northern Baltic coast and the island of Rügen. Friedrich began to paint in oils on canvas in 1807. Although he earned professional success, including royal patronage, his meditative, often barren landscapes, rich in spiritual associations, challenged and perplexed many of his contemporaries. Indeed, during the 1820s his pictures began to lose favor with a public who preferred the faithfully rendered scenes of the younger generation of artists of the Düsseldorf School. Friedrich died in poverty and near obscurity in Dresden. (See Börsch-Supan and Jähnig 1973, pp. 11–12, and Werner Hofmann, ed., Caspar David Friedrich, 1774–1840: Kunst um 1800, exh. cat., Kunsthalle, Hamburg, 1974, pp. 83–88.) With time, however, he came to be recognized as one of the most important figures of German Romanticism and as a guiding light to fellow artists, most notably the Norwegian painter Johan Christian Dahl (1788–1857).\n\n\n\nThis work, painted about 1830, is the third variant of one of Friedrich’s most cited and reproduced paintings. In the first version, a rust-brown haze envelops sky and landscape, creating a nocturnal mood (1819, Dresden Gemäldegalerie; see Notes). In the second version, the two protagonists are a man and a woman, and the sky is changed to a rose-mauve dusk (ca. 1824, Nationalgalerie, Berlin; see Notes). Here, Friedrich retained the luminosity of the Berlin canvas yet reintroduced the two male figures found in the Dresden composition. Infrared photographs have established that Friedrich made no underdrawings, and his painting is so fluid that the forms appear less detailed than in the other two versions. Suffused with rose-mauve light, the present scene conveys the greatest sense of serenity.\n\n\n\nContemporary sources have identified the two men as the forty-five-year-old Friedrich and his talented colleague, the twenty-five-year-old August Heinrich (1794–1822). They pause on their evening walk through a late autumnal forest to contemplate the sinking moon and Venus, the evening star. The mood of piously shared contemplation relates to the fascination with the moon experienced in poetry, literature, philosophy, and music of the time. Both figures are seen from the back so that the viewer can identify with their communion with nature, in which the Romantics saw a manifestation of the sublime. They follow in the tradition of the wanderers who, as personifications of restless yearning, roam through Romantic novels, poems, and music.\n\n\n\nBoth men’s attire—the beret and cape of the figure on the right and the cap and coat of the one on the left—conform to the Old German dress code that had been adopted in 1815 by radical German students. These students opposed the ultraconservative policies being enforced in the wake of the Napoleonic Wars. The staunchly patriotic Friedrich deliberately ignored the 1819 royal degree that forbade this dress, seen as a type of “demagogues’ uniform,” and continued to show his figures in Old German costume until his death.\n\n\n\nThis composition is unusual for Friedrich in that it is asymmetrical, and the landscape relatively crowded. Symbol-laden elements line the winding forest path: the evergreen fir tree, a dead oak, a rock, and a large broken-off branch. The landscape is imaginary, as is the juxtaposition of the emblematic oak, fir, rock, and branch; they are, however, based on precise studies after nature that Friedrich had made in various regions at different times and combined here in a single composition (see Notes). The widely diverging interpretations accorded to this small picture—pagan, nature-mystical, political, or exclusively Christian—tend to obliterate its simple yet deeply contemplative mood (Werner Busch, \"Zu Verständnis und Interpretation romantischer Kunst,\" in Werner Busch et al., Romantik, 1987, pp. 19–29; expanded in Werner Busch, Caspar David Friedrich: Ästhetik und Religion, 2003, pp. 172–85).\n\n\n\n[2014; adapted from Rewald 2005]\n\nDr. Otto Friedrich Rosenberg, Dresden (by 1840–d. 1850; acquired from the artist in exchange for medical attention); his daughter, Theophila Minna Rosenberg, Dresden (by 1850–presumably until d. 1882); by descent through the Rosenberg family, Wuppertal-Barmen, later Hamburg, to Gottfried Spiegler, Glinde (until 1999; sale, Christie's, London, October 7, 1999, no. 10, for £771,500 [approx. $1,277,000] to Artemis); [Artemis Fine Arts, New York, 1999–2000; sold to The Met]\n\nDortmund. Museum für Kunst und Kulturgeschichte. \"Caspar David Friedrich: Winterlandschaften,\" 1990, no. 37 (as \"Zwei Männer in Betrachtung des Mondes,\" lent by a private collector, Hamburg).\n\n\n\nNew York. The Metropolitan Museum of Art. \"Caspar David Friedrich: Moonwatchers,\" September 11–November 11, 2001, no. 3 (as \"Two Men Contemplating the Moon [Zwei Männer in Betrachtung des Mondes\"]).\n\n\n\nNew York. The Metropolitan Museum of Art. \"The Philippe de Montebello Years: Curators Celebrate Three Decades of Acquisitions,\" October 24, 2008–February 1, 2009, online catalogue.\n\n\n\nNew York. The Metropolitan Museum of Art. \"Apollo's Muse: The Moon in the Age of Photography,\" July 3–September 22, 2019, unnumbered cat. (colorpl. 44).\n\n\n\nTHIS WORK MAY NOT BE LENT, BY TERMS OF ITS ACQUISITION BY THE METROPOLITAN MUSEUM OF ART.\n\n\n\n\n\nJohan Christian Dahl. Letter to Dresden Gëmaldegalerie. September 26, 1840 [published in Christie's sale cat., October 7, 1999, p. 19], remarks that Friedrich made several copies of the Dresden picture.\n\n\n\nWerner Sumowski. Caspar David Friedrich-Studien. Wiesbaden, 1970, p. 179, fig. 395, mentions it as a replica of the Dresden picture; as in a private collection of a family in Wuppertal-Barmen to whose ancestor, Fritz von Rosenberg, Friedrich gave it.\n\n\n\nHelmut Börsch-Supan and Karl Wilhelm Jähnig. Caspar David Friedrich: Gemälde, Druckgraphik und bildmässige Zeichnungen. Munich, 1973, pp. 356, 415–16, no. 366, ill. (color), as \"Zwei Manner in Betrachtung des Mondes\" in a private collection at Wuppertal-Barmen.\n\n\n\nHans-Werner Grohn in Werner Hofmann. Caspar David Friedrich, 1774–1840. Exh. cat., Hamburger Kunsthalle. Munich, 1974, p. 227.\n\n\n\nHelmut Börsch-Supan. L'opera completa di Friedrich. Milan, 1976, p. 105, no. 182, ill., calls it \"Due uomini davanti alla luna\" and dates it about 1829; as in a private collection in Wuppertal-Barmen; states that, according to family tradition, Friedrich gave it to his doctor Fritz von Rosenberg.\n\n\n\nJohn Leighton in Caspar David Friedrich: Winter Landscape. Exh. cat., National Gallery. London, 1990, pp. 41, 70 [German ed., Heidelberg, pp. 136, 138, no. 37, ill. (color)].\n\n\n\nGary Tinterow and Sabine Rewald in \"Recent Acquisitions, A Selection: 1999–2000.\" Metropolitan Museum of Art Bulletin 58 (Fall 2000), p. 36, ill. (color), call it the second of three works on this theme and note that in this version Friedrich is thought to have painted it in remembrance of his favorite student, August Heinrich, who had died recently; remark that the images of the fir, gnarled oak, and rising moon are subject to interpretation.\n\n\n\nSabine Rewald. Caspar David Friedrich: Moonwatchers. Exh. cat., The Metropolitan Museum of Art. New York, 2001, pp. 7, 18–19, 31, 33–35, no. 3, ill. (color, overall and detail on cover), calls it \"Two Men Contemplating the Moon (Zwei Männer in Betrachtung des Mondes),\" dates it about 1830, one of two versions Friedrich painted of the work in Dresden and the one more like the original; remarks that it retains the luminosity of the Berlin version, yet reintroduces the complicity between the figures of the Dresden painting; notes that there is no underdrawing.\n\n\n\nRoberta Smith. \"The Primly Austere, and Occasionally Dark Side of the Moon.\" New York Times (September 14, 2001), p. E30, ill.\n\n\n\nPhilippe de Montebello in Sabine Rewald. Caspar David Friedrich: Moonwatchers. Exh. cat., The Metropolitan Museum of Art. New York, 2001, p. 6.\n\n\n\nKasper Monrad in Sabine Rewald. Caspar David Friedrich: Moonwatchers. Exh. cat., The Metropolitan Museum of Art. New York, 2001, pp. 23, 27.\n\n\n\nSabine Rewald in The Wrightsman Pictures. Ed. Everett Fahy. New York, 2005, pp. 342–45, no. 96, ill. (color).\n\n\n\nSabine Rewald in Masterpieces of European Painting, 1800–1920, in The Metropolitan Museum of Art. New York, 2007, pp. 17, 249, no. 15, ill. (color and black and white).\n\n\n\nKathryn Calley Galitz. The Metropolitan Museum of Art: Masterpiece Paintings. New York, 2016, pp. 430, 443, no. 328, ill. pp. 340, 430 (color).\n\n\n\nMia Fineman in Apollo's Muse: The Moon in the Age of Photography. Exh. cat., The Metropolitan Museum of Art. New York, 2019, pp. 74, 176, 183 n. 8, colorpl. 44, ill. p. 6 (color detail).\n\n\n\nKnut Ljøgodt. Peder Balke, Sublime North: Works from the Gundersen Collection. Milan, 2020, p. 54, fig. XXII (color).\n\n\n\n\n\nThere are multiple versions of this composition in addition to The Met's picture:\n\n\n\nTwo Men Contemplating the Moon, 1819. Oil on canvas, 13 3⁄4 × 17 1⁄2 in. (35 × 44.5 cm), Gemäldegalerie Neue Meister, Staatliche Kunstsammlungen Dresden. Friedrich gave this version (the first) to his friend and upstairs neighbor, Johan Christian Dahl, in exchange for one of Dahl’s works. Dahl kept the picture, of which Friedrich made two more versions, until Friedrich’s death, when he sold it to the Dresden Gemäldegalerie.\n\n\n\nMan and Woman Contemplating the Moon, ca. 1824. Oil on canvas, 13 3⁄8 × 17 3⁄8 in. (34 × 44 cm), Nationalgalerie, Staatliche Museen zu Berlin. A second version, previously dated 1830–35 by Börsch-Supan; whereabouts before 1935 unknown.\n\n\n\nTwo Men Contemplating the Moon, of unknown date. Oil on canvas, 13 3⁄8 × 17 in. (34 × 43 cm). A fourth version or copy. Galerie Hans, Hamburg (in 2001).\n\n\n\nThere are also two related drawings:\n\n\n\nStudies of Two Trees, April 25, 1809. Pencil, 12 1⁄2 × 10 1⁄8 in. (31.7 × 25.7 cm). Kupferstich-Kabinett, Staatliche Kunstsammlungen Dresden.\n\n\n\nBare Oak Tree, May 3, 1809. Pencil, 14 1⁄8 × 10 3⁄8 in. (36 × 25.9 cm). Nasjonalgalleriet, Oslo."}, {"url": "https://www.wikiart.org/en/johan-christian-dahl", "page_content": "Johan Christian Claussen Dahl (24 February 1788 – 14 October 1857), often known as J. C. Dahl or I. C. Dahl, was a Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian Painter ever to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\n\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. Indeed, if one sets aside his own monumental artistic creations, his other activities on behalf of art, history, and culture would still have guaranteed him a place at the very heart of the artistic and cultural history of Norway. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Håkonshallen in Bergen.\n\n\n\nDahl came from a very simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\n\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller (no), whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\n\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}]}