{"Johan Christian Dahl was inspired by the art of the Norwegian 'golden age' of the 17th century, the Dutch Golden Age and the German Romanticism.": [{"url": "https://artsandculture.google.com/entity/johan-christian-dahl/m06p68x?hl=en", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally.\n\nShow less Read more Wikipedia"}, {"url": "https://www.metmuseum.org/art/collection/search/438159", "page_content": "Use your arrow keys to navigate the tabs below, and your tab key to choose an item\n\nLava, fire, and steam spew from the caldera of Mount Vesuvius above the Bay of Naples. Depicted from behind, a pair of finely attired visitors on their Grand Tour view the event up-close. Their guides and donkeys wait patiently in the foreground at the lower right. The Eruption of Vesuvius is a striking depiction of a force of nature that animated the European imagination after 1748, when Pompeii, buried by the eruption of 79 AD, was rediscovered. A few years later, Edmund Burke described major natural phenomena that inspire a sense of awe as “Sublime” in his treatise A Philosophical Enquiry into the Origin of our Ideas of the Sublime and Beautiful (1757). The text became foundational to the incipient Romantic era. By the early nineteenth century, visitors to Italy traveled south from Rome to Naples not only to see the city and its glorious Mediterranean setting, but with the hope of witnessing an eruption like the one depicted here.[1]\n\n\n\nThis painting was commissioned in 1821 by Dahl’s most important patron, Danish Crown Prince Christian Frederik, the future King Christian VIII, who eventually acquired eighteen works by the Norwegian artist. A longtime territory of Denmark’s, Norway received its own constitution in 1814, but ambitious Norwegians typically sojourned in Copenhagen to develop their skills after reaching the limits of educational possibilities in their still-provincial country. Dahl left his native Bergen in 1811, studying for seven years with the landscape painter Christian August Lorentzen (1749–1828) at the Royal Academy of Fine Art. It was there that Dahl first gained the attention of Christian Frederik. In 1818, Dahl moved to Dresden, where Christian Frederik visited him in the spring of 1819, en route to Italy. In May 1820, Dahl received an invitation to join the prince, who offered to cover his expenses. The painter left Dresden on June 13 and arrived at the palace of Quisisana, above Castellammare on the Bay of Naples, on August 11. He remained in Italy for ten months, leaving from Rome on June 21, 1821.\n\n\n\nVesuvius erupted on December 20, 1820, and Dahl ascended the volcano as quickly as he could to observe the phenomenon on the spot. The next day he painted a sketch, or study, to record what he had seen. On July 13, 1824, Christian Frederik wrote to Dahl, expressing pleasure that the artist was working on a painting of Vesuvius for him, which “judging from the sketch, cannot fail to impress.” This was presumably the sketch that Dahl executed immediately after the eruption, which Christian Frederik could have seen in Naples, or afterward, in Rome. That sketch is probably the one now in the Statens Museum for Kunst, Copenhagen, which is signed and dated December 24, 1820 (Bang 1987, no. 257). Dahl exhibited the present work in the Dresden Academy’s annual exhibition in 1824. It was delivered to the patron in January 1825 and exhibited at the Danish Academy’s annual exhibition in Copenhagen later that year.\n\n\n\nDahl painted two versions of this composition before he left Italy. One, dated February 21, 1821, is also in the Statens Museum (Bang 296). Another was produced in Rome in 1821 for the Prussian consul, Jacob Bartholdi, and is now in the KODE Art Museums, Bergen (Bang 316). There are at least four other versions, dated 1826 (Städel Museum, Frankfurt; Bang 510), 1845 (whereabouts unknown, Bang 1032), what may be a copy after the present work possibly executed by 1832 (Nasjonalmuseet, Oslo; Bang 1254), and another, possibly datable about 1820–24 (private collection, Salten, Norway, in 1987; Bang 1284).\n\n\n\nThere are two related drawings, a study of ships in the bay, dated “24 Octbr 1820,” and a study of the man to the right by the flames, signed, dated, and inscribed “Prof. Friedrich’s Figur. Dahl 1824.” (Nasjonalmuseet, Oslo, inv. nos. B 2600 and B 2726).\n\n\n\nThis entry is based on Bang 1987, vol. 1, pp. 50–63, 175–77, and pages noted above as well as under References.\n\n\n\nAsher Miller 2019\n\n\n\n[1] See Lucio Fino, Vesuvius and the Grand Tour: Vedute and Travel Memoirs from the 17th to the 19th Centuries, trans. Angela Federico, Naples, 2012."}, {"url": "https://www.wikiart.org/en/johan-christian-dahl", "page_content": "Johan Christian Claussen Dahl (24 February 1788 – 14 October 1857), often known as J. C. Dahl or I. C. Dahl, was a Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian Painter ever to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\n\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. Indeed, if one sets aside his own monumental artistic creations, his other activities on behalf of art, history, and culture would still have guaranteed him a place at the very heart of the artistic and cultural history of Norway. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Håkonshallen in Bergen.\n\n\n\nDahl came from a very simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\n\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller (no), whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\n\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://theramblinglife.com/spotlight/2020/11/18/the-golden-age-of-norwegian-painting", "page_content": "Changing Conception of Beauty:\n\nIf you were to take a survey of what people think the most beautiful country in Europe is, it would not be surprising if Norway would rank high amongst the answers. Just google the same question and it’s hard to find any list that doesn’t include the Scandinavian nation. Yet, if you were to turn back the clock by four hundred years and ask the same question again, there would likely be no mention of Norway. If anything the idea that the northern country would be considered beautiful would have been seen as utterly bizarre.\n\nSince Norway hasn’t dramatically transformed in the last four centuries, at least as far as I know, why are the two opinions so discordant? The answer is in the eye of the beholder. Aesthetic values change over time. We’ve all seen how drastically fashion changes every decade or so, what was hip one day becomes unfashionable the next. Most other aesthetic considerations changed through time as well, even if few can keep up with the breakneck pace the world of apparel devours through different styles. In fact, through most of human history, aesthetic tastes changed slowly, driven in large part by shifts in the underlying conditions of the world people live in. But even our appreciation of something as everlasting and unchanging as nature has transformed radically through the ages. In fact, for medieval people, wild untamed nature was not something to be thought of as beautiful.\n\nLooking up to an imposing mountain pass with steep walls of pure rock hanging over a green valley or watching a nature documentary of some remote lush jungle forest you may ask yourself how anyone could not think nature to be beautiful. What you may not take into account is that once you’re done staring at the awe-inspiring view you can simply get in your car and drive away. Or even more easily, when watching a great nature documentary narrated by a soothing British voice on Tv, you can click a little red button at the top of your remote and be done with nature for the day. That was obviously not the case for someone living at the turn of the first millennium.\n\nA mountain crossing for a man of the middle ages was a dreadful task, with chances of landslides, snowstorms, or even a simple fall, all of which could result in death. Lush woods meant predators. Powerful rivers meant drowning. You wouldn’t calmly watch a storm rolling in if you were concerned with the very likely possibility of a flood. To the medieval man, simply put, nature meant danger, not beauty. It is hard to appreciate something when you’re scared it can damage your livelihood or even kill you. Beauty, by contrast, was something safe, something man-made and which man could control."}, {"url": "https://fahrenheitmagazine.com/en/modern-art/plastics/jc-dahl-the-father-of-norwegian-painting", "page_content": "JC Dahl is recognized as the father of Norwegian painting. His artistic career is the story of how the wild nature of Norway found his expression in art.\n\nHis motifs allowed both foreigners and Norwegians to become familiar with a landscape that was previously unknown to them. With his brushstrokes, it was possible to admire nature instead of fearing it.\n\nWith his romantic approach and strong feelings of national identity, Dahl fostered a completely new understanding of the distinctive, dazzling and powerful character of the untamed Norwegian wilderness. In this way, Dahl defined the very image of Norway.\n\nBorn in Bergen, Norway, in 1788 amid crushing poverty.\n\nDahl's early training was as a house painter and decorative artist in his native town, from which some views he painted at this time are known.\n\nIt didn't take long for people to notice his talent and a group of wealthy citizens raised money that allowed him to travel to Copenhagen in 1811 to study at the art academy, since there was no academy in Norway in those days, not until 1909.\n\nProfessor CA Lorentzen (1746-1828) was his teacher, although the poetic landscapes of Jens Juell (1745-1802) made a greater impression on the young Dahl.\n\nHowever, it was the study of XNUMXth century Dutch landscapes in Danish collections that really helped him move towards his goal of becoming the modern interpreter of the landscape of Norway.\n\nIn this first phase of his career he was already painting Nordic-type landscapes inspired by the old Dutch masters, but he also painted and drew directly from life. His paintings attracted attention and in Copenhagen found both a clientele and friends for life, where the German landscape painter Casper DavidFriedrich.\n\nIn the fall of 1818, Dahl left Copenhagen since his intention was to make a study trip to the most important cultural centers of Europe. However, it did not go beyond Dresden, where he married and settled for the rest of his life.\n\nThere, he devoted himself to his true-to-nature Nordic landscapes that brought a breath of fresh air to mainstream art circles. Dresden.\n\nmust have learned something Copenhagen, because he emerged painting in the then elegant romantic mode, lots of stormy skies and moonlight.\n\nOn the other hand, he never acquired some of the usual painter skills, especially portraiture, which was how most XNUMXth-century painters made a living.\n\nTaking advantage of his close friendship with the great German romantic painter CD Friedrich, drew on his influence from his art to enhance and create moonlit landscapes.\n\nIn June 1820 he traveled, somewhat reluctantly, to Italy to meet the danish prince Christian Fredrik and his entourage in Villa Quisisana, on the outskirts of Nápoles. That visit, accompanied by a group of German painters, helped him develop a new free style for making studies, a fundamental stage in his development as an artist and his way of perceiving nature.\n\nReturn to Dresden in July 1821 and in 1824, like Friedrich, and was appointed professor at the first Art academy in his country.\n\nIn 1826 he made a long study tour in Norway, his first visit there since leaving the country in 1811. In that time, he traveled great distances in the mountainous Southwest on horseback and on foot, and produced a large number of studies on which he went to base future paintings executed in his studio of Dresden.\n\nDahl visited Norway again in 1834, 1839, 1844 and 1850, and thus he was able to broaden the range of his norwegian theme.\n\nHe actively participated in promoting the preservation of historical monuments in Norway. Later in his life, he was also one of the founding fathers of the National Gallery and the Art Society of Christiania, both established in 1836.\n\nThe great painter died in Dresden in 1857."}, {"url": "https://www.metmuseum.org/art/collection/search/839044", "page_content": "Use your arrow keys to navigate the tabs below, and your tab key to choose an item\n\n\n\nThomas Fearnley was the foremost Norwegian landscape painter to follow in the naturalistic vein of his elder contemporary Johan Christian Dahl (1788–1857). An itinerant artist, Fearnley left Norway for the first time at the age of eighteen in 1821; for the remaining two decades of his life, he traveled all over Europe, returning to his native country intermittently. His final sojourn there lasted two years, from 1838 until 1840, when he married and moved to Amsterdam. In the summer of 1839, he visited his birthplace of Frederikshald. He set out from there on a sketching expedition in the western part of the country together with the Düsseldorf-based painters Andreas Achenbach (1815–1910) and Christian Breslauer (1802–1882). Staying in Balholm, about seventy miles northeast of Bergen, they passed through Graven, Valdres, Sogn (where they encountered Dahl), Voss, and Hardanger.[1]\n\n\n\nOn July 22, Fearnley made this plein-air study of mountains and plunging waterfalls at Gudvangen, situated at the end of the Nærøyfjord, where the Nærøydalselvi River empties into the fjord. He pushed his brush through the wet paint with demonstrable speed and assuredness, allowing the brush marks to convey the geological formations of the fjord’s walls. He then inscribed the place name, date, and his initials into the wet paint using the butt-end of his brush or another stylus. Although this is a sketch and not a finished picture, it is entirely characteristic of the subject matter with which Fearnley made his reputation during his brief life. Dahl praised Fearnley’s plein-air sketches: after the artist’s death he wrote that these were \"better than his finished paintings, for in them he gave of his true self, as he was and as he felt when face-to-face with nature.\"[2]\n\n\n\nAsher Miller 2020\n\n\n\n[1] \"Chronology\" in Ann Sumner and Greg Smith eds., In Front of Nature: The European Landscapes of Thomas Fearnley, exh. cat., Barber Institute of Fine Arts, Birmingham, 2012, p. 113.\n\n[2] Dahl’s letter to the Board of the Nationalgalleriet in Christiania (Oslo) after Fearnley’s death, originally published in Vedastine Aubert, \"Breve fra Thomas Fearnley til J. C. C. Dahl,\" Kunst og Kutur 12 (1925), pp. 2ff, as translated in David Jackson, \"Fearnley, Italy and the oil sketch tradition,\" in Sumner and Smith eds. 2012, pp. 56–57 n. 20; see also Marie Lødrup Bang, Johan Christian Dahl, 1788–1857: Life and Works, Oslo, 1987, vol. 1, p. 245."}, {"url": "https://www.metmuseum.org/art/collection/search/438954", "page_content": "Use your arrow keys to navigate the tabs below, and your tab key to choose an item\n\nJørgen Hansen Koch. Letter to Johan Christian Dahl. May 28, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605], states his wish to purchase a small painting as a gift for his wife, to cost no more than 30 to 40 Species, and to be picked up from the artist by Koch's sister-in-law.\n\n\n\nJohan Christian Dahl. Diary entry. June 12, 1830 [Universitetsbiblioteket, Oslo, Ms. 1001, 8°; excerpt published in English transl. in Bang 1987, vol. 2, p. 213 under no. 641], notes receipt and content of Koch's letter dated May 28, 1830.\n\n\n\nJohan Christian Dahl. Letter to Jørgen Hansen Koch. October 8, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], proposes selling two smaller paintings to Koch for 40 Species (for both, including frames), to be paid to the artist's friend Cancelliraad Thomsen; describes the subject of this picture as \"a coast in moonlight where a woman and her child are waiting for an approaching boat bearing a close relation\"; states that both paintings will be sent in a few days.\n\n\n\nJørgen Hansen Koch. Letter to Johan Christian Dahl. December 14, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], states that the pictures have arrived, that the sum has been paid, and that he and his wife are pleased with both paintings.\n\n\n\nJohan Christian Dahl. Einnahmen für die Jahre 1824–1855. December 29, 1830 [Universitetsbiblioteket, Oslo, Ms. Fol. 1882k; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], notes in his account book that \"Via Thomsen received from Justidsraad [Counsellor] Koch in Copenhagen for two pictures – 60 rd.\".\n\n\n\nCarl Reitzel. Fortegnelse over Danske Kunstneres Arbejder paa de ved det Kgl. Akademi for de Skjønne Kunster i Aarene 1807–1882 afholdte Charlottenborg-Udstillinger. Copenhagen, 1883, p. 107, lists it under Exh. Copenhagen 1831 as \"Maaneskinsstykke,\" with J. H. Koch as owner and P. Koch as the \"assessor\" [see Bang 1987].\n\n\n\nMarie Lødrup Bang. Johan Christian Dahl, 1788–1857: Life and Works. Oslo, 1987, vol. 1, pp. 82, 171, 202 n. 38; vol. 2, pp. 204, 213, 280, 376, no. 641; vol. 3, pl. 641, identifies this picture as probably the pendant described on the verso of an \"afterdrawing\" of the painting \"Autumn Landscape near Dresden\" (1829; private collection, Dresden; Bang no. 605) [see Provenance]; lists two related drawings (1826 and 1827; both Nasjonalgalleriet, Oslo), one of an anchor and the other of a woman and child on a beach; compares it to Friedrich's coastal landscapes, notably \"Evening on the Baltic\" (1826; Georg Schäfer Museum, Schweinfurt), based on another Dahl drawing of an anchor; mentions a variant of this picture (Barber Institute of Fine Arts, University of Birmingham; Bang no. 915) and an unsigned replica (private collection, Munich), possibly a student copy.\n\n\n\nSuzanne Ludvigsen. Danish Paintings of the Golden Age. Exh. cat., Artemis Fine Arts, Inc. New York, 1999, unpaginated, no. 16, ill. (color).\n\n\n\nSabine Rewald. Caspar David Friedrich: Moonwatchers. Exh. cat., The Metropolitan Museum of Art. New York, 2001, p. 50, no. 14, ill. (color), reproduces the studies for this picture.\n\n\n\nRichard Verdi. \"A Rediscovered 'Moonlight' by Johan Christian Dahl.\" Burlington Magazine 147 (February 2005), pp. 115–16, fig. 52, notes that the returning boat is presumably that of the child's father, adding \"since Dahl's father was himself a fisherman, this lends an unmistakably autobiographical note to the scene and makes it an unusually personal work in the artist's career.\" .\n\n\n\nPaul Spencer-Longhurst. Moonrise over Europe: JC Dahl and Romantic Landscape. Exh. cat., Birmingham Barber Institute of Fine Arts. London, 2006, pp. 41–43, 64, 66, 72, 74, 78, fig. 21 (color), suggests that the death of Dahl's two children in 1829 and his wife's pregnancy in 1830 inform the anecdotal nature of this picture with an element of pathos.\n\n\n\nSabine Rewald in \"Recent Acquisitions, A Selection: 2006–2007.\" Metropolitan Museum of Art Bulletin 65 (Fall 2007), p. 39, ill. (color).\n\n\n\nEsther Bell. \"Catalogue Raisonné of the Thaw Collection.\" Studying Nature: Oil Sketches from the Thaw Collection. Ed. Jennifer Tonkovich. New York, 2011, p. 114, no. 37, ill. (color), calls it \"Mother and Child by the Sea\".\n\n\n\n"}, {"url": "https://www.meisterdrucke.uk/artist/Johan-Christian-Dahl.html", "page_content": "Capturing the beauty of nature with oil paints on canvases was Johan Christian Dahl's purpose in life. Born in 1788 in Bergen, Norway, Dahl's life path was quickly clear.\n\nSoon at the age of 15 he began an apprenticeship in decoration and in 1811 he took up studies at the Copenhagen Academy of Art. In 1818, his path led the romantic landscape painter to Dresden. Here he was also part of the art academy in the early 1820s, although he had already moved on to Venice in 1820. In addition, Dahl made numerous trips through Central Europe, from Norway to Italy. This is also reflected in his works.\n\nDuring this time, he not only created the gorge in Saxon Switzerland, but also the coastal view near Castellamare or the mill in Liebethaler Grund. In Venice, Dahl refined his technique and met, among others, the Berlin painter Catel. A little later he moved back to Dresden. There he lived in the same house with one of the most famous German romantics. Dahl connected a lifelong friendship with Caspar David Friedrich.\n\nAmong Dahl's most famous works are not only his landscape paintings around Dresden, but also the barrow near Vordingborg in winter or the fjord near Holmestrand. Today, his paintings are exhibited in various Norwegian galleries but also in the Alte Nationalgalerie Berlin or the Neue Pinakothek Munich. © Meisterdrucke"}, {"url": "https://www.lifeinnorway.net/norwegian-art/", "page_content": "Ever wondered about the history of art in Norway, if Munch is the only famous Norwegian artist, or where the best places to see art in Norway are? Read on to find out!\n\nNorway is often considered to be the home of the Vikings – but it is also home to a spectacular collection of beautiful art just waiting to be experienced!\n\nThe story of Norwegian art\n\nThe word “art” can be used to describe lots of different things and activities, from music to literature, theatre to architecture, opera to interpretive dance, etc. This article is going to focus on art in the form of paintings, sculptures, carvings, crafts, etc.\n\nWhether you’re a proud aesthete or someone who just doesn’t feel their trip to Norway would be complete without seeing The Scream in person, we have everything you need to know about Norwegian art!\n\nPrehistoric Norwegian art\n\nThe oldest art in Norway comes from the stone age. Prehistoric art takes the form of petroglyphs (rock carvings) or pictographs (rock paintings) that depict activities of the time, such as hunting and fishing, as well as people and animals native to the area.\n\nAlta Rock Art\n\nHowever, historians remain unsure about what the purpose of this art was.\n\nThe Northern Norwegian municipality of Alta is home to the largest collection of prehistoric art in both Norway and Northern Europe. The Alta Rock Art consists of numerous petroglyphs and pictographs spread out across five main sites: Hjemmeluft, Kåfjord, Amtmannsnes, Storsternen and Transfarelv.\n\nThe Hjemmeluft petroglyphs can be visited as part of the Alta Museum. Unfortunately, the other sites are not open to the public, though they can be viewed online.\n\nAlta Rock Art\n\nThe Alta Rock Art is currently one of eight UNESCO World Heritage Sites in Norway, and the only prehistoric one. However, it is not the only place where you can find prehistoric art in Norway.\n\nWhile the majority of these are also inaccessible, some sites welcome visitors, including Bøla in Steinkjer (home to the famous Bøla reindeer), Ekeberg in Oslo and Solbakk in Rogaland.\n\nViking art\n\nYou might think that the only artistic activities the Vikings engaged in was occasionally grabbing their swords and “painting the town red” – but they also created art in the literal sense.\n\nWhile art today tends to be created purely to be admired, Viking art seemed to have been used to decorate functional objects. For example, doors were embellished with carvings, ship posts were whittled into the shape of animal heads, and even earspoons were embellished.\n\nA silver Viking earspoon from Sweden. Image: Swedish History Museum\n\nTherefore the best place to see Viking art is in museums that hold Viking artefacts. Luckily, we have a list of the best Viking museums in Norway with plenty of places for you to check out!\n\nThat said, the majority of Viking art we have today was made from materials that have survived the passage of time, such as stone, metal, wood, bone, etc.\n\nThere is some written evidence that Vikings created art for purely aesthetic purposes, such as tattoos and tapestries. However, since cloth, skin and paper biodegrade quickly, we are unlikely to find any examples of this type of Viking art today.\n\nA Viking runestone\n\nViking art tends to be categorised into six distinct styles, which are each named after the geographical location where the objects in this style were found:\n\nOseberg (approx. 9th century), named after artefacts found in Oseberg, Norway (including the Oseberg ship)\n\nBorre (approx. 9th – 10th century), named after artefacts from the Borre Mound Cemetery, Norway\n\nJellinge (approx. 10th century), named after artefacts found in Jellinge, Denmark\n\nMammen (approx. 10th – 11th century), named after artefacts from a burial mound in Mammen, Denmark\n\nRingerike (approx. 10th – 11th century), named after a type of stone used for carvings from Ringerike, Norway\n\nUrnes (approx. 11th century – 12th century), named after a stave church in Urnes.\n\nA timeline of art styles from the Viking Age. Image: Stefan Bollmann (CC)\n\n\n\nIt is important to remember that these styles were created retroactively by historians to group art styles by certain characteristics. The boundaries between them are not always clear cut.\n\nNorwegian folk art\n\nAlthough folk art is not a new concept, it was not recognised as “art” until the late nineteenth century.\n\nTraditionally, folk art refers to functional items that were decorated with certain motifs or using particular techniques. The people who created them had no formal training as artists or craftsmen; instead, the skills were handed down through generations.\n\nOne of the most recognisable types of Norwegian folk art is “rosemaling” (or “rose painting”), named after the floral designs that characterise the artwork. While rosemaling can be found all over Norway, it has its strongest roots in rural Eastern Norway, particularly in Hallingdal and Telemark.\n\n“Uvdal stave church, rose paint” by Frode Inge Helland, 2005 (CC)\n\nRosemaling is a relatively young form of folk art, developing in the eighteenth and nineteenth centuries. It was influenced by other popular European art styles of the time, including Baroque, Regency and Rococo, which is evident in the paintings’ colours and use of “S” and “C” curves.\n\nWhile rosemaling has general characteristics, each region developed their own style of painting, which often enables the artwork to be connected to a specific place, if you know what to look for.\n\nIn the eighteenth century, artists tended to be trained professionals from the cities. They would travel around Norway, providing their services where needed.\n\nPeople in rural areas would then try and copy this art, but did not have the training – nor the restrictions that came with it. Therefore, they were able to be much more creative with their designs, which allowed rosemaling to evolve into its own distinct style.\n\nOriginally, rosemaling was used to decorate items but, much like the vines and flowers they depict, the designs soon spread around the room to cover ceilings, doors, and walls.\n\nRosemaling went out of fashion in Norway in the late 19th century. However, it has since become increasingly popular among Americans with Scandinavian ancestry.\n\nIf you want to see original rosemaling for yourself in Norway, you should pay a visit to the Norwegian Museum of Cultural History in Oslo, which holds many buildings and objects decorated in this way.\n\n“Ølbolle” By Norsk Folkemuseum, 2014\n\nSámi art in Norway\n\nThe Sámi are the indigenous people to Norway, Sweden, Finland and Russia, with their own culture and language – and their own art.\n\nTraditional Sámi art combines functional objects, such as knives, cups, shoes and bags, with beautiful designs. In North Sámi, this type of handcraft is known as “duodji”.\n\nDuodji drinking cup and knife. Photo: Christopher Forster (CC)\n\nThe Sámi Dáiddamagasiidna (the Sámi Art Collection) holds a large collection of duodji and Sámi-produced art. While this collection is closed to the public, it lends its pieces to both the Sámi Parliament building and Sámiid Vuorká-Dávvirat (the Sámi Museum in Karasjok), which are open for visitors. The Várjjat Sámi Musea (the Varanger Saami Museum) also has a large collection of duodji on display.\n\nFamous Norwegian artists\n\nAlthough the people who live in Norway have clearly been creating art for a long time, Norwegian artists weren’t particularly well known until the Romantic period.\n\nRomanticism was a European cultural movement that lasted from the end of the 18th century to the mid 19th century, and impacted areas such as art, music and literature. It was driven by patriotism in the form of an idealised nostalgia for a “simpler time” and a focus on landscapes and nature – which can be particularly seen in art from the time.\n\nJohan Christian Dahl (1788-1857)\n\nJohan Christian Dahl was an artist who specialised in oil paintings of Scandinavian and German landscapes. Not only is he credited with kick-starting Norwegian romanticism, which peaked between 1840 and 1870, but he was also the first Norwegian painter to gain recognition abroad.\n\nView of Hønefossen by Johan Christian Dahl, 1847. Image: National Museum of Norway\n\nIn addition to creating artwork, Dahl also played a significant role in the preservation of existing artwork. He supported the National Museum of Art, Architecture and Design (now part of the new National Museum), helped establish the Fortidsminneforening (Society for the Preservation of Ancient Norwegian Monuments), and pushed for the restoration of old buildings, including Nidaros Cathedral in Trondheim.\n\nErik Werenskiold (1855-1938) and Theodor Kittelsen (1857-1917)\n\nErik Werenskiold and Theodor Kittelsen are the fairytale artists of Norway. Together, they illustrated numerous fairy tales from Asbjørnsen and Moe, giving faces to key characters in Norwegian folklore.\n\nRead more: A Fairy-Tale Traveller’s Guide to Norway\n\nFor Werenskiold, illustrating fairy tales seems to have been the exception in his artistic style. He was part of the naturalist (or realist) movement, and the majority of his art depicts the everyday life of ordinary people, often outdoors.\n\nNøkken som hvit hest (The Nøkk as a White Horse), Theodor Kittelsen, 1909\n\nKittelsen’s art also liked to focus on the outdoors and landscapes; however, he “fortrollet naturen” (made the natural unnatural) by incorporating fantastical elements into them, such as the Nøkk at Tårntjernet lake.\n\nChristian Krohg (1852-1925) and Oda Krohg (1860-1935)\n\nChristian and Oda Krohg were a married couple as well as famous painters in their own rights.\n\nThey were both members of “Kristiania-bohemene” (the Kristiana Bohemians), which was a group of Oslo-based academics, students, artists and writers. Edvard Munch was closely associated with this group for a time, and Christian Krohg acted as his mentor.\n\nOda Krohg, painted by Christian Krohg (CC) and Christian Krohg, painted by Oda Krohg (CC)\n\nNaturalism was a significant influence on Christian Krohg’s art, and the majority of his paintings are detailed depictions of people performing everyday tasks. Oda Krohg studied art under both Erik Werenskiold and Christian Krohg before marrying the latter.\n\nHowever, her work is considered to have helped establish the neo-romantic style in Norwegian art, particularly with “A Japanese Lantern”.\n\nEdvard Munch (1863-1944)\n\nUndoubtedly, the most famous Norwegian artist is Edvard Munch. Despite his success as an artist both in Norway and abroad, his life was characterised by unhappiness as he struggled with both his mental and physical health.\n\nThe Scream. Photo: Munch Museum\n\nHowever, the period in which he struggled the most is also when he produced his most famous artwork, including “The Scream” (originally called Der Schrei der Natur – The Scream of Nature).\n\nMunch actually painted four different versions of “The Scream”. The best known one, and the one that's part of Norway’s new National Museum collection, is the oil painting version from 1893.\n\nNikolai Astrup (1880-1928)\n\nNot to be confused with the politician of the same name, Nikolai Astrup was a Norwegian artist known for his use of vivid colours in his landscape depictions. His style has been compared to Munch’s – but happier.\n\nA vivid Nikolai Astrup painting\n\nAlthough he travelled all over Europe, he never lost his love of western Norway, where he had grown up. He later returned to settle down in the old Jølster municipality (now part of the Sunnfjord municipality), and the majority of his paintings were inspired by the mountains and valleys of this area.\n\nWhile Astrup’s work is famous in Norway, he has only recently achieved international recognition.\n\nBest Norwegian art museums\n\nNow that you know about some of Norway’s most famous artists, you need to know where you can see their (and other) famous artworks in person. There is a wide variety of art museums all over Norway, but here is a selection of our favourites:\n\nThe National Museum of Art, Architecture and Design, Oslo\n\nThe National Museum houses the largest collection of art in the Nordic countries, from contemporary pieces to well established classics, such as The Scream (though make sure you stand at a reasonable distance). While the museum is relatively new, it consists of some of the oldest art institutions in Norway, such as “Nasjonalgalleriet” (the National Gallery of Norway).\n\nThe new National Museum. Illustration: MIR Statsbygg\n\nThe National Museum is currently closed while its new venue is under construction at Vestbanen (Oslo West Station), and is due to reopen in 2022. However, you can browse all the art in its collection online.\n\nThe Munch Museum, Oslo\n\nWhile some of Munch’s work can be seen in other museums, the majority of his work is housed at the new Munch Museum, which opened in Oslo in October 2021.\n\nIf you’re a Munch enthusiast, or just happen to be in the area, you should pay a visit to Edvard Munch’s summer house in Åsgårdstrand, where he painted numerous famous works. There is also a virtual tour of the house available on the Munch Museum’s website.\n\nAstrup Fearnley Museum, Oslo\n\nThe Astrup Fearnley Museum is a private art collection that opened to the public in 1993 and moved to the shores of the Oslofjord at Tjuvholmen in 2012. It also frequently hosts contemporary art exhibitions from both Norwegian and international artists alike.\n\nThe KODE Art Museums and Composer Homes, Bergen\n\nKODE consists of seven buildings, of which four are dedicated to art and three are dedicated to the composers Edvard Grieg, Ole Bull and Harald Sæverud, respectively.\n\nInside KODE Bergen Art Museum in Norway\n\nThe four art museum buildings are numbered KODE 1-4 and each have a different focus, from the Golden Age of Norwegian art to the largest collection of Chinese china figurines in Norway.\n\nStavanger Art Museum, Stavanger\n\nThe Stavanger Art Museum is housed in a giant glass dome: a piece of artwork to be admired in itself. It houses over 2600 pieces of artwork dating from the time of its establishment in the 1800s to more modern pieces.\n\nWhile it focuses on Norwegian artwork, it also hosts exhibitions from artists all over the world.\n\nThe Art Nouveau Centre and the KUBE Art Museum, Ålesund\n\nJugentilsenteret (the Art Nouveau Centre) is a museum that focuses on the “art nouveau” style, which is the architectural style that the town was rebuilt in after it was destroyed by a fire in 1904.\n\nÅlesund, Norway\n\nThe KUBE Art Museum is next door in a building that used to be an office for Norges Bank (and presumably gets its name from the building’s cuboid shape). It is both an educational and art centre that features artists and artwork from the surrounding region.\n\nThe Nordnorsk Kunstmuseum, Tromsø\n\nThe Northern Norwegian Art Museum was founded in 1985 as an exhibition and education centre for Northern Norwegian art, and moved into its current building in 2001. It regularly hosts exhibitions that explore issues related to the North, such as “Make the North Great Again.”\n\nYou are free to wander around and discover the artwork for yourself, or you can join a free guided tour at 2pm on Sundays. Other guided tours at different times can also be arranged with the museum.\n\nThe Sámi Center for Contemporary Art, Karasjok\n\nSámi Dáiddaguovddáš was founded in 1986 with the intention of educating people on Sámi art, as well as supporting Sámi artists.\n\nThe center hosts around ten different exhibitions a year, and is also home to its own collection of Sami artwork, ranging from duodji to more contemporary pieces.\n\nBest Norwegian sculpture parks\n\nArt museums are not the only place you can find art in Norway! The country is also home to a variety of open-air sculpture parks for you to wander around at your leisure.\n\nWhile there are a number of sculpture parks in Oslo, the most iconic is “Vigelandsparken” (Vigeland park).\n\nThe Angry Boy of Oslo's Vigeland Park\n\nSituated in the middle of Frogner park, the sculpture park consists of over 200 statues, all created by Gustav Vigeland. The most famous sculpture is “Sinnatagen” (The Angry Boy) and touching his hand is said to give you luck – although this is not encouraged due to potential damage to the statue.\n\nPersonally, my favourite state is the man fighting off numerous babies.\n\nOslo's Vigeland Park\n\nOne of the more recent sculptures in Oslo is “Roseslottet” (the Rose Castle), which opened in June 2020. It was built to mark the 75-year anniversary of Norway’s liberation from Nazi Germany and gets its name from The White Rose resistance group. The art installation consists of a circular wooden path, surrounded by paintings on either side, that spirals into the centre: from a bird’s-eye view, it looks like a rose.\n\nElsewhere in Norway, the “Sverd i fjell” (Swords in Rock) in Stavanger was built as a monument to the Battle of Hafrsfjord in 972, and consists of three giant swords emerging from the ground as if plunged there by a giant.\n\nSverd i fjell, Stavanger\n\nClose to Stavanger is “Eventyrskogen” (The Fairytale Forest), which is a forest full of creatures from Norwegian fairy tales – and is probably the closest you’ll get to encountering a real troll in Norway (a tame one at least).\n\nNorwegian street art\n\nWhen we say “best Norwegian street art”, we don’t mean someone’s name scrawled onto a wall. We’re talking about massive, colourful murals that take up entire sides of buildings and risqué pictures of the Mona Lisa flashing passersby!\n\n“Mona Lisa” street art in Stavanger\n\nThere’s absolutely no reason for art to be confined to indoors – or even to a single canvas! From Bodø to Stavanger to the Swedish border, Norway has some amazing street art just waiting to be uncovered! Grab yourself a cup of coffee and experience some awe-inspiring art while embracing the Norwegian principles of “friluftsliv!”\n\nWant to study art in Norway?\n\nAre you inspired by Norwegian landscape and history, like so many artists before you? There are plenty of places where you can study art in Norway!\n\nOslo National Academy of the Arts (KHiO) offers ample opportunity to study any type of art to a bachelor and master level at the Academy of Fine Art, the Art and Craft department or the Design department. The school also consists of an Academy of Dance, Academy of Opera, and Academy of Theatre.\n\nThe Faculty of Fine Art, Music and Design (KMD) in Bergen offers both bachelor- and master-level degrees in art, music and design. Their fine arts programme allows students to specialise in areas as photography, painting, textiles, etc.\n\nThe Trondheim Academy of Fine Art (KIT) is part of the Faculty of Architecture and Design at NTNU. It offers the opportunity to study visual art at both a bachelor and master level.\n\nThe Academy of Arts at UiT offers bachelor and master-level degrees in fine art, as well as one-year courses. The Academy also has close connections with other art institutions in Tromsø, including the Nordnorsk Kunstmuseum and the Tromsø Kunstforening.\n\nWhat’s your favourite art in Norway? Do you have any questions about Norwegian art that we did not answer? Let us know in the comments!"}, {"url": "https://www.apollo-magazine.com/landscape-painters-norway/", "page_content": "Schools of landscape painting are often driven by political struggles for independence, and Norway’s is no exception. Between 1380 and 1814, Norway was an impoverished and oppressed land ruled over by Denmark. In the redrawing of the map of Europe after the defeat of Napoleon, Norway still did not gain its independence but was forced into union with Sweden under Karl Johan who tactlessly had his palace in Oslo built by gangs of Norwegian prisoners in chains.\n\nAt the time of these post-Napoleonic European convulsions, Johan Christian Dahl (1788–1857), known as ‘the father of Norwegian painting’, was studying at the Art Academy in Denmark and travelling widely. (Norway did not have its own art academy, let alone a national gallery.) Norway had been partially recorded topographically and a few intrepid Danish artists had undertaken minor painting tours, but despite the 18th century’s fascination with Alpinism and ‘gothick gloomth’, Norway’s vertiginous peaks and thundering torrents remained undiscovered by the European Romantic movement, and unpainted.\n\nAs a student in Copenhagen, Dahl saw Dutch landscapes. In 1818 he moved to Dresden where the great Romantic painter Caspar David Friedrich (1744–1840) was at the height of his powers. The two men became housemates and close friends. In 1821 Dahl visited Rome and sketched in the Campagna, where he realised the mythologising potential of landscape. Both painters produced their sweeping canvases in the studio, but while Friedrich continued to take the local landscape as his subject and transform it though his spiritual vision, Dahl painted visions of Norway, translating the peaks of the Sognefjord, the thundering Labro torrent and other recognisable Norwegian beauty spots into a new, impressive and turbulent vision of a northern Arcadia.\n\nDahl found it much easier to portray his country from abroad (as Henrik Ibsen did a generation later). As his fame grew he remained in Dresden where he taught at the Academy, but he did not forget the plight of his fellow countrymen. In the 1830s he was instrumental in founding both the National Gallery of Norway and the Norwegian Art Association. Norwegian artists could now see real examples of world art in a gallery, rather than poring over books of prints and engravings. The Art Association gave them a meeting place where they could discuss their own work in the context of their European contemporaries. A national school gradually formed.\n\nDahl’s studio in Dresden became a place of pilgrimage for Norwegian painters who wanted to build on the German Romantic tradition. The clear line from Friedrich can be seen in Old Birch Tree at the Sognefjord (1839) by Thomas Fearnley (1802–42), a clever progression from Friedrich’s famous The Wanderer above the Sea of Fog (1818). In the latter the individual human hero stands strong and straight against a tempestuous background, but Fearnley replaces the human figure with an ancient birch tree, symbolising Norway. Composition, theme, spirituality and yearning are similar in both paintings but Fearnley moves the message away from Romantic individualism and towards nationalist symbolism.\n\nThe nationalist theme was taken up by Adolf Tidemand, who peopled his landscapes with depressed and depressing peasants. Hans F. Gude and August Capellen, who both taught at the Düsseldorf Academy, returned the focus to pure landscape. Capellen and Lars Hertevig, a pupil of Gude in Düsseldorf, ventured more timidly into the sublime, unmooring their pictures from specific Norwegian locations to give them generic titles such as Decaying Forest (1852) and Thunder Looms (1856). Fearnley’s lone birch tree as symbol of Norway was further developed by Eilif Peterssen in Summer Night (1888), an informal composition of a birch fallen across a sheet of water. Consciously or unconsciously, nationalism in art had progressed from a first stage of carefully composed, idealised set pieces to portraying a slice of reality to which every citizen could relate; any countryman might glimpse something very like the casual beauty depicted in Peterssen’s Summer Night on an evening walk.\n\nWhile Peterssen, Fearnley and others were moving towards more realistic observation, Peder Balke (1804–87) was moving in the other direction, towards the imaginative sublime. For a century Norwegian landscape would continue on both paths. Naturalistic and symbolic-visionary approaches existed side by side and only rare artists, such as Edvard Munch, would dip in and out of both.\n\nBalke was a loner drawn to the furthest north, which he invested with a gothic intensity. His best pictures are tiny and very personal observations of vast and threatening scenes: ice floes, tossing seas, vertiginous cliffs, often weirdly illuminated by silvery moonlight or by the scribble of the Northern Lights in the sky. Mystical and often tempestuous, Balke’s vision of the magnificent, coldly indifferent motherland offers no comfort, but demands sacrifice and worship. Balke’s technique eschews careful finish. Sometimes he applied the paint with his hands; often he painted in monochrome, in tones of blue or brown, or just black and white. At a first glance it is possible to take his small, improvisational oils on panel for early photographs. Some areas are misty and faded out, others sharply in focus. Balke made no attempt at naturalism. His landscapes are often empty: solitary figures, lighthouses, lone trees or boats in obvious peril are only there to emphasise the ineluctable power of nature and the heroic North. He records impersonally, ostensibly avoiding emotional manipulation, but for all that, his landscapes pack a powerful punch, the strongest in Norwegian painting until Munch.\n\nAs Balke was active in the 1830s and ’40s, the Norwegian folk movement was in full, nationalistic swing. Olaf Isaachsen was a painter who was well-versed internationally, having studied first in Düsseldorf and then in France under Couture and Courbet. His landscapes feature peasants in colourful national dress; he even felt it important to record unpeopled peasant interiors. The folklorists Asbjørnsen and Moe, who tramped the very long length of Norway collecting tales from thousands of isolated valleys, published their Norwegian Folk Tales in the Norwegian language in 1841. This was a major political act. Throughout the preceding four centuries Norway’s official written language had been Danish, a bureaucratic arrangement that had deprived the Norwegian people of widespread literacy, let alone literature. Norwegian Folk Tales was illustrated by Erik Werenskiold (1855–1938) and Theodor Kittelsen (1857–1914), and the two artists gave graphic physical shape to the terrifying creatures that haunted the Norwegian imagination. They created the folkloric archetypes that endure to this day: the troll that gurns at you from every tourist trap, and Kittelsen’s subtler and more terrifying Skogtroll, the forest troll (1888) who takes the form of an anthropomorphised mountain.\n\nBy the 1880s, Norway still had not achieved independence but its artistic compass had moved from Germany to France. Young painters were becoming sceptical of rigid German academic training, and bohemian Paris beckoned. Here, at last, Norwegian culture was wielding a wider influence. Ibsen’s plays were all the rage in Paris, where Frits Thaulow (1847–1906) was celebrated as ‘the painter of snow’. Thaulow had no strong nationalist agenda but his luminous landscapes inspired Monet to visit Norway in 1895, where the Frenchman had terrible trouble with his paint freezing. French influence grew in turn as Thaulow came home in the summers to pioneer plein air painting at his Open Air Academy in Modum.\n\nChristian Krohg (1852–1925) is not in the front rank of Norwegian artists but he was very important at a time when their attention was turning to Paris, and to French Impressionism. Krohg taught in Paris at the Académie Colarossi; his style was realist, his convictions socialist and his subjects unashamedly political. Ragged urchins, defiant prostitutes and heroic sea captains in sou’westers represent Norway’s poverty and injustice. In 1882, Krohg attended the seventh and largest Impressionist exhibition and returned to Norway the same year brimming with ideas. He organised the first exhibition of independent artists in Oslo and opened an art school where Impressionism and pointillism were discussed and tried out. His pupils for a time included the young Edvard Munch (1863–1944). When Munch exhibited a pointilliste canvas in Oslo – Spring Day on Karl Johan Street (1890) – Norwegian doctors earnestly warned the public against looking at it, believing they could catch spotty diseases, such as measles and chicken pox from a mere glance.\n\nMunch soon outgrew Krohg, pointillism and all other -isms to paint his completely original landscapes. In 1885, he had paid the first of several long visits to Paris. The following year the French poet Jean Moréas published his Symbolist Manifesto in Le Figaro. Moréas attacked naturalism, urging writers and artists to be more evocative and suggestive in their response to nature. Munch wrote in his journal: ‘If it is possible to produce the desired effect by changing nature, then it should be done… Whether the picture resembles nature or not is irrelevant, as a picture cannot be explained; the reason for its being painted in the first place was that the artist could find no other means of expressing what he saw.’ In Paris Munch was strongly impressed by Puvis de Chavannes and by Gauguin’s flattening of space, simplification of forms and non-naturalistic use of colour, all of which we can see in curiously static and serene symbolist landscapes, such as Starry Night (1893; Fig. 6), which offer a dreamy, mystic view of the world. Munch had seen the Van Gogh retrospective of 1891, and the influence of the Dutch artist’s hectically directional brushwork can be detected in Munch’s best-known works, the troubled and turbulent paintings all created around 1893, such as Anxiety, or Evening on Karl Johan or The Scream. These are not the first paintings one would think of as landscapes but place is overwhelmingly significant to Munch, and in these great Expressionist canvases, recognisable landscapes play as important a part as the figures. In Munch’s written account of the vision that inspired The Scream, he relates how he saw the ‘clouds over the fjord drip[ped] reeking blood’ as he heard ‘a huge, extraordinary scream pass through nature’. He does not even mention the role of the figure in the painting, although today people see it as the main focus.\n\nNorway achieved independence in 1905. ‘Yes, we love this land!’ runs the first line of the national anthem, celebrating the country in both senses of the word. That same year, Harald Sohlberg (1869–1935) produced Flower Meadow in the North, hymning Norway’s pastoral bliss and speaking of release, fecundity and a limitless national vision.\n\n‘I have felt nature’s enigmatic and incomprehensible side and I have instinctively sought to know and understand it,’ Solhberg wrote in the late 1880s. Sohlberg’s landscapes, like those of his contemporary Munch, were metaphors for deep feelings, but his technique for conveying them could hardly be more different. Munch’s emotional punch is heightened by the impression that he painted at vast speed: paint dribbles and splodges and patches of naked canvas contribute to the idea of hastily conveyed inner turmoil. But Sohlberg, who had been apprenticed to a scene painter, employed the craftsman’s careful scaling up from meticulous preparatory drawings on to the canvas using a grid. He also used the old-fashioned glazing technique, carefully building up thin layers of almost transparent paint over coloured underlays. Sohlberg might take two years over a painting; nevertheless, he too aimed at immediate emotional punch. Like Munch, Sohlberg was influenced by Gauguin’s flattening of space, anti-naturalistic use of colour and synthesist rhythmic patterns. Sohlberg’s simplified and evocative landscapes defy definition, hovering between naturalism, symbolism and Fauvism in their strong and often vividly contrasting colours.\n\nSohlberg’s landscapes of mood and memory are nourished by feelings of isolation, separation and the spiritual yearning attendant on the arrival of the machine age and the departure of God. He found his two great recurring themes in the mystical untouched splendour of the Rondane mountains, a major Symbolist-Romantic subject into which he infused intense lyricism. In contrast, he took Røros, a copper-mining town, as a symbol of the industrial revolution creeping through Norway, corrupting the land and diminishing humanity. He paints the long Røros high street in overly bright, flat light, in perfectly enamelled finish and in obsessive detail. You can count every plank on every wooden house. Objectively, the street is undeniably picturesque, yet the insistent clarity makes the subject repellent: in forcing the material world upon the viewer Sohlberg is showing us that the world de-souled is not a sympathetic place. A contemporary critic observed that Sohlberg does not so much show us a picture of a street as the foreboding before a storm.\n\nFrom the 1820s onwards, when J.C. Dahl began to shape an image of Norway, its artists have celebrated the country in diverse ways. In a recent poll, Sohlberg’s vision of the Rondane mountains, Winter Night in the Mountains (1914), was voted Norway’s favourite painting. Sohlberg and Munch were the two artists who finally freed Norwegian art from the influence of both Germany and France and gave it a vision of itself. By ditching nationalism, they laid the foundations for a true national art.\n\n‘Harald Sohlberg: Painting Norway’ is at the Dulwich Picture Gallery until 2 June. ‘Edvard Munch: Love and Angst’ is at the British Museum until 21 July.\n\nFrom the April 2019 issue of Apollo. Preview and subscribe here."}]}