{"Johan Christian Dahl's early works were often dark and gloomy.": [{"url": "https://www.metmuseum.org/art/collection/search/441967", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}, {"url": "https://www.wikiart.org/en/johan-christian-dahl", "page_content": "Johan Christian Claussen Dahl (24 February 1788 – 14 October 1857), often known as J. C. Dahl or I. C. Dahl, was a Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian Painter ever to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\n\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. Indeed, if one sets aside his own monumental artistic creations, his other activities on behalf of art, history, and culture would still have guaranteed him a place at the very heart of the artistic and cultural history of Norway. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Håkonshallen in Bergen.\n\n\n\nDahl came from a very simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\n\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller (no), whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\n\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://artsandculture.google.com/entity/m06p68x", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally.\n\nShow less Read more Wikipedia"}, {"url": "https://artvee.com/artist/johan-christian-dahl/", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Bergenhus Fortress in Bergen.\n\nDahl came from a simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller [no], whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nDahl held that a landscape painting should not just depict a specific view, but should also say something about the land's nature and character – the greatness of its past and the life and work of its current inhabitants. The mood was often idyllic, often melancholy. When he added snow to a landscape he painted in the summer, it was not to show the light and colors of snow; it was to use snow as a symbol of death. As one critic has put it, “Unlike the radically Romantic works also appearing at the time, Dahl softens his landscape, introducing elements of genre painting by imbuing it with anecdotal materials: In the background a wisp of smoke rises from a cabin, perhaps the home of the hunter on the snow-covered field.” Thanks to Sagen's recommendations and to his own personal charm, Dahl soon gained access to the leading social circles in Copenhagen.\n\nDahl took part in annual art exhibitions in Copenhagen beginning in 1812, but his real breakthrough came in 1815, when he exhibited no fewer than 13 paintings. Prince Christian Frederik of Denmark, who developed an early interest in Dahl's artistic genius and saw to it that his works were purchased for the royal collection, became a lifelong friend and patron of the artist.\n\nIn 1816 C. W. Eckersberg returned from abroad with his paintings of Roman settings; Dahl was impressed at once, and they became good friends and exchanged pictures. Dahl's 1817 painting Den Store Kro i Fredensborg marked the real beginning of his lifelong production of oil paintings depicting natural subjects.\n\nAfter his success in Copenhagen, Dahl realized that he wanted to live as an independent, self-supporting artist. One challenge facing him was that the academic preference of the day was for historical paintings with moral messages. Landscapes were considered the lowest kind of art, and perhaps even not as art at all, but as a purely mechanical imitation of nature. The only landscapes that could be considered art, according to the academy, were ideal, imaginary landscapes in pastoral or heroic styles. In accordance with this reigning taste, Dahl attempted to give his Danish themes a certain atmospheric character in order to lift them up above what was considered a merely commercial level. But at the same time it was his deepest wish to provide a more faithful picture of Norwegian nature than were offered by the old-fashioned, dry paintings of Haas and Lorentzen. This desire was partly motivated by homesickness and patriotism, but it was also suited to the public taste of the day for “picturesque” works.\n\nDahl traveled to Dresden in September 1818. He arrived with introductions to the city's leading citizens and to major artists such as Caspar David Friedrich, who helped him establish himself there and became his close friend. One critic has written: “Friedrich's still, meticulously executed landscapes - products of an art informed by his strict Protestant upbringing and a seeking for the divine in nature - were justifiably famous by the time he and Dahl became acquainted. We are able to see his Two Men Contemplating the Moon (1819), which ranks among his greatest works, and features two \"Rückfiguren,\" or figures seen from behind, solemnly and companionably gazing at a young sickle moon from the edge of an old forest. 'Greifswald in Moonlight' (1816–17) depicts the artist's birthplace in Pomerania, on the Baltic coast: bathed in an even, gauzy moonlight, the ancient university town assumes an almost ethereal appearance.”\n\nFriedrich was fourteen years Dahl's elder and an established artist, but the two found in each other a shared love for nature and a shared enthusiasm for a way of depicting nature that was based on the study of nature itself rather than on the academic cliches that they both profoundly despised. One writer has put it this way: “A warm and sociable character, he soon met and became friendly with the more introverted and reclusive Friedrich, recording how they once walked together in the park of the Grösser Garten among 'many lovely trees of different kinds, and the moon looked beautiful behind the dark fir trees.'”\n\nTogether with Friedrich and Carl Gustav Carus, Dahl would become one of the Dresden painters of the period who exerted a decisive influence on German Romantic painting.\n\nIn Dresden, as in Copenhagen, Dahl traveled around the area to draw subjects that could be of use to him in larger works that would be painted later in his atelier. He wrote to Prince Christian Frederik in 1818 that “most of all I am representing nature in all its freedom and wildness.” Dahl found enough material in the Dresden area to supply motifs for his paintings, but he continued to paint imaginary landscapes with forests, mountains, and waterfalls. One such painting, completed in 1819, entitled Norsk fjellandskap med elv (Mountainous Norwegian landscape with river”), garnered great attention among younger artists who considered the striking natural quality of the painting a breath of fresh air on Dresden's stagnant art scene. Another monumental waterfall painting, completed the next year, was lavished with praised by the critic for Kunstblatt who said that Dahl was greater than Jacob van Ruisdael. Dahl was accepted into the Dresden academy in 1820.\n\nPrince Christian Frederik wrote to Dahl in 1820 from Italy and invited him to join him at the Gulf of Naples. Dahl was at the time courting a young woman named Emilie von Bloch, but felt he should take the prince up on his offer, so he married Emilie quickly and traveled to Italy the next day. He ended up spending 10 months in Italy. Though he missed his bride, the sojourn was a decisive factor in his artistic development. It was in Italy, with its strong southern light, that Dahl's art truly flowered. It forced him to see nature plain, without the mediation of the old masters' renderings of light and color.\n\nDahl went to Rome in February 1821. He spent a great deal of time visiting museums, meeting other artists, and painting pictures to sell. In addition to painting sights in Rome and pictures of the Gulf of Naples, he painted landscapes inspired by the mountains of Norway. Dahl said that not until he was in Rome did he truly appreciate Norwegian nature. In June 1821 Dahl returned north to Emilie and a quiet life of family and painting.\n\nDahl quickly became a member of Dresden's leading circles of poets, artists, and scientists, among them the archeologist C. A. Böttiger, publisher of Artistisches Notizenblatt, who ran a major article on Dahl in 1822.\n\nAs a member of the academy, Dahl always dedicated his time to young artists who sought him out. In 1824 he and Friedrich were named “extraordinary professors” who had no chair but who received a regular salary. In 1823 Dahl moved in with Friedrich, so that many of his students, such as Knud Baade, Peder Balke, and Thomas Fearnley, were equally influenced by both artists. “Well before their meeting,” writes one critic, “Dahl had also painted a number of 'moonlights' and, travelling in Europe, he was in the Bay of Naples in 1821 when Mount Vesuvius was active. Here he painted 'Boats on the Beach Near Naples', where fishing crafts lie at anchor in the calm, shimmering waters with the twin peaks of the mountain smoking and flaming behind. Predictably, after his close association with Friedrich began—the two families shared a house in Dresden from 1823—he was considerably influenced by him, but his own more spontaneous and painterly style soon prevailed. Clients sometimes commissioned pictures from them both, a tranquil coastal scene by Friedrich to pair with a more stormy subject from Dahl.”\n\nDahl never formed a “school” around himself, but rather preferred for his students to cultivate their own styles; it was against his principles and his respect for artistic freedom to try to inhibit his students' individuality. It was this impulse toward individuality that later caused him to turn down an offer of a permanent chair at the academy – he didn't want to feel compelled to show up for class when he was busy working on a painting.\n\nDahl continued his studies of nature in the area around Dresden when he had the time, or on longer trips which provided him with themes for his paintings. But most often he painted the view of the Elbe outside his windows in various kinds of light. Like John Constable, Dahl felt that the sky was an important part of a landscape painting, and he never grew tired of watching the clouds move over the flat plain. One critic has compared two paintings of Friedrich and Dahl: “In...Dahl's 'Mother and Child by the Sea', there are echoes of Friedrich's 'Woman by the Sea' (1818). Whereas in Friedrich's work a woman dressed for the windy weather sits idly watching five fishing boats sailing past, in Dahl's picture, there seems to be a more personal note, with echoes of his own upbringing in a seafaring community, as the mother and small child eagerly await the return of the little ship from the sea.” The same critic has written about one of his paintings of Dresden: “Dahl also commemorated the magnificent Baroque buildings of his adopted city, and a version of his View of Dresden by Moonlight (1838) has travelled from the National Museum of Art, Architecture, and Design in Oslo. This small picture, measuring only 18.5 x 34.5 cm, shows the dome of the Frauenkirche and the tower of the Hofkirche dominating the skyline; silvers and deep blue combine to give it a wonderful jewel-like effect, together with a certain elegiac quality, perhaps indicative of the artist's awareness that his long friendship with Friedrich was nearing an end.”\n\nAs Dahl wrote in 1828 to the director of the Dresden academy, he found the area around Dresden useful for nature studies, but the “real thing” was always missing; that was something he could only find in his mountainous homeland. He viewed himself as a “more Nordic painter” with a “love for seacoasts, mountains, waterfalls, sailboats, and pictures of the sea in daylight and moonlight.” He longed to return to Norway, but not until 1826 was he able to make a journey home.\n\nHe made subsequent trips to Norway in 1834, 1839, 1844, and 1850, mostly exploring and painting the mountains, leading to the monumental works Fortundalen (1836) and Stalheim (1842). During his visits to Norway he received “an enthusiastic welcome as a painter of renown.”\n\nA critic notes Dahl's late stylistic changes: “In his late Fjord at Sunset (1850), based on studies made earlier, free and adventurous brush strokes represent the cloud-swept sky and broken surface of the water. Here he has moved far away from the purity and intensity of Friedrich's oeuvre.”\n\nIn 1827 Emilie Dahl died in childbirth while having their fourth child, and two years later two of the older children died of scarlet fever. In January 1830, Dahl married his student Amalie von Bassewitz, but she, too, died in childbirth in December of that same year. Dahl was crushed, and many months passed before he was able to paint again. Some years later this youngest child also died, leaving Dahl with two surviving children, Siegwald and Caroline, who married the Norwegian minister Anders Sandøe Ørsted Bull 1848.\n\nDahl's trip to Norway in 1850 would be his last. He was aging and weak, but continued to paint landscapes in the mountains. This last journey to his homeland resulted in several magnificent works, including Måbødalen, Fra Stugunøset, and Hjelle i Valdres.\n\nDahl was among the founding fathers of the National Gallery of Norway (Norwegian: Nasjonalgalleriet), now the National Museum of Art, Architecture, and Design, and donated his own art collection to the institution. Together with Johan Sebastian Welhaven, Frederik Stang, and Henrik Heftye, he founded the Art Society in Oslo (Oslo Kunstforening).\n\nDahl died after a brief illness and was buried on 17 October 1857 in Dresden. In 1902, a statue of Dahl by Norwegian sculptor Ambrosia Tønnesen (1859–1948) was erected on the facade of the West Norway Museum of Decorative Art in Bergen. In 1934, his remains were brought back to Norway and buried in the cemetery of St. Jacob's Church (Sankt Jakob kirke) in Bergen.\n\nJ.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century. His Romantic yet naturalistic interpretations of Norwegian scenery were greatly admired in Norway as well as on the European continent, particularly in Denmark and Germany."}, {"url": "https://www.metmuseum.org/art/collection/search/439362", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}, {"url": "https://www.metmuseum.org/art/collection/search/438954", "page_content": "Use your arrow keys to navigate the tabs below, and your tab key to choose an item\n\nJørgen Hansen Koch. Letter to Johan Christian Dahl. May 28, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605], states his wish to purchase a small painting as a gift for his wife, to cost no more than 30 to 40 Species, and to be picked up from the artist by Koch's sister-in-law.\n\n\n\nJohan Christian Dahl. Diary entry. June 12, 1830 [Universitetsbiblioteket, Oslo, Ms. 1001, 8°; excerpt published in English transl. in Bang 1987, vol. 2, p. 213 under no. 641], notes receipt and content of Koch's letter dated May 28, 1830.\n\n\n\nJohan Christian Dahl. Letter to Jørgen Hansen Koch. October 8, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], proposes selling two smaller paintings to Koch for 40 Species (for both, including frames), to be paid to the artist's friend Cancelliraad Thomsen; describes the subject of this picture as \"a coast in moonlight where a woman and her child are waiting for an approaching boat bearing a close relation\"; states that both paintings will be sent in a few days.\n\n\n\nJørgen Hansen Koch. Letter to Johan Christian Dahl. December 14, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], states that the pictures have arrived, that the sum has been paid, and that he and his wife are pleased with both paintings.\n\n\n\nJohan Christian Dahl. Einnahmen für die Jahre 1824–1855. December 29, 1830 [Universitetsbiblioteket, Oslo, Ms. Fol. 1882k; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], notes in his account book that \"Via Thomsen received from Justidsraad [Counsellor] Koch in Copenhagen for two pictures – 60 rd.\".\n\n\n\nCarl Reitzel. Fortegnelse over Danske Kunstneres Arbejder paa de ved det Kgl. Akademi for de Skjønne Kunster i Aarene 1807–1882 afholdte Charlottenborg-Udstillinger. Copenhagen, 1883, p. 107, lists it under Exh. Copenhagen 1831 as \"Maaneskinsstykke,\" with J. H. Koch as owner and P. Koch as the \"assessor\" [see Bang 1987].\n\n\n\nMarie Lødrup Bang. Johan Christian Dahl, 1788–1857: Life and Works. Oslo, 1987, vol. 1, pp. 82, 171, 202 n. 38; vol. 2, pp. 204, 213, 280, 376, no. 641; vol. 3, pl. 641, identifies this picture as probably the pendant described on the verso of an \"afterdrawing\" of the painting \"Autumn Landscape near Dresden\" (1829; private collection, Dresden; Bang no. 605) [see Provenance]; lists two related drawings (1826 and 1827; both Nasjonalgalleriet, Oslo), one of an anchor and the other of a woman and child on a beach; compares it to Friedrich's coastal landscapes, notably \"Evening on the Baltic\" (1826; Georg Schäfer Museum, Schweinfurt), based on another Dahl drawing of an anchor; mentions a variant of this picture (Barber Institute of Fine Arts, University of Birmingham; Bang no. 915) and an unsigned replica (private collection, Munich), possibly a student copy.\n\n\n\nSuzanne Ludvigsen. Danish Paintings of the Golden Age. Exh. cat., Artemis Fine Arts, Inc. New York, 1999, unpaginated, no. 16, ill. (color).\n\n\n\nSabine Rewald. Caspar David Friedrich: Moonwatchers. Exh. cat., The Metropolitan Museum of Art. New York, 2001, p. 50, no. 14, ill. (color), reproduces the studies for this picture.\n\n\n\nRichard Verdi. \"A Rediscovered 'Moonlight' by Johan Christian Dahl.\" Burlington Magazine 147 (February 2005), pp. 115–16, fig. 52, notes that the returning boat is presumably that of the child's father, adding \"since Dahl's father was himself a fisherman, this lends an unmistakably autobiographical note to the scene and makes it an unusually personal work in the artist's career.\" .\n\n\n\nPaul Spencer-Longhurst. Moonrise over Europe: JC Dahl and Romantic Landscape. Exh. cat., Birmingham Barber Institute of Fine Arts. London, 2006, pp. 41–43, 64, 66, 72, 74, 78, fig. 21 (color), suggests that the death of Dahl's two children in 1829 and his wife's pregnancy in 1830 inform the anecdotal nature of this picture with an element of pathos.\n\n\n\nSabine Rewald in \"Recent Acquisitions, A Selection: 2006–2007.\" Metropolitan Museum of Art Bulletin 65 (Fall 2007), p. 39, ill. (color).\n\n\n\nEsther Bell. \"Catalogue Raisonné of the Thaw Collection.\" Studying Nature: Oil Sketches from the Thaw Collection. Ed. Jennifer Tonkovich. New York, 2011, p. 114, no. 37, ill. (color), calls it \"Mother and Child by the Sea\".\n\n\n\n"}, {"url": "https://artsandculture.google.com/entity/%E7%BA%A6%E7%BF%B0%C2%B7%E5%85%8B%E9%87%8C%E6%96%AF%E8%92%82%E5%AE%89%C2%B7%E8%BE%BE%E5%B0%94/m06p68x", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally.\n\nShow less Read more Wikipedia"}, {"url": "https://pantheon.world/profile/person/Johan_Christian_Dahl/", "page_content": "Johan Christian Dahl\n\nJohan Christian Claussen Dahl (24 February 1788 – 14 October 1857), often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Johan Christian Dahl has received more than 217,549 page views. His biography is available in 31 different languages on Wikipedia (up from 29 in 2019) . Johan Christian Dahl is the 357th most popular painter (up from 428th in 2019), the 53rd most popular biography from Norway (up from 68th in 2019) and the 3rd most popular Norwegian Painter.\n\nJohan Christian Dahl is most famous for his paintings of Norwegian landscapes."}, {"url": "https://www.metmuseum.org/art/collection/search/440407", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}, {"url": "https://www.nasjonalmuseet.no/en/collection/object/NG.M.01060", "page_content": "In this dense composition, the mountains around Stalheim rise majestically against a dark sky heavy with rain; as the sun peeks through the clouds, light is reflected in the drops of water in the rainbow that arcs over the valley and keeps the landscape in a firm grip. The contrast to View from Bastei, painted in 1819, is striking: while the earlier painting focuses on a rocky protrusion overlooking a sheer drop, the abyss in View from Stalheim is hidden behind the small plateau in the foreground and is merely suggested by the mist from the waterfall. By making the mountainsides more precipitous than they are in reality, Dahl has constricted the pictorial space even further; the panorama becomes both monumental and intimate.\n\nThis secluded world contains a myriad of details, small scenes that all tell a story and that contrast the figures’ everyday chores and fleeting existence with the primordial mountain landscape and an entirely different sense of time. As with Winter at the Sognefjord, this painting also contains elements that have been ascribed a symbolic meaning: for example, the rainbow, the most eye-catching element, has been interpreted as a symbol of the divine and as an homage to the young Norwegian nation, while the mutilated birch in the foreground might allude to the violent forces of nature that pose a constant threat to humanity’s existence.\n\nText: Bodil Sørensen\n\nFrom \"Highlights. Art from Antiquity to 1945\", Nasjonalmuseet 2014, ISBN 978-82-8154-088-0"}], "Johan Christian Dahl began to paint more brightly coloured landscapes after 1820.": [{"url": "https://www.wikiart.org/en/johan-christian-dahl", "page_content": "Johan Christian Claussen Dahl (24 February 1788 – 14 October 1857), often known as J. C. Dahl or I. C. Dahl, was a Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian Painter ever to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\n\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. Indeed, if one sets aside his own monumental artistic creations, his other activities on behalf of art, history, and culture would still have guaranteed him a place at the very heart of the artistic and cultural history of Norway. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Håkonshallen in Bergen.\n\n\n\nDahl came from a very simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\n\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller (no), whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\n\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://www.metmuseum.org/art/collection/search/441967", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}, {"url": "https://www.nasjonalmuseet.no/en/collection/object/NG.M.03138", "page_content": "Dahl painted Winter at the Sognefjord in the following year. The painting shows the view from Nornes toward Fimreite on the other side of the fjord. As a battle site during the struggle for royal power in 1184, Fimreite held a special place in the national consciousness, while the mighty menhirs at Nornes testified to a heroic past.\n\nThe composition is based on a drawing that Dahl made at the site, but it has become more concentrated. The mountains have become steeper, and the monolith in the foreground forms a conspicuous vertical line toward the reflecting water and the diagonal lines in the foreground. The monolith also helps set the mood, as does the snow with its associations to the past and death, while the light from the morning sun on the monolith’s apex has been interpreted as a ray of hope; this fusion of form and content is something the painting has in common with Caspar David Friedrich’s symbolic landscapes. But above all, Dahl’s depiction pays homage to the majestic nature of Norway and the nation’s proud history.\n\nText: Bodil Sørensen\n\nFrom \"Highlights. Art from Antiquity to 1945\", Nasjonalmuseet 2014, ISBN 978-82-8154-088-0"}, {"url": "https://artvee.com/artist/johan-christian-dahl/", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Bergenhus Fortress in Bergen.\n\nDahl came from a simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller [no], whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nDahl held that a landscape painting should not just depict a specific view, but should also say something about the land's nature and character – the greatness of its past and the life and work of its current inhabitants. The mood was often idyllic, often melancholy. When he added snow to a landscape he painted in the summer, it was not to show the light and colors of snow; it was to use snow as a symbol of death. As one critic has put it, “Unlike the radically Romantic works also appearing at the time, Dahl softens his landscape, introducing elements of genre painting by imbuing it with anecdotal materials: In the background a wisp of smoke rises from a cabin, perhaps the home of the hunter on the snow-covered field.” Thanks to Sagen's recommendations and to his own personal charm, Dahl soon gained access to the leading social circles in Copenhagen.\n\nDahl took part in annual art exhibitions in Copenhagen beginning in 1812, but his real breakthrough came in 1815, when he exhibited no fewer than 13 paintings. Prince Christian Frederik of Denmark, who developed an early interest in Dahl's artistic genius and saw to it that his works were purchased for the royal collection, became a lifelong friend and patron of the artist.\n\nIn 1816 C. W. Eckersberg returned from abroad with his paintings of Roman settings; Dahl was impressed at once, and they became good friends and exchanged pictures. Dahl's 1817 painting Den Store Kro i Fredensborg marked the real beginning of his lifelong production of oil paintings depicting natural subjects.\n\nAfter his success in Copenhagen, Dahl realized that he wanted to live as an independent, self-supporting artist. One challenge facing him was that the academic preference of the day was for historical paintings with moral messages. Landscapes were considered the lowest kind of art, and perhaps even not as art at all, but as a purely mechanical imitation of nature. The only landscapes that could be considered art, according to the academy, were ideal, imaginary landscapes in pastoral or heroic styles. In accordance with this reigning taste, Dahl attempted to give his Danish themes a certain atmospheric character in order to lift them up above what was considered a merely commercial level. But at the same time it was his deepest wish to provide a more faithful picture of Norwegian nature than were offered by the old-fashioned, dry paintings of Haas and Lorentzen. This desire was partly motivated by homesickness and patriotism, but it was also suited to the public taste of the day for “picturesque” works.\n\nDahl traveled to Dresden in September 1818. He arrived with introductions to the city's leading citizens and to major artists such as Caspar David Friedrich, who helped him establish himself there and became his close friend. One critic has written: “Friedrich's still, meticulously executed landscapes - products of an art informed by his strict Protestant upbringing and a seeking for the divine in nature - were justifiably famous by the time he and Dahl became acquainted. We are able to see his Two Men Contemplating the Moon (1819), which ranks among his greatest works, and features two \"Rückfiguren,\" or figures seen from behind, solemnly and companionably gazing at a young sickle moon from the edge of an old forest. 'Greifswald in Moonlight' (1816–17) depicts the artist's birthplace in Pomerania, on the Baltic coast: bathed in an even, gauzy moonlight, the ancient university town assumes an almost ethereal appearance.”\n\nFriedrich was fourteen years Dahl's elder and an established artist, but the two found in each other a shared love for nature and a shared enthusiasm for a way of depicting nature that was based on the study of nature itself rather than on the academic cliches that they both profoundly despised. One writer has put it this way: “A warm and sociable character, he soon met and became friendly with the more introverted and reclusive Friedrich, recording how they once walked together in the park of the Grösser Garten among 'many lovely trees of different kinds, and the moon looked beautiful behind the dark fir trees.'”\n\nTogether with Friedrich and Carl Gustav Carus, Dahl would become one of the Dresden painters of the period who exerted a decisive influence on German Romantic painting.\n\nIn Dresden, as in Copenhagen, Dahl traveled around the area to draw subjects that could be of use to him in larger works that would be painted later in his atelier. He wrote to Prince Christian Frederik in 1818 that “most of all I am representing nature in all its freedom and wildness.” Dahl found enough material in the Dresden area to supply motifs for his paintings, but he continued to paint imaginary landscapes with forests, mountains, and waterfalls. One such painting, completed in 1819, entitled Norsk fjellandskap med elv (Mountainous Norwegian landscape with river”), garnered great attention among younger artists who considered the striking natural quality of the painting a breath of fresh air on Dresden's stagnant art scene. Another monumental waterfall painting, completed the next year, was lavished with praised by the critic for Kunstblatt who said that Dahl was greater than Jacob van Ruisdael. Dahl was accepted into the Dresden academy in 1820.\n\nPrince Christian Frederik wrote to Dahl in 1820 from Italy and invited him to join him at the Gulf of Naples. Dahl was at the time courting a young woman named Emilie von Bloch, but felt he should take the prince up on his offer, so he married Emilie quickly and traveled to Italy the next day. He ended up spending 10 months in Italy. Though he missed his bride, the sojourn was a decisive factor in his artistic development. It was in Italy, with its strong southern light, that Dahl's art truly flowered. It forced him to see nature plain, without the mediation of the old masters' renderings of light and color.\n\nDahl went to Rome in February 1821. He spent a great deal of time visiting museums, meeting other artists, and painting pictures to sell. In addition to painting sights in Rome and pictures of the Gulf of Naples, he painted landscapes inspired by the mountains of Norway. Dahl said that not until he was in Rome did he truly appreciate Norwegian nature. In June 1821 Dahl returned north to Emilie and a quiet life of family and painting.\n\nDahl quickly became a member of Dresden's leading circles of poets, artists, and scientists, among them the archeologist C. A. Böttiger, publisher of Artistisches Notizenblatt, who ran a major article on Dahl in 1822.\n\nAs a member of the academy, Dahl always dedicated his time to young artists who sought him out. In 1824 he and Friedrich were named “extraordinary professors” who had no chair but who received a regular salary. In 1823 Dahl moved in with Friedrich, so that many of his students, such as Knud Baade, Peder Balke, and Thomas Fearnley, were equally influenced by both artists. “Well before their meeting,” writes one critic, “Dahl had also painted a number of 'moonlights' and, travelling in Europe, he was in the Bay of Naples in 1821 when Mount Vesuvius was active. Here he painted 'Boats on the Beach Near Naples', where fishing crafts lie at anchor in the calm, shimmering waters with the twin peaks of the mountain smoking and flaming behind. Predictably, after his close association with Friedrich began—the two families shared a house in Dresden from 1823—he was considerably influenced by him, but his own more spontaneous and painterly style soon prevailed. Clients sometimes commissioned pictures from them both, a tranquil coastal scene by Friedrich to pair with a more stormy subject from Dahl.”\n\nDahl never formed a “school” around himself, but rather preferred for his students to cultivate their own styles; it was against his principles and his respect for artistic freedom to try to inhibit his students' individuality. It was this impulse toward individuality that later caused him to turn down an offer of a permanent chair at the academy – he didn't want to feel compelled to show up for class when he was busy working on a painting.\n\nDahl continued his studies of nature in the area around Dresden when he had the time, or on longer trips which provided him with themes for his paintings. But most often he painted the view of the Elbe outside his windows in various kinds of light. Like John Constable, Dahl felt that the sky was an important part of a landscape painting, and he never grew tired of watching the clouds move over the flat plain. One critic has compared two paintings of Friedrich and Dahl: “In...Dahl's 'Mother and Child by the Sea', there are echoes of Friedrich's 'Woman by the Sea' (1818). Whereas in Friedrich's work a woman dressed for the windy weather sits idly watching five fishing boats sailing past, in Dahl's picture, there seems to be a more personal note, with echoes of his own upbringing in a seafaring community, as the mother and small child eagerly await the return of the little ship from the sea.” The same critic has written about one of his paintings of Dresden: “Dahl also commemorated the magnificent Baroque buildings of his adopted city, and a version of his View of Dresden by Moonlight (1838) has travelled from the National Museum of Art, Architecture, and Design in Oslo. This small picture, measuring only 18.5 x 34.5 cm, shows the dome of the Frauenkirche and the tower of the Hofkirche dominating the skyline; silvers and deep blue combine to give it a wonderful jewel-like effect, together with a certain elegiac quality, perhaps indicative of the artist's awareness that his long friendship with Friedrich was nearing an end.”\n\nAs Dahl wrote in 1828 to the director of the Dresden academy, he found the area around Dresden useful for nature studies, but the “real thing” was always missing; that was something he could only find in his mountainous homeland. He viewed himself as a “more Nordic painter” with a “love for seacoasts, mountains, waterfalls, sailboats, and pictures of the sea in daylight and moonlight.” He longed to return to Norway, but not until 1826 was he able to make a journey home.\n\nHe made subsequent trips to Norway in 1834, 1839, 1844, and 1850, mostly exploring and painting the mountains, leading to the monumental works Fortundalen (1836) and Stalheim (1842). During his visits to Norway he received “an enthusiastic welcome as a painter of renown.”\n\nA critic notes Dahl's late stylistic changes: “In his late Fjord at Sunset (1850), based on studies made earlier, free and adventurous brush strokes represent the cloud-swept sky and broken surface of the water. Here he has moved far away from the purity and intensity of Friedrich's oeuvre.”\n\nIn 1827 Emilie Dahl died in childbirth while having their fourth child, and two years later two of the older children died of scarlet fever. In January 1830, Dahl married his student Amalie von Bassewitz, but she, too, died in childbirth in December of that same year. Dahl was crushed, and many months passed before he was able to paint again. Some years later this youngest child also died, leaving Dahl with two surviving children, Siegwald and Caroline, who married the Norwegian minister Anders Sandøe Ørsted Bull 1848.\n\nDahl's trip to Norway in 1850 would be his last. He was aging and weak, but continued to paint landscapes in the mountains. This last journey to his homeland resulted in several magnificent works, including Måbødalen, Fra Stugunøset, and Hjelle i Valdres.\n\nDahl was among the founding fathers of the National Gallery of Norway (Norwegian: Nasjonalgalleriet), now the National Museum of Art, Architecture, and Design, and donated his own art collection to the institution. Together with Johan Sebastian Welhaven, Frederik Stang, and Henrik Heftye, he founded the Art Society in Oslo (Oslo Kunstforening).\n\nDahl died after a brief illness and was buried on 17 October 1857 in Dresden. In 1902, a statue of Dahl by Norwegian sculptor Ambrosia Tønnesen (1859–1948) was erected on the facade of the West Norway Museum of Decorative Art in Bergen. In 1934, his remains were brought back to Norway and buried in the cemetery of St. Jacob's Church (Sankt Jakob kirke) in Bergen.\n\nJ.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century. His Romantic yet naturalistic interpretations of Norwegian scenery were greatly admired in Norway as well as on the European continent, particularly in Denmark and Germany."}, {"url": "https://www.wikiart.org/en/johan-christian-dahl/stalheim-1842", "page_content": "View from Stalheim (Norwegian: Fra Stalheim) is an 1842 oil painting by J. C. Dahl of the mountainous view from Stalheim, Voss, Hordaland. It is a major work of Romantic nationalism and has become a national icon. It is regarded as one of Dahl's best works.\n\n\n\nThe painting shows the view from the peak at Stalheim over the Nærøy Valley towards the sugar-loaf shaped peak of Jordalsnuten in late afternoon sunshine, framed by peaks and a rainbow. The sun shines on a small village near the centre. Dahl has clearly delineated figures and buildings even in the distance, creating \"a world in miniature\". One of his purposes was realism; the other was to capture the glory and magnificence of the mountains, and associated with that, of his country's culture. In this evocation of grandeur the painting prefigures later US landscapes, in particular Church's Rainy Season in the Tropics (1866), which has a similar crowning rainbow. The rainbow itself, a symbol of reconciliation, peace, and in Christianity of God's grace, was also frequently used by Joseph Anton Koch and by Dahl's friend and associate Caspar David Friedrich.\n\n\n\nDahl began work on the painting in 1836 and completed it in 1842. It is based on two pencil and watercolour sketches he had made from the Gudvangen road in July 1826 during his first visit to the high mountain regions of Norway. The final version is close to the studies in both composition and details, including the sunlight highlighting the village; but Dahl has intensified the imagery by narrowing the valley, giving more prominence to the Jordalsnuten peak and less to the reappearance of the river from the shadows.\n\n\n\nDahl had trouble with the painting and avoided similarly large works after its completion.\n\n\n\nThe painting was made for Countess Wedel of Bogstad. Carl Gustav Wedel-Jarlsberg gave it to the National Gallery of Norway in 1914.\n\n\n\nThe painting is regarded as one of Dahl's best, perhaps his most successful realisation of his aim of depicting the mountains both realistically and as national symbols. It has become a national icon. Other painters have also depicted the scene, and even more than his other Norwegian landscapes, this one drove tourists to visit the site: the luxury hotel built at Stalheim in 1885 is attributable to it.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://www.metmuseum.org/art/collection/search/438954", "page_content": "Use your arrow keys to navigate the tabs below, and your tab key to choose an item\n\nJørgen Hansen Koch. Letter to Johan Christian Dahl. May 28, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605], states his wish to purchase a small painting as a gift for his wife, to cost no more than 30 to 40 Species, and to be picked up from the artist by Koch's sister-in-law.\n\n\n\nJohan Christian Dahl. Diary entry. June 12, 1830 [Universitetsbiblioteket, Oslo, Ms. 1001, 8°; excerpt published in English transl. in Bang 1987, vol. 2, p. 213 under no. 641], notes receipt and content of Koch's letter dated May 28, 1830.\n\n\n\nJohan Christian Dahl. Letter to Jørgen Hansen Koch. October 8, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], proposes selling two smaller paintings to Koch for 40 Species (for both, including frames), to be paid to the artist's friend Cancelliraad Thomsen; describes the subject of this picture as \"a coast in moonlight where a woman and her child are waiting for an approaching boat bearing a close relation\"; states that both paintings will be sent in a few days.\n\n\n\nJørgen Hansen Koch. Letter to Johan Christian Dahl. December 14, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], states that the pictures have arrived, that the sum has been paid, and that he and his wife are pleased with both paintings.\n\n\n\nJohan Christian Dahl. Einnahmen für die Jahre 1824–1855. December 29, 1830 [Universitetsbiblioteket, Oslo, Ms. Fol. 1882k; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], notes in his account book that \"Via Thomsen received from Justidsraad [Counsellor] Koch in Copenhagen for two pictures – 60 rd.\".\n\n\n\nCarl Reitzel. Fortegnelse over Danske Kunstneres Arbejder paa de ved det Kgl. Akademi for de Skjønne Kunster i Aarene 1807–1882 afholdte Charlottenborg-Udstillinger. Copenhagen, 1883, p. 107, lists it under Exh. Copenhagen 1831 as \"Maaneskinsstykke,\" with J. H. Koch as owner and P. Koch as the \"assessor\" [see Bang 1987].\n\n\n\nMarie Lødrup Bang. Johan Christian Dahl, 1788–1857: Life and Works. Oslo, 1987, vol. 1, pp. 82, 171, 202 n. 38; vol. 2, pp. 204, 213, 280, 376, no. 641; vol. 3, pl. 641, identifies this picture as probably the pendant described on the verso of an \"afterdrawing\" of the painting \"Autumn Landscape near Dresden\" (1829; private collection, Dresden; Bang no. 605) [see Provenance]; lists two related drawings (1826 and 1827; both Nasjonalgalleriet, Oslo), one of an anchor and the other of a woman and child on a beach; compares it to Friedrich's coastal landscapes, notably \"Evening on the Baltic\" (1826; Georg Schäfer Museum, Schweinfurt), based on another Dahl drawing of an anchor; mentions a variant of this picture (Barber Institute of Fine Arts, University of Birmingham; Bang no. 915) and an unsigned replica (private collection, Munich), possibly a student copy.\n\n\n\nSuzanne Ludvigsen. Danish Paintings of the Golden Age. Exh. cat., Artemis Fine Arts, Inc. New York, 1999, unpaginated, no. 16, ill. (color).\n\n\n\nSabine Rewald. Caspar David Friedrich: Moonwatchers. Exh. cat., The Metropolitan Museum of Art. New York, 2001, p. 50, no. 14, ill. (color), reproduces the studies for this picture.\n\n\n\nRichard Verdi. \"A Rediscovered 'Moonlight' by Johan Christian Dahl.\" Burlington Magazine 147 (February 2005), pp. 115–16, fig. 52, notes that the returning boat is presumably that of the child's father, adding \"since Dahl's father was himself a fisherman, this lends an unmistakably autobiographical note to the scene and makes it an unusually personal work in the artist's career.\" .\n\n\n\nPaul Spencer-Longhurst. Moonrise over Europe: JC Dahl and Romantic Landscape. Exh. cat., Birmingham Barber Institute of Fine Arts. London, 2006, pp. 41–43, 64, 66, 72, 74, 78, fig. 21 (color), suggests that the death of Dahl's two children in 1829 and his wife's pregnancy in 1830 inform the anecdotal nature of this picture with an element of pathos.\n\n\n\nSabine Rewald in \"Recent Acquisitions, A Selection: 2006–2007.\" Metropolitan Museum of Art Bulletin 65 (Fall 2007), p. 39, ill. (color).\n\n\n\nEsther Bell. \"Catalogue Raisonné of the Thaw Collection.\" Studying Nature: Oil Sketches from the Thaw Collection. Ed. Jennifer Tonkovich. New York, 2011, p. 114, no. 37, ill. (color), calls it \"Mother and Child by the Sea\".\n\n\n\n"}, {"url": "https://www.nasjonalmuseet.no/en/collection/object/NG.M.02891", "page_content": "It was landscape painting that captured Dahl’s imagination, and in Copenhagen he spent much of his time studying nature and the city’s art collections, where he copied seventeenth-century Dutch landscape paintings. He articulated early on his artistic programme: to further the great European legacy, but in the context of nature. When Dahl left Copenhagen in 1818 to travel around Europe, his first stop was in Dresden, one of the principal centres of German romanticism. One of the city’s leading artists, the unorthodox landscape painter Caspar David Friedrich, soon became Dahl’s close friend.\n\nDahl made several field trips to various regions around Dresden, and View from Bastei features the Elbe Valley in Saxony Switzerland. To highlight the region’s breathtaking nature, Dahl centred his composition on a trio of visitors standing on a rock that protrudes from a lofty cliff. Even though the painting was created in a studio, its vivid colours and atmospheric effects have the air of a nature study. The lighting and the sky have been closely observed, and the landscape is portrayed in great detail. Dahl’s realistic approach to painting landscapes – what he dubbed “the natural path” – diverges from his colleague Friedrich’s more abstract landscapes and their symbolic overtones, which in the 1820s would gradually influence how Dahl himself portrayed nature.\n\nText: Bodil Sørensen\n\nFrom \"Highlights. Art from Antiquity to 1945\", Nasjonalmuseet 2014, ISBN 978-82-8154-088-0"}, {"url": "http://www.renegadetribune.com/johan-christian-dahls-landscapes-of-scandinavia-and-germany/", "page_content": "Johan Christian Dahl (1788 – 1857) is considered by many to be the father of Norwegian landscape painting. He was the first great romantic painter in Norway, heralding in the “golden age” of Norwegian painting. However, much of his time was actually spent painting outside of Norway, though his love for his home country never diminished.\n\nFrom ArtNet:\n\nJohan Christian Dahl was a Norwegian Romantic painter known for his depictions of landscapes in Scandinavia and Germany. Dahl sought to convey the profundity he felt before nature through his paintings. Born Johan Christian Claussen Dahl on February 24, 1788 in Bergen, Norway, he grew up in a poor family his artistic talent was recognized when he was teenager. Dahl went on to study under Johan Georg Müller in Bergen and later at the Royal Danish Academy of Fine Arts in Copenhagen. Living in Denmark over the next 7 years, he cultivated the patronage of Prince Christian Frederik and was the subject of several exhibitions. After relocating to Dresden in 1818, the artist befriended Caspar David Friedrich, the esteemed German painter’s influence on Dahl is clear in his View of Dresden by Moonlight (1838). Though he settled in Dresden, Dahl began making regular trips back to the landscapes of Norway, producing works focused on the sublime views of fjords, mountains, and stormy seas. The artist died on October 14, 1857 in Dresden, Germany. Today, his works are held in the collections of the National Gallery in London, the Metropolitan Museum of Art in New York, and the Neue Pinakothek in Munich, among others."}, {"url": "https://www.metmuseum.org/art/collection/search/439362", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}, {"url": "https://www.metmuseum.org/art/collection/search/440407", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}]}