{"Johan Christian Dahl was best known for his paintings of Norwegian fjords and mountains.": [{"url": "https://www.wikiart.org/en/johan-christian-dahl", "page_content": "Johan Christian Claussen Dahl (24 February 1788 – 14 October 1857), often known as J. C. Dahl or I. C. Dahl, was a Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian Painter ever to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\n\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. Indeed, if one sets aside his own monumental artistic creations, his other activities on behalf of art, history, and culture would still have guaranteed him a place at the very heart of the artistic and cultural history of Norway. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Håkonshallen in Bergen.\n\n\n\nDahl came from a very simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\n\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller (no), whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\n\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://www.metmuseum.org/art/collection/search/441967", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}, {"url": "https://pantheon.world/profile/person/Johan_Christian_Dahl/", "page_content": "Johan Christian Dahl\n\nJohan Christian Claussen Dahl (24 February 1788 – 14 October 1857), often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Johan Christian Dahl has received more than 217,549 page views. His biography is available in 31 different languages on Wikipedia (up from 29 in 2019) . Johan Christian Dahl is the 357th most popular painter (up from 428th in 2019), the 53rd most popular biography from Norway (up from 68th in 2019) and the 3rd most popular Norwegian Painter.\n\nJohan Christian Dahl is most famous for his paintings of Norwegian landscapes."}, {"url": "https://www.nasjonalmuseet.no/en/collection/object/NG.M.03138", "page_content": "Dahl painted Winter at the Sognefjord in the following year. The painting shows the view from Nornes toward Fimreite on the other side of the fjord. As a battle site during the struggle for royal power in 1184, Fimreite held a special place in the national consciousness, while the mighty menhirs at Nornes testified to a heroic past.\n\nThe composition is based on a drawing that Dahl made at the site, but it has become more concentrated. The mountains have become steeper, and the monolith in the foreground forms a conspicuous vertical line toward the reflecting water and the diagonal lines in the foreground. The monolith also helps set the mood, as does the snow with its associations to the past and death, while the light from the morning sun on the monolith’s apex has been interpreted as a ray of hope; this fusion of form and content is something the painting has in common with Caspar David Friedrich’s symbolic landscapes. But above all, Dahl’s depiction pays homage to the majestic nature of Norway and the nation’s proud history.\n\nText: Bodil Sørensen\n\nFrom \"Highlights. Art from Antiquity to 1945\", Nasjonalmuseet 2014, ISBN 978-82-8154-088-0"}, {"url": "https://www.metmuseum.org/art/collection/search/438954", "page_content": "Use your arrow keys to navigate the tabs below, and your tab key to choose an item\n\nJørgen Hansen Koch. Letter to Johan Christian Dahl. May 28, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605], states his wish to purchase a small painting as a gift for his wife, to cost no more than 30 to 40 Species, and to be picked up from the artist by Koch's sister-in-law.\n\n\n\nJohan Christian Dahl. Diary entry. June 12, 1830 [Universitetsbiblioteket, Oslo, Ms. 1001, 8°; excerpt published in English transl. in Bang 1987, vol. 2, p. 213 under no. 641], notes receipt and content of Koch's letter dated May 28, 1830.\n\n\n\nJohan Christian Dahl. Letter to Jørgen Hansen Koch. October 8, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], proposes selling two smaller paintings to Koch for 40 Species (for both, including frames), to be paid to the artist's friend Cancelliraad Thomsen; describes the subject of this picture as \"a coast in moonlight where a woman and her child are waiting for an approaching boat bearing a close relation\"; states that both paintings will be sent in a few days.\n\n\n\nJørgen Hansen Koch. Letter to Johan Christian Dahl. December 14, 1830 [Det Kongelige Bibliotek, Copenhagen; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], states that the pictures have arrived, that the sum has been paid, and that he and his wife are pleased with both paintings.\n\n\n\nJohan Christian Dahl. Einnahmen für die Jahre 1824–1855. December 29, 1830 [Universitetsbiblioteket, Oslo, Ms. Fol. 1882k; excerpt published in English transl. in Bang 1987, vol. 2, p. 204 under no. 605, p. 213 under no. 641], notes in his account book that \"Via Thomsen received from Justidsraad [Counsellor] Koch in Copenhagen for two pictures – 60 rd.\".\n\n\n\nCarl Reitzel. Fortegnelse over Danske Kunstneres Arbejder paa de ved det Kgl. Akademi for de Skjønne Kunster i Aarene 1807–1882 afholdte Charlottenborg-Udstillinger. Copenhagen, 1883, p. 107, lists it under Exh. Copenhagen 1831 as \"Maaneskinsstykke,\" with J. H. Koch as owner and P. Koch as the \"assessor\" [see Bang 1987].\n\n\n\nMarie Lødrup Bang. Johan Christian Dahl, 1788–1857: Life and Works. Oslo, 1987, vol. 1, pp. 82, 171, 202 n. 38; vol. 2, pp. 204, 213, 280, 376, no. 641; vol. 3, pl. 641, identifies this picture as probably the pendant described on the verso of an \"afterdrawing\" of the painting \"Autumn Landscape near Dresden\" (1829; private collection, Dresden; Bang no. 605) [see Provenance]; lists two related drawings (1826 and 1827; both Nasjonalgalleriet, Oslo), one of an anchor and the other of a woman and child on a beach; compares it to Friedrich's coastal landscapes, notably \"Evening on the Baltic\" (1826; Georg Schäfer Museum, Schweinfurt), based on another Dahl drawing of an anchor; mentions a variant of this picture (Barber Institute of Fine Arts, University of Birmingham; Bang no. 915) and an unsigned replica (private collection, Munich), possibly a student copy.\n\n\n\nSuzanne Ludvigsen. Danish Paintings of the Golden Age. Exh. cat., Artemis Fine Arts, Inc. New York, 1999, unpaginated, no. 16, ill. (color).\n\n\n\nSabine Rewald. Caspar David Friedrich: Moonwatchers. Exh. cat., The Metropolitan Museum of Art. New York, 2001, p. 50, no. 14, ill. (color), reproduces the studies for this picture.\n\n\n\nRichard Verdi. \"A Rediscovered 'Moonlight' by Johan Christian Dahl.\" Burlington Magazine 147 (February 2005), pp. 115–16, fig. 52, notes that the returning boat is presumably that of the child's father, adding \"since Dahl's father was himself a fisherman, this lends an unmistakably autobiographical note to the scene and makes it an unusually personal work in the artist's career.\" .\n\n\n\nPaul Spencer-Longhurst. Moonrise over Europe: JC Dahl and Romantic Landscape. Exh. cat., Birmingham Barber Institute of Fine Arts. London, 2006, pp. 41–43, 64, 66, 72, 74, 78, fig. 21 (color), suggests that the death of Dahl's two children in 1829 and his wife's pregnancy in 1830 inform the anecdotal nature of this picture with an element of pathos.\n\n\n\nSabine Rewald in \"Recent Acquisitions, A Selection: 2006–2007.\" Metropolitan Museum of Art Bulletin 65 (Fall 2007), p. 39, ill. (color).\n\n\n\nEsther Bell. \"Catalogue Raisonné of the Thaw Collection.\" Studying Nature: Oil Sketches from the Thaw Collection. Ed. Jennifer Tonkovich. New York, 2011, p. 114, no. 37, ill. (color), calls it \"Mother and Child by the Sea\".\n\n\n\n"}, {"url": "https://www.metmuseum.org/art/collection/search/439362", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}, {"url": "https://www.metmuseum.org/art/collection/search/438159", "page_content": "Use your arrow keys to navigate the tabs below, and your tab key to choose an item\n\nLava, fire, and steam spew from the caldera of Mount Vesuvius above the Bay of Naples. Depicted from behind, a pair of finely attired visitors on their Grand Tour view the event up-close. Their guides and donkeys wait patiently in the foreground at the lower right. The Eruption of Vesuvius is a striking depiction of a force of nature that animated the European imagination after 1748, when Pompeii, buried by the eruption of 79 AD, was rediscovered. A few years later, Edmund Burke described major natural phenomena that inspire a sense of awe as “Sublime” in his treatise A Philosophical Enquiry into the Origin of our Ideas of the Sublime and Beautiful (1757). The text became foundational to the incipient Romantic era. By the early nineteenth century, visitors to Italy traveled south from Rome to Naples not only to see the city and its glorious Mediterranean setting, but with the hope of witnessing an eruption like the one depicted here.[1]\n\n\n\nThis painting was commissioned in 1821 by Dahl’s most important patron, Danish Crown Prince Christian Frederik, the future King Christian VIII, who eventually acquired eighteen works by the Norwegian artist. A longtime territory of Denmark’s, Norway received its own constitution in 1814, but ambitious Norwegians typically sojourned in Copenhagen to develop their skills after reaching the limits of educational possibilities in their still-provincial country. Dahl left his native Bergen in 1811, studying for seven years with the landscape painter Christian August Lorentzen (1749–1828) at the Royal Academy of Fine Art. It was there that Dahl first gained the attention of Christian Frederik. In 1818, Dahl moved to Dresden, where Christian Frederik visited him in the spring of 1819, en route to Italy. In May 1820, Dahl received an invitation to join the prince, who offered to cover his expenses. The painter left Dresden on June 13 and arrived at the palace of Quisisana, above Castellammare on the Bay of Naples, on August 11. He remained in Italy for ten months, leaving from Rome on June 21, 1821.\n\n\n\nVesuvius erupted on December 20, 1820, and Dahl ascended the volcano as quickly as he could to observe the phenomenon on the spot. The next day he painted a sketch, or study, to record what he had seen. On July 13, 1824, Christian Frederik wrote to Dahl, expressing pleasure that the artist was working on a painting of Vesuvius for him, which “judging from the sketch, cannot fail to impress.” This was presumably the sketch that Dahl executed immediately after the eruption, which Christian Frederik could have seen in Naples, or afterward, in Rome. That sketch is probably the one now in the Statens Museum for Kunst, Copenhagen, which is signed and dated December 24, 1820 (Bang 1987, no. 257). Dahl exhibited the present work in the Dresden Academy’s annual exhibition in 1824. It was delivered to the patron in January 1825 and exhibited at the Danish Academy’s annual exhibition in Copenhagen later that year.\n\n\n\nDahl painted two versions of this composition before he left Italy. One, dated February 21, 1821, is also in the Statens Museum (Bang 296). Another was produced in Rome in 1821 for the Prussian consul, Jacob Bartholdi, and is now in the KODE Art Museums, Bergen (Bang 316). There are at least four other versions, dated 1826 (Städel Museum, Frankfurt; Bang 510), 1845 (whereabouts unknown, Bang 1032), what may be a copy after the present work possibly executed by 1832 (Nasjonalmuseet, Oslo; Bang 1254), and another, possibly datable about 1820–24 (private collection, Salten, Norway, in 1987; Bang 1284).\n\n\n\nThere are two related drawings, a study of ships in the bay, dated “24 Octbr 1820,” and a study of the man to the right by the flames, signed, dated, and inscribed “Prof. Friedrich’s Figur. Dahl 1824.” (Nasjonalmuseet, Oslo, inv. nos. B 2600 and B 2726).\n\n\n\nThis entry is based on Bang 1987, vol. 1, pp. 50–63, 175–77, and pages noted above as well as under References.\n\n\n\nAsher Miller 2019\n\n\n\n[1] See Lucio Fino, Vesuvius and the Grand Tour: Vedute and Travel Memoirs from the 17th to the 19th Centuries, trans. Angela Federico, Naples, 2012."}, {"url": "https://artvee.com/artist/johan-christian-dahl/", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Bergenhus Fortress in Bergen.\n\nDahl came from a simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller [no], whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nDahl held that a landscape painting should not just depict a specific view, but should also say something about the land's nature and character – the greatness of its past and the life and work of its current inhabitants. The mood was often idyllic, often melancholy. When he added snow to a landscape he painted in the summer, it was not to show the light and colors of snow; it was to use snow as a symbol of death. As one critic has put it, “Unlike the radically Romantic works also appearing at the time, Dahl softens his landscape, introducing elements of genre painting by imbuing it with anecdotal materials: In the background a wisp of smoke rises from a cabin, perhaps the home of the hunter on the snow-covered field.” Thanks to Sagen's recommendations and to his own personal charm, Dahl soon gained access to the leading social circles in Copenhagen.\n\nDahl took part in annual art exhibitions in Copenhagen beginning in 1812, but his real breakthrough came in 1815, when he exhibited no fewer than 13 paintings. Prince Christian Frederik of Denmark, who developed an early interest in Dahl's artistic genius and saw to it that his works were purchased for the royal collection, became a lifelong friend and patron of the artist.\n\nIn 1816 C. W. Eckersberg returned from abroad with his paintings of Roman settings; Dahl was impressed at once, and they became good friends and exchanged pictures. Dahl's 1817 painting Den Store Kro i Fredensborg marked the real beginning of his lifelong production of oil paintings depicting natural subjects.\n\nAfter his success in Copenhagen, Dahl realized that he wanted to live as an independent, self-supporting artist. One challenge facing him was that the academic preference of the day was for historical paintings with moral messages. Landscapes were considered the lowest kind of art, and perhaps even not as art at all, but as a purely mechanical imitation of nature. The only landscapes that could be considered art, according to the academy, were ideal, imaginary landscapes in pastoral or heroic styles. In accordance with this reigning taste, Dahl attempted to give his Danish themes a certain atmospheric character in order to lift them up above what was considered a merely commercial level. But at the same time it was his deepest wish to provide a more faithful picture of Norwegian nature than were offered by the old-fashioned, dry paintings of Haas and Lorentzen. This desire was partly motivated by homesickness and patriotism, but it was also suited to the public taste of the day for “picturesque” works.\n\nDahl traveled to Dresden in September 1818. He arrived with introductions to the city's leading citizens and to major artists such as Caspar David Friedrich, who helped him establish himself there and became his close friend. One critic has written: “Friedrich's still, meticulously executed landscapes - products of an art informed by his strict Protestant upbringing and a seeking for the divine in nature - were justifiably famous by the time he and Dahl became acquainted. We are able to see his Two Men Contemplating the Moon (1819), which ranks among his greatest works, and features two \"Rückfiguren,\" or figures seen from behind, solemnly and companionably gazing at a young sickle moon from the edge of an old forest. 'Greifswald in Moonlight' (1816–17) depicts the artist's birthplace in Pomerania, on the Baltic coast: bathed in an even, gauzy moonlight, the ancient university town assumes an almost ethereal appearance.”\n\nFriedrich was fourteen years Dahl's elder and an established artist, but the two found in each other a shared love for nature and a shared enthusiasm for a way of depicting nature that was based on the study of nature itself rather than on the academic cliches that they both profoundly despised. One writer has put it this way: “A warm and sociable character, he soon met and became friendly with the more introverted and reclusive Friedrich, recording how they once walked together in the park of the Grösser Garten among 'many lovely trees of different kinds, and the moon looked beautiful behind the dark fir trees.'”\n\nTogether with Friedrich and Carl Gustav Carus, Dahl would become one of the Dresden painters of the period who exerted a decisive influence on German Romantic painting.\n\nIn Dresden, as in Copenhagen, Dahl traveled around the area to draw subjects that could be of use to him in larger works that would be painted later in his atelier. He wrote to Prince Christian Frederik in 1818 that “most of all I am representing nature in all its freedom and wildness.” Dahl found enough material in the Dresden area to supply motifs for his paintings, but he continued to paint imaginary landscapes with forests, mountains, and waterfalls. One such painting, completed in 1819, entitled Norsk fjellandskap med elv (Mountainous Norwegian landscape with river”), garnered great attention among younger artists who considered the striking natural quality of the painting a breath of fresh air on Dresden's stagnant art scene. Another monumental waterfall painting, completed the next year, was lavished with praised by the critic for Kunstblatt who said that Dahl was greater than Jacob van Ruisdael. Dahl was accepted into the Dresden academy in 1820.\n\nPrince Christian Frederik wrote to Dahl in 1820 from Italy and invited him to join him at the Gulf of Naples. Dahl was at the time courting a young woman named Emilie von Bloch, but felt he should take the prince up on his offer, so he married Emilie quickly and traveled to Italy the next day. He ended up spending 10 months in Italy. Though he missed his bride, the sojourn was a decisive factor in his artistic development. It was in Italy, with its strong southern light, that Dahl's art truly flowered. It forced him to see nature plain, without the mediation of the old masters' renderings of light and color.\n\nDahl went to Rome in February 1821. He spent a great deal of time visiting museums, meeting other artists, and painting pictures to sell. In addition to painting sights in Rome and pictures of the Gulf of Naples, he painted landscapes inspired by the mountains of Norway. Dahl said that not until he was in Rome did he truly appreciate Norwegian nature. In June 1821 Dahl returned north to Emilie and a quiet life of family and painting.\n\nDahl quickly became a member of Dresden's leading circles of poets, artists, and scientists, among them the archeologist C. A. Böttiger, publisher of Artistisches Notizenblatt, who ran a major article on Dahl in 1822.\n\nAs a member of the academy, Dahl always dedicated his time to young artists who sought him out. In 1824 he and Friedrich were named “extraordinary professors” who had no chair but who received a regular salary. In 1823 Dahl moved in with Friedrich, so that many of his students, such as Knud Baade, Peder Balke, and Thomas Fearnley, were equally influenced by both artists. “Well before their meeting,” writes one critic, “Dahl had also painted a number of 'moonlights' and, travelling in Europe, he was in the Bay of Naples in 1821 when Mount Vesuvius was active. Here he painted 'Boats on the Beach Near Naples', where fishing crafts lie at anchor in the calm, shimmering waters with the twin peaks of the mountain smoking and flaming behind. Predictably, after his close association with Friedrich began—the two families shared a house in Dresden from 1823—he was considerably influenced by him, but his own more spontaneous and painterly style soon prevailed. Clients sometimes commissioned pictures from them both, a tranquil coastal scene by Friedrich to pair with a more stormy subject from Dahl.”\n\nDahl never formed a “school” around himself, but rather preferred for his students to cultivate their own styles; it was against his principles and his respect for artistic freedom to try to inhibit his students' individuality. It was this impulse toward individuality that later caused him to turn down an offer of a permanent chair at the academy – he didn't want to feel compelled to show up for class when he was busy working on a painting.\n\nDahl continued his studies of nature in the area around Dresden when he had the time, or on longer trips which provided him with themes for his paintings. But most often he painted the view of the Elbe outside his windows in various kinds of light. Like John Constable, Dahl felt that the sky was an important part of a landscape painting, and he never grew tired of watching the clouds move over the flat plain. One critic has compared two paintings of Friedrich and Dahl: “In...Dahl's 'Mother and Child by the Sea', there are echoes of Friedrich's 'Woman by the Sea' (1818). Whereas in Friedrich's work a woman dressed for the windy weather sits idly watching five fishing boats sailing past, in Dahl's picture, there seems to be a more personal note, with echoes of his own upbringing in a seafaring community, as the mother and small child eagerly await the return of the little ship from the sea.” The same critic has written about one of his paintings of Dresden: “Dahl also commemorated the magnificent Baroque buildings of his adopted city, and a version of his View of Dresden by Moonlight (1838) has travelled from the National Museum of Art, Architecture, and Design in Oslo. This small picture, measuring only 18.5 x 34.5 cm, shows the dome of the Frauenkirche and the tower of the Hofkirche dominating the skyline; silvers and deep blue combine to give it a wonderful jewel-like effect, together with a certain elegiac quality, perhaps indicative of the artist's awareness that his long friendship with Friedrich was nearing an end.”\n\nAs Dahl wrote in 1828 to the director of the Dresden academy, he found the area around Dresden useful for nature studies, but the “real thing” was always missing; that was something he could only find in his mountainous homeland. He viewed himself as a “more Nordic painter” with a “love for seacoasts, mountains, waterfalls, sailboats, and pictures of the sea in daylight and moonlight.” He longed to return to Norway, but not until 1826 was he able to make a journey home.\n\nHe made subsequent trips to Norway in 1834, 1839, 1844, and 1850, mostly exploring and painting the mountains, leading to the monumental works Fortundalen (1836) and Stalheim (1842). During his visits to Norway he received “an enthusiastic welcome as a painter of renown.”\n\nA critic notes Dahl's late stylistic changes: “In his late Fjord at Sunset (1850), based on studies made earlier, free and adventurous brush strokes represent the cloud-swept sky and broken surface of the water. Here he has moved far away from the purity and intensity of Friedrich's oeuvre.”\n\nIn 1827 Emilie Dahl died in childbirth while having their fourth child, and two years later two of the older children died of scarlet fever. In January 1830, Dahl married his student Amalie von Bassewitz, but she, too, died in childbirth in December of that same year. Dahl was crushed, and many months passed before he was able to paint again. Some years later this youngest child also died, leaving Dahl with two surviving children, Siegwald and Caroline, who married the Norwegian minister Anders Sandøe Ørsted Bull 1848.\n\nDahl's trip to Norway in 1850 would be his last. He was aging and weak, but continued to paint landscapes in the mountains. This last journey to his homeland resulted in several magnificent works, including Måbødalen, Fra Stugunøset, and Hjelle i Valdres.\n\nDahl was among the founding fathers of the National Gallery of Norway (Norwegian: Nasjonalgalleriet), now the National Museum of Art, Architecture, and Design, and donated his own art collection to the institution. Together with Johan Sebastian Welhaven, Frederik Stang, and Henrik Heftye, he founded the Art Society in Oslo (Oslo Kunstforening).\n\nDahl died after a brief illness and was buried on 17 October 1857 in Dresden. In 1902, a statue of Dahl by Norwegian sculptor Ambrosia Tønnesen (1859–1948) was erected on the facade of the West Norway Museum of Decorative Art in Bergen. In 1934, his remains were brought back to Norway and buried in the cemetery of St. Jacob's Church (Sankt Jakob kirke) in Bergen.\n\nJ.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century. His Romantic yet naturalistic interpretations of Norwegian scenery were greatly admired in Norway as well as on the European continent, particularly in Denmark and Germany."}, {"url": "https://artsandculture.google.com/entity/johan-christian-dahl/m06p68x", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally.\n\nShow less Read more Wikipedia"}, {"url": "http://www.renegadetribune.com/johan-christian-dahls-landscapes-of-scandinavia-and-germany/", "page_content": "Johan Christian Dahl (1788 – 1857) is considered by many to be the father of Norwegian landscape painting. He was the first great romantic painter in Norway, heralding in the “golden age” of Norwegian painting. However, much of his time was actually spent painting outside of Norway, though his love for his home country never diminished.\n\nFrom ArtNet:\n\nJohan Christian Dahl was a Norwegian Romantic painter known for his depictions of landscapes in Scandinavia and Germany. Dahl sought to convey the profundity he felt before nature through his paintings. Born Johan Christian Claussen Dahl on February 24, 1788 in Bergen, Norway, he grew up in a poor family his artistic talent was recognized when he was teenager. Dahl went on to study under Johan Georg Müller in Bergen and later at the Royal Danish Academy of Fine Arts in Copenhagen. Living in Denmark over the next 7 years, he cultivated the patronage of Prince Christian Frederik and was the subject of several exhibitions. After relocating to Dresden in 1818, the artist befriended Caspar David Friedrich, the esteemed German painter’s influence on Dahl is clear in his View of Dresden by Moonlight (1838). Though he settled in Dresden, Dahl began making regular trips back to the landscapes of Norway, producing works focused on the sublime views of fjords, mountains, and stormy seas. The artist died on October 14, 1857 in Dresden, Germany. Today, his works are held in the collections of the National Gallery in London, the Metropolitan Museum of Art in New York, and the Neue Pinakothek in Munich, among others."}], "Johan Christian Dahl often depicted wild storms and dramatic light in his paintings.": [{"url": "https://artsandculture.google.com/entity/%E7%BA%A6%E7%BF%B0%C2%B7%E5%85%8B%E9%87%8C%E6%96%AF%E8%92%82%E5%AE%89%C2%B7%E8%BE%BE%E5%B0%94/m06p68x", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally.\n\nShow less Read more Wikipedia"}, {"url": "https://www.wikiart.org/en/johan-christian-dahl", "page_content": "Johan Christian Claussen Dahl (24 February 1788 – 14 October 1857), often known as J. C. Dahl or I. C. Dahl, was a Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian Painter ever to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\n\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. Indeed, if one sets aside his own monumental artistic creations, his other activities on behalf of art, history, and culture would still have guaranteed him a place at the very heart of the artistic and cultural history of Norway. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Håkonshallen in Bergen.\n\n\n\nDahl came from a very simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\n\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller (no), whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\n\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://www.metmuseum.org/art/collection/search/441967", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}, {"url": "https://artvee.com/artist/johan-christian-dahl/", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Bergenhus Fortress in Bergen.\n\nDahl came from a simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller [no], whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nDahl held that a landscape painting should not just depict a specific view, but should also say something about the land's nature and character – the greatness of its past and the life and work of its current inhabitants. The mood was often idyllic, often melancholy. When he added snow to a landscape he painted in the summer, it was not to show the light and colors of snow; it was to use snow as a symbol of death. As one critic has put it, “Unlike the radically Romantic works also appearing at the time, Dahl softens his landscape, introducing elements of genre painting by imbuing it with anecdotal materials: In the background a wisp of smoke rises from a cabin, perhaps the home of the hunter on the snow-covered field.” Thanks to Sagen's recommendations and to his own personal charm, Dahl soon gained access to the leading social circles in Copenhagen.\n\nDahl took part in annual art exhibitions in Copenhagen beginning in 1812, but his real breakthrough came in 1815, when he exhibited no fewer than 13 paintings. Prince Christian Frederik of Denmark, who developed an early interest in Dahl's artistic genius and saw to it that his works were purchased for the royal collection, became a lifelong friend and patron of the artist.\n\nIn 1816 C. W. Eckersberg returned from abroad with his paintings of Roman settings; Dahl was impressed at once, and they became good friends and exchanged pictures. Dahl's 1817 painting Den Store Kro i Fredensborg marked the real beginning of his lifelong production of oil paintings depicting natural subjects.\n\nAfter his success in Copenhagen, Dahl realized that he wanted to live as an independent, self-supporting artist. One challenge facing him was that the academic preference of the day was for historical paintings with moral messages. Landscapes were considered the lowest kind of art, and perhaps even not as art at all, but as a purely mechanical imitation of nature. The only landscapes that could be considered art, according to the academy, were ideal, imaginary landscapes in pastoral or heroic styles. In accordance with this reigning taste, Dahl attempted to give his Danish themes a certain atmospheric character in order to lift them up above what was considered a merely commercial level. But at the same time it was his deepest wish to provide a more faithful picture of Norwegian nature than were offered by the old-fashioned, dry paintings of Haas and Lorentzen. This desire was partly motivated by homesickness and patriotism, but it was also suited to the public taste of the day for “picturesque” works.\n\nDahl traveled to Dresden in September 1818. He arrived with introductions to the city's leading citizens and to major artists such as Caspar David Friedrich, who helped him establish himself there and became his close friend. One critic has written: “Friedrich's still, meticulously executed landscapes - products of an art informed by his strict Protestant upbringing and a seeking for the divine in nature - were justifiably famous by the time he and Dahl became acquainted. We are able to see his Two Men Contemplating the Moon (1819), which ranks among his greatest works, and features two \"Rückfiguren,\" or figures seen from behind, solemnly and companionably gazing at a young sickle moon from the edge of an old forest. 'Greifswald in Moonlight' (1816–17) depicts the artist's birthplace in Pomerania, on the Baltic coast: bathed in an even, gauzy moonlight, the ancient university town assumes an almost ethereal appearance.”\n\nFriedrich was fourteen years Dahl's elder and an established artist, but the two found in each other a shared love for nature and a shared enthusiasm for a way of depicting nature that was based on the study of nature itself rather than on the academic cliches that they both profoundly despised. One writer has put it this way: “A warm and sociable character, he soon met and became friendly with the more introverted and reclusive Friedrich, recording how they once walked together in the park of the Grösser Garten among 'many lovely trees of different kinds, and the moon looked beautiful behind the dark fir trees.'”\n\nTogether with Friedrich and Carl Gustav Carus, Dahl would become one of the Dresden painters of the period who exerted a decisive influence on German Romantic painting.\n\nIn Dresden, as in Copenhagen, Dahl traveled around the area to draw subjects that could be of use to him in larger works that would be painted later in his atelier. He wrote to Prince Christian Frederik in 1818 that “most of all I am representing nature in all its freedom and wildness.” Dahl found enough material in the Dresden area to supply motifs for his paintings, but he continued to paint imaginary landscapes with forests, mountains, and waterfalls. One such painting, completed in 1819, entitled Norsk fjellandskap med elv (Mountainous Norwegian landscape with river”), garnered great attention among younger artists who considered the striking natural quality of the painting a breath of fresh air on Dresden's stagnant art scene. Another monumental waterfall painting, completed the next year, was lavished with praised by the critic for Kunstblatt who said that Dahl was greater than Jacob van Ruisdael. Dahl was accepted into the Dresden academy in 1820.\n\nPrince Christian Frederik wrote to Dahl in 1820 from Italy and invited him to join him at the Gulf of Naples. Dahl was at the time courting a young woman named Emilie von Bloch, but felt he should take the prince up on his offer, so he married Emilie quickly and traveled to Italy the next day. He ended up spending 10 months in Italy. Though he missed his bride, the sojourn was a decisive factor in his artistic development. It was in Italy, with its strong southern light, that Dahl's art truly flowered. It forced him to see nature plain, without the mediation of the old masters' renderings of light and color.\n\nDahl went to Rome in February 1821. He spent a great deal of time visiting museums, meeting other artists, and painting pictures to sell. In addition to painting sights in Rome and pictures of the Gulf of Naples, he painted landscapes inspired by the mountains of Norway. Dahl said that not until he was in Rome did he truly appreciate Norwegian nature. In June 1821 Dahl returned north to Emilie and a quiet life of family and painting.\n\nDahl quickly became a member of Dresden's leading circles of poets, artists, and scientists, among them the archeologist C. A. Böttiger, publisher of Artistisches Notizenblatt, who ran a major article on Dahl in 1822.\n\nAs a member of the academy, Dahl always dedicated his time to young artists who sought him out. In 1824 he and Friedrich were named “extraordinary professors” who had no chair but who received a regular salary. In 1823 Dahl moved in with Friedrich, so that many of his students, such as Knud Baade, Peder Balke, and Thomas Fearnley, were equally influenced by both artists. “Well before their meeting,” writes one critic, “Dahl had also painted a number of 'moonlights' and, travelling in Europe, he was in the Bay of Naples in 1821 when Mount Vesuvius was active. Here he painted 'Boats on the Beach Near Naples', where fishing crafts lie at anchor in the calm, shimmering waters with the twin peaks of the mountain smoking and flaming behind. Predictably, after his close association with Friedrich began—the two families shared a house in Dresden from 1823—he was considerably influenced by him, but his own more spontaneous and painterly style soon prevailed. Clients sometimes commissioned pictures from them both, a tranquil coastal scene by Friedrich to pair with a more stormy subject from Dahl.”\n\nDahl never formed a “school” around himself, but rather preferred for his students to cultivate their own styles; it was against his principles and his respect for artistic freedom to try to inhibit his students' individuality. It was this impulse toward individuality that later caused him to turn down an offer of a permanent chair at the academy – he didn't want to feel compelled to show up for class when he was busy working on a painting.\n\nDahl continued his studies of nature in the area around Dresden when he had the time, or on longer trips which provided him with themes for his paintings. But most often he painted the view of the Elbe outside his windows in various kinds of light. Like John Constable, Dahl felt that the sky was an important part of a landscape painting, and he never grew tired of watching the clouds move over the flat plain. One critic has compared two paintings of Friedrich and Dahl: “In...Dahl's 'Mother and Child by the Sea', there are echoes of Friedrich's 'Woman by the Sea' (1818). Whereas in Friedrich's work a woman dressed for the windy weather sits idly watching five fishing boats sailing past, in Dahl's picture, there seems to be a more personal note, with echoes of his own upbringing in a seafaring community, as the mother and small child eagerly await the return of the little ship from the sea.” The same critic has written about one of his paintings of Dresden: “Dahl also commemorated the magnificent Baroque buildings of his adopted city, and a version of his View of Dresden by Moonlight (1838) has travelled from the National Museum of Art, Architecture, and Design in Oslo. This small picture, measuring only 18.5 x 34.5 cm, shows the dome of the Frauenkirche and the tower of the Hofkirche dominating the skyline; silvers and deep blue combine to give it a wonderful jewel-like effect, together with a certain elegiac quality, perhaps indicative of the artist's awareness that his long friendship with Friedrich was nearing an end.”\n\nAs Dahl wrote in 1828 to the director of the Dresden academy, he found the area around Dresden useful for nature studies, but the “real thing” was always missing; that was something he could only find in his mountainous homeland. He viewed himself as a “more Nordic painter” with a “love for seacoasts, mountains, waterfalls, sailboats, and pictures of the sea in daylight and moonlight.” He longed to return to Norway, but not until 1826 was he able to make a journey home.\n\nHe made subsequent trips to Norway in 1834, 1839, 1844, and 1850, mostly exploring and painting the mountains, leading to the monumental works Fortundalen (1836) and Stalheim (1842). During his visits to Norway he received “an enthusiastic welcome as a painter of renown.”\n\nA critic notes Dahl's late stylistic changes: “In his late Fjord at Sunset (1850), based on studies made earlier, free and adventurous brush strokes represent the cloud-swept sky and broken surface of the water. Here he has moved far away from the purity and intensity of Friedrich's oeuvre.”\n\nIn 1827 Emilie Dahl died in childbirth while having their fourth child, and two years later two of the older children died of scarlet fever. In January 1830, Dahl married his student Amalie von Bassewitz, but she, too, died in childbirth in December of that same year. Dahl was crushed, and many months passed before he was able to paint again. Some years later this youngest child also died, leaving Dahl with two surviving children, Siegwald and Caroline, who married the Norwegian minister Anders Sandøe Ørsted Bull 1848.\n\nDahl's trip to Norway in 1850 would be his last. He was aging and weak, but continued to paint landscapes in the mountains. This last journey to his homeland resulted in several magnificent works, including Måbødalen, Fra Stugunøset, and Hjelle i Valdres.\n\nDahl was among the founding fathers of the National Gallery of Norway (Norwegian: Nasjonalgalleriet), now the National Museum of Art, Architecture, and Design, and donated his own art collection to the institution. Together with Johan Sebastian Welhaven, Frederik Stang, and Henrik Heftye, he founded the Art Society in Oslo (Oslo Kunstforening).\n\nDahl died after a brief illness and was buried on 17 October 1857 in Dresden. In 1902, a statue of Dahl by Norwegian sculptor Ambrosia Tønnesen (1859–1948) was erected on the facade of the West Norway Museum of Decorative Art in Bergen. In 1934, his remains were brought back to Norway and buried in the cemetery of St. Jacob's Church (Sankt Jakob kirke) in Bergen.\n\nJ.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century. His Romantic yet naturalistic interpretations of Norwegian scenery were greatly admired in Norway as well as on the European continent, particularly in Denmark and Germany."}, {"url": "https://www.metmuseum.org/toah/hd/roma/hd_roma.htm", "page_content": "Romanticism, first defined as an aesthetic in literary criticism around 1800, gained momentum as an artistic movement in France and Britain in the early decades of the nineteenth century and flourished until mid-century. With its emphasis on the imagination and emotion, Romanticism emerged as a response to the disillusionment with the Enlightenment values of reason and order in the aftermath of the French Revolution of 1789. Though often posited in opposition to Neoclassicism, early Romanticism was shaped largely by artists trained in Jacques Louis David’s studio, including Baron Antoine Jean Gros, Anne Louis Girodet-Trioson, and Jean Auguste Dominique Ingres. This blurring of stylistic boundaries is best expressed in Ingres’ Apotheosis of Homer and Eugène Delacroix’s Death of Sardanapalus (both Museé du Louvre, Paris), which polarized the public at the Salon of 1827 in Paris. While Ingres’ work seemingly embodied the ordered classicism of David in contrast to the disorder and tumult of Delacroix, in fact both works draw from the Davidian tradition but each ultimately subverts that model, asserting the originality of the artist—a central notion of Romanticism.\n\nIn Romantic art, nature—with its uncontrollable power, unpredictability, and potential for cataclysmic extremes—offered an alternative to the ordered world of Enlightenment thought. The violent and terrifying images of nature conjured by Romantic artists recall the eighteenth-century aesthetic of the Sublime. As articulated by the British statesman Edmund Burke in a 1757 treatise and echoed by the French philosopher Denis Diderot a decade later, “all that stuns the soul, all that imprints a feeling of terror, leads to the sublime.” In French and British painting of the late eighteenth and early nineteenth centuries, the recurrence of images of shipwrecks (2003.42.56) and other representations of man’s struggle against the awesome power of nature manifest this sensibility. Scenes of shipwrecks culminated in 1819 with Théodore Gericault’s strikingly original Raft of the Medusa (Louvre), based on a contemporary event. In its horrifying explicitness, emotional intensity, and conspicuous lack of a hero, The Raft of the Medusa became an icon of the emerging Romantic style. Similarly, J. M. W. Turner’s 1812 depiction of Hannibal and his army crossing the Alps (Tate, London), in which the general and his troops are dwarfed by the overwhelming scale of the landscape and engulfed in the swirling vortex of snow, embodies the Romantic sensibility in landscape painting. Gericault also explored the Romantic landscape in a series of views representing different times of day; in Evening: Landscape with an Aqueduct (1989.183), the dramatic sky, blasted tree, and classical ruins evoke a sense of melancholic reverie.\n\nAnother facet of the Romantic attitude toward nature emerges in the landscapes of John Constable, whose art expresses his response to his native English countryside. For his major paintings, Constable executed full-scale sketches, as in a view of Salisbury Cathedral (50.145.8); he wrote that a sketch represents “nothing but one state of mind—that which you were in at the time.” When his landscapes were exhibited in Paris at the Salon of 1824, critics and artists embraced his art as “nature itself.” Constable’s subjective, highly personal view of nature accords with the individuality that is a central tenet of Romanticism.\n\nThis interest in the individual and subjective—at odds with eighteenth-century rationalism—is mirrored in the Romantic approach to portraiture. Traditionally, records of individual likeness, portraits became vehicles for expressing a range of psychological and emotional states in the hands of Romantic painters. Gericault probed the extremes of mental illness in his portraits of psychiatric patients, as well as the darker side of childhood in his unconventional portrayals of children. In his portrait of Alfred Dedreux (41.17), a young boy of about five or six, the child appears intensely serious, more adult than childlike, while the dark clouds in the background convey an unsettling, ominous quality.\n\nSuch explorations of emotional states extended into the animal kingdom, marking the Romantic fascination with animals as both forces of nature and metaphors for human behavior. This curiosity is manifest in the sketches of wild animals done in the menageries of Paris and London in the 1820s by artists such as Delacroix, Antoine-Louis Barye, and Edwin Landseer. Gericault depicted horses of all breeds—from workhorses to racehorses—in his work. Lord Byron’s 1819 tale of Mazeppa tied to a wild horse captivated Romantic artists from Delacroix to Théodore Chassériau, who exploited the violence and passion inherent in the story. Similarly, Horace Vernet, who exhibited two scenes from Mazeppa in the Salon of 1827 (both Musée Calvet, Avignon), also painted the riderless horse race that marked the end of the Roman Carnival, which he witnessed during his 1820 visit to Rome. His oil sketch (87.15.47) captures the frenetic energy of the spectacle, just before the start of the race. Images of wild, unbridled animals evoked primal states that stirred the Romantic imagination.\n\nAlong with plumbing emotional and behavioral extremes, Romantic artists expanded the repertoire of subject matter, rejecting the didacticism of Neoclassical history painting in favor of imaginary and exotic subjects. Orientalism and the worlds of literature stimulated new dialogues with the past as well as the present. Ingres’ sinuous odalisques (38.65) reflect the contemporary fascination with the exoticism of the harem, albeit a purely imagined Orient, as he never traveled beyond Italy. In 1832, Delacroix journeyed to Morocco, and his trip to North Africa prompted other artists to follow. In 1846, Chassériau documented his visit to Algeria in notebooks filled with watercolors and drawings, which later served as models for paintings done in his Paris studio (64.188). Literature offered an alternative form of escapism. The novels of Sir Walter Scott, the poetry of Lord Byron, and the drama of Shakespeare transported art to other worlds and eras. Medieval England is the setting of Delacroix’s tumultuous Abduction of Rebecca (03.30), which illustrates an episode from Sir Walter Scott’s Ivanhoe.\n\nIn its stylistic diversity and range of subjects, Romanticism defies simple categorization. As the poet and critic Charles Baudelaire wrote in 1846, “Romanticism is precisely situated neither in choice of subject nor in exact truth, but in a way of feeling.”"}, {"url": "https://commons.wikimedia.org/wiki/Category:Paintings_of_ships_in_distress", "page_content": "This category has the following 23 subcategories, out of 23 total.\n\nMedia in category \"Paintings of ships in distress\"\n\nThe following 200 files are in this category, out of 352 total.\n\n(previous page) ( next page (previous page) ( next page"}, {"url": "https://www.sothebys.com/en/auctions/ecatalogue/2012/european-paintings/lot.27.html", "page_content": "Description\n\nJ. C. Dahl\n\nLandscape in Evening Light\n\noil on panel\n\n18 by 22.5cm., 7 by 9in.\n\nProvenance\n\nMrs. von der Decken, Dresden (a gift from the artist in Christmas 1853)\n\nGalleri Bellman, Oslo\n\nPrivate Collection (acquired from the above in 1981; sale: Sotheby's, New York, 24 January 2008, lot 83)\n\nPurchased at the above sale by the present owner\n\nExhibited\n\nCambridge, Massachusetts, Harvard University Art Museums, on loan 1981-2002 & 2004-7\n\nLiterature\n\nMarie Lodrup Bang, Johan Christian Dahl, 1788-1857: Life and Works, Oslo, 1987, vol. II, p. 341, no. 1150, catalogued (incorrectly as on canvas); vol. III, pl. 495, illustrated\n\nCondition\n\nThe panel is slightly bowed convex along the left and right edges. Under UV light there are some very minor scattered retouchings, notably in the extreme upper left and the dark land below the horizon. Overall this work is in good condition, clean and ready to hang. Held in a simple gold-painted carved wood frame.\n\n\"In response to your inquiry, we are pleased to provide you with a general report of the condition of the property described above. Since we are not professional conservators or restorers, we urge you to consult with a restorer or conservator of your choice who will be better able to provide a detailed, professional report. Prospective buyers should inspect each lot to satisfy themselves as to condition and must understand that any statement made by Sotheby's is merely a subjective, qualified opinion. Prospective buyers should also refer to any Important Notices regarding this sale, which are printed in the Sale Catalogue.\n\nNOTWITHSTANDING THIS REPORT OR ANY DISCUSSIONS CONCERNING A LOT, ALL LOTS ARE OFFERED AND SOLD AS IS\" IN ACCORDANCE WITH THE CONDITIONS OF BUSINESS PRINTED IN THE SALE CATALOGUE.\"\n\nCatalogue Note"}, {"url": "https://artsandculture.google.com/entity/johan-christian-dahl/m06p68x", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally.\n\nShow less Read more Wikipedia"}, {"url": "https://www.askart.com/auction_records/Johan_Christian_Clausen_Dahl/11096051/Johan_Christian_Clausen_Dahl.aspx", "page_content": "[Displaying 1000 of 9990 characters.]\n\nArtist auction records\n\nArtist artworks for sale and wanted\n\nResearch resources\n\nSimilar artists\n\nSales Stats . 202 auction records.\n\nJohan Christian Clausen Dahl (1788 - 1857) was active/lived in Denmark, Norway. Johan Dahl is known for Romantic landscape and marine painting.Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and one of the greatest European artists of all time.He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian Painter ever to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day.Although Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. Indeed, if one sets aside his own monumental artistic creations, his other activities on behalf of art, history, and culture would still have guaranteed him a place at the very heart of the artistic and cultural history of Norway.Dahl came from a very simple backg .... askART's database currently holds 202 auction lots for Johan Christian Clausen Dahl (of which 147 auction records sold and 0 are upcoming at auction.). There are 0 artworks for sale on our website by galleries and art dealers . There are 0 galleries and art dealers listing works of art by Johan Christian Clausen Dahl as either \"Wanted\" or \"For Sale\" .. askART lists Johan Christian Clausen Dahl in 0 of its research Essays. Johan Christian Clausen Dahl has 5 artist signature examples available in our database.. There are 24 similar (related) artists for Johan Christian Clausen Dahl available: Peter Christian Thamsen Skovgaard"}, {"url": "https://artvee.com/artist/johan-christian-dahl/?per_page=70", "page_content": "Johan Christian Claussen Dahl, often known as J. C. Dahl or I. C. Dahl, was a Danish-Norwegian artist who is considered the first great romantic painter in Norway, the founder of the \"golden age\" of Norwegian painting, and, by some, one of the greatest European artists of all time. He is often described as \"the father of Norwegian landscape painting\" and is regarded as the first Norwegian painter to reach a level of artistic accomplishment comparable to that attained by the greatest European artists of his day. He was also the first to acquire genuine fame and cultural renown abroad. As one critic has put it, \"J.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century.\n\nAlthough Dahl spent much of his life outside of Norway, his love for his country is clear in the motifs he chose for his paintings and in his extraordinary efforts on behalf of Norwegian culture generally. He was, for example, a key figure in the founding of the Norwegian National Gallery and of several other major art institutions in Norway, as well as in the preservation of Norwegian stave churches and the restoration of the Nidaros Cathedral in Trondheim and Bergenhus Fortress in Bergen.\n\nDahl came from a simple background – his father was a modest fisherman in Bergen, Norway – and he would later look back at his youth with bitterness. He regretted that he never had a \"real teacher\" in his childhood and, despite all his spectacular success, he believed that if he had been more fortunate in his birth, he would have achieved even more than he had.\n\nAs a boy, Dahl was educated by a sympathetic mentor at the Bergen Cathedral who at first thought that this bright student would make a good priest, but then, recognizing his remarkably precocious artistic ability, arranged for him to be trained as an artist. From 1803 to 1809 Dahl studied with the painter Johan Georg Müller [no], whose workshop was the most important one in Bergen at the time. Still, Dahl looked back on his teacher as having kept him in ignorance in order to exploit him, putting him to work painting theatrical sets, portraits, and views of Bergen and its surroundings. Another mentor, Lyder Sagen, showed the aspiring artist books about art and awakened his interest in historical and patriotic subjects. It was also Sagen who took up a collection that made it possible for Dahl to go to Copenhagen in 1811 to complete his education at the academy there.\n\nAs important as Dahl's studies at the academy in Copenhagen were his experiences in the surrounding countryside and in the city's art collections. In 1812 he wrote to Sagen that the landscape artists he most wished to emulate were Ruisdahl and Everdingen, and for that reason he was studying “nature above all,” Dahl's artistic program was, then, already in place: he would become a part of the great landscape tradition, but he would also be as faithful as possible to nature itself.\n\nDahl held that a landscape painting should not just depict a specific view, but should also say something about the land's nature and character – the greatness of its past and the life and work of its current inhabitants. The mood was often idyllic, often melancholy. When he added snow to a landscape he painted in the summer, it was not to show the light and colors of snow; it was to use snow as a symbol of death. As one critic has put it, “Unlike the radically Romantic works also appearing at the time, Dahl softens his landscape, introducing elements of genre painting by imbuing it with anecdotal materials: In the background a wisp of smoke rises from a cabin, perhaps the home of the hunter on the snow-covered field.” Thanks to Sagen's recommendations and to his own personal charm, Dahl soon gained access to the leading social circles in Copenhagen.\n\nDahl took part in annual art exhibitions in Copenhagen beginning in 1812, but his real breakthrough came in 1815, when he exhibited no fewer than 13 paintings. Prince Christian Frederik of Denmark, who developed an early interest in Dahl's artistic genius and saw to it that his works were purchased for the royal collection, became a lifelong friend and patron of the artist.\n\nIn 1816 C. W. Eckersberg returned from abroad with his paintings of Roman settings; Dahl was impressed at once, and they became good friends and exchanged pictures. Dahl's 1817 painting Den Store Kro i Fredensborg marked the real beginning of his lifelong production of oil paintings depicting natural subjects.\n\nAfter his success in Copenhagen, Dahl realized that he wanted to live as an independent, self-supporting artist. One challenge facing him was that the academic preference of the day was for historical paintings with moral messages. Landscapes were considered the lowest kind of art, and perhaps even not as art at all, but as a purely mechanical imitation of nature. The only landscapes that could be considered art, according to the academy, were ideal, imaginary landscapes in pastoral or heroic styles. In accordance with this reigning taste, Dahl attempted to give his Danish themes a certain atmospheric character in order to lift them up above what was considered a merely commercial level. But at the same time it was his deepest wish to provide a more faithful picture of Norwegian nature than were offered by the old-fashioned, dry paintings of Haas and Lorentzen. This desire was partly motivated by homesickness and patriotism, but it was also suited to the public taste of the day for “picturesque” works.\n\nDahl traveled to Dresden in September 1818. He arrived with introductions to the city's leading citizens and to major artists such as Caspar David Friedrich, who helped him establish himself there and became his close friend. One critic has written: “Friedrich's still, meticulously executed landscapes - products of an art informed by his strict Protestant upbringing and a seeking for the divine in nature - were justifiably famous by the time he and Dahl became acquainted. We are able to see his Two Men Contemplating the Moon (1819), which ranks among his greatest works, and features two \"Rückfiguren,\" or figures seen from behind, solemnly and companionably gazing at a young sickle moon from the edge of an old forest. 'Greifswald in Moonlight' (1816–17) depicts the artist's birthplace in Pomerania, on the Baltic coast: bathed in an even, gauzy moonlight, the ancient university town assumes an almost ethereal appearance.”\n\nFriedrich was fourteen years Dahl's elder and an established artist, but the two found in each other a shared love for nature and a shared enthusiasm for a way of depicting nature that was based on the study of nature itself rather than on the academic cliches that they both profoundly despised. One writer has put it this way: “A warm and sociable character, he soon met and became friendly with the more introverted and reclusive Friedrich, recording how they once walked together in the park of the Grösser Garten among 'many lovely trees of different kinds, and the moon looked beautiful behind the dark fir trees.'”\n\nTogether with Friedrich and Carl Gustav Carus, Dahl would become one of the Dresden painters of the period who exerted a decisive influence on German Romantic painting.\n\nIn Dresden, as in Copenhagen, Dahl traveled around the area to draw subjects that could be of use to him in larger works that would be painted later in his atelier. He wrote to Prince Christian Frederik in 1818 that “most of all I am representing nature in all its freedom and wildness.” Dahl found enough material in the Dresden area to supply motifs for his paintings, but he continued to paint imaginary landscapes with forests, mountains, and waterfalls. One such painting, completed in 1819, entitled Norsk fjellandskap med elv (Mountainous Norwegian landscape with river”), garnered great attention among younger artists who considered the striking natural quality of the painting a breath of fresh air on Dresden's stagnant art scene. Another monumental waterfall painting, completed the next year, was lavished with praised by the critic for Kunstblatt who said that Dahl was greater than Jacob van Ruisdael. Dahl was accepted into the Dresden academy in 1820.\n\nPrince Christian Frederik wrote to Dahl in 1820 from Italy and invited him to join him at the Gulf of Naples. Dahl was at the time courting a young woman named Emilie von Bloch, but felt he should take the prince up on his offer, so he married Emilie quickly and traveled to Italy the next day. He ended up spending 10 months in Italy. Though he missed his bride, the sojourn was a decisive factor in his artistic development. It was in Italy, with its strong southern light, that Dahl's art truly flowered. It forced him to see nature plain, without the mediation of the old masters' renderings of light and color.\n\nDahl went to Rome in February 1821. He spent a great deal of time visiting museums, meeting other artists, and painting pictures to sell. In addition to painting sights in Rome and pictures of the Gulf of Naples, he painted landscapes inspired by the mountains of Norway. Dahl said that not until he was in Rome did he truly appreciate Norwegian nature. In June 1821 Dahl returned north to Emilie and a quiet life of family and painting.\n\nDahl quickly became a member of Dresden's leading circles of poets, artists, and scientists, among them the archeologist C. A. Böttiger, publisher of Artistisches Notizenblatt, who ran a major article on Dahl in 1822.\n\nAs a member of the academy, Dahl always dedicated his time to young artists who sought him out. In 1824 he and Friedrich were named “extraordinary professors” who had no chair but who received a regular salary. In 1823 Dahl moved in with Friedrich, so that many of his students, such as Knud Baade, Peder Balke, and Thomas Fearnley, were equally influenced by both artists. “Well before their meeting,” writes one critic, “Dahl had also painted a number of 'moonlights' and, travelling in Europe, he was in the Bay of Naples in 1821 when Mount Vesuvius was active. Here he painted 'Boats on the Beach Near Naples', where fishing crafts lie at anchor in the calm, shimmering waters with the twin peaks of the mountain smoking and flaming behind. Predictably, after his close association with Friedrich began—the two families shared a house in Dresden from 1823—he was considerably influenced by him, but his own more spontaneous and painterly style soon prevailed. Clients sometimes commissioned pictures from them both, a tranquil coastal scene by Friedrich to pair with a more stormy subject from Dahl.”\n\nDahl never formed a “school” around himself, but rather preferred for his students to cultivate their own styles; it was against his principles and his respect for artistic freedom to try to inhibit his students' individuality. It was this impulse toward individuality that later caused him to turn down an offer of a permanent chair at the academy – he didn't want to feel compelled to show up for class when he was busy working on a painting.\n\nDahl continued his studies of nature in the area around Dresden when he had the time, or on longer trips which provided him with themes for his paintings. But most often he painted the view of the Elbe outside his windows in various kinds of light. Like John Constable, Dahl felt that the sky was an important part of a landscape painting, and he never grew tired of watching the clouds move over the flat plain. One critic has compared two paintings of Friedrich and Dahl: “In...Dahl's 'Mother and Child by the Sea', there are echoes of Friedrich's 'Woman by the Sea' (1818). Whereas in Friedrich's work a woman dressed for the windy weather sits idly watching five fishing boats sailing past, in Dahl's picture, there seems to be a more personal note, with echoes of his own upbringing in a seafaring community, as the mother and small child eagerly await the return of the little ship from the sea.” The same critic has written about one of his paintings of Dresden: “Dahl also commemorated the magnificent Baroque buildings of his adopted city, and a version of his View of Dresden by Moonlight (1838) has travelled from the National Museum of Art, Architecture, and Design in Oslo. This small picture, measuring only 18.5 x 34.5 cm, shows the dome of the Frauenkirche and the tower of the Hofkirche dominating the skyline; silvers and deep blue combine to give it a wonderful jewel-like effect, together with a certain elegiac quality, perhaps indicative of the artist's awareness that his long friendship with Friedrich was nearing an end.”\n\nAs Dahl wrote in 1828 to the director of the Dresden academy, he found the area around Dresden useful for nature studies, but the “real thing” was always missing; that was something he could only find in his mountainous homeland. He viewed himself as a “more Nordic painter” with a “love for seacoasts, mountains, waterfalls, sailboats, and pictures of the sea in daylight and moonlight.” He longed to return to Norway, but not until 1826 was he able to make a journey home.\n\nHe made subsequent trips to Norway in 1834, 1839, 1844, and 1850, mostly exploring and painting the mountains, leading to the monumental works Fortundalen (1836) and Stalheim (1842). During his visits to Norway he received “an enthusiastic welcome as a painter of renown.”\n\nA critic notes Dahl's late stylistic changes: “In his late Fjord at Sunset (1850), based on studies made earlier, free and adventurous brush strokes represent the cloud-swept sky and broken surface of the water. Here he has moved far away from the purity and intensity of Friedrich's oeuvre.”\n\nIn 1827 Emilie Dahl died in childbirth while having their fourth child, and two years later two of the older children died of scarlet fever. In January 1830, Dahl married his student Amalie von Bassewitz, but she, too, died in childbirth in December of that same year. Dahl was crushed, and many months passed before he was able to paint again. Some years later this youngest child also died, leaving Dahl with two surviving children, Siegwald and Caroline, who married the Norwegian minister Anders Sandøe Ørsted Bull 1848.\n\nDahl's trip to Norway in 1850 would be his last. He was aging and weak, but continued to paint landscapes in the mountains. This last journey to his homeland resulted in several magnificent works, including Måbødalen, Fra Stugunøset, and Hjelle i Valdres.\n\nDahl was among the founding fathers of the National Gallery of Norway (Norwegian: Nasjonalgalleriet), now the National Museum of Art, Architecture, and Design, and donated his own art collection to the institution. Together with Johan Sebastian Welhaven, Frederik Stang, and Henrik Heftye, he founded the Art Society in Oslo (Oslo Kunstforening).\n\nDahl died after a brief illness and was buried on 17 October 1857 in Dresden. In 1902, a statue of Dahl by Norwegian sculptor Ambrosia Tønnesen (1859–1948) was erected on the facade of the West Norway Museum of Decorative Art in Bergen. In 1934, his remains were brought back to Norway and buried in the cemetery of St. Jacob's Church (Sankt Jakob kirke) in Bergen.\n\nJ.C. Dahl occupies a central position in Norwegian artistic life of the first half of the 19th century. His Romantic yet naturalistic interpretations of Norwegian scenery were greatly admired in Norway as well as on the European continent, particularly in Denmark and Germany."}]}