{"Steve Cooper had a spell in the United States with the San Jose Earthquakes.": [{"url": "https://www.theguardian.com/us-news/2021/may/26/san-jose-shooting-police-gunman-railyard", "page_content": "A shooting that erupted in the early hours of Wednesday morning at a light rail maintenance yard in San Jose, California, has left at least ten people dead, including the gunman.\n\nLocal leaders have described the violence as a “terrible, terrible” tragedy as authorities search for a motive.\n\nAuthorities reported on Wednesday that about 40 people were at the facility at the time the shootings occurred and the gunfire erupted in two separate buildings. Police say the shooter was an employee of the Valley Transportation Authority, which operates the light rail facility in Silicon Valley.\n\nThe shooting began around 6.30am local time in a facility that stores trains and serves as a transit control center, and the victims include employees of the facility.\n\n“These folks were heroes during Covid-19. The buses never stopped running, VTA didn’t stop running,” said Cindy Chavez, a Santa Clara county supervisor. “They just kept at work, and now we’re really calling on them to be heroes a second time to survive such a terrible, terrible tragedy.”\n\nVTA workers cross West Hedding Street near the scene of a mass shooting in San Jose. Photograph: Randy Vazquez/AP\n\nPlans were under way for a vigil at the San Jose city hall on Thursday evening.\n\n“These are the women and men who supported our community through this pandemic,” said San Jose’s mayor, Sam Liccardo, at a press briefing. “They showed up to work every day as essential workers, despite risks to their own health. We owe them and their families so much … For now, we need to focus on everything we can do to support these families and their loved ones.”\n\nGovernor Gavin Newsom, who cancelled another event to rush to the scene, described gun violence in the US as an epidemic.\n\n“This happens again and again – rinse and repeat, rinse and repeat,” he said. “It begs the question what the hell is going on in America?”\n\nNewsom spoke emotionally in front of a county office where flags flew at half-staff. He said victims’ relatives were “waiting to hear from the coroner, waiting to hear from any of us, just desperate to find out if their brother their son, their dad, their mom is still alive”.\n\nTwo people hug on Younger Avenue outside the scene of a shooting in San Jose. Photograph: Randy Vazquez/AP\n\nKamala Harris, the vice-president and a former senator of California, and Pete Buttigieg, the transport secretary, have also lamented the violence. “Transit workers have kept the traveling public safe this past year – we must do the same for them,” Buttigeig said in a statement.\n\nMeanwhile, dozens of family members have streamed into a reunification center set up in a county building.\n\n“They’re just sitting and holding hands and crying,” said Jeff Rosen, the district attorney of Santa Clara county, describing the scene. “It’s terrible. It’s awful. It’s raw.”\n\nRaul Peralez, a local city council member, said he was waiting to hear from a close friend who worked at the transit center.\n\n“This hits close to home for me,” he said. “I have a close friend – I’m still waiting for his status. He’s been a friend since middle school. His wife is on her way down here now.\n\n“Not even knowing that information is devastating and I can understand how so many families are feeling right now,” he said.\n\nThe violence began early on Wednesday morning. Raj Singh, a union leader with the VTA operators union, told the Mercury News that the shooting occurred during the busiest time of day at the light rail facility, when employees are reporting to work and getting ready to start transit service.\n\nLaurie Smith, the sheriff of Santa Clara county, said sheriff’s deputies entered the building while the shots were still being fired, but did not fire upon the suspect.\n\nPolice and investigators at the scene of a shooting at the San Jose Valley Transportation Authority light rail yard. Photograph: John G Mabanglo/EPA\n\nThe active shooter rescue team “ran into the building as shots were being fired. And I know that it saved many lives,” Smith said. “We had some heroics that I think resulted in a diminished loss of life.”\n\nMultiple news reports have identified the attacker as 57-year-old Sam Cassidy, citing law enforcement sources. Authorities said the shooter took his own life.\n\nA spokesperson for the Santa Clara sheriff’s office said bomb-sniffing dogs detected explosives at the shooting scene. The authorities are bringing in a bomb robot to scan the scene. “They are searching every crevice of the building,” he said.\n\nThe sheriff’s department confirmed in a press conference that it was investigating whether the shooting was related to one or more fires that broke out in San Jose around the same time.\n\nThe San Jose fire department responded to a large house fire at 6.36am, and another fire in a commercial area at 6.26am. Both were reported just moments before the shooting at the rail yard, which is a few minutes’ drive away.\n\nAuthorities approach a home being investigated in connection to the shooting. Photograph: Noah Berger/AP\n\nAn FBI spokesman, Craig Fair, said the FBI was flying in extra assistance from the agency’s resource center at Quantico, Virginia.\n\nSan Jose, the 10th-largest city in the US with more than a million people, is about 50 miles south of San Francisco in the heart of Silicon Valley.\n\nWednesday’s attack was the county’s second mass shooting in less than two years. A gunman killed three people before killing himself at a popular garlic festival in Gilroy in July 2019.\n\nAccording to the San Jose Mercury News, it was the deadliest mass shooting in the Bay Area since 1993, when eight people and a gunman were killed at the 101 California Street skyscraper in San Francisco.\n\nA fuller picture of the attacker began to emerge by Wednesday evening. Sam Cassidy’s ex-wife, Cecilia Nelms, told the Associated Press that Cassidy had a bad temper and would tell her that he wanted to kill people at work, “but I never believed him, and it never happened. Until now.”\n\nNelms, shaken by the news, said her ex-husband would come home wound up and angry about things that happened at work. As he talked about it, “he would get more mad”, she said. “He could dwell on things.”\n\nWhen Cassidy lost his temper, Nelms said there were times she was scared. He was someone who could physically hurt others, she said.\n\nNelms said they were married for 10 years. Cassidy filed for divorce in 2005 and had not been in contact for 13 years. She said he had been treated for depression.\n\nTransit authority mechanic Rochelle Hawkins said she dropped her phone when she heard shots.\n\n“I was running so fast, I just ran for my life,” she said. “I would hope everyone would just pray for the VTA family. Just pray for us.”\n\nThe Associated Press contributed reporting"}, {"url": "https://theathletic.com/3257241/2022/04/18/earthquakes-matias-almeyda-john-fisher/", "page_content": "A competent organization would have made a decision on Matias Almeyda this winter.\n\nA competent organization would have understood the roster-building ramifications of Almeyda’s unusual man-marking system, known the meaning behind the never-ending rumors linking him to jobs in Latin America and realized that letting the Argentine head coach enter the final year of his contract without any clarity on his future was a recipe for disaster. A competent organization would have either extended him this offseason and let him rebuild the team in his image or fired him and begun anew with someone else.\n\nAdvertisement\n\nThe San Jose Earthquakes have not been a competent organization.\n\nInstead of making a move on Almeyda this winter, the Earthquakes, led by managing owner John Fisher, did nothing. Regardless of whether that choice was borne of indecision, cheapness, a belief that this could actually work or some other combination of factors, it’s created an unholy mess in San Jose, which is last in MLS with three points from seven matches and, on Monday afternoon, finally fired Almeyda. He leaves San Jose with a regular season record of 31 wins, 42 losses and 25 draws, a 1.2 points per game average, a -33 goal differential and, as pointed out by Quakes Epicenter, an expected goal differential that dropped in every year of his tenure, falling from +0.2 per 90 in his first season in 2019 to a league-worst -0.96 per 90 in 2022.\n\nThe drama runs much deeper than poor statistics. Almeyda, who, according to sources, was one of the highest-paid coaches in MLS, ran roughshod over the club in recent weeks, embarrassing himself and the organization with a series of lamentable decisions that seem to indicate a desire to be fired. He repeatedly skipped league-mandated news conferences. His on-field tactics were a horror show. His lineup choices verged on ridiculous. He’s even gotten into confrontations with fans at at least two different home matches. Last week, he reportedly tried to resign while insisting that the club pay him and his assistants out for the remainder of 2022. His behavior has been disrespectful to supporters and no doubt harmful to his own players, who have been individually miscast and collectively set up to fail.\n\nHis tantrum, which was perhaps fueled in part by his dissatisfaction with Fisher’s unwillingness to spend on the first team, was extreme. It was clear that he wanted out for quite some time, but it’d still be a bit unfair to say the club should have foreseen him acting this childishly.\n\nAdvertisement\n\nThe on-field issues were more predictable. San Jose fired former GM Jesse Fioranelli last June. He had largely ceded his last couple of years of roster decisions to Almeyda, mostly ignoring the domestic market and spending the limited capital that Fisher gave him on players who had previously played for the head coach during his time in Argentina and Mexico. Most of them have been below average in MLS.\n\nThe club took a new tack under Chris Leitch, who ran the sporting department on an interim basis after Fioranelli was fired before being hired in a full-time capacity in November. This winter, the new GM jettisoned Almeyda guys Luciano Abecasis, Oswaldo Alanis, Carlos Fierro, Andy Rios and Daniel Vega, who combined to make $3.2 million in 2021, roughly 30 percent of the club’s overall salary outlay. He replaced them largely with players from within the league, trading for Jeremy Ebobisse from Portland last summer and landing Jamiro Monteiro from Philadelphia this winter.\n\nThe new approach makes sense. Fisher is clearly not going to splash the same kind of cash as upper middle-class clubs like Portland or Seattle, never mind spending like MLS heavyweights Toronto, Atlanta, LA Galaxy and LAFC. That doesn’t mean the Quakes can’t succeed, it just means they have to be efficient. Using allocation money as an intra-MLS transfer fund (something low-budget Colorado has done to great effect over the last few seasons) was a good place to start. Getting more out of the academy, a part of the organization Leitch has worked in and an area he’s placing real emphasis on, will also be important moving forward.\n\nBut, regardless of its merit, the changed strategy didn’t seem to mesh with Almeyda’s desires. Coupled with his poor record, that should have been enough for Fisher and the club board to fire him this winter. Instead, perhaps motivated by a desire to not pay two head coaches at the same time, they let him enter a lame-duck year. Leitch was given reign over the roster, but he was saddled with a head coach who looked like he didn’t want to be in the Bay Area and didn’t appear to be on-board with the club’s overall plan. That’s no way to empower a first-time chief soccer officer, though Leitch said on Monday that things remained civil between the Quakes and Almeyda.\n\nIn preseason, semi-reasonable high-end expectations had San Jose competing for a playoff spot then moving on from Almeyda and starting anew at zero added cost to Fisher this winter. Projected worst-case scenarios probably looked something like the crisis that’s now unfolding. Either way, the Quakes were effectively throwing away this season before it even started. Leitch began turning over the roster, but this was never a real rebuild. No matter how many new players were signed, they would be playing for a coach with a hyper-specific system who seemed like he had no more than one season left at the helm. The organization was always going to struggle with a manager who didn’t seem to have a real mandate.\n\nAdvertisement\n\n“Us parting ways happened amicably, honestly, and with the utmost professionalism from both sides,” Leitch said. “The hope was in the offseason that we would enter into the 2022 season with some fresh faces on the roster and our results would be different than what they are, with the hope that there’d be possibilities to extend or have a different perspective with Matias.”\n\nInterim head coach Alex Covelo, elevated from his position as head coach of Quakes II in MLS Next Pro, should be able to improve results with more conventional tactics and lineup choices, changes that Leitch said on Monday should be expected. But, thanks to the indecision around Almeyda this winter, it seems like 2022 will end up being a lost year for the entire club regardless.\n\nNot that that would be new for San Jose, of course. Since they were reborn in 2008, the Quakes have been among the least successful teams in MLS. Despite playing in a market that the club’s own COO views as one of the best in the country from both a corporate and talent perspective, they don’t draw fans, they don’t get good results and they don’t spend on their first team. They’ve made the playoffs four times in 14 seasons since they came back into existence after the first iteration of the club moved to Houston in 2006. They basically wasted the career of all-time MLS record goal scorer Chris Wondolowski. They’ve never even seemed to have much of a real plan, though Leitch is at least working to change that. It’s all so bleak that Francisco Calvo, who signed with the Quakes this winter after five seasons split between Minnesota and Chicago, took out his own club in an interview last week with TUDN’s Michele Giannone.\n\n“First, let me say I’m grateful to be in this organization, but this organization is missing a lot of things,” Calvo said. “And the people in charge need to realize that. … San Jose doesn’t have stars. San Jose is not the one that spends the most. Do you think that MLS looks at San Jose and thinks that we can win the championship without spending? I don’t think so. But that’s on San Jose and they need to change it. If they want to win, they have to spend and make things better all around.”\n\nFisher, the heir to the Gap Inc. fortune, the managing owner of the Oakland A’s and a part-owner of the Scottish Premiership’s Celtic FC, is the common denominator through all of San Jose’s struggles. He almost never speaks publicly. His last interview about any of his teams, one of the few he’s ever given, appears to have come in June 2020, when he was doing damage control and reversing course after the A’s became the only MLB team that publicly refused to pay minor leaguers a $400 per week stipend after their season was canceled.\n\nHis lack of public comments mean we don’t know his intentions in regards to the Earthquakes. We can only judge his ownership based on how the organization has actually performed. That record, as outlined above, has been putrid.\n\nThe club has struggled on the field, in the stands and in the broader Bay Area market. The region has plenty of youth talent, but, apart from decent contributions from goalkeeper J.T. Marcinkowski and the promise of Cade Cowell, the Quakes haven’t seen huge returns from their academy. They’re located in Silicon Valley, but they haven’t really leaned into data and analytics in their sporting department until recently. There’s still plenty of room for them to grow in that department. The training facility is subpar, though Fisher and the club are now finally in the process of constructing a new one. PayPal Park, the soccer-specific stadium that they built in 2015, doesn’t have nearly enough luxury areas to drive revenue in the same way as the new stadiums for other clubs around MLS, according to multiple sources.\n\nAdvertisement\n\nAnd while Fisher, whose net worth is listed by Forbes at $2.4 billion, is well within his rights to not want to lose millions upon millions in annual operating costs on top of the investments he’s already made into the Earthquakes, the consistent lack of direction in the front office and the Almeyda mess are both embarrassing and a direct indictment on his ownership of the club. The team’s overall irrelevance is a drag on MLS, as well. The Bay Area should be a vibrant market for the league. Instead, MLS is a complete afterthought in the area. A lot of that is on Fisher.\n\nHe might treat the A’s, who underwent yet another roster teardown this offseason, with the same apparent indifference that he treats the Quakes, but owning an MLS club is different than owning an MLB team. Even with its numerous problems, baseball is established in the North American sports landscape in a way that MLS can only dream of.\n\nMLS needs to grow, and it needs committed owners in order to do so. The ideal MLS owner should also be an evangelist for soccer, someone who feels a responsibility to grow the game in the U.S. and Canada. Fisher doesn’t even seem to care about his own team, let alone the sport at-large. He appears more interested in limiting his losses and growing the price of his club off of the work and investment of other MLS owners (the Quakes were valued at $510 million by Sportico last year; Fisher was part of an ownership group that paid $20 million to bring them back in 2007) than in making a positive impact.\n\nSome sources have speculated that Fisher, who last summer hired a firm to explore the sale of minority stakes in the Quakes, will look to sell the club in the next few years. San Jose would no doubt benefit from more competent ownership, but those sources were merely speculating. Fisher has never commented on whether or not he would consider selling the Quakes and has repeatedly stated through spokespeople that he has no interest in selling the A’s. Absent more information, we can only assume he’s in it for the long haul.\n\nThat would be bad news for soccer in North America. The Quakes haven’t been a competent organization, but Fisher has been worse than that. Unless he dramatically changes how he manages his team, he’ll likely continue to be an anchor on his own club, the league and the entire sport in the U.S. and Canada.\n\n(Photo: Bob Kupbens / Icon Sportswire via Getty Images)"}, {"url": "https://inews.co.uk/sport/football/steve-cooper-liverpool-former-academy-coach-masterminded-nottingham-forest-play-off-charge-1527129", "page_content": "Pep Guardiola recognises the moment that gave England the impetus they needed to push on with their demand to step out of international football’s shadows and compete again as a contender. In October 2017, in India, England won a World Cup at any age group for the first time since 1966 when their Under-17 team beat Spain 5-2 in the final.\n\n“Big congratulations to the manager,” Guardiola said. “It is the step England needed. It happened in Spain. Spain was always in the last-16, quarter-finals. Then they arrived one moment in the semi-finals and since then they have won every time. That’s why it is so important. To finally win.”\n\nThe stars of that England team were its young attackers, a group of teenagers who finally had overwhelming evidence to push for regular league minutes. From the 2015 Under-17 World Cup squad, only one has made a senior international appearance. Five years on from 2017, five of that squad already have: Phil Foden, Jadon Sancho, Conor Gallagher, Emile Smith-Rowe and Callum Hudson-Odoi. Marc Guehi could become the sixth after receiving his first call-up last week.\n\nIt was also a masterclass of the coaching system, the strategy through which the Football Association really did hope to shift the preconceptions of English football. The Under-17s took separate in-possession and out-of-possession coaches, a goalkeeper coach, two fitness coaches, two analysts, two physios, a doctor, a chef, an education officer and a psychologist.\n\nSteve Cooper, the head coach of that World Cup-winning team, has since enjoyed a rapid progression of his own. Leaving his role in 2019 to join Swansea, he led them to two successive Championship playoff campaigns before departing at the end of his second season (Swansea are now 16th). When Chris Hughton was sacked in September, Nottingham Forest had taken one point from seven league games. Since then, only leaders Fulham have taken more Championship points. Cooper is masterminding another remarkable rise.\n\nOn Sunday, Forest play in the last eight of any competition for the first time since Bayern Munich in the Uefa Cup in 1996. This club has undergone several mini-eras since, few of them pleasant: play-off heartache, League One relegation, the chaos of Fawaz Al-Hasawi’s ownership, the managerial merry-go-round, Greeks bearing gifts. Supporters have seen enough false dawns to fill a calendar, but few managers have got under their skin quite like Cooper.\n\nSunday’s tie offers a fine chance to reflect on Cooper’s coaching career, now almost 25 years in length despite him still being the ninth youngest manager in the top two tiers of English football. A steady but unspectacular player – by his own admission – he began coaching young age groups at Wrexham at the age of 19. Budgets were tight; Cooper became a minibus driver, a manager, a mentor and a fixture secretary all at once. He immediately fell in love with coaching. This was his vocation.\n\nIn 2008, having already become one of the youngest coaches in Europe to earn their UEFA Pro Licence, Cooper was headhunted by Forest’s Sunday opponents Liverpool. Initially overseeing the development of academy players aged between 12 and 16, in the space of five years, he was promoted to academy manager and then Under-18s coach, working with Trent Alexander-Arnold, Raheem Sterling and Conor Coady, amongst others. More importantly, he worked under Jose Segura, a Spanish coach who would go on to be Barcelona’s head of academy and then general manager.\n\nIt was through Segura that Cooper defined his preferred playing style: possession-based, aggressive pressing when the ball is lost and a coach who demands that his players are courageous with their forward passing. At Swansea, that occasionally became quite defensive without enough flair players to shift through the gears. At Forest, Cooper appears to have got the balance right.\n\nCooper won the World Cup with England’s U17s in 2017 (Photo: Getty)\n\nThat long history in academy football and with England’s age-group teams provides Cooper with a distinct advantage. The breakout stars of the Forest team that will take on Liverpool are Middlesbrough loanee Djed Spence and academy graduate Brennan Johnson, aged 21 and 20 respectively. Keinan Davis, 24 but with only 22 career league starts before this season, has been a revelation since Lewis Grabban got injured. James Garner, on loan from Manchester United, has kicked on again under Cooper. Ryan Yates has become an excellent all-action midfielder who reinforces the connection with the local community.\n\n“Steve is prepared to place trust in young players,” says Ian Foster. Foster was one of Cooper’s coaches with the Under-17s who is now the England Under-19s head coach. “We have seen that throughout his career, from his player development at Liverpool, Wrexham and England and then how he has operated at Swansea and now at Forest. He creates pathways for players. And his history of developing talent means that more senior players will always be on board with it. Some of them become part of his leadership, so everyone is working on the same page.”\n\nThat community has a power that Cooper has understood wherever he has coached. “You just have to make time for people, particularly if they show a bit of interest in you,” he said the week after his appointment at the City Ground. “We want to be decent people, we want to represent the traditions and the values of the club to the level that they deserve.” After each victory, Cooper raises his fist three times to each stand and hears them cheer thrice in return. It has become an emblem of their Championship progress.\n\nOne of the integral elements of Cooper’s style is collaboration, a deliberate destruction of ego and the traditional manager-player relationship. At the Under-17 World Cup, he would work with the players on game approach and opposition analysis, asking them to problem solve between each other. At Forest, Grabban has worked with Davis, Steve Cook with the younger centre-backs. What’s the point in telling them what to do when they are more likely to do it if it’s their own solution?\n\n“The great shift that has taken place is a realisation that these young players can handle it,” says Foster. “They have the technique, the tactical awareness, the physical prowess. All they needed was regular minutes, a chance to show what they can do. Steve is prepared to provide that opportunity, but he’s also prepared to challenge them and support them to find solutions. That’s how we develop rounded players.”\n\nThere are no guarantees at Nottingham Forest; this club has repeatedly promised and not delivered, delivered but fallen short. They are emphatic second favourites against Liverpool and still outsiders for promotion after their dismal start to the season.\n\nBut, for now, none of that really matters. More important than playing in the Premier League is having a club that, finally, seems on a firm footing. If that’s not only down to one man, supporters know that one man has made a bigger difference than most. On Sunday Steve Cooper revisits his own history. He’s more interested in the relentless pursuit of his, and Nottingham Forest’s, future."}, {"url": "https://theathletic.com/3194871/2022/03/19/steve-cooper-the-liverpool-years-only-now-do-i-fully-appreciate-what-a-brilliant-coach-he-was/", "page_content": "Steve Cooper is the kind of character who prefers to look forward rather than back. He often needs a little encouragement to even talk about the past.\n\nAnd when he does, he nearly always has a knack of finding a way to bring the conversation back around to the future.\n\nGiven that he is still only 42 — young for a football manager — it is hard to conceive the thought that a key step on his journey to becoming Nottingham Forest manager began more than 13 years ago, when he was appointed as an academy coach at Premier League Liverpool.\n\nAdvertisement\n\nHanded the role of coaching the under-12 side in 2008, within three years he was head coach of the academy. Some might have seen his rise coming on the horizon given that at the age of 27 — while coaching in the academy at Wrexham — he had become one of the youngest people to complete a UEFA Pro Licence.\n\nCooper’s journey into management in Championship football, with Swansea, saw him climb the ladder steadily, with his appointment in 2019 following positive spells coaching the England Under-16 and Under-17 sides, winning the World Cup with the older age group.\n\nBut it was during those five years at Liverpool that Cooper’s reputation really blossomed as he played a part in the development of players like Raheem Sterling, Trent Alexander-Arnold and Ben Woodburn.\n\nThis weekend, Cooper’s Forest will face his former club in a FA Cup quarter-final at the City Ground that feels decidedly like a blast from the past, largely because of the shared history of the two clubs.\n\nAnd Cooper acknowledges the role his time on Merseyside played in his personal development as he looks to further enhance his reputation by attempting to mastermind a win that would propel Forest into their first FA Cup semi-final since 1991 — in the year they lost in the final to Tottenham, when he was just 11.\n\n“I think all of your experiences shape you, whether they are good, bad or indifferent. I had a long time at Wrexham and they were important days,” says Cooper. “Then Liverpool, the FA, Swansea… you take something out of everything in life. Life is all about experiences and learning from them.\n\n“I had the best part of five years at Liverpool and, when I look back on that now, for me personally it was a really important time. You always do your best for the organisation you work for. It is about the job you do, rather than what you get out of it as an individual. But I was definitely a better coach when I stepped away from there than I was when I first went in there.\n\nAdvertisement\n\n“That is what I try to achieve in every job I go into — I try to come out of it as a better coach. It is what I am trying to do here as well, at Nottingham Forest. Every step for me so far has been a beneficial one. I am still a relatively young coach, if I am allowed to say that. I am looking to always improve.”\n\nDuring his five years at Liverpool, Cooper went from being an under-12 coach, to being the senior coach at the academy.\n\n“Academies are all about the players. That is all that matters. You work long hours, you run long sessions, you work with a lot of players and a lot of different teams,” says Cooper. “The challenge is to help as many players as you can, as much as you can. That applies wherever you are and regardless of who you are working for and whether it is a young nine or 10 year-old or a player in the latter part of his development.\n\n“I managed to work with a lot of very talented young players. Academies are all about the players; it is only ever about their development.”\n\nCooper’s enthusiasm for reflecting on the past is revived noticeably when the subject of who his biggest influences were at Liverpool arises.\n\n“I met a really important person there, a guy called Pep Segura. He had a massive influence on me. He influenced me when it came to game understanding and the methodology of things,” says Cooper.\n\nCooper with Segura (Photo: Joe Giddens – PA Images via Getty Images)\n\n“I was lucky enough as well that Sir Kenny (Dalglish) was still working there before he went back to being with the first team. It was brilliant to spend some time around such an iconic guy like him. They were important times for me, in terms of learning and developing as a coach.”\n\nIt was Segura, who had previously managed Olympiakos and Barcelona B — where he helped develop talents such as Andres Iniesta, Gerard Pique and Cesc Fabregas — that Cooper quickly formed a close relationship with.\n\nAdvertisement\n\n“Pep was and is a major influence because I still speak to him now. He helped me understand how the game can be played and what it takes to play that way. Not so much just playing — it was about how you train as well; how you prepare players to do things in the way that you want. He taught me about the methodology behind things as well as how to do things.\n\n“The biggest message that Pep gave me was that you’ve got to know what you want your team to look like. That’s what I pride myself on now — having a clear view of when the team is getting it right and where I want them to go, but also how to get there. Pep put me on a different track, really.\n\n“What is important in coaching is that you find your own way. You find what you really believe in as a coach. Because, in the end, you want your team to be a reflection of what you believe in. Pep was important to me. What I have learnt, most of all, is that what you think yourself is most important of all. I am still on that journey.”\n\nCooper will not come up against Alexander-Arnold, who has developed into an integral figure at Liverpool and, arguably, one of the best right-backs in the world. The defender will be missing at the City Ground through injury. But Cooper plays down the thought of missing out on a reunion with his former player — and on any notion of him deserving any credit for the progress of players like him.\n\n“Coaches don’t produce players — players produce themselves. That is always something I have thought. I never think about any coach being part of a player’s evolution. We are there, along the way,” says Cooper. “Players are the ones who deserve the credit for what they achieve. If they do well, they are the ones who deserve the praise for it, because it is their hard work that has got them there.\n\n“Whether they turn into footballers or just good young men, that is what development is all about. It is the same here now. We have a host of young players who are working to get established. It is an ongoing daily journey.\n\n“But with Trent, I don’t see it as missing out on a reunion, exactly. There are not many games where we do not come up against somebody I have worked with. Chris Willock and Andre Dozzell played with QPR. Before that, against Reading, they had Tom Dele-Bashiru in their squad. There are always players you come up against who you have a past relationship with.”\n\nAdvertisement\n\nForest have already beaten Arsenal and Leicester on their way to the quarter-final. It feels like their biggest test yet against Jurgen Klopp’s side.\n\nIf they are to pull off another upset, much will depend on the talented younger players within Forest’s own squad. Brennan Johnson and Djed Spence have formed a dangerous partnership down the right flank, James Garner and Ryan Yates have a dynamic midfield partnership and Keinan Davis has been almost unstoppable up front in recent weeks.\n\nSpence celebrates his goal against QPR this week with Johnson (left) and Worrall (right) (Photo: Jon Hobley/MI News/NurPhoto via Getty Images)\n\n“There is no doubt that young players need these experiences. Players are shaped by all experiences, be they good, bad or indifferent. But it is often the latter two that are the most important,” says Cooper, who will also hope to guide Forest into the play-offs in the remaining 10 games of the Championship season. “That is where you learn the most from. It is about the difficult situations and how you respond to them. That is what defines you. It is how you respond to setbacks that shapes you.\n\n“I am a big believer in self-worth in people; a big believer in positivity and what you can do. We definitely like to have positivity around our daily routines, in the terminology we use and the intent of our days. We always try to focus on ourselves, on our environment and trying to achieve — to be successful. We attack challenges, we attack big games and embrace them rather than fear them. That is our mentality and if that is building belief and building confidence, then great.\n\n“Every day I ask the players to be the best version of themselves, to be winners and to give their best; to train and play in a way that we want to do things — to behave the way we want to behave. But we have not turned things around here. Not yet. We have made some good steps. We have work still to do.”\n\nPaul Taylor\n\n“Coops is destined to manage in the Premier League, I’m sure of it,” Morecambe’s Northern Irish full-back Ryan McLaughlin tells The Athletic.\n\n“Even all those years ago at Liverpool it was clear that he had everything you need to make the leap from youth coaching to a senior environment. I don’t think any of us have been surprised by how well he has done.”\n\nAdvertisement\n\nMcLaughlin played for Liverpool Under-18s under Cooper a decade ago. They reached the semi-finals of the FA Youth Cup where they were beaten 4-1 on aggregate by a Chelsea side including Nathan Ake and Ruben Loftus-Cheek.\n\nCooper during the FA Youth Cup semi-final first leg against Chelsea at Anfield on April 12, 2013 (Photo: Paul Thomas – The FA/The FA via Getty Images)\n\n“It was Coops’ attention to detail that really stood out for me. He was very good at seeing things in your game that needed to be worked on. Then he would be relentless in terms of pummelling that into you every day on the training field,” he recalls.\n\n“Before we played Chelsea he talked to me about what I’d be up against in their winger Jeremie Boga. He knew him inside out. He got the balance spot on between giving you good info about what to expect but not freaking you out. He sold it to you as a brilliant challenge. He never over-complicated things. He was a really good communicator. I remember how enjoyable it was playing for him.”\n\nCooper initially joined Liverpool from Wrexham in 2008. In the summer of 2011 he was promoted to academy manager by Dalglish to work closely with academy director Frank McParland, who also had a spell working at Forest during Mark Warburton’s tenure.\n\nThe previous season Cooper had enhanced his reputation after stepping up to assist the academy’s technical director Segura with the reserves following the departure of coach John McMahon.\n\n“Coops and Pep had a great relationship,” says McLaughlin. “I know Coops took a lot from working with Pep. The Barcelona way is Coops’ way. He always wanted to be expansive with the full-backs high and wide. He always wanted us to be brave in possession.”\n\nThe appointment of Brendan Rodgers as Liverpool manager in 2012 sparked another reshuffle at Kirkby. With under-18s coach Mike Marsh added to Rodgers’ senior staff at Melwood, Cooper took charge of the under-18s for the 2012-13 season. His squad included the likes of Jordan Rossiter, Jon Flanagan, Ryan Kent, Jerome Sinclair, Sheyi Ojo, Harry Wilson, Jordon Ibe, Tom Brewitt, Cameron Brannagan and Jordan Williams.\n\nMcLaughlin was coached by Cooper at Liverpool (Photo: Sebastian Frej/MB Media/Getty Images)\n\nWilliams, who currently plays for Bolton Wanderers in League One, was one of Cooper’s youngsters who broke into Rodgers’ first-team set-up, making his senior debut in a League Cup tie against Middlesbrough at Anfield in 2014.\n\n“I’ve known Coops since I was nine years old and he was coaching at Wrexham. I’ve always had a good relationship with him and we’re still in contact a few times a month with messages going back and forth,” Williams tells The Athletic. “He moved on to Liverpool when I was in the under-13s at Wrexham and then when I made the same move he was my under-16s coach at Kirkby. We had a great team. I think we only lost two games under him all season.\n\n“Coops could be quite hard on us but not in a bad way. He set standards every day and he didn’t like anyone falling below them. He knew what each player needed to get them going and would personalise it.\n\n“I always remember striker Jerome Sinclair (who later signed for Watford) had his best season under Coops. He used to work so hard with Jerome on the training pitch. He knew he needed an arm around the shoulder, while he knew that I needed more of a kick up the ass. You can tell if someone is more suited to being a coach than a manager. Coops always had both sides. His training sessions were good and he knew how to set a team up tactically. But he also knew how to handle egos off the pitch, which is important.”\n\nCentre-back Brewitt had only just turned 16 when Cooper gave him his FA Youth Cup debut in a fifth round victory over Leeds United.\n\n“Coops was great for me,” says Brewitt, who currently plays for Connecticut-based Hartford Athletic in the USL Championship.\n\n“I was one of the youngest in the squad but he always knew how to fill me with confidence while also ensuring I was on edge to get the best out of me. He had a way of taking you out of your comfort zone. Not to a point where you couldn’t perform, but to help you grow as a player.\n\n“Shortly before I made my FA Youth Cup debut he told me ‘You’re not in the team because of the injuries, you’re in it because I picked you and I believe in you’. We won 3-1 and I cleared one off the line. I felt like I had his trust and I was desperate to impress him.\n\n“There was always a feeling between us as players that Coops would go on to manage in first-team football. It was the way he went about things. He was less of a pure talent developer and more of a manager in terms of his tactics and getting the best out of players.\n\n“There was definitely an edge to him. He wasn’t shy in terms of giving out a bollocking. But any criticism was always constructive. He made players better from working with them but he also made it clear that we were there to win and we needed to win in a certain way.”\n\nRodgers rejigged the academy structure when at Liverpool (Photo: Clint Hughes/Getty Images)\n\nWilliams was sidelined by a knee injury for most of the 2012-13 season when Cooper was in charge of the under-18s.\n\n“Sometimes when you’re injured managers forget all about you, but Coops cared and always went out of his way to help during a tough period,” he recalls. “He’s one of the nicest people I’ve ever met off the pitch. He cares about what’s going on in your life away from football.\n\n“When I got promoted with Bolton, he was in touch with me straight away. When my dad passed away, Coops was the first person to come around the house. That says a lot about him.”\n\nWhen Cooper left Liverpool in the summer of 2013, it was a shock for his players. His contract wasn’t renewed as Rodgers’ overhaul of the academy gathered pace.\n\nIt was a period of significant change at Kirkby as Rodgers sought to exert his authority. Segura had stepped down in 2012 citing a desire to return home to Spain. However, his decision was also influenced by the fact he missed out on a more senior role after the owners ditched plans to appoint a technical director and a sporting director to work with Rodgers, who had demanded sole control.\n\nAlex Inglethorpe, the current academy director, was brought in from Tottenham initially as under-21s coach and Michael Beale, currently No 2 to Steven Gerrard at Aston Villa, was recruited from Chelsea. Cooper’s exit was swiftly followed by the sackings of academy head coach Rodolfo Borrell, now Pep Guardiola’s assistant at Manchester City, and academy director McParland. Neil Critchley, now manager of Blackpool, had arrived from Crewe to take over from Cooper after being headhunted by Rodgers.\n\n“It was a big surprise when Coops left and I’m not sure what went on,” says McLaughlin. “We were never told the finer details, but obviously Brendan had come in as manager and was putting his own stamp on things.\n\n“Coops was similar to Michael Beale and Alex Inglethorpe in terms of his approach to the game — young and very driven. Whenever I went back home to Northern Ireland people would ask me what the coaches were like at Liverpool and I’d always say how lucky I was. As well as Coops, I worked with Mick Beale, Mike Marsh, Rodolfo Borrell and Alex Inglethorpe. They have all done well for themselves.\n\n“The great thing about the academy at Liverpool is that they develop coaches as well as players. Just look at the job Mick is doing at Villa and Critch at Blackpool. I enjoyed working with Coops, but I think it’s only now that I fully appreciate what a brilliant coach he was.”\n\nWilliams adds: “We were gutted about Coops going because we all loved playing for him. We just turned up one day and he had been replaced.\n\n“I don’t think it has ever affected what Coops thinks about Liverpool. He still speaks highly of the club. He became a fan. He moved on and put everything into his new challenges.”\n\nCooper twice led Swansea into the play-offs before being recruited by Forest, following the departure of Chris Hughton.\n\n“I thought it was a smart move by Forest,” says McLaughlin. “The impact he’s had has been amazing. They’re great to watch and they’re winning. He has turned them into promotion contenders. He had a great education at Liverpool and as players we all benefited from that time we spent with him.”\n\nWilliams agrees, saying: “Everywhere Coops has been he has improved the teams he’s had.\n\n“I know Yan Dhanda and he really enjoyed playing for him at Swansea. Now he’s got Forest flying. I’m made up for him. Great coach, great person.”\n\nJames Pearce\n\n(Photos: Getty Images; graphic: Tom Slator)"}, {"url": "https://www.theguardian.com/football/2021/jul/21/swansea-head-coach-steve-cooper-heading-for-exit-after-growing-unsettled", "page_content": "Steve Cooper has departed Swansea City by mutual consent after growing unsettled. The head coach led Swansea to successive Championship play-off finishes but made clear his concerns over the direction of the club.\n\nThe 41-year-old took Swansea to the play-off final last season on a modest budget. The club were keen to offer Cooper, whose deal runs until next summer, a new contract following defeat by Brentford at Wembley but the former England Under-17 manager was reluctant to enter talks. Cooper was of interest to Crystal Palace before the Premier League club appointed Patrick Vieira, and his work at Swansea also attracted attention from Fulham, who appointed Marco Silva.\n\nCooper said “it feels like a good time for all parties to make a change” and Swansea’s chief executive, Julian Winter, pointed to the head coach’s contract situation. “We felt as a club that the situation needed clarity and with a new season edging closer, the mutual nature of this decision allows both parties a chance to look forward,” he said.\n\nCooper has established a reputation as one of the country’s most exciting young coaches and has helped develop the youngsters Joe Rodon, Rhian Brewster and Marc Guehi, the last of whom this week joined Palace from Chelsea after two seasons on loan at Swansea.\n\nThe timing of Cooper’s exit is poor given Swansea are due to start the season at Blackburn Rovers in less than three weeks. It is unclear who will take interim charge and financial restraints suggest it is unlikely they will move for a manager for whom they must pay compensation. The club has a longstanding interest in the Lincoln City manager Michael Appleton, who is recovering after successful testicular cancer surgery, and the Queens Park Rangers assistant John Eustace is also thought to have been shortlisted before Cooper’s appointment in June 2019."}, {"url": "https://theathletic.com/2777583/2021/08/18/cade-cowell-san-jose-earthquakes-mls-usmnt/", "page_content": "When he received my call, seventeen-year-old San Jose Earthquakes forward Cade Cowell had just given his teammate Emmanuel Ochoa, a fellow Quakes homegrown, a ride to grab some food at a San Jose mall. The two would later join other teammates for an afternoon of bowling organized by San Jose winger Carlos Fierro. Still Cowell answered and, with a slight hint of discomfiture, admitted that he had forgotten about the interview.\n\nCatching Cowell away from the Quakes’ training ground turned out to be a welcome coincidence. What followed was a casual conversation with a teenager who, despite his status as one of Major League Soccer’s brightest young talents, isn’t wrapped up in the growing hype surrounding his name. Cowell is direct and transparent — a sharp contrast to today’s ultra-polished and content-driven professional athlete.\n\nAdvertisement\n\n“I’m always hanging with my teammates and stuff,” Cowell said. “I just like to go fishing and bike riding in the hills and stuff like that. I really enjoy being outside. I really don’t like city life at all. I like going to the forest, like a pond where it’s quiet and you just get away from everything that’s going on in your life.”\n\nEver since his professional debut at age 15 in 2019, there has been considerable hype surrounding Cowell. In 2021, that hype is starting to turn into tangible results. Cowell became the first player in MLS this season to notch four goals and four assists. He’s starting regularly for his club now and was recently named an MLS All Star for the first time. During the Gold Cup in July, he was invited to train with the senior U.S. national team for the second time in his young career.\n\nA GOAL AND ASSIST. CADE COWELL IS ON FIRE. pic.twitter.com/JifDDrEw6N — San Jose Earthquakes (@SJEarthquakes) April 24, 2021\n\nBut unlike many of his fellow professionals, Cowell refrains from the distractions of daily online interactions despite his growing fame. He has chosen to literally mute all the noise by turning off every social media notification on his phone. He has 1,639 followers on Twitter, which he said he only glances at occasionally, but digital approval is of little interest to Cowell, who will turn 18 in October.\n\n“Like it’s cool for fans to see what you’re doing here and there,” said Cowell. “I’ll post when I catch a fish or where I’m at sometimes. But I just feel like (social) media’s not everything in life and I feel like that’s what it’s turning into right now. It’s like (having followers) is the most important thing in life. I just feel like it’s not real. You know?”\n\nAs a result, Cowell said that he’s unaware of the buzz around him at the moment. Altogether, Cowell just wants to play soccer.\n\nAnd if he could, he’d lift more weights, too.\n\nAside from his youthful smile, Cowell looks like an athlete who would excel at the NFL Combine, rather than on an MLS pitch. The MLS website lists Cowell at 6 feet tall and 163 pounds, but there’s strength behind those measurements in a way that’s immediately clear to anyone who watches him play.\n\nAs if it wasn’t obvious enough, Cowell quite unabashedly enjoys lifting. Cowell said confidently that he can bench press up to 245 pounds, and if it were up to him, he’d likely go for more. But rules are rules.\n\nAdvertisement\n\n“(San Jose) didn’t really want me to (lift) anymore,” Cowell said when asked if he still lifts weights like he did before becoming a pro. “It was basically like, they wanted me to be more explosive and it’s for the better. I still lift a lot, but not like I used to.”\n\nBut while his physique is immediately noticeable, those closest to him also note the forward’s mentality and desire to be a difference maker on the pitch. He’s an intense player who plays at full tilt at all times, which is ideal for a league that continues to be recognized for its muscle and verticality.\n\n“That’s what really excites me about him because we talk about it continuously,” said San Jose head coach Matías Almeyda in April. “He’s a humble player. Humble in heart. He’s humble in that he wants to listen. He wants to learn. That’s what convinces me that he’s going to be a great player. But he also has to understand that this takes time. We can’t settle on his power. We can’t settle on his pace. He has to aspire to play in Europe and we’ve talked about this. And for that, one needs to have so many small technical skills. He still has to learn those. He’s young. He’s very young but he’s doing well.”\n\nCADE COWELL! That's a goal and an assist already tonight. 👀 #SJvDC pic.twitter.com/SZCQdxVwzk — Major League Soccer (@MLS) May 2, 2021\n\nAlmeyda made sure to note the specific technical skills that Cowell must improve: Precision with both feet, movement off the ball and becoming an aerial threat are among them. Cowell, in spite of his flaws, has started in 13 of San Jose’s 19 matches this season. He has outplayed Quakes legend and veteran striker Chris Wondolowski to earn those games, but must now compete for playing time with San Jose’s latest forward signing Jeremy Ebobisse. The former Portland Timber star was immediately inserted in the starting XI upon arrival with Cowell going back to the bench.\n\nSan Jose’s decision to add another experienced striker may have bumped Cowell from the starting No. 9 position, but the addition of Ebobisse will allow Cowell time to develop further and battle for minutes.\n\n“When we do fitness tests, Cade is the player with the highest (vertical) jump, and it’s not even close” Almeyda sid. “But he still can’t head a ball, so that means he needs to improve his heading technique. That’s fine. It takes time and I know that. I don’t go by all the great things that are said (about Cowell). I like it. Anyone would. It motivates me when (my players) are talked about, but I can’t settle on that. I want more for them. I want them to be complete players, to become difference makers throughout their careers.”\n\nAlex Saunders remembers the first time he saw Cowell play, when the San Jose 2003 academy team he coached faced Modesto Ajax’s 2002s. Cowell, born in 2003, was playing up one year with his hometown Modesto club. He was 11 years old and Saunders knew then that Cowell could become a special talent.\n\n“Pace, power, athleticism, goals. He honestly had it all then,” recalled Saunders. “He’s just a bigger, stronger, quicker version of what he was when he was 11 I think.”\n\nSan Jose had identified Cowell as an important prospect, but logistically, adding Cowell to their academy program was difficult, with Modesto being an hour and a half drive away. Saunders and other club staff continued to see Cowell at area tournaments, which convinced them of the player’s potential.\n\n“I got to know his family,” said Saunders. “We went out to dinner with his grandparents, his mum and dad, his brother and sister. We just built a relationship. When he could he would play with us. We kept in contact. He was an amazing kid. They really wanted him to play down here full time, but he was still quite young and living further away.”\n\nAdvertisement\n\nAt age 15, Cowell led the nation in scoring as a striker for Ballistic United. Interest for Cowell from other MLS academies intensified, and according to Saunders, former San Jose general manager Jesse Fioranelli, and especially current technical director Chris Leitch, made Cowell a priority. However, unlike academy programs such as Real Salt Lake’s, who provide a full-service academy experience, including dorms and a charter school program, San Jose could only offer the promise of soccer and a reliable support system.\n\nTo replicate the RSL academy model or the Philadelphia Union’s expansive YSC Academy in Chester, Pennsylvania, would likely require an exorbitant financial investment from the Quakes. The cost of living in Silicon Valley is among the highest in the U.S., with available land for development at a premium.\n\n“The Bay Area, as you probably know, is a very different place,” Saunders said. “We all struggle.”\n\nThe solution was a simple one for Saunders: Cowell would live with him, and his family would serve as Cowell’s host family for his time in San Jose. It led to Cowell becoming San Jose’s youngest homegrown signing in 2019 when Cowell was 15.\n\n“(The Cowells) were so tight as a family that they wanted to make sure it was a good environment with someone they trusted,” said Saunders. “I knew that they were having these conversations, so I offered to the Quakes and I offered to his family ‘I know you guys. Come live with me.’”\n\nCowell and Saunders at home in November 2018 (Courtesy Alex Saunders)\n\nSaunders says that he has played a very small part in Cowell’s development. Cowell’s family, according to Saunders, are “the most amazing support network that you could possibly want.” Saunders, though, has undoubtedly added to that network.\n\nUnder Saunders’ tutelage, Cowell has learned to cook, iron a shirt and do laundry. Before Cowell became a first-team player, they watched Quakes games together and Cowell would occasionally wake up at 4AM on the West Coast to watch Saunders’ beloved Tottenham Hotspur. When Cowell made his professional debut in 2020, Saunders’ fiancée bought balloons and a cake for Cowell to celebrate the occasion. Saunders bought a USMNT scarf to commemorate Cowell’s Gold Cup call up.\n\nCowell’s two bikes and his fishing rods adorn Saunders’ garage. And while Cowell refers to the Saunders household as his host family, which is technically true, their relationship is a close one. They confide in each other and discuss Cowell’s professional aspirations.\n\nAdvertisement\n\n“(Cowell) just always talks about how he wants to be the best player,” Saunders said. “How he wants to help the Quakes. He wants to score goals and get assists and do everything that he can for the team. He’s a quiet, reserved character, singularly focused on his desire to be the best player he can be. He goes to training. He comes home. He eats. He rests. He wants to go fishing in his spare time and relax. He’s never up late and he doesn’t have people over late. He definitely takes care of himself. He’s nothing like I was as a 17-year-old.”\n\nSaunders, who said Cowell has a “contagious smile,” has been surprised by the attention Cowell has received and said facetiously that he’s a bit star struck by the strapping young soccer star with whom he shares his kitchen.\n\n“You see me at the games now when he’s near the ball or has a chance, I’m jumping up and down like an eight-year-old hoping that he’s going to score or assist or something,” said Saunders. “I’ve just been this familiar face. We see each other at the house. I can’t take any credit for anything, but I shall be sad someday when he flies the nest.”\n\nEarlier this summer, Cowell needed to leave home on strangely short notice – albeit for a good reason. After D.C. United winger Paul Arriola limped off the field in the group stage opener against Haiti, a spot on Gregg Berhalter’s U.S. national team roster became available, or so it seemed.\n\n“I was at (Quakes goalkeeper) JT Marcinkowski’s house just having dinner with him,” recalled Cowell. “My phone was ringing and it said ‘Gregg Berhalter’ and I was like ‘Oh wow, this is crazy.’ (Berhalter) was like ‘Hey Cade. I have a player injured and we want you to come out to the Gold Cup and join us. Your flight is tomorrow.’ I got really excited. But after I found out that (Arriola) wasn’t even really hurt, I got upset for like two or three days. I was kinda bummed. But it was a cool two or three days in training and stuff.”\n\nCowell said rushing to national team camp in the middle of an international tournament was “pretty strange.” A player in his position is thrust into an unfamiliar routine within a highly competitive environment.\n\n“I didn’t really have much of a conversation with Gregg until the last day when he said that I’m going home,” Cowell said. “He said that he was very surprised at how much better I’ve gotten since the January camp. He said I was more confident, that he could see that.”\n\nCowell is represented by the Wasserman Media Group, but he laughs when he confesses that he doesn’t remember his agent’s last name. That could be perceived as a lack of attention to detail, but in speaking with Cowell, one realizes that he speaks matter of factly — avoiding platitudes or forced responses. Discussions between himself and his agent about playing abroad aren’t being had either, Cowell says, but he revealed that he has a check list of professional objectives that he follows.\n\nCowell wouldn’t disclose the full contents of the list other than to say that playing in Europe is a personal goal of his. Every so often, Cowell will discuss his future with Wondolowski, who has become one of Cowell’s mentors.\n\nAdvertisement\n\nStill, Cowell isn’t getting ahead of himself. He’s eligible to play for Mexico and the U.S., but said he’s undecided regarding his national team allegiance. Cowell briefly supplanted Wondolowski, the league’s career scoring leader, as San Jose’s starting forward. Cowell’s performances have since cooled, a reality that will test his mentality and competitiveness. For now, focusing on the present must take precedence over a future that he cannot control.\n\n“You get too caught up in things…you start scoring, you feel like you’re doing good and then people start worrying about other things instead of really conquering what you’re doing right now,” Cowell said. “I don’t want to let that happen to me. I really just want to be the best player that I can possibly be. At the end of my career just be like ‘I really checked everything on my list.’ I did it all.”\n\n(Photo: John Todd / ISI Photos / Getty Images)"}, {"url": "https://www.espn.com/soccer/story/_/id/37627517/san-jose-earthquakes-part-ways-manager-matias-almeyda-sources", "page_content": "Matias Almeyda is out as manager of the San Jose Earthquakes, the MLS club confirmed on Monday.\n\nAlex Covelo, who has been head coach of Earthquakes II in the inaugural season of MLS NEXT Pro, was announced as interim head coach. Earthquakes legend Chris Wondolowski will serve as interim assistant coach, alongside Steve Ralston and Luciano Fusco, with Almeyda's backroom staff also departing.\n\nThe decision was made to part ways with the Argentine hours after the Quakes tied Nashville SC, 2-2, extending San Jose's winless start to the season to seven games, and making it the only team in MLS without a win. It isn't clear the extent to which Almeyda will be paid the remainder of his contract.\n\n- MLS on ESPN+: Stream LIVE games, replays (U.S. only)\n\n- Soccer on ESPN+: FC Daily | Futbol Americas\n\n- Don't have ESPN? Get instant access\n\nSources told ESPN that Almeyda told the team after last week's 4-3 loss to Houston that he was \"done\" as San Jose manager and that he would talk to the team the following Monday. But when Monday came there was no further clarity as to his future. Those sources also said that this is something that Almeyda had said to the team more than once over the years in the wake of difficult losses.\n\n\"We've had ongoing discussions and for sure this past week,\" general manager Chris Leitch told media members on Monday.\n\n\"I think that culminated in just both parties realizing that this was the best for everyone. So without getting into all of the details of what happened, when and who said this, and that, I think the most important part is just that Matias and his staff as well as our club, we realized that we both endeavored to have better results than than what we've shown not only this year, but in years past.\"\n\nMatias Almeyda had been in charge of San Jose since the start of the 2019 season. Darren Yamashita-USA TODAY Sports\n\nAlmeyda concludes his three-plus seasons in San Jose with a regular season record of 31-42-25. He was signed to great fanfare and high hopes just prior to the end of the 2018 regular season. Almeyda's man-marking system was expected to turn around the fortunes of a team that had qualified for the playoffs just twice in the previous eight seasons.\n\n\"I want to thank the Earthquakes for this time together, thank you to the fans, directors, staff and John Fisher for their trust, thank you to the players for their effort and thank you to MLS for giving me this opportunity,\" Almeyda wrote on Twitter following the announcement.\n\nWhile the team played some exciting soccer at times during Almeyda's tenure, the team lacked consistency, especially on the defensive side of the ball. Once the rest of the league became more familiar with his tactics, the team's results suffered. San Jose did reach the playoffs during the pandemic-shortened season of 2020, but that was done with the benefit of MLS expanding the playoff field in the Western conference to eight teams, with San Jose sneaking into the final spot.\n\nFor his part, Almeyda has on multiple occasions criticized San Jose's lack of spending in comparison to much of the rest of the league.\n\nNames already being suggested as possible replacements include El Salvador manager Hugo Perez, as well as former Quakes player and assistant Ian Russell, who managed the team's affiliate in Reno for four seasons.\n\n\"I will prioritize the MLS experience part of it,\" Leitch, who said the search for Almeyda's long-term replacement would begin immediately, added when asked what the club would be looking for a in a new coach.\n\n\"We're looking for club-centric staff and head coach, those with a high tactical acumen and flexibility and someone that's a leader, a good culture builder, because honestly, this club deserves and needs to win. We haven't been successful in the more recent years. This is a winning club that's lifted multiple trophies. That's where we want to get back to.\""}, {"url": "https://www.sportico.com/business/sales/2021/san-jose-earthquakes-sale-1234638264/", "page_content": "San Jose Earthquakes owner John Fisher has hired a bank to explore the sale of minority shares of the MLS club, according to multiple people familiar with the plans.\n\nFisher, who owns a large majority of the team, has retained Moelis & Co. to help with the process, according to the people, who were granted anonymity because the details are private. It’s unclear how much of the team he’s looking to sell, or to how many people, and it’s possible deals won’t materialize.\n\nThat said, now might be a good time to sell a sizeable limited partnership in an MLS club. A handful of controlling and minority stakes have already sold this year at large valuations. The Earthquakes, which play in an 18,000-seat team-owned stadium, were valued at $510 million in Sportico’s recent valuations.\n\nThe Earthquakes declined to comment. Reached via email, a Moelis representative also declined to comment.\n\nLike owners in all major U.S. sports, MLS owners are recovering from a difficult 2020 season interrupted by COVID-19. But MLS is more reliant on gameday revenue than most other leagues, which deepened the financial challenges of the pandemic.\n\nThe Earthquakes play in one of the country’s largest media markets—San Jose/San Francisco/Oakland ranks No. 6, according to Nielsen—and one with a large Hispanic population. Its stadium, opened in 2015, was recently renamed PayPal Park in a 10-year deal with the nearby payment giant.\n\nIt’s been a busy year for MLS transactions. Orlando City SC and Houston Dynamo FC both sold earlier this year in the $400-$500 million range. A minority stake in D.C. United later sold to NFL player Mark Ingraham at a $710 million valuation, one of the highest valuations ever for an MLS team in a transaction.\n\nLast week Inter Miami owners Jorge and Jose Mas agreed to buy out partners Marcelo Claure and Masa Son at an enterprise valuation of more than $600 million. Sportico’s valuations listed the team at $525 million, two spots ahead of the Earthquakes.\n\nFisher also owns MLB’s Athletics, which are discussing relocation if they can’t get approval for a stadium project in Oakland. He is a minority owner of Scottish soccer club Celtic FC."}, {"url": "https://www.theguardian.com/football/2021/sep/21/nottingham-forest-appoint-steve-cooper-as-new-head-coach", "page_content": "The former Swansea City manager Steve Cooper has been appointed as the new head coach of Nottingham Forest on a contract to June 2024. Cooper, the club’s first choice, took training on Tuesday before his arrival was confirmed.\n\nForest needed to agree compensation with Swansea because Cooper has been on gardening leave since leaving in July, and that matter was sorted quickly.\n\nForest targeted Cooper because of his record of working with and improving young players, having had successful spells as Liverpool’s academy director and with England age-group teams, winning the Under-17 World Cupin 2017. Forest believe he overachieved with Swansea, taking them to the Championship play-off final last season and losing in the semi-finals the previous year.\n\nQuick Guide How do I sign up for sport breaking news alerts? Show Download the Guardian app from the iOS App Store on iPhone or the Google Play store on Android by searching for 'The Guardian'.\n\nIf you already have the Guardian app, make sure you’re on the most recent version.\n\nIn the Guardian app, tap the Menu button at the bottom right, then go to Settings (the gear icon), then Notifications.\n\nTurn on sport notifications. Was this helpful? Thank you for your feedback.\n\nThe 41-year-old replaces Chris Hughton who was dismissed last week after Forest’s defeat by Middlesbrough left them bottom with one point from seven matches. Forest picked up their first Championship win on Saturday when they beat Huddersfield 2-0 under the caretaker manager, Steven Reid, but remain in last place.\n\n“Steve was our first choice as head coach and we are delighted to have secured his services,” said the Forest chief executive, Dane Murphy. “His record of developing young talent is exceptional. Steve knows what is required to be successful in the Championship and has a proven track record with Swansea.\n\n“We have reduced the age of our squad over the summer and Steve is the ideal coach to blend a team to start moving us up the table. On behalf of the owner and the board, we welcome Steve to the club and look forward to providing every support he needs to be a success at Nottingham Forest.”\n\nCooper is expected to bring on to his staff two familiar faces from his Swansea days: the coach Alan Tate and analyst Steve Rands. Cooper’s first game will be at home to Millwall on Saturday."}, {"url": "https://www.theguardian.com/football/2022/may/30/the-manager-gave-us-belief-how-steve-cooper-transformed-nottingham-forest", "page_content": "With one half of Wembley empty and the other delirious at restoring old rivalries in the Premier League next season, the Nottingham Forest captain, Joe Worrall, kissed a cardboard cutout of Steve Cooper flanked by Steve Cook, a free transfer in January, and the likable midfielder Joe Lolley.\n\nBy this point the actual Forest manager, club scarf around his shoulders, was in between catching his son in his arms and punching the air three times in front of supporters, as has become tradition after victories, a celebration he repeated on Monday before the thousands who congregated in the city’s Old Market Square. But moments after victory Cooper retreated to the dugout, covered his face with his hands and afforded himself a few quiet seconds to digest everything that had happened.\n\nForest are back in the top flight for the first time since 1999. Cooper’s black polo shirt was drenched in champagne from his players ambushing a pitchside interview and tears pooled in his eyes when he touched on the pride of seeing more than 36,000 Forest fans bask in promotion in the west end of the stadium, becoming the fifth and final league team to be allocated that side of the ground and secure victory this season, from Leicester in the Community Shield in August to Port Vale in the League Two playoff final last Saturday.\n\n“Persistent standing is not permitted,” were the words displayed on the big screens before kick-off but that message soon ignored as supporters savoured a remarkable season that began with Forest making their worst start since 1913.\n\nFor Cooper, the October international break Forest went into fresh from his third game, a 3-0 win at Birmingham, was an opportunity to drum his methods into his squad and soon after they went on a nine-match unbeaten streak.\n\n“We went on some brilliant runs but there were times I would look at the league table and think: ‘We haven’t made much progress here’ and we’d still be in 15th or 13th and you’re thinking: ‘Maybe we won’t get in the top 10,’” Cooper said. “I’m pleased to be part of the journey that has got us back to the Premier League.” Then he chuckled. “Sounds great,” he said.\n\nCooper’s laser-like focus kept Forest grounded in their surge up the table and the highs of knocking out Arsenal and Leicester in the FA Cup en route to hosting Liverpool. After victory on Sunday he grinned as he apologised for peddling the same answers, poking fun at a level-headed outlook that has brought the biggest of prizes.\n\nSteve Cook celebrates with a cardboard cutout of Steve Cooper. Photograph: James Gill/Danehouse/Getty Images\n\n“‘About the next game, control the controllables’ and all that crap,” he said, smiling. “I’m tough with them [the players], I’m challenging, demanding, but I’m with them, I’m with them 100% and that’s how you get the best out of people and get the best out of themselves. But I’ve felt it back as well. I’ve asked them to trust me and never once have they wavered.”\n\nForest will not veer from their principles because of the step up in class. “You need a clear identity and that’s what we’ve got here,” says Lolley, who signed from Huddersfield, Sunday’s opponents, four years ago. “In games you have to adapt and change but for the most part we’re here to attack teams and we’ll go up and do exactly the same.\n\n“We showed that in the FA Cup, in games where we certainly weren’t second-best in any of them. We’ve got success from being the team we are and the way we play. We always try to play on the front foot and press teams. To be the set of players and staff that have put Forest back where they belong is an incredible feeling.”\n\nThe arrival of Cooper, coveted by Premier League clubs last summer, was a coup but no one envisaged the extraordinary uplift that followed. “He’s come in and taken what looked, from the outside, like a misfit team who were low on confidence and couldn’t score goals last season,” Worrall says. “We were OK defensively but we could not score for toffee, and this year we’ve been a breath of fresh air.”\n\nOf the bond with fans, Worrall says: “It had grown miles apart in seasons gone by but now it’s very tightly knit. A lot of them come to the training ground, we have conversations with the forum groups and they have been behind us every step of the way. The supporters’ contribution is a major reason we’re back.”\n\nNottingham Forest owner Evangelos Marinakis has promised to back the manager in the transfer market. Photograph: Richard Sellers/PA\n\nCafú, an unused substitute, was soon sliding on the dressing-room floor and Djed Spence was among those with cigar in hand before jumping on the team bus. Evangelos Marinakis, Forest’s Greek owner who has vowed to provide “all the ammunition to the team with good players”, patted Spence, a loan star from Middlesbrough, on the back and shook hands with Cooper. There was also a warm embrace from Cooper with the Football League’s chief executive, Trevor Birch, who appointed him at Swansea.\n\nAt what point was the miracle on? “Ummm, good question,” Spence says. “We just believed; you can smell it, you can feel it in the group, you can feel it in the changing room. You just get that vibe. The manager came in and gave us belief. Hard work is the main thing. It has been a memorable season.”\n\nA few minutes after the final whistle the straight-talking Worrall, in between bluntly admitting Forest have not been good enough in previous seasons, compared the side to a “whipped dog” and highlighted how Cooper had killed him and his teammates with kindness since September.\n\nThe same applies beyond the City Ground. Cooper sent individual letters to members of the Football Writers’ Association to apologise for not being able to attend the Midlands lunch in April, citing a desire to “get every detail right in these important weeks”. That he certainly did."}]}