{"Steve Cooper was a member of the Wolverhampton Wanderers team that won the Football League Cup in 1980.": [{"url": "https://www.premierleague.com/managers/65984/Steve-Cooper/overview", "page_content": "Manager Bio\n\nSteve Cooper was appointed head coach of Nottingham Forest on 21 September 2021.\n\nBorn in Pontypridd, Wales, Cooper played as a defender for several Welsh sides including Bangor City, while also studying for his coaching badges.\n\nAfter becoming one of the youngest coaches to obtain his UEFA Pro License, aged 27, Cooper went on to take charge of Wrexham and then Liverpool's academies.\n\nIn 2014, he was appointed manager of the England Under-16s, before going on to the Under-17s a year later.\n\nHe led them to the final of the 2017 UEFA European Championship, where they were beaten by Spain, but in October of that year, they avenged their loss with a 5-2 victory over the Spaniards in the FIFA Under-17 World Cup final.\n\nCooper joined Swansea City in June 2019, guiding them to the playoff final in 2020/21, where they lost out to Brentford at Wembley Stadium in his second and final season at the helm.\n\nIn his first campaign at Forest, Cooper took the club from the bottom of the table and ended their 23-year exile from the Premier League with a 1-0 win over Huddersfield Town in the Championship playoff final."}, {"url": "https://www.bbc.co.uk/sport/football/64159376", "page_content": "Last updated on .From the section League Cup\n\nDean Henderson made a number of big saves during the game and in the shootout\n\nNottingham Forest boss Steve Cooper says reaching a first EFL Cup semi-final in 31 years will offer old and new fans the chance to dream after being drawn against Manchester United.\n\nForest beat Wolverhampton Wanderers 4-3 on penalties following a 1-1 draw to set up the clash against the team they were beaten by in the 1992 final.\n\n\"It is brilliant to get through to a semi-final and give ourselves the opportunity to play against Manchester United,\" said Cooper.\n\n\"I am really pleased for our supporters. It has given our older generation the chance to reminisce while younger supporters will enter new territory. It is another positive message about the club.\"\n\nDean Henderson was the penalty shootout hero as Cooper's side overcame Wolves at the City Ground.\n\nHenderson turned away Ruben Neves' spot-kick after Jose Sa had denied Sam Surridge, then turned away Joe Hodge's effort following Forest converting all four of their remaining penalties.\n\nForest had led in normal time when former Wolves pair Morgan Gibbs-White and Willy Boly combined, with Gibbs-White hanging an excellent first-half corner into the six-yard box and Boly stabbing home from close range.\n\nWolves scored a superb equaliser when new loan signing Matheus Cunha's low cross invited the finish from striker Raul Jimenez.\n\nThe game ended with ugly scenes in the centre of the pitch, with stewards involved to pull the players apart as tempers frayed.\n\nForest will host Manchester United first in the two-legged semi-final. The games will be played in the weeks commencing 23 and 30 January.\n\nHowever, Forest will likely be without Henderson, who is on loan from Manchester United.\n\n\"I have only just thought of that, it is frustrating,\" Cooper said of Henderson's ineligibility.\n\n\"After seeing the night he had tonight, he was excellent in the penalty shootout, but he was good in the game, more than good in the game.\n\n\"It's unfortunate. He's part of our group, he is so invested in the group and how we work, what we're trying to accelerate in terms of what we want to become.\n\n\"To do that you need a really good goalkeeper. Not only is he committing as a goalkeeper, he is buying into being in the city and the greater good of the club.\n\n\"It has put a dampener on it for me tonight.\"\n\nBoly doesn't celebrate rare goal\n\nFormer Wolves defender Willy Boly had given Nottingham Forest a first-half lead\n\nIt has become accepted that players do not celebrate goals against their former clubs, a tradition which Boly upheld despite his effort being his first for Forest.\n\nIt did seem a little bit strange.\n\nAfter all, the Ivory Coast defender did actively request a move away from Molineux in the summer, having received a substantial offer from Forest.\n\nIn addition, scoring is a rare experience for the 31-year-old. He last found the net almost two years ago, in Wolves' home defeat by West Brom. It was one of only six he scored in five seasons with the club.\n\nSadly for Boly, his evening ended early. Although he tried to continue after getting hurt in a clash with Hwang Hee-chan, he quickly signalled it was impossible.\n\nA mounting injury list is one of the reasons Cooper has cited for Forest's need to enter the transfer market this month.\n\nAnd now Forest have two more games to play this month, that need is even more acute.\n\nNot that such issues were bothering the home fans as they celebrated victory and a semi-final appearance to come in a competition legendary former boss Brian Clough won four times during his illustrious stint with the club.\n\nWolves a greater goal threat\n\nWolves fans have adapted a chant usually heard at Arsenal, singing about manager Julen Lopetegui \"he knows exactly what we need\".\n\nIn fairness, it wasn't anything revelatory. Wolves were shocking at scoring goals before the World Cup break.\n\nAlthough Cunha's January arrival will not on its own solve the problem, even without the currently injured Diego Costa Wolves look a far greater threat.\n\nHenderson made two excellent saves at the end of the first half to deny Jimenez - Goncalo Guedes should have threatened with the rebound but blazed over - and Hwang.\n\nJimenez's equaliser was the end product of slick team play from the visitors, which included a telling contribution from Neves to allow Cunha to deliver the decisive low cross.\n\nIt was Wolves' eighth goal in six games since Lopetegui took charge. It had taken Wolves 13 games to get their previous eight, part of a woeful overall pre-World Cup tally of 11.\n\nHenderson was to have the final word though as Wolves missed out on what would have been their first last-four appearance in this competition since winning it in 1980.\n\nPlayer of the match Matheus Cunha Matheus Cunha with an average of 7.19 Nottm Forest Nottingham Forest Nottingham Forest\n\nWolves Wolverhampton Wanderers Wolverhampton Wanderers Nottingham Forest Avg Squad number 1 Player name Henderson Average rating 7.07 Squad number 30 Player name Boly Average rating 7.01 Squad number 20 Player name Johnson Average rating 6.78 Squad number 22 Player name Yates Average rating 6.75 Squad number 10 Player name Gibbs-White Average rating 6.73 Squad number 32 Player name Renan Lodi Average rating 6.48 Squad number 24 Player name Aurier Average rating 6.46 Squad number 31 Player name Gustavo Scarpa Average rating 6.44 Squad number 4 Player name Worrall Average rating 6.42 Squad number 23 Player name Freuler Average rating 6.35 Squad number 5 Player name Mangala Average rating 6.24 Squad number 26 Player name McKenna Average rating 6.19 Squad number 8 Player name Colback Average rating 6.10 Squad number 16 Player name Surridge Average rating 5.80 Squad number 25 Player name Dennis Average rating 5.68 Wolverhampton Wanderers Avg Squad number 12 Player name Matheus Cunha Average rating 7.19 Squad number 37 Player name Traoré Average rating 6.58 Squad number 10 Player name Daniel Podence Average rating 6.42 Squad number 9 Player name Jiménez Average rating 6.32 Squad number 59 Player name Hodge Average rating 6.32 Squad number 8 Player name Rúben Neves Average rating 6.12 Squad number 27 Player name Matheus Nunes Average rating 5.88 Squad number 11 Player name Hwang Hee-chan Average rating 5.80 Squad number 3 Player name Aït-Nouri Average rating 5.78 Squad number 1 Player name José Sá Average rating 5.78 Squad number 24 Player name Toti Average rating 5.72 Squad number 28 Player name João Moutinho Average rating 5.66 Squad number 22 Player name Nélson Semedo Average rating 5.61 Squad number 23 Player name Kilman Average rating 5.61 Squad number 17 Player name Gonçalo Guedes Average rating 5.58 Squad number 19 Player name Jonny Average rating 5.49"}, {"url": "https://www.nottinghampost.com/sport/football/football-news/nottingham-forest-cooper-fa-charge-7746165", "page_content": "Nottingham Forest boss Steve Cooper has been charged by the Football Association over alleged “improper conduct”.\n\nThe Welshman’s comments about referee Thomas Bramall after his team’s 1-0 defeat at Wolverhampton Wanderers earlier this month are said to “imply bias and/or question the integrity of the referee and/or bring the game into disrepute”. The match at Molineux was decided by a Ruben Neves penalty and wasn’t without controversy.\n\nWolves’ spot kick was awarded after Bramall went to his pitchside monitor, following a lengthy VAR check, with Harry Toffolo penalised for a handball. A similar incident in the first half, however, saw nothing given when a Neco Williams shot was blocked.\n\nREAD MORE: Forest's next four fixtures compared with Premier League rivals as Reds aim to build\n\nREAD MORE: Forest could land £44m-rated transfer 'target' for cut-price fee in January\n\nThe Reds did get a penalty late on, after another considerable stoppage for VAR, when Matheus Nunes was punished for a foul on Ryan Yates. But Brennan Johnson’s effort was saved by Jose Sa.\n\nAnnouncing the charge, the FA said in a statement: “Nottingham Forest FC’s Steve Cooper has been charged with a breach of FA Rule E3.1 following their Premier League game against Wolverhampton Wanderers FC on Saturday 15 October 2022. It is alleged that the manager’s comments during post-match interviews constitute improper conduct in that they imply bias and/or question the integrity of the referee and/or bring the game into disrepute. Steve Cooper has until Thursday 27 October 22 to provide a response.”\n\nAfter the match, Cooper admitted he was left “biting his tongue” over the referee’s performance. “We know the referee well from last season. We had him in the Championship,” he said at the time. “We know the differences of what you can get with him. So we knew that was part of what we had to deal with today.\n\n“I haven’t looked at them back absolutely clearly. The fact of the matter is they’ve had one (penalty) and scored, and we’ve had one and missed.”\n\nAsked if he felt the visitors should have had a penalty from Williams’ effort, Cooper said: “We know the ref well from last year, particularly when you get him at home. I better leave that there.”\n\nAnd he added about the length of time it took for the referee to make a decision: “The first one, I think, especially. That’s why I’m biting my tongue, really, on how I feel about it, because if it’s taking that long and it’s not given in the first place, then it tells you something. But then there’s obviously influence and surroundings, and all that sort of stuff. As soon as that happened, because we knew who was there today, then I knew we were in trouble in that moment.”\n\nWhat do you make of the FA's charge? Have your say in the comments below\n\nREAD NEXT:"}, {"url": "https://www.nottinghampost.com/sport/football/football-news/nottingham-forest-steve-cooper-wolves-7707691", "page_content": "Head coach Steve Cooper was left “biting his tongue” over the referee’s performance in Nottingham Forest’s 1-0 defeat to Wolverhampton Wanderers.\n\nA Ruben Neves penalty proved to be the difference between the two sides at Molineux. It was given after referee Thomas Bramall went to his pitchside monitor after a lengthy VAR check, penalising Harry Toffolo for a handball.\n\nA similar incident in the first half, however, saw nothing given when a Neco Williams shot was blocked. But the Reds did have the opportunity to equalise late on, when Matheus Nunes was punished for a foul on Ryan Yates.\n\nREAD MORE: How the Reds rated against Wolves\n\nREAD MORE: Re-live the action from Molineux\n\nThere was another considerable stoppage for a VAR check, with the spot-kick eventually given. However, Brennan Johnson saw his effort saved by Jose Sa, leaving Cooper’s side to slip back to the bottom of the table.\n\n“We know the referee well from last season. We had him in the Championship,” the Forest boss said. “We know the differences of what you can get with him. So we knew that was part of what we had to deal with today.\n\n“I haven’t looked at them back absolutely clearly. The fact of the matter is they’ve had one (penalty) and scored, and we’ve had one and missed.\n\n“My focus really is on the performance. We were decent enough without the ball in the first half, but we were nowhere near good enough with the ball - turned it over too easily and didn’t make enough passes when there was a real opportunity to do that against how Wolves set up.\n\n“That’s where my real annoyance is, in terms of today. We talked about it at half-time, about how defensively we looked solid enough. I know they had territory and possession, but we talked about if they were going to break through it was going to be down the sides, so we had to deal with the crosses - I thought we did that well, which was part of the plan.\n\n“What we didn’t do was look after the ball well enough, be brave enough and be creative enough when we got it. The message at half-time was to keep going with the defending but improve with the ball. Unfortunately, it’s taken us going 1-0 down for us to start playing, to start getting up the pitch and start looking like we could threaten on their goal.\n\n“We had decent moments with set-pieces, and with the penalty and Yatesy’s header, but we’ve not managed to take them. The result is the frustrating bit and the most disappointing bit, but I try to analyse the performance as well - and some of the first half in-possession stuff wasn’t what it should be.”\n\nAsked if he felt the visitors should have had a penalty from Williams’ effort, Cooper said: “We know the ref well from last year, particularly when you get him at home. I better leave that there.”\n\nAnd he added about the length of time it took for the referee to make a decision: “The first one, I think, especially. That’s why I’m biting my tongue, really, on how I feel about it, because if it’s taking that long and it’s not given in the first place, then it tells you something. But then there’s obviously influence and surroundings, and all that sort of stuff. As soon as that happened, because we knew who was there today, then I knew we were in trouble in that moment.”\n\nWhat did you make of the referee's performance? Have your say in the comments below\n\nREAD NEXT:"}, {"url": "https://www.birminghammail.co.uk/sport/football/football-news/steve-cooper-makes-julen-lopetegui-26614350", "page_content": "Nottingham Forest boss Steve Cooper accused the Wolverhampton Wanderers backroom staff of ill-discipline after the two sides drew 1-1 in a feisty relegation battle.\n\nBrennan Johnson’s first-half effort put Forest on course for a first Premier League win in seven games before Wolves substitute Daniel Podence’s late equaliser. But the game was overshadowed by a touchline melee at the start of the second half and a VAR intervention to check whether Podence had spat at Johnson in the closing stages.\n\nForest assistant Alan Tate and Wolves counterpart Pablo Sanz were both sent off by referee Chris Kavanagh after the official had waved away Wolves’ appeals for a penalty when Adama Traore went tumbling at the start of the second half. Cooper said of the touchline incident: “I can’t deny anything happened, but I didn’t see how it started.\n\nREAD MORE: Every word Julen Lopetegui said on clash with Forest bench, Neves ban and Toti impressing\n\nRATINGS: Daniel Podence rescues point as defenders endure bad day\n\n“We know, and I don’t say this disrespectfully, but there has been a lot of ill-discipline on the Wolves touchline since the change of manager (Julen Lopetegui replacing Bruno Lage). We were prepared for it. The last thing we wanted was for anything to boil over and for there to be any problems.\n\n“But at our stadium we cannot let opposing staff dominate officials and try and influence the game. We have to stand up to it and that’s all it was. I have zero complaints with our staff, zero complaints. We knew it was something that could possibly happen today and we were ready for it.\n\n“You prepare for a game on the pitch and sometimes you have to prepare for it off the pitch as well. Certainly in your own stadium when you’ve got a togetherness like we have, our supporters need to see not just the players giving everything, but the staff as well.”\n\nPodence escaped a red card or even a caution after video footage had been checked for possible spitting. Cooper added: “I’ve seen it back and I’ve spoken to Brennan and I’m not going to add any fuel to the fire because obviously there’s pictures and videos, so you have to trust the authorities to deal with it.\n\n“We’ll trust that the processes will kick in and I don’t want to say any more on that.”\n\nForest’s winless league run was extended to seven matches and Cooper added: “We were by far the better team. Tactically superior and the game-plan really worked.”\n\nWhat do you make of Cooper's remarks? Let us know in the comments section.\n\nREAD NEXT"}, {"url": "https://www.expressandstar.com/sport/football/wolverhampton-wanderers-fc/2022/10/25/forest-boss-steve-cooper-charged-by-fa-after-wolves-loss/", "page_content": "Steve Cooper with the officials at Molineux. Picture: Martin Rickett/PA Wire.\n\nThe officials and VAR had a big say in the game as both teams were awarded penalties, but Ruben Neves' spot-kick and Jose Sa's save handed Wolves all three points.\n\nAfter the game, Cooper implied that the referee is known to favour home teams and the FA have now confirmed he has been charged for those comments and has until October 27 to respond.\n\nAfter the game on October 15, Cooper said: “We know the referee well from last season. We had him in the Championship."}, {"url": "https://www.shropshirestar.com/sport/football/wolverhampton-wanderers-fc/2022/10/25/forest-boss-steve-cooper-charged-by-fa-after-wolves-loss/", "page_content": "Steve Cooper with the officials at Molineux. Picture: Martin Rickett/PA Wire.\n\nThe officials and VAR had a big say in the game as both teams were awarded penalties, but Ruben Neves' spot-kick and Jose Sa's save handed Wolves all three points.\n\nAfter the game, Cooper implied that the referee is known to favour home teams and the FA have now confirmed he has been charged for those comments and has until October 27 to respond.\n\nAfter the game on October 15, Cooper said: “We know the referee well from last season. We had him in the Championship."}, {"url": "https://www.bbc.co.uk/sport/av/football/63230310", "page_content": "Watch as manager Steve Cooper claims he was \"disappointed\" with his Nottingham Forest side stating \"they didn't show enough bravery\" in their 1-0 loss at Wolves.\n\nMATCH REPORT: Neves penalty earns Wolves win over Forest\n\nWatch Premier League highlights on Match of the Day on Saturday 15 October at 22:25 BST on BBC One, BBC iPlayer and the BBC Sport website & app.\n\nAvailable to UK users only."}, {"url": "https://www.wolves.co.uk/club/history/history/", "page_content": "“Champions of the World”\n\nLegendary former player Stan Cullis became manager in 1948 and helped Wolves win their third FA Cup, defeating Leicester City 3-1 in the final at Wembley Stadium the following year. Cullis, together with England captain Billy Wright, led Wolves throughout the 1950s – the most successful period in the club’s history.\n\nWolves became champions of England for the first time when they won the first division in the 1953/54 season, becoming the only club to have been champions of three division (they won the third division north in 1923/24 and the second division in 1931/32).\n\nAlso in the 1953/54 season, Wolves became one of the first clubs in Britain to install floodlights in their stadium.\n\nWolves played a number of floodlit friendlies against some of the top sides in Europe. The most famous match saw Wolves defeat Honved 3-2, whose team included many of the Hungarian national side who had just beaten England twice.\n\nThe result led the national media to proclaim Wolves “Champions of the World”. Others, notably Gabriel Hanot, editor of French magazine l’Equipe, wanted a competition where the best teams in Europe would play each other and Wolves’ floodlit wins were the catalyst for the formation of the European Cup.\n\nNow known as the UEFA Champions League, Wolves were one of the first British clubs to take part in the competition.\n\nTwo further league championship titles were won by the club in the 1957/58 and 1958/59 seasons, before another FA Cup – Wolves’ fourth and most recent – was added to the trophy cabinet in 1960, thanks to a 3-0 final victory over Blackburn Rovers."}, {"url": "https://www.nottinghampost.com/sport/football/football-news/nottingham-forest-steve-cooper-wolves-8313941", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nHead coach Steve Cooper says Nottingham Forest were prepared for the possibility of tempers flaring against Wolverhampton Wanderers.\n\nThe two teams clashed after their Carabao Cup tie earlier this season. And as they drew 1-1 at the City Ground in the Premier League, there was a flashpoint again.\n\nAssistant managers Alan Tate and Pablo Sanz, for Wolves, were sent off when the two coaching teams squared up in the second half. The visitors felt they should have had a penalty, arguing Adama Traore was fouled by Felipe.\n\nREAD MORE: How the Reds rated against Wolves\n\nREAD MORE: How the action unfolded at the City Ground\n\n“I can’t deny nothing happened. But I didn’t see exactly how it started because I was facing away,” Cooper said.\n\n“I don’t say this disrespectfully, but we know there has been a lot of ill-discipline on the Wolves touchline since the change of manager. I haven’t got a problem with it, until you come up against them.\n\n“We were prepared for it. The last thing we wanted was for anything to boil over and there to be any problems.\n\n“But at the same time, at our stadium, we cannot let opposing staff dominate officials and try to influence the game. We have to stand up for it. That’s all it was.\n\n“I don’t want to see any cards for any staff - us or them. I have zero complaints with our staff. At the same time, we know it was something that could possibly happen today, so we were ready for it.\n\n“Whether he (Tate) did or didn't deserve a red card, he’s got one so we’ll deal with it. I haven’t seen it back. What I do know is, you prepare for a game on the pitch, and sometimes you have to prepare for it off the pitch as well. Certainly in your own stadium, when you’ve got a togetherness like we have, supporters need to see not just the players giving everything, but the staff as well, because we are. That’s all that was.”\n\nNottingham Forest and the Brian Clough years - get your 48-page special edition of the Nottingham Post Brian Clough is a true Nottingham Forest legend. Two European Cups, a league title, two European Super Cups, four League Cups and close to two decades of cherished memories - Cloughie really was unique. To mark 30 years since he left the City Ground, the Nottingham Post have produced a special edition celebrating his trophy-laden time with Forest. It includes interviews with former Reds players, stunning images from our picture archives, columnists, and plenty more. You really don't want to miss it! The souvenir edition will hit the shops on April 19th, but you can PRE-ORDER YOUR COPY NOW! If you don't live in the area, don't worry - we have you covered. We will post UK and worldwide. All the info you need is HERE.\n\nIn a game with plenty riding on it, the hosts had looked on course for victory. Brennan Johnson’s 10th goal of the season in all competitions had given them the lead at the City Ground.\n\nThe Reds had their chances to kill the game off in the second half, but they failed to take them. And they paid the price when Daniel Podence equalised with less than 10 minutes to go.\n\nThe draw extended Forest’s winless run to seven games. They remain two points above the drop zone with 10 matches remaining.\n\nWhat did you make of today's draw? Have your say in the comments below\n\nREAD NEXT"}]}