{"Steve Cooper is currently the head coach of the England Under-17 team.": [{"url": "https://www.theguardian.com/football/2021/sep/21/nottingham-forest-appoint-steve-cooper-as-new-head-coach", "page_content": "The former Swansea City manager Steve Cooper has been appointed as the new head coach of Nottingham Forest on a contract to June 2024. Cooper, the club’s first choice, took training on Tuesday before his arrival was confirmed.\n\nForest needed to agree compensation with Swansea because Cooper has been on gardening leave since leaving in July, and that matter was sorted quickly.\n\nForest targeted Cooper because of his record of working with and improving young players, having had successful spells as Liverpool’s academy director and with England age-group teams, winning the Under-17 World Cupin 2017. Forest believe he overachieved with Swansea, taking them to the Championship play-off final last season and losing in the semi-finals the previous year.\n\nQuick Guide How do I sign up for sport breaking news alerts? Show Download the Guardian app from the iOS App Store on iPhone or the Google Play store on Android by searching for 'The Guardian'.\n\nIf you already have the Guardian app, make sure you’re on the most recent version.\n\nIn the Guardian app, tap the Menu button at the bottom right, then go to Settings (the gear icon), then Notifications.\n\nTurn on sport notifications. Was this helpful? Thank you for your feedback.\n\nThe 41-year-old replaces Chris Hughton who was dismissed last week after Forest’s defeat by Middlesbrough left them bottom with one point from seven matches. Forest picked up their first Championship win on Saturday when they beat Huddersfield 2-0 under the caretaker manager, Steven Reid, but remain in last place.\n\n“Steve was our first choice as head coach and we are delighted to have secured his services,” said the Forest chief executive, Dane Murphy. “His record of developing young talent is exceptional. Steve knows what is required to be successful in the Championship and has a proven track record with Swansea.\n\n“We have reduced the age of our squad over the summer and Steve is the ideal coach to blend a team to start moving us up the table. On behalf of the owner and the board, we welcome Steve to the club and look forward to providing every support he needs to be a success at Nottingham Forest.”\n\nCooper is expected to bring on to his staff two familiar faces from his Swansea days: the coach Alan Tate and analyst Steve Rands. Cooper’s first game will be at home to Millwall on Saturday."}, {"url": "https://www.premierleague.com/managers/65984/Steve-Cooper/overview", "page_content": "Manager Bio\n\nSteve Cooper was appointed head coach of Nottingham Forest on 21 September 2021.\n\nBorn in Pontypridd, Wales, Cooper played as a defender for several Welsh sides including Bangor City, while also studying for his coaching badges.\n\nAfter becoming one of the youngest coaches to obtain his UEFA Pro License, aged 27, Cooper went on to take charge of Wrexham and then Liverpool's academies.\n\nIn 2014, he was appointed manager of the England Under-16s, before going on to the Under-17s a year later.\n\nHe led them to the final of the 2017 UEFA European Championship, where they were beaten by Spain, but in October of that year, they avenged their loss with a 5-2 victory over the Spaniards in the FIFA Under-17 World Cup final.\n\nCooper joined Swansea City in June 2019, guiding them to the playoff final in 2020/21, where they lost out to Brentford at Wembley Stadium in his second and final season at the helm.\n\nIn his first campaign at Forest, Cooper took the club from the bottom of the table and ended their 23-year exile from the Premier League with a 1-0 win over Huddersfield Town in the Championship playoff final."}, {"url": "https://www.planetsport.com/soccer/england/steve-cooper", "page_content": "Steve Cooper Profile\n\nName Steve Cooper Born Dec 10, 1979 Age 42 years Birthplace Pontypridd Height 5ft 11ins\n\nSteve Cooper is a Welsh football manager and former player. He is the current head coach of Nottingham Forest having previously managed Swansea City and the England under-16 and under-17 set-ups.\n\nWith a relatively unimpressive playing career, highlighted by a two-year stint at Bangor City, Cooper's prowess comes via his coaching skills which have made him a highly sought after manager.\n\nHis notable work with the England youth teams included leading the under-17s to the final of the European Championship and victory in the World Cup. This success encouraged Swansea City to offer Cooper his first managerial role at club level in 2019.\n\nIn Cooper's two seasons at the South Wales outfit, he twice took the Swans to the play-offs. In his first season they lost out in the semi-finals to Brentford, who would again beat Cooper's side the next year, this time in the final. He left Swansea by mutual consent in the summer of 2021.\n\nIn September 2021 he was appointed head coach of Nottingham Forest, taking the club from the relegation zone to the play-offs, where they beat Huddersfield at Wembley. Forest had spent 20 seasons in the second tier prior to his arrival.\n\nSteve Cooper's early coaching career\n\nWhile still playing for Wrexham, Cooper trained to earn his UEFA pro license which he attained at 27, making him one of the youngest ever coaches to do so.\n\nHe went on to take up a position at Wrexham's academy as head of youth development and later moved to Liverpool in 2008 to work as a coach.\n\nAfter three years, Cooper was promoted to academy manager. He left in 2014 when the opportunity to manage England's under-17s arose.\n\nIn 2017, he coached his under-17s to the final of the UEFA European U17 Championship, losing out to Spain on penalties. Redemption came at the U17 World Cup, where again his team reached the final, this time hammering Spain 5-2.\n\nSteve Cooper's club career\n\nAfter five years managing the England youth set-up, Cooper was enticed by a job at Championship side Swansea City at the end of the 2018/19 season.\n\nIn his two seasons at the club, his knowledge of England's talented youth set-up allowed him to sign players such as Conor Gallagher and Marc Guehi, both of whom have gone on to represent the England first team.\n\nIn a dramatic end to his first season at the club, Swansea reached the play-offs on the final matchday of the season. A 91st-minute goal from Wayne Routledge secured a 4-1 victory over Reading but more crucially gave his side a superior goal difference to Nottingham Forest to pip the East Midlands club to sixth place.\n\nHowever despite a 1-0 win over Brentford in the first leg of the semi-finals, the Swans were defeated 3-1 at Griffin Park and missed out on the final.\n\nWell done Steve Cooper and all the players of @SwansOfficial getting to the play off final in Wembley\n\n\n\nCracking goal @Matt_Grimes8 pic.twitter.com/8t7zH7MSGv — ðŸ´ó §ó ¢ó ·ó ¬ó ³ó ¿ ðŸ¦¢N D L ðŸ¦¢ðŸ´ó §ó ¢ó ·ó ¬ó ³ó ¿ (@NDLane1) May 22, 2021\n\nIn his second season, Cooper again guided his team into the play-offs with a much more comfortable fourth-placed finish.\n\nA 2-1 aggregate win over |Barnsley saw them into the final. However, once again, Cooper couldn't get the better of Thomas Frank's Brentford as they were beaten 2-0 at Wembley.\n\nA little over a month after the defeat, Swansea announced that Cooper would not be renewing his contract and would be leaving the club.\n\nTransforming Nottingham Forest\n\nIn September 2021, Chris Hughton was fired from his role as Nottingham Forest manager, with the club enduring their worst start to a season in over a century.\n\nForest were bottom of the table having taken only one point from their opening seven games. On September 21, Steve Cooper was named as Hughton's successor.\n\nAlmost immediately, Cooper transformed Forest and they began to rise up the table.\n\nHis expertise once again came into play during the January transfer window, signing young talented forwards Sam Surridge and Keinan Davis, as well as experienced centre-half Steve Cook - additions which would ultimately propel the club to the top end of the table.\n\nIn the 35 matches following his appointment, Forest picked up a remarkable 72 points.\n\nWith two games remaining, Forest were just three points off the automatic promotion spots. However, defeat at Bournemouth meant Cooper would once again have to go down the play-off route.\n\nNottingham Forest win the Championship play-off final to secure promotion to the Premier League ðŸ‘\n\n\n\nThey were bottom of the table when manager Steve Cooper took over in September ðŸ¤¯ pic.twitter.com/fMA8SxZ3xz — GOAL News (@GoalNews) May 29, 2022\n\nForest earned a 2-1 at Bramall Lane in the first leg of their semi-final against Sheffield United.\n\nHowever, Cooper's play-off curse seemed to be in full effect as a second-half comeback from the Blades saw the tie finish 3-3. Extra-time couldn't split the sides and it went down to a penalty shootout, in which Forest keeper Brice Samba's heroics sent his side to Wembley for the first time since 1992.\n\nForest defeated Huddersfield Town 1-0 in the final, meaning a first Premier League this century, with Cooper achieving something Forest managers before him had failed to do."}, {"url": "https://www.theguardian.com/football/2019/jun/10/swansea-managerial-vacancy-steve-cooper-england-under-17s", "page_content": "Steve Cooper is to become Swansea’s manager in a bold move by the Championship club. Cooper, who has never been in charge at first-team level and is the England Under-17 coach, impressed the board during a lengthy interview process and is set to be confirmed as Graham Potter’s replacement within 24 hours.\n\nThe 39-year-old will be a surprise choice to many, especially given his lack of experience with senior players, but he has a clear playing philosophy that is in tune with “the Swansea way” that Potter reintroduced last season and was so important to the club when they started the process of identifying a new manager.\n\nCooper has also been coaching for the best part of 20 years – he passed his pro-licence course at the age of 26 – and led England Under-17s to World Cup success in 2017.\n\nMichael Appleton, the former Oxford, Blackburn and Portsmouth manager, and John Eustace, who is the Queens Park Rangers No 2, were the two other candidates on a shortlist that was whittled down to three at the end of last week.\n\nTrevor Birch, the Swansea chairman, Leon Britton, who was recently appointed as the football adviser to the board of directors, and Alan Curtis, the club president, were involved in an interview process that culminated with a conference call to Swansea’s American owners.\n\nCooper emerged as the best candidate, so much so that comparisons were made with Brendan Rodgers, who won promotion to the Premier League with Swansea before joining Liverpool. It is understood Cooper gave an extremely detailed presentation, covering all areas of the job he is about to walk into, and his playing style was a significant factor too.\n\nThat he has worked extensively as a coach, developing and improving talented young professionals – he was Liverpool’s academy manager before taking up a post with the Football Association – was also seen as vital, mindful of the fact that Swansea have a callow squad. “One key criteria in identifying the new manager will be that he can work with these young players and help them to improve. That is crucial,” Birch said last month.\n\nSwansea also hope Cooper, who is expected to bring in Mike Marsh, a former Liverpool player and coach, as his assistant, will be able to tap into the contacts he has established while working at international level to utilise the loan market."}, {"url": "https://www.bbc.com/sport/football/48612914", "page_content": "Last updated on .From the section Swansea\n\nEngland Under-17s had never been beyond the World Cup quarter-finals until they won the competition in 2017 under Steve Cooper\n\nSwansea City have named England Under-17 World Cup-winning boss Steve Cooper as their new head coach on a three-year deal.\n\nWelshman Cooper, 39, has left his post as under-17 coach to take over at the Championship club.\n\nCooper, who has also worked in the academies at Wrexham and Liverpool, will be assisted at Swansea by former Reds player Mike Marsh.\n\n\"I'm really excited about the challenge ahead,\" Cooper said.\n\n\"This opportunity is something I've been working towards my whole life, certainly since I started coaching 22 years ago.\n\n\"I have already done a huge amount of homework on the playing style, the squad and plans for pre-season. Now I just can't wait to get started.''\n\nSwansea have been searching for a new boss since Graham Potter left for Brighton in May.\n\nCooper arrives with a reputation as a high-class coach who wants his teams to play possession football.\n\nSwansea spoke to more than 60 managerial candidates following Potter's exit, with John Eustace, Lee Bowyer, Cameron Toshack and Michael Appleton making the shortlist.\n\nBut it is understood Cooper was the unanimous choice of chairman Trevor Birch, adviser to the board Leon Britton and club president Alan Curtis, who then gave their recommendation to Swansea's American owners.\n\nGraham Potter spent one season in charge at Swansea City before leaving for Brighton\n\nThe Football Association did not stand in Cooper's way when it became clear he wanted to take his first job in club management.\n\n\"I would like to place on record our thanks to Steve and Mike for their outstanding work and achievements here at The FA,\" Les Reed, FA technical director, said.\n\n\"One of our key objectives is the England senior team being ready to win the World Cup in 2022.\n\n\"Both Steve and Mike played a pivotal part in developing players and our teams as we work towards that goal.\"\n\nThe son of ex-Premier League referee Keith, former defender Cooper was on the books at Wrexham as a youngster but did not make the grade in the professional game.\n\nHe played for The New Saints, Rhyl, Bangor City and Porthmadog, but began coaching in the Wrexham youth set-up in his twenties.\n\nHe had made it to head of youth at Wrexham when he moved to Liverpool's academy in 2008, and switched to the FA five years later.\n\nThe likes of Phil Foden, Jadon Sancho and Callum Hudson-Odoi were in the squad Cooper led to glory at the Under-17 World Cup in 2017.\n\nVacancies to fill\n\nMarsh, who worked alongside Cooper at the FA and previously at Anfield, has been named assistant coach.\n\nHe will not be the only new member of staff joining Swansea, who have a number of vacancies to fill.\n\nPotter took assistant manager Billy Reid, coach Bjorn Hamberg and head of recruitment Kyle Macaulay with him to Brighton, while analyst Scott Helmich has also moved on this summer.\n\nAs well as rebuilding their first-team staff under Pontypridd-born Cooper, Swansea are to assemble a new recruitment team this summer."}, {"url": "https://www.bbc.co.uk/sport/football/57918658", "page_content": "Steve Cooper took charge of Swansea's friendly win at Plymouth on Tuesday night\n\nSteve Cooper has left his position as Swansea City's head coach.\n\nCooper, 41, had been in charge at the Championship club since June 2019 and had a year remaining on his contract.\n\nHe led Swansea to the play-offs in each of his two seasons in charge.\n\n\"I am very proud of what we have achieved over the past two seasons, especially getting to the play-off final, but it feels like a good time for all parties to make a change,\" Cooper told Swansea City's website.\n\n\"It is a fantastic club, with incredible supporters and I am very grateful to them, to the players and all the staff for making me so welcome here. I wish the team every success for the future.\"\n\nThere had been continued speculation Cooper could depart after defeat to Brentford at Wembley in May in the Championship play-off final.\n\nSwansea say they made \"efforts\" to discuss the idea of a new contract with Cooper, but that it was \"subsequently agreed by both parties to mutually part ways\".\n\n\"We feel this conclusion is in the best interests of the club with a new season just over two weeks away,\" said Swansea chief executive Julian Winter.\n\n\"This decision was reached amicably two weeks ago, and I would like to place on record my thanks to Steve for taking pre-season and for his professionalism while this process has been resolved.\n\n\"During his two years in charge, Steve has immersed himself in the club and continually improved our league position as well as giving young players a first-team opportunity.\n\n\"It has been well-documented that since the club dropped out of the Premier League, the financial position was one that meant the club had to be far more sustainable and we are pleased that so many young players have come here and been afforded that opportunity by Steve and his coaching staff.\n\n\"Just like the playing squad, when a manager has 12 months left on a contract, there has to be a coherent plan that allows the club to continue to build both on and off the pitch, and that involves dialogue around contracts.\n\n\"We felt as a club that the situation needed clarity and with a new season edging closer, the mutual nature of this decision allows both parties a chance to look forward.\n\n\"I would like to take this opportunity to wish Steve the best of luck for the future and thank him for the work he has done during his two years with the football club.\"\n\nFormer England Under-17 coach Cooper was in the dugout for Swansea's pre-season friendly win at Plymouth Argyle on Tuesday night, but leaves the Liberty Stadium with the new Championship season a little over two weeks away.\n\nCooper is known to have had concerns about the strength of his playing squad following the summer departure of Andre Ayew as well as the exits of players like Freddie Woodman and Marc Guehi, who had impressed during loan spells.\n\nSwansea are hopeful of making a swift appointment as they seek Cooper's replacement, with potential candidates already being considered by the club's hierarchy.\n\nCooper's exit is not a shock given the long-standing question marks surrounding his position.\n\nHe was a contender to take over at Crystal Palace before Patrick Vieira landed that job, while he was also heavily linked with Fulham until they opted for Marco Silva.\n\nCooper impressed in his two seasons at Swansea, finishing sixth and then fourth in the second tier despite working on a limited budget.\n\nHe made a number of shrewd signings and produced a team who played attractive football at times, although Cooper's Swansea often ground out results, particularly in the 2020-21 campaign.\n\nThey showed their resilient side to beat Barnsley in last season's play-off semi-finals, but were beaten by Brentford - who had also been Swansea's conquerors in the previous year's play-offs - after a lacklustre display in the final.\n\nCooper has been at the helm for Swansea's pre-season campaign, and spoke to the media for the first time since missing out on a return to the Premier League following their 2-1 friendly win at Plymouth."}, {"url": "https://www.bbc.com/sport/football/48541951", "page_content": "Last updated on .From the section Swansea\n\nSteve Cooper is the son of former referee Keith Cooper\n\nWorld Cup-winning England Under-17 coach Steve Cooper is set to be appointed Swansea City manager.\n\nCooper is understood to have agreed terms with Swansea having been offered the chance to succeed Graham Potter, who left to take over Brighton and Hove Albion.\n\nThe Welshman, 39, impressed during two interviews with the Championship club.\n\nCooper is currently employed by the Football Association, but that is not expected to be an issue.\n\nThe Pontypridd-born coach is likely to be joined at Swansea by Mike Marsh, the former Liverpool midfielder who has worked with him at the FA and previously at Anfield.\n\nCooper has seen off the likes of Michael Appleton, Lee Bowyer, Cameron Toshack and John Eustace to take over at the Liberty Stadium.\n\nHe is likely to be confirmed as Swansea's new boss in the next 48 hours.\n\nCooper was Liverpool's academy manager before joining the Football Association in 2013.\n\nHe led an England side featuring Phil Foden and Jadon Sancho to victory in the Under-17 World Cup in 2017.\n\nSteve Cooper celebrates England's victory over Spain in 2017\n\nCooper was on the books at Wrexham as a youngster but failed to make a professional appearance for the north Wales club.\n\nHe went on to play for The New Saints, Rhyl, Bangor City and Porthmadog but began taking his coaching badges young and had a pro licence - the highest qualification - at the age of 27.\n\nCooper's coaching career began at Wrexham, where his work in the youth set-up saw him land a move to Liverpool's academy in 2008.\n\nHe worked with the likes of Raheem Sterling, Trent Alexander-Arnold and Ben Woodburn during his time on Merseyside, where he was promoted to academy manager in 2011.\n\nCooper joined the FA as a youth coach educator in 2013 and was named England Under-16s coach in 2014, meaning he was working directly under then England Under-21 coach Gareth Southgate.\n\nHe was made Under-17 coach in 2015 and steered England to victory in the World Cup in India two years later.\n\nSwansea want a manager who will play possession football and Cooper is seen as someone who fits that bill."}, {"url": "https://www.telegraph.co.uk/football/2021/02/10/world-cup-winning-coach-steve-cooper-investing-youth-help-swansea/", "page_content": "Cooper, 41, has turned Swansea into promotion challengers despite having had to sell more than £60 million worth of players over his two seasons in charge. With only around £2 million spent in fees in that time, he has done so with some of the shrewdest loans signings in the market, from Liverpool’s former academy boy Rhian Brewster last season, another England Under-17s World Cup winner, to the experience of Conor Hourihane, from Aston Villa, last month.\n\nWhen Cooper’s side beat leaders Norwich City on Friday, even Hourihane said he had not seen a side like it when it came to the defensive part of the game. In the top four divisions their 15 goals conceded in 27 league games is second only to Manchester City’s 14 in 22.\n\n“The mentality to keep the ball out of the back of the net is something like I haven’t seen before,” Hourihane said, “it’s top class.”\n\nCooper’s England Under-17s team, made up of Foden’s “generation-millennium”, born in the year 2000, was a richly talented array of players. In 2019 he arrived at Swansea with the club in the process of selling their best. Oli McBurnie to Sheffield United; Daniel James to Manchester United and Jordan Ayew to Crystal Palace, as well as the expiration of contracts of players such as Leroy Fer and Martin Olsson. Last summer Cooper lost academy graduate and Wales international Joe Rodon to Spurs for £11 million with add-ons – a bargain.\n\nWith American owners who have been reluctant to invest, it has fallen to Cooper to find younger, cheaper talent. At different times he has persuaded his former Under-17 World Cup winners Conor Gallagher, Brewster, Marc Guehi, Morgan Gibbs-White and Freddie Woodman to join on loan. Joel Latibeaudiere, captain of that Under-17s team, has now signed permanently. From outside that circle, Ben Wilmot and Sam Surridge broke into the England Under-21s side while on loan at the Liberty Stadium.\n\nCentre-half Ben Cabango, 20, was promoted from Swansea’s Under-23s by Cooper and is now a senior Wales international. Older players have thrived too, including Andre Ayew, the last refugee from the days when Swansea played Premier League wages – £80,000 a week in his case – returned from loan and has been a key figure. Ryan Bennett, Korey Smith, Jake Bidwell and Kyle Naughton have all been revitalised. Matt Grimes was made captain at 24.\n\nThe signing of Jamal Lowe, who has scored nine this season in the Championship, was a big deal for Swansea at £800,000 from Wigan Athletic. He chose Swansea for their style of play. They are often described as possession-based but their key characteristic has been to pass the ball forward quickly. It can give them lower possession counts but greater effectiveness in attacks.\n\nCooper and his long-term assistant, Mike Marsh, have brought much of what worked for them at the FA, in the years of success under former technical director Dan Ashworth, to Swansea. There is much emphasis on team meetings, and between individuals and coaches. There is a player leadership group and players are encouraged to take their own initiative.\n\nThe background in youth development without a major playing career means that Cooper, like Jose Mourinho and Brendan Rodgers, both of whom had the same, has waited until his late thirties for a senior management role. He completed his Pro Licence at 26 – the youngest to do so. He was a coach at the Wrexham and then Liverpool academies before the FA.\n\nIn terms of net spend relative to points gained in the Championship, Swansea under Cooper have been comfortably in the top five over the past two seasons.\n\nThose kinds of returns are likely to catch the eye of a club more ambitious than Swansea, who seem unwilling to invest in retaining talent. Yet here they are, facing the country’s form club and England’s form player in the FA Cup – and still with a chance of a place in the Premier League next season."}, {"url": "https://www.theguardian.com/football/2021/jul/21/swansea-head-coach-steve-cooper-heading-for-exit-after-growing-unsettled", "page_content": "Steve Cooper has departed Swansea City by mutual consent after growing unsettled. The head coach led Swansea to successive Championship play-off finishes but made clear his concerns over the direction of the club.\n\nThe 41-year-old took Swansea to the play-off final last season on a modest budget. The club were keen to offer Cooper, whose deal runs until next summer, a new contract following defeat by Brentford at Wembley but the former England Under-17 manager was reluctant to enter talks. Cooper was of interest to Crystal Palace before the Premier League club appointed Patrick Vieira, and his work at Swansea also attracted attention from Fulham, who appointed Marco Silva.\n\nCooper said “it feels like a good time for all parties to make a change” and Swansea’s chief executive, Julian Winter, pointed to the head coach’s contract situation. “We felt as a club that the situation needed clarity and with a new season edging closer, the mutual nature of this decision allows both parties a chance to look forward,” he said.\n\nCooper has established a reputation as one of the country’s most exciting young coaches and has helped develop the youngsters Joe Rodon, Rhian Brewster and Marc Guehi, the last of whom this week joined Palace from Chelsea after two seasons on loan at Swansea.\n\nThe timing of Cooper’s exit is poor given Swansea are due to start the season at Blackburn Rovers in less than three weeks. It is unclear who will take interim charge and financial restraints suggest it is unlikely they will move for a manager for whom they must pay compensation. The club has a longstanding interest in the Lincoln City manager Michael Appleton, who is recovering after successful testicular cancer surgery, and the Queens Park Rangers assistant John Eustace is also thought to have been shortlisted before Cooper’s appointment in June 2019."}, {"url": "https://www.bbc.co.uk/sport/football/56129473", "page_content": "Last updated on .From the section Swansea\n\nLeon Britton (left) was Swansea's City sporting director briefly during Steve Cooper's early months in charge\n\nFormer Swansea City midfielder Leon Britton is \"not surprised\" the club's head coach Steve Cooper has been linked with other jobs.\n\nUnder Cooper, appointed in June 2019, Swansea lost in last season's Championship play-off semi-finals and are currently third in the table.\n\nCooper has dismissed rumours of him succeeding Roy Hodgson at Crystal Palace in the summer.\n\n\"You hope that the club try and tie him down on a new contract\" Britton said.\n\n\"It's no surprise to me that he has admirers outside of the football club with the job that he's done with a very young squad, with the players he's brought in and the style of football that he plays.\n\n\"If there were any question marks over him managing in senior football they quickly evaporated.\"\n\nSwansea is 41-year-old Cooper's first club managerial role with the Welshman having previously coached England's youth sides, including the Under-17 World Cup winning side in 2017.\n\nThe Swans have previously seen promising young managers leave for other clubs after making their mark at the Liberty Stadium.\n\nSwansea are third in the Championship after Connor Roberts' goal secured a 1-0 win over Nottingham Forest\n\nRoberto Martinez joined Wigan Athletic in 2009, Brendan Rodgers switched to Liverpool three years later and Graham Potter departed to Brighton in 2019.\n\n\"With Swansea and the size of the club that we are, unfortunately it happens,\" Britton told BBC Radio Wales Sport.\n\n\"We've seen it in the past and I think it speaks volumes for the job Steve has done.\n\n\"He's a very good manager and a manager that I could see here for the long term.\"\n\nBritton was part of the Swansea squad which suffered relegation from the Premier League in 2018 after seven seasons in English football's top-flight.\n\nThe 38-year-old was Swansea's first sporting director and a member of the recruitment team which appointed Cooper as boss.\n\nCooper guided Swansea to the Championship play-offs in his first full season in charge, but they were beaten by Brentford in the semi-finals.\n\n\"Steve's done an excellent job but he will want to go one better this year,\" Britton added.\n\n\"Last year making the play-offs and not quite getting over the line, he'll want to get over the line this year and he'll be desperate to achieve that.\n\n\"If he does that then we'll look back and say it's been an amazing season.\""}]}