{"Ernest Miller was a member of the American Society of Cinematographers.": [{"url": "https://prabook.com/web/ernest.miller/2424363", "page_content": "Ernest Miller\n\ncinematographer\n\nMarch 7, 1885 (age 72) Pasadena, California, United States of America\n\nHe had nearly 350 film and television credits to his name, mostly Westerns, including some of the early episodes of Gunsmoke. Location work on Army Girl was done primarily at the Iverson Movie Ranch in Chatsworth, California, where Miller cut his teeth in B-Westerns and became one of the most prolific -- and one of the best -- of the site\"s shooters during the course of his career. His camera work at Iverson became identifiable for Miller\"s trademark use of the site\"s charismatic sandstone rock features as framing devices, as he incorporated the giant boulders into the artistry of the outdoor action shots in ways that few cinematographers could match."}, {"url": "https://www.the-sun.com/news/6397049/jeffrey-dahmer-victim-ernest-miller/", "page_content": "FOLLOWING the release of the Dahmer - Monster: The Jeffrey Dahmer Story on Netflix, the world has been left surprised by how a serial killer managed to get away with 17 murders.\n\nOne of those murders was that of Ernest Miller and here is all we know about him.\n\nWho was Ernest Miller?\n\nErnest Miller, also known as Ronald Marquez Miller was hoping to become a professional dancer when he was murdered at 22 years old.\n\nHe spent some time working after he graduated from Milwaukee High School of the Arts at West Division.\n\nMiller was about to start attending classes at an arts college in Chicago before his life came to an end.\n\nHis aunt, Vivian Miller spoke about his talents and his upbringing.\n\n1 Ernest Miller was Jeffrey Dahmer's 14th victim Credit: A&E\n\nShe said: \"He was a talented dancer.\n\n\"He was singing and performing when he was young and used to sing at church.\"\n\nAt Jeffrey Dahmer's trial, Ernest's uncle, Stanley Miller spoke about how there is no space for a person like Jeffrey in this world.\n\nHe said: \"There is no place in a civilised society for anyone who shows no regard for life.\n\n\"I'm not for the death penalty, but you are the perfect candidate.\"\n\nWhat happened to Ernest Miller?\n\nErnest Miller and Jeffrey Dahmer met in front of a bookshop on North 27th Street.\n\nMiller was visiting his aunt in Milwaukee over Labor Day weekend.\n\nDahmer invited Miller back to his apartment, offering him money for sex.\n\nMiller followed him and after the act, Dahmer drugged the 22-year-old and slit his throat.\n\nDahmer disturbingly kept his biceps in the freezer, painted his skull and also bleached his skeleton.\n\nWho were Jeffrey Dahmer's other victims?\n\nSadly, Ernest Miller was not Dahmer's only victim.\n\nHe butchered at least 17 young men and boys, and sometimes even cannibalized them, which earned him the name of \"Milwaukee Monster.\"\n\nThe men ranged from ages 14 to 32 and most of them were of gay ethnic minorities.\n\nHis other victims were:"}, {"url": "https://theasc.com/news/asc-unveils-list-of-100-milestone-films-in-cinematography-of-the-20th-century", "page_content": "The list represents a range of styles, eras and visual artistry, but, most importantly, it commemorates films that are inspirational or influential to ASC members and have exhibited enduring influence to generations of filmmakers.\n\nThe list culminates in a Top 10 by number of votes, while the other 90 titles are unranked.“We are trying to call attention to the most significant achievements of the cinematographer’s art,” Fierberg assures. “We do not presume to call one masterful achievement ‘better’ than another.”\n\nMembers chose to frame this list around the 20th century to ensure that enough time has passed for the titles and work to reasonably exhibit enduring influence.\n\nThe process of cultivating the 100 films began with ASC members each submitting 10 to 25 titles that were personally inspirational or perhaps changed the way they approached their craft. “I asked them — as cinematographers, members of the ASC, artists, filmmakers and people who love film and whose lives were shaped by films — to list the films that were most influential,” Fierberg explains. A master list was then complied, and members voted on what they considered to be the most essential 100 titles.\n\n\n\nSince the ASC list is specifically focused on outstanding cinematography, several titles here do not appear on typical “best of” lists — such as Baraka, The Conformist and I Am Cuba — and members were encouraged to submit films for consideration that they believed were overlooked or ahead of their time.\n\nDetailed essays and historical information on each title will be published over the coming months, celebrating the diverse, global art form of cinematography throughout the ASC’s Centennial year.\n\n\n\nThe Top 10\n\n1. Lawrence of Arabia (1962), shot by Freddie Young, BSC (Dir. David Lean)\n\n2. Blade Runner (1982), shot by Jordan Cronenweth, ASC (Dir. Ridley Scott) (more here and here)\n\n3. Apocalypse Now (1979), shot by Vittorio Storaro, ASC, AIC (Dir. Francis Ford Coppola) (more here)\n\n4. Citizen Kane (1941), shot by Gregg Toland, ASC (Dir. Orson Welles)\n\n5. The Godfather (1972), shot by Gordon Willis, ASC (Dir. Francis Ford Coppola) (more here and here)\n\n\n\n6. Raging Bull (1980), shot by Michael Chapman, ASC (Dir. Martin Scorsese)\n\n7. The Conformist (1970), shot by Vittorio Storaro, ASC, AIC (Dir. Bernardo Bertolucci) (more here)\n\n8. Days of Heaven (1978), shot by Néstor Almendros, ASC (Dir. Terrence Malick) (more here)\n\n9. 2001: A Space Odyssey (1968), shot by Geoffrey Unsworth, BSC with additional photography by John Alcott, BSC (Dir. Stanley Kubrick) (more here and here)\n\n10. The French Connection (1971), shot by Owen Roizman, ASC (Dir. William Friedkin) (more here, here and here)\n\nTitles 11–100 (in order of release)\n\nMetropolis (1927), shot by Karl Freund, ASC; Günther Rittau\n\nNapoleon (1927), shot by Leonce-Henri Burel, Jules Kruger, Joseph-Louis Mundwiller\n\nSunrise (1927), shot by Charles Rosher Sr., ASC; Karl Struss, ASC\n\nGone with the Wind (1939), shot by Ernest Haller, ASC\n\nThe Wizard of Oz (1939), shot by Harold Rosson, ASC (more here)\n\nThe Grapes of Wrath (1940), shot by Gregg Toland, ASC\n\nHow Green Was My Valley (1941), shot by Arthur C. Miller, ASC\n\nCasablanca (1942), shot by Arthur Edeson, ASC (more here)\n\nThe Magnificent Ambersons (1942), shot by Stanley Cortez, ASC\n\nBlack Narcissus (1947), shot by Jack Cardiff, BSC\n\nThe Bicycle Thief (1948), shot by Carlo Montuori\n\nThe Red Shoes (1948), shot by Jack Cardiff, BSC\n\n\n\nThe Third Man (1949), shot by Robert Krasker, BSC\n\nRashomon (1950) shot by Kazuo Miyagawa\n\nSunset Boulevard (1950), shot by John Seitz, ASC (more here)\n\nOn the Waterfront (1954), shot by Boris Kaufman, ASC\n\nSeven Samurai (1954), shot by Asakazu Nakai\n\nThe Night of the Hunter (1955), shot by Stanley Cortez, ASC (more here)\n\nThe Searchers (1956), shot by Winton C. Hoch, ASC\n\nThe Bridge on the River Kwai (1957), shot by Jack HIldyard, BSC\n\nTouch of Evil (1958), shot by Russell Metty, ASC (more here)\n\nVertigo (1958), shot by Robert Burks, ASC (more here)\n\nNorth by Northwest (1959), shot by Robert Burks, ASC (more here)\n\nBreathless (1960), shot by Raoul Coutard\n\nLast Year at Marienbad (1961), shot by Sacha Vierny\n\n8 ½ (1963), shot by Gianni Di Venanzo\n\nHud (1963), shot by James Wong Howe, ASC (more here)\n\nDr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964), shot by Gilbert Taylor, BSC (more here)\n\nI Am Cuba (Soy Cuba; 1964), shot by Sergei Urusevsky (more here)\n\nDoctor Zhivago (1965), shot by Freddie Young, BSC\n\nThe Battle of Algiers (1966), shot by Marcello Gatti\n\nWho's Afraid of Virginia Woolf? (1966), shot by Haskell Wexler, ASC (more here)\n\nCool Hand Luke (1967), shot by Conrad Hall, ASC\n\n\n\nThe Graduate (1967), shot by Robert Surtees, ASC\n\n\n\nIn Cold Blood (1967), shot by Conrad Hall, ASC (more here)\n\nOnce Upon a Time in the West (1968), shot by Tonino Delli Colli, AIC (more here)\n\nButch Cassidy and the Sundance Kid (1969), shot by Conrad Hall, ASC (more here)\n\nThe Wild Bunch (1969), shot by Lucien Ballard, ASC\n\nA Clockwork Orange (1971), shot by John Alcott, BSC (more here)\n\nKlute (1971), shot by Gordon Willis, ASC\n\n\n\nThe Last Picture Show (1971), shot by Robert Surtees, ASC (more here)\n\nMcCabe and Mrs. Miller (1971), shot by Vilmos Zsigmond, ASC, HSC\n\n\n\nCabaret (1972), shot by Geoffery Unsworth, BSC\n\n\n\nLast Tango in Paris (1972), shot by Vittorio Storaro, ASC, AIC (more here)\n\nThe Exorcist (1973), shot by Owen Roizman, ASC (more here and here)\n\nChinatown (1974), shot by John A. Alonzo, ASC (more here)\n\nThe Godfather: Part II (1974), shot by Gordon Willis, ASC (more here)\n\nBarry Lyndon (1975), shot by John Alcott, BSC (more here)\n\nOne Flew Over the Cuckoo's Nest (1975), shot by Haskell Wexler, ASC\n\n\n\nAll the President's Men (1976), shot by Gordon Willis, ASC (more here)\n\nTaxi Driver (1976), shot by Michael Chapman, ASC\n\n\n\nClose Encounters of the Third Kind (1977), shot by Vilmos Zsigmond, ASC, HSC\n\n\n\nThe Duellists (1977), shot by Frank Tidy, BSC\n\n\n\nThe Deer Hunter (1978), shot by Vilmos Zsigmond, ASC, HSC (more here)\n\nAlien (1979), shot by Derek Vanlint, CSC (more here, here and here)\n\nAll that Jazz (1979), shot by Giuseppe Rotunno, ASC, AIC\n\n\n\nBeing There (1979), shot by Caleb Deschanel, ASC\n\n\n\nThe Black Stallion (1979), shot by Caleb Deschanel, ASC\n\n\n\nManhattan (1979), shot by Gordon Willis, ASC\n\n\n\nThe Shining (1980), shot by John Alcott, BSC (more here and here)\n\nChariots of Fire (1981), shot by David Watkin, BSC\n\nDas Boot (1981), shot by Jost Vacano, ASC (more here)\n\nReds (1981), shot by Vittorio Storaro, ASC, AIC\n\n\n\nFanny and Alexander (1982), shot by Sven Nykvist, ASC\n\n\n\nThe Right Stuff (1983), shot by Caleb Deschanel, ASC\n\n\n\nAmadeus (1984), shot by Miroslav Ondricek, ASC, ACK\n\n\n\nThe Natural (1984), shot by Caleb Deschanel, ASC\n\n\n\nParis, Texas (1984), shot by Robby Müller, NSC, BVK (more here)\n\nBrazil (1985), shot by Roger Pratt, BSC\n\n\n\nThe Mission (1986), shot by Chris Menges, ASC, BSC\n\n\n\nEmpire of the Sun (1987), shot by Allen Daviau, ASC\n\n\n\nThe Last Emperor (1987), shot by Vittorio Storaro, ASC, AIC\n\n\n\nWings of Desire (1987), shot by Henri Alekan\n\n\n\nMississippi Burning (1988), shot by Peter Biziou, BSC\n\n\n\nJFK (1991), shot by Robert Richardson, ASC\n\n\n\nRaise the Red Lantern (1991), shot by Fei Zhao\n\nUnforgiven (1992), shot by Jack N. Green, ASC (more here)\n\nBaraka (1992), shot by Ron Fricke (more here)\n\nSchindler's List (1993), shot by Janusz Kaminski (more here)\n\nSearching For Bobby Fischer (1993), shot by Conrad Hall, ASC\n\n\n\nTrois Coulieurs: Bleu (Three Colours: Blue; 1993), shot by Slawomir Idziak, PSC\n\nThe Shawshank Redemption (1994), shot by Roger Deakins, ASC, BSC (more here)\n\nSeven (1995), shot by Darius Khondji, ASC, AFC (more here and here)\n\nThe English Patient (1996), shot by John Seale, ASC, ACS\n\nL. A. Confidential (1997), shot by Dante Spinotti, ASC, AIC (more here)\n\nSaving Private Ryan (1998), shot by Janusz Kaminski (more here and here)\n\nThe Thin Red Line (1998), shot by John Toll, ASC (more here and here)\n\nAmerican Beauty (1999), shot by Conrad Hall, ASC\n\n\n\nThe Matrix (1999), shot by Bill Pope (more here)\n\nIn the Mood for Love (2000), shot by Christopher Doyle, HKSC\n\n\n\nLook for updates on theasc.com and our social media channels (Facebook, Twitter, Instagram) as we showcase each of these 100 films and discuss why they have endured as inspiring examples of exemplary cinematography.\n\nAn enterprising AC reader created a Letterboxd playlist of these titles here."}, {"url": "https://theasc.com/about", "page_content": "Our History\n\n\n\n\n\nThe American Society of Cinematographers was founded in Hollywood in 1919 with the purpose of advancing the art and science of cinematography and bringing cinematographers together to exchange ideas, discuss techniques and promote the motion picture as an art form — a mission that continues today.\n\n\n\n\n\nArthur C. Miller, ASC is at the hand-cranked Bell & Howell 2709 camera, lining up on actor Richard Barthelmess while shooting the silent picture Experience (1921) for director George Fitzmaurice (seated).\n\n\n\n\n\nIn the early days of cinema, many directors of photography across the United States were faced with the same problem: big, ugly white streaks in their footage created by static electricity discharge created by their hand-cranked cameras. Instead working on their solutions in isolation, a two small groups of idealists, one located on each coast, came together to solve this and many other technical problems of the day.\n\n\n\n\n\nThe ASC charter from the state of California. (Click here to open in new window.)\n\n\n\n\n\nThey were the Cinema Camera Club, started by Edison cameramen Philip E. Rosen, Frank Kugler and Lewis W. Physioc in New York in 1913; and the Static Club of America, a Los Angeles-based society first headed by Universal cameraman Harry H. Harris.\n\n\n\n\n\nFrom the beginning, the two clubs had a loose affiliation, and eventually the West Coast organization changed its name to the Cinema Camera Club of California. But even as the center of film production shifted from New York to Los Angeles, the western organization was struggling to stay afloat.\n\n\n\n\n\nPhil Rosen came to Los Angeles in 1918. When he sought affiliation with the Cinema Camera Club of California, president Charles Rosher asked if he would help reorganize the association. Rosen sought to create a national organization, with membership by invitation and a strong educational component.\n\n\n\n\n\nThe reorganization committee met in the home of William C. Foster on Saturday, December 21, 1918, and drew up a new set of bylaws. The 10-member committee and five visitors were designated as the board of governors for the new organization. The next evening, in the home of Fred LeRoy Granville, the first officers for the American Society of Cinematographers were elected: Philip E. Rosen, president; Charles Rosher, vice-president; Homer A. Scott, second vice-president; William C. Foster, treasurer; and Victor Milner, secretary. The Society was chartered by the State of California on January 8, 1919.\n\n\n\n\n\nThe ASC’s declared purpose: to advance the art of cinematography through artistry and technological progress, and to cement a closer relationship among cinematographers to exchange ideas, discuss techniques and promote cinema as an art form.\n\n\n\n\n\nThe 15 original ASC members were Joe August, L.D. Clawson, Arthur Edeson, William C. Foster, Eugene Gaudio, Fred Le Roy Granville, Walter L. Griffin, J.D. Jennings, Roy H. Klaffki, Victor Milner, Robert S. Newhard, Philip E. Rosen, Charles G. Rosher, Homer A. Scott and L. Guy Wilky. (Complete bios here.)\n\n\n\n\n\n\n\n\n\nThe first documented appearance of the ASC credential in a film’s titles was Sand (1920), produced by and starring William S. Hart and shot by Joe August, ASC.\n\n\n\n\n\nNeither a labor union nor a guild, the ASC is an education, cultural, and professional organization. Membership is by invitation only, extended to directors of photography who have demonstrated outstanding ability with distinguished credits in the industry and good personal character.\n\n\n\n\n\nFrom left, actors Wallace Beery and Robert Florey, ASC founding member Arthur Edeson, star Douglas Fairbanks and director Allan Dwan during the production of Robin Hood (1922).\n\n\n\n"}, {"url": "https://theasc.com/articles/a-century-of-inspiration", "page_content": "Titles 11–100\n\n(in order of release)\n\nMetropolis (1927), shot by Karl Freund, ASC; Günther Rittau\n\nNapoleon (1927), shot by Leonce-Henri Burel, Jules Kruger, Joseph-Louis Mundwiller\n\nSunrise (1927), shot by Charles Rosher Sr., ASC; Karl Struss, ASC\n\nGone with the Wind (1939), shot by Ernest Haller, ASC\n\nThe Wizard of Oz (1939), shot by Harold Rosson, ASC (more here)\n\nThe Grapes of Wrath (1940), shot by Gregg Toland, ASC\n\nHow Green Was My Valley (1941), shot by Arthur C. Miller, ASC\n\nCasablanca (1942), shot by Arthur Edeson, ASC (more here)\n\nArthur Edeson, ASC stands by the camera as Humphrey Bogart and Ingrid Bergman make their final embrace during the famously difficult production of Casablanca (1942), directed by Michael Curtiz\n\nSteven Shaw, ASC: There is one moment in Casablanca when Ingrid Bergman walks into the bar late at night, and it’s closed, and Bogart is there, [wallowing in] the blues, drinking whiskey — and she asks her former lover to give her and her husband a pass to get out of Casablanca and away from the Germans. That close-up, that moment, is, to me, the most beautiful close-up ever shot — it’s beyond beautiful.\n\nI love Casablanca. The trickeries of the lighting — the airport that doesn’t exist. It’s on stage. You feel the airport’s presence, because they’re panning a spotlight through the background. That airport had such a dynamic emotional element to it, and you feel the panic of not being able to escape, and it’s just a spotlight! It’s like magic. It’s one of the great lessons in lighting.\n\nThe Magnificent Ambersons (1942), shot by Stanley Cortez, ASC\n\nBlack Narcissus (1947), shot by Jack Cardiff, BSC\n\nThe Bicycle Thief (1948), shot by Carlo Montuori\n\nThe Red Shoes (1948), shot by Jack Cardiff, BSC\n\nThe Third Man (1949), shot by Robert Krasker, BSC\n\nThe Third Man (1949)\n\nAlexander Gruszynski, ASC: I love The Third Man. The camera angles and the lighting are the crucial components of how the story is told. If you take away the visual elements, the story wouldn’t be as powerful — and I think this is a requirement for a milestone of cinematography. This is where all the kudos go to the film’s cinematographer, Robert Krasker, BSC. The famous scene when we first see Orson Welles’ character, Harry Lime, drowned in shadow — you don’t see his face at all, just a pair of shoes and the cat. Then all of a sudden, a neighbor in the building turns on the light and we see Harry Lime for the first time. It’s told with the lighting and the camera. The Third Man is the gold standard for film-noir cinema. It’s the most important film, I would say, in the whole noir genre.\n\n\n\nRashomon (1950) shot by Kazuo Miyagawa\n\nSunset Boulevard (1950), shot by John Seitz, ASC (more here)\n\nOn the Waterfront (1954), shot by Boris Kaufman, ASC\n\nSeven Samurai (1954), shot by Asakazu Nakai\n\nThe Night of the Hunter (1955), shot by Stanley Cortez, ASC (more here)\n\nThe Searchers (1956), shot by Winton C. Hoch, ASC\n\nThe Bridge on the River Kwai (1957), shot by Jack HIldyard, BSC\n\nTouch of Evil (1958), shot by Russell Metty, ASC\n\nVertigo (1958), shot by Robert Burks, ASC (more here)\n\nNorth by Northwest (1959), shot by Robert Burks, ASC (more here)\n\nBreathless (1960), shot by Raoul Coutard\n\nLast Year at Marienbad (1961), shot by Sacha Vierny\n\n8 ½ (1963), shot by Gianni Di Venanzo\n\nHud (1963), shot by James Wong Howe, ASC (more here)\n\nDr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964), shot by Gilbert Taylor, BSC\n\nI Am Cuba (Soy Cuba; 1964), shot by Sergei Urusevsky (more here)\n\nI Am Cuba (1964)\n\nNatasha Braier, ASC, ADF: There are shots in I Am Cuba that made cinematic history, and the most famous of these is the funeral procession [for a student who had joined the revolution]. I think it [epitomizes] everything that is amazing about this film — how they can do acrobatics with the camera and [accomplish] great technical achievements for that time, but in service to the film’s language, and to a message, and in a way that actually serves the story.\n\n\n\nThey didn’t have cranes or drones, yet the camera elevates and does all of these acrobatics. They had to create this whole system, where the operator wore a vest with a lot of hooks, and [crewmembers] were hooking him and unhooking him, and lifting him, and making him fly — with very simple means. The sequence starts with the camera on ground level, at a wide angle only a few inches from a young woman, so you really feel like you’re at this ‘human’ level. But then the camera starts to lift up vertically, and then horizontally to enter the third floor of a tobacco factory. It goes through the interior of that floor, and as if the shot wasn’t spectacular enough — especially for the time — the camera travels through [another] window and flies over the street, where you see a top shot of the procession. You’re now three stories high, and you see hundreds of people around the body, walking through the street, and the camera keeps flying above them.\n\nTo do all of that in one single take — on film, in the 1960s in Cuba, with such limited technology — is amazing, but it’s not just a technical stunt. The film’s language, acrobatics and camera stunts come together in this shot to tell that story. It touches all the elements that it needs to touch during the shot, going from the individual, to the collective, to the group of workers, to the big collective, which is almost like a wide shot of Cuba itself. It doesn’t make any sense to have a spectacular shot if it doesn’t have a meaning and a purpose behind it.\n\nDoctor Zhivago (1965), shot by Freddie Young, BSC\n\nThe Battle of Algiers (1966), shot by Marcello Gatti\n\nThe Battle of Algiers (1966)\n\nChris Menges, ASC, BSC: The Battle of Algiers is a startling and brilliant film about the Algerian war for independence from France. Shot in black-and-white, there are the most amazing re-created scenes of the struggle in the Casbah, the citadel of Algiers, with thousands of extras. There are scenes in which the tension is so powerful, scenes so moving, that you want to cry out. It is filmmaking at its greatest.\n\n\n\nCinematographer Marcello Gatti wheels the handheld camera to catch the moment. [Director] Gillo Pontecorvo lets the shots develop, never using the classical-editing reverse-shot technique. It’s inspired newsreel style: in black-and-white, with documentary-type editing to add to its sense of historical authenticity. The technique is enthralling.\n\nPontecorvo said, ‘My idea was to give the audience the impression that it was watching a documentary as events happened. We wanted our film to look like newsreel that looked grainy. Using a handheld camera let us spontaneously catch interesting faces and action.’\n\nA superb film — it lives!\n\nWho's Afraid of Virginia Woolf? (1966), shot by Haskell Wexler, ASC\n\nCool Hand Luke (1967), shot by Conrad Hall, ASC\n\nThe Graduate (1967), shot by Robert Surtees, ASC\n\nThe Graduate (1967)\n\nMichael Goi, ASC, ISC: I saw The Graduate when I was 8 years old, and I couldn’t believe how it made me feel. I realized ultimately that it was the cinematography that did that. Robert Surtees, ASC immediately became my hero. He had been the premier cameraman at MGM, had shot big movies like Ben-Hur, and when technology was changing, when new lightweight cameras were coming, he embraced it — and he worked with all the new, young directors when he was in his 70s.\n\n\n\nIn Cold Blood (1967), shot by Conrad Hall, ASC (more here)\n\nOnce Upon a Time in the West (1968), shot by Tonino Delli Colli, AIC (more here)\n\nButch Cassidy and the Sundance Kid (1969), shot by Conrad Hall, ASC\n\nThe Wild Bunch (1969), shot by Lucien Ballard, ASC\n\nA Clockwork Orange (1971), shot by John Alcott, BSC (more here)\n\nKlute (1971), shot by Gordon Willis, ASC\n\nThe Last Picture Show (1971), shot by Robert Surtees, ASC\n\nMcCabe and Mrs. Miller (1971), shot by Vilmos Zsigmond, ASC, HSC\n\nMcCabe & Mrs. Miller (1971)\n\nMat Beck, ASC: In terms of my all-time favorite movies, in which the look and sound of the movie carry me into another world, McCabe & Mrs. Miller is such an extraordinary piece of work. When I first saw it, I just loved it — but I didn’t appreciate, as much as I later came to, how beautiful the photography was, and how important it was. It was such an otherworldly experience, and yet so real. It was like an extremely real dream, so I wasn’t thinking too much about how they’d gone about doing it. That movie is a masterpiece, and the photography is of a piece with it, creating a world.\n\n\n\nCabaret (1972), shot by Geoffery Unsworth, BSC\n\nLast Tango in Paris (1972), shot by Vittorio Storaro, ASC, AIC\n\nThe Exorcist (1973), shot by Owen Roizman, ASC (more here)\n\nChinatown (1974), shot by John A. Alonzo, ASC (more here)\n\nThe Godfather: Part II (1974), shot by Gordon Willis, ASC\n\nBarry Lyndon (1975), shot by John Alcott, BSC (more here)\n\nOne Flew Over the Cuckoo's Nest (1975), shot by Haskell Wexler, ASC\n\nAll the President's Men (1976), shot by Gordon Willis, ASC (more here)\n\nTaxi Driver (1976), shot by Michael Chapman, ASC\n\nClose Encounters of the Third Kind (1977), shot by Vilmos Zsigmond, ASC, HSC\n\nClose Encounters of the Third Kind (1977)\n\nSteven Poster, ASC: Close Encounters of the Third Kind [featured] the largest set ever built indoors for a movie, and Vilmos [Zsigmond, ASC, HSC] — who was a romantic realist, in my opinion — photographed it with such a sure hand, and in a way that no matter what was happening on the set, no matter how difficult the situation was, he pushed forward and did a remarkable job of telling that story. It had a personal quality that, for a movie of that size and complexity, was unprecedented. It was an extraordinary feat.\n\n\n\nThe Duellists (1977), shot by Frank Tidy, BSC\n\nThe Deer Hunter (1978), shot by Vilmos Zsigmond, ASC, HSC (more here)\n\nAlien (1979), shot by Derek Vanlint, CSC (more here, here and here)\n\nAll that Jazz (1979), shot by Giuseppe Rotunno, ASC, AIC\n\nBeing There (1979), shot by Caleb Deschanel, ASC\n\nThe Black Stallion (1979), shot by Caleb Deschanel, ASC\n\nManhattan (1979), shot by Gordon Willis, ASC\n\nThe Shining (1980), shot by John Alcott, BSC (more here)\n\nChariots of Fire (1981), shot by David Watkin, BSC\n\nDas Boot (1981), shot by Jost Vacano, ASC\n\nReds (1981), shot by Vittorio Storaro, ASC, AIC\n\nFanny and Alexander (1982), shot by Sven Nykvist, ASC\n\nThe Right Stuff (1983), shot by Caleb Deschanel, ASC\n\nAmadeus (1984), shot by Miroslav Ondricek, ASC, ACK\n\nThe Natural (1984), shot by Caleb Deschanel, ASC\n\nParis, Texas (1984), shot by Robby Müller, NSC, BVK\n\nBrazil (1985), shot by Roger Pratt, BSC\n\nThe Mission (1986), shot by Chris Menges, ASC, BSC\n\nEmpire of the Sun (1987), shot by Allen Daviau, ASC\n\nThe Last Emperor (1987), shot by Vittorio Storaro, ASC, AIC\n\nWings of Desire (1987), shot by Henri Alekan\n\nMississippi Burning (1988), shot by Peter Biziou, BSC\n\nJFK (1991), shot by Robert Richardson, ASC\n\nRaise the Red Lantern (1991), shot by Fei Zhao\n\nUnforgiven (1992), shot by Jack Green, ASC (more here)\n\nBaraka (1992), shot by Ron Fricke\n\nSchindler's List (1993), shot by Janusz Kaminski\n\nSearching For Bobby Fischer (1993), shot by Conrad Hall, ASC\n\nSearching for Bobby Fischer (1993)\n\nCharles Minsky, ASC: From the film’s beginning, Conrad Hall, ASC’s cinematography in Searching for Bobby Fischer is warm and intimate. His use of long lenses enhances this interior, personal story and invites the viewer into the complicated relationships between the characters. The camera is always seeking the heart of the story through the heart of the 7-year old boy at its center. Continually moving in and out of the shadows, the close-ups of the boy, his parents and his teachers reveal the boy’s search for a hero to believe in. The camera doesn’t turn away. Through the boy’s eyes, it makes us confront ourselves. From the beginning close-up of the chessboard, reflected in a pair of sunglasses, to the ending close-up of two 7-year-old boys walking arm in arm away from camera, it maintains a personal and intimate involvement in the boy’s life. It makes us understand that the boy is only a boy.\n\n\n\nTrois Coulieurs: Bleu (Three Colours: Blue; 1993), shot by Slawomir Idziak, PSC\n\nThe Shawshank Redemption (1994), shot by Roger Deakins, ASC, BSC (more here)\n\nSeven (1995), shot by Darius Khondji, ASC, AFC (more here and here)\n\nThe English Patient (1996), shot by John Seale, ASC, ACS\n\nL. A. Confidential (1997), shot by Dante Spinotti, ASC, AIC (more here)\n\nSaving Private Ryan (1998), shot by Janusz Kaminski (more here and here)\n\nThe Thin Red Line (1998), shot by John Toll, ASC (more here)\n\nAmerican Beauty (1999), shot by Conrad Hall, ASC\n\nThe Matrix (1999), shot by Bill Pope, ASC (more here)\n\nIn the Mood for Love (2000), shot by Christopher Doyle, HKSC\n\nAs more related content regarding the titles on this list are added to our Historicals section, we'll continue to update this article with new links."}, {"url": "https://theasc.com/articles/totally-80s", "page_content": "Reflecting a rather dour decade — marked by endless conflict in Vietnam, civil unrest, Watergate and the fall of Nixon, and a general fraying of the social fabric — the movies of the 1970s became overwhelmingly heavy, man. Antiestablishmentarianism, nihilistic characters, and provocative tales of paranoia were increasingly normalized, even in the far-more-wholesome realm of network television.\n\n\n\nYet the astonishing box-office success of such optimistic, hero-driven, mid-to-late-’70s films as Jaws, Rocky, Star Wars, Close Encounters of the Third Kind, Superman: The Movie, and even Grease pointed in a new direction, with the studios seeking to capitalize on a perceived resurgence in “crowd-pleaser” pictures. Executives soon began green-lighting more high-dollar projects featuring dynamic cinematography and the latest in rapidly evolving visual-effects techniques.\n\nDuring the 1980s, American Cinematographer documented many of the resulting projects, launching into this new decade with a series of in-depth cover stories on such ambitious genre efforts as The Black Hole (AC Jan. ’80; shot by Frank Phillips, ASC), Star Trek: The Motion Picture (AC Feb. ’80; Richard H. Kline, ASC) and Star Wars: Episode V — The Empire Strikes Back (AC June ’80; Peter Suschitzky, ASC).\n\nWorking at ILM, animation expert Phil Tippett adjusts a stop-motion AT-AT Walker model while working on The Empire Strikes Back.\n\nThe June 1980 issue featuring Empire boasted total coverage on the complex production, with no less than nine major feature stories — detailing principal photography, visual effects (in a piece penned by Richard Edlund, ASC), optical photography, effects photography (featuring Dennis Muren, ASC), matte-painting work, and even the project’s extensive aerial filming. (Similarly lavish spreads would be bestowed upon Empire’s followup, Return of the Jedi, in June ’83.)\n\n\n\nWhile Suschitzky was challenged by Empire’s effects needs and often difficult sets (especially the swampland abode of diminutive Jedi master Yoda), he enthused, “I haven’t enjoyed myself so much on a film for a very long time. I worked with a director [Irvin Kershner] with whom I really got along tremendously, who encouraged me to do my utmost, and so I had a ball on it, really, and lots of large toys to play with. What more could one want?”\n\n\n\nThis cover-to-cover expanded reportage would become a hallmark of AC through the rest of the ’80s, as the magazine had the trust of the studios and the respect of filmmakers who grew up reading it — and wanted nothing more than to have their projects featured in its pages.\n\n"}, {"url": "https://www.britannica.com/biography/Ernest-Hemingway", "page_content": "spouse Martha Gellhorn ...(Show more)\n\nHaving departed Cuba, his home for some 20 years, Ernest Hemingway settled in Ketchum, Idaho, in 1960 and temporarily resumed his work, but, anxiety-ridden and depressed, he was twice hospitalized at the Mayo Clinic. On July 2, 1961, he took his life with a shotgun at his house in Ketchum.\n\nErnest Hemingway was born in a suburb of Chicago . He was educated in the public schools and began to write in high school, where he was active and outstanding. The parts of his boyhood that mattered most to him were summers spent with his family on Walloon Lake, near Petoskey , Michigan .\n\nErnest Hemingway, who was awarded the Nobel Prize for Literature in 1954, had a great impact on other writers through his deceptively simple, stripped-down prose, full of unspoken implication, and his tough but vulnerable masculinity, which created a myth that imprisoned the author and haunted the World War II generation.\n\nErnest Hemingway, in full Ernest Miller Hemingway, (born July 21, 1899, Cicero [now in Oak Park], Illinois, U.S.—died July 2, 1961, Ketchum, Idaho), American novelist and short-story writer, awarded the Nobel Prize for Literature in 1954. He was noted both for the intense masculinity of his writing and for his adventurous and widely publicized life. His succinct and lucid prose style exerted a powerful influence on American and British fiction in the 20th century.\n\nThe first son of Clarence Edmonds Hemingway, a doctor, and Grace Hall Hemingway, Ernest Miller Hemingway was born in a suburb of Chicago. He was educated in the public schools and began to write in high school, where he was active and outstanding, but the parts of his boyhood that mattered most were summers spent with his family on Walloon Lake in upper Michigan. On graduation from high school in 1917, impatient for a less-sheltered environment, he did not enter college but went to Kansas City, where he was employed as a reporter for the Star. He was repeatedly rejected for military service because of a defective eye, but he managed to enter World War I as an ambulance driver for the American Red Cross. On July 8, 1918, not yet 19 years old, he was injured on the Austro-Italian front at Fossalta di Piave. Decorated for heroism and hospitalized in Milan, he fell in love with a Red Cross nurse, Agnes von Kurowsky, who declined to marry him. These were experiences he was never to forget.\n\nBritannica Quiz Writer’s Block\n\nAfter recuperating at home, Hemingway renewed his efforts at writing, for a while worked at odd jobs in Chicago, and sailed for France as a foreign correspondent for the Toronto Star. Advised and encouraged by other American writers in Paris—F. Scott Fitzgerald, Gertrude Stein, Ezra Pound—he began to see his nonjournalistic work appear in print there, and in 1925 his first important book, a collection of stories called In Our Time, was published in New York City; it was originally released in Paris in 1924.\n\nIn 1926 he published The Sun Also Rises, a novel with which he scored his first solid success. A pessimistic but sparkling book, it deals with a group of aimless expatriates in France and Spain—members of the postwar Lost Generation, a phrase that Hemingway scorned while making it famous. This work also introduced him to the limelight, which he both craved and resented for the rest of his life. Hemingway’s The Torrents of Spring, a parody of the American writer Sherwood Anderson’s book Dark Laughter, also appeared in 1926.\n\nThe writing of books occupied Hemingway for most of the postwar years. He remained based in Paris, but he traveled widely for the skiing, bullfighting, fishing, and hunting that by then had become part of his life and formed the background for much of his writing. His position as a master of short fiction had been advanced by Men Without Women in 1927 and thoroughly established with the stories in Winner Take Nothing in 1933. Among his finest stories are “The Killers,” “The Short Happy Life of Francis Macomber,” and “The Snows of Kilimanjaro.” At least in the public view, however, the novel A Farewell to Arms (1929) overshadowed such works. Reaching back to his experience as a young soldier in Italy, Hemingway developed a grim but lyrical novel of great power, fusing love story with war story. While serving with the Italian ambulance service during World War I, the American lieutenant Frederic Henry falls in love with the English nurse Catherine Barkley, who tends him during his recuperation after being wounded. She becomes pregnant by him, but he must return to his post. Henry deserts during the Italians’ disastrous retreat after the Battle of Caporetto, and the reunited couple flee Italy by crossing the border into Switzerland. There, however, Catherine and her baby die during childbirth, and Henry is left desolate at the loss of the great love of his life.\n\nHemingway’s love of Spain and his passion for bullfighting resulted in Death in the Afternoon (1932), a learned study of a spectacle he saw more as tragic ceremony than as sport. Similarly, a safari he took in 1933–34 in the big-game region of Tanganyika resulted in Green Hills of Africa (1935), an account of big-game hunting. Mostly for the fishing, he purchased a house in Key West, Florida, and bought his own fishing boat. A minor novel of 1937 called To Have and Have Not is about a Caribbean desperado and is set against a background of lower-class violence and upper-class decadence in Key West during the Great Depression.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nBy now Spain was in the midst of civil war. Still deeply attached to that country, Hemingway made four trips there, once more a correspondent. He raised money for the Republicans in their struggle against the Nationalists under General Francisco Franco, and he wrote a play called The Fifth Column (1938), which is set in besieged Madrid. As in many of his books, the protagonist of the play is based on the author. Following his last visit to the Spanish war, he purchased Finca Vigía (“Lookout Farm”), an unpretentious estate outside Havana, Cuba, and went to cover another war—the Japanese invasion of China.\n\nThe harvest of Hemingway’s considerable experience of Spain in war and peace was the novel For Whom the Bell Tolls (1940), a substantial and impressive work that some critics consider his finest novel, in preference to A Farewell to Arms. It was also the most successful of all his books as measured in sales. Set during the Spanish Civil War, it tells of Robert Jordan, an American volunteer who is sent to join a guerrilla band behind the Nationalist lines in the Guadarrama Mountains. Most of the novel concerns Jordan’s relations with the varied personalities of the band, including the girl Maria, with whom he falls in love. Through dialogue, flashbacks, and stories, Hemingway offers telling and vivid profiles of the Spanish character and unsparingly depicts the cruelty and inhumanity stirred up by the civil war. Jordan’s mission is to blow up a strategic bridge near Segovia in order to aid a coming Republican attack, which he realizes is doomed to fail. In an atmosphere of impending disaster, he blows up the bridge but is wounded and makes his retreating comrades leave him behind, where he prepares a last-minute resistance to his Nationalist pursuers.\n\nAll of his life Hemingway was fascinated by war—in A Farewell to Arms he focused on its pointlessness, in For Whom the Bell Tolls on the comradeship it creates—and, as World War II progressed, he made his way to London as a journalist. He flew several missions with the Royal Air Force and crossed the English Channel with American troops on D-Day (June 6, 1944). Attaching himself to the 22nd Regiment of the 4th Infantry Division, he saw a good deal of action in Normandy and in the Battle of the Bulge. He also participated in the liberation of Paris, and, although ostensibly a journalist, he impressed professional soldiers not only as a man of courage in battle but also as a real expert in military matters, guerrilla activities, and intelligence collection.\n\nFollowing the war in Europe, Hemingway returned to his home in Cuba and began to work seriously again. He also traveled widely, and, on a trip to Africa, he was injured in a plane crash. Soon after (in 1953), he received the Pulitzer Prize in fiction for The Old Man and the Sea (1952), a short heroic novel about an old Cuban fisherman who, after an extended struggle, hooks and boats a giant marlin only to have it eaten by voracious sharks during the long voyage home. This book, which played a role in gaining for Hemingway the Nobel Prize for Literature in 1954, was as enthusiastically praised as his previous novel, Across the River and into the Trees (1950), the story of a professional army officer who dies while on leave in Venice, had been damned.\n\nBy 1960 Hemingway had left Cuba and settled in Ketchum, Idaho. (He expressed his belief in what he called the “historical necessity” of the Cuban Revolution; his attitude toward its leader, Fidel Castro, who had taken power in 1959, varied.) He tried to lead his life and do his work as before. For a while he succeeded, but, anxiety-ridden and depressed, he was twice hospitalized at the Mayo Clinic in Rochester, Minnesota, where he received electroshock treatments. Two days after his return to the house in Ketchum, he took his life with a shotgun. Hemingway had been married four times: to Hadley Richardson in 1921 (divorced 1927), Pauline Pfeiffer in 1927 (divorced 1940), Martha Gellhorn in 1940 (divorced 1945), and Mary Welsh in 1946. He had fathered three sons: John Hadley Nicanor (“Bumby”), with Hadley, born in 1923; Patrick, with Pauline, in 1928; and Gregory, also with Pauline, in 1931.\n\nHemingway left behind a substantial amount of manuscript, some of which has been published. A Moveable Feast, an entertaining memoir of his years in Paris (1921–26) before he was famous, was issued in 1964. Islands in the Stream, three closely related novellas growing directly out of his peacetime memories of the Caribbean island of Bimini, of Havana during World War II, and of searching for U-boats off Cuba, appeared in 1970.\n\nHemingway’s characters plainly embody his own values and view of life. The main characters of The Sun Also Rises, A Farewell to Arms, and For Whom the Bell Tolls are young men whose strength and self-confidence nevertheless coexist with a sensitivity that leaves them deeply scarred by their wartime experiences. War was for Hemingway a potent symbol of the world, which he viewed as complex, filled with moral ambiguities, and offering almost unavoidable pain, hurt, and destruction. To survive in such a world, and perhaps emerge victorious, one must conduct oneself with honour, courage, endurance, and dignity, a set of principles known as “the Hemingway code.” To behave well in the lonely, losing battle with life is to show “grace under pressure” and constitutes in itself a kind of victory, a theme clearly established in The Old Man and the Sea.\n\nHemingway’s prose style was probably the most widely imitated of any in the 20th century. He wished to strip his own use of language of inessentials, ridding it of all traces of verbosity, embellishment, and sentimentality. In striving to be as objective and honest as possible, Hemingway hit upon the device of describing a series of actions by using short, simple sentences from which all comment or emotional rhetoric has been eliminated. These sentences are composed largely of nouns and verbs, have few adjectives and adverbs, and rely on repetition and rhythm for much of their effect. The resulting terse, concentrated prose is concrete and unemotional yet is often resonant and capable of conveying great irony through understatement. Hemingway’s use of dialogue was similarly fresh, simple, and natural-sounding. The influence of this style was felt worldwide wherever novels were written, particularly from the 1930s through the ’50s.\n\nA consummately contradictory man, Hemingway achieved a fame surpassed by few, if any, American authors of the 20th century. The virile nature of his writing, which attempted to re-create the exact physical sensations he experienced in wartime, big-game hunting, and bullfighting, in fact masked an aesthetic sensibility of great delicacy. He was a celebrity long before he reached middle age, but his popularity continues to be validated by serious critical opinion."}, {"url": "https://theasc.com/the-15-founders-of-the-american-society-of-cinematographers", "page_content": "Founders of the American Society of Cinematographers\n\nWho were the 15 original members of the ASC when it was established in 1919?\n\nBy Robert S. Birchard\n\n\n\nThe American Society of Cinematographers succeeded two earlier organizations — the Cinema Camera Club, started by Edison camerapersons Philip E. Rosen, Frank Kugler and Lewis W. Physioc in New York in 1913; and the Static Club of America, a Los Angeles–based society first headed by Universal cameraperson Harry H. Harris.\n\nFrom the beginning, the two clubs had a loose affiliation, and eventually the West Coast organization changed its name to the Cinema Camera Club of California. But, even as the center of film production shifted from New York to Los Angeles — the western cinematographers’ organization was struggling to stay afloat.\n\nRosen came to Los Angeles in 1918. When he sought affiliation with the Cinema Camera Club of California, president Charles Rosher asked if he would help reorganize the faltering association. Rosen sought to create a national organization, with membership by invitation and with a strong educational component.\n\nThe reorganization committee met in the home of William C. Foster on Saturday, December 21, 1918 and drew up a new set of bylaws. The 10-member committee and five invited Cinema Camera Club member visitors were designated as the board of governors for the new organization.\n\nThe next evening, in the home of Fred LeRoy Granville, officers for the American Society of Cinematographers were elected — Philip E. Rosen, president; Charles Rosher, vice president; Homer A. Scott, second vice president; William C. Foster, treasurer; and Victor Milner, secretary.\n\nThe Society was chartered by the State of California on January 8, 1919.\n\nSo, who were the 15 founders of the ASC? Some are among the best-known cinematographers of all time, yet others are not well remembered at all.\n\nHere are their stories.\n\nDirector Phil Rosen (seated, wearing glasses) is surrounded by actors and associates on the set of Heart of a Siren (1925). Conway Tearle (seated, front left) and Barbara LaMarr (in white dress) starred. Henry Hull (between LaMarr and Rosen), Ann Pennington (seated, front right), Arnold Daly (standing, back left), and (continuing to the right) Harry Morey, Ben Finney and Veree Teasdale also took roles in the film. Rosen served as the ASC’s first president, but almost immediately abandoned the camera for the megaphone. The ASC’s Clubhouse since 1937 is the former home of Conway Tearle.\n\nPhilip E. Rosen\n\nBorn May 8, 1888, in Poland and raised in Machias, Maine, Rosen worked as a projectionist and lab technician before becoming an $18-a-week cinematographer in 1912. He became a co-founder of the Cinema Camera Club in New York City while working at the Thomas A. Edison Studio and later worked at Fox and shot several of Theda Bara’s pictures, including Kreutzer Sonata, The Clemenceau Case, The Two Orphans and Sin (all 1915).\n\nRosen came to California in 1918 to photograph George Loane Tucker’s The Miracle Man (Mayflower-Paramount, 1919), starring Lon Chaney. The success of the film brought Rosen an offer to direct from Universal, and over the next 30 years he helmed some 140 films.\n\nHe directed Rudolph Valentino in The Young Rajah (1922) and one of the most acclaimed films of the Silent Era, The Dramatic Life of Abraham Lincoln (1924), but more often than not he was a director of efficient low-budget quickies.\n\nRosen was the first — but not the last — ASC member to give up his backward cap for a director’s chair and became active in the formation of the Screen Directors Guild in 1936. He served on their board and as treasurer through 1941.\n\nAt the age of 63, he died of a heart attack on October 22, 1951.\n\nHomer A. Scott\n\nAlthough he was a leader in the earliest days of the ASC and served as president from 1925–’26 — Scott has proven to be one of the more elusive founders. He was born in Cambria Center, New York, on October 1, 1880.\n\nScott’s earliest known credits are as cinematographer for actor Carlyle Blackwell’s Favorite Players Film Company in 1914. When Blackwell signed with the Jesse L. Lasky Feature Play Company in 1915, Scott followed.\n\nScott in the 1920s, during his days as comedy king Mack Sennett’s lead feature cinematographer.\n\nBeginning in 1916, he worked under the direction of William Desmond Taylor with Lasky’s sister company, the Oliver Morosco Photoplay Company, in a variety of genres, culminating in several films starring Jack Pickford. Among them were Tom Sawyer (1917) and Huck and Tom (1918). In 1921, Scott photographed Molly-O, starring Mabel Normand, for Mack Sennett. Over the next two years he shot all of Sennett’s feature projects, including The Crossroads of New York (1922), The Shriek of Araby (1923) and The Extra Girl (1923).\n\nScott never shied away from dangerous assignments. He was scheduled for execution in a Mexican jail as a rebel spy while photographing their revolution in 1912, but was finally pardoned after four tense days of uncertainty. During the making of The Right Direction (1916) for Pallas Pictures, a cavalry charge at his camera position resulted in a wrecked camera and Scott being hospitalized with “several painful though not serious injuries.” Scott remained cranking his camera until impact. He was trapped for six hours in a diving bell 30' underwater after a steel suspension ring broke during the filming of the Maurice Tourneur production Deep Waters (1920) off the coast of Catalina Island. He and an assistant were both unconscious when they were finally rescued.\n\nScott’s name appeared on the ASC roster for years, but his name disappeared from the credits of feature films after 1923. In that year, he was loaned to Warner Bros. to shoot The Little Church Around the Corner and is said to have started shooting Warners’ The Marriage Circle for director Ernst Lubitsch before being replaced. He is known to have worked as a second cameraperson for comedian Harold Lloyd, but he mainly did underwater work and other specialized cinematography in his later career. In the 1930s he did the marine work on Bird of Paradise, Tiger Shark and Below the Sea, among others.\n\nScott retired from films in 1936 and moved to the Newcastle district of Placer County to take up ranching.\n\nHe died in Sacramento, California, on December 23, 1956.\n\nFrom left, director Frank Lloyd, actress Jewel Carmen and Foster discuss a scene, likely during the production of American Methods (1917).\n\nWilliam C. Foster\n\nA pioneer of cinematography, Foster was born in Bushnell, Illinois, on December 28, 1880, and went to work for the Chicago-based Selig Polyscope Company in 1901. At the time, Selig was turning out 50' and 100' actualities and trick films. Foster left Selig in May of 1911 to join Carl Laemmle’s Independent Moving Pictures Company. In 1915, he signed with the Equitable Motion Picture Corporation, working in New York and Florida.\n\nFoster was lead cinematographer on the first five two-reelers that Charlie Chaplin made for Mutual Film Corporation in 1916 — The Floorwalker, The Fireman, One A.M., The Count and The Vagabond. He later shot a number of pictures with director Frank Lloyd, including A Tale of Two Cities (Fox, 1917) and The Silver Horde (Goldwyn, 1920) and also worked with director Lois Weber on pictures including To Please One Woman (1920) and What’s Worth While (1921). For a time, he was also the superintendent of the laboratories at Universal.\n\nActive in the ASC leadership, Foster served the Society membership as treasurer and first vice-president, as well as on the Board of Governors\n\nHe died on January 18, 1923, from complications related to syphilis, politely described as the “general paralysis of the insane.\"\n\nClawson (left) was one of an army of eight cinematographers who shot the battle scene for The Patent Leather Kid (First National, 1927). The identity of the other cameraperson is unknown.\n\nLawrence D. Clawson\n\nClawson was a veteran of some 17 years behind a movie camera when he helped found the ASC in 1919. He was born on October 4, 1885, in Salt Lake City, Utah, and his first camerawork was in association with local theater manager Harry Revier, who started the Revier Film Manufacturing Company in Salt Lake City to produce pictures in 1910.\n\nClawson moved to Los Angeles in 1912, but his first known feature credits as a cinematographer are for director Lois Weber at Bosworth, Inc. and Universal in 1914–’15. He also worked for the American Film Company and Ince-Triangle-KayBee, where photographic superintendent and future director Irvin Willat would remember Clawson as “sort of like a news cameraman” who was not especially noted for his lighting style.\n\nBy the early 1920s, Clawson was chief cinematographer for the popular star Anita Stewart at Louis B. Mayer Productions, yet later in the decade he often worked as a second cameraperson. He was lead cinematographer on the early talkie Syncopation (1929), however his few remaining credits were for expedition films such as Hunting Tigers in India (1929) and low-budget productions including The Black King and The Horror (both 1932).\n\nClawson died in Englewood, New Jersey, on July 18, 1937.\n\nDirector Howard Hickman, also the husband of actress Bessie Barriscale, shows leading man Jack Holt (far right) how to embrace Mrs. Hickman during the production of Kitty Kelly, M.D. (1919), Capturing the scene is Gaudio — employing a Bell & Howell 2709.\n\nGaudio, from a portrait reproduced in the February 1, 1922 issue of AC.\n\nEugene Gaudio\n\nThe younger brother of future ASC member Tony Gaudio, he was born in Italy on December 26, 1886. He learned photography in his father’s portrait studio and developed an interest in movies around 1905. After coming to the United States, landing in New York City, he served as lab superintendent for IMP and Life Photo Film Corporation.\n\nArriving in California in 1915, Gaudio came out of the darkroom and went behind the camera for Universal Film Manufacturing Company — now Universal Pictures. The best known of his efforts as a cinematographer there was on the 1916 silent production of 20,000 Leagues Under the Sea.\n\nHe later photographed films for Metro’s top female stars, Alla Nazimova and May Allison. His final work was with actress Bessie Barriscale’s B. B. Features.\n\nGaudio suffered an acute attack of appendicitis and tragically died on August 1, 1920, from general peritonitis after an operation.\n\nWalter L. Griffin\n\nWalter L. Griffin\n\nBorn in Fort Worth, Texas, on July 19, 1889, Griffin was a projectionist in a Los Angeles theater in 1910 and spent a year and a half in the lab before he first cranked a camera for Universal in 1914.\n\nIn 1915, he joined the Exposition Players' Corporation as the official cinematographers of the Panama-Pacific International Exposition in San Francisco, where he headed photographic and lab operations. When the exposition closed in 1916, he spent four months in Colorado making scenic films for Denver Tourist Bureau.\n\nReturning to Hollywood, Griffin signed on with the National Film Corporation where he shot some 25 comedies featuring National’s owner, William “Smiling Bill” Parsons. His best remembered film is Nomads of the North (1920) starring Lon Chaney, which was filmed for the National Film Corporation but released through the Associated First National Exhibitors Circuit after the untimely death of William Parsons caused the studio to close.\n\nThrough the early 1920s, Griffin ground out low-budget Westerns starring Bob Custer, Franklyn Farnum and Al Hoxie. In the mid-1920s, he gave up the wide-open spaces for the great indoors and shot a number of modest melodramas, including Rose of the Bowery (1927) and The Heart of Broadway (1928). His last known credit as a cinematographer was on City of Purple Dreams (1928).\n\nIn 1928, he retired from films and opened a florist shop and nursery on Lankershim Blvd., just north of Hollywood. He died in Ventura, California, on March 25, 1954.\n\nRoy H. Klaffki. Another portrait from the February 1, 1922 issue of AC.\n\nRoy H. Klaffki\n\nBorn in California on March 6, 1882, Klaffki was a cinematographer for a dozen years or more, working in England as well as Hollywood, but, in 1922, American Cinematographer reported that “he prefers just now to be identified with the laboratory rather than the camera.\n\nHe had the title director of photography at Metro Pictures in the early 1920s — shooting films as well as supervising the work of other staff cinematographers and overseeing quality control in the lab. His pictures there included The Infamous Miss Revell (1921).\n\n\n\nKlaffki took a similar position at Goldwyn in 1923 and later went on to shoot such pictures as Three Wise Crooks (1925), Queen O’Diamonds (1926), The Adorable Deceiver (1926; directed by ASC co-founder Phil Rosen) and The Impostor (1926).\n\nHis last feature credit was as associate cinematographer on the opulent and indulgent drama The Wedding March (1928), principally photographed by Hal Mohr, ASC. Directed by and starring Erich von Stroheim, it features Fay Wray and Zasu Pitts, and portions were photographed in two-strip Technicolor by Ray Rennahan, ASC. The shoot lasted eight months before Paramount pulled the plug; von Stroheim’s initial cut ran nine hours and a studio-edited version was not a success.\n\nKlaffki would finish his career as a technician with the Technicolor Motion Picture Corporation.\n\nHe died on September 20, 1965, of malnutrition resulting from esophageal-tracheal abscesses with complications from pulmonary emphysema.\n\nCharles E. Rosher\n\nCharles E. Rosher\n\nBorn on November 17, 1885, in London, England, Rosher hoped for a diplomatic career, but his interest in photography led him to apprenticeships with still photographers David Blount and Howard Farmer. In 1908, he became assistant to Richard Speaight, official photographer for the British Crown. Rosher was invited to show his still work at the Eastman School of Photography, and when he came to the States to accompany the exhibit, he brought a Williamson movie camera and started shooting actualities. He was friendly with fellow Englishman David Horsley, who started the Centaur Film Company in the backyard of his Ideal Billiard Parlor in Bayonne, New Jersey, in 1907.\n\nIn 1910, Horsley offered Rosher a job, and the cinematographer came west with the renamed Nestor Film Company, arriving in Hollywood on October 27, 1911. When Nestor was absorbed by Universal in 1912, Rosher went along. He left in 1913 to shoot footage of Pancho Villa in Mexico and then returned to Universal briefly before joining the staff of the Lasky Feature Play Company.\n\n\n\nAt the Pickford-Fairbanks Studio during production of Rosita (Pickford-United Artists, 1923) are (from left) James Townsend, assistant director; Paul Perry (kneeling), camera assistant; Ted Reed, production manager; Irvin K. Martin, set designer; Rosher; Ernst Lubitsch, director; Mary Pickford, star, studio head and producer; Erich Locke, continuity; Edward Knoblock, screenwriter; and Mitchell Leisen, costumer.\n\nRosher became Mary Pickford’s cinematographer and photographed all her films from How Could You, Jean? (1918) through My Best Girl (1927). Pickford occasionally loaned Rosher out to other producers. One of these loan-outs was for Sunrise: A Song of Two Humans (Fox, 1927), which earned Rosher and co-cinematographer Karl Struss, ASC the first Academy Award for Best Cinematography.\n\n\n\nRosher fell out with Pickford when he was unwilling to shoot Coquette (1929) with cameras locked down in soundproof “iceboxes.” He had no trouble finding work at other studios, however, and earned six additional Academy Award nominations throughout the years. With his work on Kismet (1944), Rosher gained a reputation for his color work, and he received the Oscar for Best Color Cinematography on The Yearling (1946).\n\n\n\nRosher retired in 1955 and died in Lisbon, Portugal, on January 15, 1974.\n\n\n\nFrom left are producer-director Cecil B. DeMille and Milner between takes on the elaborate barge set for Cleopatra (Paramount, 1934). Milner won the Academy Award for Best Cinematography for this film.\n\nVictor Milner\n\nBorn in Chavli, Russia, on December 15, 1891, Milner and his family arrived in New York City when he was 13. He first became interested in the movies at that age while attending dingy nickelodeons, watching the projector operators who were not yet hidden from view in fireproof booths. “The operator would let me take control of the projector whenever his girlfriend came to visit him,” Milner remembered.\n\n\n\nHe found a job with Eberhard Schneider, who manufactured motion picture cameras and other film equipment. His first experience cranking a movie camera came when he shot footage of a storm at Rockaway Beach. In 1913, at the age of 22, Milner shot his first feature film, Hiawatha: The Indian Passion Play, but he soon returned to shooting actualities, becoming one of the first four camerapersons hired by the Pathé News.\n\n\n\nMilner shooting the 1934 version of Cleopatra.\n\nIn 1916, Milner came to California on his honeymoon and heard that the Balboa Amusement Producing Company in Long Beach was looking for a cinematographer. He got the job and gave up newsreels for dramatic films. He later gained attention as second cameraperson on 17 films for Western star William S. Hart. Milner also worked at Metro and Universal, sometimes in the first camera position and sometimes in the second — as with Scaramouche (1923), which he co-photographed with future ASC member John Seitz.\n\n\n\nMilner landed at Paramount in 1925 and spent the rest of his career at that studio, earning nine Academy Award nominations. He took home the Oscar for Cleopatra (1934). After shooting Jeopardy (1953), he retired.\n\n\n\nHe died on October 29, 1972.\n\n\n\nThis shot was taken during production of The Apostle of Vengeance (Ince-Triangle-KayBee, 1916). August stands beside the Bell & Howell camera. Front row, from left, are Dick Rush, star-director William S. Hart and assistant director Cliff Smith. Directly behind Hart is prop specialist “Doc” Cherry. The name of the fellow in the checkered cap is unknown.\n\nJoseph H. August\n\nKnown for his outdoor cinematography, Joe August was born on April 26, 1890, in Idaho Springs, Colorado, and grew up in ranch country. He gave up wrangling to began his film career as a cowboy at the Inceville motion-picture ranch in 1911, later becoming an assistant to cinematographer Ray Smallwood, a stern mentor who taught Joe to rely on his eyes. “There was a device… known as the ‘illumination system’… designed to obtain for the cameraman something parallel to what a meter would provide today,” August recalled in 1939. “I was told with considerable detail and even more emphasis just what fate would befall me if he ever found me fussing with one of those gadgets.”\n\n\n\nAugust shot his first film, The Lure of the Violin, in 1912 and became chief cinematographer for Western star William S. Hart in 1915. He would shoot more than 40 of Hart's films, including Hell’s Hinges (1916), The Toll Gate (1920) and Hart’s swan song, Tumbleweeds (1925). August bragged that he never used a foreground reflector when working with Hart — though he sometimes utilized a white bed sheet to provide fill.\n\n\n\nThe first documented appearance of the ASC credential in a film’s titles was Sand(1920), produced by and starring Hart, written and directed by Lambert Hillyer and shot by August.\n\n\n\nAfter Hart’s first retirement in 1921, August went to work for the Fox Film Corporation, where he did his first work with director John Ford on Lightnin’ (1925). August’s association with Ford would lead to shooting The Informer (1935).\n\n\n\nShooting The Informer (1935) are director John Ford (left of camera) and August (right of camera) and crew.\n\nAlthough acclaimed for his outdoor work, August was also known for his low-key lighting — a technique developed through necessity as lamps were a luxury and not terribly efficient in his early days behind the camera. With pictures including A Damsel in Distress (1937), The Hunchback of Notre Dame (1939) and The Devil and Daniel Webster (1941) at RKO to his credit, August remained one of Hollywood’s top cinematographers, but he continued to rely on the principles he learned in the Silent Era. “Many things have changed during the rise and development of the picturemaking industry,” said August shortly after completing Gunga Din (1939), “but the basis of lighting seems to be about the same as it was in the beginning.” He earned an Academy Award nomination for this picture.\n\n\n\nDuring World War II, August served with Ford’s OSS film unit, which was attached two the U.S. Navy in the Pacific Theater. He was wounded while shooting the Oscar-winning documentary short The Battle of Midway (1942).\n\n\n\nAugust’s final assignment was the lush romantic fantasy Portrait of Jennie (1948), directed by William Dieterle, for which he earned his second Academy Award nomination. The film was nearing completion at the Selznick International Studio in Culver City when the cinematographer collapsed and died of a heart attack on September 25, 1947.\n\n\n\nArthur Edeson\n\nThis cinematographer’s credits include some of the best remembered films of all time: The Maltese Falcon (1941), Casablanca (1943), Frankenstein (1931), The Invisible Man (1933) and Mutiny on the Bounty (1935).\n\n\n\nBorn in New York City on October 24, 1891, Edeson was barely making a living as a portrait photographer in 1910 when he decided to try his hand at the movies. “I went to the old Eclair Studio in Fort Lee, New Jersey, and applied for a job. While I was waiting in the outer office, a man came in and stabbed his finger around the crowded room, saying: ‘I’ll take you — and you, and you. Come with me.’ I couldn’t tell whether or not I was one of those selected, but I joined the group anyway. Once inside the mysterious recesses of the studio, I found I’d been hired — as an actor.”\n\n\n\nA Warner Bros. press release noted that Edeson never got over the habit of operating his own camera as he did in the Silent Era, and he would often step in and act as his own operator even though camera union rules frowned on the practice.\n\nEdeson never lost his interest in photography and began to shoot portraits of his fellow actors. His photos caught the attention of cinematographer John Van den Broeck, and when a cameraperson was taken ill, Van den Broeck suggested that Edeson fill in. “In those times, flat lighting was the rule of the day,” Edeson wrote. “However, I began to introduce some of the lighting ideas I had learned in my portrait work — a suggestion of modeling here, an artistically placed shadow there — and soon my efforts tended to show a softer, portrait-like quality on the motion picture screen. This was so completely out of line with what was considered ‘good cinematography’ in those days that I had to use my best salesmanship to convince everyone it was good camerawork.”\n\n\n\nWhen American Eclair was reorganized as the World Film Corporation, Edeson stayed on to become chief cinematographer for the star Clara Kimball Young, and when she left for California in 1917, Edeson followed. In 1920, Douglas Fairbanks saw For the Soul of Rafael, one of Edeson’s films for Young, and signed the cinematographer for three of his biggest pictures — The Three Musketeers (1921), Douglas Fairbanks in Robin Hood (1922) and The Thief of Bagdad (1924). Of Fairbanks, Edeson would say, “To anyone who worked with him, moviemaking today seems prosaic and cramped by comparison.”\n\n\n\nEdeson frames up on Humphrey Bogart and Ingrid Bergman during the production of Casablanca (1943).\n\nAmong Edeson credits in the 1920s were Stella Dallas, The Lost World (both 1925) and the atmospheric old-dark-house thriller The Bat (1926). At Fox, Edeson shot the first all-outdoor, 100-percent talkie, In Old Arizona (1929), and the first Fox Grandeur 70mm film, The Big Trail (1930). He later worked at Universal and MGM, and eventually settled in at Warner Bros., where he would remain until his 1949 retirement.\n\n\n\nHe died on February 14, 1970, in Agoura Hills, California.\n\n\n\nSid Jordan takes aim to shoot the knot off Tom Mix’s four-in-hand using live ammunition for a scene in The Coming of the Law (Fox, 1919). From left are camera assistant Dan Clark (just visible at edge of photo), Granville at the Bell & Howell 2709 camera, director Arthur Rosson (with outstretched hand), Sol Wurtzel, a Fox studio executive (wearing glasses, standing behind Rosson) and assistant director Richard Rosson (kneeling).\n\nFred LeRoy Granville\n\nBorn Warnambool, Victoria, Australia, in 1896, Granville was educated in New Zealand. The February 1, 1922, issue of American Cinematographer stated that he was “a bloody Britisher by birth,” and “first saw the light at Worton Hall, Isleworth, Middlesex, England.”\n\n\n\nFred LeRoy Granville\n\nGranville became interested in photography as a boy. His first experience with cinematography came in 1913 under the guidance of James Crosby at the Selig Polyscope studio in Edendale, near downtown Los Angeles. Granville photographed the documentary Rescue of the Stefansson Expedition (1914) and a number of features and serials for Universal, including Liberty — A Daughter of the U.S.A. (1916) and The Heart of Humanity (1918). He also shot several of cowboy actor Tom Mix’s early Fox features.\n\n\n\nIn 1920, Granville went to England, where he worked as a cinematographer and director into the mid 1920s.\n\n\n\nGranville died in London on November 14, 1932, from complications related to Bright's disease.\n\n\n\nOf note, camera assistant Clark (seen in the photo above) would later become Mix’s lead cinematographer and close friend, and an ASC member.\n\n\n\nBarely visible cranking his Bell & Howell 2709 camera is J. Devereaux Jennings. This scene for College (Keaton-United Artists, 1927) was filmed at the corner of Seward Street and Waring Avenue in Hollywood. Buster Keaton finds himself standing in the rain, but in sunny California the cloudburst is supplied by overhead pipes supported by makeshift stilts, supplemented by a fire hose.\n\n“Dev” Jennings in 1914.\n\nJoseph Devereaux Jennings\n\nOne of the founders of the ASC, Jennings remained active in the motion-picture industry until his death.\n\n\n\nHe was born in Salt Lake City, Utah, on September 22, 1884, and graduated from the University of Utah. His film career began around 1913, after his family moved to Los Angeles, and his earliest confirmed credits are with Thomas H. Ince’s unit of the New York Motion Picture Corporation.\n\n\n\nJennings was an early member of the Static Club, and by contemporary accounts, was a gregarious guy. In its February 20, 1915, issue, the society’s magazine, Static Flashes, called him “the entertaining cameraman… Mr. Jennings is one of the active and popular cinematographers who believes in the future of the cameraman, and he is ever alert and responsive to the wishes of his director, aiding in the best of his ability in securing proper photographic results, and always appearing with a cheerful smile.”\n\n\n\nHis 1918 draft registration card reveals what could be a serious problem for a cameraman. Jennings was partially blind in his right eye, probably caused by an accident that occurred when he was seven years old and had been playing with gunpowder and matches. In the explosion, he was badly burned and it was feared that he might lose one of his eyes. But this physical disability doesn’t seem to have hindered either his career or reputation as an outstanding cameraman.\n\n\n\nJennings later worked for Fox, photographing Fame and Fortune (1918) and The Daredevil (1920) and other early Tom Mix features.\n\n\n\nIn the mid-1920s he shot several of Buster Keaton’s best-known comedies, including Battling Butler, The General, College and Steamboat Bill, Jr.\n\n\n\nJennings in the 1950s.\n\nFollowing the untimely death of his wife Adele in 1928, Jennings became a director of photography under contract at Warner Brothers. While there, he shot 14 films, including Vamping Venus and The Public Enemy, as well as the early two-color Technicolor extravaganzas Bride of the Regiment and Golden Dawn. But as the 1930s wore on, he began to concentrate on special effects work — which he had dabbled in since The Lost World (1925) — finally settling in at Paramount, where his brother H. Gordon Jennings, ASC was the head of the effects department.\n\n\n\nThey shared an Honorary Award from The Academy for their outstanding work in Spawn of the North (1938), and later an Academy Award nomination for their work in Unconquered (1947).\n\n\n\n\n\nJ.D. Jennings, also known to be a fine golfer, died of cancer in his brother's home on March 12, 1952.\n\n\n\nFrom left, director Wallace Worsley, Newhard and an unidentified second cameraperson prepare to shoot a scene for Universal’s The Hunchback of Notre Dame (1923), starring Lon Chaney.\n\nRobert S. Newhard\n\nAs early as 1922, Newhard was noted as being “one of the greatest aerial cinematographers in the world,” and it’s not surprising that he eventually found his niche in the industry as a specialized cameraperson in this arena.\n\n\n\nHe was born in Allentown, Pennsylvania, on April 28, 1884, and began his film career working with Fred Balshofer’s Bison Life Motion Pictures unit of the New York Motion Picture Company in 1910. He stayed with the N.Y.M.P.Co. when Thomas Ince took over production reins and was behind the camera on several early William S. Hart Westerns, including The Bargain (1914) and On the Night Stage (1915).\n\n\n\nAfter a five-year stint with Ince, Newhard worked three years at Paralta Plays, Inc. and followed this engagement with tenures at Fox and Goldwyn.\n\n\n\nHis last major credit was on Universal’s The Hunchback of Notre Dame (1923), although star Lon Chaney insisted that Virgil Miller, ASC photograph all of his closeups on that film. Newhard would receive first cinematographer credit on a handful of other films, ending with his only talkie, Party Girl (1930).\n\n\n\nBy 1933, the ASC membership roster carried Newhard’s name under the category of Second Cinematographers.\n\n\n\nHe died in Los Angeles on May 20, 1945, from the effects of bladder cancer.\n\n\n\nOn the big glass stage at the American Film Company studio in Santa Barbara making Immediate Lee (American-Mutual, 1916), Wilky peers through the range finder of his Bell & Howell camera as actor-director Frank Borzage (with hand on tripod) and assistant director Park Frame (with arms crossed) watch a rehearsal.\n\nL. Guy Wilky\n\nHis stalwart stand for collective bargaining brought a sudden end to Wilky’s career as a director of photography. He was born in Phoenix, Arizona, on October 12, 1888, and developed an interest in photography at the age of 10. After his junior year at the University of Arizona, Wilky took a job with the Philadelphia-based Lubin Mfg. Company’s southwest unit in Tucson during the summer of 1912. “I went back to the University to get my B. S. in mining engineering,” Wilky recalled, “and after graduating I joined Lubin again in Silver City, New Mexico. The director, Romaine Fielding, was having trouble with his cameraman and told me to learn as soon as possible so I could take over the job. We soon moved to Las Vegas, New Mexico, and it was there that I made my first picture, The Rattle Snake, in August 1913.”\n\n\n\nWilky left Lubin in October of 1915 and went to California, where he worked briefly for Universal and then took a job with the American Film Company in Santa Barbara, where he worked with fledgling director Frank Borzage. “I was with American about a year. Then eight companies were canceled one week because of [World War I]… and the Borzage company was one of them. I didn’t get work again until January 1917 when I went to work for the Thomas Ince Company. I changed from one studio to another and finally got to Paramount, where I spent the best years of my career working with William C. and Cecil B. DeMille.”\n\n\n\nWilky was a member of the original Static Club, but dissatisfied with that organization: “It was just a social club without much interest in education. So a few of us… met at the home of one of the fellows and talked over the idea of a new and better club… that was the start of the ASC.”\n\n\n\nWilky was active in attempting to organize the International Photographers Union in the late 1920s, and his efforts led the major studios to blacklist him. After seven years at Paramount, his last credits as principal cinematographer were on a pair of low-budget pictures for Tiffany-Stahl in 1928.\n\n\n\nHe traveled to the south seas as second cameraperson on the classic Tabu, and later shot a film in Sri Lanka. But in Hollywood, he was relegated to working second camera on six-day “oaters,” and forced to give up his ASC membership because he could no longer afford the dues. He finally returned to the studios — and the ASC — as a second-unit cinematographer and assistant, finishing his career at Columbia in the 1950s.\n\n\n\nWhen he received a 50-year membership pin at the ASC’s anniversary dinner in 1969, Wilky considered the token “one of my prized treasures.”\n\n\n\nHe died of a heart attack in Walnut Creek, California, on December 25, 1971.\n\n\n\nSpecial thanks to David Kiehn, historian for the Niles Essanay Silent Film Museum, who contributed to this document. We also credit Lisle Foote for her exceptional research on Dev Jennings, which was done for her book Buster Keaton's Crew: The Team Behind His Silent Films (2014).\n\n\n\nYou’ll learn much more about the history of the ASC here."}]}