{"David King was born on 28 April 1971.": [{"url": "https://www.onthisday.com/date/1971/april/28", "page_content": "About April 28, 1971\n\nDay of the Week: Wednesday\n\nHow Long Ago? 52 years, 1 month and 11 days\n\nLeap Year: No"}, {"url": "https://www.birthdayanswers.com/date/april-28-1971/", "page_content": "It was the 4th Wednesday of 1971. If you were born on this date your birthday numbers 4, 28 and 1971 reveal that your life path number is 5. Your zodiac sign is Taurus with a ruling planet Venus, your birthstone is the Diamond, and your birth flower is the Sweet Pea/Daisy. You are 52 old, and were born in 1970s, in the middle of Generation X. The generation you are born into makes an impact on your life. Swipe up to find out what it all means.\n\n→ April 28, 1971 was a Wednesday\n\n→ Zodiac sign for this date is Taurus\n\n→ This date was 19,035 days ago\n\n→ 1971 was the Year of the Pig\n\n→ In 2024, April 28 is on Monday\n\nView fun April 28, 1971 birthday facts that no one tells you about, such as your life path number, birthstone, ruling planet, zodiac sign and birth flower.\n\nYou have been alive for:\n\n\n\nPeople born on this day will turn 53 in exactly .\n\nIf you were born on this date:\n\nYou have been alive for . You were born in the Year of the Pig. Your birth sign is Taurus with a ruling planet Venus. There were precisely 645 full moons after you were born up to this day. Your billionth second was on was on January 4, 2003.\n\n→ You’ve slept 6,345 days or 17.38 years.\n\n→ Your next birthday is away\n\n→ You’ve been alive\n\n→ You were born in the Year of the Pig\n\n→ You have been alive 456,849 hours\n\n→ You are 27,410,992 minutes old\n\n→ Age on next birthday: 53 years old\n\nYou were born on a Wednesday\n\nApril 28, 1971 was the 4th Wednesday of that year. It was also the 118th day and 4th month of 1971 in the Georgian calendar. The next time you can reuse 1971 calendar will be in 2027. Both calendars will be exactly the same.\n\nThere are left before your next birthday. Your 53rd birthday will be on a Friday and a birthday after that will be on a Monday. The timer below is a countdown clock to your next birthday. It’s always accurate and is automatically updated.\n\nYour next birthday is in:\n\n\n\nFriday\n\nYou’ve slept 33% of your life!\n\nYour next birthday is on a\n\nAssuming you’ve been sleeping 8 hours daily since birth. Here is how much time you’ve spent sleeping so far:\n\nYou’ve slept 17.38 years of your life.\n\nYou’ve slept 208 month of your life.\n\nYou’ve slept 906 week of your life.\n\nYou’ve slept 6,345 days of your life.\n\nDid you know you have taken approximately 383,745,600 breaths since your birth? Moreover, using 80 beats per minute as average, your heart has beaten over 2,192,832,000 times. You have also blinked over 465,976,800 times in your lifetime.\n\n#1 Song on your birthday\n\nThe number one song in the US on the day of your birth was \"Joy to the World\" by Three Dog Night. (Billboard Hot 100 – April 28, 1971) . Ask your parents if they remember this popular song.\n\nDo you remember the number one song on your 14th birthday? It was \"We Are the World\" by USA for Africa (April 28, 1985) .\n\nCelebrities born on April 28, 1971\n\nYou share a birthday with You share a birthday with Hamish Carter (triathlete).\n\nWe have over 150,000 celebrities in our database. We will continue to update this list with matching birthdays, so bookmark this page and check back often. You can also find out all celebrity birthdays born on April 28, 1971.\n\nWhat happened on April 28th\n\nBelow are some of the most important historical events that happened on 28 April 1971.\n\nSports in 1971\n\nEstablishment of the Pontifical and Royal University of Santo Tomas, The Catholic University of the Philippines, oldest existing university in Asia and largest Catholic university in the world.British Captain James Cook, aboard the endeavour, lands at Botany Bay in Australia.Fletcher Christian leads a mutiny on HMS Bounty against its captain William Bligh in the South Pacific.First night air flight by Claude Grahame-White in England.1st commercial flight across Pacific operated by Pan Am.\n\nNBA – Milwaukee Bucks beat Baltimore Bullets (4 - 0) to win the NBA Finals.\n\nNHL – Montreal Canadiens defeated Chicago Blackhawks (4 - 3) to win the Stanley Cup.\n\nNFL – Baltimore Colts beat Dallas Cowboys (16 - 13) to win Super Bowl V on January 17, 1971 in Miami, FL.\n\nMLB – Pittsburgh Pirates beat Baltimore Orioles (4 - 3) to win the World Series.\n\nYour life path number is 5\n\nSo what does your birthday really say about you and what does your life path number mean? On the next page, we’ll explain what your birth sign, ruling planet, age generation, birthstone, and birth flower mean — and more!\n\nContinue to the next page to discover the answers to the most important questions about your birthday."}, {"url": "https://www.nytimes.com/2016/05/19/arts/design/david-king-collector-of-soviet-political-art-dies-at-73.html", "page_content": "David King, a graphic designer and design historian who amassed one of the world’s largest collections of Soviet political art and photographs, which he drew on for revelatory books on Leon Trotsky and the Stalin era, died on May 11 at his home in London. He was 73.\n\nThe cause was a heart attack, said his partner, Valerie Wade.\n\nMr. King was the art editor of The Sunday Times of London magazine in 1970 when he traveled to the Soviet Union to gather material for an article on the centenary of Lenin’s birth. A leftist with Trotskyist leanings and a fervent admirer of 1920s Soviet poster art, he became obsessed with ferreting out images of his hero, as well as photographs, posters, propaganda art and other ephemera from the Soviet period.\n\nMr. King pursued his Trotsky obsession over the years to the point of acquiring a ceramic mug decorated with Trotsky’s face.\n\n“I traveled to Mexico, New York and all over Europe to find the few people who had known Trotsky and were still alive,” he told the British newspaper Socialist Worker in 2005. “I came back with thousands of photographs of Trotsky. The oldest was taken when he was 9, and the last was taken as he was being cremated.”"}, {"url": "https://happyhappybirthday.net/en/age/david-king-person_yxfguaa", "page_content": "David King\n\nBritish pair skater – David King was born in Carlisle (cathedral city in Cumbria, England) on May 8th, 1984 and is 39 years old today.\n\nAge How old is David King? 39 David King is 39 years old.\n\nBiographical data\n\nDavid King\n\nBirthday When was David King born? David King was born on May 8th, 1984.\n\nPlace of Birth Where was David King born? Carlisle (cathedral city in Cumbria, England).\n\n♉ ♉ Zodiac What is the zodiac sign of David King? David King was born in the zodiac sign Taurus (The Bull)."}, {"url": "https://www.celebsagewiki.com/david-king", "page_content": "Age, Biography and Wiki\n\nDavid King was born on 23 August, 1930 in Rochester, Kent, England, UK, is an Actor, Writer, Script Department. Discover David King's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of David King networth?\n\nPopular As N/A Occupation actor,writer,script_department Age 68 years old Zodiac Sign Leo Born 23 August 1930 Birthday 23 August Birthplace Rochester, Kent, England, UK Date of death 4 March, 1998 Died Place London, England, UK Nationality UK\n\nWe recommend you to check the complete list of Famous People born on 23 August. He is a member of famous Actor with the age 68 years old group.\n\nDavid King Height, Weight & Measurements\n\nAt 68 years old, David King height is 6' 1\" (1.85 m) .\n\nPhysical Status Height 6' 1\" (1.85 m) Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nDavid King Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is David King worth at the age of 68 years old? David King’s income source is mostly from being a successful Actor. He is from UK. We have estimated David King's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nDavid King Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.ancientfaces.com/person/david-king-birth-1899-death-1971/28987534", "page_content": "Refresh this page to see various historical events that occurred during David's lifetime.\n\nIn 1899, in the year that David King was born, on February 14th, the first voting machines were approved by Congress for use in federal elections. Several states were already using voting machines in their elections and the Federal government was finally convinced of their safety and accuracy.\n\nIn 1914, at the age of only 15 years old, David was alive when in August, the Panama Canal opened to traffic. Begun by the French in the 1880's and abandoned, the United States undertook further construction in 1904. After 10 years, and the elimination of malaria carrying mosquitoes (which caused immense delays for the French and the Americans), the 48 mile long artificial waterway - a series of locks - created a shortcut for ships traveling between the Atlantic and Pacific Oceans.\n\nIn 1940, at the age of 41 years old, David was alive when on November 5th, President Franklin Roosevelt was elected to a third term, defeating Wendell Willkie of Indiana (a corporate lawyer). Roosevelt running for a third term was controversial. But the U.S. was emerging from the Great Recession and he promised that he would not involve the country in any foreign war (which of course changed when Japan bombed Pearl Harbor). Roosevelt defeated Willkie in the popular vote by 54.7 to 44.8% and in the Electoral College 449 to 82.\n\nIn 1962, David was 63 years old when on February 20th, Lt. Col. John H. Glenn, Jr. became the first American to orbit the Earth. The Friendship 7 flew three times around the earth in 4 hours and 55 minutes. At age 77, Glenn returned to space - the oldest person to fly in space.\n\nIn 1971, in the year of David King's passing, in March, Congress passed the Twenty-sixth Amendment to the United States Constitution, which lowered the voting age to 18 (from 21). It was a response to the criticism that men could fight at 18, but not vote for the policies and politicians who sent them to war. The states quickly ratified the Amendment and it was signed into law on July 1st by President Richard Nixon."}, {"url": "https://www.ancientfaces.com/person/david-king-birth-1940-death-1968/27734641", "page_content": "We All Deserve to be Remembered: AncientFaces - 20 years in 2020\n\nHow in the world is it that when our loved ones die we have only their social media accounts to remember them by? Why is it all that’s left online is a memorial page consisting of a tombstone and an obituary, and if you’re fortunate enough to have a writer in the family, MAYBE there is an obituary consisting of three paragraphs about who the person was? People are important in life and in death. How our loved ones and ancestors lived their lives, what they did with their time, and who they impacted - is important.\n\nWe all Deserve to be Remembered, and it is up to us, the people that knew them, to show & tell their stories before our memories get lost in history. AncientFaces is Where We Remember Over the last 20 years we've seen tens of millions of people show that they agree that Everyone Deserves to be Remembered (EDtbR). It is up to each and every one of us to share our memories & family stories of those people important to us. Through storytelling & sharing who these people really were, we unlock meaningful connections with people today, and the potential of new discoveries tomorrow. In 2020, to celebrate our 20 year milestone & to share this mission with the world we've released our first video. If you live in our neighborhood in Silicon Valley you might have noticed the spot on your favorite television channels ;) Thank you - each and every one of you - for your role in making AncientFaces a family-friendly community and the place to remember & celebrate the lives of people who matter to us."}, {"url": "https://www.britannica.com/biography/David", "page_content": "spouse Abigail spouse Bathsheba father Jesse son Absalom ...(Show more)\n\nTop Questions Where did David grow up? According to the Bible, David grew up in the rugged Judean hills around the Israelite town of Bethlehem, a few miles south of what was then the Canaanite stronghold of Jerusalem. At the time, Israel was threatened by other peoples in the region, especially the Philistines, who occupied the Mediterranean coastal plain to the west. What was David’s early life like? David was the youngest of eight sons of Jesse, a farmer and sheep breeder of the Israelite tribe of Judah. David likely spent much of his boyhood tending his family’s flock. One day he was summoned from the fields by the prophet Samuel, who anointed him king of Israel while Saul was still king. What did David do for a living? As a youth, David distinguished himself as a musician and warrior. This gained him the attention of King Saul, for whom he played the harp and fought the Philistines. David’s popularity aroused the king’s jealousy. After Saul tried to kill him, David fled and became a leader of outlaws. When Saul died, David became king. What did David achieve? As Israel’s second king, David built a small empire. He conquered Jerusalem, which he made Israel’s political and religious centre. He defeated the Philistines so thoroughly that they never seriously threatened the Israelites’ security again, and he annexed the coastal region. He went on to become the overlord of many small kingdoms bordering Israel.\n\nDavid, (flourished c. 1000 bce), second ruler of the united kingdom of ancient Israel and Judah. He founded the Judaean dynasty and united all the tribes of Israel under a single monarch. His son Solomon expanded the empire that David built. David is an important figure in Judaism, Christianity, and Islam.\n\nEarly life David slaying Goliath According to 1 Samuel, David was the youngest son of Jesse, a man of Bethlehem, and served as a shepherd for his father before beginning his career as an aide at the court of Saul, Israel’s first king. When Israel came into conflict with the Philistines, a people from a neighbouring region, David’s brothers went to fight for King Saul. Young David would travel back and forth to the camp to bring his brothers food and supplies. According to 1 Samuel 17, Goliath, a heavily armed Philistine giant, challenged Saul for 40 days to send out a man to fight him. No one would face this warrior until David, armed only with a sling and stones, volunteered. David hit the giant in the forehead with a stone and killed him. He continued to distinguish himself as a warrior in the ongoing battles against the Philistines, and his resultant popularity aroused Saul’s jealousy. Fearing that the people would make David king, Saul plotted to kill him. With the help of his loyal friend Jonathan, Saul’s eldest son, David fled into southern Judah and Philistia, on the coastal plain of Palestine, where, with great sagacity and foresight, he began to lay the foundations of his career. As an outlaw with a price on his head, David led the life of a Robin Hood on the desert frontier of his tribal domain in Judah (in the south of the Levant). He became the leader and organizer of a group of other outlaws and refugees, who progressively ingratiated themselves with the local population by protecting them from other bandits or, in case they had been raided, by pursuing the raiders and restoring the possessions that had been taken. Although the boy David was anointed by the prophet Samuel as the future king of Israel (1 Samuel 16), his actions in exile helped ensure that he would be “invited” to become king as the true successor of Saul after Saul and Jonathan were slain in battle against the Philistines on Mount Gilboa."}, {"url": "https://www.britannica.com/biography/David-I", "page_content": "father Malcolm III Canmore mother Saint Margaret of Scotland brother Alexander I brother Edgar ...(Show more)\n\nDavid I, (born c. 1082—died May 24, 1153, Carlisle, Cumberland, Eng.), one of the most powerful Scottish kings (reigned from 1124). He admitted into Scotland an Anglo-French (Norman) aristocracy that played a major part in the later history of the kingdom. He also reorganized Scottish Christianity to conform with continental European and English usages and founded many religious communities, mostly for Cistercian monks and Augustinian canons.\n\nThe youngest of the six sons of the Scottish king Malcolm III Canmore and Queen Margaret (afterward St. Margaret), David spent much of his early life at the court of his brother-in-law King Henry I of England. Through David’s marriage (1113) to a daughter of Waltheof, earl of Northumbria, he acquired the English earldom of Huntingdon and obtained much land in that county and in Northamptonshire. With Anglo-Norman help, David secured from his brother Alexander I, king of Scots from 1107, the right to rule Cumbria, Strathclyde, and part of Lothian. In April 1124, on the death of Alexander, David became king of Scots.\n\nBritannica Quiz Medieval History Quiz: Part One\n\nDavid recognized his niece, the Holy Roman empress Matilda (died 1167), as heir to Henry I in England, and from 1136 he fought for her against King Stephen (crowned as Henry’s successor in December 1135), hoping thereby to gain Northumberland for himself. A brief peace made with Stephen in 1136 resulted in the cession of Cumberland to David and the transfer of Huntingdon to his son Earl Henry. David, however, continued to switch sides. While fighting for Matilda again, he was defeated in the Battle of the Standard, near Northallerton, Yorkshire (Aug. 22, 1138). He then made peace once more with Stephen, who in 1139 granted Northumberland (as an English fief) to Earl Henry. In 1141 David reentered the war on Matilda’s behalf, and in 1149 he knighted her son Henry Plantagenet (afterward King Henry II of England), who acknowledged David’s right to Northumberland.\n\nIn Scotland, David created a rudimentary central administration, issued the first Scottish royal coinage, and built or rebuilt the castles around which grew the first Scottish burghs: Edinburgh, Stirling, Berwick, Roxburgh, and perhaps Perth. As ruler of Cumbria he had taken Anglo-Normans into his service, and during his kingship many others settled in Scotland, founding important families and intermarrying with the older Scottish aristocracy. Bruce, Stewart, Comyn, and Oliphant are among the noted names whose bearers went from northern France to England during the Norman Conquest in 1066 and then to Scotland in the reign of David I. To these and other French-speaking immigrants, David granted land in return for specified military service or contributions of money, as had been done in England from the time of the Conquest."}, {"url": "https://infofamouspeople.com/famous/david-king.htm", "page_content": "David King's About ✎]\n\nDavid King was born on March 7, 1972 (age 51) in Australia. According to numerology, David King's Life Path Number is 2. He is a celebrity australian rules footballer. Former Australian Rules Football player who won the AFL premiership title in 1996 and 1999 while playing with North Melbourne. After his playing days, he started working for Fox Footy and SEN 1116 as an announcer. His height is 183 cm (6 ft 0 in). More information on David King can be found here. This article will clarify David King's Bio, Wikipedia, Age, Birthday, Height, and other information.\n\nLet's explore Your Tarot online (love,wellness,fortune)\n\nIf you are a fan of David King, tell us more about Him\n\nAdvertisement\n\nFamily, Spouse, Dating, and Relationships of David King ✎]\n\nHe played for Victoria in the State of Origin.\n\nDavid King Before Fame ✎]\n\nOn 3-7-1972, David King was born. It indicates that He is on life path 2. His personal year number in 2023 is 8. He played for Port Melbourne before joining North Melbourne in 1994. He played with them until his retirement in 2004, kicking 145 goals in 241 games with the club.\n\nThe Numerology of David King ✎]\n\nDavid King's Life Path Number is 2 as per numerology, it means he is motivated by community, harmony, and relationships. Life path 2s are peacekeepers who aim to achieve balance, specifically when it comes to their relationships. They're sensitive empaths, so they can pick up the emotions of others, and they're generally reserved and kindhearted.\n\nAdvertisement\n\nDavid King's personal year in numerology ✎]\n\nThis year, David King’s personal year number is 8. The number 8 in personal year represents independence and intelligence. This is also the upward phase in the 9-year cycle, everything will gradually go smoothly, David King will have the opportunity to make a breakthrough for great development!\n\nSuccess of David King ✎]\n\nHe earned All-Australian honors twice during his playing days. He's also worked as an assistant coach for Richmond.\n\nAssociated with ✎]\n\nHe and Wayne Carey were teammates on North Melbourne. Nathan Buckley, Brad Fittler, and John Longmire were also His acquaintances.\n\nWayne Carey australian rules footballer\n\nDavid King Net Worth ✎]\n\nInformation about His net worth in 2023 is being updated as soon as possible by infofamouspeople.com, You can also click edit to tell us what the Net Worth of the David King is\n\nHouses & Cars & Luxury Brands ✎]\n\nDavid King's house, cars and luxury brand in 2023 will be updated as soon as possible, you can also click edit to let us know about this information."}], "David King is a former Australian rules footballer.": [{"url": "https://www.famousbirthdays.com/people/david-king.html", "page_content": "About\n\nFormer Australian Rules Football player who won the AFL premiership title in 1996 and 1999 while playing with North Melbourne. After his playing days, he started working for Fox Footy and SEN 1116 as an announcer.\n\nBefore Fame\n\nHe played for Port Melbourne before joining North Melbourne in 1994. He played with them until his retirement in 2004, kicking 145 goals in 241 games with the club.\n\nTrivia\n\nHe earned All-Australian honors twice during his playing days. He's also worked as an assistant coach for Richmond.\n\nFamily Life\n\nHe played for Victoria in the State of Origin.\n\nAssociated With\n\nHe and Wayne Carey were teammates on North Melbourne."}, {"url": "https://www.celebsages.com/david-king/", "page_content": "Birth Name: David King Occupation: Australian Rules Footballer Born In: Australia Birthdate: March 7, 1972 Age: 51 years old (as of 2023) Ethnicity: Unknown Nationality: Australian Sexuality: N/A\n\nDavid King was born on the 7th of March, 1972. He is famous for being a Australian Rules Footballer. He and Wayne Carey were teammates on North Melbourne. David King’s age is 51. Former Australian Rules Football player who won the AFL premiership title in 1996 and 1999 while playing with North Melbourne. After his playing days, he started working for Fox Footy and SEN 1116 as an announcer. The 51-year-old australian rules footballer was born in Australia. He played for Port Melbourne before joining North Melbourne in 1994. He played with them until his retirement in 2004, kicking 145 goals in 241 games with the club. He earned All-Australian honors twice during his playing days. He’s also worked as an assistant coach for Richmond.\n\nCountdown to David’s next birthday.\n\nDavid King is a Pisces and his 52nd birthday is in .\n\nJUMP TO: David King’s biography , facts , family , personal life , zodiac , videos , net worth , and popularity .\n\nChildhood\n\nDavid King was born in 1970s. The 1970s were a \"pivot of change\", it was an era of economic struggle, cultural change, and technological innovation. The Seventies saw many women's rights, gay rights, and environmental movements. Discover what happened on this day.\n\nDavid King is part of the Baby boomers generation. Baby Boomer is the result of the end of World War II, when birth rates across the world spiked. They are associated with a rejection of traditional values. These hippie kids protested against the Vietnam War and participated in the civil rights movement.\n\nYou can also find out who is David King dating now and celebrity dating histories at CelebsCouples.\n\nIt's hard to know David King birth time, but we do know his mother gave birth to his on a Tuesday. People born on a Tuesday have great will power and a lot of energy. In general, they are very ambitious.\n\n[fetch instagram=”king_david85″ display=”posts” ]\n\nThe 51-year-old Australian was born in the Generation X and the Year of the Rat\n\nEducation\n\nThe education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nDavid King’s mother’s name is Nitzevet and his father’s name is Jesse. We will continue to update information on David King’s parents.\n\nPersonal Life\n\nLike many famous people and celebrities, David King keeps his personal life private. Once more details are available on who he is dating, we will update this section.\n\nFast Facts\n\nREAL NAME: David King NICKNAME: David\n\nMARTIAL STATUS: Pending RELIGION: Unknown TATTOOS: N/A AGE GENERATION: Generation X BIRTH SIGN: Pisces BIRTH DAY: Tuesday DAYS SINCE BIRTH:\n\nNet Worth\n\nThe 51-year-old Australian australian rules footballer has done well thus far. Majority of David’s money comes from being a australian rules footballer. CelebsMoney has recently updated David King’s net worth .\n\nVideos\n\nHoroscope\n\nZodiac Sign: David King is a Pisces. People of this zodiac sign like romance, to sleep, spiritual themes and dislike the know-it-all, to be criticized, and cruelty of any kind. The strengths of this sign are being compassionate, artistic, gentle, wise, while weaknesses can be to be fearful, overly trusting and desire to escape reality. The greatest overall compatibility with Pieces is Virgo and Taurus.\n\nChinese Zodiac: David King was born in the Year of the Rabbit. People born under this sign are clever and charming. They're curious, but sometimes too motivated by money.\n\n\n\n\n\nRuling Planet: David King has a ruling planet of Neptune and has a ruling planet of Neptune. Back the early 2,000 B.C. the outer planets, Uranus and Pluto, were not yet discovered, since the telescope had not yet been invented. Astrologers and astronomers could only work with planets visible to the eye.\n\n[fetch instagram=”king_david85″ display=”posts” show=”2″ ]\n\nDavid King’s birth sign is Pisces and he has a ruling planet of Neptune.\n\nDon’t miss\n\n– Who’s the richest Australian Rules Footballer in the world?\n\n– David King Net Worth Stats\n\n– When is David King’s birthday?\n\nAssociated with\n\nFans also viewed"}, {"url": "http://entertainmentbureau.com.au/portfolio-view/david-king/", "page_content": "DAVID KING\n\nAFL FOOTBALLER & TELEVISION PERSONALITY\n\nDavid King (born 7 March 1972) is a former Australian rules footballer who played for the North Melbourne Football Club in the Australian Football League (AFL). He debuted for the Kangaroos in 1994 after being recruited from Port Melbourne Football Club at the age of 22. He went on to play 241 games and kicked 145 goals, winning premierships in 1996 and 1999.\n\nKing represented Victoria in State of Origin on more than one occasion, including in 1998. David King is notable for holding a VFL/AFL record by playing in Preliminary Finals for seven consecutive years from his debut year in 1994 to 2000.\n\nDavid King was twice an AFL All-Australian and retired at the end of the 2004 season. He then joined theRichmond Football Club as an assistant coach in 2005.\n\nDavid King is currently a commentator for Fox Footy and SEN 1116. He won the Most Outstanding Television Special Comments award at the 2012 AFL Media Awards.\n\nOn February 19, 2015, Australian media reported that he was being investigated by police about successful bets he made predicting the winner of the 2014 AFL Rising Star award.\n\nWiki Link"}, {"url": "https://www.celebsagewiki.com/david-king-australian-rules-footballer", "page_content": "Age, Biography and Wiki\n\nDavid King was born on 7 March, 1972. Discover David King's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 51 years old?\n\nPopular As N/A Occupation N/A Age 51 years old Zodiac Sign Pisces Born 7 March 1972 Birthday 7 March Birthplace N/A Nationality\n\nWe recommend you to check the complete list of Famous People born on 7 March. He is a member of famous with the age 51 years old group.\n\nDavid King Height, Weight & Measurements\n\nAt 51 years old, David King height is 1.83 m and Weight 94 kg.\n\nPhysical Status Height 1.83 m Weight 94 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nDavid King Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is David King worth at the age of 51 years old? David King’s income source is mostly from being a successful . He is from . We have estimated David King's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nDavid King Social Network\n\nTimeline"}, {"url": "https://www.celebsmoney.com/net-worth/david-king/", "page_content": "David King‘s source of wealth comes from being a australian rules footballer. How much money is David King worth at the age of 51 and what’s his real net worth now?\n\nAs of 2023, David King’s net worth is $100,000 - $1M.\n\nDETAILS BELOW\n\nDavid King (born March 7, 1972) is famous for being australian rules footballer. He currently resides in Australia. Former Australian Rules Football player who won the AFL premiership title in 1996 and 1999 while playing with North Melbourne. After his playing days, he started working for Fox Footy and SEN 1116 as an announcer.\n\nSource of Money Australian Rules Footballer Real Name David King Place of Birth Australia Date of Birth March 7, 1972 (age 51) Height Under review Ethnicity Unknown Nationality Australian Religion Unknown\n\nDavid King is a Pisces and was born in The Year of the Rat\n\nLife\n\nDavid King was born in Australia on Tuesday, March 7, 1972 (Generation X). He is 51 years old and is a Pisces. He earned All-Australian honors twice during his playing days. He’s also worked as an assistant coach for Richmond.\n\nHe played for Port Melbourne before joining North Melbourne in 1994. He played with them until his retirement in 2004, kicking 145 goals in 241 games with the club. The education details are not available at this time. Please check back soon for updates. David King is a member of Richest Celebrities and Australian Rules Footballers."}, {"url": "https://www.celebsinsights.com/dating/david-kings-girlfriend-list/", "page_content": "David King\n\nAustralian Rules Footballer\n\nBorn in Australia, David King is best known for being a australian rules footballer. David is turning 52 years old in ; he was born on March 7, 1972. He played for Port Melbourne before joining North Melbourne in 1994. He played with them until his retirement in 2004, kicking 145 goals in 241 games with the club.\n\nThere are usually many dating news and scandals surrounding famous celebrities. The most frequently asked questions are, is David King single or dating, and who is David King’s girlfriend? We are here to clear up and debunk dating rumors surrounding David’s love life and girlfriends.\n\nAll you need to know about David King and a look at David King’s relationships, dating timeline, affairs, exes, biography, and more. ⤵\n\nReal Name David King Date of Birth March 7, 1972 Age 51 Birthplace Australia Dating Status Single Girlfriend N/A Height Under review (Under review) Weight Under review (Under review) Ethnicity Unknown Nationality Australian Hair Color N/A Eye Color N/A\n\nDavid King biography\n\nDavid King was born on Tuesday, March 7, 1972, in Australia. His given name is David King, and friends just call his David. Currently, he is 51 years old, and his 52nd birthday is in . You can learn more interesting insights about this date, as well as your own birthday, at BirthdayDetails.\n\nDavid was born in the Generation X, his zodiac animal is a Rat, and his spirit animal is a Wolf. People born in the year of the rat like saving and collecting. They never face financial difficulties and lead orderly lifestyles. If a rat gives you a valuable present, know that he thinks highly of you because he doesn't normally open his wallet for others. Rats do not want praise or recognition. They are extremely sensitive and can detect problems. They are generally successful when they take chances.\n\n\n\nPeople born on March 7 have a zodiac sign of Pisces. There would almost certainly be an image of Pisces next to the term \"psychic\" in the dictionary. Pisces is the zodiac's most perceptive, sensitive, and empathic sign, and that's because it's the last of the last. Pisces, as the final sign, has absorbed every lesson taught by the preceding signs, including the pleasures and sorrows, hopes and anxieties. It is represented as two fish swimming in opposite directions, symbolizing Pisces' continual divide of attention between imagination and reality.\n\nFormer Australian Rules Football player who won the AFL premiership title in 1996 and 1999 while playing with North Melbourne. After his playing days, he started working for Fox Footy and SEN 1116 as an announcer. He played for Victoria in the State of Origin.\n\nThere are plenty of celebrity romances that blossom every year. Let us take a look at David’s dating past below.\n\nWho is David King dating?\n\nAccording to our records, the Australian 51-year-old australian rules footballer is most likely single now. David King remains relatively quiet when it comes to sharing his personal life and makes it a point to stay out of the public eye. He may not be dating anyone publicly, but David may be seeing someone in private, and details were not made public yet. So it’s probably not safe to jump to conclusions.\n\nThe details about David Kings’s girlfriends and past relationships vary, so we can never be 100% sure. We use multiple online sources such as DatingRumor.com, and other publicly available data to ensure that our dating info and facts are accurate.\n\nOur goal is to make our dating information precise and updated. This page was updated in June 2023 with the latest dating information and news. If you have new details about who David King is dating today, please email us.\n\nDavid King girlfriend & dating history\n\nNot all is known about David King’s past relationships and partners. While it’s usually simple to find out who David is dating, it is harder to track all his hookups, flings, and breakups. Even in 2023, celebrities manage to surprise us with the way they keep their lives private.\n\nDavid King had at least few relationships. He has no children. David King has not been previously engaged. Surveys show that around 40% of men say “I love you” to their partner for the first time within the first month of a relationship, but men wait 90 days on average, and women take an average of 134 days. The information about previous dates and hookups is constantly updated.\n\n"}, {"url": "https://australianfootball.com/players/player/david+king/13344", "page_content": "AFL: 10,479th player to appear, 324th most games played, 677th most goals kickedNorth Melbourne: 832nd player to appear, 18th most games played, 40th most goals kicked\n\nSomething of a fringe player at Port Melbourne in his first two seasons after arriving from Assumption College, David King had a break out year in 1993 and was unlucky not to win the Liston Trophy. However, his explosive dashes out of the half back line and ball carrying ability did catch the attention of North Melbourne recruiters, and after 43 senior games with the Boroughs between 1990 and 1993, King was taken at number 46 in the 1993 National Draft.\n\nAt North Melbourne, where he fitted seamlessly into an already strong line-up, King enjoyed a very solid first year before going from strength to strength. During the course of an 11-season, 241 game, 145-goal AFL career, he achieved virtually everything the modern game has to offer. A tough, pacy, relentlessly aggressive footballer, he was equally adept in a number of positions, including the wing, a back pocket or half back flank, and ruck-rover. He was a key contributor to the 'Roos 1996 and 1999 premiership victories, and made the AFL All Australian team in 1997 and 1998. He also represented Victoria. David King retired at the end of the 2004 season.\n\nAuthor - John Devaney with additional material from Adam Cardosi"}, {"url": "https://www.celebsagewiki.com/david-king-footballer-born-1985", "page_content": "Age, Biography and Wiki\n\nDavid King was born on 2 February, 1985 in Australian, is an Australian rules footballer. Discover David King's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 38 years old?\n\nPopular As N/A Occupation N/A Age 38 years old Zodiac Sign Aquarius Born 2 February 1985 Birthday 2 February Birthplace N/A Nationality Australian\n\nWe recommend you to check the complete list of Famous People born on 2 February. He is a member of famous Player with the age 38 years old group.\n\nDavid King Height, Weight & Measurements\n\nAt 38 years old, David King height not available right now. We will update David King's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nDavid King Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is David King worth at the age of 38 years old? David King’s income source is mostly from being a successful Player. He is from Australian. We have estimated David King's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Player\n\nDavid King Social Network\n\nInstagram Linkedin Twitter Facebook David King Facebook Wikipedia David King Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.dhmtalentmanagement.com.au/speaker/david-king/", "page_content": "Twice named as an AFL All-Australian, multiple State of Origin representative and holder of an AFL/VFL record for playing in preliminary finals for 7 consecutive years, former North Melbourne player David King is an outspoken and at times controversial commentator who shoots from the hip.\n\nDavid King debuted for the Kangaroos in 1994 after being recruited from Port Melbourne. He went on to play 241 games and kicked 145 goals, and was a member of the winning Premiership teams of 1996 and 1999.\n\nA niggly in-your-face backman who liked to let the opposition know that he was around, King quickly gained a reputation for being fast and hard at the ball. He played most of his first season in the ones, however, didn’t really find his niche until 1996 when coach Denis Pagan shifted him from the wing to defence.\n\nNotorious for his capacity to run 20-30 metres out of defence then fire a 60-metre torpedo, King’s dash and enthusiasm were vital ingredients for the Roo’s over many seasons.\n\nKing played every game in 2004, but his form fluctuated late in the year and he was often used off the bench. Although he probably could have squeezed out another season, he came to a consensus with the club that he would retire.\n\nAfter retirement David held an assistant coaching position with the Richmond Football Club, he then moved into the media winning the Most Outstanding Television Special Comments award at the 2012 AFL Media Awards. He is currently seen on Fox Footy weekly in the AFL Season and calls the game for SEN1116.\n\nSpeaking with a passion he is as hard with his chat as he was with the ball when playing...and just like those playing days, he doesn’t fear the consequences when he does go in hard."}, {"url": "https://en-academic.com/dic.nsf/enwiki/2255952", "page_content": "David King — ist der Name folgender Personen: David King (Schauspieler) (1930–1998), britischer Schauspieler David King (Chemiker) (* 1939), britisch südafrikanischer Wissenschaftler und Politikberater David King (Wissenschaftshistoriker) (* 1941), britischer … Deutsch Wikipedia\n\nDavid King — Saltar a navegación, búsqueda David King es un personaje de ficción del videojuego Resident Evil Outbreak, y Resident Evil Outbreak: File 2. Es descrito como Un fontanero silencioso, cercano a los 30 años de edad, que no habla mucho de su pasado … Wikipedia Español\n\nDavid, King — • In the Bible the name David is borne only by the second king of Israel, the great grandson of Boaz and Ruth Catholic Encyclopedia. Kevin Knight. 2006 … Catholic encyclopedia\n\nDavid King — Pour les articles homonymes, voir King. David King David King et Stacey Kemp au Trophée NHK 2008 … Wikipédia en Français\n\nDavid King (theatre producer) — David King (born 13 April 1956) is an English composer and producer of musical theatre. Theatre producer David King pictured at home King has achieved international popular success in musical theatre, and his management of 20 theatre companies… … Wikipedia\n\nDavid King (Chemiker) — David King (Chemiker). Sir David King ScD, FRS (*12. August 1939 in Südafrika) ist ein britisch südafrikanischer Forscher, Wissenschaftsmanager und Politikberater. Er ist Direktor der Smith School of Enterprise and the Environment an der… … Deutsch Wikipedia\n\nDavid King Udall — Arizona Territorial Legislature In office 1899 Personal details Born September 7, 1851(1851 09 07) … Wikipedia\n\nDavid King-Wood — Born Oliver David King Wood 12 September 1913 Tehran, Iran Died 3 September 2003 (aged 89) Nationality British David King Wood (12 September 1913 – 3 September 2003) was a British actor. He was born in Tehran, Iran ( … Wikipedia\n\nDavid King (footballer) — David King Personal information Full name David Philip King Date of birth 30 September 1990 ( … Wikipedia"}], "David King played for the North Melbourne Football Club in the Australian Football League (AFL).": [{"url": "https://australianfootball.com/players/player/david+king/13344", "page_content": "AFL: 10,479th player to appear, 324th most games played, 677th most goals kickedNorth Melbourne: 832nd player to appear, 18th most games played, 40th most goals kicked\n\nSomething of a fringe player at Port Melbourne in his first two seasons after arriving from Assumption College, David King had a break out year in 1993 and was unlucky not to win the Liston Trophy. However, his explosive dashes out of the half back line and ball carrying ability did catch the attention of North Melbourne recruiters, and after 43 senior games with the Boroughs between 1990 and 1993, King was taken at number 46 in the 1993 National Draft.\n\nAt North Melbourne, where he fitted seamlessly into an already strong line-up, King enjoyed a very solid first year before going from strength to strength. During the course of an 11-season, 241 game, 145-goal AFL career, he achieved virtually everything the modern game has to offer. A tough, pacy, relentlessly aggressive footballer, he was equally adept in a number of positions, including the wing, a back pocket or half back flank, and ruck-rover. He was a key contributor to the 'Roos 1996 and 1999 premiership victories, and made the AFL All Australian team in 1997 and 1998. He also represented Victoria. David King retired at the end of the 2004 season.\n\nAuthor - John Devaney with additional material from Adam Cardosi"}, {"url": "https://www.foxsports.com.au/afl/teams/north-melbourne-kangaroos/afl-2023-david-king-urges-north-melbourne-kangaroos-to-make-ruthless-calls-on-senior-players-loss-to-essendon-bombers-not-performing-mistakes-reactions-response-latest-news/news-story/c0785291ad20a6c67c1a14f930201d0b", "page_content": "Kangaroos legend David King has called for the club to be prepared to make ruthless calls on their senior players who aren’t performing, saying “it’s time to make some decisions.”\n\nNorth Melbourne went down to the Bombers by just six points in Sunday’s thrilling clash at Marvel Stadium, marking the rebuilding club’s 10th-straight loss to remain 17th on the ladder at 2-10.\n\nSpeaking on Fox Footy’s The First Crack, King believes it was stark how the Roos’ younger players showed more fight than their veterans in caretaker coach Brett Ratten’s third game in charge.\n\nWatch every match of every round of the 2023 Toyota AFL Premiership Season LIVE on Kayo Sports. New to Kayo? Start your free trial now >\n\n\n\nThe Roos fell to 2-10 (Photo by Quinn Rooney/Getty Images) Source: Getty Images\n\n“The future is going to lose some magnets along the way. You perform yourself on the journey or you perform yourself out of the journey,” the dual premiership Kangaroo said.\n\n“The older guys have to be the reason you win games, not part of the reason you lose them. We’re talking about guys that are seasoned campaigners.\n\n“(Ben) McKay is going to a three-on-two with the youngest players in the team, kick it to your ruckman and talls ... it’s just basic play.\n\n“Jack Ziebell, he had a horror last quarter, he kicked two out on the full and looked rattled. It was like the older blokes froze.\n\n“Aaron Hall, to me, he’s not in shape to play AFL footy at the elite level right now. He looked out of sorts. There was a big fumble, there was a big on-one-one without about two minutes to go on the way, he paddled the ball and didn’t have the confidence to take it one grab.\n\n“I just think you’ve got to look at the older guys and maybe it’s time to turn the page on a few. That may sound harsh, but this next level of player are ready to take control of the footy club, why wait?\n\n“They’ve got enough young talent to really got rolling. It’s time to make some decisions.”\n\nKangaroos fall short in Bombers battle! | 01:12\n\nDual All-Australian Leigh Montagna concurred with King and praised North Melbourne’s youngsters including George Wardlaw and Will Phillips for stepping up against Essendon.\n\nMontagna ultimately believes it has the Roos well placed moving forward, suggesting they could climb the ladder quicker than what some people think.\n\n“They weren’t in this game because of their veterans. I know they had the plan to play them, they brought in (Liam) Shiels and (Darcy) Tucker and (Hugh) Greenwood has been getting a game and they still have Ziebell and Hall.\n\n“But they were in this game late because of their kids. If anyone wants to go back and watch George Wardlaw in that last quarter, he was trying to get that team over the line.\n\n“Will Phillips put together another excellent game, Tarryn Thomas showed why he’s going to be a really good player.\n\n“I think they do need to put more faith in those kids and keep blooding them.\n\n“I’m still bullish on North Melbourne, when it all clicks for them, it’ll come in a hurry. I don’t think they are that far away at all, another 20 or 30 games together with the majority of this group.\n\n“The forward line that’s working as it is with (Nick) Larkey, (Cam) Zurhaar, (Callum) Coleman-Jones and (Charlie) Comben. I think it can click pretty quick.”\n\nNorth Melbourne Press Conference | 06:04\n\n\n\n"}, {"url": "https://www.foxsports.com.au/afl/teams/north-melbourne-kangaroos/afl-2022-david-king-calls-out-north-melbourne-kangaroos-stars-loss-to-fremantle-dockers-tarryn-thomas-todd-goldstein-luke-daviesuniacke-hugh-greenwood-jy-simpkin/news-story/c8c9dd09225b35c19abf796c69411499", "page_content": "PERTH, AUSTRALIA - APRIL 24: Tarryn Thomas of the Kangaroos looks dejected after a loss during the 2021 AFL Round 06 match between the Fremantle Dockers and the North Melbourne Kangaroos at Optus Stadium on April 24, 2021 in Perth, Australia. (Photo by Daniel Carson/AFL Photos via Getty Images)\n\nNorth Melbourne legend David King has called on his former side’s struggling stars to “front up” amid the club’s grim start to 2022.\n\nThe rebuilding Kangaroos have just one win from their opening eight games — and against a Covid-19-riddled West Coast — to sit 17th on the ladder with a percentage of 55.6, trailed only by the aforementioned Eagles.\n\nDavid Noble’s side only kicked three goals in its ugly 78 point-loss to Fremantle, who lost six players to health and safety protocols during the week, on Friday night in Perth.\n\nStream every match of every round of the 2022 Toyota AFL Premiership Season Live & Ad-Break Free In-Play on Kayo. New to Kayo? Try 14-Days Free Now >\n\nNEW FIRST CRACK PODCAST - Rd 8 wrap: ‘Saints’ slow death, you can’t rely on Swans’\n\nListen below or subscribe in Apple Podcasts or Spotify\n\nSpeaking on Fox Footy’s First Crack, King declared the Roos are “under siege” and that there’s “a little bit of angst and unrest” among their fans.\n\nWhile praising the “brilliant” Pick 1 draftee Jason Horne-Francis for his promising start to his career, King issued the challenge to North’s ‘frontline stars’ including Jy Simpkin, Todd Goldstein, Hugh Greenwood and Luke Davies-Uniacke to take charge in the midfield.\n\n“I don’t give the alibis to those guys who are getting smashed at stoppage. It’s really disappointing that those guys haven't engaged,” he said.\n\n“Your leaders are in there. Simpkin won your best and fairest last year, Goldstein has been a top-liner, You’re either invested or you’re not. Greenwood (in his) first year at the club, stand up and lead the way.\n\n“Davis-Uniacke — where’s the improvement coming from him? ﻿I’m saying for this guy to take responsibility, don’t wait for the coach to do things for you.”\n\nRoos players come from the field after Friday’s loss to Freo (Photo by Paul Kane/Getty Images) Source: FOX SPORTS\n\nThe dual-premiership Kangaroo also took aim at former Pick 8 Tarryn Thomas, who missed four games earlier this year due to internal bruising after a brutal collision against the Eagles, for failing to recapture his form in the back half of last season.\n\n“Tarryn Thomas has been AWOL for most of the year, I don’t know where his head is at. They need him to find form, get his head out of the you know where and start finding the footy,” he said.\n\n“At the moment, they’re not fighting the fight. I get concerned when I see that, and I don’t know if there are deeper issues or not. But if you’re a player, front up.\n\n“Those guys are too good and have played too much football.”\n\n\n\nSt Kilda great Leigh Montagna concurred, saying the Roos’ senior core need to lead from the front moving forward.\n\n“It’s not the kids’ fault, they just need to be coming through doing their thing,” he said.\n\n“Kayne Turner, Josh Walker, Simpkin, Luke McDonald has been pretty good. Goldstein is having a career but he should be back to being the No. 1 ruck.\n\n“To be competitive every week you need your senior eight to 10 players leading the way and they’re just not getting enough from those players.”\n\nNorth will look to bounce back against Port Adelaide at Blundstone Arena on Saturday afternoon."}, {"url": "https://internationalspeakers.com.au/speakers/david-king/", "page_content": "About David\n\nDavid King is a former North Melbourne AFL duel Premiership player. He debuted for the Kangaroos in 1994 after being recruited from Port Melbourne at the age of 22. He went on to play 241 games and kicked 145 goals, winning premierships in 1996 and 1999.\n\nHe is notable for holding a AFL record by playing in Preliminary Finals for seven consecutive years from his debut year in 1994 to 2000.He was twice an AFL All Australian and retired at the end of the 2004 season. He then joined the Richmond Football Club as an assistant coach in 2005.\n\nHe is currently a commentator for Fox Footy and SEN Radio. He won the Most Outstanding Television Special Comments award at the 2012 AFL Media Awards."}, {"url": "https://www.celebsagewiki.com/david-king-australian-rules-footballer", "page_content": "Age, Biography and Wiki\n\nDavid King was born on 7 March, 1972. Discover David King's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 51 years old?\n\nPopular As N/A Occupation N/A Age 51 years old Zodiac Sign Pisces Born 7 March 1972 Birthday 7 March Birthplace N/A Nationality\n\nWe recommend you to check the complete list of Famous People born on 7 March. He is a member of famous with the age 51 years old group.\n\nDavid King Height, Weight & Measurements\n\nAt 51 years old, David King height is 1.83 m and Weight 94 kg.\n\nPhysical Status Height 1.83 m Weight 94 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nDavid King Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is David King worth at the age of 51 years old? David King’s income source is mostly from being a successful . He is from . We have estimated David King's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nDavid King Social Network\n\nTimeline"}, {"url": "http://entertainmentbureau.com.au/portfolio-view/david-king/", "page_content": "DAVID KING\n\nAFL FOOTBALLER & TELEVISION PERSONALITY\n\nDavid King (born 7 March 1972) is a former Australian rules footballer who played for the North Melbourne Football Club in the Australian Football League (AFL). He debuted for the Kangaroos in 1994 after being recruited from Port Melbourne Football Club at the age of 22. He went on to play 241 games and kicked 145 goals, winning premierships in 1996 and 1999.\n\nKing represented Victoria in State of Origin on more than one occasion, including in 1998. David King is notable for holding a VFL/AFL record by playing in Preliminary Finals for seven consecutive years from his debut year in 1994 to 2000.\n\nDavid King was twice an AFL All-Australian and retired at the end of the 2004 season. He then joined theRichmond Football Club as an assistant coach in 2005.\n\nDavid King is currently a commentator for Fox Footy and SEN 1116. He won the Most Outstanding Television Special Comments award at the 2012 AFL Media Awards.\n\nOn February 19, 2015, Australian media reported that he was being investigated by police about successful bets he made predicting the winner of the 2014 AFL Rising Star award.\n\nWiki Link"}, {"url": "https://wwos.nine.com.au/afl/north-melbourne-kangaroos-signs-alastair-clarkson/9f2a13ec-b5a3-472a-a2ce-09c38503cdfb", "page_content": "Aug 19th, 2022\n\nAug 19th, 2022\n\nFour-time premiership winning coach Alastair Clarkson has ended weeks of speculation, confirming he'll take over at North Melbourne in 2023.\n\nIn an announcement from the club, the Kangaroos said agreement was reached on Thursday night on a five-year deal.\n\nClarkson's decision to join the Kangaroos muddies the waters at Essendon, who had been chasing Clarkson to replace Ben Rutten.\n\nREAD MORE: Fuming Souths 'give up' on controversial rule\n\nREAD MORE: 'Little twerp' behind staggering $1 billion claim\n\nREAD MORE: Smith snub a fresh blow to ailing competition\n\nClarkson previously coached Hawthorn for 17 seasons, winning premierships in 2008, as well as the three-peat of 2013-14-15.\n\nThe Kangaroos have endured a tough few years, having not played finals football since 2016. Only an unlikely win this weekend would prevent them claiming a second straight wooden spoon.\n\nClarkson will be the fourth coach in five years at North Melbourne, returning to the club where he played 93 matches between 1987-1995.\n\n\"I can't speak highly enough of the professionalism of Alastair and his manager James Henderson over this past four weeks,\" club president Sonja Hood wrote in a letter to members.\n\nClarkson call a huge blow for Bombers\n\n\"We've had a crash course in getting to know each other and Alastair's passion to drive our club back to where we belong is incredibly infectious.\n\n\"Today is a good day. Alastair's coming home. To our home.\"\n\nNorth Melbourne great David King says Clarkson's appointment is the start of a fresh, exciting chapter for the club.\n\n\"Can I say well done Sonja Hood. She was prepared to cop the backlash that was going to come if the attempt was a failed one,\" King told SEN.\n\n\"This is a massive day for the North Melbourne Football Club. Welcome home Alastair.\n\n\"Let's hope he can correct what has been a shambolic situation over the previous couple of years.\n\n\"This is so good. So good for the Kangas. Essendon will be all the talk, but this is a great day for North Melbourne.\"\n\nAnother club legend, Corey McKernan, told SEN that Clarkson's appointment is a fantastic end to a tough year, one that's seen constant speculation over the long-term future of No.1 draft pick Jason Horne-Francis, who was dropped last week for disciplinary reasons.\n\n\"It's just a tremendous shot in the arm for the footy club,\" McKernan said.\n\n\"You talk about hope for fans, what about the players? What happens with the rumours with Jason Horne-Francis and some of the other players.\n\n\"All of a sudden now Clarko is there, I'd imagine that dramatically changes the conversation and the narrative around what's going to happen with the North Melbourne Football Club.\"\n\nMeanwhile, Gillon McLachlan has assured fans the AFL played no part in Clarkson's decision.\n\nClarkson is likely to earn somewhere in the region of $1 million a season, which is a fair chunk out of the club's soft cap of around $7 million.\n\nEarlier this month McLachlan had flagged that ambassadorial payments may have been available to whichever club landed the premiership-winning coach.\n\n\"I'm keen to address that,\" McLachlan told 3AW's Neil Mitchell.\n\n\"There has been discussions around the place around ambassador stuff, I think people maybe thought that for Greater Western Sydney.\n\n\"It's exactly as I said, I think on your show, that Alastair had to make the decision on the basis of what the clubs put to him and we played no role in it.\"\n\nMcLachlan said the league is not contributing a cent to Clarkson's contract.\n\n\"No, zero,\" he said.\n\nClarkson will officially take over from interim coach Leigh Adams on November 1.\n\nFor a daily dose of the best of the breaking news and exclusive content from Wide World of Sports, subscribe to our newsletter by clicking here!"}, {"url": "https://www.famousbirthdays.com/people/david-king.html", "page_content": "About\n\nFormer Australian Rules Football player who won the AFL premiership title in 1996 and 1999 while playing with North Melbourne. After his playing days, he started working for Fox Footy and SEN 1116 as an announcer.\n\nBefore Fame\n\nHe played for Port Melbourne before joining North Melbourne in 1994. He played with them until his retirement in 2004, kicking 145 goals in 241 games with the club.\n\nTrivia\n\nHe earned All-Australian honors twice during his playing days. He's also worked as an assistant coach for Richmond.\n\nFamily Life\n\nHe played for Victoria in the State of Origin.\n\nAssociated With\n\nHe and Wayne Carey were teammates on North Melbourne."}, {"url": "https://www.nmfc.com.au/news/1023324/king-bullish-on-2021", "page_content": "A two-time premiership player, the passion David King still holds for North Melbourne Football Club is obvious and, often, unbridled.\n\nAfter almost 250 games, King was a key member of the North side which dominated football in the late 1990’s.\n\nWith three grand finals and three top four finishes in the first six years of his career, King is a player turned pundit who knows what success looks like and knows what it takes to win at the highest level.\n\nAfter the turn of the century, however, the club made finals in just one of his final four years at the club, as it looked to gear up for another tilt at the pinnacle, with young players like Brady Rawlings, Drew Petrie and Daniel Wells coming through the ranks.\n\nWhile he never finished lower than 13th in his storied career, North had showed signs of bottoming out and retooling during his later period at the club, much like it is now.\n\n2021’s bottom-placed finish may be difficult to look at, but King says he views this past season as a successful one.\n\n“I was looking for a year of growth, and it takes a brave club to say we’re going to rebuild, we’re going back to ground zero and let’s see what comes from there,” he said during the Syd Barker Medal.\n\n“For me personally, I’ve watched how (Tarryn) Thomas, (Tom) Powell, (Luke) Davies-Uniacke, Cam Zurhaar, Nick Larkey and these types really grow and blossom into that next level of player already.\n\n“Jack (Ziebell) has led the way really admirably, and that next wave of leaders have done the hard yards.\n\n“It tough at this phase of AFL football, so if you’re looking for two to three years’ time, you really love what you say this year.”\n\nShare Close Share This Video Share on Facebook\n\nShare on Twitter\n\nShare on WhatsApp\n\nCopy link Link copied to clipboard Syd Barker Medal, 2021 (Full Replay) Watch the full stream of the 2021 Syd Barker Medal as the North Melbourne Football Club crowns its AFL Club Champion.\n\nLike all fans of the club, King is well aware of what Ben Cunnington means to everyone associated with North Melbourne.\n\nWhile his playing career never crossed paths with the current number 10, King played with some of the hardest and best midfielders to ever pull on the royal blue and white stripes including Anthony Stevens, Anthony Rock and Peter Bell.\n\nHe says Cunnington’s name should be there will the all-time greats of the club.\n\n“I don’t even think he (Cunnington) understands what he means to this football club and this group,” King said.\n\n“He’s one that should probably be thrown into the team of the century. His consistency is unparalleled across the competition.”"}, {"url": "https://au.sports.yahoo.com/afl-2022-david-king-criticises-north-melbourne-mega-trade-deal-211604222.html", "page_content": "David King has criticised his former club North Melbourne over a mega trade deal that will see Jason Horne-Francis move to Port Adelaide. Pic: Getty\n\nNorth Melbourne great David King says his beloved former club made a big mistake by coughing up top pick and last year's No.1 selection Jason Horne-Francis, in in one of the most complicated trade deals in AFL history.\n\nHorne-Francis landed at Port Adelaide and GWS got their hands on the No.1 draft pick after a convoluted process that involved four different clubs.\n\n'STAGGERING': Josh Dunkley at centre of big twist as AFL trade breaks down\n\nBIG CALL: Gillon McLachlan speaks out over Andrew Thorburn dramas at Essendon\n\nBACK OFF: Steve Price's 'infuriating' AFLW take rubbished by Nicola Barr\n\nThe Giants traded out picks three and 12 to shuffle up the draft order, while the Kangaroos received picks two and three in return for their pick ones.\n\nThe Roos also secured a future first-round choice that is tied to Port Adelaide, but become the first club since Fremantle in 2001 to trade away pick one.\n\nThe Power received small forward Junior Rioli from West Coast, who also traded out pick two and get picks eight and 12 back.\n\nA raft of later draft picks have also changed hands in the mega deal, which was ticked off by league officials late on Monday.\n\nKing - who won two premierships during his time at North Melbourne - says the club squandered a golden opportunity to secure young forward Aaron Cadman, who GWS look set to target with their number one draft pick.\n\n“I’m extremely frustrated by this,” King said on Fox Sports' Trading Day.\n\n“I just don’t know at what stage North Melbourne will decide to invest in a tall forward of note.\n\n“There’s one sitting there (Cadman) – you hold the pick that will secure this guy for a decade. They overlooked (Swan) Logan McDonald a few years ago and everyone said: ‘OK, you’ve gone for (midfielder Will) Phillips and we’ll wait and see’. And I understand that.\n\n“When do you start straightening up your spine? The midfield is an easy discussion. They’ll get two good midfielders but so will everyone else.\n\nHe says the fact GWS were so keen to shore up their pick to get Cadman should set off alarm bells at North Melbourne.\n\nYoung forward Aaron Cadman is looming as one of the top AFL draft prospects. Pic: Getty\n\n“When you see what GWS have done to get up the board to get this guy, country Victorian kid, he’s an hour down the road – like this is perfect for them.\n\n“Clearly they don’t rate him as high as everyone else does. And that’s OK. Time will tell. But it’s a big gamble for a football club where not much has gone right in the last three or four years.”\n\nKing says the massive fee Geelong had to pay for Jeremy Cameron is a warning to clubs who fail to invest in developing their own tall forwards.\n\nIn a telling assessment of the trade deal, the Roos great says his former club was \"dudded\" and warns that it deepens the \"crisis\" they find themselves in.\n\n“The joint’s in crisis and has been for some time,” King said.\n\n“Have a look at if you don’t draft your own power forward.\n\n“It’s a two to three-year investment somewhere down the track...I just don’t know at what stage North Melbourne will decide to invest in a tall forward of note.\n\n“They’ve been dudded. It just puts a full stop on an awful period.”\n\nJason Horne-Francis returning to South Australia\n\nSouth Australian product Horne-Francis signed a deal tying him to Port Adelaide until the end of 2028, joining the midfield unit alongside Brownlow medallist Ollie Wines, Zak Butters and Connor Rozee.\n\n\"Jason is a highly talented player who we know will complement our developing and exciting midfield group,\" Port Adelaide list manager Jason Cripps said.\n\n\"He is competitive and aggressive, and we like his power and explosiveness as well as his ability to go forward and hit the scoreboard.\"\n\nRioli, who starred in West Coast's 2018 premiership side, has inked a four-year deal with Port Adelaide.\n\nSeparate deals on Monday resulted in premiership ruckman Luke Jackson moving from Melbourne to Fremantle and prized forward Izak Rankine joining Adelaide from Gold Coast.\n\nLuke Jackson is moving to Fremantle after a busy day in the AFL trade period. Pic: Getty\n\nThe Crows sent pick No.5, a future third and future fourth-round selection to the Suns for South Australian forward Rankine, pick No.46 and a future fourth-round selection.\n\nIn exchange for West Australian talent Jackson, plus picks 44 and 67, the Dockers coughed up pick 13 plus their future first and second-round selections.\n\nMelbourne had originally received pick 44 from GWS in a swap for small forward Toby Bedford.\n\nJackson, the No.3 pick in 2019, requested a long-expected trade home to Western Australia last month after 52 games for the Demons.\n\nMelbourne will now move on to securing Collingwood's two-time All-Australian Brodie Grundy as Jackson's replacement.\n\nEssendon landed Carlton on-baller Will Setterfield on Monday afternoon, sending the Blues a future fourth-round pick in exchange for the big-bodied midfielder and pick No.68.\n\nFringe Melbourne forward Sam Weideman is reportedly poised for a fresh start at Essendon under new coach Brad Scott, likely moving for a future third-round pick.\n\nwith AAP\n\nClick here to sign up to our newsletter for all the latest and breaking stories from Australia and around the world."}]}