{"David King retired at the end of the 2003 season, having played a total of 270 games for North Melbourne.": [{"url": "https://australianfootball.com/players/player/david+king/13344", "page_content": "AFL: 10,479th player to appear, 324th most games played, 677th most goals kickedNorth Melbourne: 832nd player to appear, 18th most games played, 40th most goals kicked\n\nSomething of a fringe player at Port Melbourne in his first two seasons after arriving from Assumption College, David King had a break out year in 1993 and was unlucky not to win the Liston Trophy. However, his explosive dashes out of the half back line and ball carrying ability did catch the attention of North Melbourne recruiters, and after 43 senior games with the Boroughs between 1990 and 1993, King was taken at number 46 in the 1993 National Draft.\n\nAt North Melbourne, where he fitted seamlessly into an already strong line-up, King enjoyed a very solid first year before going from strength to strength. During the course of an 11-season, 241 game, 145-goal AFL career, he achieved virtually everything the modern game has to offer. A tough, pacy, relentlessly aggressive footballer, he was equally adept in a number of positions, including the wing, a back pocket or half back flank, and ruck-rover. He was a key contributor to the 'Roos 1996 and 1999 premiership victories, and made the AFL All Australian team in 1997 and 1998. He also represented Victoria. David King retired at the end of the 2004 season.\n\nAuthor - John Devaney with additional material from Adam Cardosi"}, {"url": "https://www.celebsagewiki.com/david-king-australian-rules-footballer", "page_content": "Age, Biography and Wiki\n\nDavid King was born on 7 March, 1972. Discover David King's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 51 years old?\n\nPopular As N/A Occupation N/A Age 51 years old Zodiac Sign Pisces Born 7 March 1972 Birthday 7 March Birthplace N/A Nationality\n\nWe recommend you to check the complete list of Famous People born on 7 March. He is a member of famous with the age 51 years old group.\n\nDavid King Height, Weight & Measurements\n\nAt 51 years old, David King height is 1.83 m and Weight 94 kg.\n\nPhysical Status Height 1.83 m Weight 94 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nDavid King Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is David King worth at the age of 51 years old? David King’s income source is mostly from being a successful . He is from . We have estimated David King's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nDavid King Social Network\n\nTimeline"}, {"url": "https://www.swanseacity.com/history/players-past", "page_content": "SWANSEA CITY PAST PLAYERS (Post War) A-Z\n\nA\n\nPAWEL ABBOTT\n\nThe Polish striker arrived at the Liberty from Huddersfield Town for £150,000 in January 2007. A Poland Under-23 international, he was brought in to fill the void left by Rory Fallon, who had left to join Plymouth. He made his debut as a substitute in a 2-0 win over Gillingham and scored his only goal for the Swans in a 2-1 victory at Rotherham in Roberto Martinez’s first game in charge. Abbott featured in the side that narrowly missed out on a place in the play-offs at the end of the 2006-07 season, before departing during the summer for Darlington after 18 appearances (nine as sub) and one goal. He went on to sign for Darlington, Oldham, Charlton and Polish clubs Ruch Chorzów and Zawisza Bydgoszcz.\n\nPETER ABBOTT\n\nStriker Peter Abbott was a member of Harry Gregg's squad at Swansea City. A former Manchester United apprentice, he turned professional in October 1970 but failed to secure a first-team slot and moved to the Vetch Field initially on loan in February 1974. He made his League debut in that month's 3-0 win at home to Stockport and netted three goals in 41 Fourth Division games for Swansea prior to joining Hartford Bi-Centennials in May 1976. Reuniting with Harry Gregg at Crewe Alexandra in August 1976, he joined Southend United in July 1977 and was a promotion winner in 1977-78, then returned to the United States.\n\nTAMMY ABRAHAM\n\nA tall, gangly striker, Abraham spent the 2017-18 season on loan with the Swans from parent club Chelsea. After a promising start to the campaign, Tammy and the team struggled, and he ended up with just five goals as the Swans were relegated from the Premier League. After leaving the Swans, the England international spent a season on loan at Aston Villa where he found his goalscoring form again to help the club secure promotion to the Premier League with a play-off victory over Derby County at Wembley. He has since gone on to make his mark in the Premier League with Chelsea, where he was an academy graduate; making two first-team appearances in 2016 before a successful loan move to Bristol City.\n\nREUBEN AGBOOLA\n\nVersatile left-back Reuben Agboola gained Nigerian international recognition whilst at Swansea City. Signing professional for Southampton in April 1980, he gained considerable top-flight experience before joining Sunderland for £150,000 in January 1985. He helped them win the Third Division title in 1987-88 and was loaned to Charlton Athletic and Port Vale before moving to the Vetch Field in November 1991. Making 28 League appearances for Swansea prior to joining Woking in August 1993, he then played for Gosport.\n\nPAUL AGNEW\n\nFormer Northern Ireland U-23 left-back Paul Agnew briefly played for Swansea City during the 1987-88 campaign. Initially with Cliftonville, he joined Grimsby Town for £15,000 in February 1984 and starred in their 1989-90 and 1990-91 promotion successes. He followed Alan Buckley to West Brom for £65,000 in February 1995 and reunited with Keith Alexander at Ilkeston Town in July 1997. Moving to Swansea on non-contract terms in September 1997, he made seven Third Division appearances before joining Wisbech Town in December 1997.\n\nADEBAYO AKINFENWA\n\nNigerian striker Adebayo Akinfenwa scored the winner in Swansea City's 2006 Football League Trophy final triumph. Initially with Watford, he then played for Atlantas and scored their winner in the 2001 Lithuanian Cup final. He joined Barry Town in August 2002 and featured in their 2003 Welsh Cup final success, then had spells with Boston United, Leyton Orient, Rushden & Diamonds and Doncaster Rovers before moving to Torquay United in July 2004. Top scorer in 2004-05, he reunited with Kenny Jackett at Swansea for an initial £35,000 in July 2005 and appeared in the 2005-06 League One play-off final.\n\nSANDY ALLAN\n\nScottish striker Sandy Allan had a loan spell at Swansea City during the 1972-73 season. A former amateur with Barnsley and Doncaster Rovers, he was a prolific goalscorer for Rhyl prior to joining Cardiff City for £12,500 in March 1967. He netted a hat-trick against Mjondalen in the 1969-70 ECWC and moved to Bristol Rovers for £12,500 in March 1970. Harry Gregg signed him on loan in March 1973 and he scored once in seven League games for struggling Swansea. He joined Cape Town City in March 1974, then had a spell as Harrogate Railway's player-boss before returning to South Africa to set up a window company.\n\nIVOR ALLCHURCH\n\nWelsh international inside-forward Ivor Allchurch is widely regarded as Swansea's finest post-war player. Signing professional at the Vetch Field in May 1947, the 'Golden Boy' was leading marksman three times before moving to Newcastle United for £28,000 plus Reg Davies in October 1958. He joined Cardiff City for £15,000 in August 1962 and returned to Swansea for £6,500 in July 1965. Scoring 164 goals in 445 League games overall for the Swans, he moved to Worcester City in July 1968, then was Haverfordwest's player-manager. Awarded the MBE, he later worked as a storeman and died in Swansea in May 1997.\n\nLEN ALLCHURCH\n\nWelsh international winger Len Allchurch was capped seven times whilst at Swansea. The younger brother of Ivor, he signed professional at the Vetch Field in October 1950 and featured in two consecutive Welsh Senior Cup finals before being sold to Sheffield United for £14,000 in March 1961. He helped them clinch promotion that season and moved to Stockport County in September 1965, starring in their 1966-67 Fourth Division triumph. Re-joining Swansea in July 1969, he netted 60 goals in 347 League games overall before moving to Haverfordwest in July 1971.\n\nJOE ALLEN\n\nThe Narberth-born midfielder joined the Swansea City family as an 11-year-old, coming through the youth ranks before making his mark in the first team. Allen made his senior debut in the final game of the 2006-07 season – a 6-3 home defeat against Blackpool at the Liberty. The seasons that followed saw Joe consolidate his position in the first-team squad, with the midfielder going on to make his Under-21 and senior bows for Wales. As the Swans progressed, so did Allen. He helped the club win promotion to the Premier League following the Play-Off Final win over Reading at Wembley, before going on to play a big part in the Swans’ debut season in the top-flight. His outstanding performances earned him the Wales Player of the Year award for 2012 and he went on to follow Brendan Rodgers to Liverpool in a £15million deal in the summer after 128 appearances (35 as sub) and seven goals.\n\nJOE ALLON\n\nEx-England Youth Striker Joe Allon featured prominently in Swansea City's 1987-88 promotion campaign. Signing professional for Newcastle United in November 1984, he moved to Swansea in August 1987 and scored in seven consecutive matches. He netted 12 times in 34 League games overall prior to joining Hartlepool United for £10,000 in November 1988 and was top scorer in their 1990-91 promotion success. Sold to Chelsea for £300,000 in August 1991, he joined Brentford for £275,000 in November 1992 and later played for Port Vale, Lincoln City and Hartlepool again.\n\nJULIAN ALSOP\n\nStriker Julian Alsop was an influential figure in Swansea City's 1999-2000 Third Division title triumph. Initially with Nuneaton Borough, he had spells with VS Rugby, RC Warwick, Tamworth and Halesowen Town prior to joining Bristol Rovers for £15,000 in February 1997. He moved to Swansea for £30,000 in March 1998 after a loan period and netted 16 goals in 90 League games before joining Cheltenham Town in July 2000. Top scorer in two consecutive seasons, including their 2001-02 promotion success, he joined Oxford United in June 2003 and has since played for Northampton, Tamworth, Newport County and Carmarthen.\n\nKEVIN AMANKWAAH\n\nA tall, rangy full-back, Amankwaah arrived at the Liberty in July 2006 from Yeovil. After suffering a horrific car crash in 2002 that saw him break his neck, the defender recovered well to continue his football career. Unfortunately, he didn’t really suit the style of then boss Kenny Jackett and he was eventually released by Roberto Martinez, going on to sign for Swindon Town after 29 appearances (six as sub).\n\nJORDI AMAT\n\nBarcelona-born centre back Jordi Amat joined the Swans after our League Cup winning campaign. A product of the youth academy at La Liga side Espanyol, Amat made a positive impact during the Swans Europa League spell, making his full debut playing the full 90 mins in a 4-0 home victory against Malmo FF. He went on to make 52 league appearances for the Jacks and nine appearances in Europe. In 2018, after a season long loan spell at La Liga side Real Betis, Jordi returned to Rayo Vallecano permanently.\n\nKWAME AMPADU\n\nRepublic of Ireland Under-21 midfielder Kwame Ampadu featured in Swansea City's 1994 Autoglass Trophy final success. Signing professional for Arsenal in November 1988, he joined West Brom for £50,000 in June 1991 and featured in their 1992-93 promotion campaign. 'Paddy' moved to Swansea for £15,000 in February 1994 and appeared in the 1996-97 Third Division play-off final, netting 12 goals in 147 League games before joining Leyton Orient in July 1998. He helped them qualify for the Third Division play-offs in 1998-99, then played with John Cornforth at Exeter and Newport County before moving to Tiverton.\n\nIJAH ANDERSON\n\nAttacking left-back Ijah Anderson featured in Swansea City's 2004-05 promotion success. A former Tottenham Hotspur trainee, he moved via Southend United to Brentford in July 1995 and starred as they won the Third Division title in 1998-99, were LDV Vans Trophy finalists in 2000-01 and Second Division play-off finalists in 2001-02. He was loaned to Wycombe Wanderers prior to joining Bristol Rovers in February 2003. Kenny Jackett signed him in November 2004 and he helped Swansea win the FAW Cup that season but was sacked by Swans in January 2006 after being banned for six months for drug abuse.\n\nPAUL ANDERSON\n\nAnderson was a speedy winger who was part of the Swans squad that lifted the League One title in 2007-08. He was brought to the club on a season-long loan from Liverpool in July 2007 and the youngster proved a big hit in his one and only season at the Liberty. Anderson could regularly be seen tearing up defences on the right flank – going on to secure England under-19 honours in the process. There was hope of signing the winger on a permanent basis following promotion to the Championship, but he opted to move to Nottingham Forest instead. After leaving Forest in 2012, Anderson featured for Bristol City before signing for Ipswich.\n\nMATT ANDREW\n\nWing-half Matt Andrew was a member of Swansea's 1948-49 Third Division (South) championship squad. He failed to secure a first-team slot at Bristol City before moving to the Vetch Field in August 1948 and made his League debut in place of Jim Feeney in Swansea's 3-1 defeat at Leyton Orient the following month. Featuring in two consecutive West Wales Senior Cup final triumphs, he also helped the reserves win the London Combination Cup in 1950 and made four League appearances prior to joining new-boys Workington in June 1951. Subsequently with QPR, he settled near Port Talbot and died in August 1999.\n\nKERI ANDREWS\n\nWelsh Youth international winger Keri Andrews featured in Swansea's 1987-88 promotion campaign. Locally born, he was a trainee at the Vetch Field and made his League debut in Swansea's 2-2 draw at home to Lincoln City in April 1985. He turned pro in July 1986 and helped Swansea win the West Wales Senior Cup in 1987, netting three goals in 41 League outings before moving to Newport County in July 1988 until their demise. Subsequently with Merthyr Tydfil and various Welsh League clubs, he ended his playing career with Port Tennant Colts and still lives in Swansea.\n\nRICHIE APPLEBY\n\nEx-England Youth winger Richie Appleby featured in Swansea's 1999-2000 Third Division title triumph. The younger brother of Matt Appleby, he turned pro with Newcastle in August 1993 and had a spell with Ipswich before moving to the Vetch in August 1996. He helped Swansea qualify for the promotion play-offs in 1996-97 and 1998-99, netting 11 goals in 120 League games before reuniting with Jan Molby at Kidderminster in November 2001. Was back with Molby at Hull and Kidderminster again before spells at Forest Green Rovers and Llanelli.\n\nWARREN ASPINALL\n\nMuch-travelled England Youth midfielder Warren Aspinall had a loan spell at Swansea during the 1993-94 season. Turned pro with Wigan and moved to Everton for £150,000 in 1986, then Aston Villa for £300,000 in 1987. He joined Portsmouth for £315,000 in 1988 and was loaned to Swansea in October 1993. He made five League appearances while at the Vetch, then played for Bournemouth, Carlisle, Brentford, Colchester and Brighton.\n\nJOEL ASORO\n\nMaking the switch from Sunderland’s academy for the Swans academy, the young Swedish striker broke into the first team in the 2018-19 campaign, appearing 15 times in all competitions. Asoro was loaned out twice during his time at Swansea to gather more first team experience, making 17 appearances for Eredivisie side FC Groningen scoring three goals, before turning out for Italian side Genoa. Asoro joined Swedish side Djurgardens IF after leaving the Swans.\n\nPAUL ATKINSON\n\nWinger Paul Atkinson had two separate loan spells at Swansea. Signing pro for Oldham in 1979, he was ever-present in 1982-83. He joined Watford for £175,000 in 1983 and featured in the 1984 FA Cup final, returning to Oldham in 1985. Initially loaned to Swansea in December 1986, he returned on loan in March 1987 and netted three goals in 18 League games overall. He moved to Burnley in July 1988, then Northwich Victoria, Belgian side Binchoise, Altrincham, Frickley and Farsley Celtic.\n\nBRIAN ATTLEY\n\nVersatile full-back Brian Attley featured in Swansea's 1980-81 promotion and Welsh Cup double success. Signing pro for Cardiff in 1973, he helped them win promotion in 1975-76 and reach the FA Cup fifth round in 1976-77. He moved to the Vetch for £20,000 in February 1979 and briefly played in the top-flight, netting six goals in 89 League games for Swansea before being sold to Derby for £25,000 in February 1982. Following a loan spell at Oxford, he joined Gresley Rovers in 1984, then Stapenhill.\n\nKEVIN AUSTIN\n\nTrinidad & Tobago international defender Kevin Austin starred in Swansea's 2004-05 promotion campaign. He impressed with Saffron Walden prior to joining Leyton Orient in August 1993 and was sold to Lincoln for £30,000 in July 1996. Ever-present in their 1997-98 promotion success, he joined Barnsley in July 1999 but was sidelined by an Achilles injury. He had spells with Brentford and Cambridge before reuniting with John Still at Bristol Rovers in July 2002. Moving to Swansea in July 2004, he helped them qualify for the play-offs.\n\nJORDAN AYEW\n\nGhana international Jordan followed in the footsteps of elder brother Andre when he joined the Swans from Aston Villa in January 2017 in a player exchange deal that saw Neil Taylor and a small fee go the other way. With the Swans relegated at the end of a difficult 2017-18 season that saw three different managers in charge of the club, Jordan joined Premier League club Crystal Palace on loan for the 2018-2019 season. That loan move was made permanent in the summer of 2019. Jordan had started his career at Marseille before a loan move to Sochaux and a permanent switch to Lorient prior to his 2015 transfer to Villa.\n\nANDRE AYEW\n\nThe Ghanaian international first arrived in SA1 in the summer of 2015 on a free transfer. Scoring three goals in his first four league appearances, his form continued to make an immediate impact for the Swans which earned him Premier League Player of the Month in August 2015. The following season, Ayew signed for West Ham United for a then club record fee of £20.5 million. The winger went on to score 12 goals in 50 appearances for the Hammers before returning to Swansea in 2018. Ayew helped the Swans reach the play-offs in consecutive seasons, finishing both the 2019-20 and 2020-21 seasons as the club’s top scorer with 15 and 16 goals respectively.\n\nB\n\nMARK BAKER\n\nWelsh U-21 striker Mark Baker featured in Swansea's 1978-79 promotion campaign. Locally born, he signed pro for Swansea in September 1978 and was given his League debut in the 2-1 defeat at Chesterfield the following month. He scored twice in Swansea's 3-2 win at home to Mansfield but failed to maintain a first-team slot behind Alan Curtis and made 11 League appearances overall before joining Merthyr in 1980. He played extensively in the Welsh League for Haverfordwest, Llanelli (twice), Maesteg, Port Talbot and Morriston.\n\nCOURTNEY BAKER-RICHARDSON\n\nAfter an impressive season for Leamington in the Southern League Premier Division, scoring 28 times in 74 appearances, the young English striker joined the Swans on a two-year deal. Baker-Richardson made 21 appearances for the Jacks, scoring four time including a goal in the penultimate game of the 2018-19 season against Blackburn Rovers. At the conclusion of his Swans’ deal, Courtney joined Newport County.\n\nPETA B'ALAC\n\nGoalkeeper Peta B'alac had a loan spell at Swansea during the 1973-74 season. A former Plymouth apprentice, he turned pro in December 1971 and was given his League debut in the following month's 4-0 victory at home to York. He contested a first-team slot with Jim Furnell and was loaned to Swansea in September 1973, making four consecutive Fourth Division appearances while at the Vetch. Later playing in South Africa for 12 years, mainly for Johannesburg-based Kaiser Chiefs, he also played for Torrington.\n\nJOHNNY BARBER\n\nWinger Johnny Barber understudied Cyril Beech while at the Vetch. A former Arsenal amateur, he joined Swansea initially on trial in 1950 and made his League debut in the 2-2 draw at home to Doncaster the following month. He played four successive Second Division games in place of the injured Beech and also helped Swansea reserves win the Welsh League First Division title in 1950-51. Moving to Walsall in July 1951, he was unable to prevent them having to seek re-election in 1951-52 and later played for Hereford, Burton Albion and Brush Sports. He died in Lichfield in September 2002.\n\nKEITH BARBER\n\nBrave goalkeeper Keith Barber was an important figure in Swansea's 1977-78 promotion success. Initially with Dunstable, he joined Luton in 1971 and helped them win promotion to the top-flight in 1973-74. He was ever-present in 1975-76 but lost his place after injury and moved to Swansea in July 1977. Making 42 Fourth Division appearances while at the Vetch, he was loaned to Cardiff City in September 1978, then played for Bridgend.\n\nDAVID BARNHOUSE\n\nWelsh U-21 defender David Barnhouse provided reliable cover for Steve Jenkins while at Swansea. Locally born, he was a trainee at the Vetch and made his League debut in Swansea's 3-0 defeat at Hull on the final day of the 1991-92 season. He turned pro in July 1993 and helped take Middlesbrough to an FA Cup third round replay in 1994-95, playing 23 League games for Swansea prior to joining Merthyr in August 1996. Moving to Carmarthen soon afterwards, he gained Welsh Semi-Pro recognition and played in the 1999 Welsh Cup final. He also played for Haverfordwest.\n\nJAMIE BARNWELL-EDINBORO\n\nYoung striker Jamie Barnwell-Edinboro had a loan spell at Swansea during the 1995-96 campaign. Signing professional for Coventry in 1994, he made his Premiership debut in their 2-1 defeat at Middlesbrough in September 1995. He was loaned to Swansea in December 1995 and made four League appearances while at the Vetch. Moving to Cambridge in March 1996, he joined Stevenage Borough in July 1998 and later played for Doncaster, Goole, North Ferriby, Denaby, Brigg, Goole again and Hall Road Rangers.\n\nDANNY BARTLEY\n\nEx-England Youth international left-back Danny Bartley starred as Swansea City won promotion in two consecutive seasons under John Toshack. Signing professional for Bristol City in October 1964, he gained a regular first-team slot as a winger and joined Swansea in a joint £12,000 deal with Dave Bruton August 1973. He netted eight goals in 198 League games while at the Vetch Field before moving to Hereford United in March 1980, then played for TrowbridgeTown, Forest Green Rovers, Maesteg Park, Port Talbot, Bridgend and Llanelli. Still living in Swansea.\n\nDANNY BARWOOD\n\nWelsh Youth international winger Danny Barwood was a Swansea City trainee who made his League debut as a 16 year-old in the 2-0 victory at home to HullCity in January 1998. He possessed electrifying pace and strength on the ball, scoring his solitary goal in three Third Division games in Swansea's 2-0 win over Chester City two months later. In March 1998 he played for Wales U-18 in the Paolo Valenta Tournament in Italy. He had a trial with Cardiff City before moving to Merthyr Tydfil in November 2000 but failed to make an impact and decided to switch codes, following his father Adrian Barwood into Rugby Union.\n\nMIKE BASHAM\n\nEngland Youth international central defender Mike Basham featured in Swansea City's 1994 Autoglass Trophy final triumph. Signing professional for West Ham in July 1992, he made his League debut on loan to Colchester before joining Swansea initially on loan in March 1994. He helped to beat Middlesbrough in the 1994-95 FA Cup third round replay and scored once in 29 League games prior to joining Peterborough United in December 1995. Moving to Barnet in August 1997, he featured as they qualified for the play-offs in 1997-98 and 1999-2000. He subsequently played for York City, Chelmsford City and Thurrock.\n\nGUILLEM BAUZA\n\nBauza, more fondly known as ‘Bussy’ was one of Roberto Martinez’s first signings in the summer of 2007. The Spaniard arrived from Espanyol on a one-year deal and featured for Spain in their Under-16 European Championship winning team, playing alongside Fernando Torres. Also a qualified teacher, he was a wholehearted player who never gave anything less than 100 per cent during his time at the Liberty. He famously scored some vital goals for the club, including a brace at Gillingham in April 2008 that guaranteed promotion to the Championship. After extending his stay in SA1 for a further two seasons, Bauza departed the Swans in May 2010 after 68 appearances (35 as sub) and 16 goals, going on to feature for Hereford, Northampton, Exeter City and Port Talbot in the League of Wales.\n\nMARCUS BEAN\n\nYoung midfielder Marcus Bean had two separate loan spells at Swansea City. A former QPR scholar, he helped them reach the Second Division play-off final in 2002-03, then win promotion in 2003-04. He turned professional in July 2004 and joined Swansea on loan at the same time as his team-mate Kevin McLeod was signed for £60,000 in February 2005. Featuring in that promotion campaign, he was recalled by QPR during an injury crisis two months later but re-joined Swansea on loan in September 2005 and scored once in 17 League games overall for the club. He moved from QPR to Blackpool in January 2006.\n\nCRAIG BEATTIE\n\nBeattie was a former Rangers schoolboy who made his name with arch-rivals Celtic. The striker made his Champions League debut in a qualifier against FB Kaunas in 2003, eventually going on to score 16 goals in 43 games for the Hoops. That form earned him a move to West Brom in July 2007, but following a bout of injuries he joined the Swans in August 2009 as a replacement for Jason Scotland. Injuries also hampered his time at the Liberty, although he was part of the squad that won promotion to the Premier League in 2011 before being released after 46 appearances (24 as sub) and seven goals. After a spell with Hearts in the SPL, Beattie joined Hearts, St Johnston, Barne and Dundee.\n\nJOEY BEAUCHAMP\n\nFlying winger Joey Beauchamp had a loan spell at Swansea City during the 1991-92 season. Signing professional for Oxford United in May 1989, he was loaned to Swansea in October 1991 and scored once in seven League games whilst at the Vetch Field. He starred in Oxford's 1993-94 FA Cup run and was sold to West Ham for £1,000,000 in June 1994. Moving to Swindon Town in a deal involving Adrian Whitbread just two months later, he re-joined Oxford for £75,000 in October 1995 and starred in their 1995-96 promotion success. He was top scorer in 1997-98 and subsequently played for Abingdon and Didcot Town.\n\nCYRIL BEECH\n\nHard-working winger Cyril Beech scored in Swansea's 1950 Welsh Cup final triumph. Previously with Merthyr Tydfil, he moved to the Vetch Field for £6,000 in August 1949 and was Swansea's leading marksman in 1949-50. He played alongside his older brother Gilbert and netted 29 goals in 136 Second Division games for Swansea prior to joining Worcester City in August 1954, then reunited with Billy Lucas at Newport County in July 1955. Moving to Hereford United in March 1957, he later played for Merthyr again, Brecon Corinthians and Brierley Hill. He became a coach driver and died in Merthyr in May 2001.\n\nGILBERT BEECH\n\nLong-serving left-back Gilbert Beech featured in Swansea's 1950 Welsh Cup final success. He starred as Merthyr Tydfil won the Southern League and Cup 'double' in 1947-48, then beat Swansea in the 1949 Welsh Cup final. Moving to the Vetch Field for £5,000 in November 1949, he was ever-present in two consecutive seasons and contested a first-team slot with Dai Thomas. He netted three goals in 157 League games for Swansea before re-joining Merthyr in July 1958, then reunited with his brother Cyril at Hereford United and Brecon Corinthians.\n\nALAN BEER\n\nFormer Welsh Amateur international striker Alan Beer was a young member of Roy Bentley's squad at Swansea City. He played local football for Tower United and West End before signing professional for Swansea in February 1971, netting three goals in 15 Third Division games while at the Vetch Field. Joining Weymouth in August 1972, he featured in their 1973 Southern League Cup final triumph. He joined Exeter City for £8,000 in November 1974 and starred in their 1976-77 promotion success. A knee injury ended his playing career soon after and he became Exeter's coach.\n\nJAN BEKKER\n\nStriker Jan Bekker featured in Swansea City's 1975 West Wales Senior Cup final triumph. Born in Cardiff of a Dutch father, he played for Roath Rangers, Cardiff Corries and was leading marksman as Everwarm (Bridgend) won the Welsh League title in 1972-73. He moved to the Vetch Field in February 1975 and contested a first-team slot with Geoff Bray, netting four goals in 20 Fourth Division games for Swansea prior to re-joining Bridgend in August 1976. Later player-boss of Tondu Robins, he also managed Garw Athletic to promotion.\n\nALF BELLIS\n\nExperienced winger Alf Bellis helped Swansea to reach the FA Cup fifth round in 1951-52. Initially with Shell Juniors and Burnell's Ironworks, he joined Port Vale in March 1938 and scored on his League debut in their 4-1 win over Rochdale the following month. He guested for Rochdale, Manchester United, Manchester City, Lincoln City and Notts County during the war and joined Bury in exchange for Walter Keeley plus £4,000 in January 1948. Moving to Swansea in August 1951, he netted 11 goals in 41 League games prior to joining Chesterfield in August 1953, then played for Rhyl, Colwyn Bay and Penmaenmawr.\n\nDEREK BELLOTTI\n\nMuch-travelled keeper Derek Bellotti briefly succeeded Tony Millington in Swansea City's goal. A former QPR apprentice, he followed Basil Hayward from Bedford Town to Gillingham in July 1966 and joined Charlton Athletic for £5,000 in October 1970. He moved to Southend United in December 1971 and helped them win promotion that season. Harry Gregg paid £3,000 for him in May 1974 and he made 19 Fourth Division appearances for Swansea prior to joining Maidstone United in July 1975, then played for Falmouth, Bideford and Torrington.\n\nDAVID BERESFORD\n\nEx-England Youth international winger David Beresford had a loan spell at Swansea City during the 1995-96 season. Signing professional for Oldham Athletic in July 1994, he was loaned to Swansea in August 1995 and made six League appearances while at the Vetch Field. He joined Huddersfield for £350,000 in March 1997 and starred as they reached the FA Cup fifth round in 1998-99, moving to Hull City in July 2001 Following spells at Plymouth and Macclesfield he reunited with Brian Little at Tranmere in November 2003 subsequently returned to Macclesfield in 2005.\n\nFEDE BESSONE\n\nRoberto Martinez signed the Argentine defender, formerly of Barcelona, Tarragona and Espanyol, on a free transfer in 2008. Bessone played for the Swans for two full seasons before leaving for Leeds United in the summer of 2010. However, he found it difficult to hold down a regular place at Elland Road and following a brief loan spell at Charlton, Bessone returned to the Liberty on a free transfer in August 2011. He acted as cover for Neil Taylor during our debut Premier League season and was released in 2012 after just two appearances, taking his total to 42 (four as sub) and one goal. He later went on to feature for Swindon, Oldham Kansas City and Millwall.\n\nPAUL BEVAN\n\nVersatile midfielder Paul Bevan was a member of Harry Gregg's squad at Swansea City. Signing professional for Shrewsbury Town in October 1970, he made his League debut in that month's 2-0 defeat at Halifax Town and followed Gregg to the Vetch Field for £5,000 in August 1973. He netted five goals in 80 League games for Swansea before reuniting with Gregg again at Crewe Alexandra in July 1975. Moving to Worcester City in March 1980, he later played for Newtown in Welsh football.\n\nALFIE BIGGS\n\nCentre-forward Alfie Biggs played for Swansea during the 1968-69 season. Initially with Bristol Rovers, he was ever-present in 1956-57 and moved to Preston for £18,000 in July 1961. Sold to Walsall for £10,000 in March 1968, he joined Swansea in exchange for Jimmy McMorran in October 1968 and netted four goals in 16 Fourth Division games before reuniting with Doug Hillard at Taunton Town in July 1969.\n\nJOHNNY BIRD\n\nExperienced left-back Johnny Bird contested a first-team slot with Vic Gomersall whilst at Swansea. Signing professional for Newport County in November 1957, the Welsh Schoolboy international made his League debut as a 16 year-old and was a Welsh Cup finalist in 1963. He played nearly 300 games for Newport, reuniting with Billy Lucas at the Vetch Field in July 1967 and making eight Fourth Division appearances for Swansea prior to joining John Charles' Hereford United in July 1968. Subsequently with Merthyr Tydfil, Caerau and Pontyclun's player-boss.\n\nTONY BIRD\n\nWelsh U-21 striker Tony Bird featured in Swansea City's 1999-2000 Third Division title triumph. A former Cardiff City trainee, he helped them win the Third Division title in 1992-93 and moved to Barry Town in January 1996. He starred in two League of Wales title successes as well as their 1997 Welsh Cup final triumph. Jan Molby paid £60,000 for him and Dave O'Gorman in August 1997 and he was Swansea's top scorer in 1997-98, netting 18 goals in 86 League games before reuniting with Molby at Kidderminster Harriers in July 2000. He also played for St Patricks, Drogheda, Bath City and Haverfordwest.\n\nJOHN BLACK\n\nFormer Welsh Schoolboy goalkeeper John Black played for Swansea in the 1964-65 Welsh Cup semi-final. Signing professional for Arsenal in February 1963, he helped them win the Football Combination title that season but failed to secure a first-team slot and moved to the Vetch Field in December 1964. He made his League debut in place of Ronnie Briggs in Swansea's 4-0 win at home to Preston three months later and played 15 League games prior to joining Worcester City in November 1965, then played for Ammanford.\n\nDEREK BLACKBURN\n\nCentral defender Derek Blackburn understudied Dudley Peake whilst at Swansea. He had spells with Burnley and Chesterfield without making any first-team appearances and moved via Ossett Town to the Vetch Field for £1,500 in January 1957. Given his League debut in Swansea's 4-0 defeat at home to Blackburn Rovers in September 1957, his only other Second Division appearance was in the 3-1 reverse against Rotherham two months later. He joined Yeovil Town in July 1958 and helped win the Southern League Cup in 1961.\n\nPETER BODAK\n\nMuch-travelled midfielder Peter Bodak featured in Swansea City's 1987-88 Fourth Division play-off final triumph. Initially with Coventry City, he helped them reach the League Cup semi-finals in 1980-81 and moved to Manchester United in July 1982. He joined rivals Manchester City five months later, then played for Royal Antwerp and Seiko prior to joining Crewe Alexandra in December 1986. Terry Yorath signed him in March 1988 and he netted four goals in 31 League outings for Swansea before returning to Hong Kong with Happy Valley in May 1989. He subsequently played for Walsall and Atherstone United.\n\nFERRIE BODDE\n\nSigned in the summer of 2007 from Dutch side ADO Den Haag, Bodde went on to become a firm fans favourite at the Liberty Stadium. The tough-tackling midfielder attracted interest from various clubs in Europe but Bodde opted to ply his trade in south west Wales, along with former team-mate Dorus De Vries. He was a star performer in a Swansea side that ran away with the League One title in his first full season at the club, and was labelled as the Dutch Roy Keane on more than one occasion. Had the ability in midfield to spray the ball all over the pitch at will and score spectacular goals. However, a seemingly innocuous challenge against Birmingham in November 2008 resulted in cruciate ligament damage and despite two operations and trying numerous comebacks, the player was forced to retire from football in his prime after 59 appearances (three as sub) and 14 goals.\n\nPHIL BOERSMA\n\nMidfielder Phil Boersma (above left) was an experienced figure in Swansea City's 1978-79 promotion success. Signing professional for Liverpool in September 1966, he helped them win the League Championship and UEFA Cup in 1972-73 and was sold to Middlesbrough for £72,000 in December 1975. He joined Luton Town for £35,000 in August 1977 and reunited with John Toshack at the Vetch Field for a similar fee in September 1978. Scoring once in 18 League games for Swansea until breaking his ankle at Swindon in April 1979, he became Swansea's assistant manager.\n\nCHAD BOND\n\nThe Neath-born forward was a Welsh Semi-Pro international, who had loan spells with CF Balaguer, Ostersunds and Newport County during his time with the Swans after signing in July 2005. A hard-working striker, he found it difficult to get first team games and made his only league appearance at Coventry City in 2009, and featuring in a League Cup tie at home to Scunthorpe. Upon his release at the end of the 2009-10 season he signed for Port Talbot Town in the Welsh Premier League.\n\nMATTHEW BOUND\n\nRugged central defender Matt Bound was an important figure in Swansea City's 1999-2000 Third Division title triumph. Signing professional for Southampton in May 1991, he had limited Premiership opportunities and joined Stockport County for £100,000 in October 1994. He featured in their 1996-97 promotion campaign and moved to Swansea for £55,000 in November 1997, helping to qualify for the Third Division play-offs in 1998-99. Starring alongside Jason Smith, he scored nine times in 174 League games prior to joining Oxford United in December 2001. He later played for Weymouth and Eastleigh.\n\nFABIO BORINI\n\nBrought in to the club on loan from Chelsea by manager Brendan Rodgers at the end of the 2011 season, Borini immediately hit the headlines by scoring twice on his debut against Nottingham Forest. The striker joined Chelsea from Bologna in 2007 but found it hard to break into the first team, making only four appearances in four years. But having worked with Rodgers during his time at Stamford Bridge, he jumped at the chance to play regularly in the first team at the Liberty and didn't disappoint during his short time at the club with six goals from 12 appearances (one as sub). He played his final Swans game at Wembley in the Championship Play-Off Final in 2011, and was later reunited with Rodgers at Liverpool after a big-money move.\n\nJASON BOWEN\n\nWelsh international winger Jason Bowen starred in Swansea City's 1994 Autoglass Trophy final triumph. A former trainee at the Vetch Field, he turned professional in July 1990 and helped Swansea reach the Second Division play-offs in 1992-93. He was leading marksman in 1993-94 and scored 26 times in 124 League games before being sold to Birmingham City for £350,000 in July 1995. Featuring in their 1995-96 Coca-Cola Cup run, he joined Reading for £200,000 in December 1997 and reunited with Frank Burrows at Cardiff City in January 1999. Helping them win promotion three times, he also played for Newport County and Llanelli.\n\nWALTER BOYD\n\nJamaican international striker Walter Boyd featured prominently in Swansea City's 1999-2000 Third Division title campaign. 'The Pearl' starred for Jamaican side Arnett Gardens and played for his country in the 1998 World Cup, then had a spell with Colorado Foxes in the United States before John Hollins signed him in October 1999. He scored twice on his League debut in Swansea's 2-0 win at home to Rotherham United but suffered injury problems during his time at the Vetch Field.\n\nTERRY BOYLE\n\nFormer Welsh international central defender Terry Boyle played for Swansea City during the 1989-90 campaign. Signing professional for Tottenham Hotspur in November 1975, he joined Crystal Palace in January 1978 and was swapped for Bristol City's Kevin Mabbutt in October 1981. He moved via Newport County to Cardiff City for £22,500 in August 1986 and featured in their 1987-88 promotion and Welsh Cup 'double' success. Reuniting with Ian Evans at Swansea for £11,000 in August 1989, he scored once in 27 League games before moving to Merthyr Tydfil in August 1990. He has also coached various Welsh clubs.\n\nLEE BRACEY\n\nGoalkeeper Lee Bracey was a key figure in Swansea City's 1989 Welsh Cup final triumph. Signing professional for West Ham in July 1987, he moved to the Vetch Field in August 1988 and helped Swansea take Liverpool to an FA Cup third round replay in 1989-90. He made 99 League appearances prior to joining Halifax Town for £47,500 in October 1991, missing just one match during their fateful 1992-93 campaign. Sold to Bury for £20,000 in August 1993, he was a promotion winner in 1995-96 and joined Ipswich Town in August 1997. He also played for Hull City, Ossett Town, Chorley and Mossley.\n\nFEBIAN BRANDY\n\nSigned on loan from Manchester United in January 2008, Brandy played his part in the Swans’ League One title success. He returned to the Liberty for a further six months at the start of the 2008-09 season, despite being used as a substitute for most of his time at the club. After leaving the Swans following 39 appearances (33 as sub) and three goals, he featured for Hereford, Gillingham, Notts County, Walsall and Sheffield United.\n\nGEOFF BRAY\n\nStriker Geoff Bray was Swansea City's leading marksman in 1975-76. A former Gillingham junior, he played for Erith & Belvedere before joining Oxford United in July 1971 and made his League debut in their 2-0 defeat at Huddersfield in September 1972. Harry Griffiths signed him in July 1975 and he scored 19 times in 46 Fourth Division outings for Swansea prior to joining Torquay United in November 1976. He moved to Dartford in July 1977 and topped their goalscoring charts in 1977-78.\n\nPAUL BRAYSON\n\nEngland Youth striker Paul Brayson helped Swansea City qualify for the Third Division play-offs in 1996-97. Signing professional for Newcastle United in August 1995, he was loaned to Swansea in January 1997 and scored five times in 11 Third Division games whilst at the Vetch Field. He moved to Reading for £100,000 in March 1988 but was unable to prevent relegation that season and joined Cardiff City in March 2000, helping them win promotion in 2000-01 and reach the Second Division play-offs in 2001-02. Joining newly promoted Cheltenham Town in August 2002 and then Northwich Victoria.\n\nDEREK BRAZIL\n\nRepublic of Ireland U-21 defender Derek Brazil had a loan spell at Swansea City during the 1991-92 campaign. He played for Rivermount Boys Club prior to joining Manchester United in March 1986 and was loaned to Swansea in September 1991, scoring once in 12 League games whilst at the Vetch Field. He joined Cardiff City for £85,000 in August 1992 and starred in their 1992-93 Third Division title and Welsh Cup 'double' success. Moving to AFC Newport in August 1996, he helped Cabletel win the 1999 Welsh Cup final and played and managed Haverfordwest.\n\nRHIAN BREWSTER\n\nLiverpool youth star Rhian Brewster joined the Swans in January 2020 on loan for the remainder of the season, reuniting with former manager Steve Cooper with whom he won the under-17 World Cup title with England. The striker made his debut in the south Wales derby which ended in a goalless draw before scoring the winning goal against Wigan Athletic on home turf a week later. Brewster ended the campaign with 11 goals in 22 appearances before securing a permanent move to Sheffield United.\n\nSAM BRIDDON\n\nWing-half Sam Briddon played for Swansea either side of the Second World War. Initially with Port Vale, he played for Stanton Hill and Devessall before re-joining Port Vale in February 1933 and joined Brentford in August 1935. He gained top-flight experience whilst at Griffin Park and moved via Swindon Town to Swansea in July 1939, featuring in the first three matches of the aborted 1939-40 League campaign. A wartime guest for Bolton and West Ham, he appeared in Swansea's first post-war League game and played 18 Third Division (South) games before retiring. He became a miner and died in Mansfield in June 1975.\n\nRONNIE BRIGGS\n\nNorthern Ireland international goalkeeper Ronnie Briggs starred as Swansea reached the FA Cup fifth round in 1964-65. Signing professional for Manchester United in March 1960, he had limited top-flight opportunities behind Harry Gregg and moved to the Vetch Field in May 1964. He understudied Noel Dwyer and made 27 Second Division appearances for Swansea prior to joining Bristol Rovers in May 1965, then played for Minehead, Frome Town, Glastonbury and Taunton Town until a hand injury ended his career. Sadly, Ronnie passed away in August, 2008.\n\nSTEVE BRODIE\n\nHard-working midfielder Steve Brodie helped Swansea City win the West Wales Senior Cup in 2002. Signing professional for Sunderland in July 1991, he failed to secure a regular first-team slot and was loaned to Doncaster Rovers before joining Scarborough in December 1996. He starred as they qualified for the Third Division play-offs in 1997-98 and reunited with Colin Addison at Swansea in November 2001. Scoring twice in 26 League outings, he moved to Chester City in July 2002 and was loaned to Nuneaton, Forest Green and Leigh RMI prior to joining Droylsden and Stalybridge Celtic.\n\nGRAHAM BROWN\n\nGoalkeeper Graham Brown briefly played for Swansea City during the 1976-77 campaign. He played for Millwall and Crawley Town prior to joining Mansfield Town in August 1969 and featured in their 1969-70 FA Cup run. Moving to Doncaster Rovers in July 1974, he had a spell with Portland Timbers before joining Swansea in September 1976. He made four consecutive League appearances prior to joining Southport in December 1976, then played for Portland again, York City, Rotherham United and Mansfield again.\n\nLINTON BROWN\n\nFast striker Linton Brown appeared for Swansea City in the 1996-97 Third Division play-off final. He played for Bridlington Trinity, North Ferriby, Guiseley and Halifax Town before joining Hull City in January 1993, partnering Dean Windass in their attack. Moving to the Vetch Field for £60,000 in March 1996, he was blighted by injury problems and netted three goals in 28 League outings for Swansea. He was loaned to Scarborough prior to joining Emley in March 1998, then reunited with several former Hull players at Gainsborough Trinity.\n\nTOMMY BROWN\n\nEx-England Youth defender Tommy Brown helped Swansea win the West Wales Senior Cup in 1956. Initially with South Liverpool, he joined Doncaster Rovers in February 1951 and made his League debut in their 2-0 win at home to Leeds United seven months later. He was a regular in their Second Division side before moving to Llanelly in July 1954, returning to League action with Swansea for £7,500 in November 1955. Alternating between right-back and right-half whilst at the Vetch Field, he made 68 Second Division appearances for Swansea until leaving in May 1959.\n\nDAVE BRUTON\n\nCentral defender Dave Bruton was Swansea City's 'Player of the Year' in 1973-74. Signing professional for BristolCity in July 1971, he moved to Swansea with Danny Bartley in a £12,000 deal in August 1973 and featured in the 1976-77 promotion near-miss. He helped Swansea win promotion the following season and scored 19 times in 192 League outings before being sold to Newport County for £15,000 in October 1978. Starring as they won promotion in 1978-79 and were ECWC quarter-finalists in 1979-80, he later played for Gloucester City.\n\nKEVIN BUDD\n\nFull-back Kevin Budd briefly played for Swansea City during the 1985-86 season. A former Bournemouth apprentice, he followed John Benson to Norwich City in October 1979 and Manchester City in February 1981. He played for hometown Hillingdon before reuniting with John Bond at Swansea on a non-contract basis in November 1985. After impressing in the reserves, he made his League debut in that month's 3-1 defeat at home to Bristol City but suffered an ankle injury and by the time he was fit again Bond had been a victim of economy cuts.\n\nRON BURGESS\n\nFormer Welsh international wing-half Ron Burgess had a spell as Swansea's player-manager. Initially with Cwm Villa, he joined Tottenham Hotspur in May 1936 and captained the 'Push & Run' side to the Second Division title in 1949-50 and League Championship in 1950-51. He was capped 32 times and moved to Swansea as player-coach in August 1954, succeeding Billy McCandless as player-boss a year later. Scoring once in 46 Second Division games, he resigned in August 1958 and subsequently managed Watford, Hendon, Bedford Town and Harrow Borough. He resided in Swansea until his death in February 2005.\n\nCHRIS BURNS\n\nMidfielder Chris Burns had two spells with Swansea City. He began with Cheltenham Town and moved to Portsmouth for £25,000 in March 1991. Ever-present as Pompey reached the FA Cup semi-finals in 1991-92, he also helped qualify for the First Division play-offs in 1992-93 and reunited with Frank Burrows on loan to Swansea in December 1993. He re-joined the Swans in November 1994 and made nine League appearances before moving to Northampton Town in January 1995. Later with Gloucester City, he played for Forest Green in the 2001 FA Trophy final and was player-boss of Gloucester and Cinderford.\n\nFRANK BURNS\n\nWing-half Frank Burns was ever-present in two consecutive seasons including Swansea's 1948-49 Third Division (South) title triumph. A former Wolves amateur, he moved to the Vetch Field in August 1944 and helped Swansea win the London Combination Cup in 1947. He was a tenacious tackler with good positional sense and scored nine times in 172 League outings for Swansea prior to joining Southend United in July 1952. Moving to Crewe in November 1956, he joined Cheltenham Town in July 1958, then played for Margate.\n\nFINLEY BURNS\n\nThe Manchester City teenager arrived on loan in January 2022 but found game time hard to come by in a fairly settled Swans back three. He made just three appearances for the Swans, and spent most of his time on the bench. He returned to City at the end of the season.\n\nPAUL BURROWS\n\nWelsh Youth striker Paul Burrows briefly appeared for Swansea City during the 1985-86 campaign. Locally born, he was an apprentice at the Vetch Field and made his League debut in Swansea's 5-1 victory at Wolves a month before turning professional in October 1985. He scored in the 2-1 FA Cup second defeat at home to Bristol Rovers and played three League games overall prior to joining Haverfordwest in 1987. Later with Barry Town, Inter Cabletel, Briton Ferry, Carmarthen and Haverfordwest and still lives in Swansea.\n\nTOM BUTLER\n\nSigned from Hartlepool United in August 2006, the winger enjoyed spells at Sunderland and Dunfermline before going out on loan at Darlington. Twice capped by the Republic of Ireland, Butler was a first team regular for four years before injuries dogged his final season at the Liberty. A hard-working player who gained a reputation for his off the cuff humour in and around the dressing room, he was a player who would always be remembered fondly by fans and colleagues alike for his effort on and off the pitch. He made 145 appearances (59 as sub) and scored 19 goals before being forced to hang up his boots at the age of 31 because of a persistent thigh injury.\n\nSHAUN BYRNE\n\nRepublic of Ireland U-21 left-back Shaun Byrne had a loan spell at Swansea City during the 2003-04 season. A former West Ham trainee, he signed professional at Upton Park in July 1999 and made his Premiership debut in their 2-2 draw at Newcastle United six months later. He was loaned to Bristol Rovers in January 2000, then followed Leon Britton and Izzy Iriekpen to Swansea on loan in January 2004, making nine Third Division appearances whilst at the Vetch Field. Moving to Dublin City in August 2004, he joined Chesham United in January 2005 and also played for Burnham and Hemel Hempstead.\n\nC\n\nIAN CALLAGHAN\n\nFormer England international midfielder Ian Callaghan was an experienced figure in Swansea City's 1978-79 promotion campaign. He made a record 640 League appearances for Liverpool, starring in five League Championship successes, two FA Cup final triumphs and also helping to win the European Cup and UEFA Cup. He was Footballer of the Year in 1974 and awarded the MBE, reuniting with John Toshack at the Vetch Field in September 1978. Scoring once in 76 League outings for Swansea, he had spells with Cork Hibernians and Soudifiord before joining Crewe in October 1981.\n\nDANNY CANNING\n\nWelsh goalkeeper Danny Canning helped Swansea clinch the Third Division (South) title in 1948-49. Initially with Abercynon, he joined Cardiff City in July 1945 and featured prominently in their 1946-47 Third Division (South) title triumph. He moved to Swansea for £3,000 in January 1949 and contested a first-team slot with Jack Parry, making 47 League appearances before being sold to Nottingham Forest for £2,000 in July 1951. Later with Great Yarmouth, Newport County and Abergavenny.\n\nTOM CARROLL\n\nAfter a successful loan spell at Swansea City during the 2014-15 campaign, Carroll returned to the club on a three-and-a-half-year deal from Tottenham Hotspur in January 2017. During his first game as a permanent Swan, he helped the squad to a first ever away league win at Anfield. The midfielder scored his first goal for the club in a vital relegation battle against Stoke City in 2017. During his time at the Swans, Carroll enjoyed a short loan spell at Aston Villa before suffering a hip injury in the 2018-19 season. He made 85 appearances for the Jacks, scoring two goals.\n\nDAVE CARVER\n\nExperienced right-back Dave Carver had a loan spell at Swansea City during the 1972-73 season. Signing professional for Rotherham United in January 1962, he moved to Cardiff City for £11,000 in January 1966 and helped them reach the ECWC semi-finals in 1967-68. He featured in four successive Welsh Cup final triumphs and was loaned to Swansea in January 1973, making three League appearances whilst at the Vetch Field. Joining Hereford United in August 1973, he had a loan spell with Doncaster, then played for Retford.\n\nRYAN CASEY\n\nRepublic of Ireland U-21 winger Ryan Casey featured in Swansea City's 1999-2000 Third Division title campaign. A former trainee at the Vetch Field, he made his League debut in Swansea's 1-0 defeat at Leyton Orient seven months before signing professional in May 1997. He regularly featured as a substitute but was unlucky with injuries. Able to deliver quality crosses from the left flank, he returned from a loan spell at Merthyr Tydfil to score twice in 62 League games for Swansea before reuniting with Tony Bird at Irish side St Patrick's in August 2002. Later with Cork City and Galway United.\n\nBRIAN CASH\n\nRepublic of Ireland U-21 winger Brian Cash had a loan spell at Swansea City during the 2002-03 season. A former Nottingham Forest trainee, he signed professional in December 1999 and was given his League debut in their 3-1 victory at Stockport County in February 2002. He had few opportunities at the City Ground and was loaned to Swansea in October 2002, making five Third Division appearances whilst at the Vetch Field. Following a similar loan period at Rochdale, he briefly joined Bristol Rovers on a non-contract basis in December 2004, then played for Hearts and Derry City.\n\nSTEVEN CAULKER\n\nCaulker joined the Swans in the summer of 2011 on a season long loan from Tottenham Hotspur. A central defender at the tender age of 19, he was loaned out to Bristol City in 2010, impressing so much that he won their Player of the Year award with some outstanding performances. His previous loan spell was with Yeovil Town in 2009-10, playing 46 games for the club and representing England in the Under-19 European Championships that same year. Caulker ended up having an exceptional season with the Swans, teaming up with Ashley Williams in the heart of the defence in the club’s inaugural Premier League season before returning to Spurs after 26 appearances. Capped by England at senior level in November 2012, Caulker signed for newly-promoted Cardiff at the start of the 2013-14 season.\n\nBERSANT CELINA\n\nKosovan midfielder Bersant Celina began his professional career at Manchester City, making four appearances before being loaned to Eredivisie side FC Twente and Championship side Ipswich Town. Celina joined the Jacks in the summer of 2018 on a four-year deal. Brought up in Norway, he represented Norway as a youth before switching to represent Kosovo in 2013. He appeared 77 times in all competitions for the Swans, scoring 10 goals in total including a goal against his former side Manchester City in the 2019 FA Cup quarter final.\n\nPAUL CHALMERS\n\nEx-Scotland Youth striker Paul Chalmers featured in Swansea City's 1991 Welsh Cup final triumph. The son of former Celtic legend Steve Chalmers, he signed professional for Celtic in October 1980 and had a loan spell with Bradford City before being sold to St Mirren for £20,000 in September 1986. He was twice leading marksman and was valued at £124,000 when he joined Swansea with John Hughes and Keith Walker in November 1989. Scoring 13 times in 58 League outings whilst at the Vetch Field, he joined Dunfermline Athletic in August 1992, then played for Hamilton Academicals, Ayr United and East Fife.\n\nLEE CHAPMAN\n\nFormer England U-21 striker Lee Chapman ended his playing career with Swansea City. The son of Roy Chapman, he began with Stoke City and was twice top scorer prior to joining Arsenal for £500,000 in August 1982. He moved to Sunderland in December 1983, then played for Sheffield Wednesday, Niort and Nottingham Forest before moving to Leeds United in January 1990. Top scorer in their 1991-92 League Championship success, he had spells with Portsmouth, West Ham and Ipswich prior to joining Swansea in March 1996, netting four goals in seven League games until retiring.\n\nLES CHAPPELL\n\nExperienced midfielder Les Chappell starred in Swansea City's 1977-78 promotion success. Signing professional for Rotherham United in February 1965, he was leading marksman in 1966-67 and moved to Blackburn Rovers for £20,000 plus Alan Gilliver in May 1968. He joined Reading in July 1969 and was top scorer three times, moving to Doncaster Rovers in December 1974. Harry Griffiths signed him in July 1976 and he netted five goals in 67 League games for Swansea before becoming youth team coach. He later managed Farnborough and Basingstoke, then coached Torquay.\n\nSHAUN CHAPPLE\n\nWelsh U-21 midfielder Shaun Chapple featured in Swansea City's 1994 Autoglass Trophy final triumph. Locally born, he turned professional at the Vetch Field in July 1991 and made his League debut in Swansea's 3-0 defeat at Fulham two months later. He also helped the Swans qualify for the promotion play-offs in 1992-93 and 1996-97, overcoming successive injury problems to score nine times in 106 League outings. Following loan spells with Barry Town and Merthyr Tydfil, he moved to Forest Green Rovers in December 1998 and then Carmarthen Town.\n\nJEREMY CHARLES\n\nVersatile Welsh international Jeremy Charles (below) starred in Swansea City's thrilling rise under John Toshack. The son of former Swansea favourite Mel Charles, he signed professional at the Vetch Field in January 1977 and featured in several Welsh Cup final triumphs. Scoring 53 goals in 247 League games, he moved to QPR in November 1983. He joined Oxford United in February 1985 and helped to secure top-flight status that season, then win the Milk Cup in 1986. After injury ended his career, he coached Oxford United, then was football development officer at Swansea and Southampton.\n\nMEL CHARLES\n\nVersatile Welsh international Mel Charles was capped 21 times while at Swansea. The younger brother of John Charles, he signed professional for Swansea in May 1952 and played in two Welsh Cup finals, helping Wales to reach the World Cup quarter-finals in 1958. He netted 66 goals in 233 League games for the Swans before joining Arsenal for £42,750 plus Dave Dodson and Peter Davies in March 1959. Moving to Cardiff City for £28,500 in February 1962, he later played for Portmadoc, Port Vale and Haverfordwest.\n\nCHICO FLORES\n\nChico joined the Swans in July 2012 for around £2m under manager Michael Laudrup who was also his boss at Mallorca. He made his debut for the club in the opening Premier League game of the 2012 season, an incredible 5-0 away win at QPR. A talented, ball-playing central defender, he was larger than life on and off the field during a stint in SA1 that included the League Cup triumph at Wembley in 2013. The fiormer Spanish Under-21 international eventually left the Liberty Stadium in 2014 after 58 league appearances to join Lekhwiya in Doha, again under Laudrup. From there he went on to play for Granada, Rubin Kazan and Fuenlabrada. Chico - full name Jose Manuel Flores Moreno - started his professional career with hometown club Cadiz, he went on to have spells with Portuense, Barcelona B, Almeria, Genoa and Mallorca before heading to South Wales.\n\nGIORGIO CHINAGLIA\n\nBustling centre-forward Giorgio Chinaglia was capped 14 times by Italy after leaving Swansea. The son of a Cardiff Italian restaurateur, he was an apprentice at the Vetch Field and made his League debut in Swansea's 0-0 draw at home to Portsmouth two months before turning professional in April 1965. He scored once in five Second Division games overall for the Swans prior to joining Italian side Massese in July 1966, moving via Inter Napoli to Lazio in July 1969 where he was top scorer in their 1973-74 Italian title triumph. Later starring as New York Cosmos won the NASL three times, he became Lazio's president.\n\nGARY CHIVERS\n\nVersatile defender Gary Chivers played for Swansea City during the 1983-84 campaign. Initially with Chelsea, he made his First Division debut in their 2-1 victory at home to Middlesbrough in April 1979 and featured in their 1981-82 FA Cup run. He moved to the Vetch Field in August 1983 and made ten Second Division appearances for Swansea before following Jeremy Charles to QPR in February 1984. He remained in the top-flight after joining Watford in September 1987, then helped Brighton clinch promotion that season. Later with Norwegian side Lyn, Bournemouth, Stamco and Worthing.\n\nCYRUS CHRISTIE\n\nChristie joined Swans on loan from Fulham in January 2022. The Republic of Ireland international mainly occupied an attack-minded wingback role in head coach Russell Martin’s side. He made 23 appearances, scored three goals and contributed with four assists.\n\nKEVIN CLARKE\n\nRepublic of Ireland international wing-half Kevin Clarke was a member of Swansea's 1948-49 Third Division (South) title squad. He represented the League of Ireland and was capped twice with Drumcondra before joining the strong Irish contingent at the Vetch Field in November 1948. Unable to secure a regular first-team slot behind the likes of Rory Keane, Jack O'Driscoll and Roy Paul, he helped Swansea win the London Combination Cup in 1949-50 and Welsh League title in 1950-51, making ten League appearances for the Swans before being released in May 1952.\n\nMARK CLODE\n\nVersatile left-back Mark Clode was an influential figure in Swansea City's 1994 Autoglass Trophy final triumph. Signing professional for Plymouth Argyle in March 1991, he failed to secure a first-team slot and moved to the Vetch Field in July 1993. He made his League debut in Swansea's 2-1 defeat at York City the following month and helped reach the Third Division play-off final in 1996-97, scoring three times in 119 League outings for the Swans before losing his place to Michael Howard after a series of injury problems. Moving to Bath City in July 1999, he later played for Clevedon Town.\n\nSAM CLUCAS\n\nA product of the Leicester City academy, midfielder Sam Clucas signed a four-year contract with Swansea City after a two-year spell with Hull City. Clucas found the back of the net three times for the Jacks all of which came against Arsenal. Towards the end of the season, he suffered a knee injury which ended his time in SA1. He join Stoke City in the summer of 2018.\n\nJONATHAN COATES\n\nWelsh U-21 winger Jonathan Coates featured in Swansea City's 1999-2000 Third Division title triumph. The younger brother of Marc Coates, he turned professional at the Vetch Field in July 1993 and appeared for the Swans in the 1996-97 Third Division play-off final. He also helped Swansea qualify for the Third Division play-offs in 1998-99, moving to Cheltenham Town in October 2002. After a spell with Woking, he re-joined Swansea in March 2003 and netted 23 goals in 278 League games overall prior to joining Newport County in August 2004. He then played for Aberystwyth and Pontardawe Town. Still lives locally.\n\nGARY COBB\n\nAttacking midfielder Gary Cobb had a loan spell at Swansea City during the 1989-90 campaign. Signing professional for hometown Luton in August 1986, he had limited opportunities in the top-flight and was loaned to Swansea in August 1989. He played at Panathinaikos in the ECWC and made five Third Division appearances whilst at the Vetch Field. Moving to Fulham in August 1990, he joined Chesham United in September 1992 and helped win the Diadora League title that season. He later played for Aylesbury, St Albans, Chertsey, Bedford and Berkhamsted, also working for Chelsea's football in the community scheme.\n\nDAVE COLE\n\nTall central defender Dave Cole played for Swansea City during the 1984-85 season. A former Sunderland apprentice, he signed professional in October 1983 and moved to the Vetch Field on a non-contract basis in September 1984. He made eight Third Division appearances for Swansea prior to joining Swindon Town in February 1985, helping win the Fourth Division title in 1985-86. Moving to Torquay United in November 1986, he appeared against Swansea in the 1987-88 Fourth Division play-off final, then starred in Rochdale's 1989-90 FA Cup run before playing for Exeter City, Merthyr Tydfil, Newport AFC and Cinderford Town.\n\nCHRIS COLEMAN\n\nBrilliant left-back Chris Coleman was capped 31 times by Wales after leaving Swansea City. A former Manchester City junior, he moved to the Vetch Field in August 1987 and starred as Swansea won promotion in 1987-88. He was twice a Welsh Cup winner and ever-present in 1989-90, scoring twice in 160 League games prior to joining Crystal Palace for £275,000 in July 1991. Helping them win the First Division title in 1993-94, he moved to Blackburn Rovers for £2,800,000 in December 1995, then Fulham for £2,100,000 two years later. His career was ended by a car accident and he went on to manage Fulham and the Wales national team.\n\nMATTY COLLINS\n\nCollins was a Wales Under-21 full-back who started his career at Swindon Town before moving to Fulham. After being released by the Premier League side he signed on loan with Wrexham before making his way to the Liberty in May 2008. A highly-rated competitive defensive midfielder or full-back, he suffered his fair share of injuries in his career and was released from the club in 2010 after six appearances (one as sub). He has subsequently made his home back in Wales, playing for Haverfordwest, Neath, Carmarthen and Aberystwyth.\n\nTERRY COLLINS\n\nInside-forward Terry Collins briefly played for Swansea during the 1967-68 campaign. A former Swansea junior, he joined Barry Town in July 1961 and helped them win the South Wales Senior Cup on his debut. He moved to Hereford United in July 1964 and was a promotion winner in 1964-65, then had spells with Haverfordwest and Ton Pentre before re-joining Swansea in March 1967. His only League appearance was in the following month's 1-0 win at home to Aldershot and he returned to Haverfordwest in July 1968. He later played for Merthyr Tydfil and managed Abercynon.\n\nLEN COMLEY\n\nVersatile forward Len Comley featured in Swansea's first post-war League match against West Brom in August 1946. Locally born, he progressed through the ranks at the Vetch Field and scored Swansea's winner in the 1947 Football Combination Cup final. He netted seven goals in 28 Third Division (South) games prior to joining Milford United in August 1948. Moving to Newport County two months later, he starred in their 1948-49 FA Cup run, then played for Scunthorpe United, Carmarthen Town, Llanelly and Aberystwyth.\n\nKARL CONNOLLY\n\nExperienced midfielder Karl Connolly was plagued by injury problems while at Swansea City. He played local football in Warrington prior to joining Wrexham in May 1991 and helped them beat Arsenal in the 1991-92 FA Cup third round, then win promotion the following season and the Welsh Cup in 1995. Also starring in their 1996-97 FA Cup run, he joined QPR in May 2000 and reunited with Brian Flynn at Swansea in August 2003. He suffered an ankle injury in the 2-0 win at Huddersfield that put Swansea top of the table and scored once in ten League games before joining hometown Prescot Cables in June 2004.\n\nPAUL CONNOR\n\nHard-working striker Paul Connor was an influential figure in Swansea City's 2004-05 promotion success. Signing professional for Middlesbrough in July 1996, he was loaned to Hartlepool before joining Stoke City in March 1999. He was a member of their 2000 Auto Windscreens Shield winning squad and moved to Rochdale for £100,000 in March 2001. Helping them qualify for the Third Division play-offs in 2001-02, he joined Swansea for £35,000 in March 2004. He played alongside Lee Trundle and netted 16 goals in 65 League games before joining Leyton Orient for £40,000 in January 2006, helping them win promotion.\n\nTERRY CONNOR\n\nFormer England U-21 striker Terry Connor featured in Swansea City's 1991 Welsh Cup final triumph. Initially with Leeds United, he scored on his First Division debut and was swapped for Brighton's Andy Ritchie in March 1983. He was leading marksman four times prior to joining Portsmouth for £200,000 in June 1987. Terry Yorath paid £200,000 for him in August 1990 and netted six goals in 39 League outings for Swansea before being sold to Bristol City for a similar fee in September 1991, re-joining Swansea on loan in November 1992. He then played for Yeovil Town, since coaching at both Bristol clubs and Wolves, who he also managed.\n\nMICKY CONWAY\n\nExciting winger Micky Conway featured in Swansea City's 1977-78 promotion success. A former Brighton apprentice, he was their youngest League debutant when he scored in the 2-2 draw at home to Nottingham Forest in April 1973. He moved to the Vetch Field for £3,000 in December 1975 and became a favourite with his pace and sparkling control on the left wing. Scoring 11 goals in 61 League outings for Swansea, he was badly injured in a car crash in April 1978 and forced to retire from the professional game. He had a testimonial match between Swansea and Brighton in May 1979.\n\nANDY COOK\n\nAttacking left-back Andy Cook helped Swansea City reach the 1994 Autoglass Trophy final but missed the Wembley triumph through injury. Signing professional for Southampton in July 1987, he had limited top-flight opportunities behind Derek Statham prior to joining Exeter City for £50,000 in September 1991. He moved to the Vetch Field for £125,000 in July 1993 and overcame a broken leg to make 61 League appearances for Swansea before joining Portsmouth for £35,000 in December 1996. Sold to Millwall for £50,000 in January 1998, he later played for Salisbury.\n\nANTONIO CORBISIERO\n\nYoung midfielder Antonio Corbisiero briefly played for Swansea City during the 2003-04 campaign. A former Swansea scholar, he captained the youth team to success in the 2003 Welsh Youth Cup final and also featured in that year's West Wales Senior Cup final triumph. He made his League debut as a substitute in the 4-1 victory at home to Mansfield Town in August 2003 that put Swansea top of the Third Division. His first start was in that season's 3-2 defeat at home to Hull City and he played five League games, signing professional for Swansea in July 2004. He moved to Newport County in July 2005 after two loan spells. Also played for Llanelli.\n\nJOHN CORNFORTH\n\nWelsh international midfielder John Cornforth skippered Swansea City's 1994 Autoglass Trophy final triumph. Signing professional for Sunderland in October 1985, he featured in their rise to the top-flight under Denis Smith and joined Swansea for £50,000 in August 1991. He helped qualify for the Second Division play-offs in 1992-93 and netted 16 goals in 149 League outings before being sold to Birmingham City for £350,000 in March 1996. After a spell with Wycombe Wanderers, he reunited with Frank Burrows at Cardiff City in August 1999 and had spells as player-boss of Exeter City and Newport County.\n\nDAVID COTTERILL\n\nA full Welsh international, he joined the Swans after a loan spell from Sheffield United for a then record fee of £600,000 in November 2009. He began his career with Bristol City as a trainee before a £2m move to Wigan Athletic. In two seasons at the DW Stadium he featured in 18 league games and by February 2008 he found himself on loan at Sheffield United - signing a permanent deal the following July. After the Swans won promotion in 2011, Cotterill didn't make a Premier League appearance for the club and was eventually released after 38 appearances (11 as sub) and one goal to join Portsmouth, Barnsley and then Doncaster.\n\nTONY COTTEY\n\nWelsh Youth midfielder Tony Cottey briefly appeared for Swansea City during the 1984-85 campaign. Locally born, he was an apprentice at the Vetch Field and signed professional in June 1984. He made his League debut in Swansea's 3-1 defeat at home to York City three months later and played two further Third Division games that season, at home to Rotherham United and Bristol Rovers, before being released by John Bond in May 1985. He later played for Merthyr Tydfil but cricket became his priority and he achieved success with Glamorgan and Sussex.\n\nTERRY COTTON\n\nFormer Welsh Amateur international Terry Cotton was a member of Swansea's 1969-70 promotion squad. Initially with Llanelli, he was a prolific scorer for Ammanford Town in the Welsh League before signing professional for Swansea in June 1968. His solitary goal in 12 League outings came in Swansea's 4-1 defeat at Fulham in August 1970 and he joined Yeovil Town in July 1971. He was top scorer in 1971-72 and featured in three Southern League Cup finals during two spells with the Glovers, also playing for Salisbury, Taunton and Bridport.\n\nDENIS COUGHLIN\n\nVersatile centre-forward Denis Coughlin featured in Swansea's 1966-67 relegation battle. Signing professional for Barnsley in October 1957, he played for Yeovil Town prior to joining Bournemouth in March 1963. He was twice leading marksman and joined Swansea in exchange for Ken Pound in August 1966, scoring ten goals in 40 League outings before moving to Chelmsford City in July 1968. Later with King's Lynn, Bedford Town and South Shields.\n\nRUSSELL COUGHLIN\n\nFormer Welsh Youth midfielder Russell Coughlin starred in Swansea City's 1991 Welsh Cup final triumph. Starting with Manchester City, he was a promotion winner with Blackburn Rovers in 1979-80, Carlisle United in 1981-82 and Plymouth Argyle in 1985-86. He moved via Blackpool to Swansea for £30,000 in October 1990 and starred as the Swans qualified for the Second Division play-offs in 1992-93, scoring twice in 101 League games before swapped for Exeter City's John Hodge in July 1993. Joining Torquay United in October 1995, he later played for Dorchester Town and Gretna.\n\nTOMMY CRAIG\n\nFormer Scotland international winger Tommy Craig was an experienced figure as Swansea City won promotion and the Welsh Cup in 1980-81. Initially with Aberdeen, he was sold to Sheffield Wednesday for £100,000 in May 1969 and moved to Newcastle United for a similar fee in December 1974. He was a League Cup finalist in 1976 and joined Aston Villa for £275,000 in January 1978, moving to the Vetch Field for £150,000 in July 1979. Scoring nine times in 52 League outings for Swansea, he joined Carlisle United in March 1982. He later played for Hibernian, since coaching at Celtic, Aberdeen and Newcastle.\n\nIAN CRANEY\n\nThe midfielder signed on loan in November 2006 from Accrington before making the move permanent in January 2007. He had moved from Altrincham to Accrington in the summer of 2004 and was the star performer in a club that regained its league status after over 40 years in non-league. While at Accrington, his performances earned him a place in the England non-league international team, and secured him the Conference and Non-League Player of the Year awards. A leader on the field and a regular goalscorer from midfield for Accrington, he found it difficult at the Liberty to secure a place in the starting line-up and after only one season returned to his former club on a free transfer after 39 appearances (11 as sub).\n\nCOLIN CROTTY\n\nWelsh Youth striker Colin Crotty briefly played for Swansea during the 1968-69 campaign. He progressed through the ranks at the Vetch Field and signed professional in August 1968. A consistent goalscorer in the reserves, he scored on his League debut in Swansea's 2-0 victory at York City in May 1969. He also made a substitute appearance in the next Third Division game at home to Exeter City, replacing Denley Morgan, and moved to Barry Town in July 1969. Joining Merthyr Tydfil in July 1970, he subsequently played in local football for Hills Plymouth.\n\nGEOFF CRUDGINGTON\n\nEx-England Schoolboy goalkeeper Geoff Crudgington was ever-present in Swansea City's 1978-79 promotion success. A former Wolves junior, he joined Aston Villa in September 1969 and moved to Crewe Alexandra initially on loan in March 1972. He was ever-present on four occasions and joined Swansea for £30,000 in July 1978, making 52 League appearances before being sold to Plymouth Argyle for £45,000 in October 1979 after the arrival of Glan Letheran. Ever-present as Plymouth reached the FA Cup semi-finals in 1983-84 and won promotion in 1985-86.\n\nTONY CULLEN\n\nWinger Tony Cullen made a significant contribution as Swansea City qualified for the Second Division play-offs in 1992-93. A former Newcastle United trainee, he joined Sunderland in September 1988 and featured in their 1989-90 promotion campaign. He was loaned to Carlisle, Rotherham and Bury before joining Swansea in August 1992, scoring three times in 27 League outings while at the Vetch Field. Returning to his native North East with Gateshead in August 1993, he later played for Seaham Red Star, Tow Law Town and Jarrow Roofing.\n\nREG CUNLIFFE\n\nVersatile left-back Reg Cunliffe featured in Swansea's 1947 London Combination Cup final triumph. Initially a Manchester City junior, he joined hometown Wigan Athletic in September 1945 and impressed in the Cheshire League before moving to the Vetch Field in May 1946. He made his League debut in Swansea's 1-1 draw at Manchester City five months later and also appeared in the 2-2 draw at Bristol Rovers in September 1947. After a spell playing in attack for the reserves, he returned to Wigan in July 1948 but injury ended his playing career soon afterwards. He died in Fleetwood in August 2000.\n\nALAN CURTIS\n\nWelsh international striker Alan Curtis was an influential figure in Swansea City's thrilling rise under John Toshack. Signing professional at the Vetch Field in July 1972, he was leading marksman in Swansea's 1977-78 promotion success and moved to Leeds United for £350,000 in June 1979. He re-joined Swansea in December 1980 and featured in consecutive Welsh Cup final triumphs, joining Southampton in November 1983. Later with Stoke City, Cardiff City, Swansea again, Barry Town and Haverfordwest, he has since served Swansea in various capacities including caretaker manager, assistant-manager, head of youth development and first team coach.\n\nNICK CUSACK\n\nExperienced midfielder Nick Cusack captained Swansea City's 1999-2000 Third Division title triumph. He played for Long Eaton and Alvechurch prior to joining Leicester City in June 1987, then had a spell with Peterborough United before moving to Motherwell for £100,000 in August 1989. Joining Darlington for £95,000 in January 1992, he moved via Oxford United to Fulham in November 1994 and was a promotion winner in 1996-97. He joined Swansea for £50,000 in October 1997 and had a spell as player-manager, netting 13 goals in 198 League games before leaving in September 2002. He has since worked for the PFA.\n\nNEIL CUTLER\n\nEx-England Youth goalkeeper Neil Cutler had a loan spell at Swansea City during the 2002-03 campaign. Signing professional for West Brom in September 1993, he had spells with Chester and Crewe Alexandra before re-joining Chester in July 1998. He moved to Aston Villa as cover in November 1999 and briefly appeared in the Premiership, joining Stoke City in July 2001. Starring in their 2001-02 Second Division play-off final triumph, he was loaned to Swansea in February 2003 and made 13 League appearances while at the Vetch Field. He joined Stockport County in July 2004, moving to Rotherham United in August 2005.\n\nD\n\nNIGEL DALLING\n\nWinger Nigel Dalling remains the youngest player to appear in the Football League for Swansea City. Locally born, he was 15 years 289 days old when he came on as substitute in Swansea's 2-2 draw at home to Southport in December 1974. He helped the reserves win the Welsh League First Division title in 1975-76 and featured in Swansea's 1977-78 promotion campaign, making eight League appearances before joining Bridgend Town in January 1978. Later playing for Ammanford, Llanelli, Afan Lido, Ragged School and Port Tennant Colts.\n\nRAY DANIEL\n\nWelsh international centre-half Ray Daniel ended his League career with hometown Swansea. Initially a Swansea amateur, he signed professional for Arsenal in October 1946. He played in the 1952 FA Cup final and was a key figure in the Gunners' 1952-53 League Championship success, moving to Sunderland for £27,500 in June 1953. Following a spell with Cardiff City, he joined Swansea in March 1958 and netted seven goals in 44 League outings prior to joining Hereford United in July 1960. He became their player-boss, then worked in the licensed trade and was a sub-postmaster in Swansea. He died in November 1997.\n\nDAVID D'AURIA\n\nWelsh Youth midfielder David D'Auria was a young member of Swansea City's 1987-88 promotion squad. Locally born, he signed professional for Swansea in July 1988 and regularly featured as a substitute, netting six goals in 45 League outings prior to joining Merthyr Tydfil in July 1991. He moved to Barry Town in August 1993 and scored in their 1994 Welsh Cup final triumph, joining Scarborough in August 1994. Sold to Scunthorpe United for £40,000 in December 1995, he moved via Hull City to Chesterfield for £50,000 in November 1999. Later with Newport, Llanelli, Skewen and Neath.\n\nSIMON DAVEY\n\nYoung midfielder Simon Davey was a member of Swansea City's 1991 Welsh Cup winning squad. Locally born, he made his League debut as a 16 year-old in Swansea's 1-0 defeat at home to Torquay in April 1987 and turned professional in July 1989. He netted four goals in 49 League outings for Swansea prior to joining Carlisle United in August 1992. Featuring in their 1994-95 Third Division title campaign, he moved to Preston for £125,000 in February 1995 and helped win the Third Division title in 1995-96. His playing career was ended by a recurring back injury at the age of 28 and he became Preston's youth team manager. Went on to manage Barnsley, Darlington and Hereford.\n\nNEIL DAVIDS\n\nEx-England Youth central defender Nigel Davids featured in Swansea City's 1977-78 promotion campaign. Signing professional for Leeds United in August 1973, he joined Norwich City in April 1975 and had loan spells at Northampton Town and Stockport County prior to joining Swansea in July 1977. He made nine League appearances while at the Vetch Field before moving to Wigan Athletic in July 1978, playing in their first-ever League match.\n\nALAN DAVIES\n\nWelsh international midfielder Alan Davies was an important figure in Swansea City's 1987-88 promotion success. Signing professional for Manchester United in December 1978, he featured in their 1983 FA Cup final triumph but suffered a broken ankle and moved to Newcastle United for £50,000 in July 1985. He was loaned to Charlton and Carlisle prior to joining Swansea in August 1987. Reuniting with Terry Yorath at Bradford City for £130,000 in June 1989, he followed him back to Swansea in exchange for Robbie James in August 1990. He netted 12 goals in 127 League games overall until his tragic death in February 1992.\n\nALEX DAVIES\n\nWelsh U-18 goalkeeper Alex Davies briefly played for Swansea City during the 2000-01 season. Locally born, he was a second year trainee at the Vetch Field when he came on as substitute for Jason Jones in Swansea's 3-0 defeat at Bury in March 2001. He immediately saved a penalty but the referee ordered a retake from which Bury scored. Playing in Swansea's youth team for the remainder of that season, he moved to Port Talbot in July 2001, then had a three month spell with Rushden & Diamonds and has since played for Pontardawe, Garden Village, Carmarthen, Llanelli, West End and in local football for St Josephs.\n\nDAI DAVIES\n\nWelsh international goalkeeper Dai Davies starred as Swansea City finished sixth in the top-flight in 1981-82. Initially with Ammanford, he joined Swansea in July 1969 and moved to Everton in December 1970. He was loaned to Swansea in February 1974, joining Wrexham for £8,000 in September 1977. Starring in their 1977-78 Third Division title and Welsh Cup 'double' triumph, he returned to Swansea for £45,000 in July 1981 and helped win the Welsh Cup in 1982. He played 86 League games before joining Tranmere Rovers in June 1983.\n\nDAI DAVIES\n\nWelsh Youth central defender Dai Davies played alongside Dave Bruton while at Swansea City. He graduated through the ranks at the Vetch Field and turned professional in July 1973, making his League debut in Swansea's 2-0 victory at home to Barnsley three months later. Playing 22 consecutive Fourth Division games that season, he had limited first-team chances thereafter and made 28 League appearances for Swansea before joining Afan Lido in July 1975. He later played for Maesteg Park and Port Talbot.\n\nDAI DAVIES\n\nMidfielder Dai Davies made his solitary League appearance for Swansea City as a 16 year-old substitute in the 2-0 defeat at AFC Bournemouth in April 1973. A former apprentice at the Vetch Field, he turned professional for Swansea in July 1974 and reunited with Harry Gregg at Crewe Alexandra in March 1975. Helping them beat Chelsea in the 1975-76 League Cup second round, he featured in the 1977 Cheshire Premier Cup final and made over 200 League appearances for the Alex until leaving Gresty Road in May 1981. He also had a spell playing football in Hong Kong.\n\nGLENNIE DAVIES\n\nVersatile central defender Glen Davies scored twice in Swansea City's 1975 West Wales Senior Cup final triumph. Locally born, he turned professional at the Vetch Field in July 1970 and made his League debut in Swansea's 2-1 defeat at home to Aston Villa the following month. He netted 13 goals in 145 League games for Swansea prior to joining Everwarm (Bridgend Town) in May 1976. Subsequently playing for Afan Lido, Maesteg, Milford United, Llanelli, Ragged School and West End while working for the Post Office, he is currently part the coaching staff at Swansea City's Youth Academy and still lives locally.\n\nGLYN DAVIES\n\nFormer Welsh Schoolboy left-back Glyn Davies played for Swansea during the 1962-63 season. Signing professional for Derby County in July 1949, he helped them win the Third Division (North) title in 1956-57 and joined hometown Swansea in July 1962. His solitary goal in 18 Second Division games came in the Swans' 2-0 victory at Derby in March 1963 and he joined Yeovil Town in May 1963, becoming their player-boss. He re-joined Swansea as manager between June 1965 and October 1966, then was Pembroke Borough's player-coach. Later with Oswestry Town.\n\nIAN DAVIES\n\nFormer Welsh U-21 left-back Ian Davies played under John Bond for the third time in his career while at Swansea City. He was Norwich City's youngest-ever League debutant at 17 years 29 days old in April 1974 but had limited top-flight opportunities and joined Newcastle United for £150,000 in June 1979. Reuniting with John Bond at Manchester City in August 1982, he had spells with Bury, Brentford, Cambridge United, Carlisle United, Exeter City and Bristol Rovers prior to joining Swansea in November 1985. He made 11 League appearances until suffering a broken leg.\n\nJAMIE DAVIES\n\nTeenage striker Jamie Davies briefly played for Swansea City during the 1998-99 campaign. Locally born, he was a trainee at the Vetch Field and signed professional for Swansea in July 1998, making his solitary League appearance as a substitute for Aidan Newhouse in the Swans' 1-1 draw at home to Carlisle United seven months later. He was loaned to Bangor City and Llanelli before returning to Llanelli in August 2001 but suffered an injury and briefly moved to Garden Village in March 2002. Since then he has played for Carmarthen Town, Pontardawe and Garden Village.\n\nLYN DAVIES\n\nWelsh U-23 goalkeeper Lyn Davies understudied Tony Millington while at Swansea City. A former Cardiff City apprentice, he signed professional in October 1965 and was a League Cup semi-finalist that season. He followed John Charles to Hereford United in August 1968, moving to Llanelli in October 1969 and featuring in their 1970-71 Welsh League title triumph. Roy Bentley signed him in July 1972 and he made three League appearances for struggling Swansea prior to joining BP Llandarcy in August 1973.\n\nMARK DAVIES\n\nTeenage defender Mark Davies briefly appeared for SwanseaCity during the 1991-92 campaign. Locally born, he was a trainee at the Vetch Field and a member of the West Wales Senior Cup winning squad shortly before signing professional in July 1991. He made his debut against Monaco in the ECWC first round first-leg two months later, also featuring in the second-leg that the Swans lost 8-0. His solitary League appearance was in Swansea's 1-0 defeat at home to Huddersfield and he joined Merthyr Tydfil in August 1992 but had to give up football because of a medical condition, briefly resuming with Llanelli.\n\nPETER DAVIES\n\nWing-half Peter Davies featured in Swansea's 1961 Welsh Cup final success. He impressed with Llanelli prior to joining Arsenal for £5,000 in November 1957 but failed to secure a first-team slot at Highbury and moved to Swansea as part of the Mel Charles deal in March 1959. Scoring five goals in 134 League games while at the Vetch Field, he joined Brighton in July 1965, then reunited with Harry Griffiths at Merthyr Tydfil in January 1966. He later played for South African side Germiston Callies, then Ammanford.\n\nREG DAVIES\n\nFormer Welsh international inside-forward Reg Davies helped Swansea win the Welsh Cup in 1961. Initially with Southampton, he joined Southend United in July 1949 and scored on his League debut in their 2-0 win over Notts County five months later. He moved to Newcastle United for £9,000 in April 1951 and was unlucky to miss their 1955 FA Cup final success with tonsillitis. Joining Swansea as part of the Ivor Allchurch deal in October 1958, he netted 29 goals in 111 League games before moving to Carlisle United in June 1962, then appeared for Merthyr and was King's Lynn player-manager. He emigrated to Australia.\n\nRONNIE DAVIES\n\nLocal born left-half Ronnie Davies briefly appeared for Swansea during the 1958-59 season. He played for Tower United in the Swansea League before moving to the Vetch Field in May 1958 and was given his League debut in place of Mal Kennedy in Swansea's 1-0 victory at home to Stoke City in February 1959. Also featuring in the next match at Charlton Athletic, he was sold to Plymouth Argyle for £2,000 in June 1959 but failed to secure a first-team slot and joined Haverfordwest in July 1960. He later played for Ton Pentre, Llanelli and local side West End.\n\nJOE DAVIS\n\nExperienced defender Joe Davis was a Billy Lucas signing for Swansea. Initially with Soundwell, he joined Bristol Rovers in March 1956 and made his League debut in their 4-1 victory at home to Luton Town in February 1961. He was Rovers' first-ever substitute against Walsall in October 1965 and had a spell as captain before moving to Swansea for £1,000 in March 1967. Featuring in the 1967-68 FA Cup fourth round tie at home to Arsenal, he made 36 League appearances before a knee injury ended his career, then was a coach and scout back at Bristol Rovers.\n\nROBBIE DENNISON\n\nFormer Northern Ireland international winger Robbie Dennison had a loan spell at Swansea City during the 1995-96 season. Initially with Glenavon, he joined West Brom for £40,000 in September 1985 and moved to Wolves for £20,000 in March 1987. He scored in their 1988 Sherpa Van Trophy final triumph, starring as they won the Fourth Division title and Third Division title in consecutive years. Loaned to Swansea in October 1995, he made nine League appearances while at the Vetch Field. He joined Hednesford in July 1997, then played for Hereford United and Warley Borough.\n\nJONATHAN DE GUZMAN\n\nThe Canadian-born Dutch international midfielder joined the Swans on loan from Villarreal in 2012, having previously worked under Michael Laudrup at Mallorca. His time at the Liberty was a great success and he scored a number of stunning goals, including a brace at Wembley in the League Cup final win, plus a call up to the Dutch national team. But after two loan seasons at the club, he moved to Napoli. He currently plays for German side Eintract Frankfurt. He was a part of the Dutch squad for the 2014 World Cup in Brazil.\n\nDORUS DE VRIES\n\nDorus began his career in his native Holland with Telstar before joining ADO Den Haag. After a successful time with the club he moved to Scotland, signing for Dunfermline Athletic where he played in the Scottish Cup final against Celtic alongside another future Swan, Jason Scotland. His contract ended in the summer of 2007 and he opted to join Swansea alongside another former team-mate, Ferrie Bodde. In his first season at the club he helped the Swans gain promotion from League One and in the club’s first season back in the Championship he kept a club-record 22 clean sheets, winning the Football League’s Golden Glove award in the process. The following season saw Dorus play in the victorious Wembley win over Reading to reach the Premier League for the first time, but the goalkeeper surprisingly opted to sign for fellow top-flight side Wolves instead after 203 appearances. Dorus then signed for Nottingham Forest.\n\nLEIGH DEVULGT\n\nWelsh U-21 defender Leigh Devulgt was a fringe member of Swansea City's 1999-2000 Third Division title squad. Locally born, he was a trainee at the Vetch Field and signed professional in July 1999, making his League debut in Swansea's 1-0 victory at Leyton Orient five months later. He made his Welsh U-21 debut against Armenia in August 2001 but failed to secure a regular first-team slot with Swansea and had loan spells at Merthyr Tydfil and Llanelli to gain match practice. Making 23 League appearances for the Swans before moving to Carmarthen Town in January 2003, he has also played for Port Talbot.\n\nJOHN DEWSBURY\n\nYoung full-back John Dewsbury briefly played alongside Gilbert Beech in Swansea's defence. Locally born, he progressed through the ranks at the Vetch Field and turned professional in April 1950. He made his League debut in Swansea's 2-2 draw at home to Everton in October 1952 and played nine consecutive Second Division games in place of Steve Leavy. Helping the Swans win the West Wales Senior Cup in 1954, he followed Billy Lucas to Newport County in August 1955 and later played for Milford United.\n\nYAN DHANDA\n\nDudley-born Dhanda joined Swansea on a free transfer in May 2018 signing a four year deal. He enjoyed a memorable senior debut scoring the winning goal against Sheffield United just 29 seconds after being introduced off the bench on the opening day of the season. He made a further five first team appearances during that campaign. In his four years at the club, he made a total of 63 appearances and scored four goals. He left the club at the conclusion of his deal in July 2022.\n\nSTEPHEN DOBBIE\n\nThe Glasgow-born striker began his career at Scottish giants Rangers, but after finding his playing time restricted he moved to Hibernian, before joining St Johnstone and then Queen of the South. After impressing north of the border, Dobbie joined Swansea on a free transfer in the summer of 2009 under the guidance of Paulo Sousa. He had excellent technique and a wonderful football brain, impressing the most during the 2010-11 season. He scored the third goal in that memorable play-off final win over Reading at Wembley and featured for the Swans in their opening Premier League clash against Manchester City the following August. After a loan spell back at former club Blackpool, Dobbie was reunited with Ian Holloway at Crystal Palace, helping the Eagles reach the top flight before loan spells at Blackpool. He made 62 appearances (31 as sub) for the Swans with 17 goals.\n\nTOMMY DODDS\n\nVersatile inside-forward Tommy Dodds appeared for Swansea during the early post-war era. Initially with Hebburn St Cuthberts, he moved via North Shields to Aston Villa in January 1939 and featured in their first post-war League match against Middlesbrough in August 1946. He joined Swansea as part of the Trevor Ford deal in January 1947 and scored twice in 11 League outings while at the Vetch Field before returning to North Shields in August 1948. Moving to Barry Town in January 1949, he then played for Hereford United and settled back in his native North-East, residing in South Shields until his death in April 1998.\n\nDAVE DODSON\n\nEx-England Youth winger Dave Dodson scored in Swansea's 1960 West Wales Senior Cup final success. Signing professional for Arsenal in November 1957, he failed to secure a first-team slot at Highbury and joined Swansea in July 1959. He made his League debut in the following month's 2-1 victory at home to Lincoln City and netted 11 goals in 30 Second Division games before being sold to Portsmouth for £4,000 in December 1961. Helping them clinch the Third Division title that season, he joined Aldershot in January 1965, then played for Hereford, Guildford, Andover and Fleet.\n\nPETER DONNELLY\n\nInside-forward Peter Donnelly played for Swansea during the 1961-62 campaign. Signing professional for Doncaster Rovers in March 1954, he scored on his League debut the following month. He moved to Scunthorpe United in July 1958 and was leading marksman in 1959-60, joining Cardiff City in exchange for Joe Bonson in June 1960. Trevor Morris paid £6,500 for him in October 1961 and he netted three goals in 16 Second Division games for Swansea before being sold to Brighton for £7,000 in July 1962. He topped their goalscoring charts in 1962-63 and later played for Bradford City, Margate and Canterbury City.\n\nSCOTT DONNELLY\n\nA strong, forceful midfielder who began his career at QPR before moving to Aldershot Town in the hope of finding first-team football. Scott was a regular goalscorer from midfield for the Shots, earning himself a move to the Liberty in June 2010. However, the competition for places was evidently intense under Brendan Rodgers and after 18 months at the club he had made just one substitute appearance in the league and one start in the cup. After a loan spell at Wycombe, Donnelly moved to the club on a permanent basis, before spells at Aldershot, Southend and Newport County. He featured for County at Wembley in their victorious Conference play-off win over Wrexham before joining Farnborough and Havant.\n\nFRANK DONOVAN\n\nEx-Welsh Amateur international outside-right Frank Donovan played for Swansea during the 1950-51 season. He developed with Milford United and Haverfordwest, then skippered Pembroke Borough to promotion in 1947-48 and was selected for the 1948 Great Britain Olympic squad. Moving to the Vetch Field in May 1950, he scored twice in 15 Second Division games for Swansea prior to re-joining Pembroke in July 1951. He helped them win the Welsh League 'double' in 1953-54, then managed Pembroke and Milford United. An electrician at Pembroke Docks, he also had a sports shop and died in April 2003.\n\nCRAIG DRAPER\n\nYoung midfielder Craig Draper featured in Swansea City's 2002 West Wales Senior Cup final triumph. Locally born, he was a trainee at the Vetch Field and signed professional in July 2001. He made his League debut in Swansea's 1-0 defeat at home to Rochdale three months later and also appeared as a substitute in the 2-2 draw against Torquay on the final day of the 2001-02 season. Reuniting with former Swans coach Peter Nicholas at Llanelli in July 2002, he joined his local side Winch Wen soon afterwards but was then sidelined by a serious knee injury. He revived his career with Garden Village before re-joining Winch Wen.\n\nDEREK DRAPER\n\nWelsh U-23 inside-forward Derek Draper was an influential figure in Swansea's 1963-64 FA Cup run. Locally born, he turned professional at the Vetch Field in May 1962 and netted ten goals in 61 League games for Swansea before being sold to Derby County for £5,000 in April 1966. He joined Bradford PA in September 1967 and moved to Chester in January 1969. Leading marksman in 1972-73, he starred as they won promotion and were League Cup semi-finalists in 1974-75.\n\nDARYL DUFFY\n\nThe Scotland Under-21 international arrived in English football from Falkirk in January 2006, signing for Hull City after netting 27 goals in 65 starts north of the border. Duffy signed on loan for the Swans from Hull in February 2007 season, scoring five goals in five starts. This form prompted boss Roberto Martinez to make Duffy’s move permanent, with the striker going on to help the club win promotion from League One in 2008 before joining Bristol Rovers, Cheltenham and Salgaocar in Goa after 40 appearances (18 as sub) and seven goals.\n\nRICHARD DUFFY\n\nTeenage defender Richard Duff"}, {"url": "https://www.foxsports.com.au/afl/i-deeply-regret-my-poor-choice-david-king-charged-with-drink-driving/news-story/4e595cefd1c0e17caaaff4cc87897e1d", "page_content": "David King has stood down from trade period hosting duties.\n\nDUAL North Melbourne premiership player David King has stepped down from his trade period TV hosting duties after being charged with driving under the influence.\n\nKing recorded a blood alcohol reading of 0.10 in the early hours of Wednesday morning after being involved in a minor car collision, in which no one was injured.\n\nKing said he accepted full responsibility for his actions and would do everything to earn respect back.\n\n“After having some end of season drinks, I made a terrible decision to drive and was involved in a minor incident with another vehicle. I was subsequently charged with driving under the influence recording an alcohol reading of 0.10,” King said in a statement.\n\n“I deeply regret my poor choice to get behind the wheel and am embarrassed and ashamed of my actions, I am thankful no one was injured.\n\n“I’ve not only let myself down but more importantly my family, friends, workplace and the public who I put at risk.\n\n“I accept full responsibility and any repercussions which result from this.”\n\nDavid King played 241 AFL games for North Melbourne. Source: News Limited\n\nKing was due to co-host The Trade Lowdown on Fox Footy during the upcoming AFL exchange period.\n\n“I’ve stepped down from my upcoming Fox Footy trade week hosting duties,” he said.\n\n“I know I’ve lost a lot of respect and will do everything I can to earn that back.”\n\nIn a statement, Fox Footy said the matter now sat with the judicial system.\n\n“We are aware David King was recently charged with driving under the influence of alcohol. FOX FOOTY does not condone this behaviour and takes the matter very seriously. We know David deeply regrets his actions,” the statement read.\n\n“The matter now sits with the judicial system.”"}, {"url": "https://www.sportskeeda.com/player/patrick-vieira", "page_content": "Patrick Vieira: A Brief Biography\n\nPatrick Vieira is a French former professional footballer who played as a midfielder for the France national team. He is best remembered for his time at Arsenal where he was a part of the ‘Invincibles’ squad in the 2003-04 season. He is widely considered one of the greatest midfielders of his generation.\n\n\n\n\n\nHe is currently a manager and most recently coached Premier League side Crystal Palace until he was let go in March 2023, after two years in charge.\n\n\n\n\n\n\n\nEarly Life\n\nPatrick Vieira was born on June 23, 1976, in Dakar, Senegal. When Vieira was eight years old, his family moved to Dreux, a town located in north-central France.\n\n\n\n\n\nHe joined a local club, AS Dreux, when he was just nine years old. Despite his talent, Vieira faced discrimination and racism from some of his teammates and coaches due to his African heritage. He caught the attention of scouts from other clubs and was eventually recruited to play for the youth academy of FC Tours, a professional club in France.\n\n\n\n\n\n\n\nClub Career\n\nVieira began his professional career at French club Cannes where he played for one season from 1994-95. After a successful debut season at Cannes, Vieira was signed by Italian giants AC Milan. However, he struggled for game time in a star-studded team and only played 2 league games before being loaned out.\n\n\n\n\n\nIn 1996, Vieira was signed by English Premier League club Arsenal for a fee of £3.5 million. He quickly established himself as a key player for the Gunners, playing a vital role in their successes during the late 1990s and early 2000s. During his time at Arsenal, Vieira won three Premier League titles, four FA Cups, and was part of the \"Invincibles\" team that went unbeaten in the 2003-04 season. He made over 400 appearances for the club.\n\n\n\n\n\nIn 2005, Vieira was signed by Italian club Juventus for a fee of €20 million. He had a solid first season with the club, helping them win the Serie A title. He was signed by Juventus' rivals, Inter Milan, for a fee of €9 million. He played an important role in Inter's Serie A title wins in 2007, 2008, and 2009. Vieira also won two Italian Cups with the club.\n\n\n\n\n\nIn 2010, Vieira joined Manchester City where he spent two years at. He won the FA Cup during his second season with the Cityzens. He retired at the end of the season at the age of 35.\n\n\n\n\n\n\n\nInternational Career\n\nVieira made his debut for the French national team in a friendly match against the Netherlands in November 1997. He was part of the squad for the 1998 World Cup held in France, where he played a key role in France's success, helping them win their first-ever World Cup.\n\n\n\n\n\nVieira was a crucial member of the French team that won the Euro 2000, scoring the winning penalty in the final against Italy. He was also part of the team that won the Confederations Cup in 2001.\n\n\n\n\n\nHe played in the 2002 World Cup, but France was knocked out in the group stages. He also played in Euro 2004, where France reached the quarterfinals but lost to Greece. Vieira played a vital role in the French team that reached the World Cup final in 2006, however, they ended up losing to Italy. He started every match in the tournament and was named in the FIFA World Cup All-Star Team.\n\n\n\n\n\nHe also played in Euro 2008, where France was knocked out in the group stages. He retired from international football in 2010 after making 107 appearances for the French national team, scoring six goals.\n\n\n\n\n\n\n\nRecords\n\nVieira captained Arsenal in the 2006 UEFA Champions League final against Barcelona, becoming the first Arsenal player to lead the team in a European Cup final.\n\nVieira holds the record for the most consecutive Premier League appearances by a non-English player, having played in 73 consecutive games for Arsenal between 2001 and 2003.\n\nVieira holds the record for the most yellow cards received in Premier League history, having been shown the yellow card 97 times during his time in the league.\n\nVieira holds the record for the most successful tackles in a Premier League season, having made 114 successful tackles during the 1998-1999 season.\n\nVieira holds the record for the most successful dribbles in a single World Cup, having completed 31 successful dribbles during the 1998 World Cup.\n\n\n\n\n\n\n\nAwards and Achievements\n\nAC Milan Serie A: 1995–96 Arsenal Premier League: 1997–98, 2001–02, 2003–04 FA Cup: 1997–98, 2001–02, 2002–03, 2004–05 FA Community Shield: 1998, 1999, 2002 Inter Milan Serie A: 2006–07, 2007–08, 2008–09 Supercoppa Italiana: 2006 Manchester City FA Cup: 2010–11 France FIFA World Cup: 1998 UEFA European Championship: 2000 FIFA Confederations Cup: 2001 Individual Division 1 Rookie of the Year: 1995 UEFA European Championship Team of the Tournament: 2000 FIFA Confederations Cup Silver Ball: 2001 FIFA World Cup All-star team: 2006 PFA Team of the Year: 1998–99 Premier League, 1999–2000 Premier League, 2000–01 Premier League, 2001–02 Premier League, 2002–03 Premier League, 2003–04 Premier League Premier League Player of the Season: 2000–01 UEFA Team of the Year: 2001 French Player of the Year: 2001 Premier League Hall of Fame: 2022 Premier League Overall Team of the Decade: 1992–93 – 2001–02 Arsenal Player of the Season: 2000−01 FIFA 100: 2004\n\n\n\n\n\n\n\nPersonal Life\n\nOff the pitch, Vieira is known for his charitable work. He founded the Patrick Vieira Foundation in 2005, which aims to improve the lives of young people in disadvantaged communities through education and sport. He is also known for his interest in fashion and has been involved in various fashion-related projects.\n\n\n\n\n\nFurthermore, Vieira has a UEFA Pro coaching license and has coached several clubs, including New York City FC, Nice, and Crystal Palace.\n\n\n\n\n\n\n\nNet Worth\n\nAs of 2023, his net worth is estimated to be around $33 million.\n\n\n\n\n\n\n\nFamily\n\nHis parents divorced when Vieira was young, and he never met his father again. His French citizenship was conferred on him at birth as his grandfather served in the French Army and his surname Vieira is the maiden name of his mother, who is from Cape Verde.\n\n\n\n\n\n\n\n\n\nWife\n\nVieira is married to his longtime partner, Cheryl Plaza. They got married in 2005 and have three children together, a son named Sean, and two daughters named Naomi and Savannah.\n\n\n\n\n\n\n\nHouses\n\nOne of his most well-known homes was a luxurious penthouse apartment in London's Marylebone neighborhood, which he bought for around £2.2 million in 2006. The apartment featured floor-to-ceiling windows with stunning views of London, four bedrooms, a spacious living area, and a rooftop terrace.\n\n\n\n\n\nVieira also owned a property in Cannes, France, which he purchased for around €2.9 million in 2007. The house, which was located in a gated community, had four bedrooms, a swimming pool, and a large garden."}, {"url": "https://www.hks.harvard.edu/faculty/david-king", "page_content": "David C. King is Senior Lecturer in Public Policy at The Harvard Kennedy School and Faculty Chair of Harvard’s Bi-Partisan Program for Newly Elected Members of the U.S. Congress. Professor King joined the faculty in 1992, focusing on the institutions of governing in the United States. He currently teaches courses on Congress, interest groups and public policy. He also chairs Harvard’s Program for Senior Executives in State and Local Government.\n\nProfessor King is the author, co-author, and co-editor of three books, and he has published in a range of journals, including The American Political Science Review, and The Journal of Politics. His current research project explores the history and consequences of “transparency” reforms in the U.S. Congress.\n\nIn the wake of the 2000 presidential elections, Professor King directed the Task Force on Election Administration for the National Commission on Election Reform, chaired by former presidents Gerald Ford and Jimmy Carter. That effort culminated in the landmark Help America Vote Act. After a problem-filled 2006 election in Boston, Professor King evaluated and oversaw a new management structure for Boston Mayor Thomas Menino. He regularly speaks about U.S. elections to a variety of audiences and advises election-related non-profits. Professor King is the Board Chair for the pro-democracy group, Initiatives for China."}, {"url": "https://www.foxsports.com.au/afl/chooseday-night-football-viewers-on-fox-footy-vote-for-brad-johnson-masterclass-as-western-bulldogs-defeat-north-melbourne-in-2000/news-story/928fbcd1320c32f919a8df573bdaf5f3", "page_content": "THE first Chooseday Night Football of the year takes viewers back to the turn of the new century, when Fox Footy’s own Brad Johnson had the ball on a string against North Melbourne in Round 15 of the 2000 season.\n\nDespite the Bulldogs trailing by five goals at one point throughout the match, they fought back to level the scores by three quarter time, before edging over the line for a slender four-point win.\n\nOn a Sunday afternoon at Docklands, Johnson picked up 20 disposals and kicked five goals. However, fresh-faced at just 23 years of age, he was somehow overlooked for Brownlow votes.\n\nPaul Dimattina starred for the Dogs, with 33 disposals and a goal. Source: News Corp Australia\n\nInstead, Paul Dimattina was awarded best on ground honours after racking up 33 touches and kicking one goal.\n\n“Dimma was at his best playing on a wing, up to his old tricks of popping out in 100 meters of space with no one around him,” Johnson tells Fox Footy.\n\n“No one to this day can work out how he was able to do that.”\n\nAt the other end, Wayne Carey kicked three, while another of Fox Footy’s favourite sons, David King, had 25 disposals and was North’s best.\n\n“Kingy was absolutely on fire,” Johnson says.\n\n“I can remember at three quarter time, talking about needing to stop Kingy’s influence if we were going to win this game.”\n\nAnthony Stevens and Todd Curley contest for the ball. Source: News Limited\n\nNOTABLES\n\nBulldogs - Brad Johnson, Paul Dimattina, Jose Romero, Todd Curley, Scott West.\n\nNorth - David King, Wayne Carey, Adam Simpson, Byron Pickett, Troy Makepeace.\n\nMOST POSSESSIONS\n\nPaul Dimattina (WB) - 33\n\nJose Romero (WB) - 26\n\nDavid King (NM) - 25\n\nSHARPSHOOTERS\n\nBrad Johnson (WB) - 5\n\nWayne Carey (NM) - 3\n\nNathan Brown (WB) - 3\n\nBROWNLOW VOTES\n\n3 - Paul Dimattina (WB)\n\n2 - David King (NM)\n\n1 - Scott West (WB)\n\nScott West (L), Chris Grant (C) and Brad Johnson (R) at the opening of Docklands Stadium in 2000. The Bulldogs were one of the first teams to use the ground, then known as Colonial Stadium, as its home venue. Source: News Limited\n\nKEY STAT\n\nThe Bulldogs won the match with just 26 tackles for the entire game. In last weekend’s victory over the Eagles, Luke Beveridge’s Dogs had 94 tackles for the match.\n\nWHERE ARE THEY NOW?\n\nPaul Dimattina was delisted at the end of the 2003 season, having played 131 matches for the Dogs. He now owns six restaurants across Melbourne and the Gold Coast, including Dimattina’s and Il Gambero on Lygon St. and the Society Restaurant in the heart of Melbourne.\n\nWayne Carey kicked three goals at the other end, as North Melbourne threw away a big lead. Source: News Limited\n\nTHE VERDICT (How the fans voted)\n\n2000 Bulldogs v North Melbourne (50.83%)\n\n2006 Collingwood v Port Adelaide (24.75%)\n\n2009 Carlton v Essendon (24.42%)\n\nNEXT WEEK\n\nGeelong 16.6.102 defeated St Kilda 15.11.101 (Round 19, 2002)\n\nWith Steve Johnson and Fox Footy’s own Cameron Mooney dominating, Geelong found itself cruising at three quarter time, leading St Kilda by 38 points. But a six-goal-to-none final term had the Saints back in the match, only to fall just short.\n\nRichmond 20.17.137 defeated Hawthorn 21.7.133 (Round 21, 2005)\n\nThe Tigers twice fought from 41 points down in this thrilling and high-scoring encounter to edge over the line against the Hawks. Docklands was rocking under the roof in a match that had 41 goals, with Matthew Richardson kicking four in a massive win for Richmond.\n\nFremantle 15.11.101 defeated West Coast 15.10.100 (Round 21, 2000)\n\nForever known as ‘The Demolition Derby’, 17 players would face 27 tribunal charges as a result of a wild all-in brawl. The match wasn’t bad, either. Clive Waterhouse kicked seven goals as Fremantle recorded a memorable one-point win over West Coast."}, {"url": "https://theconversation.com/profiles/david-king-1254674", "page_content": "David King is Emeritus Professor of Chemistry, University of Cambridge, Founder of the Centre for Climate Repair at Cambridge and Chair of the Climate Crisis Advisory Group (CCAG), an independent group of scientists which advises on climate change and biodiversity. David brings a wealth of experience, having served as the UK's Special Envoy on Climate Change from 2013-2017, and as the UK Government's Chief Scientific Adviser from 2000-2007, during which time he raised awareness of the need for governments to act on climate change and was instrumental in creating the Energy Technologies Institute. David has published over 500 scientific papers, covering policy, climate change, and physical chemistry.\n\nHe also served as the Founding Director of the Smith School of Enterprise and Environment at Oxford; was Head of the Department of Chemistry at Cambridge University 1993-2000 and Master of Downing College at Cambridge 1995 -2000.\n\nDavid has published over 500 papers on science and policy, for which he has received numerous awards, and holds 22 Honorary Degrees from universities around the world. Elected a Fellow of the Royal Society in 1991, a Foreign Fellow of the American Academy of Arts and Sciences in 2002 and knighted in 2003, Sir David was also made an Officier of the French Legion d’Honneur’ in 2009, for work which has contributed to responding to the climate and energy challenge."}, {"url": "https://www.theguardian.com/artanddesign/2016/may/25/david-king-obituary", "page_content": "David King, who has died aged 73, was a graphic designer, writer, artist, photographer and, above all, a collector. On Level 4 at Tate Modern is a room hung with 40 framed magazine covers by John Heartfield, the German political artist and pioneer of photomontage; in the centre, open in a display case, are two copies of King’s last book, John Heartfield: Laughter is a Devastating Weapon (2015). Over several years, a larger Tate room showed dozens of Soviet posters from the David King collection, items from which will be displayed again in 2017-18 in the exhibition Red Star Over Russia.\n\nAmassed over several decades, the collection is made up of 250,000 photographs, books, journals, posters, documents and newspapers dating from the Russian Revolution to the Khrushchev era. Added to this was material from the Weimar Republic, the Spanish civil war, American labour organisations and Mao’s China. King wanted to make his collection accessible to the public, and in recent years it was acquired by the Tate.\n\nKing was art editor of the Sunday Times Magazine for 10 award-winning years. Photograph: Anthony Oliver/Eye Magazine\n\nKing’s skills were those of the eye: he could speed-read an image for meaning and context. He was born in Isleworth, Middlesex. His father was a bank manager. He began his training in 1959, after leaving school, in the design department of the London School of Printing and Graphic Arts (now the London College of Communication). His political apprenticeship came from working with his teacher Robin Fior, the designer-typographer, who was then designing the weekly Peace News and covers of the quarterly International Socialism, and was a member of the anti-nuclear Committee of 100. Fior introduced King to Soviet constructivist design and political graphics.\n\nAfter a time in an advertising agency, where his favoured copywriter was Elizabeth Smart, author of By Grand Central Station I Sat Down and Wept, he went to work at Queen magazine. In 1965 he joined the Sunday Times Magazine, where, under the overall art direction of Michael Rand, he was art editor for 10 years. The magazine won awards for its picture stories, arranged cinematically and uninterrupted by advertising. King took only a morning to lay out Don McCullin’s celebrated photographs in a multi-page feature on the Vietnam war.\n\nKing later worked on books with former Sunday Times writers, among them the art critic David Sylvester, and with Bruce Chatwin on his Photographs and Notebooks (1993). In 1972 he was co-author with Francis Wyndham of Trotsky: A Documentary. Trotsky became so much a centre of King’s career that Fior referred to King’s Islington house as “Trot-ski-lodge”. In the garden King constructed a personal dacha, set up a bust of Marx (left over from a film set), and laid down in brick mosaic a five-pointed star.\n\nIn 2009 King published Red Star Over Russia: A Visual History of the Soviet Union from 1917 to the Death of Stalin. The introduction to the book is an anecdotal account of his research into Soviet history. He enjoyed telling stories, sometimes cloak-and-dagger, sometimes comical, of his search for material over more than 40 years – in pre-Glasnost Russia, in eastern Europe, and in the US. This quest won him friends in many parts of the world. The dramatically orchestrated presentation of the documents is matched by a sensitivity to the human suffering they represent.\n\nThe cover of King’s book on Leon Trotsky produced with Francis Wyndham; the former Soviet revolutionary became a central figure in King’s career\n\nRed Star Over Russia marked the unique character of his mature book-making: writing, designing, scanning the images, all from his own archive. His frequent collaborator, Judy Groves, tells how he laid all the pages out end to end on the floor of his studio, “coupling and uncoupling them like carriages of a train”, until he was satisfied with a complete view of the story unfolding. He did not use a computer in designing, but he put the text, perfectly judged for length, in emails to the typesetter. Proofs of the typeset version were then taped in position with prints of the scanned images, printed to size.\n\nWhen King first went to Russia in 1970 and asked to see pictures of Trotsky, he was told there were none of “that fascist”. He made the repeated response to his enquiries into a catchphrase, “not possible”, uttered in a heavy Russian accent. But a diligent search in many countries eventually made an archive possible. By the time they came to do the book, Wyndham remarked that there were now more photographs of Trotsky than there were of Marilyn Monroe.\n\nKing’s interest in constructivist artists led him to the studio of Alexander Rodchenko, who had died in 1956. Opening a book – he was there to look at the artist’s book designs – was, he said, “like looking on to the scene of a terrible crime”. Rodchenko’s grandson Alexander Lavrentiev explained that his grandfather had painted over the faces of “enemies of the state”: to have been found with them risked the attentions of Stalin’s secret police.\n\nAcquiring visual records of those who had disappeared in the purges became a particular preoccupation for King. His revelations appeared in The Commissar Vanishes: The Falsification of Photographs and Art in Stalin’s Russia (1997) and Ordinary Citizens: The Victims of Stalin (2003). For an exhibition, King enlarged the original passport-size photographs to more than three metres high, accompanied by captions from their card-indexed personal details.\n\nHorrifyingly powerful, the Commissar Vanishes exhibition travelled in Europe; at the launch of a follow-up project at the Gulag museum in Moscow in 2013, King told his audience that Trotskyist groups had willingly helped him, but with “the hilarious proviso” that he shouldn’t mention that he had talked to one group, because another would then refuse to see him. King’s book was also the basis of an audiovisual collaboration with Michael Nyman, who “de-faced” an earlier work, The Fall of Icarus, to create a soundtrack to The Commissar Vanishes; it was first performed at the Barbican in London in 1999.\n\nFascism – The Most Evil Enemy of Women, a 1941 Soviet poster from David King’s collection.\n\nOn his first visit to Russia, King had taken a camera. The Nikon F was recommended by McCullin, after four hours of instruction. King had several assignments from the Sunday Times Magazine, and could give his own photographs generous space in the layouts. A feature on Muhammad Ali in 1975 led to the photographic biography I Am King, published the same year.\n\nHe also became well known for his portraits of literary figures, Nadezhda Mandelstam and Jean Genet among them, later used on covers of the London Review of Books. During this period at the Sunday Times, for which he made some collage illustrations, King designed several record sleeves, including The Who Sell Out for the Who and Jimi Hendrix’s Axis: Bold As Love (both 1967).\n\nIn the 1970s King began to develop a recognisable, but varied graphic style consisting of heavy rules – bands of black, five-pointed stars, and heavy sans-serif type, most often in upper case only. Working for the Anti-Nazi League, the Anti-Apartheid Movement and the National Union of Journalists, he claimed that he was trying to create a visual style for the left. His bold condensed capitals and heavy underlining survive in placards carried at demonstrations today.\n\nIn the 1980s he designed the first covers for City Limits, the new weekly alternative to Time Out, produced several posters for the Crafts Council and was art director of its bi-monthly magazine, Crafts. King was himself a craftsman: posters were designed full-size on a draughting desk, the photoset lettering and images pasted down with wax glue and the rules cut from paper with a scalpel. They were in black only; colour instructions for the printer were added on an overlay.\n\nKing’s Anti-Nazi League badge: he said he was trying to create a visual style for the left\n\nHe rarely favoured full-colour half tones, but would use three or four flat colours for a brilliant effect. Ink colours were most often black and red, and images were often overprinted in both colours, which made them a reddish sepia. King’s style suited David Elliott, director of the Museum of Modern Art Oxford (now Modern Art Oxford), who commissioned him to create catalogues and posters for the Soviet art exhibitions Alexander Rodchenko (1979), Vladimir Mayakovsky: Twenty Years of Work (1982) and Art Into Production: Soviet Textiles, Fashion and Ceramics 1917-1935 (1985). His work is celebrated in a current exhibition at the gallery, David King: Designs for Oxford (1979-1985).\n\nRodchenko’s constructions were also the stimulus for simple furniture and a series of neo-constructivist wood sculptures which King began in a shed in his garden. Always generous, he gave away his own works and duplicates from his collection, and gave his time to encouraging others and sharing his enthusiasm. His legacy is the books, and the images which make history come alive.\n\nHe is survived by his partner, Valerie Wade, his children, Robin and Josephine, from an earlier marriage, and by two grandchildren."}, {"url": "https://www.britannica.com/biography/David", "page_content": "spouse Abigail spouse Bathsheba father Jesse son Absalom ...(Show more)\n\nTop Questions Where did David grow up? According to the Bible, David grew up in the rugged Judean hills around the Israelite town of Bethlehem, a few miles south of what was then the Canaanite stronghold of Jerusalem. At the time, Israel was threatened by other peoples in the region, especially the Philistines, who occupied the Mediterranean coastal plain to the west. What was David’s early life like? David was the youngest of eight sons of Jesse, a farmer and sheep breeder of the Israelite tribe of Judah. David likely spent much of his boyhood tending his family’s flock. One day he was summoned from the fields by the prophet Samuel, who anointed him king of Israel while Saul was still king. What did David do for a living? As a youth, David distinguished himself as a musician and warrior. This gained him the attention of King Saul, for whom he played the harp and fought the Philistines. David’s popularity aroused the king’s jealousy. After Saul tried to kill him, David fled and became a leader of outlaws. When Saul died, David became king. What did David achieve? As Israel’s second king, David built a small empire. He conquered Jerusalem, which he made Israel’s political and religious centre. He defeated the Philistines so thoroughly that they never seriously threatened the Israelites’ security again, and he annexed the coastal region. He went on to become the overlord of many small kingdoms bordering Israel.\n\nDavid, (flourished c. 1000 bce), second ruler of the united kingdom of ancient Israel and Judah. He founded the Judaean dynasty and united all the tribes of Israel under a single monarch. His son Solomon expanded the empire that David built. David is an important figure in Judaism, Christianity, and Islam.\n\nEarly life David slaying Goliath According to 1 Samuel, David was the youngest son of Jesse, a man of Bethlehem, and served as a shepherd for his father before beginning his career as an aide at the court of Saul, Israel’s first king. When Israel came into conflict with the Philistines, a people from a neighbouring region, David’s brothers went to fight for King Saul. Young David would travel back and forth to the camp to bring his brothers food and supplies. According to 1 Samuel 17, Goliath, a heavily armed Philistine giant, challenged Saul for 40 days to send out a man to fight him. No one would face this warrior until David, armed only with a sling and stones, volunteered. David hit the giant in the forehead with a stone and killed him. He continued to distinguish himself as a warrior in the ongoing battles against the Philistines, and his resultant popularity aroused Saul’s jealousy. Fearing that the people would make David king, Saul plotted to kill him. With the help of his loyal friend Jonathan, Saul’s eldest son, David fled into southern Judah and Philistia, on the coastal plain of Palestine, where, with great sagacity and foresight, he began to lay the foundations of his career. As an outlaw with a price on his head, David led the life of a Robin Hood on the desert frontier of his tribal domain in Judah (in the south of the Levant). He became the leader and organizer of a group of other outlaws and refugees, who progressively ingratiated themselves with the local population by protecting them from other bandits or, in case they had been raided, by pursuing the raiders and restoring the possessions that had been taken. Although the boy David was anointed by the prophet Samuel as the future king of Israel (1 Samuel 16), his actions in exile helped ensure that he would be “invited” to become king as the true successor of Saul after Saul and Jonathan were slain in battle against the Philistines on Mount Gilboa."}]}