{"Danny Smith has also been an assistant coach for the Detroit Lions, Miami Dolphins, and Cleveland Browns.": [{"url": "https://theathletic.com/4154458/2023/02/04/detroit-lions-assistant-coaches-hirings/", "page_content": "When the Lions hired Dan Campbell, a little over two years ago now, there were skeptics of the move. He was a tight ends coach who had never been a coordinator. On a national level, he was known more for his sound bites than his X’s and O’s. Part of his strategy was to hire a number of assistants cut from the same cloth, former players who thought about the game the way he did. Aaron Glenn. Mark Brunell. Antwaan Randle El. Duce Staley. Kelvin Sheppard. Well-known names in NFL circles. At the same time, it was a little unconventional to see a staff filled the way his was in Detroit.\n\nAdvertisement\n\nBut if it worked? With this franchise? Best believe the Lions would catch the attention of teams around the league.\n\nWhile they’re not quite there yet, Campbell and his staff have the Lions on track. Detroit tripled its win total from Year 1 to Year 2 under Campbell. The Lions became the third team in NFL history to finish the year with a winning record after starting 1-6. Campbell nearly took them to the playoffs in 2022. That’s the goal in 2023, along with with an NFC North title.\n\nAs a result, Campbell’s coordinators have interviewed for jobs with other teams this offseason. His running backs coach was just hired away. He’s making moves to prepare for future departures, while continuing to add former players who fit the mold of the unique staff he’s built in Detroit. Some things have changed. Others have stayed the same.\n\nLet’s take a look at where things stand with Campbell’s staff amid this all-important offseason.\n\nGO DEEPER Lions' Brad Holmes, Dan Campbell enter offseason eager to build on success\n\nBen Johnson is back, but what about Aaron Glenn?\n\nJohnson went from unproven OC and relative unknown to a head coaching candidate who interviewed with three teams this offseason. Quite a rise for one of the best offensive minds in the game right now. But in the end, he’ll remain in Detroit for the 2023 season.\n\nThat’s excellent news for a Lions team that expects to compete next season. Johnson oversaw a top-five offense and helped Jared Goff get his groove back. He’ll now get to spend an offseason devising all the different ways he can use a healthy Jameson Williams in this offense.\n\nGO DEEPER Lions OC Johnson stays with Detroit after HC interviews\n\nBut what about his defensive counterpart? While Johnson received all the headlines, Glenn is still interviewing for jobs. He made it to the second round of the Arizona Cardinals coaching search and also interviewed with the Indianapolis Colts twice. It might sound strange on the surface, considering Detroit’s defensive ranks under Glenn, but he’s a well-respected coach who has been in this business for quite some time. The fact that he’s getting multiple looks — and multiple interviews — without a top-five unit speaks to that. He’s Campbell’s right-hand man and one of the tone-setters on staff.\n\nAdvertisement\n\nIf Glenn returns and the Lions invest in their defense this offseason, it wouldn’t be shocking to see his unit build on its second-half showing. From Week 9 through the end of the season, the Lions’ defense allowed just 20.2 points per game — good for 11th in that span. Over the course of a full season, that would’ve ranked eighth in the NFL. That was done largely with rookies and low-budget veterans.\n\nRight now, it still feels like this all ends with both coordinators back for another year. Having teams interested in your coordinators speaks to the health of a franchise. How many times has that been true of the Lions in recent years?\n\nDuce Staley was the Lions’ assistant head coach/running backs coach for two seasons. (Lon Horwedel / USA Today)\n\nDuce Staley’s departure\n\nIt’s not just the coordinators getting outside looks. Staley, Detroit’s assistant head coach/running backs coach, is off to Carolina to join Frank Reich’s Panthers staff.\n\nStaley was considered a strong get when Campbell lured him out of Philadelphia in 2021. He had spent eight years there as a player and another 10 on staff as an assistant. The “Hard Knocks” crew was able to capture just how involved Staley was. As the assistant head coach, Staley spoke with local media every week — much like a coordinator. He was often a bridge between the locker room and the staff. Campbell relied on him to tell it how it is, which is the only way Staley knows how to operate. He could relate to his players because he has been in their shoes, while also knowing when to push when he didn’t think his guys were playing to their potential. He was a key voice on staff.\n\nSome names who might fit in Detroit as the new running backs coach: former Panthers RBs coach Jeff Nixon, former Lions RB and current Miami Hurricanes RBs coach Kevin Smith and Saints RBs coach Joel Thomas.\n\nNew hires\n\nThe Lions announced a pair of hirings Thursday: Former NFL tight end and Arizona Cardinals assistant Steve Heiden will coach tight ends, and former Pro Bowl Lions cornerback and North Carolina assistant Dré Bly will coach cornerbacks. A couple of very on-brand hires for Campbell.\n\nAdvertisement\n\nHeiden spent 11 years playing for the San Diego Chargers and Cleveland Browns, retiring after the 2009 season. He joined the Cardinals as assistant tight ends coach from 2013-17, before becoming offensive line coach in 2018. For the past three seasons, he’s coached tight ends in Arizona.\n\nCampbell and Heiden have had very similar careers. They’re both 6-foot-5 tight ends. They were both selected in the third round of the 1999 NFL Draft (Heiden was drafted 10 spots ahead of Campbell). Both spent at least 10 years in the league. And they both became NFL tight end coaches. They’ll now work together in Detroit.\n\nBly, meanwhile, needs no introduction. A 1999 second-round pick and a two-time Pro Bowler, the fit is an obvious one. Campbell parted ways with former DBs coach Aubrey Pleasant at midseason and was in the market for a replacement. Campbell and Bly were members of the 2006 Lions, and crossed paths again in 2017 with the Saints. That year, Campbell was the tight ends coach, while Bly was a minority coaching intern during the preseason. For the past three seasons, Bly has been coaching cornerbacks at North Carolina, where he was a two-time All-American. Now, he’s back in Detroit.\n\nI’m excited to announce that I have joined the Detroit Lions as the Cornerbacks Coach! Thank you to Mrs. Sheila Ford Hamp and the rest of the Ford Family, DC Aaron Glen, GM Brad Holmes and HC Dan Campbell for an opportunity to come back home! #DetroitLions#OnePride Let’s Go! pic.twitter.com/omowTv9zyX — Dré Bly (@drebly_32) February 2, 2023\n\nCampbell is always quick to point out that being a former NFL player is not a prerequisite to joining his staff. He wants people he trusts who know the game and can communicate it well to players. Campbell surely believes Heiden and Bly fit that mold.\n\nIs Tanner Engstrand the next man up?\n\nHeiden’s addition leads to a natural question: What now for Engstrand, Detroit’s tight ends coach in 2022?\n\nAn added bonus of Johnson’s return is that the Lions have a chance to develop a potential in-house successor. That very well may be Engstrand. When Johnson was interviewing for jobs this offseason, Engstrand felt like a very real candidate to step in as Lions OC. He got his start in coaching as a graduate assistant under Jim Harbaugh at San Diego, eventually working his way up to offensive coordinator. He joined the NFL ranks in 2020 with the Lions and was retained when Campbell took over. He was an offensive assistant during the 2021 season before taking over the tight end room, as Johnson became OC. He was also named Detroit’s passing game coordinator — a title he still holds.\n\nOn the surface, a move like this allows Engstrand to work directly with Johnson and Campbell on the offensive game plan, without him also needing to oversee an entire position group. Heiden can handle the tight ends, while Engstrand focuses on the passing game and spends a year picking Johnson’s brain. If Johnson lands a head coaching gig a year from now, the Lions probably wouldn’t have to look too far to find his successor. They could be molding Engstrand.\n\nAdvertisement\n\nIt’s never a bad thing to prepare for the future. It’s what smart organizations do.\n\n(Top photo of Aaron Glenn: Raj Mehta / USA Today)"}, {"url": "https://pro-football-history.com/coach/952/danny-smith-bio", "page_content": "Danny Smith\n\nCoaching Record\n\nYears Coached Record Win % Playoff record Playoff win % 29 226-221-3 50.56% 5-12 29.41%\n\nBiography\n\nCareer Summary\n\nDanny Smith is a football coach in the National Football League (NFL) and has been the special teams coordinator for the Pittsburgh Steelers since 2013. During this time period, the Steelers compiled a 100-60-2 record.\n\nPersonal Information\n\nSmith was born on Monday, September 7, 1953 in Pittsburgh, Pennsylvania.\n\nHistory\n\nCoach history guide"}, {"url": "https://www.prideofdetroit.com/2021/6/7/22455748/detroit-lions-full-history-head-coaches", "page_content": "There’s something about Memorial Day weekend that gets me in my historian mode. The Detroit Lions have been through a lot of coaches in their history. Dan Campbell makes 30. That’s tied for second most of any team in NFL history. Somehow the Cardinals have gone through 42 coaches. Don’t ask me how.\n\nBeing that I was in this historian mood, I spent Memorial Day weekend going back in time and taking a look at each Lions head coach. Follow along. Bring your tissues. You’re gonna need them.\n\nHal Griffen (1930)\n\nHal Griffen was the Lions first coach ever, though the team was still technically the Portsmouth Spartans at the time. He did indeed coach a football team. But not well, and not for long.\n\nHal Griffen coached the Lions for one season and went 5-6-3. The interesting thing about Griffen is that he was also playing for the Spartans.\n\nGeorge “Potsy” Clark (1931-36, 1940)\n\nPotsy was technically the Lions first head coach. When Clark joined the franchise in 1931, they were still the Portsmouth Spartans. Clark came in and immediately made the Lions/Spartans one of the best teams in the league when he coached the team to an 11-3 record.\n\nClark’s early success wasn’t a fluke. He led the Lions to the championship game in 1932 and back again for a their first championship win in 1935. Clark coached the team until 1936 when he left the team to go coach the Brooklyn Dodgers—the football team, not the baseball team. Clark’s success led to him being the franchise’s Lions longest-tenured coach until 1957.\n\nThe Potsy story isn’t over, though. The Lions hired him back four years later in 1940. He coached the team for one season and then retired from coaching for a while before coaching college football.\n\nEarl “Dutch” Clark (1937-38)\n\nAfter the Lions moved on from Potsy, they hired Dutch. It did not go well as Potsy. Maybe it’s because old Dutch had a lot on his plate at the time. In addition to coaching the Lions, he was also the team’s running back.\n\nClark’s first year as the team's coach went well. The team went 7-4 and he ran for 468 yards and five touchdowns. Year two, the Lions went 7-4 and then Clark quit. He quit so he could take a job with the Cleveland Rams. He then quit that job to sell insurance and fight in World War II.\n\nDutch would later be inducted into the Pro Football Hall of Fame as a player.\n\nGus Henderson (1939)\n\nHenderson coached the Lions for just the 1939 season. The Lions went 6-5. Dick Richards sold the team to Fred Mandel after the season and Mandel chose not to go forward with Henderson.\n\nBill Edwards (1941-42)\n\nEdwards came in as a hot coaching prospect at the time. New owner Fred Mandel paid Edwards a mega $10,000 to coach the Lions for two years. Things were on the up and up. Sadly for Edwards, it didn’t work out. He coached the team to a 4-6-1 record. He was fired after three games in 1942. Although it’s hard to blame him. Most of the team’s good players went off to fight in the war. Edwards joined them the next year when he joined the Navy.\n\nJohn Karcis took over for the remaining eight losses and the Lions had their first winless season.\n\nGus Dorais (1943-47)\n\nDorais came in for the 1943 and turned the 0-11 Lions into a power house 3-6-1 team. Things eventually turned around for Dorais and the Lions. He coached the team to winning seasons in both 1944 and 1945. When Dorais was fired in 1947, he was the team's second longest-tenured head coach in franchise history.\n\nBo McMillin (1948-50)\n\nMcMillin was not a good coach. He coached the Lions to a 2-10 record in 1948 and then a 4-8 season in 1949. McMillin’s biggest contribution to the Lions was bringing in both Doak Walker and Bobby Layne.\n\nBuddy Parker (1951-56)\n\nNow it’s time for the glory years. Parker was an immediate success for the Lions. He led the team to a 7-4-1 record in his first year. The team then went on to win the NFL championship in 1952 and then again in 1953. Then things got weird.\n\nIn 1956, Parker was supposed to be the keynote speaker at a training camp dinner. Instead of delivering a speech, he got up at the dinner and quit his job in front of everyone. Classic Lions type stuff.\n\nGeorge Wilson (1957-64)\n\nWilson, who was the team’s assistant coach at the time, replaced Parker after the dinner incident and became that era’s Jim Caldwell. You know, he was the first coach “that was only good because he inherited Parker’s roster.” Wilson led the Lions to an NFL Championship in 1957 and won NFL Coach of the Year award.\n\nWilson coached the Lions to 53 wins. Get ready to hear this. That’s the second most in Lions franchise history. Sweet baby Jesus, that’s difficult to take in. You want more? Wilson coached the Lions for 104 games, making him the third-longest tenured Lions coach in franchise history. He left the team in 1966 to become the Miami Dolphins first head coach ever.\n\nHarry Gilmer (1965-66)\n\nGilmer did not work out well. After the long success of George Wilson’s run, Gilmer coached the team to a 6-7-1 record in in 1965.\n\nHe was then fired the next season after a bad loss to the Vikings that ended with Lions fans throwing snowballs at him as he left the field. You know, Lions fans type things.\n\nJoe Schmidt (1967-72)\n\nSchmidt is known as one of the Lions greatest players of all time. So, of course, giving Schmidt a try as the Lions head coach would make all the sense in the world. Unfortunately that didn’t work out so well.\n\nSchmidt’s first season as the Lions head coach led to a 5-7-2 record. Schmidt coached the Lions to winning records on multiple occasions. Although the team only made the playoffs one time and got knocked out immediately.\n\nSchmidt did bring in a lot of Lions fans favorite legends though. He helped draft Mel Farr, Lem Barney and Charlie Sanders.\n\nSchmidt coached the team until he quit after the 1972 season, stating:\n\n“I really don’t enjoy coaching anymore. It got to be a burden more than a fun-loving game. I promised my family and myself when I started coaching that I would get out when it stopped being fun. Unfortunately, it’s reached that point.”\n\nDon McCafferty (1973)\n\nThis one is sad. McCafferty just a few years earlier had become the NFL’s first rookie head coach to take a team to a Super Bowl win when the Baltimore Colts all the way. After refusing to bench Johnny Unitas, McCafferty was fired and the Lions swooped in to steal him.\n\nMcCafferty signed a three-year deal and coached the Lions to 6-7-1 record. He then unfortunately died the following summer when he had a heart attack while mowing his lawn. He could have been the Lions best coach ever. Sadly we’ll never know what could have been.\n\nRick Forzano (1974-76)\n\nForzano took over for the late McCafferty in 1974 and led the Lions to a 7-7 record in his first season. Forzano really liked 7-7 so he coached the Lions to that same record again in 1975. He was on his way to doing it again when William Clay Ford fired him in the middle of the 1976 season. Tommy Hudspeth took over for the rest of the season and the 1977 season. He failed too.\n\nForzano’s biggest contribution was bring in Bill Belichick for his first NFL job. So you can blame Forzana for being bored watching the Patriots succeed and then watching the Lions then try to recreate that success and miserably fail.\n\nTommy Hudspeth (1976-1977)\n\nHudspeth’s takeover was short lived. After becoming the interim coach when Forzano was let go, Hudspeth led the Lions to a 5-5 record down the stretch 1976, a nice improvement. Still, William Clay Ford decided not to bring him back. Ford wanted to bring in Rams head coach Chuck Knox to takeover, but Knox decided to stay with the Rams and Ford settled on Hudspeth for a three-year deal. He would be fired after his first full year on the job when the Lions went 6-8.\n\nMonte Clark (1978-84)\n\nLadies and gentleman, I present the Lions second-longest tenured head coach in franchise history. He took over the team in 1978 and led the team to a 7-9 record. In all, he coached the team for 105 games and a 43-61-1 record. He did pick Lions legend Billy Sims in the 1980 NFL Draft though. So that’s cool.\n\nHe was fired after the 1984 season. He would later work for the Lions as an advisor from 1999 to 2008.\n\nDarryl Rogers (1985-88)\n\nRogers biggest claim to fame was being the first Lions coach of my lifetime. His other claim to fame was being bad at coaching in the NFL. On his first year on the job, he went 7-9 and that was as good as it ever got for him. All told, Rogers went 18-40 with the Lions. He never coached in the NFL again.\n\nHe hilariously said on the record once, ”What does a coach have to do around here to get fired?” For him it was starting the 1988 season 2-9. Wayne Fontes finished the season.\n\nWayne Fontes (1988-96)\n\nFontes started it all off by taking over the Lions in 1988. But we’ll count his first year as the 1989 season when he led the Lions to a 7-9 record. From there, Fontes would coach the team until 1996, making him the longest-tenured head coach in Lions history. He tallied up 133 wins, a franchise record that stands today. Fontes is also the only coach in Lions history to win a playoff game during the Super Bowl era.\n\nFontes was fired after the 1996 season, opening the flood gates for the hell we’re all living in now.\n\nBobby Ross (1997-2000)\n\nRoss was able to have some success right away with the Lions. The Lions went 9-7 and made the playoff in his first year on the job. Then it all went to hell. Barry Sanders would retire after the 1998 season, and rumors have it Ross was one of the reasons Sanders decided to retire.\n\nOutside of that, Ross wasn’t all that bad during his tenure. He coached the Lions to a winning record three out of the four seasons he was with the team. Ultimately, it would all end when the Lions fired him during the 2000 season and let Gary Moeller coach the rest of the year.\n\nMarty Mornhinweg (2001-02)\n\nIt’s time to take the wind, everybody. This is as bad as it gets. Lions fans know this already. Mornhinweg has the team’s worst win percentage of any coach in franchise history. The Lions went 2-14 in his first year on the job and then improved to a nice 3-13 in his second season. Despite trending upwards, Mornhinweg was fired after the 2002 season.\n\nThe man has coached football in some capacity since 1985. He’s still working in football with the Eagles. He’s got a Super Bowl ring and an Arena Bowl ring. But he’ll always be known for this moment.\n\nSteve Mariucci (2003-05)\n\nWho’s to blame here? Mooch? Or the situation Mooch was thrusted into? Of all the coaches the Lions had during the Matt Millen era, it’s hard to not to think that Mariucci was most hamstrung by Millen’s world-class terrible drafting.\n\nMariucci went 5-11 with rookie quarterback Joey Harrington in his first season and 6-10 in his second season. He was then fired midway through his third season. Leaving Dick Jauron to take over.\n\nRod Marinelli (2006-08)\n\nMillen took a big swing here when he gave the head coaching job to a guy who had only ever been a defensive line coach and just about every job he ever had in football. The gamble did not pay off. Marinelli went 3-13 in first season.\n\nThat 2007 season, though. Man was it fun when the Lions started the season with a 6-2 record. I distinctly remember ESPN calling the Lions “the red-hot Lions.” Those were fun days. Marinelli went 1-23 after that, including the infamous 0-16 season that I know everyone loves to talk about.\n\nAfter that, Marinelli was fired along with just about everyone else in the organization.\n\nJim Schwartz (2009-13)\n\nWelcome to the new era. Schwartz came in and things gradually began to change. The Lions drafted Matthew Stafford and then won for the first time in 19 games. The Lions went 2-14, but you could tell there was improvement on the horizon.\n\nSchwartz got the Lions back into the playoffs for the first time in over 10 years in 2011. For a minute there it really did look like Schwartz was going to be the guy. Unfortunately he wasn’t and the Lions fired him two years later.\n\nLooking back on it, you have to give Schwartz credit. He took a team that nobody wanted to coach and turned them into a playoff team in short order. But he just wasn’t fit to coach the team for the long term.\n\nJim Caldwell (2014-17)\n\nCaldwell has the distinction of having the best win percentage in Lions history during the Super Bowl era. A lot of that comes from the team’s 11-5 record in 2014. That team had one of the best defenses in franchise history. Caldwell also became the guy that Matthew Stafford needed to settle him down. He quarterback whispered him into being one of the better quarterbacks in the league.\n\nCaldwell coached the Lions to two more winning seasons before being fired after the 2017 season so new GM Bob Quinn could hire Matt Patricia. It still feels like a big mistake. Many Lions fans will say that things weren’t good under Caldwell, but his win percentage would suggest otherwise. Firing Caldwell was a mistake.\n\nMatt Patricia (2018-20)\n\nLions fans were pumped to get Matt Patricia. Everything about the hire felt right. This was going to be the guy. After a summer of hype, everything peaked during the very first play from scrimmage when the Lions started the 2018 season with Quandre Diggs taking an interception to the house on the first play of the season. Everyone’s dreams were coming true. That dream quickly turned into a nightmare when the Lions allowed a lowly Jets team to drop 48 points on them in an embarrassing Week 1 loss. From there it never got better.\n\nYeah, the Lions beat the Patriots a few weeks later. That was cool, but it’s completely forgettable when you look at the rest of the Lions 6-10 season. Then the team went 3-12-1 in Patricia’s second year and as we all know, the wheels completely fell off in Patricia’s third season. He didn’t even make it through the whole year.\n\nIt’s probably hyperbole, but Patricia may be the worst coach in Lions history.\n\nSo that’s it. That’s every Lions coach in history. We’ll see where Dan Campbell will fit into this history."}, {"url": "https://www.detroitlions.com/team/coaches-roster/dan-campbell", "page_content": "On Jan. 20, 2021 the Detroit Lions named Dan Campbell the franchise's new head coach.\n\nCampbell possesses 23 years of NFL experience, including 12 years as a coach and 11 as a player. In his first year as the Lions' head coach, Campbell helped instill a new culture built on grit, conviction and collaboration on and off the field. Upon arrival, Campbell assembled a proven coaching staff that included several former NFL players that brought a wealth of knowledge and passion to Detroit's roster.\n\nWith one of the NFL's youngest rosters in 2021, 85 players saw the field for the Lions last season, tied for the third most in the NFL behind the Jets (87) and Titans (91). In 2021, 10 different Lions rookies started a combined 66 games, and the Lions featured at least one rookie player on 100 percent of offensive snaps. The leadership from Campbell and the coaching staff resulted in consistent player development, as the Lions finished the season winning three of their final six games of the season – including a 30-12 statement win over the Arizona Cardinals in Week 15 and a 37-30 win over rival Green Bay in Week 18.\n\nIn his first year, Campbell, alongside Lions Executive Vice President and General Manager Brad Holmes, emphasized building through the Draft as the foundational identity of the team. With core pieces in T Penei Sewell (first round, seventh overall), WR Amon-Ra St. Brown (fourth round, 112th overall) and DL Alim McNeill (third round, 72nd overall), Campbell and Holmes set out this season to acquire even more talent. In the 2022 NFL Draft, Detroit added two first-round picks in DL Aidan Hutchinson and WR Jameson Williams, as well as six more players to round out the newest draft class.\n\nIn addition to re-signing several key pieces from last season, including DL Charles Harris, WR Kalif Raymond, S Tracy Walker, LB Alex Anzalone, WR Josh Reynolds and FB Jason Cabinda, Campbell recruited unrestricted free agents WR DJ Chark, S DeShon Elliott, CB Mike Hughes and LB Chris Board to join this year's team. At their introductory press conferences, Chark and Elliott echoed what Campbell's new culture is all about.\n\n\"I actually kept up with the Lions last season,\" Chark said. \"And I appreciated the way that they hustled, and the grit and the way they persevered and went from tying games to winning games to playing better. And I truly appreciated the way that this staff kept that team together and had faith in those guys.\"\n\n\"It was a slobberknocker,\" Elliott said of what he remembers from playing the Lions last season as a member of the Ravens. \"(The Lions) played so hard, and I could just tell from that game they love their coaches, by the way they play. They really bought in and love the experience they have in the building.\"\n\nPrior to becoming the head coach in Detroit, Campbell most recently served as the assistant head coach/tight ends coach for the New Orleans Saints from 2016 – 2020. During the span of his five-year coaching tenure with New Orleans, the club captured four NFC South division titles, ranked first in the NFL in points scored (2,361), touchdowns (277), net yardage (31,147) and posted the third-most wins (56) in the League.\n\nIn 2019, Campbell helped coach TE Jared Cook to a Pro Bowl berth in Cook's first season with the Saints. Cook established a career-high average for yards per reception (16.4) that season under Campbell, while fellow TE Josh Hill posted a career-high 25 receptions for 226 yards and three touchdowns. During the 2017 season, Campbell's group saw three different players make starts at tight end, while still helping produce the NFL's fifth-best rushing offense.\n\nIn 2015, Campbell became the Miami Dolphins' interim head coach following organizational changes, where he took over a 1-3 team that had lost three consecutive contests and immediately helped the team win its first two games under his leadership. The Dolphins finished 5-7 under Campbell that season, including a 20-10 win over the New England Patriots in the season finale. Under Campbell, Miami improved eight spots in the NFL's rushing yards per game rankings and saw five Dolphins selected to the Pro Bowl in 2015. Additionally, QB Ryan Tannehill became the first Dolphins signal-caller to pass for at least 4,000 yards in consecutive seasons since Dan Marino (1984-86).\n\nPrior to taking over interim duties with the Dolphins, Campbell was responsible for mentoring Miami's tight ends unit dating back to 2011, after initially joining the Dolphins in 2010 as a coaching intern. In 2014, TE Charles Clay helped pace Campbell's unit with 58 receptions, 605 yards and three touchdowns, while the unit collectively helped pave the way for RB Lamar Miller's first 1,000-yard season.\n\nCampbell entered the NFL coaching ranks following an 11-year playing career with the New York Giants (1999-2002), Dallas Cowboys (2003-05), Detroit Lions (2006-08) and New Orleans Saints (2009). A third-round selection by the Giants in the 1999 NFL Draft, the former tight end appeared in 114 total career games (76 starts) and caught 91 passes for 934 yards and 11 touchdowns. He was a member of the Giants team that appeared in Super Bowl XXXV following the 2001 season. In his first year as a player with the Lions in 2006, Campbell posted career-highs in receiving yards (308), yards per reception (14.7) and touchdowns (four).\n\nAs the 28th head coach in franchise history, Campbell is also the fifth former Lions player to be named full-time head coach for the team and the first since Joe Schmidt, who played for Detroit from 1953-65 and served as head coach from 1967-72."}, {"url": "https://steelersnow.com/steelers-st-coach-danny-smith-not-planning-on-retiring-soon-im-a-lifer/", "page_content": "PITTSBURGH — Some coaches are just made for the game of football. If there was a coach to exemplify that on the Steelers, it would be hard to point to anyone other than Danny Smith. Smith, 68, who was hired all the way back in 2013, has been coaching football for nearly 50 years — and he has no plans of retiring any time soon.\n\nSmith’s first job came all the way back in 1976 when he was a graduate assistant for his alma mater, Edinboro University. Smith played for Edinboro from 1972 to 1976, and Smith is a hometown guy. He played at Central Catholic, took Dan Marino under his wing, and simply knows nothing but football. He has made stops all over the coaching map but made the special teams jump in 1995 when he joined the Eagles.\n\nThe Steelers job opened up following the 2012 season, however, and Smith was the obvious choice. At his age, it could be easy to see Smith potentially moving on and sipping Pina Coladas on the beach in retirement. However, he says that will not be happening anytime soon. Instead, Smith is going to continue until he knows he simply can not go any longer. After all, the only game and thing that Smith knows is football. He has been around the game his entire life, and leaving now just does not fit his bill well.\n\n“I’m a lifer, man,” Smith said. “I don’t have any hobbies. I’m not a golfer or a traveler. That’s a pain in the ass anymore. I don’t know what the hell I would do if I didn’t have this place and football. You probably are going to see me crawl off this field one day. I don’t have any plans. I’m good to go. I love it. I’m prepared for it. I’m forever.”\n\nSmith is not going to walk away from the team anytime soon, and his players would not have it any other way. Gunner Olszewski is new to the Steelers, but Smith is already making a big-time statement on him. There is a myriad of traits that sticks out about Smith to Olszewski. While he may not be on Smith’s level with the gum-chewing just yet, he is certainly taking lessons from everything that Smith is telling him. Coming from a football lifer, that makes it all the more meaningful.\n\n“It’s been great,” Olszewski said of working with Smith. “The bank of knowledge that he has, you can ask him anything. You can tell how much that dude loves football. If you ask him, he’ll say he hates football. But only people who absolutely love football will say they hate football. He knows so much about the game and is willing to share it all. You can get him going easily by talking about a punt block or field goal block. He just loves it.”\n\nIt appears that Smith is going nowhere. The Steelers are content with having Smith’s energy, and gum-chewing skills around for as long as possible. He will look to continue a string of successful seasons on special teams while trying to replace Ray-Ray McCloud’s presence at punt returner.\n\nRELATED: Danny Smith Says Chris Boswell Will Get a New Contract Soon"}, {"url": "https://www.espn.com/blog/detroit-lions/post/_/id/33098/report-lions-to-hire-three-assistant-coaches-including-qb-coach-george-godsey", "page_content": "Matt Patricia can’t be hired until at least Sunday, but some of his staff is apparently taking shape.\n\nAlex Marvez of the Sporting News reported the Detroit Lions have decided to hire three assistant coaches, all with at least some tie to Patricia. Marvez reported Detroit will hire Brian Stewart to coach defensive backs and Jeff Davidson to coach the offensive line. Additionally, George Godsey will move from his defensive special projects role to quarterbacks coach.\n\nAfter two seasons as offensive coordinator for the Texans, George Godsey joined the Lions staff last season as a defensive special projects assistant. John Rivera/Icon Sportswire\n\nThe 50-year-old Davidson intersected with Patricia in 2004, the presumed next Detroit head coach's first season on the New England staff and Davidson’s last. Davidson was the Patriots' tight ends and offensive line coach that year, while Patricia was an offensive assistant.\n\nDavidson left New England for Cleveland with Romeo Crennel after that season and has been an offensive line coach or offensive coordinator with the Browns, Panthers, Vikings, Chargers and Broncos ever since. His longest tenure, though, was with New England, from 1997 to 2004. So he would have both a relationship with Patricia and an understanding of what the Lions might be trying to do.\n\nLast season, Davidson was Denver’s offensive line coach, and the Broncos gave up 52 sacks -- tied for 29th in the league with Arizona. Only two teams -- Houston and Indianapolis -- were worse.\n\nDavidson played college football at Ohio State and played five seasons in the NFL -- four with the Broncos and one with the Saints. He’ll replace Ron Prince as the team’s offensive line coach.\n\nGodsey spent three seasons with the Patriots from 2011 to 2013, first as an offensive assistant and then as a tight ends coach. He then moved to Houston under Bill O’Brien, and was the quarterbacks coach in 2014 and offensive coordinator in 2015 and 2016. Last season, he was brought onto the Lions staff as a defensive special projects assistant.\n\nGuide To NFL Coaching Carousel It's firing-and-hiring season, and we're tracking all the moves.\n\n• Everything to know about current, potential openings »\n\n• Candidates our analysts would hire »\n\nDuring his time in New England, he overlapped with both Patricia and general manager Bob Quinn.\n\nThe 39-year-old played quarterback at Georgia Tech before going into coaching, first in high school and then at UCF as a graduate assistant, then a quarterbacks coach and running backs coach, before heading to New England in 2011.\n\nIn Houston, he worked with Case Keenum, Tom Savage, Ryan Fitzpatrick, Ryan Mallett, Brian Hoyer, Brandon Weeden, Brock Osweiler and Thad Lewis during his time as quarterbacks coach and offensive coordinator.\n\nHe’ll replace Brian Callahan, who was the quarterbacks coach the past two seasons and who has already gotten a new job in Oakland as quarterbacks coach.\n\nStewart connected with Patricia for one season at Syracuse in 2001, when he coached defensive backs. That was also Patricia’s first year with the Orangemen (now Orange). From there, Stewart went to the NFL, where he was a defensive backs coach in Houston and San Diego. He coordinated defenses for two seasons in Dallas -- 2007 and 2008. In 2007, his unit was a top-10 defense (and held then-rookie Calvin Johnson to five catches for 51 yards in their meeting). In 2008, with another top-10 defense, the Cowboys were fifth against the pass.\n\nHe was let go by Dallas after the season, though, in a decision made by Jerry Jones.\n\nStewart went to Philadelphia for a season before spending most of this decade in college, first as the defensive coordinator at Houston and Maryland before coaching defensive backs at Nebraska for two seasons and then becoming the defensive coordinator at Rice last year. He was named interim head coach in November after David Bailiff was fired, until the team hired Mike Bloomgren has its head coach on Dec. 5. Bloomgren hired former Michigan coach Brian Smith as his defensive coordinator, potentially leaving Stewart in need of a new gig.\n\nThe Lions can’t formally announce a deal with Patricia until after Sunday’s Super Bowl concludes."}, {"url": "https://profootballtalk.nbcsports.com/2020/11/28/report-steelers-st-coordinator-danny-smith-tests-positive-for-covid-19/", "page_content": "Getty Images\n\nA report on Saturday indicated Steelers running back James Conner tested positive for COVID-19 and there was also word that an assistant coach had tested positive.\n\nGerry Dulac of the Pittsburgh Post-Gazette reports that special teams coordinator Danny Smith is the coach. The two positives come on the heels of three Steelers players going on the reserve/COVID-19 list on Friday and raises some concern that the team could have an ongoing outbreak.\n\nDefensive end Stephon Tuitt, defensive lineman Isaiah Buggs, and offensive lineman Jerald Hawkins were placed on the reserve list.\n\nThat concern has likely increased after watching the Ravens deal with an outbreak of their own over the last week. The cases in Baltimore caused this week’s game between the AFC North sides to be postponed until Tuesday in hopes of controlling the spread around the Ravens.\n\nAfter Saturday’s news, the chances of moving forward with the rescheduled game will also lie with testing results in the Steelers organization."}, {"url": "https://www.detroitlions.com/news/a-closer-look-arthur-smith", "page_content": "Tim Twentyman's take: There's no denying the success Tennessee's offense has had the last two seasons under Smith. Henry is the game's top running back, and Tannehill has been one of the most consistent quarterbacks the last two season under Smith's tutelage. I like that Smith cut his teeth in the coaching ranks both as a defensive and offensive assistant. He knows both sides of the ball.\n\nHe certainly has staying power within the Titans organization. He's been through four coaching changes and a change in ownership in his tenure with the Titans. Smith has worked his way up the coaching ranks from quality control roles to now being one of the top young minds in the game. Smith is hoping to follow the path of other young coaches like Sean McVay, LaFleur and Kyle Shanahan to take over a team in their 30's.\n\nMike O'Hara's take: What stands out immediately on Smith's resume is the results in two seasons as Titans offensive coordinator and eight previous seasons as an assistant coach, mostly working with tight ends. Henry has ripped defenses apart the last two seasons – 1,540 yards rushing in 2019, 2,027 in 2020 -- but that's not a real surprise."}, {"url": "https://www.freep.com/story/sports/nfl/lions/2020/11/28/detroit-lions-coach-candidates-urban-meyer-robert-saleh-eric-bieniemy-joe-brady-arthur-smith/3700148001/", "page_content": "Your subscription supports:\n\nExclusive investigative reporting that fights for the truth, exposes corruption and gives voice to the voiceless all across Michigan.\n\nComprehensive coverage of Michigan's auto industry, including in-depth analysis of Ford, GM, and Stellantis’ latest developments and innovations.\n\nDon't miss a beat with our sports coverage, featuring the Lions, Tigers, Red Wings, Pistons, Michigan and Michigan State, as well as exclusive access to USA TODAY Sports+.\n\nDive deeper into the news and sports stories that matter most with our exclusive podcasts, featuring analysis and reporting from our team of experts."}, {"url": "https://detroitjockcity.com/2021/01/24/detroit-lions-anthony-lynn-offensive-coordinator/", "page_content": "The Detroit Lions hired former Chargers head coach Anthony Lynn as their offensive coordinator replacing Darrell Bevell who has accepted the same role under Urban Meyer with the Jacksonville Jaguars.\n\nThe thing that stood out about this new regime constructed by the Detroit Lions brass had one thing in common; limited-to-no experience in their current role. With guidance from Special Assistant Chris Spielman and the Vice President of Football Administration, Mike Disner, President Rod Wood, and principal owner Sheila Ford Hamp hired Brad Holmes to be the teams’ new general manager.\n\nNearly immediately after hiring Holmes, who made a name for himself in the Rams organization as a draft expert, the organization hired Dan Campbell to be the next head coach of the Detroit Lions. Campbell has limited experience in the role after producing a 5-7 record back in 2015 as an interim head coach with the Miami Dolphins.\n\nCampbell joins the Lions’ way of the New Orleans Saints, where he served under Sean Payton as assistant head coach/tight ends coach. Campbell brought the Saints secondary coach Aaron Glenn to run the Detroit defense.\n\nSo the Lions have a first time GM, a limited experienced head coach, and a first-time defensive coordinator. Adding an experienced Lynn to an inexperienced coaching staff is a brilliant addition for the Lions.\n\nAnthony Lynn’s addition to this Detroit Lions coaching staff is well calculated and should pay off in various ways next season.\n\nLynn joins Detroit after producing an overall record of 33-31 as the Chargers head coach. It’s exactly the type of experienced coach Campbell needed to add to his staff. Lynn’s greatest weakness during his tenure as head coach was his inability to manage the clock. Fortunately for the Lions, Lynn won’t need to worry about calling time outs or when to challenge or not to challenge a call that will fall on Campbell.\n\nLynn, a two-time Super Bowl champion as a backup running back to Terrell Davis with the Denver Broncos, totaled just 177 yards on 28 totes as a professional. Those numbers won’t impress anyone, but those two rings surely will. Lynn may not have had a historic run as a player, but he’s done a fine job as an NFL coach following his playing days.\n\nAfter spending time with the Jaguars, Cowboys, Browns, and Jets as a running back coach, he’d finally be promoted to Buffalo’s OC for one season before landing the head coaching gig in San Diego (later Los Angeles). During that 2016 season with the Bills, Buffalo led the league in rushing behind a rejuvenated LeSean McCoy. McCoy galloped for 1,267 yards and 13 touchdowns.\n\nQuarterback Tyrod Taylor also added 580 rushing yards and six touchdowns in ’16 behind Lynn’s playcalling.\n\nAlthough Lynn likely won’t be working with Matthew Stafford, I am excited to see how D’Andre Swift produces as a dual-threat, playmaking running back in Lynn’s system."}]}