{"Danny Smith is known for his ability to develop special teams units that consistently rank among the best in the NFL.": [{"url": "https://www.steelers.com/team/coaches-roster/danny-smith", "page_content": "Danny Smith is in his 11th season with the Steelers as the special teams coordinator. Smith was hired on January 31, 2013.\n\nSince joining the Steelers in 2015, kicker Chris Boswell is 202-of-234 overall on field goal attempts (86.3%), including 90-of-115 (78.3%) from 40 yards or longer. He ranks fifth in field goal percentage (86.3%) among all NFL kickers with at least 200 field goal attempts in league history. Boswell's 86.3 field goal percent ranks second in Steelers history among kickers with at least 30 field goal attempts, behind only Shaun Suisham (2010-14: 124-141 for 87.9%). He has registered a franchise-record 10 career game-winning field goals (last five min. of the fourth quarter or overtime for a lead change).\n\nIn 2022, Boswell made 20 field goals for the sixth time in his career, despite missing five games with an injury. His 59-yard field goal against the NY Jets in Week 4 tied the longest make of his career. In Week 17 at Baltimore, Boswell became the second player in team history withat least 200 career field goals made.\n\nIn 2021, Boswell broke his own franchise record for most field goals made in a season in Steelers history (36). He also converted 8-of-9 attempts from 50+ yards, doubling his previous record of four makes from 50+ yards in a single season (2017).\n\nSmith also oversaw the development of rookie punter Pressley Harvin in 2021. Harvin finished 10th in the League, landing 25 punts inside the 20-yard line as a rookie.\n\nUnder the guidance of Smith, Boswell made 19 field goals on 20 attempts (95.0%) in 2020, the best field goal percentage of his career in a single season. From 2019-2020, Boswell connected on 25-straight field goal attempts, which was the longest streak in the NFL when it ended in Week 11 of 2020 at Jacksonville.\n\nBoswell made 29 of his 31 field goal attempts (93.5%) in 2019, including 29 of 30 from inside 54 yards and 10 of 12 from 40+ yards. He ranked tied for third in the NFL in field goals made, tied for fourth in field goals attempted and fourth in points (115). Among NFL kickers with at least 30 field goal attempts, Boswell ranked second in field goal percentage.\n\nBoswell was the only kicker in 2019 that did not miss an extra-point attempt (28 of 28) and connected on at least 90% of his field goal attempts. He was the first NFL kicker to accomplish the feat since 2017 and fifth to do so since 2015, when the extra-point attempt was moved to the 15-yard line.\n\nWide receiver and punt returner Diontae Johnson excelled under Smith's tutelage in 2019. The rookie led the NFL in punt-return average (12.4). Johnson was the fifth player in franchise history to lead the League and first since the 1970 AFL-NFL merger. He returned a punt 85 yards for a TD at Arizona in Week 14, which was the longest punt return for a TD in franchise history. It was the first punt-return TD for the Steelers since December 6, 2015 (Antonio Brown vs. Indianapolis). Johnson was the first Pittsburgh rookie with a punt return for a TD since December 17, 2006 (Santonio Holmes vs. Carolina).\n\nBoswell landed 13 successful field goals in 2018, following a 2017 season where he earned his first Pro Bowl selection after a record-setting campaign. Boswell established single-season franchise records for the most field goals made (35) and total points (142) during the 2017 season, in addition to setting a team record for the most field goals made from 50 yards or further in a season with four. His 35 field goals made and 142 points surpassed the previous milestones of Norm Johnson set in 1995 (34 and 141). Boswell converted four game-winning field goal attempts — kicks within one minute of regulation — during the 2017 regular season.\n\nIn 2016, Boswell tied the franchise's regular-season record for the most field goals made in a single game with 6 (12/18 at Cincinnati). Also in that contest, he set the franchise record for most field goals made from 40 yards or longer in a single game (5). Since 1960, his 5 made field goals from 40 yards or longer are tied for the most in a single game in NFL history (Mason Crosby, 11/22/15).\n\nBoswell also set the NFL and Steelers record for most field goals made in a single postseason game (6) at Kansas City in the AFC Divisional Playoff. At the end of the 2016 postseason, Boswell was a perfect 15-of-15 in his playoff career. He became the first player in NFL postseason history to covert each of his first 15 field goal attempts.\n\nThough Boswell had never kicked in an NFL game prior to his 2015 Steelers debut, he made 29 field goals and 26 PATs for a total of 113 points in just 12 games. He set rookie/first-year single-season team records in field goals made (29), points (113) and field goal percentage (90.6). Boswell's 29 made field goals tied for fifth on the team's single-season field goals made chart.\n\nPrior to the 2015 regular season, the Steelers lost kicker Shaun Suisham for the season in the team's first preseason contest due to a knee injury. Pittsburgh then went through two other kickers (Garrett Hartley and Josh Scobee) before signing Boswell prior to the team's Week 5 game.\n\nThrough his first five years in the NFL and with the Steelers, punter Jordan Berry owns the team's single-season regular season record for highest net punting average (40.9, 2019). He ranks third in franchise history with a 44.2 punting average (min. 100 punts) and second in team annals with 131 punts inside the opponent 20-yard line.\n\nBerry, who recorded a franchise record 40.9 net punting average, averaged a career-best 45.5 yards per punt in 2019.\n\nIn 2018, Berry tallied a 38.8 net punting average coming off a 2017 season in which he posted the second-best mark in team history with a 39.8 average.\n\nIn 2016, Berry set the team's single regular-season record for highest net punting average (40.2) and became the seventh Steeler in team history to land 50 punts inside the opponent's 20-yard line in their career.\n\nDuring the 2015 season, Berry established a Steelers' single-season record (since 1976) for the highest percentage of punts downed inside the 20-yard line (47.5). That percentage also placed him third in the NFL.\n\nIn 2014, Smith got solid efforts from Suisham and punter Brad Wing. Suisham made 29-of-32 field goal attempts and all 45 of his PATs for a total of 132 points, good for fourth in the AFC. Wing averaged 43.7 yards per punt in his debut NFL season in 2014. His gross punting average was the fifth-highest total in team history for a rookie or first-year player in a single season.\n\nIn the Steelers' Week 17 showdown with the Cincinnati Bengals, the AFC North Championship was on the line. Smith's punt return units cleared the way for Antonio Brown to return a punt 71 yards for a TD. It marked the second straight season Brown returned a punt for a TD against Cincinnati.\n\nIn Smith's first season as the Steelers' special teams coordinator in 2013, Suisham had a career year, connecting on 30-of-32 field goals, which are a career high and are tied for the third-most field goals made in a single season in Steelers history. His 93.8 field goal percentage (minimum 15 attempts) also set a new single-season team record.\n\nIn addition to being selected to the Pro Bowl as a wide receiver in 2013, Brown was also selected as a return specialist. He recorded a 67-yard punt return for a TD in Week 15 versus Cincinnati, which was one of his five returns of 40 or more yards on the season.\n\nPrior to joining Pittsburgh, Smith served as the Washington Football Team's special teams coordinator from 2004-2012. He helped establish Washington's special teams as one of the top coverage and return units in the NFL.\n\nPrior to joining the Washington Football Team, Smith was the special teams coordinator for the Buffalo Bills (2001-03), coached tight ends for the Detroit Lions (1999-2000), and he split duties as the defensive backs and special teams coach for the Philadelphia Eagles (1995-98).\n\nSmith spent eight years (1987-94) as an assistant coach for Georgia Tech, where he coached running backs, wide receivers and defensive backs. He was on the staff for the Yellow Jackets' 1990 team that was named co-NCAA National Champions.\n\nSmith played defensive back for Edinboro State College from 1972-1976, and he was elected to the Edinboro University Athletics Hall of Fame in 2007.\n\nHis first collegiate coaching position came as a graduate assistant at his alma mater in 1976. Smith also was a defensive graduate assistant coach at Clemson University (1979), The College of William & Mary (1980-83) and The Citadel, the Military College of South Carolina (1984-86)."}, {"url": "https://steelerswire.usatoday.com/2020/11/28/steelers-ravens-covid-19-danny-smith-special-teams-nfl/", "page_content": "Steelers special teams coach Danny Smith tested positive for the Covid-19 virus, per sources — Gerry Dulac (@gerrydulac) November 28, 2020\n\n[jwplayer tgNcIvGB-ThvAeFxT]\n\nAccording to Pittsburgh Steelers beat writer Gerry Dulac, the Steelers assistant coach who tested positive for COVID-19 is special teams coordinator Danny Smith.\n\nThis is in addition to starting running back James Conner who is also reportedly positive for COVID-19.\n\nAt this point, the Steelers are not at a point where the NFL should consider moving the game further. The Steelers have already had to adjust to two moves thanks to multiple positive tests by the Baltimore Ravens.\n\nSmith has been the Steelers special teams coordinator since 2013.\n\nGallery Steelers practice squad 2020, Week 12: Updated with protections View 16 photos"}, {"url": "https://hbr.org/1993/03/the-discipline-of-teams-2", "page_content": "Groups don’t become teams because that is what someone calls them. Nor do teamwork values by themselves ensure team performance. So what is a team? How can managers know when the team option makes sense and what they can do to ensure team success? In this article, drawn from their recent book The Wisdom of Teams, McKinsey partners Jon Katzenbach and Douglas Smith answer these questions and outline the discipline that makes a real team. The essence of a team is shared commitment. Without it, groups perform as individuals; with it, they become a powerful unit of collective performance. The best teams invest a tremendous amount of time shaping a purpose that they can own. The best teams also translate their purpose into specific performance goals. And members of successful teams pitch in and become accountable with and to their teammates. The fundamental distinction between teams and other forms of working groups turns on performance. A working group relies on the individual contributions of its members for group performance. But a team strives for something greater than its members could achieve individually. In short, an effective team is always worth more than the sum of its parts. Katzenbach and Smith identify three basic types of teams: teams that recommend things–task forces or project groups; teams that make or do things–manufacturing, operations, or marketing groups; and teams that run things–groups that oversee some significant functional activity. For managers, the key is knowing where in the organization real teams should be encouraged. Team potential exists anywhere hierarchy or organizational boundaries inhibit good performance. Considering the extra level that teams can achieve, the authors believe that teams will become the primary work unit in high-performance organizations.\n\nThe Idea in Brief The word team gets bandied about so loosely that many managers are oblivious to its real meaning—or its true potential. With a run-of-the-mill working group, performance is a function of what the members do as individuals. A team’s performance, by contrast, calls for both individual and mutual accountability. Though it may not seem like anything special, mutual accountability can lead to astonishing results. It enables a team to achieve performance levels that are far greater than the individual bests of the team’s members. To achieve these benefits, team members must do more than listen, respond constructively, and provide support to one another. In addition to sharing these team-building values, they must share an essential discipline. The Idea in Practice A team’s essential discipline comprises five characteristics: 1. A meaningful common purpose that the team has helped shape. Most teams are responding to an initial mandate from outside the team. But to be successful, the team must “own” this purpose, develop its own spin on it. 2. Specific performance goals that flow from the common purpose. For example, getting a new product to market in less than half the normal time. Compelling goals inspire and challenge a team, give it a sense of urgency. They also have a leveling effect, requiring members to focus on the collective effort necessary rather than any differences in title or status. 3. A mix of complementary skills. These include technical or functional expertise, problem-solving and decision-making skills, and interpersonal skills. Successful teams rarely have all the needed skills at the outset—they develop them as they learn what the challenge requires. 4. A strong commitment to how the work gets done. Teams must agree on who will do what jobs, how schedules will be established and honored, and how decisions will be made and modified. On a genuine team, each member does equivalent amounts of real work; all members, the leader included, contribute in concrete ways to the team’s collective work-products. 5. Mutual accountability. Trust and commitment cannot be coerced. The process of agreeing upon appropriate goals serves as the crucible in which members forge their accountability to each other—not just to the leader. Once the essential discipline has been established, a team is free to concentrate on the critical challenges it faces: For a team whose purpose is to make recommendations, that means making a fast and constructive start and providing a clean handoff to those who will implement the recommendations. For a team that makes or does things, it’s keeping the specific performance goals in sharp focus. For a team that runs things, the primary task is distinguishing the challenges that require a real team approach from those that don’t. If a task doesn’t demand joint work-products, a working group can be the more effective option. Team opportunities are usually those in which hierarchy or organizational boundaries inhibit the skills and perspectives needed for optimal results. Little wonder, then, that teams have become the primary units of productivity in high-performance organizations.\n\nEarly in the 1980s, Bill Greenwood and a small band of rebel railroaders took on most of the top management of Burlington Northern and created a multibillion-dollar business in “piggybacking” rail services despite widespread resistance, even resentment, within the company. The Medical Products Group at Hewlett-Packard owes most of its leading performance to the remarkable efforts of Dean Morton, Lew Platt, Ben Holmes, Dick Alberting, and a handful of their colleagues who revitalized a health care business that most others had written off. At Knight-Ridder, Jim Batten’s “customer obsession” vision took root at the Tallahassee Democrat when 14 frontline enthusiasts turned a charter to eliminate errors into a mission of major change and took the entire paper along with them.\n\nSuch are the stories and the work of teams—real teams that perform, not amorphous groups that we call teams because we think that the label is motivating and energizing. The difference between teams that perform and other groups that don’t is a subject to which most of us pay far too little attention. Part of the problem is that team is a word and concept so familiar to everyone.\n\nOr at least that’s what we thought when we set out to do research for our book The Wisdom of Teams. We wanted to discover what differentiates various levels of team performance, where and how teams work best, and what top management can do to enhance their effectiveness. We talked with hundreds of people on more than 50 different teams in 30 companies and beyond, from Motorola and Hewlett-Packard to Operation Desert Storm and the Girl Scouts.\n\nWe found that there is a basic discipline that makes teams work. We also found that teams and good performance are inseparable; you cannot have one without the other. But people use the word team so loosely that it gets in the way of learning and applying the discipline that leads to good performance. For managers to make better decisions about whether, when, or how to encourage and use teams, it is important to be more precise about what a team is and what it isn’t.\n\nMost executives advocate teamwork. And they should. Teamwork represents a set of values that encourage listening and responding constructively to views expressed by others, giving others the benefit of the doubt, providing support, and recognizing the interests and achievements of others. Such values help teams perform, and they also promote individual performance as well as the performance of an entire organization. But teamwork values by themselves are not exclusive to teams, nor are they enough to ensure team performance.\n\nNor is a team just any group working together. Committees, councils, and task forces are not necessarily teams. Groups do not become teams simply because that is what someone calls them. The entire work force of any large and complex organization is never a team, but think about how often that platitude is offered up.\n\nTo understand how teams deliver extra performance, we must distinguish between teams and other forms of working groups. That distinction turns on performance results. A working group’s performance is a function of what its members do as individuals. A team’s performance includes both individual results and what we call “collective work-products.” A collective work-product is what two or more members must work on together, such as interviews, surveys, or experiments. Whatever it is, a collective work-product reflects the joint, real contribution of team members.\n\nWorking groups are both prevalent and effective in large organizations where individual accountability is most important. The best working groups come together to share information, perspectives, and insights; to make decisions that help each person do his or her job better; and to reinforce individual performance standards. But the focus is always on individual goals and accountabilities. Working-group members don’t take responsibility for results other than their own. Nor do they try to develop incremental performance contributions requiring the combined work of two or more members.\n\nTeams differ fundamentally from working groups because they require both individual and mutual accountability. Teams rely on more than group discussion, debate, and decision; on more than sharing information and best practice performance standards. Teams produce discrete work-products through the joint contributions of their members. This is what makes possible performance levels greater than the sum of all the individual bests of team members. Simply stated, a team is more than the sum of its parts.\n\nThe first step in developing a disciplined approach to team management is to think about teams as discrete units of performance and not just as positive sets of values. Having observed and worked with scores of teams in action, both successes and failures, we offer the following. Think of it as a working definition or, better still, an essential discipline that real teams share.\n\nA team is a small number of people with complementary skills who are committed to a common purpose, set of performance goals, and approach for which they hold themselves mutually accountable.\n\nThe essence of a team is common commitment. Without it, groups perform as individuals; with it, they become a powerful unit of collective performance. This kind of commitment requires a purpose in which team members can believe. Whether the purpose is to “transform the contributions of suppliers into the satisfaction of customers,” to “make our company one we can be proud of again,” or to “prove that all children can learn,” credible team purposes have an element related to winning, being first, revolutionizing, or being on the cutting edge.\n\nTeams develop direction, momentum, and commitment by working to shape a meaningful purpose. Building ownership and commitment to team purpose, however, is not incompatible with taking initial direction from outside the team. The often-asserted assumption that a team cannot “own” its purpose unless management leaves it alone actually confuses more potential teams than it helps. In fact, it is the exceptional case—for example, entrepreneurial situations—when a team creates a purpose entirely on its own.\n\nMost successful teams shape their purposes in response to a demand or opportunity put in their path, usually by higher management. This helps teams get started by broadly framing the company’s performance expectation. Management is responsible for clarifying the charter, rationale, and performance challenge for the team, but management must also leave enough flexibility for the team to develop commitment around its own spin on that purpose, set of specific goals, timing, and approach.\n\nThe best teams invest a tremendous amount of time and effort exploring, shaping, and agreeing on a purpose that belongs to them both collectively and individually. This “purposing” activity continues throughout the life of the team. In contrast, failed teams rarely develop a common purpose. For whatever reason—an insufficient focus on performance, lack of effort, poor leadership—they do not coalesce around a challenging aspiration.\n\nThe best teams also translate their common purpose into specific performance goals, such as reducing the reject rate from suppliers by 50% or increasing the math scores of graduates from 40% to 95%. Indeed, if a team fails to establish specific performance goals or if those goals do not relate directly to the team’s overall purpose, team members become confused, pull apart, and revert to mediocre performance. By contrast, when purposes and goals build on one another and are combined with team commitment, they become a powerful engine of performance.\n\nTransforming broad directives into specific and measurable performance goals is the surest first step for a team trying to shape a purpose meaningful to its members. Specific goals, such as getting a new product to market in less than half the normal time, responding to all customers within 24 hours, or achieving a zero-defect rate while simultaneously cutting costs by 40%, all provide firm footholds for teams. There are several reasons:\n\nSpecific team performance goals help to define a set of work-products that are different both from an organizationwide mission and from individual job objectives. As a result, such work-products require the collective effort of team members to make something specific happen that, in and of itself, adds real value to results. By contrast, simply gathering from time to time to make decisions will not sustain team performance.\n\nThe specificity of performance objectives facilitates clear communication and constructive conflict within the team. When a plant-level team, for example, sets a goal of reducing average machine changeover time to two hours, the clarity of the goal forces the team to concentrate on what it would take either to achieve or to reconsider the goal. When such goals are clear, discussions can focus on how to pursue them or whether to change them; when goals are ambiguous or nonexistent, such discussions are much less productive.\n\nThe attainability of specific goals helps teams maintain their focus on getting results. A product-development team at Eli Lilly’s Peripheral Systems Division set definite yardsticks for the market introduction of an ultrasonic probe to help doctors locate deep veins and arteries. The probe had to have an audible signal through a specified depth of tissue, be capable of being manufactured at a rate of 100 per day, and have a unit cost less than a pre-established amount. Because the team could measure its progress against each of these specific objectives, the team knew throughout the development process where it stood. Either it had achieved its goals or not.\n\nAs Outward Bound and other team-building programs illustrate, specific objectives have a leveling effect conducive to team behavior. When a small group of people challenge themselves to get over a wall or to reduce cycle time by 50 % , their respective titles, perks, and other stripes fade into the background. The teams that succeed evaluate what and how each individual can best contribute to the team’s goal and, more important, do so in terms of the performance objective itself rather than a person’s status or personality.\n\nSpecific goals allow a team to achieve small wins as it pursues its broader purpose. These small wins are invaluable to building commitment and overcoming the inevitable obstacles that get in the way of a long-term purpose. For example, the Knight-Ridder team mentioned at the outset turned a narrow goal to eliminate errors into a compelling customer-service purpose.\n\nPerformance goals are compelling. They are symbols of accomplishment that motivate and energize. They challenge the people on a team to commit themselves, as a team, to make a difference. Drama, urgency, and a healthy fear of failure combine to drive teams who have their collective eye on an attainable, but challenging, goal. Nobody but the team can make it happen. It is their challenge.\n\nNot All Groups Are Teams: How to Tell the Difference\n\nThe combination of purpose and specific goals is essential to performance. Each depends on the other to remain relevant and vital. Clear performance goals help a team keep track of progress and hold itself accountable; the broader, even nobler, aspirations in a team’s purpose supply both meaning and emotional energy.\n\nGoals help a team keep track of progress, while a broader purpose supplies meaning and emotional energy.\n\nVirtually all effective teams we have met, read or heard about, or been members of have ranged between 2 and 25 people. For example, the Burlington Northern “piggybacking” team had 7 members, the Knight-Ridder newspaper team, 14. The majority of them have numbered less than 10. Small size is admittedly more of a pragmatic guide than an absolute necessity for success. A large number of people, say 50 or more, can theoretically become a team. But groups of such size are more likely to break into subteams rather than function as a single unit.\n\nWhy? Large numbers of people have trouble interacting constructively as a group, much less doing real work together. Ten people are far more likely than fifty are to work through their individual, functional, and hierarchical differences toward a common plan and to hold themselves jointly accountable for the results.\n\nLarge groups also face logistical issues, such as finding enough physical space and time to meet. And they confront more complex constraints, like crowd or herd behaviors, which prevent the intense sharing of viewpoints needed to build a team. As a result, when they try to develop a common purpose, they usually produce only superficial “missions” and well-meaning intentions that cannot be translated into concrete objectives. They tend fairly quickly to reach a point when meetings become a chore, a clear sign that most of the people in the group are uncertain why they have gathered, beyond some notion of getting along better. Anyone who has been through one of these exercises knows how frustrating it can be. This kind of failure tends to foster cynicism, which gets in the way of future team efforts.\n\nIn addition to finding the right size, teams must develop the right mix of skills, that is, each of the complementary skills necessary to do the team’s job. As obvious as it sounds, it is a common failing in potential teams. Skill requirements fall into three fairly self-evident categories:\n\nTechnical or functional expertise. It would make little sense for a group of doctors to litigate an employment discrimination case in a court of law. Yet teams of doctors and lawyers often try medical malpractice or personal injury cases. Similarly, product-development groups that include only marketers or engineers are less likely to succeed than those with the complementary skills of both.\n\nProblem-solving and decision-making skills. Teams must be able to identify the problems and opportunities they face, evaluate the options they have for moving forward, and then make necessary trade-offs and decisions about how to proceed. Most teams need some members with these skills to begin with, although many will develop them best on the job.\n\nInterpersonal skills. Common understanding and purpose cannot arise without effective communication and constructive conflict, which in turn depend on interpersonal skills. These include risk taking, helpful criticism, objectivity, active listening, giving the benefit of the doubt, and recognizing the interests and achievements of others.\n\nObviously, a team cannot get started without some minimum complement of skills, especially technical and functional ones. Still, think about how often you’ve been part of a team whose members were chosen primarily on the basis of personal compatibility or formal position in the organization, and in which the skill mix of its members wasn’t given much thought.\n\nIt is equally common to overemphasize skills in team selection. Yet in all the successful teams we’ve encountered, not one had all the needed skills at the outset. The Burlington Northern team, for example, initially had no members who were skilled marketers despite the fact that their performance challenge was a marketing one. In fact, we discovered that teams are powerful vehicles for developing the skills needed to meet the team’s performance challenge. Accordingly, team member selection ought to ride as much on skill potential as on skills already proven.\n\nEffective teams develop strong commitment to a common approach, that is, to how they will work together to accomplish their purpose. Team members must agree on who will do particular jobs, how schedules will be set and adhered to, what skills need to be developed, how continuing membership in the team is to be earned, and how the group will make and modify decisions. This element of commitment is as important to team performance as is the team’s commitment to its purpose and goals.\n\nAgreeing on the specifics of work and how they fit together to integrate individual skills and advance team performance lies at the heart of shaping a common approach. It is perhaps self-evident that an approach that delegates all the real work to a few members (or staff outsiders), and thus relies on reviews and meetings for its only “work together” aspects, cannot sustain a real team. Every member of a successful team does equivalent amounts of real work; all members, including the team leader, contribute in concrete ways to the team’s work-product. This is a very important element of the emotional logic that drives team performance.\n\nWhen individuals approach a team situation, especially in a business setting, each has preexisting job assignments as well as strengths and weaknesses reflecting a variety of backgrounds, talents, personalities, and prejudices. Only through the mutual discovery and understanding of how to apply all its human resources to a common purpose can a team develop and agree on the best approach to achieve its goals. At the heart of such long and, at times, difficult interactions lies a commitment-building process in which the team candidly explores who is best suited to each task as well as how individual roles will come together. In effect, the team establishes a social contract among members that relates to their purpose and guides and obligates how they must work together.\n\nNo group ever becomes a team until it can hold itself accountable as a team. Like common purpose and approach, mutual accountability is a stiff test. Think, for example, about the subtle but critical difference between “the boss holds me accountable” and “we hold ourselves accountable.” The first case can lead to the second; but without the second, there can be no team.\n\nThink about the difference between “the boss holds me accountable” and “we hold ourselves accountable.”\n\nCompanies like Hewlett-Packard and Motorola have an ingrained performance ethic that enables teams to form “organically” whenever there is a clear performance challenge requiring collective rather than individual effort. In these companies, the factor of mutual accountability is commonplace. “Being in the boat together” is how their performance game is played.\n\nAt its core, team accountability is about the sincere promises we make to ourselves and others, promises that underpin two critical aspects of effective teams: commitment and trust. Most of us enter a potential team situation cautiously because ingrained individualism and experience discourage us from putting our fates in the hands of others or accepting responsibility for others. Teams do not succeed by ignoring or wishing away such behavior.\n\nMutual accountability cannot be coerced any more than people can be made to trust one another. But when a team shares a common purpose, goals, and approach, mutual accountability grows as a natural counterpart. Accountability arises from and reinforces the time, energy, and action invested in figuring out what the team is trying to accomplish and how best to get it done.\n\nWhen people work together toward a common objective, trust and commitment follow. Consequently, teams enjoying a strong common purpose and approach inevitably hold themselves responsible, both as individuals and as a team, for the team’s performance. This sense of mutual accountability also produces the rich rewards of mutual achievement in which all members share. What we heard over and over from members of effective teams is that they found the experience energizing and motivating in ways that their “normal” jobs never could match.\n\nOn the other hand, groups established primarily for the sake of becoming a team or for job enhancement, communication, organizational effectiveness, or excellence rarely become effective teams, as demonstrated by the bad feelings left in many companies after experimenting with quality circles that never translated “quality” into specific goals. Only when appropriate performance goals are set does the process of discussing the goals and the approaches to them give team members a clearer and clearer choice: they can disagree with a goal and the path that the team selects and, in effect, opt out, or they can pitch in and become accountable with and to their teammates.\n\nThe discipline of teams we’ve outlined is critical to the success of all teams. Yet it is also useful to go one step further. Most teams can be classified in one of three ways: teams that recommend things, teams that make or do things, and teams that run things. In our experience, each type faces a characteristic set of challenges.\n\nTeams that recommend things. These teams include task forces, project groups, and audit, quality, or safety groups asked to study and solve particular problems. Teams that recommend things almost always have predetermined completion dates. Two critical issues are unique to such teams: getting off to a fast and constructive start and dealing with the ultimate handoff required to get recommendations implemented.\n\nThe key to the first issue lies in the clarity of the team’s charter and the composition of its membership. In addition to wanting to know why and how their efforts are important, task forces need a clear definition of whom management expects to participate and the time commitment required. Management can help by ensuring that the team includes people with the skills and influence necessary for crafting practical recommendations that will carry weight throughout the organization. Moreover, management can help the team get the necessary cooperation by opening doors and dealing with political obstacles.\n\nMissing the handoff is almost always the problem that stymies teams that recommend things. To avoid this, the transfer of responsibility for recommendations to those who must implement them demands top management’s time and attention. The more top managers assume that recommendations will “just happen,” the less likely it is that they will. The more involvement task force members have in implementing their recommendations, the more likely they are to get implemented.\n\nTo the extent that people outside the task force will have to carry the ball, it is critical to involve them in the process early and often, certainly well before recommendations are finalized. Such involvement may take many forms, including participating in interviews, helping with analyses, contributing and critiquing ideas, and conducting experiments and trials. At a minimum, anyone responsible for implementation should receive a briefing on the task force’s purpose, approach, and objectives at the beginning of the effort as well as regular reviews of progress.\n\nTeams that make or do things. These teams include people at or near the front lines who are responsible for doing the basic manufacturing, development, operations, marketing, sales, service, and other value-adding activities of a business. With some exceptions, like new-product development or process design teams, teams that make or do things tend to have no set completion dates because their activities are ongoing.\n\nIn deciding where team performance might have the greatest impact, top management should concentrate on what we call the company’s “critical delivery points,” that is, places in the organization where the cost and value of the company’s products and services are most directly determined. Such critical delivery points might include where accounts get managed, customer service performed, products designed, and productivity determined. If performance at critical delivery points depends on combining multiple skills, perspectives, and judgments in real time, then the team option is the smartest one.\n\nWhere does the team option make sense? Where the cost and value of the company’s products and services are most directly determined.\n\nWhen an organization does require a significant number of teams at these points, the sheer challenge of maximizing the performance of so many groups will demand a carefully constructed and performance-focused set of management processes. The issue here for top management is how to build the necessary systems and process supports without falling into the trap of appearing to promote teams for their own sake.\n\nThe imperative here, returning to our earlier discussion of the basic discipline of teams, is a relentless focus on performance. If management fails to pay persistent attention to the link between teams and performance, the organization becomes convinced that “this year we are doing ‘teams.’” Top management can help by instituting processes like pay schemes and training for teams responsive to their real time needs, but more than anything else, top management must make clear and compelling demands on the teams themselves and then pay constant attention to their progress with respect to both team basics and performance results. This means focusing on specific teams and specific performance challenges. Otherwise “performance,” like “team,” will become a cliché.\n\nTop management’s focus on teams and performance challenges will keep both “performance” and “team” from becoming clichés.\n\nTeams that run things. Despite the fact that many leaders refer to the group reporting to them as a team, few groups really are. And groups that become real teams seldom think of themselves as a team because they are so focused on performance results. Yet the opportunity for such teams includes groups from the top of the enterprise down through the divisional or functional level. Whether it is in charge of thousands of people or a handful, as long as the group oversees some business, ongoing program, or significant functional activity, it is a team that runs things.\n\nThe main issue these teams face is determining whether a real team approach is the right one. Many groups that run things can be more effective as working groups than as teams. The key judgment is whether the sum of individual bests will suffice for the performance challenge at hand or whether the group must deliver substantial incremental performance requiring real, joint work-products. Although the team option promises greater performance, it also brings more risk, and managers must be brutally honest in assessing the trade-offs.\n\nMembers may have to overcome a natural reluctance to trust their fate to others. The price of faking the team approach is high: at best, members get diverted from their individual goals, costs outweigh benefits, and people resent the imposition on their time and priorities; at worst, serious animosities develop that undercut even the potential personal bests of the working-group approach.\n\nWorking groups present fewer risks. Effective working groups need little time to shape their purpose since the leader usually establishes it. Meetings are run against well-prioritized agendas. And decisions are implemented through specific individual assignments and accountabilities. Most of the time, therefore, if performance aspirations can be met through individuals doing their respective jobs well, the working-group approach is more comfortable, less risky, and less disruptive than trying for more elusive team performance levels. Indeed, if there is no performance need for the team approach, efforts spent to improve the effectiveness of the working group make much more sense than floundering around trying to become a team.\n\nBuilding Team Performance Although there is no guaranteed how-to recipe for building team performance, we observed a number of approaches shared by many successful teams. Establish urgency, demanding performance standards, and direction. All team members need to believe the team has urgent and worthwhile purposes, and they want to know what the expectations are. Indeed, the more urgent and meaningful the rationale, the more likely it is that the team will live up to its performance potential, as was the case for a customer-service team that was told that further growth for the entire company would be impossible without major improvements in that area. Teams work best in a compelling context. That is why companies with strong performance ethics usually form teams readily. Select members for skill and skill potential, not personality. No team succeeds without all the skills needed to meet its purpose and performance goals. Yet most teams figure out the skills they will need after they are formed. The wise manager will choose people both for their existing skills and their potential to improve existing skills and learn new ones. Pay particular attention to first meetings and actions. Initial impressions always mean a great deal. When potential teams first gather, everyone monitors the signals given by others to confirm, suspend, or dispel assumptions and concerns. They pay particular attention to those in authority: the team leader and any executives who set up, oversee, or otherwise influence the team. And, as always, what such leaders do is more important than what they say. If a senior executive leaves the team kickoff to take a phone call ten minutes after the session has begun and he never returns, people get the message. Set some clear rules of behavior. All effective teams develop rules of conduct at the outset to help them achieve their purpose and performance goals. The most critical initial rules pertain to attendance (for example, “no interruptions to take phone calls”), discussion (“no sacred cows”), confidentiality (“the only things to leave this room are what we agree on”), analytic approach (“facts are friendly”), end-product orientation (“everyone gets assignments and does them”), constructive confrontation (“no finger pointing”), and, often the most important, contributions (“everyone does real work”). Set and seize upon a few immediate performance-oriented tasks and goals. Most effective teams trace their advancement to key performance-oriented events. Such events can be set in motion by immediately establishing a few challenging goals that can be reached early on. There is no such thing as a real team without performance results, so the sooner such results occur, the sooner the team congeals. Challenge the group regularly with fresh facts and information. New information causes a team to redefine and enrich its understanding of the performance challenge, thereby helping the team shape a common purpose, set clearer goals, and improve its common approach. A plant quality improvement team knew the cost of poor quality was high, but it wasn’t until they researched the different types of defects and put a price tag on each one that they knew where to go next. Conversely, teams err when they assume that all the information needed exists in the collective experience and knowledge of their members. Spend lots of time together. Common sense tells us that team members must spend a lot of time together, scheduled and unscheduled, especially in the beginning. Indeed, creative insights as well as personal bonding require impromptu and casual interactions just as much as analyzing spreadsheets and interviewing customers. Busy executives and managers too often intentionally minimize the time they spend together. The successful teams we’ve observed all gave themselves the time to learn to be a team. This time need not always be spent together physically; electronic, fax, and phone time can also count as time spent together. Exploit the power of positive feedback, recognition, and reward. Positive reinforcement works as well in a team context as elsewhere. “Giving out gold stars” helps to shape new behaviors critical to team performance. If people in the group, for example, are alert to a shy person’s initial efforts to speak up and contribute, they can give the honest positive reinforcement that encourages continued contributions. There are many ways to recognize and reward team performance beyond direct compensation, from having a senior executive speak directly to the team about the urgency of its mission to using awards to recognize contributions. Ultimately, however, the satisfaction shared by a team in its own performance becomes the most cherished reward.\n\nHaving said that, we believe the extra level of performance teams can achieve is becoming critical for a growing number of companies, especially as they move through major changes during which company performance depends on broad-based behavioral change. When top management uses teams to run things, it should make sure the team succeeds in identifying specific purposes and goals.\n\nThis is a second major issue for teams that run things. Too often, such teams confuse the broad mission of the total organization with the specific purpose of their small group at the top. The discipline of teams tells us that for a real team to form there must be a team purpose that is distinctive and specific to the small group and that requires its members to roll up their sleeves and accomplish something beyond individual end-products. If a group of managers looks only at the economic performance of the part of the organization it runs to assess overall effectiveness, the group will not have any team performance goals of its own.\n\nWhile the basic discipline of teams does not differ for them, teams at the top are certainly the most difficult. The complexities of long-term challenges, heavy demands on executive time, and the deep-seated individualism of senior people conspire against teams at the top. At the same time, teams at the top are the most powerful. At first we thought such teams were nearly impossible. That is because we were looking at the teams as defined by the formal organizational structure, that is, the leader and all his or her direct reports equals the team. Then we discovered that real teams at the top were often smaller and less formalized—Whitehead and Weinberg at Goldman, Sachs; Hewlett and Packard at HP; Krasnoff, Pall, and Hardy at Pall Corp; Kendall, Pearson, and Calloway at Pepsi; Haas and Haas at Levi Strauss; Batten and Ridder at Knight-Ridder. They were mostly twos and threes, with an occasional fourth.\n\nTeams at the top are the most difficult but also the most powerful.\n\nNonetheless, real teams at the top of large, complex organizations are still few and far between. Far too many groups at the top of large corporations needlessly constrain themselves from achieving real team levels of performance because they assume that all direct reports must be on the team; that team goals must be identical to corporate goals; that the team members’ positions rather than skills determine their respective roles; that a team must be a team all the time; and that the team leader is above doing real work.\n\nAs understandable as these assumptions may be, most of them are unwarranted. They do not apply to the teams at the top we have observed, and when replaced with more realistic and flexible assumptions that permit the team discipline to be applied, real team performance at the top can and does occur. Moreover, as more and more companies are confronted with the need to manage major change across their organizations, we will see more real teams at the top.\n\nWe believe that teams will become the primary unit of performance in high-performance organizations. But that does not mean that teams will crowd out individual opportunity or formal hierarchy and process. Rather, teams will enhance existing structures without replacing them. A team opportunity exists anywhere hierarchy or organizational boundaries inhibit the skills and perspectives needed for optimal results. Thus, new-product innovation requires preserving functional excellence through structure while eradicating functional bias through teams. And frontline productivity requires preserving direction and guidance through hierarchy while drawing on energy and flexibility through self-managing teams.\n\nWe are convinced that every company faces specific performance challenges for which teams are the most practical and powerful vehicle at top management’s disposal. The critical role for senior managers, therefore, is to worry about company performance and the kinds of teams that can deliver it. This means that top management must recognize a team’s unique potential to deliver results, deploy teams strategically when they are the best tool for the job, and foster the basic discipline of teams that will make them effective. By doing so, top management creates the kind of environment that enables team as well as individual and organizational performance."}, {"url": "https://pro-football-history.com/coach/952/danny-smith-bio", "page_content": "Danny Smith\n\nCoaching Record\n\nYears Coached Record Win % Playoff record Playoff win % 29 226-221-3 50.56% 5-12 29.41%\n\nBiography\n\nCareer Summary\n\nDanny Smith is a football coach in the National Football League (NFL) and has been the special teams coordinator for the Pittsburgh Steelers since 2013. During this time period, the Steelers compiled a 100-60-2 record.\n\nPersonal Information\n\nSmith was born on Monday, September 7, 1953 in Pittsburgh, Pennsylvania.\n\nHistory\n\nCoach history guide"}, {"url": "https://steelersdepot.com/2022/06/danny-smith-compares-starter-mentality-on-special-teams-to-najee-harris-where-are-you-getting-your-carries/", "page_content": "I have no idea the number of articles over the past nine years that I’ve begun with some variation of talking about how special teams is an area of the game that most people don’t care about until they have to—a missed field goal, at shanked punt, a fumble, a long return allowed. I don’t know how many times I’ve written this. I just know it’s a lot.\n\nThe good news is that most teams tend to value special teams more than most fans do, which is why the majority of them actually have a special teams coordinator, who is as responsible for his group as the offensive and defensive coordinators are for theirs.\n\nIn the Pittsburgh Steelers’ case, that would be Danny Smith, who has been with the team for a decade now. The results that he gets out of his units—which are always dependent upon what players he is allowed to keep on the 53-man roster—can be debated, but I think anybody who has seen him at work will not question the effort he puts in, and the effort he demands from his players.\n\nThat’s because he doesn’t let them look at special teams as a task, a duty, a responsibility, or even a punishment. It’s a starting job. Even if you have one role on one unit, say, an edge on the field goal blocking unit, that’s your starting job, and that’s how you should approach it, even if it’s four or five snaps a game.\n\nOthers may have four or five roles, which takes them across 300 snaps per season, even pushing 400 snaps. These are the ‘four-phase’ special teams players you may have seen written here and there—generally, those are asked to play on both punt and kickoff return and coverage units. They could additionally play on the field goal or blocking units, to boot.\n\nWhatever they’re asked to do, however, Smith asks them to do it with the mentality of a starter. That’s what he looks for. “It’s cool in college not to have to go to a punt team meeting”, he told reporters during the spring, via 93.7 The Fan. “You hang out on campus, you going to lunch or whatever you are doing. It’s cool not to go to the punt team meeting, but it ain’t cool no more”. Now it’s your job.\n\n“We were talking to the running backs and the safeties”, he said of how he addressed his group. “I used the example; ‘Men, Najee Harris isn’t coming out of a game. Where are you getting your carries?’. I said, ‘Minkah Fitzpatrick isn’t coming out of a game’”.\n\nSo who isn’t coming out of the game for the Steelers? Last year, there were five players who played a much larger role than everybody else—all of them over 60 percent of the special teams snaps. Those were Ulysees Gilbert III, Miles Killebrew, Derek Watt, Benny Snell Jr., and Marcus Allen. Robert Spillane would have been up there as well if not for his knee injury.\n\nJustin Layne and James Pierre were also at or near 50 percent, but those five all logged 300-plus snaps. Those are the Najees and Minkahs for Danny Smith—even if none of them played more than 110 snaps on offense or defense. Spillane, with over 300 defensive snaps, would have been the exception."}, {"url": "https://prabook.com/web/danny.smith/2530979", "page_content": "Danny Smith\n\nsports coach\n\nSeptember 7, 1953 (age 40)\n\nPrior to the Steelers, Smith coached the Redskins special teams from 2004 to 2012 and the Buffalo Bills’ special teams from 2001 to 2003. His kicking specialists ranked in the top 10 in field goal percentage and gross and Netto punting average. Smith was tight ends coach with the Detroit Lions from 1999 to 2000. He had a four-year stint with the Philadelphia Eagles from 1995 to 1998, serving two seasons as special teams coach and two coaching the defensive backs. Before joining the NFL coaching ranks, Smith spent eight years at Georgia Technical (1987–1994) where he coached several positions including running backs, wide receivers and defensive backs. He helped coach the Yellow Jackets team that split the National Collegiate Athletic Association National Championship with Colorado in 1990. Smith began his college coaching career as a graduate assistant at his alma mater Edinboro State. He also coached at The Citadel, William & Mary and Clemson. Smith entered the coaching ranks at his high school alma mater Central Catholic High School in Pittsburgh where he helped tutor future Miami Dolphins quarterback and Hall of Famer Dan Marino. Smith graduated from Edinboro State."}, {"url": "https://steelerswire.usatoday.com/2020/08/20/steelers-derek-watt-danny-smith-training-camp-nfl/", "page_content": "'He's a Watt. His mom and dad should be writing books and we should all be reading it. I have plans for him. I am so glad we got him.' – Danny Smith on @DerekWatt34 — Teresa Varley (@Teresa_Varley) August 19, 2020\n\n[jwplayer lNMqp3Xb-ThvAeFxT]\n\nThanks to free agency, the Pittsburgh Steelers now have two-thirds of the best football family in the NFL. No, the Steelers didn’t sign defensive lineman J.J. Watt but they did add his brother, fullback Derek Watt.\n\nWhile the signing of T.J.’s brother did mean the end for fan-favorite Roosevelt Nix, it does add Watt who according to special teams coach Danny Smith is a great signing for the Steelers.\n\nSmith is a real character and he didn’t mince words about the power of the Watt DNA.\n\nThe Steelers are one of the few teams in the NFL who still employ a fullback on offense occasionally. Nix fell out of favor on offense but perhaps Watt’s athleticism will give the Steelers a way to add some new wrinkles to the offense. But if not, it sounds like Smith is ready to work him hard on special teams.\n\nGallery Check out the best pics from the first 2 weeks of Steelers training camp View 217 photos"}, {"url": "https://www.miamidolphins.com/news/top-news-danny-crossman-dictating-the-terms", "page_content": "One of Flores' greatest strengths as a coach and a leader is his trust and faith in his staff; his ability to empower coaches like Crossman to do what they do best.\n\n\"I trust that they're going to have the answers we're looking for in their respective side of the ball,\" Flores said. \"I'll make suggestions, but at the end of the day, I try to let those guys coach and then obviously occasionally I'll make my thoughts known. But I think it's worked out for the most part.\"\n\nAs the numbers tell you, it's working out. In addition to the league's best kickoff coverage unit, Miami racks up even more hidden yardage through penalties. Each of the last three weeks the opposing kick return unit committed a foul on a Dolphins kickoff. As a result of the fouls, the Jets, Broncos and Chargers were forced to begin drives at their own 7-, 11-, and 7-yard lines, respectively.\n\n\"You got two kicks – you can try and pound it out of the end zone or you can try and hang it up for a little more hang time and make it a returnable ball; but we've got a lot of thanks to our cover guys,\" kicker Jason Sanders said. \"We have a lot of good guys on kickoff, so they've been doing a lot of good work this year and you've got to give props to Crossman, too. Everything we do is a play from Crossman.\"\n\nWill and desire go a long way in life, in sports, in football and especially on special teams.\n\n\"Special teams is more of a decision than offense or defense,\" Dolphins wide receiver Mack Hollins said. \"On offense and defense, you can have a good play design that'll end up being the success whereas special teams, you're going to decide if you're going to give it your all or decide that you're going to take a play off and then something bad might happen.\""}, {"url": "https://sportspt.org/Members/Members/News/2022.05.02-In-Memory-of-Danny-Smith.aspx", "page_content": "Danny Dale Smith was not only a professional colleague but a good friend of mine. We met while we were both in PT school (years and years ago). At that time there were very few programs – one in Tennessee, one in Kentucky and one in Alabama. Those three had program directors who were not only friends but visionaries and brought students from the three programs together. Dr. Ray Patterson was on the faculty at Tennessee and introduced me to one of his students, Danny….. that started a long, respectful relationship.\n\nDanny was a leader in his community and his profession. Danny served on the school board; he volunteered with the Boys Club. He loved his community and giving back.\n\nHe was one of the first PTs in Tennessee to get his transitional DPT degree. He then went on to pioneer a new degree offered by the University of St. Augustine, a DHSc degree. I was fortunate at the time to be on Danny’s committee and attend his graduation. He and his good friend, Mike Voight, were the pioneers for that program.\n\nDanny had one of the first private practices in Tennessee – in east Tennessee, in the Tri-Cities. He founded and owned Physical Therapy Services for over 40 years. Everyone knew him – I wonder why? That smile of his and his ability to talk to anyone about anything and tell a great story. He loved his profession and direct patient care. His pride was working with Elizabethton High School sports and other schools in the area. He was an advocate for quality sports care for his athletes both on and off the field. Those relationships helped build his reputation and his practice in the community. He was inducted into the Sports Hall of Fame in the Tri-Cities area in recognition of his service.\n\nHis love for his profession carried over to his volunteer mentality – serving with the Tennessee Chapter, APTA and the American Academy of Sports Physical Therapy – the Sports Section, as it will always be to many of us. Danny took over the challenges of providing the emergency first responder course for the section, teaching countless of our developing sports physical therapists over the years. In fact, he was my instructor when I had to renew for recertification as an SCS. Danny had so many students in his clinic over the years that it is difficult to know how many lives he touched thru that venue. Let’s just say that if you met Danny Smith, you had a friend for life and one you could count on for whatever you might need. Danny was inducted into the Turner A Blackburn Hall of Fame for the sports section and was a recipient of the Ron Peyton Award.\n\nHe was recognized by the APTA with the Lucy Blair Service Award and by the Tennessee chapter with numerous recognitions. He leaves a legacy for all of us; get involved and make our profession better every day.\n\n\n\nDanny and I went thru many life challenges together, getting married, having daughters we loved. He watched his son grow up and become a PT. He loved his family more than anything and his grandchildren were the apples of his eye. His wife Kathy has been his partner in everything for over 40 years and put up not only with Danny, his profession but his professional colleagues and friends.\n\nNeedless to say, we are all much better off for knowing Danny Dale Smith. Rest in Peace my friend.\n\n\n\nBarb Sanders"}, {"url": "https://www.washingtonpost.com/news/football-insider/wp/2013/01/30/special-teams-coach-danny-smith-leaving-for-pittsburgh-steelers/", "page_content": "Gift Article Share\n\nLongtime Redskins special teams coach Danny Smith has accepted the same position with the Pittsburgh Steelers, a person with knowledge of the situation confirmed Wednesday. Smith, who has coached Washington’s special teams since 2004, received permission to interview with the Steelers earlier this week. He has long been pursued by opposing teams, but the Redskins have always worked to keep him on staff.\n\nThe Steelers asked to interview Smith in 2010, but were denied. But the Redskins allowed Smith to interview with his hometown team this offseason. Smith still has family in the Pittsburgh area.\n\n“He is one of the best coaches, from a technician standpoint. Very detailed and just a great motivator. He brought a passion and fire that really spread throughout the building,” special teams captain Lorenzo Alexander said. ”Guys loved playing for him and not just because of the football aspects, but because you could really tell he cared about you off the field too.”\n\nAdvertisement\n\n“He made it an honor to play special teams,” Alexander added. “A lot of places, it’s like you’re not good enough to play offense or defense so they throw you on special teams and let’s see what happens. But Danny approached it with the mindset that special teams can help decide the outcome of games if guys really took pride in it. He will definitely be missed.”\n\nSmith came under scrutiny early this season when Washington had two punts blocked. But his unit improved as the season progressed and finished in solid statistical standing.\n\nWashington ranked 16th in the league on kickoff returns this season, with a 23.5-yard average, and 17th on punt returns (9.3 ypr). The kickoff return average marked an improvement on last year’s 22.1-yard-per-return average. The Redskins averaged 8.9 yards per punt return in 2011. They ranked 12th in the league on kickoff coverage with an average of 23.0 yards allowed per kick return. On punt coverage, Washington allowed 8.2 yards per return, eighth in the NFL.\n\nAdvertisement\n\nThe kicking game solidified when the Redskins signed Kai Forbath to replace Billy Cundiff six weeks into the season. Forbath went 17-for-18 on field goals, and by making the first 17 attempts of his career, set an NFL record for first-year kickers.\n\nEarlier this offseason the Redskins lost receivers coach Ike Hilliard to the Buffalo Bills. He and Smith are the only coaches to depart so far\n\nIn 2010, Washington hired Richard Hightower to serve as Smith’s assistant. It wasn’t immediately clear how Smith’s departure would affect Hightower’s status.\n\nGiftOutline Gift Article"}]}