{"Hope Cooke was born in New York City.": [{"url": "https://jfk.artifacts.archives.gov/people/2239/queen-hope-cooke?ctx=8a46313f50c51e681a7cd43d2f828914fe85ac48&idx=150", "page_content": "Queen Hope Cooke\n\nCooke was born in San Francisco and spent much of her childhood in New York City. She graduated from Sarah Lawrence College. Hope Cooke married the Crown Prince of Sikkim (Palden Thondup Namgyal) on March 20, 1963. Nine months later the Crown Prince became King until 1973 when he was deposed from the thrown and put under house arrest. In 1975 Sikkim joined the Union of India. Cooke moved back to New York City in 1973 where she continues to live. In 2007 Cooke published an auto-biography entitled Time Change.\n\n"}, {"url": "https://www.nytimes.com/1976/06/18/archives/hope-cooke-from-queen-of-sikkim-to-regular-new-yorker.html", "page_content": "“I am no longer in a state of suspense,” Mrs. Namgyal said, brushing her short, reddish‐brown hair out of her eves. “I know now that we will be able to stay here and we just want to get on with our lives.”\n\nYesterday she was wearing a chocolate‐colored T‐shirt, white cotton slacks and canvas espadrilles. Those who remember her from the earlier photographs, dressed in flowing robes with her long hair in an upswept bouffant hairstyle, today would not recognize the former queen, who will be 36 years old next week. That lack of recognition is just fine with her.\n\n“That is another reason why I didn't want the papers taking pictures of me and the children,” she added. “If you are recognized on a bus or on the street, normal conversation stops and you become what others want you to be. I don't want that for us, so I still don't want to be photographed.\n\nThe talk of the public's curiosity over her and her children — the boy is now 12 and the girl is 8 — is an obvious irritant. In a way she resents the fact that so much attention has been paid to their personal losses but little to problems of the country and its people.\n\n“It is a heartbreaking situation,’ Mrs. Namgyal said. “Heartbreaking not because of the loss of my husband's personal power, but because of what has happened to the country.”"}, {"url": "https://www.historyofroyalwomen.com/the-royal-women/last-gyalmo-sikkim-hope-cooke/", "page_content": "“The Fairytale Turned Nightmare?” reads the headline of the New York Times from May 1981 referencing to a lesser known American woman who married into a royal family. That woman was Hope Cooke. It was based on her autobiography.\n\nIt spoke about how the American media was enamoured with an American marrying Crown Prince Palden Thondup Namgyal of Sikkim in 1963. The press always heavily followed any trips of theirs to the United States. Vogue wanted to know her beauty secrets. What the media did not know was that this so-called fairy tale was anything but.\n\nHope Cooke was born on 24 June 1940 in San Francisco, California to John J. Cooke and Hope Noyes. When Hope was not yet two, her mother died in a single person plane crash in 1942. Her father then moved her and her sister, Harriet, to New York City with him to an apartment that was across the hall from their maternal grandparents (who Hope claimed were aloof and refused to talk about her mother). Hope and Harriet were raised by governesses; one beat the future royal with a coat hanger when she could not remember the Lord’s Prayer. Their grandfather died when Hope was 12, and their grandmother passed away just three years later when Hope was 15.\n\nFrom then, Hope and Harriet lived with their maternal aunt and uncle; the latter was the former US Ambassador to Iran and Peru. Hope studied at both the Chaplin School in New York and the Madeira School in Virginia. She completed her high school education in Iran.\n\nShe chose to continue her studies and head to university. She enrolled at Sarah Lawrence College in 1959 where she majored in Asian Studies. One summer she travelled to India with her later recalling, “I’ve never been so happy … India! My heart explodes … The East is my home…” It was in Darjeeling that she met the recently widowed Palden Thondup Namgyal, Crown Prince of Sikkim.\n\nThey became engaged two years later, in 1961, after bonding over what the New York Times called the “similar isolation of their childhoods.” The couple did not marry until 1963 due to astrologers claiming 1962 was a bad year for marriages.\n\nThe Crown Prince and Hope wed after the latter had renounced her American citizenship, in a Buddhist monastery on 20 March 1963; their ceremony was officiated by 14 lamas – the title for a high priest in Tibetian Buddhism. Although the wedding was a Buddhist ceremony, Hope never converted from Christianity. However, she was known to have practised Buddhism from an early age.\n\nTogether, they had two children: Prince Palden Gyurmed Namgyal and Princess Hope Leezum Namgyal. Hope gained three stepchildren (Prince Tenzing Kunzang Jigme Namgyal, Prince Tobgyal Wangchuk Tenzing Namgyal and Princess Yangchen Dolma Namgyal) from the union who she adored. She vowed that her children would know happiness and not grow up with the sad family life like both their parents.\n\nJust two years after their nuptials, the Crown Prince was proclaimed Sikkim’s monarch (Chogyal or King) on 4 April 1965. His reign would be short, as he was deposed ten years later on 10 April 1975. He was put under house arrest in the palace. Not long after, Hope and Palden separated with Hope returning with their two children to the United States.\n\nHope later described her ex-husband as a heavy-drinker, sexist and philanderer. He continued his affair that started before he married Hope with a Belgian woman during their marriage. However, she was not innocent as she was also having an affair with an American man.\n\nHer popularity waned with Newsweek even calling her the Himalayan Marie-Antoinette after Sikkim was annexed into India. A US Representative and US Senator co-sponsored a bill to give Hope her American citizenship back, but the bill would not pass until the language was altered to only give her permanent residence status. President Ford signed it in 1976. She and the Chogyal divorced in 1980. He died just two years later of cancer.\n\nIn 1983, she married for a second time to Mike Wallace, but this union did not last. She resided in London for a time, but she eventually returned to the United States. Hope now works as a writer and lecturer and lives in Brooklyn, New York."}, {"url": "https://www.nytimes.com/1981/03/08/books/the-fairy-tale-that-turned-nightmare.html", "page_content": "Hope's loneliness and confusion grow over the years, and so does her spiritual quest. Grandfather dies when she's 12, Granny dies three years later. She goes to live with her aunt and uncle, Mary and Selden Chapin, then the ambassador to Iran, and finishes high school there. One summer in her late teens she travels to India: ''I've never been so happy ... India! My heart explodes ... The East is my home ... I must stay near India somehow ...''\n\nHope Cooke is majoring in Asian studies at Sarah Lawrence when she meets the recently widowed Crown Prince of Sikkim in Darjeeling (where, with typical eccentricity, she is taking a course in typing). Two years later they are engaged. The writer immediately hints at the complex pragmatism of this alliance: Her impulse toward him may be inspired by her fascination with Indian spirituality and her desire for some kind of rootedness; his impulse toward her is in part prompted by his need to find a mother for his children. Both are also driven toward each other by the similar isolation of their childhoods. ''Even more than me,'' Hope muses about the Prince's ''Chaplinesque loneliness,'' ''when he was small he had a rather sad life.''\n\nHope Cooke is an exceptionally chaste adventuress who seeks the tamer shores of security rather than the wilder shores of love. She's perhaps more infatuated with the prospect of nesting in her little Oriental palace than she is with the moody king. ''I want a family so much. I want to fill this nest, make it a real home.'' One of the most touching aspects of this story is her delight in recapturing childhood through her affection for her three stepchildren, whom she seems to love quite as much as she will later love her own son and daughter. She exults when her modest (five-bedroom) palace explodes with offspring and the family consumes 12 dozen eggs a week. She has made a fierce resolution to reverse the karma that had saddened her childhood and her husband's.''These children will be happy. The wheel of unhappiness that both my husband and I grew up on will not go to this generation.''\n\nBut the monsters lurking in Hope's fairy tale appear soon after her marriage. The Crown Prince may well have been one of the Far East's most enlightened rulers, as both the author and the historical record confirm: He shaped a model Asian state whose literacy rate and per capita income were twice as high as the neighboring countries of Nepal, Bhutan and India; he retained a measure of independence for a tiny country threatened on two sides, by an India intent on annexation and an equally aggressive Communist-dominated Tibet. Yet, as Hope Cooke describes him, he was also a heavy-drinking philanderer with an odious streak of macho sexism. Notwithstanding his strained finances, the Crown Prince managed to maintain a love affair with a married woman in Belgium before and during his marriage to Hope; he even flew to visit her a few weeks before Hope's first child was born. The lover wrote letters to the Prince on ''crisp rustling paper'' that Hope could hear crinkling in her husband's bathrobe when he hugged her at night. If a letter dropped to the floor, she read it while he went to the altar to perform his Buddhist prayers.\n\nWhen Sikkim's independence was endangered by the death of Nehru, who had carefully preserved Sikkim's autonomy under the terms of a protectorate, the Crown Prince began to drink more and throw temper tantrums. During one such tantrum, he tosses Hope's record player, her ''lifeline to the West,'' out the window. Fairy tale turns to nightmare as Indira Gandhi conspires to deprive Sikkim of the little independence it has. While Hope entertains visiting reporters interested in ''My Thirty Ways of Preparing Yak,'' she is secretly tippling beer in the morning, living on whisky, Valium and cigarettes from noon on. She begins to realize that the manic fervor with which she'd developed Sikkim's cottage industries and helped her husband fight Indian domination is a substitute for a love that barely exists, if it ever existed. On one of her yearly trips to New York, she has an affair with a man who had been a friend during her lonely adolescence, and the memory of this affair haunts her for the rest of her stay in the Far East. She lies in bed more dazed than ever by whisky and Valium, listening to Joan Baez sing freedom songs."}, {"url": "https://fampeople.com/cat-hope-cooke", "page_content": "Hope Cooke : biography\n\nHope Cooke (born June 24, 1940) is an American woman who was the \"Gyalmo\" () (Queen Consort) of the 12th Chogyal (King) of Sikkim (Palden Thondup Namgyal). Their wedding took place in March 1963.\n\nPalden Thondup Namgyal was to be the last king of Sikkim as a protectorate state under India. By 1973, the country—and their marriage—were crumbling; soon Sikkim was annexed by India. Five months after the violent takeover of Sikkim had begun, Cooke returned to the USA with her two birth children and step-daughter to put them in schools in New York City. Cooke and her husband divorced in 1980 and Namgyal died of cancer in 1982. Cooke wrote an autobiography, Time Change (Simon & Schuster 1981) and began a career as a lecturer, book critic and magazine contributor, later becoming an urban historian. In her new life as a student of New York City, Cooke published Seeing New York (Temple University Press 1995); worked as a newspaper columnist (Daily News); taught at Yale University, Sarah Lawrence, and Birchwathen, a New York City independent school. During this time she ran the Public History walking program at the Museum of the City of New York and lectured widely on urban history and East-West cultural ties.\n\nPublications\n\nTime Change: an autobiography , New York: Simon & Schuster, 1981. ISBN 0-671-41225-6.\n\n, New York: Simon & Schuster, 1981. ISBN 0-671-41225-6. Teaching the Magic of Dance , New York : Simon & Schuster, 1983 (with Jacques d’Amboise). ISBN 0-671-46077-3.\n\n, New York : Simon & Schuster, 1983 (with Jacques d’Amboise). ISBN 0-671-46077-3. , Philadelphia : Temple University Press, 1995. ISBN 1-56639-289-6.\n\nHope Cook wrote several articles for the Bulletin of Tibetology, published by the Namgyal Institute of Tibetology.\n\nMarriage to the Crown Prince of Sikkim\n\nIn 1959, Cooke was a freshman majoring in Asian Studies at Sarah Lawrence College and sharing an apartment with actress Jane Alexander. She went on a summer trip to India and met Palden Thondup Namgyal, Crown Prince of Sikkim, in the bar of the Windamere Hotel in Darjeeling, India. He was a recent widower with two sons and a daughter, and, aged 36, nearly twice her age. They were drawn to each other by the similar isolation of their childhoods. Two years later, in 1961, their engagement was announced; but the wedding was put off for more than a year because astrologers in both Sikkim and India warned that 1962 was an inauspicious year for marriages.\n\nOn March 20, 1963, Cooke married Namgyal in a Buddhist monastery. She renounced her United States citizenship as required by Sikkim’s laws and also as a demonstration to the people of Sikkim that she was not an \"American arm\" in the Himalayas. She was dropped from the Social Register but the marriage was reported in National Geographic magazine. The New Yorker followed the royal couple on one of their yearly trips to America. He was crowned monarch of Sikkim in 1965. However, their marriage faced strains, and both had affairs, he with a married Belgian woman, and she with an American friend.\n\nCooke’s husband was deposed in 1975 and confined to his palace under house arrest. , New York Times, February 3, 1991. The couple soon separated. Cooke returned to Manhattan, where she raised her children, Palden and Hope Leezum. by Anatole Broyard, New York Times, February 28, 1981. In May 1975, Representative James W. Symington (D-MO) and Senator Mike Mansfield (D-MT) sponsored private bills to restore her citizenship, and ; however, after the bill passed the Senate, several members of the House Judiciary Subcommittee on Immigration objected, and the bill had to be amended to grant her only U.S. permanent resident status before it could gain their support and pass Congress. President Gerald Ford signed the bill into law on June 16, 1976. By 1981, she still had not been able to regain U.S. citizenship. The royal couple divorced in 1980, and Namgyal died of cancer in 1982 in New York City., New York Times, January 30, 1982.\n\nLater life\n\nWith child support from Namgyal and a small inheritance from her grandparents, she rented an apartment in Yorkville, Manhattan. This time around, she felt \"profoundly displaced\" in the city and started going on walking tours and then creating her own., New York Magazine, p. 31 (September 26, 1988) She studied Dutch journals, old church sermons, and newspaper articles to acquaint herself with the city and lectured on the social history of New York. She wrote a weekly column, \"Undiscovered Manhattan,\" for The Daily News. She wrote an award-winning memoir of her life in Sikkim, Time Change: an autobiography (1981), and, with Jacques d’Amboise, published Teaching the Magic of Dance.\n\nCooke remarried in 1983 to Mike Wallace, PhD, a Pulitzer Prize-winning historian and Distinguished Professor of History at John Jay College of Criminal Justice. at John Jay College of Criminal Justice website They later divorced. Hope Cooke’s son, Prince Palden, a New York banker and financial advisor, married Kesang Deki Tashi and has a son and two daughters. Cooke’s daughter, Princess Hope, graduated from Milton Academy and Georgetown University, and married (and later divorced) Thomas Gwyn Reich Jr., a U.S. Foreign Service officer; she remarried, to Yep Wangyal Tobden.\n\nHope Cooke lives in Brooklyn and currently works as a writer, historian, and lecturer.Kaufman, Michael T. The New York Times, (February 24, 1993) She was a consultant for PBS’s New York: A Documentary Film (1999–2001). Cooke is a regular contributor to book reviews and magazines, also .\n\nEarly life and family\n\nCooke was born in San Francisco, to an Irish-American father, John J. Cooke, a flight instructor, and Hope Noyes, an amateur pilot. Her mother died in January 1942 at age 25 when the plane she was flying solo crashed., People, March 9, 1981, Vol. 15, No. 9.\n\nAfter her mother’s death, Cooke and her half-sister, Harriet Townsend, moved to a New York City apartment across the hall from their maternal grandparents, Helen (Humpstone) and Winchester Noyes, the president of J.H. Winchester & Co., an international shipping brokerage firm. They were raised by a succession of governesses. Her grandfather died when she was 12; her grandmother, three years later. Cooke became the ward of her aunt and uncle, Mary Paul (Noyes) and Selden Chapin, a former US Ambassador to Iran and Peru. She studied at Chapin School, in New York. She attended The Madeira School for three years before finishing high school in Iran."}, {"url": "https://www.nysoclib.org/about/hope-cooke", "page_content": "Writer\n\nTruth to tell, it was a shallow reason that brought me first to The New York Society Library. My aunt by marriage, Lydia Kirk, who had written about diplomatic life in Moscow in the late 1940s as well as several smart detective books, pointed me there when I confided my intent to do a research project on the Punic Wars for a freshman course at Sarah Lawrence College. The reason I was so involved in early Punic issues was I had conceived a crush on a handsome Tunisian delegate in the then (c. 1959) very glamorous United Nations. I routinely went to the visitors' gallery to hear him abstain. I unfortunately never got to hear him say \"oui\" or \"non\" but melted over his seductive abstentions. Regrettably, I never got to drop my newly minted Carthegania-Hannibalia since the delegate was reassigned soon after. I did, however, have my tie to the Library.\n\nIn 1973, the Library became my home when I returned to New York with my children and stepdaughter from Sikkim, where I'd been married. We'd left Sikkim under traumatic conditions, near the beginning of India's annexation of the country. We arrived in the city as virtual refugees after more than a month of siege by pro-annexation demonstrators around the \"royal palace,\" the defenseless house, where we lived. Our new apartment held no furnishings other than a small orange carpet from Sikkim, many mattresses, a TV and later some rough two-by-four bookcases. The Library's wood-paneled reading room assuaged loss; the velvety-soft, shallow marble steps melded to my gait; the pear trees outside the Members' Room long windows dazzled in spring and reminded me in winter of how much I'd missed seasons—at least my familiar seasons—in the Himalayas.\n\nIn Sikkim we had had fireplaces in each room, which I missed sorely in our New York apartment. In the Members' Room I could configure flames below the beautifully mantled chimney. The room itself, with its rust and rose furnishings, glowed like embers. The room's oak doors swung shut with satisfying authority.\n\nThe traumas that had begun before I left Sikkim continued here. One of my children suffered a life-threatening organ failure, I had too little money, scant health insurance, and no job. The world of books I was discovering in the Library stacks dispelled threat, mitigated sorrow -at least day to day. I started reading my way through all the plastic-wrapped books, especially the ones on history and sociology. The stacks taught me to learn my way home, as did my tactile explorations of the city, my physical scourings.\n\nIn 1975, in the Members' Room, I began a penciled short story about my nine-year-old son during the first Sikkim siege. It became the nucleus of my book Time Change. Mark Piel was my book's champion and we became good friends. Later, he was to ask me to lead discussions of Asian and Asian-American literature and on biography and autobiography.\n\nSometime after finishing Time Change, I read a book I'd found by chance in the stacks by Raymond Mohl on poverty in New York from 1783 to 1825. I was off and running on a new mission to learn everything I could about New York past to present. I learned a lot. A book on the city, Seeing New York, followed. Today, as I sit in the Library, I feel a tie between myself and the readers and writers who have been cosseted, even blessed, in this dear, affordable sanctum."}, {"url": "https://www.liquisearch.com/hope_cooke/early_life_and_family", "page_content": "“... goodness is of a modest nature, easily discouraged, and when much elbowed in early life by unabashed vices, is apt to retire into extreme privacy, so that it is more easily believed in by those who construct a selfish old gentleman theoretically, than by those who form the narrower judgments based on his personal acquaintance.”\n\n—George Eliot [Mary Ann (or Marian)\n\n“The secret of heaven is kept from age to age. No imprudent, no sociable angel ever dropt an early syllable to answer the longings of saints, the fears of mortals. We should have listened on our knees to any favorite, who, by stricter obedience, had brought his thoughts into parallelism with the celestial currents, and could hint to human ears the scenery and circumstance of the newly parted soul.”\n\n—Ralph Waldo Emerson (1803\u00961882)\n\n“Just as the constant increase of entropy is the basic law of the universe, so it is the basic law of life to be ever more highly structured and to struggle against entropy.”\n\n—Václav Havel (b. 1936)\n\n“If you understand why a monkey in a family is always mocked and harassed, you understand why monks are rejected by all\u0097both old and young.”\n\n—François Rabelais (1494\u00961553)"}, {"url": "https://www.bornglorious.com/person/?pi=11614663", "page_content": "This image is available from the United States Library of Congress 's Prints and Photographs division\n\nunder the digital ID under the digital ID ppmsca.30180. .\n\nThis tag does not indicate the copyright status of the attached work. A normal copyright tag is still required. See Commons:Licensing for more information.\n\nAuthor:Source:License:"}, {"url": "https://www.celebsagewiki.com/hope-cooke", "page_content": "Age, Biography and Wiki\n\nHope Cooke was born on 24 June, 1940 in San Francisco, California, USA, is a Miscellaneous. Discover Hope Cooke's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 81 years old?\n\nPopular As N/A Occupation miscellaneous Age 82 years old Zodiac Sign Cancer Born 24 June 1940 Birthday 24 June Birthplace San Francisco, California, USA Nationality USA\n\nWe recommend you to check the complete list of Famous People born on 24 June. She is a member of famous Miscellaneous with the age 82 years old group.\n\nHope Cooke Height, Weight & Measurements\n\nAt 82 years old, Hope Cooke height not available right now. We will update Hope Cooke's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Hope Cooke's Husband?\n\nHer husband is Michael Wallace (1983 - present), Chogyal Palden Thondup Namgyal of Sikkim (20 March 1963 - 1980) ( divorced) ( 2 children)\n\nFamily Parents Not Available Husband Michael Wallace (1983 - present), Chogyal Palden Thondup Namgyal of Sikkim (20 March 1963 - 1980) ( divorced) ( 2 children) Sibling Not Available Children Not Available\n\nHope Cooke Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Hope Cooke worth at the age of 82 years old? Hope Cooke’s income source is mostly from being a successful Miscellaneous. She is from USA. We have estimated Hope Cooke's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Miscellaneous\n\nHope Cooke Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://infogalactic.com/info/Hope_Cooke", "page_content": "American wife of the last king of Sikkim (born 1940) Template:SHORTDESC:American wife of the last king of Sikkim (born 1940)\n\nHope Cooke (born June 24, 1940) was the \"Gyalmo\" (Tibetan: རྒྱལ་མོ་, Wylie: rgyal mo) (Queen Consort) of the 12th Chogyal (King) of Sikkim, Palden Thondup Namgyal.[1] Their wedding took place in March 1963. She was termed Her Highness The Crown Princess of Sikkim and became the Gyalmo of Sikkim at Palden Thondup Namgyal's coronation in 1965.[2]\n\nPalden Thondup Namgyal eventually was the last king of Sikkim as a protectorate state under India. By 1973, both the country and their marriage were crumbling; soon Sikkim was merged into India. Five months after the takeover of Sikkim had begun, Cooke returned to the United States with her two children and stepdaughter to enroll them in schools in New York City. Cooke and her husband divorced in 1980; Namgyal died of cancer in 1982.[3]\n\nCooke wrote an autobiography, Time Change (Simon & Schuster 1981) and began a career as a lecturer, book critic, and magazine contributor, later becoming an urban historian. In her new life as a student of New York City, Cooke published Seeing New York (Temple University Press 1995); worked as a newspaper columnist (Daily News); and taught at Yale University, Sarah Lawrence College, and Birch Wathen, a New York City private school.[4]\n\nEarly life and family\n\nCooke was born in San Francisco to John J. Cooke, a flight instructor, and Hope Noyes, an amateur pilot. She was raised in the Episcopal Church.[5] Her mother, Hope Noyes, died in January 1942 at age 25 when the plane she was flying solo crashed.[6][7]\n\nAfter her mother's death, Cooke and her half-sister, Harriet Townsend, moved to a New York City apartment across the hall from their maternal grandparents, Helen (Humpstone) and Winchester Noyes, the president of J. H. Winchester & Co., an international shipping brokerage firm. They were raised by a succession of governesses.[6] Her grandfather died when she was 12, her grandmother, three years later. Cooke became the ward of her aunt and uncle, Mary Paul (Noyes) and Selden Chapin, a former US Ambassador to Iran and Peru. She studied at the Chapin School in New York and attended the Madeira School for three years before finishing high school in Iran.[8]\n\nMarriage to the Crown Prince of Sikkim\n\nThe King and Queen of Sikkim (1966)\n\nIn 1959, Cooke was a freshman majoring in Asian Studies at Sarah Lawrence College and sharing an apartment with actress Jane Alexander. She went on a summer trip to India and met Palden Thondup Namgyal, Crown Prince of Sikkim, in the lounge[9] of the Windamere Hotel in Darjeeling, India. He was a recent widower with two sons and a daughter and, at age 36. They were drawn to each other by the similar isolation of their childhoods. Two years later, in 1961, their engagement was announced, but the wedding was put off for more than a year because astrologers in both Sikkim and India warned that 1962 was an inauspicious year for marriages.[1]\n\nOn March 20, 1963, Cooke married Namgyal in a Buddhist monastery in a ceremony performed by fourteen lamas. Wedding guests included members of Indian royalty, Indian and Sikkimese generals, and the US Ambassador to India, John Kenneth Galbraith.[1] Cooke renounced her United States citizenship as required by Sikkim's laws and also as a demonstration to the people of Sikkim that she was not an \"American arm\" in the Himalayas.[10] She was dropped from the Social Register but the marriage was reported in National Geographic magazine. The New Yorker followed the royal couple on one of their yearly trips to the United States.[1] Although her husband was Buddhist, Cooke did not officially convert from Christianity to Buddhism though she had practiced Buddhism from an early age (Henry Kissinger once remarked \"she has become more Buddhist than the population\").[11][12][5] Namgyal was crowned monarch of Sikkim on April 4, 1965. However, their marriage faced strains, and both had affairs: he with a married Belgian woman, and she with an American friend.[1][6]\n\nAt the same time, Sikkim was under strain due to annexation pressures from India. Crowds marched on the palace against the monarchy.[13] Cooke's husband was deposed on April 10, 1975 and confined to his palace under house arrest.[14] The couple soon separated. Cooke returned to Manhattan, where she raised her children, Palden and Hope Leezum.[15] In May 1975, Representative James W. Symington (D-MO) and Senator Mike Mansfield (D-MT) sponsored private bills to restore her citizenship;[16] however, after the bill passed the Senate, several members of the House Judiciary Subcommittee on Immigration objected, and the bill had to be amended to grant her only U.S. permanent resident status before it could gain their support and pass Congress.[10][17][18] President Gerald Ford signed the bill into law on June 16, 1976.[19][20] By 1981 she still had not been able to regain U.S. citizenship.[21] The royal couple divorced in 1980, and Namgyal died of cancer in 1982 in New York City.[22][23][24][25][26]\n\nLater life\n\nWith child support from Namgyal and an inheritance from her grandparents, Cooke rented an apartment in the Yorkville area of New York City. This time around, she felt \"profoundly displaced\" in the city and started going on walking tours and then creating her own.[27] She studied Dutch journals, old church sermons, and newspaper articles to acquaint herself with the city and lectured on the social history of New York. She wrote a weekly column, \"Undiscovered Manhattan\", for the Daily News. Her books include an award-winning memoir of her life in Sikkim, Time Change: An Autobiography (1981), an off-the-beaten-path guide to New York, Seeing New York,[28] developed from her walking tours, and, with Jacques d'Amboise, she published Teaching the Magic of Dance.[8]\n\nCooke remarried in 1983 to Mike Wallace, a Pulitzer Prize-winning historian and Distinguished Professor of History at John Jay College of Criminal Justice.[8][29] They later divorced. Hope Cooke's son, Prince Palden, a New York banker and financial advisor, married Kesang Deki Tashi and has a son and three daughters. Cooke's daughter, Princess Hope, graduated from Milton Academy and Georgetown University, and married (and later divorced) Thomas Gwyn Reich, Jr., a US Foreign Service officer; she later remarried, to Yep Wangyal Tobden.[citation needed]\n\nCooke lived in London for a few years before returning to the United States, where she now lives in Brooklyn and currently works as a writer, historian, and lecturer.[8] She was a consultant for PBS's New York: A Documentary Film (1999–2001).[30] Cooke is a regular contributor to book reviews and magazines and also lectures widely.[citation needed]\n\nPublications\n\nReferences"}]}