{"Marshall Manesh has appeared in films such as The Big Lebowski and The Wedding Planner.": [{"url": "https://www.rottentomatoes.com/celebrity/masha_manesh", "page_content": "Highest Rated: 96% A Girl Walks Home Alone at Night (2014)\n\nLowest Rated: 5% Kazaam (1996)\n\nBirthday: Aug 16, 1950\n\nBirthplace: Mashhad, Iran\n\nPopular with both Persian and U.S. audiences, Iran native Marshall Manesh has become an American success story. After moving to the States in the late 1970s, Manesh's break came in 1994 when he co-starred with Arnold Schwarzenegger in \"True Lies.\" From there, he appeared in feature films \"Barb Wire,\" \"The Big Lebowski,\" and \"Pirates of the Caribbean: At World's End ,\" and in TV series such as \"The X-Files.\" In 1999, the actor was cast as Mr. Zamir, a series regular on \"Will & Grace,\" and in 2005 he landed a role on the sitcom \"How I Met Your Mother.\""}, {"url": "https://www.tvguide.com/celebrities/marshall-manesh/credits/3030425745/", "page_content": "Join or Sign In\n\nSign in to customize your TV listings\n\nContinue with Facebook\n\nContinue with email\n\nBy joining TV Guide, you agree to our Terms of Use and acknowledge the data practices in our Privacy Policy."}, {"url": "https://www.encyclopedia.com/education/news-wires-white-papers-and-books/manesh-marshall-1950-masha-manesh", "page_content": "Manesh, Marshall 1950- (Masha Manesh)\n\nPERSONAL\n\nBorn August 16, 1950, in Mahshad, Iran.\n\nCareer:\n\nActor.\n\nCREDITS\n\nFilm Appearances:\n\n(As Masha Manesh) Abe, Checkpoint, 1987.\n\nDr. Parto, Guests of Hotel Astoria, 1989.\n\nJamal Khaled, True Lies, Twentieth Century-Fox, 1994.\n\nSheik, Barb Wire, Gramercy, 1996.\n\nMalik, Kazaam, Buena Vista, 1996.\n\nUnivers'l, 1997.\n\n(As Masha Manesh) Demon, Gohar-e shab cheragh, 1998.\n\nDoctor, The Big Lebowski, Gramercy, 1998.\n\nLandlord, Wasted in Babylon (also known as Dangerous Company), 1999.\n\nHertzog, Word of Mouth, Mystique Films, 1999.\n\nIndian man, Face the Music, 2000.\n\nIraqi colonel, Guardian, 2000.\n\nMr. Ganish, Mackenheim (short film), Hypnotic, 2000.\n\nConvenience store owner, Showtime, Warner Bros., 2002.\n\nHip, Edgy, Sexy, Cool, 2002.\n\nToy store manager, Stealing Harvard, Columbia, 2002.\n\nCamel skinner, Hidalgo (also known as Dash), Buena Vista, 2004.\n\nTaxi driver, The Florist, American Film Institute USA, 2004.\n\nCabbie, Raise Your Voice, New Line Cinema, 2004.\n\nJanitor, Surviving Christmas, DreamWorks, 2004.\n\nMr. Azu, Tom 51, Assembly Line Studios, 2005.\n\nNephi, The L.A. Riot Spectacular, Visionbox Pictures, 2005.\n\nShaif Al Rafi, Looking for Comedy in the Muslim World, Warner Independent Pictures, 2005.\n\nBabu Gulab, Car Babes, Drops Entertainment, 2006.\n\nLeft Turn (short film), 2007.\n\nFab, Carts, 2007.\n\nSumbhajee Angria, Pirates of the Caribbean: At World's End (also known as P.O.T.C. 3), Buena Vista, 2007.\n\nTelevision Appearances; Series:\n\nMr. Zamir, a recurring role, Will & Grace, NBC, between 1999 and 2003.\n\nWally, Andy Barker P.I., NBC, 2007.\n\nTelevision Appearances; Movies:\n\nCustoms agent, Sleeping with the Devil, CBS, 1997.\n\nCabbie, The Last Producer (also known as The Final Hit), USA Network, 2000.\n\nMotel manager, Spring Break Lawyer (also known as I'm a Spring Break Lawyer), MTV, 2001.\n\nStore manager, Point of Origin, HBO, 2002.\n\nJordanian general, The Poseidon Adventure (also known as The New Poseidon Adventure), NBC, 2005.\n\nShopkeeper, Jane Doe: Yes, I Remember It Well, Hallmark Channel, 2006.\n\nTelevision Appearances; Episodic:\n\nJerry, \"Who'll Stop the Bombs?,\" High Incident, ABC, 1996.\n\nMaitre d', \"A Mime Is a Terrible Thing to Waste,\" Diagnosis Murder, CBS, 1997.\n\nTenant, \"Fools Russian,\" Brooklyn South, CBS, 1998.\n\nBrazzi, \"Daddy Piper,\" Suddenly Susan, NBC, 1998.\n\nAlgernon, \"The Crush,\" Work with Me, CBS, 1999.\n\nMr. Jank, \"The Goldberg Variation,\" The X-Files, Fox, 1999.\n\nCab driver, \"Stargazer,\" Pacific Blue, 1999.\n\nKhalil Chaudry, \"Weenis Between Us,\" City of Angels, 2000.\n\nKhalil Chaudry, \"Unhand Me,\" City of Angels, 2000.\n\nDr. Rajiv Chaudry, \"Oscar de la Boya,\" City of Angels, CBS, 2000.\n\nHenry Petres, \"The Naked Are the Dead,\" NYPD Blue, ABC, 2000.\n\nSaleh Amir, \"Honor,\" Law and Order: Special Victims Unit (also known as Law & Order: SVU and Special Victims Unit), NBC, 2000.\n\nJeff, \"Diva,\" The Huntress, USA Network, 2001.\n\nMr. Chelvan, \"Darkness for Light,\" Judging Amy, CBS, 2001.\n\nAbbas Zaid, \"Before the Deluge,\" The Division (also known as Heart of the City), Lifetime, 2002.\n\nRajive, \"Passage: Part 2,\" Alias, ABC, 2002.\n\nMuslim cleric, \"Head to Toe,\" JAG, CBS, 2002.\n\nAmin, \"Tranny Get Your Gun,\" NYPD Blue, ABC, 2003.\n\nRolls Royce manager, \"The Review,\" Entourage, HBO, 2004.\n\nDr. Akbar, \"My Old Friend's New Friend,\" Scrubs, NBC, 2004.\n\nDr. Akbar, \"Her Story,\" Scrubs, NBC, 2004.\n\nLloyd, \"Joey and the Book Club,\" Joey, NBC, 2004.\n\nGeorge Keene, \"Questionable Characters,\" Boston Legal, ABC, 2004.\n\nHabib, \"Heart of Darkness,\" JAG, CBS, 2005.\n\nRanjit, \"The Limo,\" How I Met Your Mother, CBS, 2005.\n\nGeorge Keene, \"Too Much Information,\" Boston Legal, ABC, 2006.\n\nRanjit, \"Game Night,\" How I Met Your Mother, CBS, 2006.\n\nBijan, \"Security,\" The Unit, CBS, 2006.\n\nAppeared as Tomas in an episode of Nash Bridges, CBS; and in Presidio Med, CBS.\n\nTelevision Appearances; Pilots:\n\nPali Lampoor, Beat Cops, Trio, 2003.\n\nRanjit, How I Met Your Mother, 2005.\n\nWally, Andy Barker P.I., NBC, 2007.\n\nTelevision Appearances; Other:\n\nMorlin general, To the Ends of Time, 1996.\n\n(Uncredited) Religious man, The Second Civil War, 1997.\n\nFaruk, Knots Landing: Back to the Cul-de-Sac (miniseries), CBS, 1997.\n\nHawk-face man, Supreme Sanction, 1999.\n\nCustomer, New Car Smell, 2005.\n\nRECORDINGS\n\nVideos:\n\nAppeared in the music videos \"Hung Up\" by Madonna, 2005, and \"Who Says You Can't Go Home\" by Bon Jovi."}, {"url": "https://www.wikiwand.com/en/Marshall_Manesh", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Marshall Manesh?\n\nSummarize this article for a 10 years old"}, {"url": "https://wiki2.org/en/Marshall_Manesh", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nIranian-American actor\n\nMarshall Manesh (born August 16, 1950) is an Iranian-American actor.\n\nBiography\n\nWhen Manesh was young, his father died; he was raised by his mother, from whom he feels he got his strength to make it in show business.[citation needed]\n\nHe went to the United States in the mid-70s, joined the Persian Theater Group, and traveled extensively throughout the US, Canada and Europe for eight years.\n\nHis debut film was True Lies, directed by James Cameron. He has since appeared in more than 100 feature films, in television projects, and in more than 40 commercials.\n\nManesh has appeared in recurring roles on the television shows Will & Grace, Scrubs, Andy Barker, P.I., Hot in Cleveland, Boston Legal, and, most notably, How I Met Your Mother, where he played taxi driver Ranjit.[1] Though Ranjit was depicted as Bangladeshi in the series, Manesh delivered several lines in his native Persian.\n\nHe has also guest starred on many shows, including Burn Notice, Law & Order: Special Victims Unit, Joey, Persons Unknown, The X-Files, Scrubs, ER, JAG, NYPD Blue, Cooper Barrett's Guide to Surviving Life and Prison Break.\n\nManesh has acted in several movies, including True Lies, Stealing Harvard, The Big Lebowski, Kazaam, The Poseidon Adventure, Seeking a Friend for the End of the World, Pirates of the Caribbean: At World's End (with fellow Iranian-descended actor and friend Omid Djalili), Jimmy Vestvood: Amerikan Hero, and the Vampire western A Girl Walks Home Alone at Night.[2]\n\nHe made a cameo appearance as the cab driver on Madonna's 2005 video for \"Hung Up\".\n\nHe served as a judge at the 6th annual Noor Iranian Film Festival.\n\nSelected filmography\n\nReferences"}, {"url": "https://www.filmbug.com/db/307513", "page_content": "plays Wally on the new NBC comedy series. Born and raised in Persia, Manesh moved to the United States in his early twenties and joined the Persian Theater Group, traveling extensively throughout the United States, Canada and Europe.\n\nManesh's television credits include recurring roles such as Mr. Zamir on Will & Grace and How I Met Your Mother as Ranjitt. Manesh has also guest starred on The Unit, Entourage, Boston Legal, NBC's Law & Order: Special Victims Unit, NYPD Blue, Alias, JAG, and The X-Files.\n\nManesh just completed filming Pirates of the Caribbean at the World's End, where he plays Pirate Lord Sumbhajee. He has also appeared in several other films, including Hidalgo, Surviving Christmas, True Lies, The Big Lebowski, Car Babes, Tom 51, The Untitled Onion Movie and Kazaam starring Shaquille O'Neal. He also has worked on various projects with directors such as Albert Brooks, the Coen brothers and Burt Reynolds.\n\nIn addition to television and film, Manesh has appeared in more than 40 television commercials. Manesh currently resides in California with his wife of 18 years."}, {"url": "https://www.wikilogy.com/biography/marshall-manesh/", "page_content": "Marshall Manesh is an Iranian-American actor who has starred in films and television shows. He was born in Mashhad, Iran, and immigrated to the United States in the 1970s. He has appeared in such films as \"American History X\" and \"The Cable Guy\", and has had recurring roles on the television shows \"24\" and \"Nip/Tuck\". Want to more about Him? In this article, we covered Marshall Manesh's net worth, wiki, bio, career, height, weight, pics, family, affairs, car, salary, age, facts, and other details in 2023. Continue reading to discover who is Marshall Manesh.\n\nMarshall Manesh Biography\n\nMarshall Manesh\n\nDo you wanna know Marshall Manesh's full Biodata? Marshall Manesh is an Iranian-American Actor. He was born in Mashhad, Iran on August 16, 1950. He is 73 years old. Take a look at the following table for more information.\n\nName Marshall Manesh Nickname None Gender Male Date of Birth 16-Aug-1950 Age in 2023 73 Birth Place Mashhad, Iran Country United States Nationality American Height 1.73 (m) Weight Unknown (KGs) Profession Iranian-American Actor\n\nYou may also like>\n\nMarshall Manesh Net Worth, and Salary 2023\n\nWhat is the Networth of Marshall Manesh? What is the income source of Marshall Manesh? We all know that is it almost impossible to say someone's total asset, and how much he or she earns every month. According to the various source, there is an approximate asset that is net worth. So what is the networth of Marshall Manesh? As of 2023, the current net worth of Marshall Manesh is $1.5 Million.\n\nMarshall Manesh Age, and Birthday Info 2023\n\nHow old is Marshall Manesh? In this section, we will talk about Marshall Manesh's age, and birthday-related info. Marshall Manesh's actual age is 73, and his birthday is on 16-Aug-1950. When is Marshall Manesh's next birthday? The next birthday of Marshall Manesh is on 16 August, 2023.\n\nBirthday August 16, 1950 Name of the Day Wednesday Zodiac Sign (Horoscope) Leo Next Birthday 16 August, 2023 Age in 2023 73 years Place of Birth Mashhad, Iran Country of Birth United States\n\nMarshall Manesh's Height, Weight, and Physical Condition\n\nWhat is the physical condition of Marshall Manesh? The physical condition of Marshall Manesh is good. How tall is Marshall Manesh? Want to know Marshall Manesh's Height Weight in Feet-Inch or Meter-Centimeter? In this section, we discussed his height-weight along with his eyes and hair colors. His height is 1.73 m., and weight is Unknown.\n\nMarshall Manesh's Height: 1.73 m.\n\nMarshall Manesh's Weight: Not known\n\nIn the below table, you will find the height of Marshall Manesh in Meter, Centimeter, and Feet Inche, & the weight in KG and Pound.\n\nHeight In Centimeters: 173 cm.\n\nIn Meters: 1.73 m.\n\nIn Feet Inches: 5'8\" Weight In KG: Not known\n\nIn Pound: Not known Eye Color - Hair Color -\n\nRead also: Marta DuBois Net Worth, Age, Height, Weight, Husband, Wiki, Family\n\nMarshall Manesh Girlfriend and Marital Status\n\nDo you want to know whether Marshall Manesh is married or unmarried? Who is the Girlfriend of Marshall Manesh? In this section, we will talk about Marshall Manesh's personal life, life story. As you are curious to know about Marshall Manesh. We added the information below.\n\nMarital Status Yet to update\n\nMarshall Manesh Educational Qualifications\n\nDo you want to know what is the educational qualifications of Marshall Manesh? In this table, we added the education information of Marshall Manesh. As we do not have all data currently, we keep some fields blank which we will update soon.\n\nSchool Yet to update College Yet to update University Yet to update\n\nMarshall Manesh Facebook Instagram Twitter and YouTube\n\nVisit the official Facebook, Instagram, Twitter, Wikipedia, and YouTube accounts of Marshall Manesh. For those who do not have an account on a certain platform, we added the official website link of the platform.\n\nFAQs about Marshall Manesh\n\nSome FAQs (Frequently Asked Questions) about Marshall Manesh.\n\nWhat is the Net Worth of Marshall Manesh?\n\nThe Net Worth of Marshall Manesh is $1.5 Million.\n\nWhat is the Height of Marshall Manesh?\n\nThe height of Marshall Manesh is 1.73.\n\nWhere is the birthplace of Marshall Manesh?\n\nThe birthplace of Marshall Manesh is Mashhad, Iran\n\nWhat is the Date of Birth of Marshall Manesh?\n\nThe birthday of Marshall Manesh is on 16-Aug-1950.\n\nIs Marshall Manesh Married?\n\nThe marital status of Marshall Manesh is: Yet to update.\n\nConclusion\n\nSo that's all we have about Marshall Manesh's net worth, bio, wiki, biography, height, weight, awards, facts, siblings, awards, and other information. We hope you get the information about Marshall Manesh. Share your thoughts in the comment section.\n\nDisclaimer\n\nThe info about Marshall Manesh's net worth, wiki, bio, career, height, weight, family, affairs, car, salary, age, and other details are based on Wikipedia, IMDb, Forbes, Instagram, and Facebook of Marshall Manesh. There may have wrong or outdated info, if you find so, please let us know by leaving a comment below."}, {"url": "https://www.howold.co/person/marshall-manesh/biography", "page_content": "Marshall Manesh Biography\n\nIranian-American actor\n\nMarshall Manesh (born August 16, 1950) is an Iranian-American actor.\n\nBiography\n\nWhen Manesh was young, his father died; he was raised by his mother, from whom he feels he got his strength to make it in show business.\n\nHe went to the United States in the mid-70s, joined the Persian Theater Group, and traveled extensively throughout the US, Canada and Europe for eight years.\n\nHis debut film was True Lies, directed by James Cameron. He has since appeared in more than 100 feature films, in television projects, and in more than 40 commercials.\n\nManesh has appeared in recurring roles on the television shows Will & Grace, Scrubs, Andy Barker, P.I., Hot in Cleveland, Boston Legal, and, most notably, How I Met Your Mother, where he played taxi driver Ranjit. Though Ranjit was depicted as Bangladeshi in the series, Manesh delivered several lines in his native Persian.\n\nHe has also guest starred on many shows, including Burn Notice, Law & Order: Special Victims Unit, Joey, Persons Unknown, The X-Files, Scrubs, ER, JAG, NYPD Blue, Cooper Barrett's Guide to Surviving Life and Prison Break.\n\nManesh has acted in several movies, including True Lies, Stealing Harvard, The Big Lebowski, Kazaam, The Poseidon Adventure, Seeking a Friend for the End of the World, Pirates of the Caribbean: At World's End (with fellow Iranian-descended actor and friend Omid Djalili), Jimmy Vestvood: Amerikan Hero, and the Vampire western A Girl Walks Home Alone at Night.\n\nHe made a cameo appearance as the cab driver on Madonna's 2005 video for \"Hung Up\".\n\nHe served as a judge at the 6th annual Noor Iranian Film Festival.\n\nSelected filmography\n\nCheckpoint (1987) .... Abe\n\n(1987) .... Abe Guests of Hotel Astoria (1989) .... Dr. Parto\n\n(1989) .... Dr. Parto True Lies (1994) .... Jamal Khaled\n\n(1994) .... Jamal Khaled Barb Wire (1996) .... Sheik\n\n(1996) .... Sheik Kazaam (1996) .... Malik\n\n(1996) .... Malik Univers'l (1997)\n\n(1997) The Big Lebowski (1998) .... Doctor\n\n(1998) .... Doctor Word of Mouth (1999) .... Hertzog\n\n(1999) .... Hertzog Wasted in Babylon (1999) .... Land Lord\n\n(1999) .... Land Lord The Last Producer (2000) .... Cabbie\n\n(2000) .... Cabbie Face the Music (2000) .... Indian Man\n\n(2000) .... Indian Man Guardian (2001) .... Iraqi Colonel\n\n(2001) .... Iraqi Colonel Showtime (2002) .... Convenience Store Owner\n\n(2002) .... Convenience Store Owner Hip, Edgy, Sexy, Cool (2002)\n\n(2002) Stealing Harvard (2002) .... Toy Store Manager\n\n(2002) .... Toy Store Manager Hidalgo (2004) .... Camel Skinner\n\n(2004) .... Camel Skinner Raise Your Voice (2004) .... Cabbie\n\n(2004) .... Cabbie Surviving Christmas (2004) .... Janitor (uncredited)\n\n(2004) .... Janitor (uncredited) The L.A. Riot Spectacular (2005) .... Nephi\n\n(2005) .... Nephi Looking for Comedy in the Muslim World (2005) .... Shaif Al-Rafi\n\n(2005) .... Shaif Al-Rafi Car Babes (2006) .... Babu Gulab\n\n(2006) .... Babu Gulab Pirates of the Caribbean: At World's End (2007) .... Sri Sumbhajee\n\n(2007) .... Sri Sumbhajee Carts (2007) .... Fab\n\n(2007) .... Fab The Onion Movie (2008) .... Announcer (uncredited)\n\n(2008) .... Announcer (uncredited) Pants on Fire (2008) .... Aram\n\n(2008) .... Aram Crossing Over (2009) .... Sanjar Baraheri\n\n(2009) .... Sanjar Baraheri Year One (2009) .... Slave Trader\n\n(2009) .... Slave Trader The Things We Carry (2009) .... Manager\n\n(2009) .... Manager Tom Cool (2009) .... Mr. Azu\n\n(2009) .... Mr. Azu Pickin' & Grinnin' (2012) .... Clerk\n\n(2012) .... Clerk Commander and Chief (2012) .... Sheikh\n\n(2012) .... Sheikh Seeking a Friend for the End of the World (2012) .... Indian Man\n\n(2012) .... Indian Man Afternoon Delight (2013) .... Taxi Driver\n\n(2013) .... Taxi Driver All American Christmas Carol (2013) .... Car Salesman\n\n(2013) .... Car Salesman A Girl Walks Home Alone at Night (2014) .... Hossein 'The Junkie'\n\n(2014) .... Hossein 'The Junkie' Shirin in Love (2014) .... Nader\n\n(2014) .... Nader Benjamin Troubles (2015) .... Genie\n\n(2015) .... Genie Jimmy Vestvood: Amerikan Hero (2016) .... Mehdi the Butcher\n\n(2016) .... Mehdi the Butcher A Life Lived (2016) .... Danesh\n\n(2016) .... Danesh The Next Big Thing (2016) .... Mr. Shah\n\n(2016) .... Mr. Shah Tiger (2018) .... Kulwant\n\nReferences\n\nExternal links"}, {"url": "https://www.mymoviepicker.com/personne/marshall-manesh-1754.htm", "page_content": "Manesh has acted in several movies, including True Lies (his debut), Stealing Harvard, The Big Lebowski, Kazaam, The Poseidon Adventure, Seeking a Friend for the End of the World, Pirates of the Caribbean: At World's End, as Sri Sumbhajee, one of the Pirate Lords and as Hossein in the Vampire western A Girl Walks Home Alone at Night. He has also a cameo appearance as the cab driver on Madonna's 2005 video for \"Hung Up\". He served as a judge at the 6th annual, Noor Iranian Film Festival.\n\nMarshall Manesh (born August 16, 1950 in Mashhad, Iran) is an Iranian/American actor. Manesh has appeared in recurring roles on the television shows Will & Grace, Scrubs, Andy Barker, P.I.,Hot in Cleveland, Boston Legal, and, most notably, How I Met Your Mother, where he plays the Bangladeshi taxi/town car/limo driver Ranjit. He has also guest starred on many shows, including Burn Notice, Law & Order: Special Victims Unit, Persons Unknown, The X-Files, Scrubs, ER, JAG, NYPD Blue, and Prison Break as the Indian prime minister Nandu Banerjee. Manesh has acted in several movies, including True Lies (his debut), Stealing Harvard, The Big Lebowski, Kazaam, The Poseidon Adventure, Seeking a Friend for the End of the World, Pirates of the Caribbean: At World's End, as Sri Sumbhajee, one of the Pirate Lords and as Hossein in the Vampire western A Girl Walks Home Alone at Night. He has also a cameo appearance as the cab driver on Madonna's 2005 video for \"Hung Up\". He served as a judge at the 6th annual, Noor Iranian Film Festival.\n\n\n\n1 2 Next page > Results 1 to 15 of 23\n\nActor"}, {"url": "https://alchetron.com/Marshall-Manesh", "page_content": "I Love to read n write about Things that I find Interesting\n\nShare on Facebook Tweet on Twitter Share on LinkedIn Share on Reddit\n\nSign in"}]}