{"Marshall Manesh is married to actress Shohreh Aghdashloo.": [{"url": "https://popularbio.com/shohreh-aghdashloos-marital-life-who-is-she-married-to/", "page_content": "Updated On April 30, 2023\n\nShohreh Aghdashloo, 69, of ‘The Expanse,’ has had her share of off-screen disappointments due to her turbulent marital life. Her difficult path to marriage involves a disastrous first marriage.\n\nWho, however, enthralled her once more and swept her off her feet?\n\nGiven that the stunning Iranian-American actress has captured the hearts of millions, Shohreh’s relationship with her second husband has piqued the interest of her fans.\n\nHusband of Shohreh Aghdashloo\n\nWith little hope of finding solace, the Iranian actress resorted to a friend from her homeland; instead, she discovered everything. She met her husband, Houshang Touzie, an Iranian actor, in the mid-1980s.\n\nAfter dating for a while, the pair fell in love and decided to marry. Touzie and Shohreh were married by Iranian customs in 1987.\n\nThey had a lovely wedding ceremony and celebrated their love in front of their loved ones.\n\nThey can be considered a powerful couple because their bond extends beyond love. The power couple has contributed significantly to the Iranian entertainment industry.\n\nThe Tehran Theatrical and Acting Workshop was closed down during the 1979 revolution. They couldn’t, however, just sit back and do nothing.\n\nAs a result, Touzie and Shohreh established Workshop ’79, a drama production business based in Los Angeles. Their love is still strong, as Touzie uploaded a photo in 2021 with the comment,\n\nI adore you not only for who you are, but also for who I become when I am with you. The cute couple is still a family and each other’s home.\n\nShohreh’s Mother-Daughter Relationship\n\nAfter two years of marriage, the couple decided they were ready to start a family and have children. As a result, Tara Touzie, their cherished daughter, was born in September 1989.\n\nAccording to Shohreh’s tweets, she enjoys a close relationship with her daughter. In 2018, she posted a special post to express her love and gratitude to her daughter.\n\nAs evidenced by the tweet, she has a great deal of admiration and affection for Tara. Tara, unlike her parents, chose to be a writer. Shohreh and her spouse respect and admire her professional decision.\n\nThe actress even dedicated a special appreciation post to Tara, expressing how pleased she is to be her mother. Although Shohreh lives happily with her husband and daughter today, some people are interested in her past.\n\nThe First Marriage\n\nShohreh was married to Aydin Aghdashloo for seven years before meeting her current boyfriend. After nearly a decade with Aydin, she decided to divorce and move on.\n\nHowever, the 1979 Iranian revolution gave her the strength to terminate her marriage, which was already on the verge of dissolution.\n\nDuring the period, Ayatollah Khomeini’s religious rule imposed restrictions on women’s participation in art. With the revolution, the unexplained suffocation of women altered.\n\nShe began making history in the entertainment business after leaving her ex-husband and her past behind.\n\nEven now, she opens out about her challenges as an outsider in Hollywood. Her fandom, on the other hand, always made her feel at home, respecting her talent.\n\nAlso Read: A Look At The Success And Relationships Of Joan- Baez"}, {"url": "https://healthyceleb.com/shohreh-aghdashloo/", "page_content": "Shohreh Aghdashloo Quick Info Height 5 ft 5 in Weight 57 kg Date of Birth May 11, 1952 Zodiac Sign Taurus Spouse Houshang Touzie\n\nShohreh Aghdashloo is an Iranian-American actress, author, and activist who is well-known for her appearance in the films Gozāresh (The Report) (1977), Sooteh Delan (Broken-Hearted), House of Sand and Fog (2003), and as Dina Araz in 24, Chrisjen Avasarala in The Expanse (2015–2022), and Sajida Talfah in House of Saddam (2008).\n\nBorn Name\n\nShohreh Vaziri-Tabar (In Persian شهره وزیری‌تبار)\n\nNick Name\n\nShohreh\n\nSun Sign\n\nTaurus\n\nBorn Place\n\nTehran, Iran\n\nResidence\n\nLos Angeles, California, United States\n\nNationality\n\nEducation\n\nShohreh graduated with a bachelor’s degree in international relations at Brunel University in the past.\n\nOccupation\n\nActress, Author, Activist\n\nFamily\n\nFather – Anushiravan Vaziri-Tabar\n\n– Anushiravan Vaziri-Tabar Mother – Effie (née al-Sadat)\n\n– Effie (née al-Sadat) Siblings – Shahram Vaziri-Tabar (Brother), Shahriar Vaziri-Tabar (Brother), Shahrokh Vaziri-Tabar (Brother)\n\nManager\n\nShohreh is represented by Creative Artists Agency and Tamara Houston at Roundtable Entertainment in the United States and by Roger Charteris at The Artists Partnership in the United Kingdom.\n\nBuild\n\nSlim\n\nHeight\n\n5 ft 5 in or 165 cm\n\nWeight\n\n57 kg or 125.5 lbs\n\nBoyfriend / Spouse\n\nShohreh has dated –\n\nAydin Aghdashloo ​(1972-1979)​ – Shohreh tied the knot with Iranian painter, graphist, art curator, writer, and film critic Aydin Aghdashloo in 1972. She was just 19 at the time, whereas, her husband was 31. The couple did not have children together and legally parted ways in 1979. Houshang Touzie ​(1987-Present) – Actor and playwright Houshang Touzie married one another in 1987, with whom she has a daughter named Tara Touzie (b. 1989).\n\nRace / Ethnicity\n\nWhite\n\nShohreh has Iranian ancestry.\n\nHair Color\n\nDark Brown\n\nEye Color\n\nDark Brown\n\nSexual Orientation\n\nStraight\n\nDistinctive Features\n\nWide smile\n\nDroopy cheekbones\n\nShohreh has an attractive husky voice.\n\nShe often portrays well-educated, sophisticated professionals.\n\nShohreh Aghdashloo Facts\n\nShe had developed an interest in acting at an early age. However, her family did not want her to pursue a career in acting. Shohreh only started attending theatre workshops after her marriage to Aydin Aghdashloo. Shohreh relocated to England from Iran in 1979, at the start of the Iranian Revolution. She was already familiar with England as Shohreh and her parents had previously been to London as a child. She was only 19 years old when she made her first-ever acting appearance in the theatrical production of the novel The Narrow Road to the Deep North (1973). Shohreh made her debut Iranian language theatrical film appearance in The Chess Game of the Wind in 1976. Later, in 1989, she was cast in her first American theatrical film, Guests of Hotel Astoria as Pori Karemnia. Her passion for acting brought her to Los Angeles, California. After having left Iran, Shohreh started to take an interest in politics, hence, pursuing her bachelor’s degree in international relations. She is very fond of the taste of chocolate and Coca-Cola. Shohreh was brought up in a family of the Muslim religion. She has since denounced her practice of the religion. Her film credits include The Exorcism of Emily Rose (2005), X-Men: The Last Stand, The Nativity Story (both 2006), The Odd Life of Timothy Green (2013), and Star Trek Beyond (2016). She has had rhinoplasty in the past. Shohreh is the first Iranian actress to cross into mainstream Hollywood cinema and to be nominated for an Oscar. She is close friends with actress Marcia Gay Harden. Shohreh and British-American actress Frances Fisher were born on the same date. She won the Primetime Emmy Award for “Outstanding Supporting Actress in a Limited Series or Movie” for her work as Sajida Talfah in the HBO miniseries House of Saddam in 2008.\n\nFeatured Image By Gage Skidmore / Flickr / CC BY-SA 3.0"}, {"url": "https://marriedbiography.com/shohreh-aghdashloo-biography/", "page_content": "Aghdashloo left Iran after ending the marriage legally with him in 1979, and they do not have any children together.\n\nIn 1972, was first married to Aydin Aghdashloo who is an Iranian painter, writer, graphist, and film critic. She was about 18 years old during her first marriage.\n\nShohreh Aghdashloo has performed in many plays and is a filmmaker as well.\n\nThe couple tied the knot in 1987. They are blessed with one daughter named Tara Jane Touzie who is seen on the red carpet events with her mom.\n\nCurrently, Shohreh Aghdashloo is in a happily married relationship with her second husband Houshang Touzie who is an actor as well as a playwright.\n\nWho is Shohreh Aghdashloo?\n\nShohreh Aghdashloo is an Iranian-American actress, model, and author.\n\nShohreh Aghdashloo is known for her work in movies like House of Sand and Fog, X-Men, The Lake House, The Stoning of Soraya M., ER, Grey’s Anatomy, House of Saddam, and The Expanse.\n\nShe is an Emmy Award-winning actress and earned the Noor Iranian Film Festival award in 2013.\n\nShohreh Aghdashloo- Age, Parents, Siblings, Ethnicity, Education\n\nShohreh Aghdashloo was born to her parents Effie (née al-Sadat) and Anushiravan Vaziri-Tabar in Tehran, Iran on May 11, 1952.\n\nAs of 2022, she is 69 years old and holds American-Iranian nationality. Her ethnicity is Caucasian and Taurus is her birth zodiac sign. Her full name is Shohreh Vaziri-Tabar.\n\nShe has three siblings named Shahram, Shahriar, and Shahrokh. All of them are her brothers and she is the only daughter of her parents.\n\nSimilarly, she graduated from Brunel University with a bachelor’s degree in international relations.\n\nHer Muslim parents took her to London when she was young. With the procedure during pursuing he acting career, she went to Los Angeles.\n\nShohreh Aghdashloo- Professional Life, Careers\n\nShohreh Aghdashloo started her acting career as an actress in theatres at the age of 19. She was featured in ‘The Narrow Road to the Deep North in 1973.\n\nHer debut movie ‘Guests of Hotel Astoria’ was released in 1989. She debuted on the small screen in a guest role in the episode of the NBC television series Matlock, named “Nowhere to Turn: A Matlock Mystery Movie”.\n\nFollowing year, she started in the tv series titled Surviving Paradise in 2000 which was directed and written by Kmshad Kooshan.\n\nHer role in the House of Sand and Fog by Vadim Perelman took her to the nomination of the Academy Award for Best Supporting Actress. Her acting in the film ‘The Stoning of Soraya M”. was criticized by the Iranian film intellect.\n\nSimilarly, she appeared as a guest on the television shows like Will and Grace, ER, and Grey’s Anatomy.\n\nShe starred in a supporting role in various movies like The Sisterhood of the Traveling Pants 2, X-Men: The Last Stand, and The Lake House.\n\nAghdashloo was the festival judge during the second annual Noor Iranian Film Festival held in Los Angeles in 2008.\n\nIn the following year, she played Sajida Talfah in the HBO original drama House of Saddam which earned her the Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or Movie.\n\nSimilarly, she received Career Achievement Award from the Public Affairs Alliance of Iranian Americans on October 9, 2010.\n\nShe continued to work in films like Septembers of Shiraz, The Odd Life of Timothy Green, and Star Trek Beyond and on the small screen starring as a guest in a series named House, The Simpsons, Law, and Order: Special Victims Unit, M.D., AND NCIS.\n\nEven she gives her voice for the video game roles like Mass Effect 2, Mass Effect 3, and Destiny and Destiny 2.\n\nShe starred as UN Deputy Undersecretary of Executive Administration Chrisjen Avasarala, in the television show ‘The Expanse’.\n\nOn June 24, 2013, she published a book titled ‘The Alley of Love and Yellow Jasmines’ representing her personal journey from a childhood in the Shah’s Iran to the red carpets of Hollywood.\n\nShohreh Aghdashloo- Net worth, Salary\n\nShohreh Aghdashloo’s net worth is estimated to be around 54 Million USD as per the sources.\n\nThere is no information about her detailed salary and monthly income.\n\nShohreh Aghdashloo- Rumors, Controversy\n\nBeing an actress, Shohreh Aghdashloo kept being in the limelight.\n\nAfter narrating the documentary movie ‘Iranium’ she went controversial she was criticized by many reporters and viewers.\n\nBody Features- Height, Weight\n\nShohreh Aghdashloo has a slim body standing at the height of 5 feet 5 inches weighing around 59 Kg.\n\nHer body measurements are 38 inches in Breast size, 36 inches in hip size, and 26 inches in Waist size.\n\nWith a fair complexion, she has pair of black eyes with hair of the same color.\n\nSocial Media\n\nMoving on to the social media profiles of Shoreh Aghdashloo, she has more than 519K followers while she has around 79.2K followers on her Twitter account.\n\nShe also has an official Facebook account with 114K followers approximately.\n\nAlso know about Alice Evans(British Actress), Janelle James, and Ciara Bravo."}, {"url": "https://bijog.com/biography/shohreh-aghdashloo", "page_content": "Shohreh Aghdashloo is known as an Iranian-American actress. She is most famous for her role as Chrisjen Avasarala on the science fiction TV show, The Expanse.\n\nBackground\n\nShohreh Aghdashloo was born as Shohreh Vaziri-Tabar on May 11, 1952 in Tehran, Iran.\n\nDuring the 1978 Islamic insurgency, Aghdashloo left Iran for England, to finish her education. Her enthusiasm for legislative issues and personal concern for social injustice would lead her to get a Bachelor's degree certificate in International Relations.\n\nCareer\n\nAfter numerous starring roles on the stage, her first major film role came when she was cast in The Report directed by Abbas Kiarostami. The film won the Critics Award at the Moscow Film Festival.\n\nDuring the 1970s, when she was the age of 20, she accomplished national fame in her country of Iran, when she was featuring in some classic films. In 1978, she won more extensive praise and built up herself as one of Iran's driving women in the acting industry with Desiderium (1978) directed by the late Ali Hatami.\n\nShe kept on pursuing her acting career, which eventually lead her on a move to Los Angeles, California in 1987.\n\nPersonal Life\n\nAfter she moved to California, she proceeded to wed actor/playwright Houshang Touzie and ended up performing in some of his plays."}, {"url": "https://instantbios.com/shohreh-aghdashloo-2/", "page_content": "Who is Shohreh Aghdashloo ?\n\nDetailed Shohreh Aghdashloo biography\n\nWhat is Shohreh Aghdashloo Age?\n\nWho’re Shohreh Aghdashloo Family Members?\n\nWho’re Shohreh Aghdashloo Children?\n\nWho’s Shohreh Aghdashloo Wife/ Husband?\n\nWhat is Shohreh Aghdashloo Net Worth 2020?\n\nShohreh Aghdashloo Social Media Accounts\n\nFacebook @\n\nInstagram: @\n\nTwitter: @\n\nShohreh Aghdashloo Biography\n\nShohreh Aghdashloo is an Iranian-American actress. Her first major film role was in The Report (Gozāresh) in 1977 directed by Abbas Kiarostami. The film won the Critics Award at the Moscow Film Festival.\n\nThat was followed by another film, Shatranje Bad (Chess of the Wind), directed by Mohammad Reza Aslani. It screened at several film festivals. However, both films were banned in her home country.\n\nIn 1978, Aghdashloo won acclaim for her performance in Sooteh Delan (Broken-Hearted), directed by Ali Hatami. That established her as one of Iran’s leading actresses. After establishing a theatre and film career in Iran, Aghdashloo moved to England during the Iranian Revolution in 1979.\n\nSubsequently, she became a U.S. citizen. She played small roles in television and film for several years. Her performance in House of Sand and Fog brought her several film critics’ awards and a nomination for an Academy Award for Best Supporting Actress.\n\nShe continued playing supporting and character roles in film and television. For instance, she had a starring role as Chrisjen Avasarala on the Syfy original series The Expanse.\n\nShohreh Aghdashloo Photo\n\nShe also won the Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or Movie for her work in the HBO original miniseries House of Saddam. In 2013, she released her autobiography, titled The Alley of Love and Yellow Jasmines.\n\nShohreh Aghdashloo Age\n\nShohreh Aghdashloo was born in Tehran, Iran. She was born on 11th May 1952. Her current age is 67 years old as of 2019.\n\nShohreh Aghdashloo Net Worth\n\nShohreh Aghdashloo has a successful acting career. She has appeared in a number of various films and television shows. Her career started way back in 1977. Having been in the industry for quite a long time, she must have earned quite a huge fortune. Her current net worth is however under review. We will update you on the same soon.\n\nShohreh Aghdashloo Husband\n\nShohreh Aghdashloo has been married twice. Her first marriage was in her native hometown Iran. She was 18 when she got married to Aydin Aghdashloo. He was a prominent Iranian painter, writer and film critic. The two did not have any children. They later divorced in 1979 and Shohreh left Iran.\n\nCurrently, the actress is married to Houshang Touzie. He is an actor and playwright. The two got married in 1987. The couple worked together especially in the early stages of Aghdashloo’s career. Shohreh and Touzie are parents to one daughter Tara Jane Touzie.\n\nShohreh Aghdashloo Daughter\n\nShohreh Aghdashloo has one daughter. She is called Tara Jane Touzie. Tara was born in 1989. She has followed in her mother’s footsteps and is a budding filmmaker. Regularly, she accompanies her mother to red carpet events.\n\nShohreh Aghdashloo Movies And TV Shows | Shohreh Aghdashloo Star Trek\n\nMovies\n\n2000 Surviving Paradise\n\n2003 Possessed\n\n2005 The Exorcism of Emily Rose\n\n2006 American Dreamz\n\n2008 The Sisterhood of the Traveling Pants 2\n\n2010 The Adjustment Bureau\n\n2011 Iranium\n\n2013 Percy Jackson: Sea of Monsters\n\n2014 Rosewater\n\n2015 Last Knights\n\n2016 Star Trek Beyond\n\nTV Shows\n\n1990 Matlock\n\n2001 The Honduran Suburbs\n\n2006 Smith\n\n2007 Grey’s Anatomy\n\n2008 House of Saddam\n\n2009 FlashForward\n\n2011 Law & Order: Special Victims Unit\n\n2012 Portlandia\n\n2013 Grimm\n\n2014 Scorpion\n\n2017 The Punisher\n\nShohreh Aghdashloo Awards\n\n2004 Independent Spirit Award for Best Supporting Female\n\n2007: Arpa Career Achievement Award\n\n2009 Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or a Movie\n\n2009 Satellite Award for Best Actress – Motion Picture Drama\n\n2013: Noor Iranian Film Festival Achievement Award\n\nShohreh Aghdashloo Interview\n\nQ: Nowruz Mubarak Shohreh Khanoom…. What is your most favorite Nowruz memory?\n\nShohreh Aghdashloo: The one that my youngest brother Sean was born a couple of hours after the new year. All we could think of was the baby`s arrival while counting numbers to celebrate the New Year.\n\nQ: That is a beautiful memory. What do you think about the power of films to make a difference and change the world?\n\nShohreh Aghdashloo: Films are great sources to educate, illuminate, inspire, ignite ideas and to nurture your imagination, conscious, unconscious, or subliminal.\n\nQ: Why did you choose to open your own theater company when you came to the US?\n\nShohreh Aghdashloo: I was not exactly the girl next door in the early 1980s in Hollywood. After a few unsuccessful auditions, I decided to start a Theatre Company with the help of my husband Houshang Touzie who is a very talented playwright and actor.\n\nQ: You seem so passionate about every role you play… How do you choose which characters you want to play and which ones to pass on? What was your favorite role to date?\n\nShohreh Aghdashloo: I love all my roles. They are like my children. After all, I pick them up with a pair of tweezers. I pick the ones that speak to me, and that are relevant and meaningful and pass on those that do not make sense to me.\n\nQ: I think your audience can sense that. In one interview, I believe I heard you say that you are a fan of Elizabeth Warren. Do you have an interest in politics and do you feel it is important for the Iranian community to get more involved?\n\nShohreh Aghdashloo: Elizabeth Warren is a progressive politician and a true public servant. My major in college was “International Relations”, but my passion is storytelling. I sincerely hope that more and more Iranians will participate in politics.\n\nQ: I agree. You are very vocal in our support of women’s rights – what do you want to say to young Iranian women today?\n\nShohreh Aghdashloo: Continue doing what you are doing. You are the face of the future and our only hope for a better future in Iran. Be yourself and let the world see through you. Be organic, authentic and be visionary.\n\nQ: There are many Iranians that want to find a way to make a difference in the world – do you have any advice to them on how to find their way?\n\nShohreh Aghdashloo: Be yourself and let the world see through you. Be organic, authentic and be visionary.\n\nQ: I love that…let the world see through you… I know you have a few projects you are working on, could you share a little about them?\n\nShohreh Aghdashloo: My movie SIMPLE WEDDING is my first romantic comedy. It is set to be released in September and my husband Houshang Touzie is also in the film. The premiere of THE CUBAN is expected to join the Toronto Film Festival in September as well. Last but not least, I am impatiently awaiting the premiere of Season 4 of THE EXPANSE. We recently wrapped filming in Canada and I am very excited about the new season.\n\nQ: I can’t wait to see all of them…especially Simple Wedding! I love that it is about Iranian weddings and all the love and drama that goes with it. In honesty, I love any production you are involved in. Thank you for taking the time for this interview.\n\nSOURCE: iranian.com"}, {"url": "https://www.tvinsider.com/people/shohreh-aghdashloo/", "page_content": "Actress\n\nBirth Date: May 11, 1952\n\nAge: 71 years old\n\nBirth Place: Tehran, Iran\n\nThe star of a number of politically controversial feature films in her native Iran during the 1970s, actress Shohreh Aghdashloo had to wait another 20 years before she resumed her career momentum with acclaimed screen performances in American films and television. At the age of 51, she emerged onto the international stage with her Oscar-nominated supporting performance as the wife of a former Iranian military officer reduced to working-class status upon the family's immigration to America in \"House of Sand and Fog\" (2003). From there, the actress was cast in many roles as highly educated, sophisticated professionals on primetime dramas and in films, including \"X-Men: The Last Stand\" (2006). Aghdashloo also maintained a commitment to Iranian social and political issues with productions like \"Maryam\" (2002) and \"The Stoning of Soraya M.\" (2008), which showcased her powerful screen presence and a versatility that helped break down the Western screen's limited notions about Middle-Eastern life and women."}, {"url": "https://biographyresearch.org/what-happened-to-shohreh-aghdashloo-husband-voice-salary/", "page_content": "• Shohreh Aghdashloo is an Iranian-American actress and film producer with close to 100 acting credits.\n\n• She was born in Tehran, Iran in 1952 and moved to England in 1979 to pursue acting.\n\n• She has starred in numerous movies and TV series such as “The Adjustment Bureau”, “Grimm”, “24”, “The Expanse”, and “The Flight Attendant”.\n\n• She is married to Iranian actor and playwright Houshang Touzie, with whom she has a daughter.\n\n• Shohreh’s net worth is estimated to be over $2 million.\n\nWho is Shohreh Aghdashloo?\n\nShohreh was born in Tehran, Iran, on 11 May 1952 – her zodiac sign is Taurus, and she holds both Iranian and American nationality. She’s an actress and film producer, with close to 100 acting credits to her name, while she’s perhaps still known best for her portrayal of Nadi in the 2003 crime movie “House of Sand and Fog”, written and directed by Vadim Perelman, and which stared Jennifer Connelly, Ben Kingsley and Ron Eldard. It follows an abandoned wife who’s entered a conflict with her house’s new owners; the movie won 13 of the 48 awards for which it was nominated, including three Oscar nominations for Best Actor in a Leading Role (Ben Kingsley), Best Actress in a Supporting Role (Shohreh) and Best Music, Original Score.\n\nDear friends,I'm coming in with great news on Monday. Can't wait to share it with you. 🙏❤دوستان عزیزم، دوشنبه خبر خوشی را که دریافت کرده‌ام به اطلاعتان خواهم رساند. دوستتان دارم بی قید و شرط. ❤️ Posted by Shohreh Aghdashloo on Wednesday, June 2, 2021\n\nEarly life and education\n\nShohreh was raised in Tehran alongside her brothers Shahrokh, Shahriar and Shahram, by their father Anushiravan Vaziri-Tabar, and mother Effie (nee alSadat).\n\nShe became interested in acting at a very early age, but as her parents weren’t supportive of the idea of her becoming an actress, Shohreh focused on other things instead.\n\nUpon matriculating in 1972 at the age of 19, she began taking acting lessons and attending theatre workshops, even though her parents still opposed the idea; she made her debut film appearance in 1976, with her portrayal of Lady’s Maid in the mystery thriller drama “Chess of the Wind”, written and directed by Mohammad Reza Aslani, and which starred Fakhri Khorvash, Mohamad Ali Keshavarz and Akbar Zanjanpour. It follows the death of the first lady of a noble house, and the subsequent conflict for sharing her inheritance; the movie was nominated for a FOCAL International Award for Best Archival Restoration and Preservation Title.\n\nIn 1979, following the Iranian Revolution, Shohreh moved to England and enrolled at Brunel University, from which she graduated with a Bachelor’s degree in international relations in 1983; she then settled in Los Angeles, California, wanting to continue pursuing acting.\n\nRoles in movies\n\nShohreh played Azam Firuzkui in the 1977 drama “The Report”, and a couple of her following roles were in the 1978 romantic drama “Desiderium”, the 1989 drama “Guests of Hotel Astoria”, and the 1991 drama “Raha”.\n\nShe gained recognition in 1993, when cast to play Ghada Holiday in the comedy drama “Twenty Bucks”, directed by Keva Rosenfeld, and which starred Linda Hunt, Brendan Fraser and Elisabeth Shue. It follows the ‘life’ of a $20 bill, and the movie was nominated for three awards.\n\nA couple of Shohreh’s most notable performances in the decade were in the 2005 adventure family drama “The Nativity Story”, the 2005 horror thriller “The Exorcism of Emily Rose”, and the 2008 drama “The Stoning of Soraya M.”\n\nThe year 2013 heard her voice Oracle in the adventure family fantasy “Percy Jackson: Sea of Monsters”, directed by Thor Freudenthal, and which starred Logan Lerman, Alexandra Daddario and Brandon T. Jackson. It follows Poseidon’s son and his friends as they’re searching for the Golden Fleece; the movie won three of the eight awards for which it was nominated.\n\nThree of Shohreh’s most recent movie roles have been in the 2019 drama “The Cuban”, the 2020 horror thriller “Run Sweetheart Run”, and the 2021 adventure fantasy comedy “Ghostbusters: Afterlife”.\n\nRoles in TV series\n\nShohreh made her debut TV series appearance in the 1990 episode “Nowhere to Turn” of the mystery crime drama “Matlock”, and in 1993 she played Malika in the episode “Jerome’s in the House” of the romantic comedy drama “Martin”.\n\nHer following role came in 2005, when cast to play Dina Araz in the action crime drama “24”, created by Robert Cochran and Joel Surnow, and which starred Kiefer Sutherland, Mary Lynn Rajskub and Carlos Bernard. It follows the life of counter terrorism agent Jack Bauer, aired from 2001 to 2010, and won 94 awards, including 20 Primetime Emmys, while it was nominated for 207 other awards.\n\nA couple of Shohreh’s following roles were in seven episodes of the 2007 crime thriller drama “Smith”, three episodes of the 2009 mystery science fiction drama “Flashforward”, and seven episodes of the 2014 fantasy crime drama “Grimm”.\n\nShe voices Queen Janna in the 2019 animated action adventure “The Lion Guard”, created by Ford Riley, and which starred Max Charles, Joshua Rush and Diamond White. It follows Simba’s son Kion and his friends who’ve formed Lion Guard, and are now protecting the Pride Lands; the series has been airing since 2015, and has been nominated for 12 awards.\n\nThree of Shohreh’s most recent roles have been in the 2021 episode “Zenobia” of the science fiction “The Expanse: One Ship”, 62 episodes of the mystery science fiction drama “The Expanse” since 2015, and five episodes of the 2022 mystery comedy drama “The Flight Attendant”.\n\nOther credits\n\nShohreh sang the songs “In This Blind Alley” and “In This Deadend” in the 2014 movie “Rosewater”.\n\nShe’s received special thanks for three movies: the 2011 romantic science fiction thriller “The Adjustment Bureau”, the 2013 short drama “Please Stand By”, and the 2017 documentary “Intent to Destroy: Death, Denial & Depiction”.\n\nShohreh has three producing credits: the 2018 romantic comedy movie “A Simple Wedding”, in which she also starred, five episodes of the series “The Expanse: One Ship”, and six episodes of the series “The Expanse”.\n\nShe’s made a guest appearance in various talk-shows, most recently in “Home & Family”, “The Expanse Aftershow”, and “You Are Beautiful with Lawrence Zarian”.\n\nAwards and nominations\n\nShohreh’s won 16 of the 30 awards for which she’s been nominated, with some of these wins having been a 2004 Film Independent Spirit Award for Best Supporting Female, for “House of Sand and Fog”, a 2007 Arpa International Film Festival Career Achievement Award, and a 2009 Primetime Emmy for Outstanding Supporting Actress in a Miniseries or Movie, for her performance in “House of Saddam”,\n\nLove life and husband\n\nShohreh was 19 years old when she married Iranian painter, author and film critic Aydin Aghdashloo in 1972, while he was 31; the two had no children together, and divorced in 1979.\n\nShe married her second husband, Iranian actor and playwright Houshang Touzie in 1987, in a small ceremony attended by only the closest of their friends and family members; in 1989, Shohreh gave birth to their daughter Tara Touzie.\n\nShe could’ve been seen appearing in many of her husband’s plays, on both national and international stages, but mostly in Iran.\n\nShohreh hasn’t mentioned any other men whom she’s perhaps been with, and as of August 2022, she’s married to her second husband Houshang Touzie, and they have a daughter together.\n\nHobbies and other interests\n\nShohreh seems to be enjoying the attention which she’s receiving from her more than 500,000 Instagram followers, and is thus quite active on the network; she’s uploaded over 750 pictures, the majority of which feature her during her everyday life.\n\nShe was physically highly active during her 20s, 30s and 40s, mostly because it was important for her acting career to stay in shape, but Shohreh no longer works out.\n\nShe’s passionate about travelling, and has been all around the world for both work and pleasure, while her dream travel destination is Miami, Florida.\n\nShe has her own favorite actors and actresses, some of whom are Bruce Willis, Clint Eastwood and Meryl Streep, while her favorite films include “The Fifth Element”, “The Good, The Bad and The Ugly”, and “Bridges of Madison County”.\n\nAge, height and net worth\n\nShohreh’s age is 70. She has long brown hair and brown eyes, her height is 5ft 5ins (1.65m) and she weighs around 120lbs (55kgs).\n\nAs of August 2022, her estimated net worth is over $2 million."}, {"url": "https://simple.wikipedia.org/wiki/Shohreh_Aghdashloo", "page_content": "Shohreh Aghdashloo (Persian: شهره آغداشلو) (born Shohreh Vaziri-Tabar; May 11, 1952) is an Iranian-American actress. Her first major part was in 1977 on the movie The Report. She became well known for her part in House of Sand and Fog which she was considered for Academy Award for Best Supporting Actress. Aghdashloo currently has a starring role in The Expanse.[1] In 2013, she wrote a book about herself called The Alley of Love and Yellow Jasmines.[2]\n\nEarly life [ change | change source ]\n\nAghdashloo was born in Tehran, Iran. Her parents were Effie al-Sadat and Anushiravan Vaziri-Tabar and she has three brothers: Shahram, Shahriar and Shahrokh. At the age of 19, Aghdashloo married painter Aydin Aghdashloo in 1972. During this time, she went to classes on theater even though her parents did not approve. She and Aydin divorced in 1979 when she left Iran for England during the Iranian Revolution.\n\nShe went to Brunel University and earned a Bachelor's degree in international relations. Later, she moved to Los Angeles to pursue her acting career. She later became a U.S. Citizen. In 1987, she married actor and playwright Houshang Touzie. She was born to a Muslim family, but says she never practiced the religion.[3]\n\nVideo games [ change | change source ]\n\nYear Title Role Notes 2019 The Two Princes Queen Attosa Audio drama\n\n\n\n"}, {"url": "https://www.famousbirthdays.com/people/shohreh-aghdashloo.html", "page_content": "About\n\nEmmy Award winning actress who has appeared in many film and television productions, including the 2003 film House of Sand and Fog.\n\nBefore Fame\n\nShe started acting at age 18 in numerous stage roles and had her first film role in Gozāresh.\n\nTrivia\n\nShe provided the voice for Admiral Shala'Raan vas Tonbay in the video games Mass Effect 2 and Mass Effect 3.\n\nFamily Life\n\nShe married Houshang Touzie in 1987. She has a daughter named Tara.\n\nAssociated With\n\nShe starred with Ben Kingsley in the drama film House of Sand and Fog, which was based on a novel by Andre Dubus III."}, {"url": "https://www.allmovie.com/artist/shohreh-aghdashloo-vn6778938", "page_content": "An Iranian actress whose strong political beliefs almost led her to a career as a journalist, Shohreh Aghdashloo decided instead that she could reach more people by working in film and theater -- and with her Oscar-nominated role in the tragedy House of Sand and Fog, she found an audience the size of which she never dreamed possible. Born in Tehran in 1952 to an intellectual, creative family, Aghdashloo was drawn to the theater at an early age, and by her twenties was performing in various cutting-edge performance groups, among them the acclaimed Drama Workshop of Tehran. Filmmakers often drew upon talent from the Workshop, and Aghdashloo was cast by directors Abbas Kiarostami and Ali Hatami -- two towering figures of the nascent Iranian New Wave -- to play starring roles in several of their formally adventurous, socially progressive productions, including 1977's Gozaresh and Sutedelan.\n\nBut in the late '70s, with the Ayatollah Khomeini reintroducing an era of strict rule based on religious doctrine, Aghdashloo's work as a performer was either censored or forbidden outright. Eager to escape the turmoil of the Iranian Revolution, Aghdashloo left her husband and her career to go to London, where she earned a degree in international relations. She was on the verge of accepting a position at a newspaper when a friend presented her with a play, called Rainbow, about the Revolution and its discontents. He had written a role specifically for her, and Aghdashloo believed in the project enough to put her journalism career on hold -- for what would turn out to be an indefinite length of time. Rainbow was such a success, it toured the United States, where Aghdashloo was reunited with a Workshop colleague of hers, Houshang Touzie; a romance soon developed, and two married in Los Angeles in the late '80s.\n\nDiscouraged by the dearth of non-stereotyped roles for Middle Eastern women in Hollywood, Aghdashloo focused her attention instead on stage work, even creating a traveling theater troupe with her husband that performed plays in Farsi for Iranian audiences. Her occasional film work included roles in such topical dramas as America So Beautiful and Maryam, both about the struggle of Iranian immigrants in the U.S. It was such work that caught the attention of director Vadim Perelman, who was looking to cast the supporting role of Nadi in his big-screen adaptation of the bestseller House of Sand and Fog. Perelman and his casting agent contacted Aghdashloo directly -- at the time, the actress had no agent or manager -- and were soon convinced that she was the woman for the part. Having read the book upon its release, Aghdashloo had long envisioned ways that she could play Nadi, a strong but subservient Iranian-American wife and mother caught between her husband's wishes and her own conscience. Opposite the formidable Ben Kingsley in a cast of established performers, Aghdashloo's subtle, simmering performance brought her kudos from the New York Film Critics and Los Angeles Film Critics Associations, both of whom named her 2003's Best Supporting Actress. The Academy followed suit, nominating her against such Hollywood stalwarts as Renée Zellweger and Holly Hunter.\n\nFollowing a recurring role on the wildly popular television hit 24 that served well to introduce the increasingly prominant actress to audiences outside of the art-house circuit, Aghdashloo turned in impressive supporting performances in such popular wide release films as The Exorcism of Emily Rose, American Dreamz, and X-Men: The Last Stand. In 2006 Aghdashloo would heed the call of Hollywood once again to take a featured role as the best friend of Sandra Bullock's lonely character in the romantic fantasy remake The Lake House. She went on appear in The Stoning of Soraya M., The Sisterhood of the Traveling Pants, and House of Saddam, and narrated the documentaries Iranium and For Neda."}]}