{"Marshall Manesh and Shohreh Aghdashloo have two children.": [{"url": "https://www.encyclopedia.com/education/news-wires-white-papers-and-books/aghdashloo-shohreh-1952-shohreh-shohreh-vaziri", "page_content": "Aghdashloo, Shohreh 1952- (Shohreh, Shohreh Vaziri)\n\nPERSONAL\n\nOriginal name, Pari Vaziri-Tabar; born May 11, 1952, in Tehran, Iran; married Aydin Aghdashloo (an artist), 1972 (divorced, 1980); married Houshang Touzie (an actor and playwright), 1995; children: (second marriage) Tara. Education: International University Europe, Waterford, England, B.A.\n\nAddresses:\n\nAgent—Creative Artists Agency, 2000 Avenue of the Stars, Los Angeles, CA 90067. Publicist—Carol Marshall, Carol Marshall Public Relations, 4849 Placidia Ave., Toluca Lake, CA 91601-4833.\n\nCareer:\n\nActress. Appeared on stage with theatre workshops in Iran.\n\nAwards, Honors:\n\nNew York Film Critics Circle Award, 2003, Los Angeles Film Critics Association Award, Independent Spirit Award, Independent Features Project/West, Academy Award nomination, and Online Film Critics Society Award, all best supporting actress, 2004, for House of Sand and Fog; Golden Satellite Award nomination, outstanding supporting actress in a television series, miniseries, or movie, International Press Academy, 2005, for 24.\n\nCREDITS\n\nFilm Appearances:\n\nShatranje bad (also known as The Chess Game of the Wind), 1976.\n\nGozaresh (also known as The Report), 1977.\n\nAghdas, Sooteh-Delan (also known as Broken Hearts and Desiderium), Payam, 1978.\n\nGuests of Hotel Astoria, International Home Cinema, 1989.\n\nTitle role, Raha, 1991.\n\nGhada Holiday, Twenty Bucks, Triton Pictures, 1993.\n\nPari, Surviving Paradise, Radio London Films, 2000.\n\nExiled actress, America So Beautiful, 2001, Noor Film Festival, 2007.\n\nHoma Armin, Maryam, Streetlight Films, 2002.\n\nPossessed (short film), Mad Apple Films, 2003.\n\nNadi, House of Sand and Fog, DreamWorks, 2003.\n\nNarrator, Mystic Iran: The Unseen World (documentary), Wellspring Media, 2004.\n\nDr. Adani, The Exorcism of Emily Rose, Screen Gems, 2005.\n\nSerenity, Universal, 2005.\n\nVoice of Farah, Babak & Friends: A First Norooz (animated short film), Avang, 2005.\n\nNazneen Riza, American Dreamz, Universal, 2006.\n\nDr. Kavita Rao, X-Men: The Last Stand (also known as X-Men 3 and X3), Twentieth Century-Fox, 2006.\n\nDr. Anna Klyczynski, The Lake House, Warner Bros., 2006.\n\nElizabeth, The Nativity Story, New Line Cinema, 2006.\n\nFilm Producer:\n\nMystic Iran: The Unseen World (documentary), Wellspring Media, 2004.\n\nTelevision Appearances; Series:\n\nDina Araz, 24, Fox, 2005.\n\nCharlie, Smith, CBS, 2006-2007.\n\nTelevision Appearances; Miniseries:\n\nSajida Khairallah Talfah, Between Two Rivers, HBO, 2007.\n\nTelevision Appearances; Episodic:\n\n(As Shohreh) Saleslady, \"Nowhere to Turn,\" Matlock, NBC, 1990.\n\n(As Shohreh Vaziri) Malika, \"Jerome's in the House,\" Martin, Fox, 1993.\n\nThe Charlie Rose Show, PBS, 2003.\n\nThe View, ABC, 2005.\n\nThe Tony Danza Show, syndicated, 2005.\n\nRiza Kardatay, \"Lost in America,\" ER, NBC, 2006.\n\nPam, \"Cowboys and Iranians,\" Will & Grace, NBC, 2006.\n\n\"The Nativity Story,\" HBO First Look, HBO, 2006.\n\nDr. Helen Crawford, \"Scars and Souvenirs,\" Grey's Anatomy, ABC, 2007.\n\nTelevision Appearances; Awards Presentations:\n\nThe 2004 IFP/West Independent Spirit Awards, Independent Film Channel, 2004.\n\nThe 76th Annual Academy Awards, ABC, 2004.\n\nThe 20th IFP Independent Spirit Awards, Independent Film Channel and Bravo, 2005.\n\n2006 Independent Spirit Awards, Independent Film Channel, 2006.\n\nTelevision Appearances; Other:\n\nLila Ravan, The Secret Service (pilot), ABC, 2004.\n\nCharlie, Smith (pilot), CBS, 2006.\n\nNarrator of the documentary special Iran: A Celebration of Art and Culture, PBS.\n\nInternet Appearances; Series:\n\nHerself, \"Day 4: 1:00 p.m.-2:00 p.m.,\" 24Inside, 2005.\n\nRECORDINGS\n\nVideos:\n\nBehind the Scenes of \"House of Sand and Fog,\" DreamWorks Home Entertainment, 2004.\n\nAudio Books:\n\nNarrator of Inside the Kingdom: My Life in Saudi Arabia, by Carmen bin Laden.\n\nOTHER SOURCES\n\nPeriodicals:\n\nEntertainment Weekly, February 6, 2004, p. 68.\n\nNew York Times, January 23, 2005.\n\nTV Guide, February 20, 2005, pp. 38-39.\n\nUSA Today, June 16, 2005.\n\nWashington Post, February 24, 2004, pp. C1, C4."}, {"url": "https://www.latimes.com/entertainment/movies/la-xpm-2013-jun-01-la-et-mn-aghdashloo-conversation-20130602-story.html", "page_content": "Iranian American actress Shohreh Aghdashloo, who earned an Oscar nomination for her performance in “House of Sand and Fog” (2003), writes about her life journey from Tehran under siege to Hollywood in her new memoir, “The Alley of Love and Yellow Jasmines,” which hits bookstores on Tuesday.\n\nIn your memoir, you write that your Oscar nomination made you proud to open the door for other Middle Eastern actors to get roles that aren’t terrorists. How has that been going?\n\nI haven’t played a terrorist since “24,” and believe me, when I chose the role it wasn’t because of its political background but [because] the role was so dimensional.\n\nAdvertisement\n\nAre the roles you’re offered pretty diverse?\n\nPretty diverse. After “House of Sand and Fog,” I played a professor in “X-Men[: The Last Stand],” I played Anna in “The Lake House.” Right after that, I played a Turkish lady in “The Sisterhood of the Traveling Pants.” I played Dr. Adani in “The Exorcism of Emily Rose,” and I played Dr. Helen Crawford on “Grey’s Anatomy.” I was so happy when I was reading the script, when I realized my name was Helen Crawford — an American name.\n\nPHOTOS: Hollywood backlot moments\n\nDo you think those kinds of opportunities are also available to other Middle Eastern actors?\n\nFirst you’ve got to be lucky. If you’re in love with this profession, then the industry would like to work with you. The same thing will happen with other actors.\n\nYou write about the performance you gave — but we never saw — in “The Adjustment Bureau.” What happened?\n\nOh, my God, I loved that role. As actors, we all know we’re at the mercy of the editing table, but not to this extent, never had I experienced it. The director, George Nolfi, decided I should play God. Everything went great until I got a call from the director who was asking to have lunch with me. He was on the verge of crying. He said, the distribution company believes that you cannot play this role.\n\nBecause God couldn’t be a Muslim woman?\n\nThat’s right, although if I’m asked what religion I am, I say I was born a Muslim. I don’t introduce myself as a Muslim woman, but I guess the distribution company put the dots together and felt it’s too early for this.\n\nPHOTOS: Celebrities by The Times\n\nTo say “it’s too early” implies your belief that eventually that will come.\n\nIt’s going to take time, but eventually it will happen.\n\nBy the way, I was amused by your Tehran story about tracking down your burglars, who were people you knew, because you didn’t want to pursue charges and the cop who was with you wanted to make an arrest, you “tipped” him. We call that a bribe.\n\nYes, that’s right, we bribed him. I had given the thief my word that I was never, ever going to mention his name or press charges. That’s why we had to tip the policeman. That’s a nice way of putting it.\n\nAnd I gather that when you were nominated for your supporting actress Oscar, you were less than impressed when Renee Zellweger (who later won for “Cold Mountain”) didn’t bother to respond to Holly Hunter’s invitation to lunch with your fellow nominees.\n\nTo tell you the truth, I was more appalled than Holly herself, who was the host.\n\nSo coming up for you is “The Last Knights.” Can you talk about it?\n\nThey may change its name. It was filmed in Prague during the winter and hopefully it will be on the silver screen in December. I worked with Clive Owen and Morgan Freeman. I portray Morgan’s wife, Lady Bartok — again, a non-Iranian character. I loved working in Prague. It feels like you’re waking up in a museum.\n\nVIDEO: Upcoming summer films\n\nI was curious to know why you didn’t write about “Iranium,” the 2011 documentary you narrated about Iran’s nuclear threat. You and the film were criticized for implicitly calling for war against Iran, but you’re proud of your outspokenness. Why didn’t you write about it?\n\nYes, that was pretty scandalous. The reason I didn’t write about it was that what the Iranians were saying was irrelevant to the making of it, the purpose that I had in lending my voice to it. I was more than happy to lend my voice to it so it would shed light on the doctrines of this religious dictatorship.\n\nThe film talks about Iranian people’s desire to rejoin the international community. Where does the Green Movement of protesters stand, as far as you know?\n\nThe Green Movement has gone underground. We’re all looking toward the election this June 14. It won’t make a difference. I’ve heard there are parents in Iran who’ve said that on the election day, they’re going to lock their doors and won’t allow their children to leave the house, let alone go vote. They are afraid. If I were in Iran, I would do the same thing. If my vote isn’t going to make a difference and if my child’s vote is going to cost him his life, I’m not going to vote at all.\n\nWhen you spoke against torture in Iranian prisons on CNN, you write that your brother was arrested the next day and imprisoned for a year. Did you have any regrets about that?\n\nHonestly, no, because I hold my mother responsible for it. She was the one who was on the phone 24/7, begging me not to say anything. Maybe this was the tragedy of my life, but I stood up to my mother.\n\ncalendar@latimes.com\n\nPHOTOS AND MORE"}, {"url": "https://liverampup.com/p/shohreh-aghdashloo-husband-daughter.html", "page_content": "The 69-year-old ‘The Expanse’ star Shohreh Aghdashloo has had her share of setbacks off-screen due to her roller-coaster marital life.\n\nHer rough road to marriage includes her failed first marriage. However, who is the one who mesmerized her again and swept her off her feet?\n\nGiven that the beautiful Iranian-American actress lives in the hearts of millions, how Shohreh is doing with her second husband has been a major curiosity for her admirers.\n\nShohreh Aghdashloo’s Husband\n\nWith a little hope for comfort, the Iranian actress turned to her friend from her home country; instead, she found everything.\n\nDuring the mid-1980s, she met her husband, Houshang Touzie, a fellow actor from Iran. The couple instantly fell in love and decided to get married after dating for a while.\n\nIn 1987, Touzie and Shohreh tied the knot following Iranian traditions. They held a beautiful wedding ceremony and celebrated their love amidst their loved ones.\n\nThey can be called a power couple as their togetherness doesn’t only limit to love.\n\nThe power couple has made a great contribution to the Iranian entertainment industry.\n\nAfter the 1979 revolution, the Theatrical and Acting Workshop in Tehran was shut down. But, they couldn’t just sit back and do nothing.\n\nSo, Touzie and Shohreh founded Workshop ‘79, a Los Angeles-based drama production company.\n\nTheir love continues to be powerful as Touzie shared a picture in 2021, with the caption,\n\nI love you not only for what you are but for what I am when I am with you.\n\nShohreh Aghdashloo With Her Husband (Source: Instagram)\n\nThe adorable couple continues to share a family and be each other’s home.\n\nShohreh's Relationship With Her Daughter\n\nAfter two years of marriage, the couple decided they were ready to have children and start a family. So in September 1989, they welcomed their beloved daughter, Tara Touzie, into this world.\n\nLooking at Shohreh’s tweets, she has a tight-knitted relationship with her daughter.\n\nIn 2018, she made a special post to shower her daughter with immense love and gratitude. As we can see in the tweet, she has a lot of appreciation and love for Tara.\n\nShohreh Aghdashloo Tweet (Source: Twitter)\n\nUnlike her parents, Tara chose to become a writer. Shohreh and her husband accept her career choice and are proud of her.\n\nThe actress even made a special appreciation post dedicating Tara as she expressed how proud she is as her mother.\n\nAlthough Shohreh continues to live happily with her husband and daughter today, some people are curious about her past.\n\nMore On Divorced Actresses: Divorced Actress, Delphine Chaneac Rumored to be Getting Married to Her Super Hot Partner Eric Morais\n\nFirst Marriage\n\nBefore finding her present partner, Shohreh was married to Aydin Aghdashloo for seven years.\n\nBeing with Aydin for almost a decade, she decided to end the marriage and move on.\n\nHowever, after Iran’s 1979 revolution, it gave her the courage to end her marriage, which was already on the brink of collapse.\n\nAt the time, Ayatollah Khomeini’s religious regime brought suppressing restrictions on women and their involvement in art. The unexplainable suffocation to women changed with the revolution.\n\nAfter leaving her former husband and her past behind, she started making history in the entertainment industry.\n\nEven now, she shares her past struggles as an outsider in Hollywood. But, her fandom always made her feel at home, admiring her talent."}, {"url": "https://wiki.kidzsearch.com/wiki/Shohreh_Aghdashloo", "page_content": "Shohreh Aghdashloo (Persian: شهره آغداشلوLua error in package.lua at line 80: module 'Module:Category handler/data' not found.) (born Shohreh Vaziri-Tabar; May 9, 1952) is an Iranian-American actress. Her first major part was in 1977 on the movie The Report. She became well known for her part in House of Sand and Fog which she was considered for Academy Award for Best Supporting Actress. Aghdashloo currently has a starring role in The Expanse.[1] In 2013, she wrote a book about herself called The Alley of Love and Yellow Jasmines.[2]\n\nEarly life\n\nAghdashloo was born in Tehran, Iran. Her parents were Effie al-Sadat and Anushiravan Vaziri-Tabar and she has three brothers: Shahram, Shahriar and Shahrokh. At the age of 19, Aghdashloo married painter Aydin Aghdashloo in 1972. During this time, she went to classes on theater even though her parents did not approve. She and Aydin divorced in 1979 when she left Iran for England during the Iranian Revolution.\n\nShe went to Brunel University and earned a Bachelor's degree in international relations. Later, she moved to Los Angeles to pursue her acting career. She later became a U.S. Citizen. In 1987, she married actor and playwright Houshang Touzie. She was born to a Muslim family, but says she never practiced the religion.[3]\n\nFilmography\n\nFilms\n\nTelevision\n\nVideo games\n\nAudio\n\nYear Title Role Notes 2019 The Two Princes Queen Attosa Audio drama"}, {"url": "https://instantbios.com/shohreh-aghdashloo-2/", "page_content": "Who is Shohreh Aghdashloo ?\n\nDetailed Shohreh Aghdashloo biography\n\nWhat is Shohreh Aghdashloo Age?\n\nWho’re Shohreh Aghdashloo Family Members?\n\nWho’re Shohreh Aghdashloo Children?\n\nWho’s Shohreh Aghdashloo Wife/ Husband?\n\nWhat is Shohreh Aghdashloo Net Worth 2020?\n\nShohreh Aghdashloo Social Media Accounts\n\nFacebook @\n\nInstagram: @\n\nTwitter: @\n\nShohreh Aghdashloo Biography\n\nShohreh Aghdashloo is an Iranian-American actress. Her first major film role was in The Report (Gozāresh) in 1977 directed by Abbas Kiarostami. The film won the Critics Award at the Moscow Film Festival.\n\nThat was followed by another film, Shatranje Bad (Chess of the Wind), directed by Mohammad Reza Aslani. It screened at several film festivals. However, both films were banned in her home country.\n\nIn 1978, Aghdashloo won acclaim for her performance in Sooteh Delan (Broken-Hearted), directed by Ali Hatami. That established her as one of Iran’s leading actresses. After establishing a theatre and film career in Iran, Aghdashloo moved to England during the Iranian Revolution in 1979.\n\nSubsequently, she became a U.S. citizen. She played small roles in television and film for several years. Her performance in House of Sand and Fog brought her several film critics’ awards and a nomination for an Academy Award for Best Supporting Actress.\n\nShe continued playing supporting and character roles in film and television. For instance, she had a starring role as Chrisjen Avasarala on the Syfy original series The Expanse.\n\nShohreh Aghdashloo Photo\n\nShe also won the Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or Movie for her work in the HBO original miniseries House of Saddam. In 2013, she released her autobiography, titled The Alley of Love and Yellow Jasmines.\n\nShohreh Aghdashloo Age\n\nShohreh Aghdashloo was born in Tehran, Iran. She was born on 11th May 1952. Her current age is 67 years old as of 2019.\n\nShohreh Aghdashloo Net Worth\n\nShohreh Aghdashloo has a successful acting career. She has appeared in a number of various films and television shows. Her career started way back in 1977. Having been in the industry for quite a long time, she must have earned quite a huge fortune. Her current net worth is however under review. We will update you on the same soon.\n\nShohreh Aghdashloo Husband\n\nShohreh Aghdashloo has been married twice. Her first marriage was in her native hometown Iran. She was 18 when she got married to Aydin Aghdashloo. He was a prominent Iranian painter, writer and film critic. The two did not have any children. They later divorced in 1979 and Shohreh left Iran.\n\nCurrently, the actress is married to Houshang Touzie. He is an actor and playwright. The two got married in 1987. The couple worked together especially in the early stages of Aghdashloo’s career. Shohreh and Touzie are parents to one daughter Tara Jane Touzie.\n\nShohreh Aghdashloo Daughter\n\nShohreh Aghdashloo has one daughter. She is called Tara Jane Touzie. Tara was born in 1989. She has followed in her mother’s footsteps and is a budding filmmaker. Regularly, she accompanies her mother to red carpet events.\n\nShohreh Aghdashloo Movies And TV Shows | Shohreh Aghdashloo Star Trek\n\nMovies\n\n2000 Surviving Paradise\n\n2003 Possessed\n\n2005 The Exorcism of Emily Rose\n\n2006 American Dreamz\n\n2008 The Sisterhood of the Traveling Pants 2\n\n2010 The Adjustment Bureau\n\n2011 Iranium\n\n2013 Percy Jackson: Sea of Monsters\n\n2014 Rosewater\n\n2015 Last Knights\n\n2016 Star Trek Beyond\n\nTV Shows\n\n1990 Matlock\n\n2001 The Honduran Suburbs\n\n2006 Smith\n\n2007 Grey’s Anatomy\n\n2008 House of Saddam\n\n2009 FlashForward\n\n2011 Law & Order: Special Victims Unit\n\n2012 Portlandia\n\n2013 Grimm\n\n2014 Scorpion\n\n2017 The Punisher\n\nShohreh Aghdashloo Awards\n\n2004 Independent Spirit Award for Best Supporting Female\n\n2007: Arpa Career Achievement Award\n\n2009 Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or a Movie\n\n2009 Satellite Award for Best Actress – Motion Picture Drama\n\n2013: Noor Iranian Film Festival Achievement Award\n\nShohreh Aghdashloo Interview\n\nQ: Nowruz Mubarak Shohreh Khanoom…. What is your most favorite Nowruz memory?\n\nShohreh Aghdashloo: The one that my youngest brother Sean was born a couple of hours after the new year. All we could think of was the baby`s arrival while counting numbers to celebrate the New Year.\n\nQ: That is a beautiful memory. What do you think about the power of films to make a difference and change the world?\n\nShohreh Aghdashloo: Films are great sources to educate, illuminate, inspire, ignite ideas and to nurture your imagination, conscious, unconscious, or subliminal.\n\nQ: Why did you choose to open your own theater company when you came to the US?\n\nShohreh Aghdashloo: I was not exactly the girl next door in the early 1980s in Hollywood. After a few unsuccessful auditions, I decided to start a Theatre Company with the help of my husband Houshang Touzie who is a very talented playwright and actor.\n\nQ: You seem so passionate about every role you play… How do you choose which characters you want to play and which ones to pass on? What was your favorite role to date?\n\nShohreh Aghdashloo: I love all my roles. They are like my children. After all, I pick them up with a pair of tweezers. I pick the ones that speak to me, and that are relevant and meaningful and pass on those that do not make sense to me.\n\nQ: I think your audience can sense that. In one interview, I believe I heard you say that you are a fan of Elizabeth Warren. Do you have an interest in politics and do you feel it is important for the Iranian community to get more involved?\n\nShohreh Aghdashloo: Elizabeth Warren is a progressive politician and a true public servant. My major in college was “International Relations”, but my passion is storytelling. I sincerely hope that more and more Iranians will participate in politics.\n\nQ: I agree. You are very vocal in our support of women’s rights – what do you want to say to young Iranian women today?\n\nShohreh Aghdashloo: Continue doing what you are doing. You are the face of the future and our only hope for a better future in Iran. Be yourself and let the world see through you. Be organic, authentic and be visionary.\n\nQ: There are many Iranians that want to find a way to make a difference in the world – do you have any advice to them on how to find their way?\n\nShohreh Aghdashloo: Be yourself and let the world see through you. Be organic, authentic and be visionary.\n\nQ: I love that…let the world see through you… I know you have a few projects you are working on, could you share a little about them?\n\nShohreh Aghdashloo: My movie SIMPLE WEDDING is my first romantic comedy. It is set to be released in September and my husband Houshang Touzie is also in the film. The premiere of THE CUBAN is expected to join the Toronto Film Festival in September as well. Last but not least, I am impatiently awaiting the premiere of Season 4 of THE EXPANSE. We recently wrapped filming in Canada and I am very excited about the new season.\n\nQ: I can’t wait to see all of them…especially Simple Wedding! I love that it is about Iranian weddings and all the love and drama that goes with it. In honesty, I love any production you are involved in. Thank you for taking the time for this interview.\n\nSOURCE: iranian.com"}, {"url": "https://sevenstarbiz.com/shohreh-aghdashloo-biography-age-family-husband-married-daughter-net-worth-voice-movies-shows-awards-and/", "page_content": "Who is Shohreh Aghdashloo? | Shohreh Aghdashloo Biography and Wiki\n\nShohreh Aghdashloo is an Iranian-American actress. Following numerous starring roles on the stage, her first major film role was in The Report directed by Abbas Kiarostami, which won the Critics Award at the Moscow Film Festival.\n\nShohreh Aghdashloo Age and Birthday\n\nAghdashloo is 67 years old as of 2019, she was born on May 11, 1952, in Tehran, Iran. She celebrates her birthday on May 11th every year. Shohreh will be 68 years old on May 11th, 2020.\n\nShohreh Aghdashloo Height and Weight\n\nAghdashloo is a woman of average stature. She stands at a height of‎ 5 Feet 5 Inches (1.65 m). She also weighs 59 kg (130 lbs). Additionally, her body measurements are 38-26-36 Inches. She has black hair and eyes.\n\nShohreh Aghdashloo Family, Parents, and Siblings\n\nAghdashloo was born in Tehran, Iran, as Shohreh Vaziri-Tabar, the daughter of Effie (née al-Sadat) and Anushiravan Vaziri-Tabar. She has three brothers: Shahram, Shahriar, and Shahrokh. Her stage name is from the family name of her first husband, painter Aydin Aghdashloo.\n\nShohreh Aghdashloo Husband, Marriage, and Daughter\n\nThe Iranian-born actress has been married twice. Her first marriage was in her fellow native Iran in 1972. She was 18 years old at the time and tied the knot with Aydin Aghdashloo. Aydin Aghdashloo is a prominent Iranian painter, writer, and film critic. Their union did not produce any children and they divorced in 1979 when the actress left Iran.\n\nThe Expanse star is now married to Houshang Touzie. Touzie is an actor and a playwright. They got married in 1987. The couple collaborated together especially in the early stages of Aghdashloo’s career. They put up several plays that were targeted at Iranians living in the L.A. The couple has one child together, a daughter named Tara Jane Touzie. She regularly accompanies her mom to red carpet events. She has also followed in her parents’ footsteps and is a budding filmmaker.\n\nShohreh Aghdashloo Net Worth\n\nAghdashloo has a net worth of $54 million. She is one of the richest celebrities in Iran and made her fortune from her career in the film industry. It must be stated that the actress is no stranger to wealth as she originally came from a wealthy family in Iran. As aforementioned, Aghdashloo is an author. She released her debut effort in 2013. It is basically an autobiography and is titled The Alley of Love and Yellow Jasmines.\n\nShohreh Aghdashloo Early Life\n\nAghdashloo was born in Tehran, Iran, as Shohreh Vaziri-Tabar, the daughter of Effie and Anushiravan Vaziri-Tabar. She has three brothers: Shahram, Shahriar and Shahrokh. Her stage name is from the family name of her first husband, painter Aydin Aghdashloo. After their marriage in 1972 when she was 19 and he was 31, she began attending theatre workshops, against the wishes of her family. She had always wanted to be an actress, and soon began playing leading roles in Iranian theatre and film. They did not have children and were divorced in 1979, when she left Iran for England at the start of the Iranian Revolution.\n\nOnce she arrived in England, she earned a Bachelor’s degree in international relations at Brunel University because of her interest in politics after having to leave her home country. She was already familiar with England, as her parents had taken her to London as a child. She then continued to pursue her acting career, which brought her to Los Angeles. In 1987, Aghdashloo married actor/playwright Houshang Touzie. They have a daughter, Tara Touzie, born in 1989. She has since performed in a number of Touzie’s plays, successfully taking them to national and international stages, primarily in the Iranian diaspora. Though born to a Muslim family, she never practised the religion.\n\nShohreh Aghdashloo Education\n\nShe earned a Bachelor’s degree in international relations at Brunel University because of her interest in politics after having to leave her home country.\n\nShohreh Aghdashloo Career\n\nHer first major film role was in The Report (Gozāresh) (1977) directed by Abbas Kiarostami, which won the Critics Award at the Moscow Film Festival. Her next film was Shatranje Bad (Chess of the Wind), directed by Mohammad Reza Aslani, which screened at several film festivals. Both films were banned in her home country; but, in 1978, Aghdashloo won acclaim for her performance in Sooteh Delan (Broken-Hearted), directed by Ali Hatami, which established her as one of Iran’s leading actresses.\n\nAfter establishing a theatre and film career in Iran, Aghdashloo moved to England during the Iranian Revolution in 1979, subsequently becoming a U.S. citizen. After several years playing small roles in television and film, her performance in House of Sand and Fog (2003) brought her several film critics’ awards and a nomination for an Academy Award for Best Supporting Actress. She has continued to play supporting and character roles in film and television, including a starring role as Chrisjen Avasarala on The Expanse (2015–present), and won the Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or Movie for her work in the HBO original miniseries House of Saddam (2008). In 2013, she released her autobiography, titled The Alley of Love and Yellow Jasmines.\n\nShohreh Aghdashloo Movies\n\n2020 Run Sweetheart Run\n\n2018 A Simple Wedding as Ziba Husseini\n\n2016 Star Trek Beyond as Commodore Paris\n\n2016 Window Horses as Mehrnaz\n\n2016 The Promise as Marta Boghosian\n\n2015 Last Knights as Maria\n\n2015 Septembers of Shiraz as Habibeh\n\n2014 Rosewater as Moloojoon\n\n2014 Still Here as Farzaneh\n\n2013 Percy Jackson: Sea of Monsters as The Oracle Voice role\n\n2013 Silk as Rani\n\n2012 The Odd Life of Timothy Green as Evette Onat\n\n2011 Iranium as Narrator\n\n2011 On the Inside as Dr. Lofton\n\n2010 The Adjustment Bureau as The Chairman\n\n2010 The No Game as Aunt Laila\n\n2008 The Sisterhood of the Traveling Pants 2 as Professor Nasrin Mehani\n\n2008 The Stoning of Soraya M.as Zahra Khanum\n\n2006 American Dreamz as Mrs. Nazneen Riza\n\n2006 The Lake House as Dr. Anna Klyczynski\n\n2006 X-Men: The Last Stand as Dr. Kavita Rao\n\n2006 The Nativity Story Elizabeth\n\n2005 The Exorcism of Emily Rose as Dr. Sadira Adani\n\n2005 Babak and Friends – A First Norooz as Farah\n\nShohreh Aghdashloo Facts and Body Measurements\n\nHere are some interesting facts you don’t want to miss about Aghdashloo.\n\nFull Name: Shohreh Aghdashloo\n\nShohreh Aghdashloo Age/ How Old?: 68 years old (in 2020)\n\n68 years old (in 2020) Date of Birth: May 11, 1952\n\nMay 11, 1952 Place of Birth: Tehran, Iran\n\nTehran, Iran Education‎: Brunel University London\n\nBrunel University London Birthday: May 11\n\nMay 11 Nationality: American-Iranian\n\nAmerican-Iranian Father’s Name: Anushiravan Vaziri-Tabar\n\nAnushiravan Vaziri-Tabar Mother’s Name: Effie Vaziri-Tabar\n\nEffie Vaziri-Tabar Siblings: Shahrokh Vaziri-Tabar, Shahram Vaziri-Tabar, Shahryar Vaziri-Tabar\n\nShahrokh Vaziri-Tabar, Shahram Vaziri-Tabar, Shahryar Vaziri-Tabar Married?: Houshang Touzie (m. 1987), Aydin Aghdashloo (m. 1972–1979)\n\nHoushang Touzie (m. 1987), Aydin Aghdashloo (m. 1972–1979) Children/ Kids: Tara Touzie\n\nTara Touzie Height/ How tall?: 5 Feet 5 Inches (1.65 m)\n\n5 Feet 5 Inches (1.65 m) Weight: 59 kg (130 lbs)\n\n59 kg (130 lbs) Profession : Actress\n\n: Actress Net worth: USD $54 million Approx\n\nFrequently Asked Questions About Shohreh Aghdashloo\n\nWho is Shohreh Aghdashloo?\n\nAghdashloo is an Iranian-American actress who debuted her role in the film industry in 1977 in the film The Report which won the Critics Award at the Moscow Film Festival. She was established as one of Iran’s leading actresses for her role in the film Shatranje Bad.\n\nHow old is Shohreh Aghdashloo?\n\nAghdashloo was born on May 11, 1952, in Tehran, Iran. She is now 68 years and her star sign is Taurus.\n\nHow tall is Shohreh Aghdashloo?\n\nShohreh is 5 feet 5 inches tall and weighs 130 pounds.\n\nIs Shohreh Aghdashloo married?\n\nAghdashloo first married Iranian painter, writer, graphist, and film critic Aydin Aghdashloo in 1972 and the couple got divorced in 1980. She then married Iranian actor, director, and playwright Houshang Touzie in 1987.\n\nHow much is Shohreh Aghdashloo worth?\n\nShohreh’s net worth is $54 million and she is one of the richest celebrities in Iran that made her fortune from her career in the film industry.\n\nWhere does Aghdashloo live?\n\nBecause of security reasons, Shohreh has not shared her precise location of residence. We will immediately update this information if we get the location and images of her house.\n\nIs Shohreh dead or alive?\n\nAghdashloo is alive and in good health. There have been no reports of her being sick or having any health-related issues.\n\nDoes Aghdashloo have any children?\n\nShohreh has a daughter named Tara Touzie with her current husband Houshang Touzie.\n\nWhy is Shohreh’s voice so deep?\n\nAghdashloo’s deep-sounding voice is natural.\n\nHow do you pronounce Shohreh Aghdashloo?\n\nShohreh Aghdashloo’s name is pronounced as shō-RĀ ÄK-dosh-loo.\n\nShohreh Aghdashloo Twitter"}, {"url": "https://kids.kiddle.co/Shohreh_Aghdashloo", "page_content": "Shohreh Aghdashloo (Persian: شهره آغداشلو, pronounced [ʃohˈɾe ɒɢdɒʃˈluː]; née Vaziri-Tabar (وزیری‌تبار); 11 May 1952) is an Iranian and American actress. Following numerous starring roles on the stage, she made her film debut in Chess of the Wind (1976). Her next two films The Report (1977) and Sooteh Delan (1977) garnered critical acclaim and established Aghdashloo as one of Iran's leading ladies, although the films were banned in Iran itself.\n\nAghdashloo moved to England during the Iranian Revolution in 1979 and then to the United States, subsequently becoming a U.S. citizen. After several years playing small roles in television and film, her performance in House of Sand and Fog (2003) brought her several film critics' awards and a nomination for an Academy Award for Best Supporting Actress. Her other film appearances include The Exorcism of Emily Rose (2005), X-Men: The Last Stand and The Nativity Story (both 2006), The Odd Life of Timothy Green (2013) and Star Trek Beyond (2016).\n\nIn television, she is best known for her roles as Dina Araz in the fourth season of 24 and as Chrisjen Avasarala on The Expanse (2015–2022). For her role as Sajida Talfah in the HBO miniseries House of Saddam (2008), she won the Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or Movie. In 2013, she released her autobiography titled The Alley of Love and Yellow Jasmines.\n\nEarly life\n\nAghdashloo was born Shohreh Vaziri-Tabar (Persian: شهره وزیری‌تبار) in Tehran, the daughter of Effie (née alSadat) and Anushiravan Vaziri-Tabar. She has three brothers: Shahram, Shahriar and Shahrokh. Her stage name is from the family name of her first husband, painter Aydin Aghdashloo. After their marriage in 1972 when she was 19 and he was 31, she began attending theatre workshops, against the wishes of her family. She had always wanted to be an actress, and soon began playing leading roles in Iranian theatre and film. They did not have children and were divorced in 1979, when she left Iran for England at the start of the Iranian Revolution.\n\nOnce Aghdashloo arrived in England, she earned a bachelor's degree in international relations at Brunel University because of her interest in politics after having to leave her home country. She was already familiar with England, as her parents had taken her to London as a child. She then continued to pursue her acting career, which brought her to Los Angeles. In 1987, Aghdashloo married actor/playwright Houshang Touzie. They have a daughter, Tara Touzie, born in 1989. She has since performed in a number of Touzie's plays, successfully taking them to national and international stages, primarily in the Iranian diaspora. Though born to a Muslim family, she has stated that she is non-practicing.\n\nCareer\n\nAghdashloo in 2008\n\nAghdashloo first began working as a theatre actress at the age of 19, when she starred in a theatrical adaptation of the novel The Narrow Road to the Deep North (1973). Aghdashloo made her American film debut in 1989 in a starring role in Guests of Hotel Astoria. Her television debut came on September 25, 1990, in a guest role in the two-hour episode of the NBC television series Matlock, titled \"Nowhere to Turn: A Matlock Mystery Movie\". In the years that followed Aghdashloo appeared on screen sporadically, including in the widely panned Surviving Paradise (2000), written and directed by Kamshad Kooshan.\n\nIn 2001 Aghdashloo was cast opposite Ben Kingsley and Jennifer Connelly in director Vadim Perelman's House of Sand and Fog (2003) for which she was nominated for the Academy Award for Best Supporting Actress. Following this exposure Aghdashloo had a prominent recurring role in Season 4 of the Fox television series 24, playing Dina Araz, a terrorist undercover in Los Angeles as a well-to-do housewife and mother. In an interview with Time magazine, Aghdashloo stated that although she had previously resisted reinforcing the stereotype of Muslims as terrorists, the strength and complexity of the role convinced her to accept it. Iranian film scholar Hamid Naficy criticized Aghdashloo's acting in \"the sensationalist film The Stoning of Soraya M.\" as \"discredit[ing] her vow not to play in films that stereotype Middle Easterners, including Iranians.\" In the period that followed, Aghdashloo made guest appearances on several well-known television series, such as Will & Grace, ER and Grey's Anatomy. She also played supporting roles in films such as X-Men: The Last Stand as Dr. Kavita Rao, The Lake House, The Nativity Story as Elizabeth, and The Sisterhood of the Traveling Pants 2.\n\nIn 2008, Aghdashloo served as an official festival judge at the second annual Noor Iranian Film Festival in Los Angeles, while she also played the lead character of Zahra Khanum in the film The Stoning of Soraya M., marking her first leading role in a feature-length American film. In the same year, she also portrayed Sajida Talfah in the HBO original miniseries House of Saddam for which she received the Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or Movie. Speaking to a crowd of over 1,400 people at George Washington University's Lisner Auditorium on September 12, 2009, Aghdashloo, author Dr. Azar Nafisi, and Dr. Dwight Bashir, Associate Director for Policy at the United States Commission on International Religious Freedom, added their voices to those concerned about human rights in Iran and the persecution of Baháʼís in Iran. Aghdashloo's talk in particular was posted to YouTube. On October 9, 2010, the Public Affairs Alliance of Iranian Americans awarded Aghdashloo their Career Achievement Award during its first annual gala.\n\nAgdashloo continues to act in films, such as The Odd Life of Timothy Green, Septembers of Shiraz and Star Trek Beyond; and on television, guest starring on series such as House, M.D., The Simpsons, Grimm, Law & Order: Special Victims Unit and NCIS. She also voiced characters for the video games Mass Effect 2, Mass Effect 3, Destiny and Destiny 2; starred in the London revival of the play The House of Bernarda Alba at the Almeida Theatre as Bernarda Alba; and narrated the audiobook And the Mountains Echoed, by Khaled Hosseini.\n\nAghdashloo recently starred in Amazon Prime Video's acclaimed television series The Expanse, as UN Deputy Undersecretary of Executive Administration Chrisjen Avasarala, a \"smart and passionate member of a political family legacy who has risen high in the ranks of Earth's governing body without once standing for election\".\n\nFilmography\n\nFilm\n\nYear Title Role Notes 1976 The Chess Game of the Wind / Shatranj-e Baad Lady’s Maid First film role in Iran, directed by Mohammed Reza Aslani 1977 The Report Azam Firuzkui 1978 Sooteh-Delan Aghdas 1989 Guests of Hotel Astoria Mrs. Pori Karemnia First American film role 1991 Raha Raha 1993 Twenty Bucks Ghada Holiday 2000 Surviving Paradise Pari First English language Iranian-American feature film distributed theatrically in the United States, written and directed by Kamshad Kooshan 2001 America So Beautiful Exiled Actress 2002 Maryam Mrs. Homa Armin 2003 Possessed Woman Short film by Shirin Neshat Pulse Woman Mystic Iran Narrator Documentary film by Aryana Farshad House of Sand and Fog Nadereh 'Nadi' Behrani Independent Spirit Award for Best Supporting Female\n\nLos Angeles Film Critics Association Award for Best Supporting Actress\n\nNational Society of Film Critics Award for Best Supporting Actress (3rd place)\n\nNew York Film Critics Circle Award for Best Supporting Actress\n\nOnline Film Critics Society Award for Best Supporting Actress\n\nNominated–Academy Award for Best Supporting Actress\n\nNominated–Vancouver Film Critics Circle Award for Best Supporting Actress 2005 The Exorcism of Emily Rose Dr. Sadira Adani Babak and Friends – A First Norooz Farah Animated film 2006 American Dreamz Mrs. Nazneen Riza The Lake House Dr. Anna Klyczynski X-Men: The Last Stand Dr. Kavita Rao The Nativity Story Elizabeth 2008 The Sisterhood of the Traveling Pants 2 Professor Nasrin Mehani The Stoning of Soraya M. Zahra Khanum Satellite Award for Best Actress – Motion Picture 2010 The Adjustment Bureau The Chairman (Role was cut from finished version) The No Game Aunt Laila 2011 Iranium Narrator Documentary film by Alex Traiman On the Inside Dr. Lofton 2012 The Odd Life of Timothy Green Evette Onat 2013 Percy Jackson: Sea of Monsters The Oracle Voice role Silk Rani Short film by Catherine Dent 2014 Rosewater Moloojoon Still Here Farzaneh Short film by Ethan Rains 2015 Last Knights Maria Septembers of Shiraz Habibeh 2016 Star Trek Beyond Commodore Paris Window Horses Mehrnaz Animated film The Promise Marta Boghosian 2018 A Simple Wedding Ziba Husseini 2019 The Cuban Bano Ayoub Film directed by Sergio Navarretta 2020 Run Sweetheart Run Blue Ivy 2021 Ghostbusters: Afterlife Gozer the Gozerian Voice role; role shared with Olivia Wilde and Emma Portner 2023 Renfield Ella Post-production TBA Damsel Post-production The Alchemist Filming\n\nTelevision\n\nYear Title Role Notes 1990 Matlock Saleslady Episode: \"Nowhere to Turn\" 1993 Martin Malika Episode: \"Jerome's in the House\" 2001 Honduran Suburbs The Honduran Suburbs Zereshk 2 episodes 2004 Secret Service The Secret Service Lila Ravan Television film 2005 24 Dina Araz 12 episodes: Day 4\n\nGold Derby TV Award for Best Drama Supporting Actress\n\nNominated—Satellite Award for Best Supporting Actress – Series, Miniseries or Television Film 2006 Smith Charlie 7 episodes Will & Grace Pam Episode: \"Cowboys and Iranians\" Curious George Hat Salesperson Episode: \"The Clean, Perfect Yellow Hat\" ER Mrs. Riza Kardatay Episode: \"Lost in America\" 2007 Grey's Anatomy Dr. Helen Crawford Episode: \"Scars and Souvenirs\" 2008 House of Saddam Sajida Talfah 4 episodes\n\nPrimetime Emmy Award for Outstanding Supporting Actress in a Limited Series or Movie\n\nNominated—Gold Derby TV Award for Best Miniseries/TV Movie Supporting Actress Simpsons The Simpsons Mina Episode: \"MyPods and Boomsticks\" 2009 FlashForward Nhadra Udaya 3 episodes 2011 Law & Order: Special Victims Unit Detective Saliyah \"Sunny\" Qadri Episode \"Dirty\" House Afsoun Hamidi Episode: \"Moving On\" NCIS Mariam Bawali Episode: \"Safe Harbor\" 2012 Portlandia Nelofar Jamshidi Episode: \"Cool Wedding\" Mob Doctor The Mob Doctor Dr. Lauren Baylor 3 episodes 2013 Grimm Stefania Vaduva Popescu 7 episodes 2014 Believe Mrs. Delkash Episode: \"Origin\" Bones Azita Vaziri Episode: \"The Cold in the Case\" Scorpion Dr. Cassandra Davis Episode: \"True Colors\" 2015 Elementary Liliane Bellerose Episode: \"Tag, You're Me\" 2015–2022 Expanse The Expanse Chrisjen Avasarala Main role\n\n6 seasons 2016 Pearl Arlene TV film 2017 Punisher The Punisher Farah Madani 4 episodes 2019 Lion Guard The Lion Guard Queen Janna Voice role; 4 episodes Impulse Fatima 3 episodes 2021 Arcane Enforcer Grayson Voice role; 4 episodes The Expanse: One Ship Chrisjen Avasarala Webisodes; 1 episode 2022 The Flight Attendant Brenda 5 episodes Archer Voice role; Episode: \"The Big Con\"\n\nVideo games\n\nYear Game Character 2010 Mass Effect 2 Admiral Shala'Raan vas Tonbay (voice) 2012 Mass Effect 3 2014 Destiny Lakshmi-2 (voice) 2017 Destiny 2 2022 The Tale of Bistun Narrator (voice) 2023 Assassin's Creed Mirage Roshan (voice)\n\nAudio\n\nYear Title Role Notes 2004 Inside the Kingdom: My Life in Saudi Arabia Narrator Audiobook 2007 The Blood of Flowers Narrator Audiobook 2008 The Bible of Clay Narrator Audiobook 2008 And the Mountains Echoed Narrator Audiobook 2016 Until We Are Free: My Fight for Human Rights in Iran Narrator Audiobook 2019–2020 The Two Princes Queen Attosa Audio drama\n\nTheatre\n\nYear Title Role Notes 1973 A Narrow Road to the Deep North Empress Kōjun Edward Bond 1975 Madame de Sade Reneé Marquise de Sade Yukio Mishima 2012 The House of Bernarda Alba Bernarda Alba Federico Garcia Lorca\n\nOther awards\n\n2007: Arpa Career Achievement Award\n\n2013: Noor Iranian Film Festival Achievement Award\n\nSee also"}, {"url": "https://deadline.com/2016/03/shohreh-aghdashloo-diversity-middle-eastern-actors-stereotypes-1201722206/", "page_content": "Despite the rhetoric coming out of this year’s political campaigns, Middle Eastern actors are breaking through the stereotypes they have long experienced and are being cast in more substantial roles. Perhaps no one has endured/experienced this more over the years than Shohreh Aghdashloo, who has seen great actors who just happen to be Middle Eastern break out of the “terrorist” roles that they had long only been offered to find real work in primetime and features.\n\nBefore being nominated for an Oscar in for 2003 for her brilliant turn in House Of Sand And Fog, she too was offered only terrorist roles. On the eve of the Persian holiday Norooz (New Year), Deadline interviewed the Iranian-born Aghdashloo about what she has seen happen over the past 25 years and how it has changed now that a real call for diversity has taken hold in Hollywood.\n\nRelated Story 'Bachelorette' Choice Could Be Thorny For Franchise Lacking Diversity In Leads\n\nBefore the audition for her career-changing role in House Of Sand And Fog, she said was offered parts as “a terrorist on a plane, a terrorist on the Earth.” All of them were one-dimensional roles, she said. Hollywood has evolved, but it took years.\n\nTwenty-five years ago it was a different mind-set, and she brought up two experiences to illustrate what she meant. Years ago, a casting agent in Los Angeles (since retired) told her that she ran to a type and she was very limited in the roles she would be able to get; English is Aghdashloo’s second language. In response, she said, “I may be limited in your world, but not in my world.” She kept going to auditions, refusing to give up.\n\nFinally, she was sent to an audition for a popular TV series that called for a Middle Eastern woman. “I was asked to meet with the casting director and when I walked in, I heard the casting director say, ‘No, we are looking for a downtrodden Middle Eastern woman, you’re too beautiful, go home.’ ” So she did, and decided to put to practice what she had told the casting director — see no limits. In other words, she believed she could, so she did.\n\n“I went home, and with my husband Houshang Touzie who is a writer, we started our own Farsi-speaking production company. I found non-union actors — stage actors — who were willing to become part of our group and we started putting on plays and touring around the world.”\n\nTwelve years later came a call from DreamWorks for the role in Sand And Fog. But, the call came after producers actually went into the Iranian community of shopkeepers and restaurant owners in Beverly Hills and Westwood and asked them who their favorite actress was.\n\n“My name was pronounced so many different ways — Abdahloo, Agdaloo — so, when they called me, they said whatever your name is would you like to come audition for the role?”\n\nAfter Sand And Fog, which garnered Aghdashloo a Best Supporting Actress nomination, the actress said she’s never stopped working. She has since spent a season on the Emmy-winning 24, then ended up winning an Emmy for Outstanding Supporting Actress in a Mini-Series or Movie for her portrayal of Saddam Hussein’s wife in HBO’s House Of Saddam.\n\nThe actress, who also works with a non-profit called Mother Miracle in India to help school children, continues to be cast in roles in TV, film, and for voice-overs. But, she admits that she still always keeps one eye on legit theater. “I still do theater,” she says. “I love theater. That is something that I cannot stop doing. I love it. I love it.”\n\nHer film Septembers Of Shiraz, a story set against the backdrop of the Iranian revolution, will get a theatrical release in June via Momentum Pictures. Aghdashloo experienced the Iranian Revolution first-hand during the 1970s.\n\n“Art reflects life and life reflects art. Hollywood has changed tremendously over the years but it took a long time to change. At the time that I was cast in House Of Sand And Fog, American society was just evolving into a more cosmopolitan society and Hollywood was trying to adapt itself where it could,” said Aghdashloo. “Let’s do not forget the years that we went through when the economy started deteriorating because that was another problem. Therefore, they were trying to sell products only in the United States and now everyone is thinking globally. I will never forget Nike’s (adage), ‘Think Globally, Act Locally.’ Now its vice versa. We are a global economy.”\n\nAghdashloo just returned from filming alongside Christian Bale and Oscar Isaac in Terry George’s The Promise — a love story set against the Armenian genocide in the last days of the Ottoman Empire, from producers Eric Esrailian, William Horberg, Mike Medavoy and Ralph Winter.\n\nShe is now also a lead character in Syfy’s The Expanse, playing a powerful politician and master manipulator.\n\nWe asked how she thought such long-standing stereotypes could be broken. “Let’s be honest and logical and reasonable here,” she said. “You can’t blame anyone for wrongdoing. If we want change, we have to change it ourselves. We must change the wrong situation into the right situation and do it the right way. Not nagging, not complaining, not overthinking, not casting a shadow, not blaming people for what they don’t know because they don’t know any better. We can only do it by peaceful co-existence. We cannot blame and fight for our hard times that some of us are going through.”\n\nShe said the last couple of years, especially, she has seen a surge in the kinds of roles all of her Middle Eastern actor friends are getting. “My friends who were only offered terrorists roles are now in primetime roles,” she said. “Most of them have been hired now for pilots. I cannot even tell you how many offers I’ve had for pilots.” And, she said, they are for key and substantial roles.\n\nIn fact, her husband Touzie was in Showtime’s Emmy-winning Homeland, playing Iran’s intelligence chief. Actress Nazanin Boniadi was a fan favorite also on Homeland (there was outcry when her character, Fara, was killed off), and Shaun Toub is on Grimm.\n\n“Everybody has the right to get an opportunity to shine. After all, we are in the land of dreammakers. The expectation is in our DNA whether we believe it or not,” she said. “We are already halfway through the awareness.”\n\nWhen does she think the change began in Hollywood? “I think the change started when the American film industry started to cross-breed and started to make films with other nationalities … it was really slow but started with Bruce Lee and continued with Jackie Chan and now there are so many Asian actors, and that gradually and slowly is now coming to Middle Eastern actors, too. We are now the newcomers.”"}, {"url": "https://healthyceleb.com/shohreh-aghdashloo/", "page_content": "Shohreh Aghdashloo Quick Info Height 5 ft 5 in Weight 57 kg Date of Birth May 11, 1952 Zodiac Sign Taurus Spouse Houshang Touzie\n\nShohreh Aghdashloo is an Iranian-American actress, author, and activist who is well-known for her appearance in the films Gozāresh (The Report) (1977), Sooteh Delan (Broken-Hearted), House of Sand and Fog (2003), and as Dina Araz in 24, Chrisjen Avasarala in The Expanse (2015–2022), and Sajida Talfah in House of Saddam (2008).\n\nBorn Name\n\nShohreh Vaziri-Tabar (In Persian شهره وزیری‌تبار)\n\nNick Name\n\nShohreh\n\nSun Sign\n\nTaurus\n\nBorn Place\n\nTehran, Iran\n\nResidence\n\nLos Angeles, California, United States\n\nNationality\n\nEducation\n\nShohreh graduated with a bachelor’s degree in international relations at Brunel University in the past.\n\nOccupation\n\nActress, Author, Activist\n\nFamily\n\nFather – Anushiravan Vaziri-Tabar\n\n– Anushiravan Vaziri-Tabar Mother – Effie (née al-Sadat)\n\n– Effie (née al-Sadat) Siblings – Shahram Vaziri-Tabar (Brother), Shahriar Vaziri-Tabar (Brother), Shahrokh Vaziri-Tabar (Brother)\n\nManager\n\nShohreh is represented by Creative Artists Agency and Tamara Houston at Roundtable Entertainment in the United States and by Roger Charteris at The Artists Partnership in the United Kingdom.\n\nBuild\n\nSlim\n\nHeight\n\n5 ft 5 in or 165 cm\n\nWeight\n\n57 kg or 125.5 lbs\n\nBoyfriend / Spouse\n\nShohreh has dated –\n\nAydin Aghdashloo ​(1972-1979)​ – Shohreh tied the knot with Iranian painter, graphist, art curator, writer, and film critic Aydin Aghdashloo in 1972. She was just 19 at the time, whereas, her husband was 31. The couple did not have children together and legally parted ways in 1979. Houshang Touzie ​(1987-Present) – Actor and playwright Houshang Touzie married one another in 1987, with whom she has a daughter named Tara Touzie (b. 1989).\n\nRace / Ethnicity\n\nWhite\n\nShohreh has Iranian ancestry.\n\nHair Color\n\nDark Brown\n\nEye Color\n\nDark Brown\n\nSexual Orientation\n\nStraight\n\nDistinctive Features\n\nWide smile\n\nDroopy cheekbones\n\nShohreh has an attractive husky voice.\n\nShe often portrays well-educated, sophisticated professionals.\n\nShohreh Aghdashloo Facts\n\nShe had developed an interest in acting at an early age. However, her family did not want her to pursue a career in acting. Shohreh only started attending theatre workshops after her marriage to Aydin Aghdashloo. Shohreh relocated to England from Iran in 1979, at the start of the Iranian Revolution. She was already familiar with England as Shohreh and her parents had previously been to London as a child. She was only 19 years old when she made her first-ever acting appearance in the theatrical production of the novel The Narrow Road to the Deep North (1973). Shohreh made her debut Iranian language theatrical film appearance in The Chess Game of the Wind in 1976. Later, in 1989, she was cast in her first American theatrical film, Guests of Hotel Astoria as Pori Karemnia. Her passion for acting brought her to Los Angeles, California. After having left Iran, Shohreh started to take an interest in politics, hence, pursuing her bachelor’s degree in international relations. She is very fond of the taste of chocolate and Coca-Cola. Shohreh was brought up in a family of the Muslim religion. She has since denounced her practice of the religion. Her film credits include The Exorcism of Emily Rose (2005), X-Men: The Last Stand, The Nativity Story (both 2006), The Odd Life of Timothy Green (2013), and Star Trek Beyond (2016). She has had rhinoplasty in the past. Shohreh is the first Iranian actress to cross into mainstream Hollywood cinema and to be nominated for an Oscar. She is close friends with actress Marcia Gay Harden. Shohreh and British-American actress Frances Fisher were born on the same date. She won the Primetime Emmy Award for “Outstanding Supporting Actress in a Limited Series or Movie” for her work as Sajida Talfah in the HBO miniseries House of Saddam in 2008.\n\nFeatured Image By Gage Skidmore / Flickr / CC BY-SA 3.0"}, {"url": "https://www.rottentomatoes.com/celebrity/shohreh_aghdashloo", "page_content": "Highest Rated: 100% Chess of the Wind (1976)\n\nLowest Rated: 16% Last Knights (2015)\n\nBirthday: May 11, 1952\n\nBirthplace: Tehran, Iran\n\nThe star of a number of politically controversial feature films in her native Iran during the 1970s, actress Shohreh Aghdashloo had to wait another 20 years before she resumed her career momentum with acclaimed screen performances in American films and television. At the age of 51, she emerged onto the international stage with her Oscar-nominated supporting performance as the wife of a former Iranian military officer reduced to working-class status upon the family's immigration to America in \"House of Sand and Fog\" (2003). From there, the actress was cast in many roles as highly educated, sophisticated professionals on primetime dramas and in films, including \"X-Men: The Last Stand\" (2006). Aghdashloo also maintained a commitment to Iranian social and political issues with productions like \"Maryam\" (2002) and \"The Stoning of Soraya M.\" (2008), which showcased her powerful screen presence and a versatility that helped break down the Western screen's limited notions about Middle-Eastern life and women."}]}